{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "I have been here several times long time ago I ordered Veal Cutlet was so good but today I ordered the same was awful taste n overcooked. French fries were stale. I'm disappointed! I am not coming back!", "author": "Linda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-13", "description": "I am of Polish decent, and this restaurant has some of the best Polish food I have tasted (including Chicago). I got the Polish platter and a half order of blueberry blintzs (1 blintz).  The saurkaraut had bacon and mushrooms and was not too sour - it was in fact superb. The pierogies were great as was the kielbasa (although in a very small portion). The stuffed cabbage was more meat than rice and very solid and flavorful.  However, what really bowled me over was the blueberry blintz - it is as good as it gets and the best anywhere in the US. The whole bill was less than $20. Service was neither slow nor fast.  No complaints whatsoever.  This is my go-to restaurant for an everyday meal in Brooklyn Heights!", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "hidden gem on montague street.\nThe pierogies, all of them, sweet, potato, mushroom and potato cheese - were AWESOME!\n\nThis place is a must visit for anyone that is in the area for court of otherwise.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "It's really really good to have a hot soup in such cold weather! And the soup here is really delicious! I ordered \"trip soup\" this time, and it really surprised me, because it's rare to see soup with homeycome tripe in US, and it warm all my body! My girl friend ordered chicken soup and it tastes light and comfortable! I also ordered fried pierogi with combination flavors, it's  great as well!", "author": "Yu-chih L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-08", "description": "This is the second time I have had brunch at Teresa's. The service is solid, but the food is awful.  I don't think I have had a more disappointing meal in New York.  Never order the eggs florentine - it is bland and served on wonder bread.  How foolish I was to return to this restaurant.  The location is lovely, yet the food is lousy.  Even the coffee is horrendous.  The drinks aren't done well either.  What a shame... I really wanted to like this place because of it's convenient and picturesque location.  I was hoping my first visit was just a fluke, but it's simply not happening.", "author": "Lorena H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-12", "description": "Can't even rate the food because we were seated at a table and waited 20 minutes before leaving. Busboy refilled our water twice before anyone came back. after15 minutes in we asked the waitress to order and she told us to wait. Rude and not organized.", "author": "Quinn J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-27", "description": "I lived in Brooklyn Heights during the summer of 2012, so it being my first time on the East Coast, I got lured into the whole ideology of \"brunch on the weekends.\" On a random weekend, thanks to Yelp, I found Teresa's Restaurant, which it was a sigh of relief since it was literally a few blocks from my place. My friends and I rejoice!\n\nI been here a totally of three times which each visit seemed like the experience of eating there was going downhill...\n\nThe first time it was awesome. You definitely can't beat the brunch special of $13.50 and their ricotta pancakes (so good). My friends and I really enjoyed our afternoon there.\n\nThe second time a different friend that didn't previously come with me to the restaurant and I came super early in the morning to have breakfast. To my suggestion, we both just got ricotta pancakes, which were of course good. As we had already paid and was leaving, I noticed the waitress made a rude comment how I didn't tip her good enough (because okay, you should be getting a $20 tip on a $8 tab...). \n\nThe third time coming, I was visiting with some friends from California which I was ecstatic to take them out to brunch on the East Coast. While Teresa's wasn't my first option, due to time constraints, I figured it would be the best option. Everything was going good and everyone was really enjoying their food until one of my friend's found a piece of sharp plastic in their ricotta pancakes (which I suggested for them to order). It was somewhat awkward just because my friend tried to play it off and make it seem like it wasn't a big deal but quickly he pushed his food to the side and refused to eat anymore. When I personally brought it up to one of the waiters, they themselves seemed pretty dumbfounded and quickly took the plastic piece away. I am pretty sure if I didn't bring it up the second time, they wouldn't had did anything to compensate my friend.\n\nDuring the last visit, as I was staring at their window, I thought to myself, \"No wonder they have a B grade.\"\n\nFor sure not coming back.", "author": "ML S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Delicious and inexpensive polish food - pierogies, blintzes (which are huge), borscht, sauerkraut and kielbasa. You can order a bunch of things for the table to share because the prices are so reasonable. The crowd is old school too, which makes it feel more authentic.", "author": "AJ S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-30", "description": "Good orange juice. Worst French toast. Staff was slow/inattentive. But were nice to comp it at least. Agree with previous posts. Area is nice.", "author": "Sunny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "This place is the perfect spot to have a laidback Brooklyn Heights brunch. My friend and I ordered the \"Brunch Special\" which was delicious and amazingly cheap.\n\nI hat potato soup and eggs florentine.  My friend had a chicken sandwich and borscht. We both loved our dishes! For dessert we had coffee with delicious coconut key lime pie! Our brunch special came with a choice of one drink: bloody mary, screwdriver or mimosa. I got the screwdriver and my friend got the mimosa. Both drink were strong which we liked.\n\nOur waiter was super-nice and made us feel welcomed. However it was hard to get her attention because she was so busy. The kitchen messed up our order but the waiter was apologetic and fixed it.", "author": "Jimmy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "I live in the neighborhood and recently stopped in Teresa's for lunch.  First time here I had the stuffed cabbage and cold borscht soup.  Both were great.  Had it with a side of kasha...a wheat concoction that was very good.\n\nToday had lunch there with the husband.  He had kielbasa and sauerkraut with chicken soup. He said it was great.    I tasted the sauerkraut and am now bugged to figure out how to make it....it was so good.  I had the turkey sandwich...not so great.  It was dry, but the Ukrane borscht soup it came with was hot, not the cold version, and was absolutely delicious.  \n\nDidn't have trouble with the service.  I would agree with all the other posts when they recommend to stick with their European specialties....that's what they do best.", "author": "Susan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "Old school Polish diner in Brooklyn Heights 1 block from the Brooklyn Promanede.  Get the fried assorted perogis and super filling and crispy on the outside savory on the inside potato pancakes.  Try the Lazanki.  Eggs benedict with pesto and hollandaise is hevenly.  I'll get my order to go and walk one block to the promanede and have my meal while enjoying the NYC skyline.", "author": "Jing K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-12", "description": "+ Good menu of Polish food\n+ HUGE portions\n+ Friendly owners and staff\n\n- Restaurant ambiance and interior reminds me of Ihop\n- Should have ordered something more \"Polish\" (The chicken with mushrooms was delicious, but nothing special.)", "author": "Alice T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "This is the only Polish restaurant in Brooklyn, New York.  I liked the pastrami sandwich as a main course, and a piece of chocolate mousse cake for dessert.", "author": "Ilan F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "Why can't we give zero stars??? It's so needed here. Where to start? The waitress could smile or say \"hi\" at least once but chose not to, and perhaps she should call out if she hates her job today? Theres no drink menu even though they have liquor which the personality-challenged waitress finds perfectly acceptable (and she won't give any suggestions about what's good when asked). No bread at the beginning even though other servers gave it to their tables and the staff said it should be the norm.  One of our orders came cold and tasteless but the other - and the only reason we sought this place out - was beef stroganoff and apparently it doesn't come with noodles.  Perhaps that should be told to those who order it? But then customer service is not on the menu here so no luck. I can't remember the last time I asked for a manager at a restaurant and left without eating, but today was that day. Don't come to this place - save your money and stay home, give yourself dirty looks and curt answers, and serve yourself old microwaved food.", "author": "Roman S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-07", "description": "I only come here for two things and Teresa's does both very well.\n\n-Pierogies: I prefer the cheese or potato pierogies pan-fried to add crispness and with sauteed onions. They're so good.\n-Blintzes: The plum ones are perfect and they're nice and crisp. These are great for breakfast, a snack or dessert and you get two big ones for your money.\n\nMy only complaint about this place is that the patio is too small and usually packed with little room to maneuver.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-12", "description": "This is on service only, as I didn't get to try any food. Was seated outside (about 10 tables outside) and never got a server. Waited for over 15 minutes. When I finally flagged down a server, she waved me off, as apparently she wasn't our server, and said she'd send someone. Nope. She sent someone to serve the table next to us (who had been waiting longer) and ignored us. We left after that.", "author": "Maura T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "One of the best brunch deals in Brooklyn Heights. If you like coffee, an alcoholic drink, an appetizer, and an entree all for under $15, this is your brunch spot. The summer borscht is excellent, however, the beet borscht is only offered in the cold variety.", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "I have been grabbing food from Teresa's for the past 10 years and they are always consistent for their Polish Specialties.  This is one place you can get a hot bowl of White Borscht soup which comes with a half of a boiled egg and the kielbasa. Their pierogis are pretty good too.  Overall if you are looking for home cooking less than $15 then you found the place.  The service is not stellar, but it's a reasonable menu.", "author": "Jaime D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "This is like Veselka on crack! \nDon't bother with a meager omlette. Bypass the turkey sandwich, silly.\nGo right for what they do the best; Eastern European home cooked goodness. \n\nWhen you ask the waitress with the heavy Ukrainian accent if the Goulash is good and stops, stares at you, smiles and says; \"It es very good\". Don't hesitate.  \n\nWe had:\nPirogis - boiled (my preference); a mixture of 4. My favorite was the mushroom and sauerkraut. \nVeal Goulash - yes, i know. baby cows - bad. But oh man was this one flavorful, rich, amazing dish.  Oddly it comes with a side of french fries. so not necessary.  I got it with noodles.  Big enough to share!\nStuffed Cabbage lunch special - which i choice to have with mashed potatoes.  Sublime, perfect texture, excellent flavor. \nChicken noodle soup - i would crawl over the bottom of the East River on my death bed to come back for a bowl of this. \n\nYes, the service is a little absent, but just ask for what you want and they are happy to give it to you. Besides at these prices what do you want? great food AND excellent service.  c'mon!", "author": "Darcey H."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}