{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-19", "description": "For the time I worked in Brooklyn Heights, Teresa's Restaurant was always a lunch treat.  \nI especially like: \n(1) egg noodles with ham, mushrooms and scallions \n(2) cheese, potato and meat pierogies\n(3) chicken noodle soup\n(4) pea soup\n(5) fried potato pancakes with applesauce\n\nModerately priced (lunch special), good seating, eclectic waitstaff and clientele.  Not too uppity.", "author": "Liz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "As others have mentioned, this is a great breakfast/brunch place.\n\nOne of my favorite breakfast item there is the Orange Ricotta Pancakes.  So fluffy and I love the essence of orange in the mix.\n\nThey also have a great Polish and other Eastern European fare.  Blintzes and not overly sweet and delicious.  So are their pierogies (I prefer mine fried with onions).\n\nI haven't tried a lot of their entrees, but Chicken Marsala was delicious as was the Polish Kielbasa.\n\nThey get crowded so try going a little early (before 10:30am) if you don't like to wait.", "author": "Jin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "I'm a regular here. Basically you get a lot of good, home-cooked Americanized Eastern European food here. I think they're the only ones to serve food of its kind in this part of Brooklyn. (In Greenpoint, it'd be much cheaper, but more authentic and way grumpier service) but at least it's available if you are dying for pierogies or kielbasa in the Brooklyn Hts area. Their vegetable soup is fantastic - it has that homemade taste with fresh dill. The apple turnovers are great. I always order the kasha with gravy when I come for dinner.\n\nThe only reason I can't give this place 5 stars is b.c. I have experienced the crappy service from time to time (it's 2 scrawny boy waiters who are generally the guilty ones - just avoid them) I don't take that too seriously though; my perspective is one of Teresa's basically being a diner, and I've never been to a diner that didn't have it's share of staff with odd personalities (not to say all the staff is) so take it with a grain of salt. Try to focus on the decent food and un-diner-like ambiance of soft lightening, nice wood paneling, and many senior citizen regulars....If you take 1/2 your meal home, it's a bargain, and I guarantee you'll still be full.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "Thanks to the recommendation of a helpful mail carrier we wound up at Teresa's for lunch after a brisk walk across the Brooklyn Bridge from Manhattan. We had a very tasty and comforting meal of stuffed cabbage, potato pancakes, pierogi's, cream of mushroom soup and shaved beets. We loved everything but if we had it to do over again we would skip the potato pancakes and save room for the blintzes that looked amazing. I have never liked stuffed cabbage but this one was a game changer for me. Mild yet so flavorful. The service was a little slow but the food came out quickly and piping hot.", "author": "Susan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-12", "description": "This is a diner, but with a nice non-diner interior.\nIt looks like a nice place from the outside.  But when you sit down at the table and see the wine list on an a-frame menu with $5 Mondavi as the top of the line...it's a bad omen.\n\nWe ordered chicken \u0026 the vealmeatballs.  The veal balls were bland \u0026 the sauce was dill to the extreme - just not good.   Chicken was burnt.  The veggies that came with it also were just bad.  \n\nThe worst part of the experience was the BAD SERVICE.  \"Know what you want?\" was the greeting.  Waiter never checked to see if things were okay once we got our bad food.  We went 20+ minutes after we were done eating before we flagged someone else down to get the friggin check.  The waiter spent all his time chatting at the bar \u0026 was always grumpy when he spoke to us.  Miserable experience.  A waste of $40.  \nWhy is this getting 4 \u0026 5 stars from other yelpers?  \nMaybe I just went on a bad night?  I'll never know...try it at your own risk.", "author": "jerri b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "Service is good.  Nice Garden Vegetable Omelet (more like a Frittata). One of the best Eggs Benedict in these parts.", "author": "Stuart L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-08", "description": "I live in the hood and have been coming here for the past 5 years.  Dinner specials from Monday to Thursday is a good value.  Home cooked style food.  My only complaint is the service.  It is consistently lousy.  The waiters and waitress usually hangs around the cash register chatting with each other.  You have to wave your hand for refills of water or coffee.  If you expect proactive service, you will not find it here.  There is a high turnover rate of help.  Seems like most are new immigrants and this is their first job.  I have mixed feelings about this place each time I go.  While the food is consistent in taste, the service is also consistently poor.", "author": "Todd S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "I love Teresa's for brunch.  In the years I've been going, I don't think I've ever eaten a lunch or dinner menu item.  \n\nLove love love the cheese blintzes (in summer the blueberries are fresh!).  Coffee is also very good, not old or burned tasting.  Latkes = nom nom nom.  \n\nService is consistently sub-par.  Maybe it's a European thing.  Empty coffee cup = give me some coffee!   \n\nOverall: not fancy, relaxed casual breakfast, not expensive, good food outweighs the poor service, very crowded weekend mornings.", "author": "Kate T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-13", "description": "Had the orange ricotta pancake, pretty good, but a bit one noted. A orange, lemon, grapefruit trio with some mint on top would be nice.", "author": "Lk W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "and service still sucks. why oh why is it impossible for them to get a basic delivery order right??? i just ordered two chicken noodle soups. one small one large. i said several times..no chicken for the small and extra bread and spoons. i gpt NO noodles and all chicken in the small and one piece of bread. Seriously,  I am a masochist for ordering from them when i know I will never get what I ask for", "author": "Milly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "Came here with my Grandma on a blustery Sunday afternoon. There were plenty of people but it wasn't packed and we grabbed a table right by the windows. It took a while to get a waitress to come over but she was very nice when she finally arrived and quickly took our orders. I had myself some amazing cup of white borscht (only available on the weekends) and a small order of  pirogues (two cheese two potato) and my Grandma got mushroom and barley soup (which was fantastic) and a cheese blintz (which was gigantic and also delicious). Everything was tasty and the coffee was warm. I'll definitely be back for seconds.", "author": "Casey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-26", "description": "Teresa's has the best brunch in Brooklyn Heights. Nuff said. Excellent value, fantastic home fries and delicious 3-egg omelets. Have been here several times as I live in the neighborhood.. this is my go-to brunch spot. Other places charge more for less. If you're interested, this is a full Polish restaurant and you can try and of their traditional delights.", "author": "Joshua G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-24", "description": "Went with a party of six for dinner at this polish restaurant near Brooklyn Heights.  We sat outside and the environment was great.  Tables were not that comfortable, bu the staff never rushed us, even as the outside seating seemed premium.\n\nThe menu as very eclectic, with a mix of traditional American selections such as turkey sandwiches and hamburgers combined with eastern European selections such as borscht and goulash.  Important to note that most of the dishes use heavy cream in the sauces, if you are trying to keep kosher.  We had a couple plates of the chicken marsala, which were HUGE and very tasty, if a bit oily.  For sides, we had salads (which were nothing but ordinary dinner side salads), and a mix of potatoes and pastas.  The sides were all unmemorable, with the exception of the beets.  They were amazing!  I could have eaten a gallon of them.  The cold borscht was so-so, and they steak was mediocre.  The waitress mistakenly told us that there was no cream in the stroganoff, only to later correct herself, and that the steak was pork when it was really beef.  Seemed to be a language thing more than anything, and her thick accent only added to the Polish atmosphere, so we didn't mind too much.\n\nBut, the real draw at Teresa's are the blintzes!\n\nWe ordered three blintzes, two with fresh blueberries, and they were incredible.  About 6-7 inches long and stuffed with cheese and berries.  Would have given Teresa's 3 stars, if not for the blintzes.\n\nIn all, we would probably go back and try more of their specialty dishes such as the stroganoff, goulash, and pirogi.  But, be sure to get the blintzes for dessert.", "author": "Jason H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "Delicious omellete! Love the polish sausage too. Coffee was fresh and European bold-yum... Service is a bit cold but food is worth it. Has outdoor seating to people watch.", "author": "Kenna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-01", "description": "Sometimes just being in Brooklyn Heights makes it feel like I've left New York to somewhere just a little slower and quieter.  So, so nice.  Teresa's is like going to your Polish grandmother's house (or at least your friend's Polish grandmother's house).  I'm torn, I've been here for dinner and it was good.  The cabbage rolls are excellent, and nothing disastrous happened ... till I went for brunch ...\n\nThere should definitely have been more berries on the waffle, and we shouldn't have gotten a dirty look for asking for whipped cream.  Don't waffles always come with whipped cream?!?  And should they be bringing me my \"mayo on the side\" in that squeeze bottle from the kitchen?  wtf.  It was like being in one of those weird warped movies where everything you thought was normal is not.  Also, don't except your water glass to ever be refilled.", "author": "Jen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-09", "description": "Well, I was all set to give this Polish diner five stars, and then I read nic f.'s review and felt slightly ill (gangs of mice? really?). \n\nSo, despite a great breakfast and fast service (sorry, jerri b.; I've never encountered the bad waitresses you have), I'm demoting Teresa's to a four-star rating because of a rodent rumor. What can I say? I'm easily swayed.\n\nBut still, Teresa's serves up some fine food. The spinach blintzes are my favorite -- cheesy and fried to perfection. They also make a mean eggs benedict platter. Oh, and brace yourself, the drinks are strong (for $12.95 you can get brunch, a cocktail, and coffee). I'm often buzzed after one bloody mary (not that I'm complaining).", "author": "Krissy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-23", "description": "I really don't have much to say about this Polish diner in Brooklyn, so here's the skinny:\n\nPros:\ndecent breakfast\nreasonable prices\ngenerous portions\n\nCons:\ntoo many tables for comfortable seating\ntoo much ice in Bloody Mary\nno 1/2 \u0026 1/2 for coffee - only milk.", "author": "Rene D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-27", "description": "Something decent on Montague? Yeah, right... \n\nThat's probably what you're thinking. But you would be wrong this time, because Teresa's is just plain awesome. \n\nMy girlfriend and I love to have lazy Sunday afternoon brunch dates here. We're always pleasantly surprised by the very friendly service and even more surprised at how inexpensive it is. I'm very fond of the omelettes and the sausages. My girlfriend loves the Pirogies, and we have very high standards when it come to Eastern European food.\n\nCome on a sunny day and ask to sit outside- it's a real treat!", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Authentic Eastern European cooking.  Relatively inexpensive and great blintzes, stuffed cabbage, liver and onions, pirogis.", "author": "Mark I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-09", "description": "Teresa's is good ,especially if you have a combination of people in the mood for Polish food and some wanting something more typical of a diner for breakfast or brunch.\n\nMy wife's favorite is the Hungarian Pancake.\n\nGood, non-gourmet diner experience in Greenpoint!", "author": "James E."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}