{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "I love this place.  Great Polish food at great prices.  Police Commissioner Kelly apparently does too because I bumped into him there!", "author": "Scott C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-10", "description": "We went to Teresa's after finding it on Yelp the other night. The food was ok (not great, but mediocre) a bit lower than what we expected from its  3.5 star rating in Yelp . What resulted in the me giving 1 star rating was the way the waitress behaved when she brought the check. Our total check was about $46 which I paid by credit card. She came back already charged my card with an 20% tip. When I asked her why she added the tip on her own and not asking me first and the fact that we were only 3 people and it is customary to charge parties of 6 or more with %18 tip, she said \"lots of tourists come here and they don't know they \"must\" tip! So whenever the bill is over $50, we add the 20% on our own!\". This was the first time over the last 20 years I heard such a lame excuse. Our bill wasn't even $50 and wasn't the subject of her own made-up rule! She didn't even offer to take the tip off and leave it to me to tip whatever I want. She was rude and arrogant. I din't argue with her, but I won't definitely go there again!", "author": "Iraj S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-10", "description": "The food is bland on a good day.  Inedible on others.   I have been here 4 times.  When there was problems with the food, the staff was completely unresponsive.  I will not be going back.", "author": "Dane O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-02", "description": "This place is so warm and cosy, and the decor provides a nice contrast to the trendy, more transient places around Brooklyn heights.  Go for the fried perogies and the APPLE FRITTERS are to die for!  If you need a hearty substantial meal (with lots of fried options), this is the place to check out.", "author": "Zen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-30", "description": "Love the perogi, fried with onions, and the french fries. Artery clogging goodness.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-03", "description": "I like this place.  It's crowded, busy, loud and tasty.  That being said, don't come here looking for some culinary masterpieces, because that's not what you'll get.  What you'll eat is some great, simple, delicious brunch and polish fare.  Much better than the place next door, or the diner down the street.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "We lived in Greenpoint for over 2 years and Teresa's polish fare is better than any I had in Greenpoint (for maybe a few more dollars, but totally worth it and totally reasonable). We went for Chanukah after reading online reviews of latke recommendations. The latkes (potato pancakes) were different then any I'd had before. Smooth almost creamy on the inside and crispy crunchy golden brown on the outside. Also the apple sauce there is delicious! The perogies were very good, though go for the potato and mushroom and sauerkraut ones. The kielbasa was amazing and my husband said the sauerkraut was the best he'd ever had. Everything everyone had around us smelled delicious and the portions were large. It's a cute warm atmosphere near the lookout in Brooklyn Heights. We had a lovely evening for under $30 and were stuffed.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-15", "description": "teresas is our faithful brunch and occasional dinner standby. \nmy children enjoy the pierogis, my mr. unlucky enjoys the blintzes \nand kasha. i love the white borscht. sadly i  tried to duplicate it much\nto my families chagrin. suffice it to say i will avoid that  type of pathetic\nblunder again. an added plus is that the coffee is ept and the service\nis ruthful.", "author": "bridget e."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-20", "description": "We walked the Brooklyn Bridge from Manhattan to Brooklyn Heights, this is a must do while in NY. Since it was late we decided to have dinner at Teresa's Restaurant; the portions were big and the staff friendly.", "author": "Gigi W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-21", "description": "An old neighborhood favorite that's been around for decades. Simple hearty eastern European (Polish) fare is like the way your grandma made. I returned here for the first time in 15+ years but nothing has changed.", "author": "Anonymous M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-02", "description": "full disclosure: i lived in the apartment directly above teresa's and (sorry kids) the kitchen's ever-present gang of mice would run upstairs through the wall and squeak out in my bedroom to have a party. \n\nbut the food is actually pretty good.  great brunch, it's reasonable (especially for the neighborhood) and they give you enough food to feed a small army.  teresa herself is super particular about who she hires and you can tell:  they're all nice and incredibly gifted at multitasking.\n\ndinner is particularly good when it's 10 degrees outside and you can't feel your extremities.", "author": "Nic F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-30", "description": "Food alone- I would give 5 stars but our waitress was so terrible, I have to take it down 3 stars.  When asking questions about the menu, we were met with eye rolls and huffs.  Finally, after being ignored the whole meal, we placed her tip on the table after paying for the check with exact change.  She misunderstood the scenario and confronted us with the lack of tip, only to be told it was on the table.  If you have a thick skin and can tolerate a hostile environment, come for the great polish food.  Otherwise, look elsewhere.", "author": "Rebecca M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-20", "description": "This is by far our favorite and most frequented neighborhood restaurant.  They serve reasonably priced, generous portions of food that tastes homemade but not too greasy -- a great substitute when you can't exactly get to your grandmother's house when you're craving her cooking.  Just think of it as adopting an Aunt Teresa that lives just down the street and always has something delicious cooking on the stove. :)  Everything the friendly staff has recommended has been great, but our all time two favorites are the Portobello mushroom salad (huge portions!) and beef goulash (try it with noodles and beets).", "author": "Alicia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-11", "description": "I recently read an article about the actor Paul Giamatti that mentions that he eats here, so it must be cool, right? I always get the Polish food here, but they have an extensive menu with all the diner classics. Stuffed cabbages, pierogis, sauerkraut, and kielbasa are great. I also like the white borsht, a hearty soup with chopped kielbasa in it that bears no resemblance to red borsht. Portions are enormous and the prices are very cheap.", "author": "Neilson A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-21", "description": "Great place for brunch...we had such a hard time deciding on what to eat, that we were total gluttons and ordered three entrees for the two of us.  Normally not too much of a problem, but you get so much food I was having the \"starving children in china\" guilt flashbacks from childhood.  I would definitely order the brie omelet and cheese blintzes again (though maybe not at the same time the next time around).", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "I actually went here to meet an old teacher of mine for lunch and the food was very good. It's actually very familiar food to me, I mean blintzes and Kielbasa , I've had before but I usually hate coleslaw and Sauerkraut , but I really loved it here!The atmosphere was very cozy and a little old world which really set the mood. Polish food is not for light eaters and the lactose intolerant. So come here hungry!! I'd love to go here again!!", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-05", "description": "It had several years since we had been Teresa's for breakfast I we were reminded why this past weekend. The food is terrible! I mean really, really bad. Perhaps the Polish items are good but standard breakfast fare including eggs, potatoes and pancakes were truly awful. It might have been just bad if the service hadn't been, but was, equally awful. The waitstaff was rude and clustered in the corner gossiping. I really don't know how this place has stayed open for as long as it has.", "author": "Christi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-27", "description": "I found this place by poking my head in (my friends said \"Its probably expensive\") and seeing a gaggle of the elderly.  AWESOME.  Not expensive (our grandparents do not overpay for food.)  Unfortunately the older clientele means the food can sometimes be bland, but the salads are delish (and seem to never end!) and so are the perogis.   Oh and they are open pretty late - 10pm? I'm giving this four stars because breakfast is supposed to be very good - I've only gone for dinner.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-06", "description": "Great place for Sunday brunch. Or anytime, really because of their all day breakfast menu. Great prices, large portions, fresh coffee.", "author": "Chippers T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-11", "description": "Perogies were incredible! We had the cheese... Beautiful thin pasta dumplings pocketing the perfect cheese surrounded by sweet onions. Potato pancakes too greasy but huge (3 in a half order). Apple blintz was good (half order was large - full order is two large pieces). I'd recommend the cheese and spinach blintz as it had more flavor. Was surprised the apples weren't more sweet. I'd highly recommend coming here for the perogies alone!", "author": "Cari C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}