{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Three words: Mushroom Barley soup! \nI love Polish Diners. This my kind of food.  Any nationality who thinks it is a good idea to mash potatoes and then stuff it inside a noodle, saute it in butter and onion is good by me! Long live the Poles!", "author": "Alison P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "I had the worst service ever and it was from an older woman. You would think that older people are much nicer. She was rude and nasty to me and gave me really evil looks and called me a 'b' out loud!! It was so obvious that was talking about me in her language to the other waiter because of the looks I was getting!! I felt very uncomfortable. This is All because I ask her to check on my order after seeing everyone else that came in after me were being served. The only great thing about this restaurant is the tall kid that showed me to my table . He was very nice. The food was good too although it took a while. I had no appetite at that time because of this woman's negative vibe! I am usually a big tipper but it's sad to say that she didn't deserve any. Shame .", "author": "Rose G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "It's good but, not the best. I love Polish food and at Teresa's you will find good food. The pierogis are great. I like them fried rather then boiled. The Kielbasa is great. The reason for the four starts rather then the 5 is the sauce they use on the stuffed cabbage. To me, it's only ok. My favorite Polish place is called \"Krakowiak\" in South River, NJ. That by far is the best but, if you can't make the drive to Jersey then Teresa's is the best I've found. I will keep looking because I love Polish food. If you know of a good Polish place, send me a message and I'll check 'em out.", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "At first glance at the menu, I was a bit put off by the focus on Polish fare.  Don't get me wrong, I'm quite open minded about food, but I just wasn't in the mood.  I immediately saw that they were offering a brunch special with choices for appetizer (I had chicken soup, but they also had fruit and I think salad as options), entree (I had Eggs Benedict, they had Eggs Florentine, spinach blintzes, French toast, etc on the menu), a Bloody Mary (also had choices of Mimosas, and a couple other alcoholic drinks) and tea (or coffee) all for about $15.  Not bad!!!  Although the eggs were swimming in Hollandaise (something I'm normally opposed to) the sauce was really delicious and well worth the extra calories I ingested in attempts to finish it off!  \n\nThe only downside was the service.  They forgot my friend's cantaloupe and my other friend's side of kasha.  Our waiter was not the friendliest and seemed like he had better things to do than serve us.  He also brought out my tea before my entree arrived and while I was enjoying my Bloody Mary, which meant the water was lukewarm by the time I drank the tea.  I didn't care enough to make a big deal.  Besides, he was barely around our table long enough for me to send it back.  In any case, the food was worth it, and sitting outside was really enjoyable on such a lovely day.", "author": "Victoria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "Great Perogies! Fry Them (got them boiled recently and regretted it)!  You get a choice of apple sauce or sour cream- i always get both. greed.\n\nPotato Pancakes.  Yum.\n\nWished I had more time to try a few other things on the menu. \n\nIn the summer, outdoor seating near the promenade is incredibly charming!", "author": "Michelle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "In New York for a couple weeks and found this place his morning. Welcoming as soon as we came in.  Service was very good and the food came fast. Our waitress was very nice and didn't check in on us a lot which was good. She kept an eye on us from afar and was there when we needed her. Food tasted great and was nice and hot from the kitchen. I had the eggs Benedict and it was cooked perfectly.  Will definitely eat here again before I leave.", "author": "Shane C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Can't say enough good things about this Establishment. Would highly recommend. Being second generation Polish in town it was like eating at my Babci's or Mom's house. The food was fantastic. The service was more then accommodating handling a group of 10 people of various ages. It was like coming home for all who grow in Brooklyn  We held a brunch for a 60th B'Day for a member of the family. Strolling down to the promenade which is no less than a block away we all questions why we left Brooklyn. This restaurant made us feel like we were home again.", "author": "Elizabeth Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "So after a LONGGGGGG night of partying and drinking, nothing wakes you up like a good mimosa and some delicious brunch!!\n\nAfter checking out of the Marriott by the Brooklyn Bridge (by the way I suggest everyone stay at this hotel...absolutely beautiful), we found this cute little dinner a couple of blocks away. \n\nThey had their brunch and for the cheap price of $13.95 I received a cup of delish chicken soup (as my momma says \"Un levanta muerto\"), a mimosa, a cup of coffee/tea and a choice between eggs benedict, eggs florentine, the garden omelette, along with some other dishes..and the dish also came with the most amazing hash-browns I have ever tasted in my life. I choose the eggs benedict and I must say it was the best choice, le boyfriend got the garden omelette which was also delicious but mine was better ;)\n\nFor the price you can not go wrong! Cheers to Brooklyn for some amazing restaurants!", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Who would give this place anything beyond 1 star? Maybe if you came for a drink or at most burger and french fries. Everything else we had was horrible... Even the salad. Don't waste your money. Just get a drink and enjoy the weather.", "author": "Dave Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Ricotta pancakes, cherry cheese blintz, and several types of pirogies were what made mine, and my husbands morning. Being from Louisiana, we don't have anything close to this, so it was much appreciated, and enjoyed. We'll be back for sure.", "author": "Tanya H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "If you're a second generation American of Eastern European descent and Grandma's no longer alive and didn't leave you her recipe for blintzes, rest assured that you can have that delicious flavor to the point you'll wonder if Grandma's been reincarnated!!  They fabulous and that's the plain cheese blintzes.  Order them with a side of sour cream and you're good to go.  The cheese and plum butter blintzes are also delicious.\n\nThe chicken stew was a nice thick consistency, served with a boiled potato and a salad.  It was well-flavored.\n\nTeresa's serves a delicious smoked turkey sandwich as well as veal meatballs with dill sauce.\n\nThe potato pancakes and the potato and meat pierogi are out of this world.\n\nApplecake for dessert is not to be missed!\n\nService is attentive.  Reservations are not taken.\n\nAmbience is pleasant.  Noise level can run a bit high at times.\n\nReasonably priced.", "author": "Alicia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-10", "description": "Very solid brunch option. I ordered a Mushroom and Brie Omelet and it worked quite well, the mushrooms were sparse but the brie was melted in very very well, adding a super consistent and strong taste. The house fries and pretty gross though, but maybe that is just how I feel about house fries. It's definitely not a bad place to eat, service was slow but that is OK!", "author": "Max T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-20", "description": "This restaurant has improved . Coffee is good and I tried their Brunch and it is a full meal .", "author": "Bella B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "Horrible service!! I am so disappointed - everyone is usually so nice and attentive, but this morning was a different story! I was shushed and told with a pointed finger, you need to wait a minute, In a rude and condescending voice when i wanted ask a question about a brunch item - we kindly asked her to cancel our order and we left! Ridiculous!!!", "author": "Tabitha P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-18", "description": "So I wouldn't usually slam a place with a one rating. Because, yes, that means I'd never eat there again. But this place has no reason to have as terrible service as it does. If I'd had a smart phone [yes, I'm a bit of a luddite.] I would have seen that it doesn't rate four stars on Yelp and moved on. But, I was in the area, and I needed brunch and a bathroom. Montague doesn't have much by way of brunch. You really need to check out Henry Street. \n\nThe interior was so depressing that I opted to sit outside although it was raining. The food was decently cooked. All in all, this place gets a \"Meh. I've experienced better.\" except for the service. Lackluster food aside. My water wasn't refilled. I wanted to order coffee and juice after the food came. Where is my waitress? I want ketchup for my eggs. Yes I could have gotten up and gotten these things myself. But what I did was finish my meal, up to the end of something to wash it down. Then I walked inside to pay my check, because who knows when my waitress would have gotten aroundto me. Both times, going in and coming out of the 2/3's empty restaurant, I passed no less than three servers in the vestibule having a conversation. \n\nWith service like that, obviously they never want my business again.", "author": "George D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "Good, solid, dependable Polish food. Good prices, too. Get the mushroom barely soup and the pierogi.", "author": "Jonathan O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-23", "description": "Looking for a brunch spot, I came across Teresa's Restaurant on Yelp. It was only 4-5 blocks away from the train station. \n\n\nI went at around 12 in the afternoon during the weekday and it wasn't crowded. My friend and I were seated right away. She ordered the Western Omelette and the chicken noodle soup. I had the Veggie burger, potato pancakes, and tea.\n\n\nThe soup was bland and the burger was dry. The potato pancakes were too oily and salty. The waitress forgot the soup until she was reminded after all of the food was served. The chicken in the soup was overcooked and the noodles too soft. \n\nThe service was fine, but the food wasn't delicious. It was very good pricing for the quality and quantity of food.", "author": "Sohee C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-09", "description": "Food was good , but service was bad, they had advertised as special that look to me as 12.95 but charged me 17.95, when i ask the owner said on her language (polish which I happened to understand)who was going to sell that plate for 12.95 , then the waiter after I left my tip told that the tip wasn't include, really shouldn't have left anything at all, also notice another waiter making a really unhappy face to another table, I'll never come back because the way I was treated", "author": "Joel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-24", "description": "One of the few times the food overshadows everything else dramatically.  I've been here over a few dozen times and at the older location when it was at the East Village.\n\nThe pierogi have always been top notch and at ridiculously low prices.  Kiełbasa is well above average and I love their Polish beer selection. All the other Polish food ranges from \"very good\" to \"my aunt ___ does it better, but it isn't bad.\"\n\nI don't love the service as it tends to be slow, and it helps speaking Polish.  I wish they had more Polish non-beer drinks and as a disclaimer: I haven't tried any of the Non-Polish dishes.", "author": "D J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Polish food is about history, about terroir, about a particular style of service. I like to think of it as a colder, less entrepreneurial variant of Greek Diner. The Poles never got around to figuring out Wraps or Cobb Salads.  They know pierogi, borscht, kielbasa and those are items that I stick to.  Usually I get the mixed platter of pierogies, and delicious borscht and I'm satisfied.  A nice little secret is they have a full bar and it's a great place to spend outside on a warm summer day.", "author": "Tom C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}