{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-15", "description": "Solid Polish home cooking that rarely disappoints. They do 'diner' food well too, but don't miss the thrill of well-executed pierogis, heavenly blintzes and authentic homemade soups like Ukrainian Borscht. Avoid the Lazanki - burnt linguini with cabbage, ham and mushroom - yuck.", "author": "Tom I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "Blonde service (literally and pejoratively) and a few too many strollers for my taste.  Otherwise a gem!  The blueberry blintzes are without compare -- crispy around the edges, and indescribably fresh.  \n\nAn oasis of good ethnic food on an otherwise bleak culinary stretch.", "author": "Natty G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "Great place to eat! I love having brunch there on the weekends then taking a stroll [literally] right down the block to the promenade for some awesome views of the city. \n\nI love the eggs benedict and orange ricotta pancakes when I go there for brunch. Other than that I enjoy indulging in the local fare (Polish food) there. The pierogis are my personal favorite. My girlfriend is Polish and she says the food is spot-on in comparison to her family's cooking. \n\nCan't say enough good things about this place. Always a must stop when I make my way out of the city to Brooklyn.", "author": "Mark N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-06", "description": "Pushing through to 400...\n\nThis place reeks of my childhood. Everything about it hits me with waves of nostalgia, down to the hideous naugahyde wall hanging. \n\nTo be honest, I felt more of a connection with the Manhattan location, which has been gone for quite some time, but that doesn't make this spot any less pleasant. While it's not of the caliber of Greenpoint Polish grub, their soups and pierogies are more than decent. Dill-heavy chicken soup, scrumptious white borscht, greasy entrees, what more could you ask for? It is the epitome of inexpensive comfort food, located in a part of Brooklyn Heights where you will generally pay a lot more for a satisfying meal than you are willing. An added bonus is that you can walk off that heavy, greasy grub with a stroll along the Promenade! \n\nDo it!", "author": "Briana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-02", "description": "BEST BLINTZES EVER!!!!! I used to have a love affair with Veselka's blintzes but then my friend moved to Brooklyn Heights and I tried this place out. OH MY GOD! They are like deep fried amazingness! I am talking about the cheese ones no need for extra fancy stuff! I wish the east village location was still open but I will make the trek here for their blintzes and perogies.", "author": "Sarah Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-25", "description": "I love Teresa's! I hate Teresa's! It's the best place in Brooklyn Heights! It's the restaurant equivalent of the DMV! \nSo I've been having this schizoid love/hate relationship with Teresa's for the past 13 years. You can have a fantastic meal here, and you can have a horror show too. From my many visits I've reached this basic conclusion: busy=good. When they are crowded, they are on their game. When they're not, the staff seems to get so relaxed that they just don't care about the food, the customers, service or anything else. As for the food, go for the Polish stuff. Blintzes are delicate and handled with great care. If you're lucky, they'll have fresh blueberry ones - sublime. Pancakes are also good. Polish classics like perogies, kielbasa and traditional soups shine. You can get the rarely seen white borscht, thick and sour, on weekends. The cucumber salad, dressed in dill and sour cream, is heavenly. They have a reasonably priced full bar, but I'd go with beer or straight booze. Wine selections and mixed drinks aren't their forté. \nThe rest of the menu is normal diner food; the perfunctory stuff you can find anywhere.  It may be prepared reasonably well, or it may be garbage, depending on who's in the kitchen and what mood they're in. Stick with the Polish stuff. \nNow service, that's a weak point here. At best, it's fast and efficient, though never friendly. At worst, it's outright hostile: you'll have to get up and hunt down a reluctant waiter for water, cutlery, whatever, and they won't be happy about being found. But you can't blame the staff, they're just taking their cues from the owners, who can be astonishingly rude, keeping customers waiting a loooong time to pay while they close out their credit card receipts in the middle of the day. There's a reason every other restaurant does that after they close, it's disruptive. And no, they won't apologize for keeping you waiting. If you go at the right time and order the right thing and the cook is in the right mood you'll have a great meal. If not, it's still better than the other sad options on Montague.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "Stumbled upon this place and so happy I did! It serves amazing Eastern European food. I had the veal goulash and the portion was huge! It came with two sides. I ordered the mashed potatoes and cucumber salad. Simply delicious! A friend ordered the kielbasa and it didn't disappoint. Washed it all down with some Zywiec. Would come back to feast!", "author": "Tracy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "It's an institution, right down to the crappy coffee. A great place to invite your broke friends, as they'll spend the whole subway ride over worrying about how much brunch costs in Brooklyn Heights... only to discover you can eat like a king for about $8. Om nom nom etc.", "author": "Zach V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-18", "description": "We tried the Plum blitzes and periogies? I have never tried plum butter so that was nice, but honestly nothing I would take my guests.  It's nothing special except they service something different.", "author": "H H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-28", "description": "My boyfriend and I found this place last year and have been addicts ever since.  We are big soup people and love their chicken noodle soup.  I am a huge fan of their white borscht soup which is only served on the weekends.  8 bucks a quart can seem little pricey but I think it is worth it.  We try to avoid this place on the weekends because it is families and I just cant enjoy a meal when a baby is crying or a 5 year old has a temper tantrum.  During the week it is mainly senior citizens who dine in so if we both have off we come here for breakfast.  Can't beat the low prices and good food.", "author": "Noam P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-21", "description": "I was showing Brooklyn Heights to an out of town friend on a Sunday morning and came in because it looked cute and not too packed.\n\nMy eggs benedict were kind of bland. I think their holladaise sauce originates as powder from a package. It's a sin! On the bright side the salmon hiding under my eggs was good. The home fries were really really yummy. I generally don't like potatoes and don't eat them but these... I actually made it through half the portion which is an insane feat for me.\n\nMy friend had eggs, home fries and polish kielbasa. The kielbasa tasted really good but was unacceptably dry. I would *probably* give this place another shot if I was in the area.", "author": "Inna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-15", "description": "What used to be an east village dinasty is now just in lonely Brooklyn Heights, though it does the trick if you need a fix. Do not expect excellent service, that's not why you go there. Never expect good service from an eastern european/russian restaurant. This is my spot for chicken soup. As a jew, chicken soup is pretty important, and when you've found the best you stick to it. Teresa's remains one of my favorite's. Whenever I'm sick, my folks know where to go for my dinner. \nI have also enjoyed their breakfast/brunch foods, like eggs and french toast. You use Challah dammit! That's the only way you make french toast!", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-25", "description": "Er... I don't really have much to say about this place.  It was, blah.\n\nClientele = screaming kids in one corner + elderly couples everywhere else\nWaiter = nice and the only positive part of the experience\n\nThe old couple at the table next to me (literally 6in away) had the following conversation with their waitress;\n\n+ Old Man hands receipt/payment in closed book to waitress\n= Waitress, having not opened it - \"Do you need change?\"\n+ Old man (somewhat flustered) - \"Yes!\"\n= Waitress walks away\n+ Old Man - \"Do I need change?  She thinks I'm going to give her a $15 tip?!\"\n= Old Woman - \"She was just asking if you wanted change.\"\n+ Old Man - \"Do I want change?  What a stupid question!\"\n= Old Woman - \"I think the stupid is at the other end of this table.\"", "author": "Christine L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-05", "description": "worst experience ever! \n\nWe wanted to enjoy a nice/low key brunch on this year's July 4th holiday there...It was around 9:35am. There were many empty tables outside. They asked us to sit whever on the outside sitting area. We were siting for 15 minutes and the waitress saw us but ignored us for 15-20 minutes while all the white people were served. Terrible service. We didnot want to eat there anymore and left the place.\n\nIf it is not the owner's intention, please give a notice/direction to the waitress who worked on 7/4/2011 morning shift-9:30am. \n\nI know for sure that we will never go back to this place or try their food ever. \n\nYou lost a valuable customer.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "I had an excellent lunch.  I ate the white borscht soup, fried meat petrified and the fresh turkey sandwich on multi-grain toast.   The service was good and prompt.  I will surely recommend to my friends.  I WILL BE BACK.", "author": "Pablo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "I recently trekked over to Brooklyn on a beautiful Sunday morning for a very hungover brunch session with one of my best friends. We ordered massive amounts of food, considering we are two tiny Korean girls. Our feast that day included various types of perogies (meat, mushroom and leek, potato), deep fried potato pancakes with applesauce, orange ricotta cheese pancakes and a side of scrambled eggs all to be washed down with some mediocre coffee and a large glass of pulpy grapefruit juice.\n\nThe perogies were pretty good, although the starchy parts could have been a bit less rubbery. The meat perogies were a bit dry and the texture was tough, but the flavor was okay. The potato perogies were very good, but my favorite were the mushroom and leek perogies--these were less dense and more flavorful. The stewed onions and vinegar complimented these so well and we devoured them.\n\nThe potato pancakes were phenomenal--probably the best I've ever had. They came out piping hot and crispy, thin and juicy (mm, all that oily goodness!) and were reminiscent of hashbrowns except completely devoid of that dense and soggy quality. We topped these savory suckers with some applesauce and they were divine. Finished all three.\n\nThe orange ricotta pancakes were a bit disappointing however. They didn't incorporate the ricotta cheese into the pancake very well. I also would have appreciated more ricotta, period. There were chunks here and there but the flavor just didn't stand out. Also lacking was a strong (or even slight!) citrusy flavor throughout the pancakes. In fact, I could barely taste any hint of \"orange\".  I was surprised to notice however that the pancakes themselves were fluffy, light and moist. So the texture was fine--they just didn't deliver on taste. This portion was huge. There were either three or four large pancakes--we got about halfway through these.\n\nThe scrambled eggs were standard but good--they were fluffy and not overcooked. The coffee was mediocre but I thought the pulpy grapefruit juice was great.\n\nThis is a no-brainer place to hit up if you want to eat non-American cuisine. Order lots of various dishes and make sure to eat like a truck driver. Our session here definitely cured my hangover, just leave your health conscience at home and go all out. Since there were so many other wonderful smelling/looking dishes that I wanted to try, I will definitely be back!", "author": "Stella Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-01", "description": "I've recently moved to the neighborhood, and walk by Teresa's Restaurant almost everyday, so on a boring New Year's Day afternoon, I decided to go out for a late lunch/early dinner and read my New Yorker. \n\nWhen I sat down, I was also greeted with \"know what you want?\" My coat wasn't even off yet, and the menu unopened--but feeling pressured to ask for something, I ordered coffee. A good idea if you like having to ask for every refill and appreciate anything lukewarm.\n\nI ordered a chicken sandwich with mozzarella and arugula, which was above average. I also ordered a side of fries, which I would recommend skipping. The sandwiches already come with a decent side salad (which you would not know because it doesn't say on the menu) and they too were lukewarm. \n\nThe service throughout my entire meal was below average, and there was excessive standing around at the bar, but I am admittedly very critical after having six years of restaurant experience. \n\nAlso, Teresa's clientele is overwhelmingly comprised of the over-sixty crowd. Maybe even seventy. On two separate occasions I watched a cane fall from a chair to the floor.  The server, both times, though, picked them up--which was surprising.\n\nMaybe I'll go back for breakfast. Maybe.", "author": "Kate L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-05", "description": "The worst birthday dinner I had was August 31, 2009.  My husband took ne and my daughter to Teresa's for dinner.  I ordered one of the specials, rack of lamb. My husband ordered the veal goulash.  The place was only half full, so we thought it wouldn't be long.  When the food came, it was cold.  When we were able to flag the waitress down, she took the plates without a word.  Fifteen mins. later, she came back.  The food was just as cold.  Prior to this, we had a rude busboy who brought us water in crusty and greasy glasses.  After the second time, he told us to talk to the manager.  The manager told us he'd take care of it and never returned.  Service in the past was passable at best but at least the food was decent and hot.  But I will tell you that we will NEVER go back to Teresa's again.  EVER.\nThe only reason I gave it a star is because it wouldn't save without it.", "author": "Olga M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-04", "description": "I went here for dinner one night and this is a great example of a perfectly forgettable restaurant.  The food was ok.  The service was acceptable.  The price was not totally outrageous.\n\nAnd yet...\n\nI can't see myself ever going back.\n\nIt's not bad enough that I've actively complained about it to anyone.\n\nBut it's not good enough that I think I've ever told my friends I've been there.\n\nThere are better options in Brooklyn Heights.", "author": "Andy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-30", "description": "The first time I ate here, it was delicious. Our waiter was friendly, and we didn't wait long for our full orders of perogies.\n\nTonight I went alone, and because the night is so cold and rainy, there were only 2 other tables. Well.  I asked for a full order of perogies, waited almost 20 minutes, and when they came, there were only 4. She says, \" Oh, I thought you said four.\"  Huh. Also they were swimming in grease. I realize I asked for fried, but Christ on a crutch, the kitchen can't blot them a bit?   As I was eating my very last bite, she comes to refill my water glass. I suppose if I were feeling generous, I could assume she didn't see me push my plate away. \n\nI'm not feeling generous. \n\nSo I remove my napkin from my lap, put my book away, and stare at the end of the bar where she's flirting with the (very cute) busboy.  Stare. Stare . Stare.\n\nI wish I could've gone to Little Poland in the East Village, but who wants to schlep all the way there?\n\nMe, I guess, the next time I crave perogies.", "author": "anna devane l."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}