{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "It's hard to find good honest meat-and-two-veg dishes in the USA, and Teresa's comes about as close as I've found to a home cooked meal.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-03", "description": "This is your basic upgraded Home cooked Eastern European food- and it is fantastic. At least the brunch was (I didn't have anything else). The ricotta filled pancakes were great; and I usually don't like pancakes. The best part of this place is the brunch deal- $13 for a coffee, bloody mary, side of grapefruit, entree, another regular side, and bread. The drink and fruit are swappable for a mimosa and cantaloupe. Oh, and they have alot of outdoor seating, which was a nice plus on a Sunday.", "author": "Layne B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-19", "description": "the service is the worst. If they don't  have what you ordered they will just give you something else. I ordered roast pork and got 2 orders of chicken noodle soup. This has happened several times. I give up. Will never eat there again. Save your $. Eat somewhere else in the heights.", "author": "Rita M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-19", "description": "Teresa's is one of the very few good places to eat at on Montague Street, Brooklyn Heights' main drag.  Skip the American dishes and try the Polish fare such as the freshly made pierogies.  Teresa's also does a nice brunch, though it can get pretty hectic there in the mornings when the restaurant fills up.  In nice weather the outdoor seating area is a welcome respite from the noisy breakfast crowd inside.", "author": "Jeanne E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-31", "description": "After many years of living in Brooklyn Heights and after a friend had raved about the pierogies, I gave Teresa's a try. About the only good thing I can say is that they do indeed have fantastic pierogies. I also ordered an arugula salad that was not only less than fresh but actually had not been properly washed and tasted of grit (dirt). I ordered the \"homemade\" raspberry lemonade that was warm and not even with ice cubes. Never once did the server come by my table to ask if everything ok, but was quick to bring out the menu to see if I wanted to order dessert. I declined.  After a bill of $16 I was never brought my change. I finally had to ask for the change, was given $2 as if that was my change. Basically the server decided to pocket a 25% tip and was hoping I'd just leave. The cashier seemed over it all as if I'd done something wrong. Sorry Teresa's  - first and last time for you.", "author": "M B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "Fantastic little brunch spot.  I had an excellent mushroom and brie omlet.  The home fries on the side were a little bland, but still acceptable.  The kasha is good (but required a little bit of butter).  But one of the best parts of the meal was the pierogies.  I am not usually a fan of potato pierogies, but my cousin really liked them.  I had some cheese and mushroom and sauerkraut pierogies and they were fantastic. Definitely an excellent brunch spot.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "Friendly and welcoming folks serving a hearty if nondescript breakfast menu.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "Great pierogis (the potato and the cheese are the best) and the kielbasa with sauerkraut is fantastic.  yum!", "author": "Eat It B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-21", "description": "Pierogies. Nobody does it better in Brooklyn than Teresa's. They've got good Polish food and really good Pierogies. They are the perfect consistency and come with a giant dollop of sour cream. The ambiance isn't exactly amazing, but the people are pretty nice. You'll get a mixed crowd as it is Brooklyn Heights, but you'll see that most everyone is enjoying their food...enjoying their pierogies at the very least.", "author": "Olivia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "Cheap, great brunch food.  I love their ricotta pancakes... fluffy and absolutely delicious.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-17", "description": "I had delivery service and the food came cold because the delivery man didn't know where to go and the restaurant gave him the wrong information.\n\nI ordered a BLT which came with LOTS of T (tomato) and very little B (bacon!).  I also got a chocolate mousse cake- don't do it. It sucked and was nothing but a messy mush of not so good chocolate.\n\nThe fries were decent though.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-18", "description": "Sure the servers are disinterested and slow, but the food is SO comfy. Personally the meatloaf \u0026 mashed potatoes with a side of Sauerkraut is my go-to dish. I  can also recommend highly the blintzes, polish platter and stuffed cabbage. Oh and the portions are gargantuan so expect to take some home.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-04", "description": "I live in the hood, so I will patronize Teresa's due to the slim pickings of Brooklyn Heights - -but I have to say, I do get a gnarly, disdainful vibe every time I go in there -- and even when I order in. The food is ok -- well, some of it. The mushroom barley soup is weirdly creamy and insipid. The Chicken noodle is decent but oily, and often has little ungainly yellow skin pieces floating around on top. But the Pierogies - when boiled -- are good enough. The fried ones are deep fried, sort of wonton-like, and not so interesting. Schnitzels and potato pancakes are uber-fried but in a very good way. But the whole enterprise has an odd pall, very pre-1990 communist, not very charming. I always want to like it more than I do.", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-08", "description": "Great selection of foreign wines at great value, generous portions and does not eat out your wallet.  Yummy food at decent price in NYC, admit that its in the nice Brooklyn, is almost unheard of.  The service was great and the food came a reasonably fast pace, for an early dinner that is.  I will definitely return and stroll alone the riverbank, if it wasn't for the 20degree weather and the pouring shower that crazy day.", "author": "Charles H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-22", "description": "I tried Teresa's for Sunday brunch.   The brunch special for $13.95 has an amazing amount of food - fruit or soup,  a choice of several entrees, a drink, a coffee, etc.  The babka french toast is delicious and I will return for brunch to order it again.  Unfortunately, the service leaves much to be desired. My waitress appeared only once every 25-30 minutes and was completely MIA for the rest of our brunch.  The coffee is a very reasonable $1.50 but I would have gladly paid more just to have a waiter swing by in shorter intervals for a refill.", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-01", "description": "If you're looking for a good brunch place, forget it. While the food was good, I have to say I was dismayed that they advertised a \"brunch\" special that included alcoholic drinks, but refused to serve the mimosa, bloody mary before noon. According to liquor laws in NYC you can't serve before noon. Really? really. When I pointed out that they should alert customers, before you order that this is the case, it was 11:20 a.m., the waitress shrugged and said \"most people know this rule.\" Really? I was sitting across a native New Yorker, who has eaten many a fine brunch before 12 noon and enjoyed a good Bellini or two alongside her food. She was also unaware of this regulation. The simple suggestion of just get the orange juice, was really not the response I was what I was expecting. When I attempted to talk to the manager, I got an very condescending/rude response and was chided for not knowing the law, like everyone else in NYC does. I am all for knowing the law, but then be clear about when the \"special\" starts, and what is included before noon.  Don't write a crappy menu and then blame the customer for not knowing. I'll take my business to the cafe next door, they seemed to have no trouble taking exception to the rule, like many, many NYC fine dining places do on Saturday and Sundays. What most New Yorkers don't know, doesn't really hurt them.", "author": "Virginia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "Came here for brunch on a sunday afternoon at the suggestion of a friend - we came as a large group and the staff happily made room for us, even during what seemed to be a popular time for brunch because it was quite crowded. the wait staff was very quick and attentive, though sometimes hard to understand due to a few thick accents but was really not a problem. I ordered a standard breakfast meal - pancakes, sausage, juice, etc and friends ordered a mix of other breakfast dishes. The food.. was.. fantastic. probably some of the best pancakes I've had a long time and the sausage was cooked perfectly. I do realize it's somewhat hard to ruin such an easy dish but, I was extremely satisfied. A few friends also has some fried perogies - both cheese and potato and they were very satisfied and begged everyone to try them - very good to say the least. food aside, the environment was very comfortable - not crammed together like at some diner/restaurants; the wait staff was very nice and quick to please; the pricing was very reasonable especially for the quality of food prepared - all in all a lovely brunch experience. whenever I'm in the brooklyn heights / park slope area again I'll look to come to Teresa's again for a meal.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-01", "description": "One of the all time great neighborhood eateries. Food is tasty and fresh. Prices also can't be beat. They serve breakfast all day long and their french fries are really something special.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-13", "description": "If you've ever lived in a cold communist country without rations, you might also be as grumpy as the people who work at Teresa's.  It's a shame since their blintzes are to die for but it's NY, why would you want to put up with this?  Oh wait, this is the city with Soup Nazi. hmm.", "author": "Mimi H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-29", "description": "Very, very ordinary food.  I don't know what the fuss is about.  Polish food is so much better than what they serve up and call Polish food.  It's greasy and bland. Won't be going back.", "author": "Ewka C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}