{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "Teresa's ( comforting Polish food) has been a fixture on Montague Street for as long as I can remember. After a lapse of not visiting for many years, my friend and I decided to have lunch here  today. \n\nThe interior was the same (it is cozy and home-y) and even some of the wait staff was still around. It brought back fond memories.\nItems on the menu were unchanged. In the past, I specifically remember enjoying their mushroom barley soup, pierogis, and chicken stew.\nThere's also a lunch menu special which includes choice of soup or salad, an entree from their list (such as stuffed cabbage, chicken stew or turkey cutlet) and either coffee or tea. All for $10.50. With the portions being generous.\n\nOn this given day, my friend opted for the lunch menu (chicken soup and turkey  cutlet with a side veggie) while I was in the mood for a salad.\nThere were several good options but I selected the Portobello mushroom salad.  It was simple, yet filling: an abundance of grilled mushrooms, gorgonzola cheese and shredded red cabbage accompanied by a honey mustard dressing  I would have expected a couple more ingredients for the price of $9.49, but it was done well. I asked for a roll on the side which complemented the salad nicely allowing me to feel more satiated.\n\nThe restaurant has a rustic feeling to it and is stroller friendly. It was busy today and so service was a bit sluggish. \nTeresa's is a great go to restaurant and doesn't disappoint. It was great to get reacquainted again today.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Teresa's is a wonderful restaurant for breakfast, lunch and dinner. The staff is extremely friendly and the food is exceptional. Soups, Perogis, kielbasa, lamb meatballs, and omelet are all especially delicious.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Theresa's never fails to deliver tasty home-style Polish dishes at reasonable prices, tonight get had a large-portioned corn beef and cabbage with a horse radishsauce. Delicious! My mate had excellent roasted pork shoulder. Our soups, a consistently  excellent specialty of the house)were a tasty vegetable soup and white bean.\nDecor is minimal, not date-night location; just\nexcellent east European chow. Worth sampling are stuffed cabbage, the polish platter or kielbasa or pierogies ;desserts are nothing special,\nPrices are quite moderate; portions are generous'", "author": "Marty F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Came with a friend on a Saturday night craving pierogies. Shared a mixed plate (cheese potato and meat) with a large helping of sour cream and apple sauce. Also ordered the apple blintzes to share. So good.\n\nOverall menu was comport food - liver, latkes, kielbasa and the like. Also sandwiches and other items. Looking around, portions looked good for the price. Nice atmosphere and not loud.", "author": "Cindi P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-07", "description": "Me and my daughter went here in a recommendation for breakfast. I got the eggs Benedict with ham and she got the eggs Benedict with avocado and for dessert we got blueberry blintzes. Unfortunately the Benedicts didn't look like the picture shown. They looked much heartier. It was is my first time ever eating eggs Benedict and I thought it was pretty good, same my daughter. The hollandaise  sauce is very tasty. Our eggs came with home fries that were not good at all there was way too much paprika and the taste was overwhelming. The blueberry blintzes were OK, a little oily and pretty expensive. All in all, not too crazy about the breakfast but I would give it another shot for lunch. Hopefully that will be a little better.", "author": "Brian V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "This was the worst restaurant I ever been to . First of all I would not even call the food restaurant quality more like corner store deli. I ordered the roast beef sandwich and it was a cold sandwich, a regular roll with beef inside no sauce or nothing, extremely dry. My friend ordered a grilled cheese for her daughter and it took about 25 min for her entre to come and when it came it was just regular sliced bread not toasted with cream cheese inside! We had decided to take the grilled cheese to go because it came really late after the first entre so we didn't even get to see the actual sandwich until we left the restaurant. Extremely disappointed!", "author": "Fro S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "Stopped in here for a quick bite we were seated inside it was a quiet night we ordered pierogis (potato) they were okay, (sauerkraut and mushrooms) were tastier they could of been a bit more crisper potato pancakes seemed to be a bit greasy and some chicken soup and barley. The soups was good, hot and tasty. Was impressed with the soup. The stuffed cabbages were good but a bit pricey for two cabbages. Good neighborhood place for a quick bite of comfort food. Will return for a quick bite for sure if in neighborhood.", "author": "Maggie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-30", "description": "I visited this cute little place last week for breakfast. The servers were nice once they got to me but were overall inattentive. \nThis being my first time I asked my waitress what they're known for and if she had any recommendations. She said the omelettes were quite good so I ordered the kielbasa omelette with home fries. It was extremely average. Don't get me wrong, I still ate it, but I have no motivation to go back. \nGiving them the benefit of the doubt it is possible that their Polish dishes are better.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "After a day of walking bridges and boroughs, my stomach was in need of nourishment. Not just any kind of nourishment but heavy food that will stuff me as quickly as possible. Eastern European cuisine to the rescue!\n\nTeresa's provides plenty of Polish favorites in a comfortable, relaxed setting that includes outdoor seating during the warmer months. Specials are written on a board along with desserts.\n\nWe started with an order of three potato pancakes, the smaller of the two possible pancake orders. Each pancake was as large as two hands put together, lightly fried and thin. While the potato enthusiast can certainly eat the pancake without any accompaniments, be sure to ask for sour cream or apple sauce (not included but available upon request). The apple sauce is perfect for pancake dipping. \n\nI was tempted to order the stroganoff but instead opted for the Polish platter, a sampler found in Polish restaurants throughout Brooklyn. One relatively reduced in size piece of grilled kielbasa, three boiled pierogi, one stuffed cabbage and plenty of sauerkraut. Most entrees that you order here will give you the choice of two sides but not the platter (for obvious reasons).\n\nI devastated the plate and left behind a few bits of sauerkraut in a feeding frenzy. I would have preferred a choice in boiled or fried pierogi and I suspect I could have specified upon order. The majority of the plate was occupied by the stuffed cabbage, a torpedo of ground meat and rice stuffed inside a cabbage leaf sitting in a tomato based sauce. The cabbage was delicious and boosted my confidence that at least one vegetable appeared on the plate besides potatoes. (So my healthy eating wasn't entirely ruined by the day)\n\nDessert has always been worth ordering here and this meal was no exception. There was a banana mousse pie that I originally thought was just banana mousse (as I couldn't clearly read the sign listing out the desserts). Four forkfuls later and it was gone.\n\nPart of the fun of eating in neighborhoods like Brooklyn Heights is experiencing the shock and awe of toddlers from the stroller mafia engaging in wanton destruction and mayhem. Not for the faint hearted, the blood curdling screams of bored babies liberated from the rules of society is a sight to behold and Teresa's was no exception. And to be perfectly fair, the groups at the other end of the age spectrum can be equally difficult, debating the last penny of the bill and exuding a sense of overall confusion that results in their yelling at anyone in earshot.\n\nThat doesn't deter me from coming back and it shouldn't bother you either. Prepare your self, work up a tremendous appetite and visit Teresa's for plates of Polish satisfaction.", "author": "Tom K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "Excellent location, love the outdoor seating and people watching. Would definitely go back when I'm in the area.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "This is a great place to eat authentic Polish cuisine. The stuffed cabbage was very good. You can order a place of pierogies and choose which flavors you want.", "author": "Jieru C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "The only thing this place has going for it is the location and it has a cute outdoor patio. I went there because I love eating alfresco. The food was pretty good but the service was beyond horrible.", "author": "Patti K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "Bad service! Rude. I went in asking blond hair chubby server to sit me. She answered back her section is busy and cannot assist me. Rude! The worse experience ever. I left.", "author": "Pablo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "I will reserve another star for a revisit and further exploration of the menu.   Simple homey feel.  Friend of mine swears by the place.  I have to say I don't have much of a frame of reference for this style of food.   I enjoyed the assorted pierogis I had and the stuffed cabbage was just that \"stuffed\" filled me up and was very good \n\nThe two of us had fine dinners and the bill just hit $38.    Great value especially for the neighborhood and it's great to patronize a real family establishment.", "author": "Edward W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-26", "description": "Food was awesome and fresh. I did takeout, and the portions were quite large. Best and fastest Mexican food.", "author": "ViviaN B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Amazing omelette with the polish kalbasa..I added spinach and fresh mozzarella to it..it was delicious and made me want to try more things on the menu..when a place can make a simple thing taste that good, I trust them to excite my palate with other food options..very cost efficient as well. Will be back soon!", "author": "Konstantin P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "Came here for lunch and it is the worst place I've ever been too. From the service to the dishes and the overall customer service we received was disgraceful. My co-worker and I ordered 2 grilled cheese sandwiches but we were never informed that the grilled cheese are on multigrain toast, I am not allowed to eat this because of health issues. Here's the breakdown;\nFirst it took 17 minutes for anyone to take our order then it took 20 minutes to get our order and when we questioned the waitress as to why it isn't written on the menu that the grilled cheese comes with that bread she started to argue with us the customers? Her attitude was totally uncalled for and offensive!!!  \nI sent my grilled cheese and when we asked our waitress (Agatha) for our bill which came 15 minutes after we asked for it she turned the bill over so we wouldn't see that she did not take my uneaten grilled cheese off the bill. When we asked to speak to the manager she said no and never came back to the patio! My friend and I decided to go inside and talk to the manager ourselves. The waitress said no it's ok I took it off the bill already, it was too late the manager came up and apologized and said the bill was on the house. \n\nThis was the worst experience I've ever had, the only thing I liked out of this experience was the homemade raspberry iced tea. Never again!", "author": "Christine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Great food, tastes just like from Poland. Owner is very nice but her staff leaves something to be desired with service. I love the polish platter and a bottle of wine is relatively cheap here! Crowded on weekends but seating doesn't take too long. Good brunch specials", "author": "Jessi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "I wasn't expecting much after reading the reviews, but the food was good! The vegetable soup was fresh, savory and filling. The portobello mushroom sandwich had the perfect proportions of ingredients. I was very satisfied with my meal.", "author": "Cindy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "This is a fantastic neighborhood spot in Brooklyn Heights! It's casual, warm and friendly and as an added bonus - they've got absolutely delicious Polish food. I got the stuffed cabbage dinner with a side of mashed potatoes and some chilled creamy cucumbers with dill. The stuffed cabbage was the best I've ever had! I highly recommend stopping in for dinner on your next visit to NY.", "author": "Katie G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}