{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-30", "description": "The reason that I am leaving 2 stars is not for the food but for the deplorable service.  Upon entering, we waited, along with the party in front of us for 15 minutes before anyone came to seat us.  Mind you there were several vacant tables.  The party in front left frustrated.  Once we were seated, a young man came and brought us silverware and napkins.  My brother asked for some coffee to which he replied, \"I am not the server\".  Okay, he might not have been the server but certainly he could have told our server.  Another 25 minutes went by and our server finally came over.  We ordered our food and beverages and about a half hour later some of the food came but also came incomplete.  Of my party of 5 adults, 2 got their food and the rest came trickling out after another 15 minutes.  So we ate in shifts.  We also ordered potato pancakes for the table.  They arrived after we had all finished eating.  We asked for apple sauce which should already have come with it.  After asking 3 separate employees for apple sauce, we finally got it 15 minutes later after the potato pancakes were ice cold.  Nobody ever came to see if we wanted more coffee and after we paid the check, another server, as we were getting up to leave asked if we wanted more coffee.  Really??  It's really too bad because the food is excellent but the service ruins the whole experience.  Not sure if it is a lack of common sense or customer service training but it will be a long time, if ever, that we return.", "author": "E C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-05", "description": "Went here dining with 3 other friends. The wait staff was not very polite, she never came around to check on us once the food was served. She messed up one of the orders, and didnt even apologize. I had to waive down the waitress to give us a check because she was running around everyone else.. Sad to say it was my first time here and i will not be coming back.", "author": "Arianna E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "I can't imagine ordering anything other than Polish or brunch stuff here: why would you?  I have cousins nearby who treat it like their living room.  \n\nAnd if I can only eat pierogi once a year, this is the spot.  And keilbasa.  Expect mountains of carbs with your carbs, and rushed, diner service (it can be a zoo at busy times).  That said, when less busy, it still generates conversations between patrons of the old-fashioned, neighborly kind that used to be the hallmark of a civilized city. Not hip in any way, shape or form.   \n\nWalk the calories off on the Promenade.", "author": "MissFroy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "Rare to find a place this cheap in Brooklyn with food this good. Earns its stars. Its a diner, so dont expect anything fancy. But reliable.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-14", "description": "This restaurant is very cute with outdoor sitting.\n\nWe ordered the special fish dish of the day: trount, and it was disgusting.  The fish was dry and NO SEASONING!!!  They simply threw the fish in boiling water and called it a day!!!\n\nOne of our two fries was cold.\n\nHOWEVER, My other friend ordered the Polish Platter, and it was really GOOD.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "Tried the place out with a friend. Delicious food and large portions. Seems pretty homey. Service was decent, a little slow but not bad. Good place to sit and eat a relaxed meal. I usually don't like to order salad because they are always over priced, but I was satisfied with the salad I ordered. The soup of the day, (pink turnip color) was really really delicious! I wish I knew what soup that was so I could order that again. Overall, I was satisfied.", "author": "E Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "Dieting?  In the mood for something light?  Then Teresa's is not the place for you.\n\nIf however you're looking for some hearty Polish goodness in breakfast/brunch form, look no farther than Teresa's.  The menu is packed with delicious carbs in the form of buttermilk pancakes and challah French toast, and the omelets are fat with cheese, veggies, even kielbasa!  Blintzes.  Borscht.  One friend's life is changed forever now that she discovered goat cheese in a Teresa's omelet.  \n\nWhat Veselka does for the East Village, Teresa's (more cheaply) does for Brooklyn Heights.  Be sure to take a stroll around the lovely area afterwards to walk off that giant meal.", "author": "Julie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-27", "description": "I grew up in BH, Teresa's has always been a solid choice as a local eatery. Breakfast is decent, their soups are excellent. However, for hearty stick to your ribs Polish food, I have always gone to Greenpoint. \n\nI will share a secret here. There is one menu item that is truly superior. Teresa's makes the best tuna salad! On a \"best\" list of NYC polish cuisine they should not make the top 50. For the best tuna salad, I'd rate them #1,", "author": "Eli G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "Another place you need to eat at in the Brooklyn Heights.  Montague Street used to have so many more places to eat and this place is one of the few to hold their own as so much change has hit the popular street. Burgers are great, entrees are quality, great soup. Prices are reasonable considering how most lately are going for your throat when you want to eat out. The authentic Polish waiters and waitresses are hit or miss. They are either friendly and great or horrible. You should check it out. I have been there with people who ordered the REAL Polish specialties and I have heard nothing but praise, so they have that major base covered.", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-09", "description": "Food was reasonably priced,but only average. Nice outdoor seating. \n\nHowever, the service was slow and the waitress ignored us pretty much the entire time we were there.", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-30", "description": "Ate: Stuffed cabbage, goulash, tons of sides\nDrank: Soup\nLiked: No pretense, home cooked food, not super busy\nDisliked: Soup was lukewarm, people are nice, but service could be better\nChicken: Soup\nWould mom like it?: Eh\nWait: none\nWould I go back: Yes, and I have\nRecommend: Perogies, goulash, or any other comfort food.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "Great service and great food given the low prices. I recommend the lazanski plate (I hope I spell it right). It wasn't crowded when I joined, but apparently it was not a peak time", "author": "Konstantinos P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Great place with good solid food! The Pirogi are the best. The service leaves a little to be desired though. Anyone NOT your server will pretty much ignore you. But the food more than makes up for it and the atmosphere is quaint and comfortable.", "author": "Joe E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "I came here this morning for breakfast and was pleasantly surprised. The weather was nice so I was super happy that they had outside seating. \n\nI know what your thinking Polish for breakfast? But this place has a lot of classic breakfast foods plus some delicious alternatives. Everything on the menu sounded so tasty I was having a hard time ordering. Luckily for me Teresa's offers half sizes so I got to try everything I wanted to!\n\nI had the blueberry blintzes, crispy and sweet on the outside generously filled with fresh blueberries (added option) and cheese. DELICIOUS! \n\nI also had a half order the homemade perogies (meat, cheese, potato, and sauerkraut/mushroom). You get to pick the ones you want. My fav was the potato and sauerkraut/mushroom. \n\nPrices are reasonable, service and coffee are okay. All in all a good experience. I'll definitely be back. :)", "author": "Christina R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "We came to Teresa's for lunch/ late brunch after packing/ organizing everything for the moving.\n\nAll I wanted was a filling and simple meal - I ordered the turkey burger. It arrived medium/ well done, with a simple side of lettuce/pickles/tomatoes. And I think I had a cup of tea with it. The burger was fine - good flavor, no issues. \n\nThe bartender/ waiter was attentive but not overlay so and I never felt pressured to eat quickly and to leave.\n\nOverall, it was fine. Decent diner experience, I would go there again.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "SO good! Teresa's is always my go-to 'comfort' place to eat. I've had romantic dinners here, meals with family from out of town, and even a warm meal after Hurricane Sandy. Each and every time I eat here, it's great. From soups to steak to all other cuisines - it's very good. Service can be slow at times, but the portions and flavor make up for it.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "The service is efficient but never friendly by any means, and the food is just so so.  The pierogis aren't even as good as I remember, although I am glad they still have steady business after all these years.  It makes me think I'm constantly ordering the wrong items on the menu.  Oh well.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "Grabbed lunch with my friend that works on montaque and recommend Theresa's. The restaurant has a very local vibe, with a old fashion appeal. My friend recommended we try the mushroom barley soup. For a dollar more, we opt for the bowl size and was more than enough for us share. The soup has a nice chicken booth base with assorted vegetable and the barley. It was delicious with rustic flavor that reminds me of grandma's soups.\nFor entree, my friend recommend the chicken sanwich with fresh mozarella, slice of tomato and arugula. Instead i went with the meatloaf sandwich with caramalized onions and honey mustard dressing. After I took the first bite, I told my friend you gotta take the other half. It was so dam good! The sandwich was loaded with flavors, you get the tender meatloaf with the sweet caramalized onion and the sweet and tangy honey mustard dressing. The dish came with mixed spring green with a light olive oil and balsamic vinegar dressing. \nMy buddy offered me half his sandwich, before eatting it I thought it was going to be an other epic sandwich, but with much disappointment the chicken came over seasoned with salt. For the reason I had to shoot the rating down a star. Overall it was a great experience, and since I work in the neighborhood this will be my go to sandwich shop.", "author": "Alexander T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "I tend to only get the pierogies when I come here, since I can't find authentic pierogies anywhere else in this neck of the woods.  My fave are the cheese pierogies and blueberry blintzes.  Great location.", "author": "Deanna G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-06", "description": "Unsmiling service just like the old country during communist times.\n\nI like the outdoor patio, orange ricotta pancakes, mushroom-sauerkraut pierogies and the sauerkraut.  The sauerkraut is incredibly good.  Just beware - it is not vegetarian.  They cook it with pork sausage, onions and bay leaf and it is pure oily, savory deliciousness.\n\nThe busboy was overeager and kept snatching our plates away before we were done.  This is a major pet peeve of mine.\n\nHad to endure the long, loud monologue of the girl at the table next to ours about how she comes from the richest suburb in Massachusetts, and somebody's breakup which she really didn't care about blah, blah, blah.  Her companion never got a word in.  Ahhh...Brooklyn Heights.\n\nI go here mostly because it's better than the Heights Cafe next door.", "author": "Michelle R."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}