{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "A nice Polish restaurant with hearty portion sizes. Each entree comes with two sides which are gigantic. Food prices are great. \n\nCame here with a party of five (literally made a reservation on the phone 45 minutes before stopping by and they were very accommodating). \n\nOur waitress was very obviously new as she was clueless (they ran out of chicken soup, told me that chicken stroganoff was \"almost the same\"). But she was very amiable and tried her best to get orders correct and so forth.\n\nPolish platter is a great value and has kielbasa, sauerkraut, pierogies, etc. Also worth a try is the szarlotka (Polish apple cake).", "author": "Nina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "Meh. Mediocre food, neglectful waitstaff, too expensive. Our waitress was acting totally harried despite there being just 3 other tables with people. Never checked on us, never refilled our water. Nor horrifying,  but not good either.", "author": "Hillary H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "This Montague Street fixture is the place to go for comfort food. The service can be very quirky and the food as well. The chicken noodle soup is so good that I have stopped making my own. Borsht, both vegetarian and white is available in season. Fans of Mushroom barley soup will rejoice in this version. My husband is a huge fan of the tripe soup.  The menu has a decided Eastern European bent but also includes generous entry portion salads. Lunch, dinner and brunch specials are a bargain for the budget conscious. Children, the elderly, the disabled in wheelchairs, large groups are all welcome here. This is a very popular spot for politicians and lawyers from Court Street. You never know who you will see here. Wine and Liquor are available.", "author": "Martha F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "I went to Teresa's during lunch time saturday. It wasnt that crowded but the service was pretty slow. We had dessert and it was good. Large portions and shareables. Will come back for actual food sometime.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-01", "description": "Sign polish people polish menu half polish.  Meatloaf...really... hamburger...they should just say diner call it a day....looks like they started out as polish restraunt but sales probably weak....meatloaf I had diner grade as well as hamburger..my polish g.f  had polish dish which was good.....nice staff Impossible to park.     Would not go back I will go to green point for polish food.....", "author": "Raymond A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Was a pleasure eating here today, had a nice Buffalo burger and salad. Service was very on point, I would definitely go back again.", "author": "Jimmy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "Thoroughly satisfying.  The menu is quite extensive with Polish favorites,  and a very generous selection of sides to mix and match with your entree.\nWe each ordered the Polish Platter which includes stuffed cabbage, kielbasa , 3 potato pierogies, and saurekraut.\nThe platters are hearty and definitely your moneys worth, plus the very friendly staff all made this (once again) a very pleasant experience. \n\nFull bar is also available !", "author": "Michael R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "The service is consistently terrible here, pretty much regardless of which server is assigned to our table. One of the last times we were here, we ordered a grilled cheese sandwich and received a chicken sandwich. Our waitress offered no apology and feigned ignorance as to how she could have so badly mangled the order, even when we had specified the kind of cheese when we'd ordered (the chicken sandwich had no cheese on it). It then took close to 20 minutes for the kitchen to correct the mistake and cook bread with cheese. \n\nThe food is generally bland and uninspiring, but there are a few exceptions, most notably the potato soup that's only served on Saturdays. If the service wasn't so bad, it would be a reasonable local diner option for weekend breakfasts and lunches but as it stands we've had enough bad experiences to stay away unless there's a specific craving for the potato soup or some mediocre breakfast food.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "Came here for dinner at 6pm with a fat guy I know. Mediocrity at best. They took the order quickly and the food came out quickly. I ordered the \"Polish platter\" which comes with a thick sausage, stuffed cabbage leaf, and 3 small pelmeni/perogi stuffed with potatoes (what ever you want to call them). It was cold and the sausage was prepped way ahead of time therefore the skin was hard and  it was cold. Overall my whole meal might have had the potential to be good but unfortunately it was cold and therefore... trash. I also got the raspberry lemonade. Its OK, in my opinion not sweet enough. \nThe fat guy I was with got half a chicken and a whole plate of spaghetti. It looked delicious. He said it was good. But honestly, can you trust a fatty? They eat anything in front of them.", "author": "Ilya L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "Came here for dinner. It's very local, I've lived here two years and still hadn't tried it. And I still haven't. We were seated and given menus. We waited almost 30 minutes for even a glass of water and for someone to take our order. In the meantime, two women who had walked in 15 minutes after us had been served. We mentioned this to our waiter and to another one. Finally we decided to go next door to the Heights Cafe, which was a great choice as the food there is lovely, but most importantly, the waiting staff act like they actually want your business.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-03", "description": "The first time I went to this place in the early 90's,  with my mother, a roach ran across the table. I really wanted to leave, but my Mom really wanted to eat there. Fast forward 2006 I bring my husband there, figuring the roach problem would be sorted, nope a roach ran up the wall. Just a few days ago my good friend loves the place and told me she'd never seen a roach there... I had to walk out, we weren't sitting more than a few minutes when a roach ran across the table. Are you kidding me? This place can't sort out a roach problem that has been going on for about 25 years? I just can't understand how they stay in business. \nPlease get rid of the roaches.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "Their Polish food is good, mmmm. And this is coming from an eastern european who used to live in Greenpoint. I highly recommend the borscht and blintzes. And their potato pancakes are a hit with little kids who only like french fries.", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "I love this place. First, it's in my hood, so it's convenient. Secondly, the food is tasty, above average diner food with a Polish twist!! With that said, one of my favorite dishes at Teresa's is more of an American dish--it's their Chef Salad, which is served with a large portion of salad veggies (mixed greens, tomatoes, onions, etc.) partnered with several types of fresh deli meats and cheeses! I typically ask for both oil and vinegar AND blue cheese dressing (I use just a little of the blue cheese dressing). Yummers! Other favorites include their chicken cutlet (it's a large portion, too) and stuffed cabbage rolls. For brekky, try their omelets and pancakes (everyone raves over their pancakes). As for ambiance, this place is a little more inviting that most diners. The wood decor is a little old school, but the place is very clean and well-kept.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "We went for lunch on a busy Saturday afternoon and were seated outside right away. The server helped us immediately and was really friendly and nice. \n\nWe got a nice selection of assorted fried pierogi, blintzes, a kielbasa sandwich, borscht, and potato pancakes at our table, and loved it all!\n\nOverall, good service and great food. I look forward to going back for brunch sometime!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Good food cheap and easy...\nWent here for brunch and it wasn't crowded. Thy have a great special for brunch... 13.50 for brunch and a drink. Can't go wrong with eggs here. My friend loves the eggs and fresh multigrain toast. The babka French toast was average but again it was only $8. Grapefruit was cut perfectly and had good fresh wheezed orange juice. Service was average and slow to get the check. Overall good deal for the food. Great music as well.", "author": "Courtney D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "Pretty fancy for a diner - that's for sure :)\n\nI came to Teresa's for lunch with a few co-workers not knowing what to expect. I was very thankful yelp existed or else I would not have known what to order lol \n\nA lot of the yelp reviews I came across suggested the stuffed cabbage and potato pancakes. Being a big fan of anything stuffed and considering potatoes to be my favorite vegetable, I was all set to order. Unfortunately, I didn't pay much attention to the menu, so I didn't see that the stuffed cabbage came with 2 sides. I decided to go with French fries and corn and skip my potato pancakes :( since they only came in increments of 3 and 5. But luckily, my co-worker ordered potato pancakes so of course, I thought I would just offer some of my food in exchange of some of her potato pancakes. \n\nWait time wasn't too long, our food was right in front of us after around 10-15 minutes of waiting. The fries were seasoned to perfection and was just the right amount of crispness. As soon as I dug into my stuffed cabbage I could smell all the spices and meat marinated to perfection, it was just superb. I'm actually getting hungry thinking about it right now haha \n\nI would come back to Teresa's. It's pretty accessible by train and situated in a lovely neighborhood. Definitely, a must try!", "author": "Victoria Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Excellent and reasonably priced brunch menu. Food is delicious and comes out quickly. I think it is the best brunch food in the neighborhood.", "author": "Laura D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Everything here's somehow droll: food, service, decor. \n\nConcerning the ambiance, there's word that they're more than a bit homophobic, which might account for its lack of élan. \n\nJus sayin'.", "author": "Power W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-08", "description": "I've had great dinners here but not today.  I ordered the polish platter - pirogen, stuffed cabbage, sauerkraut, kielbasa.  My Mom ordered the chopped steak.  Pirogen were ok, Kielbasa tasted very commercial, the stuffed cabbage and sauerkraut bland. My Moms chopped steak was raw in the middle, practically inedible.  She ordered kasha and creamed spinach as sides.  Spinach was very good the kasha so dry it was inedible.  Maybe you have to stick to the borsht, blintzes and pirogen.  For dessert we had the ricotta and pistachio cake which was delicious but frozen in the middle.  Oy.", "author": "Beth G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-06", "description": "My party of three came here for an early lunch on a weekday; I was hoping for a high end diner delicious attentive experience.  However sadly we left quite disappointed. \nI have to agree the service is hit or miss and generally inattentive. After finishing our meal, we  waited a long while and never received our check, thus we went to the cashier asking to pay. The cashier waitress did not have it and they had to find our waitress in the back- all of this took several minutes, and was a bit awkward as she had to fill out our bill in front of us. \n\nFood wise, I made the mistake of ordering a bagel- which was a standard \"continental breakfast\" at Days Inn style bagel, BUT Burnt! Is everyone here Blind? I could not believe it when I was given such an obviously burnt piece of food.  Would it be so hard to re-toast a semi- fresh one?   Ughh. \nMy friend liked the whipped cream heavy hot chocolate and was so so on the French Toast.  My husband loved his omelette, but too bad as we will not be returning. \n\nThe Restrooms downstairs  are dingy and only advisable if you really need to use them.", "author": "Tara K."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}