{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Stopped in with my boyfriend for lunch after a client recommended it and had a great experience. We were able to sit right away at a table on the front porch. The restaurant itself is located in the beautiful Brooklyn Heights neighborhood and we enjoyed sitting outside. The waitresses were very friendly and after speaking with one of them, we learned that the restaurant is Polish and Russian. My boyfriend is Russian as well and loved seeing some classics on the menu. He ordered beef stroganoff and I ordered chicken Marsala (but the menu is HUGE). Both came with 2 sides - we chose fries/mashed potatoes and traditional cucumber salad (cucumber with dill and yogurt). Everything was very delicious and reasonably priced. I'd recommend for a nice casual meal!", "author": "Shelby D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "I was in Brooklyn visiting family and on Sunday we decided to have a family brunch. Someone suggested Teresa's so off we went. Besides the issue of finding parking, which is normal for the area, it was really easy to find. It was pretty busy when we walked and we were worried they wouldn't be able to sit our big party since we didn't have a reservation but luckily that wasn't the case at all!\n\nThe best thing about this place, in my opinion, is the brunch special. It was $13.50 per person and included soup (or fruit or cantaloupe), a variety of entrees including breakfast, lunch, everything in between, and a choice of bloody mary, mimosa, sea breeze, or screwdriver. I thought this was a pretty great brunch and our whole table of 7 ended up ordering it. \n\nMy step mom got the garden omelet and she wasn't a fan of the seasoning. I ordered the ricotta pancakes and thought they were pretty tasty. I wish I had had a side of potatoes of something though. I also tried the leek soup and it was fantastic. Overall the food was delicious, service was spot on, and for how large our table was, the check was pretty cheap.", "author": "Alexandra M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "Somehow my boyfriend convinced me enough to give Teresa's a second shot. We came here on a Saturday afternoon and it was packed, but luckily after 5-8 minutes of waiting we were immediately seated. Our waitress was very friendly and gave us recommendations too.\n\nIt was still very chilly outside at the time we were here, so we ordered two soups - Chicken Noodle Soup and Mushroom Barley Soup. The chicken noodle soup was fantastic! There were actually noodles in there too. The mushroom barley soup was amazing and seasoned just right. Both soups were really tasty.\n\nFor appetizer, we ordered the fried pierogies which came in an assortment of flavors (cheese, potato, meat, and sauerkraut with mushroom). I really enjoyed the sauerkraut mushroom pierogie because I've never had sauerkraut before and it was surprisingly tasty.\n\nI had the Garden Omelette with sliced tomatoes and bread. I ordered the sliced tomatoes instead of home fries which wasn't a great choice because the tomatoes were soft. The garden omelette wasn't anything special, just vegetables and cheddar cheese combined together. I wasn't a fan of this omelette because to me it felt very bland and just plain.\n\nOur waitress recommended to my boyfriend a poached chicken sandwich with fries. The sandwich packed and massive! He gave me half of his sandwich and I didn't even know where to begin. I really liked the sandwich! The bread was toasted perfectly and had a nice crunch and taste to it.\n\nWill said Teresa's Restaurant has really great chicken sandwiches. He usually orders a grilled chicken sandwich, but this time he ordered the Poached Chicken Sandwich with Fries. Will gave me half of his sandwich and I honestly didn't know where to begin since it was massive. I never had a poached chicken in a sandwich before so this was new and different to me and it was definitely a healthy option. I also liked that there was a pesto sauce used to spread on the sandwich. It added some nice flavors and herb-like taste to the sandwich.\n\n\nI really liked the food this time at Teresa's, despite the bland omelette I had. Everything else was splendid!  i can see us returning in the near future.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "What's blander than being bland. Teresa's. \n\nI love Polish food. But this place is like a crap restaurant in Wdzydzy selling American fare. Save yourself the disaster of an experience and head up to GPT. \n\nNice people though. 3 stars for effort. But get a new chef pls.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "I love Teresa's! It's a fixture in the neighborhood and is always comfortingly good!\n\nI love their pierogies and soups and sometimes come just for these items because they're so yummy and taste homemade. Their outdoor seating is great for people watching in the warmer months. It's a reliable diner option when you want a quick and hearty meal.", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Teresa's is edible white noise. Calming, comforting, and soothing, Teresa's food is like a hug for your stomach. Teresa's magic is particularly powerful when you're feeling sick: the chicken soup, noodle-filled and salty, is like a good-tasting version of Tylenol. Each spoonful seems to drown out an entire armyful of germs, and it tastes even better when your nasal passages aren't blocked up. The blintzes, pierogies, and chicken cutlet, are equally delicious. Whether you are as robust as an Olympic athlete or as frail as a newborn baby, drop by Teresa's and experience the magic!", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "Just had the worst dining experience of our lives tonight at Teresa's.  We sat down and there was a roach crawling on the wall alongside us...disgusting and when I told one of the owners she ran into the kitchen and never came out.  So in spite of the dirty feel of the place we changed tables and stayed. Then they dimmed the lights so no one could see the bugs.  When we asked to raise the lights, the old man manager behind the counter said he had no control over the lights...can you imagine that...I watched him lower the lights with my own eyes, what a jerk.\n\nDinner was served in shifts with my poor husband having to wait 15 min after the rest of us were served....and it was horrible.  The funny part is that there were more servers than customers and they still could not get it right.\n\nThe roaches and scummy feel to the dirty place are enough to keep me out of there forever. Good riddance.", "author": "Debbie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Been coming to Teresa's for years. Update: This morning  'braunched' with family from abroad, as our 'visitor's restaurant.'  As always, marvelous. Thank you.", "author": "James O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "Rude rude rude. Went in, got sat right away, and then sat there. Every server looked at us multiple times and then looked away. Table next to us got sat, and a server started to take their order- we asked her to assist us and was told it  ain't her table. If we had sat in her section she would help, but too bad. Our official server just shrugged her shoulders. We left, found Iris Cafe #9, which was fantastic- food was great and they were actually friendly. If I could give Teresa's zero stars I would.", "author": "Tricia F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-13", "description": "Wrong wine, wrong steak temperature, bad lunch :( \nRestaurant wasn't busy so I don't know what happened.. I should have went to the place next store.", "author": "Josephine P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-24", "description": "Bad meal, bad service, dirty environment. Came here for their 9$ lunch special. Price is the only redeeming quality here. Food was greasy, salty, but lacking in flavor. Gave me an upset stomach. Service was beyond horrible. Nobody seated us we had to seat ourselves. Waitress went missing more than once. Screwed up our bill charging my friend double. And to make matters worse, the place itself was filthy. Bathrooms looked like they had not been re-modeled in a century and the table was dirty when we sat we had to ask for it to be cleaned, which is pretty pathetic. It's their job to be on top of this sort of stuff. Waitress also spilled water on us and a coffee had spilled because of the tables being uneven/broken? Not sure. Definitely an unpleasant experience!", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Great soup, blintzes and pierogis!  Good lunch special. Fast and friendly service. Warning: soup comes out VERY hot! But delicious.", "author": "Anne R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "Been coming here since the 90s... Food is great but service is absolutely terrible. It will take forever to get your food and it will not come at once. You will also have to ask for your sides (again) and reorder your meals sometimes too because they will forget. \n\nCould be the kitchens fault somewhat but can't be all their fault. Management needs to help.", "author": "Annie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "This is a very cute place. Peirogis are absolutely delicious. Definitely worth a try! Service is a little on the slow side, but as long as you're not in a rush its okay. They play some oldies music too which sets a nice mood.", "author": "Kristen Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-30", "description": "Came here for breakfast/brunch on a Sunday. Orange ricotta pancakes were great. I had eggs florentine which were just ok. My boyfriend had an egg and bacon sandwich. Not great for $7.95 as it didn't come with any side. The service was pretty bad. Waited quite awhile for our coffees. My food came out 10 minutes before my boyfriends. I might return and hope for better service just for the pancakes.", "author": "V M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "Love this place for breakfast before we head to church at the Brooklyn Tabernacle. The place was very busy but we were seated quickly and our waitress was quick to take our order and get our food to us. The orange ricotta pancakes melt in your mouth! My daughter got the French toast and loved it. You can tell this is a local favorite and is a place that's worth the little walk from the Jay Street/Metro Tech station.", "author": "Kristen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "I have to admit that my first experience wasn't the greatest, but since then I've returned a few times and have enjoyed all visits.\n\nThe service was better the past few times, although sometimes still a bit rushed and grumpy... but the food has been good (consistently), and the prices are diner appropriate.\n\nMy one go-to dish is the Polish platter, it's been good every time.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-18", "description": "A friend recommended this place as a must for breakfast so we made it our first stop as we arrived around 10:00am. Unfortunately, I was not at all impressed. The food was ok, nothing special, but decent for breakfast. But the service was terrible. It took so long for anyone to greet us, then to get our food. Then we sat forever having long finished our meals before the waiter came over and we had to ask for the check, which then took 15 more minutes to arrive! The waiter didn't seem to notice or care that we were getting aggravated. I was truly disappointed with this experience.", "author": "Gina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Had a polish-influenced breakfast here. Excellent service, good omelets (I had one with keilbasa), and nice big potato pancakes. A nice local diner.", "author": "Bill W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "Mediocre (at best) food, terrible service. Place was empty and it took 20 minutes to order. Entire staff was clowning around behind the counter. When paying our bill, they held onto our card for probably 15 minutes. Keep in mind, empty. On a Saturday afternoon at that. Save your time and money - go elsewhere.", "author": "Melissa G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}