{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "We went their for co-worker's farewell, This place is little off the cluster of quick food joints on Montague. Quite laid back and easy going ambiance. Server was very responsive and helpful picking a good lunch Entree.  Their selection is great. I just decided to stick with Chicken Cesar salad to keep my body fat under control for summer. I was not expecting any outstanding experience. but it ended up the best Cesar salad I have had in Brooklyn due to quality of Romaine Lettuce. Great Quality of Food! Everybody had good things to say about this place after the lunch!", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-09", "description": "Came here for lunch with my fiancée after visiting family in the area, as something seemed charming about the place. Well the service was awful as it took about 20 minutes to get someone to take our order and we never received the tea we ordered. Also the coffee tasted watered down and the food was far from fresh. Other than that we enjoyed ourselves.", "author": "Evan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "My choices reveal my personality. I don't vary much. That reveals more. Roast pork sandwich on rye with a side of sauerkraut preceded by a cup of tripe soup. I don't like eating pork because of the fat. I don't like sour especially. I don't like offal at all. I am in heaven with these items here. Only here.  The pork and sauerkraut resemble that of my mother's, born on an isle in Croatia.  In fact it is better than my mother's. Food here is not fatty and never over salted. The house thinks of the longevity of its customers. The tripe is a revelation. Only once before in my life did I have it so good...in Florence in a tiny trattoria not far from the Arno.  If I lived upstairs I would be very happy. As it is I have to travel to Teresa's and do so at least once a month for a roast pork sandwich on rye with a side of sauerkraut preceded by a cup of tripe soup.  I have been coming here for over twenty years. I would give five stars but I have only tried a few items on the menu. Oh, I occasionally go for a broiled kielbasa. Close your eyes and you're in Poznan.", "author": "Dan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-17", "description": "The food is delicious, the staff is friendly and helpful. We had such a nice peaceful dinner sitting outside in the sidewalk area. This restaurant is a definite MUST when visiting Brooklyn Heights!", "author": "Marcie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "I had a late lunch there on a weekday in early June, with two friends.  Our server was a little brusque until he warmed up later, but the food was delicious (I had pierogies) and the prices were very reasonable.  Teresa's has a pleasant-looking interior, outdoor seating (although we sat inside), and it's on a lovely block.\n\nNote:  Cash only.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "A great brunch spot! \n\nSpinach blintzes, eggs benedict, and orders of both cheese and potato pierogies were all delicious, with generous portions. The brunch special is a good deal, too. For $13(?), you get a choice of cocktail, a starter of soup or fruit, and an entree. The inclusion of a starter makes for a nice change, as does the fact that you can choose from several cocktails as opposed to just the standard bloody mary and mimosa.\n\nWhat pleased me most were the yummy home fries. It's been forever since I had the real deal compared to the dried up little roasted potatoes most places serve.\n\nWe left happy and satisfied, vowing to return for more!", "author": "Michelle Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-06", "description": "Not that great.  We wanted some polish food and, while they certainly had it here, it didn't taste good.  The best part of the meal was the appetizer, which was some potato pancakes.  They were good, but not great.  I ordered a veal cutlet that was just bland and uninspiring.  My wife got some pasta with meat and some nasty looking sauce on it, which she thought was decent.\n\nI don't know, I just expected it to taste good.  Instead, it was just food that I put in my mouth and chewed on.", "author": "Chad H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "My new favorite place in bk heights. Simple clean and authentic Eastern European food for the right price. Stuffed Cabbage is my favorite, but the potato pancakes are great too.", "author": "Sam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "This place has the best Polish food in NYC. The portions are huge and mains that come with a couple sides are around $15. I highly recommend the Polish Platter - it gives you a masive sampling of some amazingly tasty food for such a reasonable price. I could also eat their mushroom barley every day. The staff has always been friendly. The atmosphere is clean and cozy. This place is a gem!", "author": "Missy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "I love this place. Great service. Great food. Great price. Great atmosphere. Familiar wait staff and super friendly.", "author": "Evan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "The four stars are primarily for two reasons - the orange ricotta pancakes (only available on the weekends) and the pierogies (available always, much to my cholesterol's dismay). They are both delicious and amazing. \n\nI've dragged countless people here just by uttering the words \"Orange ricotta pancakes\" and yum, they totally deliver. So fluffy and tender and  - oh man, I want some right now. \n\nCan you go wrong with pierogies? Actually, yes, but Teresa's does not. \n\nThe staff is also always super friendly and helpful, and they make me feel like a regular even though I am a broke grad student who only goes there sporadically.", "author": "Priti T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-04", "description": "In the culinary wasteland of Brooklyn Heights, Teresa's is a constant.  Was in the Brooklyn hood for lunch Sunday, and Teresa's was packed with locals as this place has been a fixture at this loc. for years.\n\nStandard Polish fare are all available meaning pierogis plus and I had the broiled kielbasa, boiled potato and sauerkraut which like all food cultures the dish offers a filling and warming mass of grub.  A cup of cream of leek soup rounded off the high calorie, comforting, massive lunch.  About $13 bangers for all.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-18", "description": "The service was horrible had to wait a hour to be seated only to be told the seats were meant for someone else so please stand up and wait again. The waiters and waitresses very rude. There was a fly in the juice. We not even given ice for our drinks and the waitress was never anywhere to be found so it would take forever to even order or ask her for anything and when you managed to find her she would roll her eyes and suck her teeth. By far the rudest and worst service I have ever experienced and I would never recommend this place to any one nor will I ever give them my business again. Horrendous...", "author": "L V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "I've been here twice in the past 24 hours, and have to at that I was pleasantly surprised and 100% satisfied both times. \n\nTheir menu selection is wide, their portions are very generous, their prices are extremely reasonable - especially considering the amount of food you get, and the food was absolutely delicious. \n\nWe went for dinner last night. My husband got the roasted chicken and I got the chicken Marsala. Both pretty standard dishes, but so often - particularly with the Marsala (at other restaurants), the chicken comes out dried out and tough and the restaurant just smothers it in sauce to compensate.  Here both chicken dishes came out perfect - the chicken was tender and juicy and well flavored. So good!  \n\nYou also get 2 vegetable choices with your entree - they don't have any green veggies standard, and the green salad leaves a little to be desired - it's an uninspiring iceberg salad with tomatoes and onions, but they had broccoli and spinach as \"special\" sides last night. The H got sauerkraut and broccoli as his sides. I got the salad \u0026 French fries as mine. The sauerkraut was really tasty and flavorful, and the french fries were just about perfect bistro fries - shoestring and lightly crunchy. My favorite!\n\nWe left full and happy. The only complaint would be that they were slow to refill our water, but that's an extremely minor detail in an otherwise outstanding meal. \n\nWe decided to come back this morning to try out their brunch menu and were similarly satisfied. \n\nThe H got their feta and spinach omelet, I got the fresh mozzarella and tomato - they were both delicious.  He got tomatoes with his, and I got the homefries. Both sides were very tasty. The home fries - like the french fries - were cooked just right - a little crunchy, but they still tasted like potatoes instead of grease nuggets.  We also got a side of kielbasa that was super yummy. \n\nThis place has a very similar menu to your average greasy spoon diner, but the execution and delivery of the food is definitely a cut above that. \n\nThis is definitely a new favorite.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-03", "description": "Decent food, lousy service. Be prepared to wait until the server finishes their own conversation with other staff before you get any attention.", "author": "Tyler S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-06", "description": "I've been hear for both dinner and brunch, both times I've sat outside, so my ratings and review are from these experiences. I have come back and wanted to come back just for brunch, which is A-mazing! They serve Lavazza coffee, which is a personal favorite of mine, but it's not always brewed to perfection, which is ok, because we're all human. I've had their Babka French Toast, served exclusively on weekends, which is a thicker slice of toast, with a bit of cheese and raisins. It is wonderful. Their waffles are also done well.. crispy and not too floury or thick. Eaten with strawberries on top, nothing can beat it. I've also had their Garden omelet, another weekend special. They use fresh green and red peppers, in addition to cauliflower, broccoli and onions. I like it because the cheddar cheese is in patches, which I can avoid for health reasons. \n\nI've had their pierogis and I have to say that it's ok, nothing spectacular. Their service is also variable. The wait staff is always friendly, but when it gets busy, you have to wait on them for some time.\n\nI would definitely come back and bring people for the brunch.", "author": "Neal L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-28", "description": "We went to try this neighborhood joint this morning for breakfast. Seemed like a fairly standard diner-type establishment, so it wasn't like our expectations were sky-high. It started off okay, our orders were taken on time. It then took 40 minutes for our order - ONE omelet and ONE burger (no drinks) to come, during which we struggled to get our waitress's attention and she never once stopped by to apologize for the wait. When we asked her if it was going to take long she replied that there were back orders in the kitchen (it wasn't that full)! The food eventually arrived. My husband's burger was fine, even though not very tasty (but my review is more towards service). My omelet arrived on my plate with zero sides (on the menu it says home fries and kasha). She looked surprised when I reminded her that the order was incomplete, I mean just looking at the plate it was obvious it looked empty!! The home fries eventually came after we finished our meal. No real apology or (God forbid) discount. They never served us bread on the table even though most other tables had baskets. Even if those were ordered by the customers, the least you can do by way of service is offer bread while we were waiting. Nobody is expecting five star service or food with a diner but one does expect efficiency and precision. That's what diners are for. Unfussy and precise. With a side of home fries!!", "author": "Arati M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "This restaurant was a charming and cozy place where one can come with a family or group of friends.  I have to say the chefs make huge portions of food, and you will not leave starving.  My friend had their white borscht, and I had the stuffed cabbages with meat.  The borscht was rich and had delicious pieces of potato. I'm still surprised that I was able to finish all that food.  It was nevertheless worth it.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-01", "description": "Cup of tomato soup\nIt was comforting and rich like a good tomato soup should be. The noodles were thin and not really a great complement to the soup, maybe the rice would have been better. It was a nice tomato soup, seasoned well and perfect for a cold rainy day.\n \nPierogies\nCheese - had a bit of tang to it, but very tasty. The dough was nice and soft and chewy. Not too thick and overall very well executed. Married well with the sauteed onions garnish. \n \nSauerkraut - my favorite of the three. Had more flavor and did not even need to be garnished with the onions. The filling was rich and hearty and not lacking in anything. \n \nPotato - my least favorite of the three. Can't really get used to the double starch aspect of the dish. Might be properly executed but personally I am just not a fan of the flavor combination.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-05", "description": "We went to Teresa's for brunch. The food was great, but the service was not.\n\nDon't get me wrong, the people serving water and coffee were on top of it. Cups barely stayed empty. But our actual waitress was usually nowhere to be seen. It took forever to get the check. In fact, I finally had to follow her inside. And we had to follow her again to get her to run the card.\n\nIt really was a shame since the food was great and well-priced. They have a brunch special that we didn't try that's $13 for an app, a meal and a cocktail. Plus they open earlier than most brunch places.", "author": "Heather A."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}