{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Teresa's is the kind of restaurant that almost doesn't exist anymore in New York City. A local homey style place with good service and hearty food. In the summer I pretty much always get a cup of borscht. \n\nAnd where can you get borscht anymore. \n\nDelicious with dill and a hard boiled egg it's great on a hot day. \n\nPierogi are not to be missed. I always get a mixture but you can't go wrong with cheese or potato. How does Teresa's-stay open on Montague?\n\nH", "author": "Elliot P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-10", "description": "Teresa's is very much a neighborhood establishment- I don't think that it's terribly worth it to come here if you live too far away. Most of the items that they serve here can be obtained more conveniently if you really want them. For instance, veselka is open 24 hours, and is right in the middle of manhattan, and so is much easier to get to during your 3:00 am pierogi craving. \n\nStill, Teresa's does an okay job with food. We ordered a couple things... but mainly the pierogis: beef and potato? We also got some of the red cabbage, some salmon, and the apple cake?\n\nReally the main feature here were the pierogies. We got them both boiled and fried, and obviously the fried ones taste better. They are served with a pretty nice side of fried onions, and some cream cheese.The other thing I tasted was the apple cake, which was only okay. I am not known for having a very sophisticated palette, but it tasted not too fresh to me, and there really wasn't much apple in it. It typically comes with ice cream, but I had mine without.\n\nThe prices are a little high over here. The total bill for these fairly innocuous items came out to something like $80. I suppose it's not outrageous, but personally I think it's a little high for just basic food. I wouldn't mind coming again, but only if I am in the neighborhood.", "author": "Matt L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-08", "description": "First time coming to Teresa. I always passed by when I used to go to the neighbor restaurant, the now closed \"Friend of a Farmer\".\n\nWe decided to give it a try for brunch the other day. Everything is just okay, it's more like a diner with polish comfort food. Many local people are regulars at this spot, and they recommended to try the polish dishes (they were 100% right).\n\nThe greatest thing in the menu is the Lazanki, a sort of pasta dish made with chopped linguini, friend ham, and sourkraut. I named it the polish pad Thai. It is amazingly tasty and good. You should order Lazanki right now. No joke.\n\nOrange ricotta pancakes were a bit sour and the ingredients didn't really mix well. The Badka French toast was also okay, but the dried fruits inside make it taste like Christmas panettone. Only if you like panettone you will enjoy this version of French toast. \n\nPaulina our server was very friendly, and helpful answering our questions about the menu.\n\nI have to say I will come back for the Lazanki, because it is definitely a 5 stars dish.", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "Teresa's is the best. The food is good and not fussy, which is increasingly hard to find in NYC. The prices are so reasonable, it's right near the promenade so you can take a lovely stroll afterwards (and they also have outdoor seating on a quiet part of Montague Street, which is nice in warm weather). They have amazing deals for lunch and dinner. I particularly like their salads (especially the arugula salad with pears and roasted turkey), but everything I've ever had there is good. The staff are nice.", "author": "Eliza C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-15", "description": "We eat here regularly for the $11.50 lunch specials: beverage, soup or salad, \u0026 entree. The decor is old but we're here for the food.  Besides the chicken stew, we occasionally eat the broiled kielbasa, the turkey cutlet, and the lazanki.  The fountain soda is often flat and the iced tea can sometimes be too herbal -- hot coffee is a consistent option.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "Delish, authentic, fresh-made! If you're Eastern-European food-lover, definitely check it out! You'll find \"Kasha\" in their menu, this is buckwheat. \"Tripe Soup\" made from beef tripes, so won't be surprise;)) actually it's very tasty. \nMy favorite desert is \"blintz\" with cheese \u0026 blueberries, just like home-made one.", "author": "Tata P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "This is a GREAT place to go to for brunch, any time of the week. I was very impressed, and I loved that it was Polish, and not just an Americanized brunchy type of restaurant. I love sitting outside on the street under the awning. You feel like you are removed from Brooklyn and NYC, as if you are somewhere in Europe. The staff are very nice and very prompt. \n\nThey have a very big menu with plenty of authentic options. We had gotten Apple Fritters and Polish sausage with kasia. Last I ate this was when I family member made it, and this meal at Teresa's tasted very much like a homecooked meal! I loved it and cannot wait to go back.", "author": "Chloé S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-01", "description": "Very quaint small cute Brooklyn restaurant located a few blocks from the water in Brooklyn heights. The dinner special was only $16 and included a soup or salad, an entree with two sides, dessert and coffee.  The staff were all very friendly and kind. \n\nWhile the price was unbeatable the flavor was not. \n\n*The tomato soup was my favorite course, it wasn't your typical creamy tomato soup. It had rice and vegetables and more broth than cream base. \n*my entree of veal meatballs was also good but nothing special. My friend got the polish sausage and couldn't finish it because he didn't like the taste.\n**coffee lacked flavor \n**panna cotta was okay \n**sides of French fries, creamed spinach, mashed potatoes, and cucumber salad were all okay but again nothing spectacular.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-19", "description": "I came in on a Saturday morning. Ordered a bagel with smoked salmon with a side of avocado and a caffee au lait. Total came out to $22. They only serve regular milk. No almond/soy milk options. \nFood was good, happy with my order though the saucer from cup of coffee was very dusty.  Waitress was unfriendly and cold.", "author": "La B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-25", "description": "Couple days ago I went to this Restaurant. The service was so rude especially chubby one by the counter her attitude was terrible. Food is good! Rude rude and so rude service!", "author": "Joanna R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-30", "description": "From experience, I would say that Teresa's is not what it used to be. Family members have been going here for years and loved it, then started only liking it, and now, not sure if they will continue going as service is lax, there seemed to be communication problems with the wait staff that impacted enjoyment of our meals, prices are steadily climbing, and what used to be all-around excellent food is not what it used to be. Nevertheless, a couple of our meals were excellent, others were disappointing, but all came in large portions and we were very happy to be warming up in this well-heated establishment on a very cold day in the Heights. For diners with mobility issues, please note that the bathrooms are located down a steep staircase.", "author": "Bobbi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-04", "description": "My visit started off fine. The service throughout my meal remained prompt and friendly. I was pleasantly surprised, as I came here even after reading the plethora of negative reviews on Yelp, because the food on the menu sounded good.\n\nI had the chicken cutlet with mashed potatoes and sauerkraut. The mashed potatoes were lukewarm (which I deducted one star for), but delicious just the same. The chicken cutlet was huge and tasty. The sauerkraut wasn't bad, either. Portions were ample.\n\nThe real problem came when I was trying to pay with my debit card. The server returned to my table and said my card was declined, and that he'd tried to run it twice. I opened my bank account not only to see that there was enough money in it to cover the meal, but that the cost of my meal had been debited from my account.\n\nHe left the table to try figuring out what the issue was. Another server returned to me and stated that sometimes, the restaurant has this happen. She explained that the cost of my meal only shows as a pending charge, and that it would ultimately end up not going through. Because of this, I was told that I have to pay another way.\n\nI didn't have another card on me and I don't carry cash, so I had to go across the street to a deli and pay a fee to use their ATM. Because of the fee, the inconvenience of having to leave the restaurant to use an ATM, and the embarrassment in front of other customers of possibly looking like I couldn't pay for my meal, I returned to the restaurant and paid with exact cash. \n\nI normally believe in tipping, even when there are some issues at a restaurant. I also understand that issues arise during the payment process sometimes. But after they admitted that this is a recurring issue, I have to wonder why they haven't tried to sort it out, and I wonder how many other customers have had to undergo this process. \n\nI am also nervous about this pending transaction in my bank account. I only go out to eat if I can afford to, but at the same time, I didn't plan on spending double what my meal had cost, and I hope the pending charge gets reversed. I saved the declined card receipt and my ATM withdrawal receipt, but who knows if the bank would be willing to refund the charge if it goes through?\n\nI'm mainly turned off because they treated the issue like it wasn't their problem, even after I proved that my bank account had been charged and had enough in it for the card not to be declined. I've never had this happen until today, and they didn't seem all too concerned that this is an ongoing issue at their restaurant. If it were me, I'd be on the phone with whatever service I use to process my customers' card payments the first time it happened.", "author": "Katie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-02", "description": "WORST service ever!!!!!!! This place doesn't even deserve 1 star! Horrible staff, takes 15mins just to get a waiter and order! The food is not even great at all. They exist only just because the price is reasonable in the area. And it's so dirty that the grading is always pending. I wish we have new MUCH better place in the nice neighborhood.", "author": "Lulu Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-11", "description": "I have lived in the neighborhood for 30 years and used to regularly go to Teresa's out of convenience. My friends and I would laugh at how nasty the wait staff was like it was some kind of comedy. The food was blah but cheap. Mostly it was a convenient place. Lately, I've noticed it's really gone down hill. The place seems filthy and the food is actually bad whereas before it was edible. \n\nAnd I didn't think this would even be possible but the waitstaff is ruder than ever. I went in there recently for an early weekend breakfast by myself before the crowds and was abused and humiliated by one of the waitresses. \n\nWhen I arrived, she asked me, \"how many\" and I told her \"just one.\" She responded, \"Go sit over there in the corner!\" And handed me the menu. I sat there for almost 15 minutes with no water and no one came to take my order. I finally got the same waitress's attention and she said loudly across the restaurant, \"What do you want?\" She was so loud that other diners turned around to look at me to see what was going on. I explained, I would like to order. (What did she think I wanted.) \n\nThis attitude and tone continued throughout my stay there. I went to the manager and told him of my experience. He just shrugged. The other day I went in there for a quick bite and while I waited to be seated, I saw that same waitress yelling at an elderly lady who was trying to ask a question about the menu. This time, I turned around and walked out. I will never stop there again. It's a shame to lose a customer after 30 years.", "author": "Debra H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "A friend who lives nearby lives this place for brunch. The prices are reasonable, the menu varied, the service friendly and quick. My friend got a coffee, which includes refills, and apparently it was good. My cafe au lait was pretty meh, both not strong coffee and not whole milk or a bunch of water or something. It was drinkable, but I wouldn't order it again. I wanted to try a few specialties so we got the potato pierogis and the apple fritters, with a side of apple sauce. It was all fresh and tasty. We got them fried but they also offer boiled. They have nice patio seating which would be quieter. The inside gets pretty loud because it's biggish, but we could have a conversation by raising our voices slightly. The main bathrooms are downstairs, but there's also an accessible bathroom on the ground floor. It sometimes took a few minutes to get our server's attention, but on the other hand they definitely weren't rushing us out.", "author": "Mira S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-24", "description": "I went here for lunch after looking forward to going here for a few months now. I got here about 12:45pm and was seated right away. The restaurant was not packed but there were a fair number of people there. The waitress came right over (Eastern European accent with long red ponytail) and took our drink orders. Upon her bringing back the water with menus we gave her our orders because we knew what we wanted. That was at about 12:50pm. We did not get our food until about 1:15pm. Meanwhile I noticed a number of people that came after us and got their food before us. This is something that always pisses me off. You should get your food first when you were sitting there a full 30 minutes before another party! Furthermore, it's lunchtime and some of us don't have the luxury of waiting an hour to get our food. Especially not simple dishes like sandwiches and salads!!  \n I ordered the avocado salad with the pork loin. This was really good, came with a good portion of avocado and pork loin-this is why they didn't get only one star.  My companion ordered a side salad and grilled chicken sandwich. The waitress  said she did not hear that she wanted a sandwich and then my companion had to wait another 20 minutes for the sandwich. When the sandwich came out it was simply a grilled chicken breast on wheat bread with a pickle on the side. No accompaniments, not even mustard, or mayo. My companion had to ask for some Russian dressing to give the dry sandwich some life (which took another 5 minutes). I really don't understand why it took so long to prepare that. I thought I was going to see some phenomenal sandwich instead of the sad sandwich that was placed before her. \n\nI wish I could have had a great experience here because their menu is so extensive. I wanted to make this a regular lunch spot and spread the word amongst my friends. Instead I will be awarning them to not come here ever!!", "author": "Kia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "I love this place. The food is always delicious, it's a good price, and the waitresses are really sweet. I go especially when I am craving pierogi-- it's hard to find good ones in Brooklyn these days and Teresa's are perfect.", "author": "Jana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Teresa's for lunch is superb.  For $10.50 you get soup or salad,  wide choice of entrees and a beverage of your choice!", "author": "Adventurous P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-09", "description": "The soup is so and so. The waitress was kinda of rude. Not going there ever again. The food took so long to come out and it was very cold and soggy. The Pirogies were ok the meat were not bad", "author": "Jack H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-17", "description": "My friend and I went to have a quick breakfast on a Tuesday morning. We have eaten here before and enjoyed it however that morning service was very poor. I came late to meet my friend however the restaurant was slow so I thought we would have a pleasant time. I never got a menu. The waitress after came to take our order which was a spinach and feta omelette. The food came and the spinach and feta were stuffed in the middle of the eggs they were not cooked mixed with the eggs. I ordered white toast yet I received one slice of white toast and a slice of another type of bread. I didn't want to waste the food so I ate it. Our waitress never came to our table not ONCE. We had empty plates in front of us for 10 minutes. The other waitress saw us yet never offered us anything. When I looked to see our waitress she was on her phone in the back. We decided to get up and put our coats to see if she would come over but no..she was taking to the other waitress by the register and we were right in front of them too so my friend asked for the check. I was very disappointed.", "author": "Dayana L."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}