{"aggregateRating": {"reviewCount": 266, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-24", "description": "This is a good place at a pleasant locality in Brooklyn. They had a bunch of tables outside and the whole experience was pleasant. We went there for a late lunch on a Sunday and they still offered the whole breakfast and lunch menu, which I think is great. \n\nThe food wasn't extraordinary but we weren't expecting anything more for the price. The service could have been a tad bit better, but place was crowded a bit so you can understand.", "author": "Yogesh K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-23", "description": "Awful experience! Left before the drinks even arrived because of rude waitress! My friend and I went here in the afternoon, no one came to see us for 10 minutes, no drink order or greeting, finally a woman came and asked if we were ready, we said we would like drinks first, she asked us again if we were ready, again we said we would like drinks first, she took our drink order and then asked for our menus, we said we were ordering food, she sighed and walked away, and the menu said that they served breakfast all day and to ask for the menu, my friend asked about breakfast,\nthe waitress said they didnt have breakfast, which obviously isnt true considering the pictures people have posted, we decided to leave before she came back with the drinks because we didn't feel like having our dinner ruined by a rude waitress. Would not recommend.", "author": "Ashleigh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "The best brunch for its price. Coffee, boozy drink, entrée and appetizer for less than $20!!! We thoroughly enjoyed our brunch.", "author": "Erina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "Lazanki-pasta with cabbage, mushroom, ham etc is the best noodle dish I've ever had! It was my first polish food in my life but it tasted nostalgically familiar like a homemade grandma's dish long long time ago.\nI'll definitely go back to have it again whenever I visit New York.", "author": "Alli P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-22", "description": "I'm still a regular at this place, but I've learned to stick with the Polish dishes and the egg dishes. Oh, and the tuna salad platter is nice. The sandwiches are hit-or-miss, the grilled cheese is pretty bad, the French fries are often a little soggy. They seem to have a complete change-over of waitstaff about every 3 months, so service is hit-or-miss as well.", "author": "michael r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Went here for grandma's bday dinner because she used to go to the old Teresa's in Manhattan with my grandpa. Food was excellent and so was the service. Everyone that ordered soup was very happy and my wife and I ordered and shared the chicken cutlet and pierogis. Everything was delicious and portions were huge. Definitely a good place to go for polish/american food", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "This Polish diner, located in Brooklyn Heights, aims high (for a diner) and serves all the classics alongside a full menu of Polish specialties. \n\nThis place is really a borscht festival, because depending on the day and season you stop by, you might find Ukrainian borscht, white borscht and/or cold red beet borscht (summer only).  The latter is a clear soup, tasty, tart, and refreshing, with lots of diced beets and a whole hard boiled egg submerged in it.  When you add a boiled potato to the cold red borscht, it reaches a whole other level of old country goodness.\n\nI've had the veal meat balls here and they deliver what they promise, bland non-assertive flavor that will leave you full and satisfied.  This place will do in a pinch when you have that Central European food craving and don't want to travel out to Greenpoint.", "author": "Jeff J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "My friend brought me here because she said it was good, and she was right. I'm a big fan of Polish food, but opted for just a bowl of cold borscht on a summer day. \nBorscht is different everywhere you go; theirs has the sour cream on the side. It has a nice \"zing\" that I thought was cayenne pepper, but the waitress said was garlic. My friend enjoyed her soup and sandwich. Would gladly go back.", "author": "David J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "The best Polish food outside of Greenpoint, nice outdoor tables for people watching and beautiful Brooklyn promenade for strolling and digesting (you will need it).  Potato pancakes are huge (even at half portion).  Though I may have been full after 3 orders of the miseria cucumber dill salad -- It's that good.  Fresh cup of cold borsht on a summer day.  And my father, who was visiting, was so impressed by the Polish platter that he had me bring him back a few days later.  Wish I lived closer, I'd be there every week.", "author": "Christine E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-02", "description": "I experienced a similar animalistic behavior here once I crossed the threshold that went something like this:\n\nI sat down and folded my hands over the menu; not necessary.\n\nFlagged the girl over and ordered a combination of fried perogies - full order because my boyfriend and I were feeling faint and two orders of lazanki; I wasn't sharing.\n\nDine came - we inhaled and breathed it all it.\n\nWe flagged for a check; we didn't ask for change.\n\nThis all took place in a matter of 23 minutes at this nice cozy sit down restaurant.  Yeah...it was the call of the wild.", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "As a Dutchman that had heard about pierogi, I picked this place for my first encounter with them. With nothing to compare them too, I absolutely loved them here! I had cheese, potato, meat and mushrooms and they were all great! Also, decently priced and the service is quick!", "author": "Robbert H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "We use to come here every weekend for brunch, Cheese Blitz are the best as well as the rest of the menu. Lunch and dinner are awesome! Best Polish food in town. We were glad that it is still here!", "author": "Anton B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": ":) we go for brunch to sit outside and enjoy a relaxing neighborhood style meal. Key word, meal. This place has a solid collection of traditional home style classics with a focus on polish options. Pork shoulder, potato pierogies are our go too. Will it blow you away? Prob not. You will definitely leave happy though. Great experience.", "author": "Danny R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Nice place. Serving was bit chaotic but price vs quality good. Many local people eat here which I thought was a good sign.", "author": "Martijn A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-03", "description": "The food was nothing extraordinary, but it was good. And prices don't bite. \nPerfect for a simple meal on summer night. \nBathroom is not the best one I've seen, that's the only thing :)", "author": "Evgeniya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-08", "description": "not only once but twice I tried this place. Oredered a sandwhich and very very little meat on it. I def didn't get what I paid for . Pay more get less. \nA rather very snooby stuff pseudo parkslope cliental. \nThere are much better spots that you get what you pay for ....", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-18", "description": "We were walking around in this area and it looked like a nice place. I should have checked Yelp before sitting down to order. Prices are reasonable which is why they get 1 star. The food is at best \"old diner\" quality and the service was almost non existent. After our order came to our table our server never came back except to drop off the check. I ordered the bacon and egg omelette and it was as dry as beef jerky and about as flavorful as styrofoam peanuts. I would not recommend the breakfast here. Someone in our party ordered the vegetable soup and said it was good so that accounts for the 2nd star.", "author": "El O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "I enjoy their breakfast. With the exception of one waitress they are all very friendly. I also love their fresh blueberry blintzes", "author": "Shulamit R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "I have eaten here many times and never had a problem until today. I was served by a woman with short blond hair who I believe is an owner of the restaurant. I ordered a cup of soup and a half order of meat perigees. When it was served I was given the combination. I pointed this out to the server who was terribly nasty and insisted that I said combination. Despite the fact that I had not asked for a combination plate which I kept telling her she treated me with utter disrespect insisting that I was wrong and didn't have the slightest idea what I had said.  Even if I had asked for a combination, which I did not, wouldn't you think that she would've been gracious and taken it back and replace it with what I said I ordered.\n\nI truly don't understand this behavior I doubt I would've gotten this type of behavior from a regular waitress but from an noxious owner is too much.", "author": "Joel N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-05", "description": "If you want to wait for mediocre food served with surliness and neglect than this is the place for you.  Neither food nor service can save this place.  I think Yelp should have a 1/2 star rating for places like this.  Firstly, let me say that I did everything wrong.  I should have called the manager, but instead I paid and tipped because I didn't want to show out with a client I was with.The waitress brought me a chef salad with a half cooked egg on it and some oscar meyer deli meat on iceberg lettuce.  I said this isn't what I was expecting and she told me this is what I ordered.  I didn't eat it.  When she finally came back she asked if I wanted it wrapped up and i said, it's disgusting -- no thanks.  She said, this is what you ordered.  Then I looked in my glass of iced tea (half drunk) and see a bug clinging to the inside of the glass.  I Point this out to her and she shrugs.  Her whole attitude was that I was trying to keep from paying.  So for my half of the $41 tab I had 4 pierogies that were both greasy on the outside and dry on the inside 1/2 a glass of iced tea and an indictment from the waitress that what I ordered is what I got even if I didn't like it or it was inedible.  They didn't even take the iced tea off my bill.  What an unpleasant group of people who work in there.  so incredibly nasty, rude and lacking any sense of customer service.", "author": "Cally W."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Teresa’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3em1AqfP8NgnnDJRC-xw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973996"}