{"aggregateRating": {"reviewCount": 21, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Lioni's is a legendary hero shop out in Bensonhurst. I'll be honest with you, I don't get to Bensonhurst that often, so I really appreciate that Lioni's decided to open up a stand in Dekalb Market Hall just for me. Not everyone seems to understand that I'm the most important person in NYC (by extension, the world), but Lioni's gets it. \n\nKnow what they also get? Bigger is better. I actually don't even believe this statement usually,* but they've brought me around to their way of thinking. \n\nI was looking for an Italian Combo type sandwich, which an Italian hero shop with over 150 hero options (nearly all with Italian names) should definitely have. You could probably argue that all of the sandwiches are really Italian combos of a kind, but after reading the descriptions for about 20 minutes, I settled on the Little Italy. \n\nThis thing was loaded up with salami, provolone, mortadella, sweet capicola, lettuce, tomato, oil and vinegar. And I mean LOADED. It's a full loaf of Italian bread, and they stuff it. When she handed it to me, I nearly dropped it because it was so heavy and because I am so very, very weak.\n\nI went home and weighed it, which was a great idea because I now know that it weighed 2.257 lbs. This was also a terrible idea, because now I feel disgusting for having eaten half of it in a sitting, because that is definitely at least four sandwiches worth of meat. \n\nYes, it's a little pricey to pay $15 for a sandwich, I hear you complainers out there...but again, it was like four sandwiches worth of meat. And it was goddamn delicious. \n\nThat's fantastic value as far as I'm concerned, and I'm gonna do it on a regular basis until my heart gives out.\n_____________\n\n*Nor does my wife, clearly.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-10", "description": "My husband and I came here when we came to Dekalb Market. We were excited to try it after hearing such good things about the Bensonhurst location. This place is known for it's MANY sandwich options and we were jazzed to try them. This did not measure up. At all. \n\nI got the eggplant parm hero and my husband got chicken with bacon, mozzarella, and barbecue sauce. Mine was just boring. Nothing special or exciting about it. Flavors were pretty bland. My husband's was drowning in BBQ sauce and it engulfed all the other flavors so much that he really couldn't tast anything else. The proportions were way off. \n\nAbout 1-2 hours after we ate, we both started getting horrible stomach aches. The sandwiches really killed us. Lasted through the night. I wouldn't recommend this location.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "Hero's are BIG. Usually split one with my co worker. A Hero cost anywhere between 12-20 dollars. I would recommend cold cut meats instead of a hot sandwich for sure.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-21", "description": "I originally had a review in draft giving this place 5 stars because of how awesome the sandwiches were. Yet we ordered 2 sandwiches over 2 hours ago via Caviar and still haven't received them. Our courier has been there waiting since 30 min after placing the order. Definitely wouldn't order from here again... see photo, food arrived, stoked we waited 2 hours for this....", "author": "Eleni A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "This isn't Lioni Hero Shops only location, they have an old school deli in Brooklyn. When I saw the spot in the Dekalb market, I said how are they able to make the 125+ different sandwiches??\n\nWell, they are making them and making them well in this second location. The end result, this sandwich could be a weapon! It is a huge, dense sandwich packed with imported meats and smoked cheese. It's a monster brah!\n\nMy wife wanted to get to heros to take home for my sons. I said, get one hero because one they're huge. But then, this one doesn't like eggplant, this one doesn't like smoked cheese so my wife ordered a hero for each of them. One hero was a chicken cutlet with smoked mozzarella and the other was an Italian meats with roasted peppers. \n\nAll I have to say is off the chain. We came home and my youngest devoured the chicken cutlet hero in one sitting.\n\nLioni Hero Shop, the best sandwich in Brooklyn. Now in the best market in Brooklyn.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "If you've been to the original location and come here, you're in for a real disappointment. Came to grab a quick lunch to go for Mother's Day and ordered our usual. This is my first time having Lioni's at the Albee Square location and didn't think it'll be any different from their other location. I absolutely love Lioni's and it sucks that I have to give them such a low rating for this location. \n\nThere was only one staff working the cashier and making the sandwich on a busy day like Mother's Day, but we got lucky and there were no other customers when we ordered. When my sandwich was done, I had asked for a plastic knife to cut up the sandwich and he kept giving me a plastic fork. Eventually I just gave up and left. \n\nWhen we got home and unraveled the sandwich, to our surprise we got the wrong meat in the sandwich. We ordered #20 which comes with pepper ham, swiss cheese and tomatoes. VERY simple sandwich and yet he managed to give us the wrong meat. We ended up getting what I'm guessing is bologna, which my mother and I both do not consume and ended up picking off the meat. Lioni's is also known for being ULTRA generous with the amount of meat put into a sandwich and all we got was two measly slices of meat slapped onto our sandwich. There's a reason why the sandwiches are pricey and that doesn't bother me as long as the quality and quantity is there.\n\nSuper disappointed and will never come back to the Lioni's in Albee Square. I have contacted management prior to writing this review but yet have heard from them after two weeks. So here's my review as a result of that.", "author": "Cristina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-19", "description": "This was my first time at a Lioni's Hero Shoppe. It was a Good Friday at 1pm. I finally found the Dekalb Market Hall within the City Point shopping center. The mall entrances were quiet but this floor was bustling. The Italian I chose was Maria Bartilomo, #94. She looks so much thinner on television. I received a whole bunch of food. Skipping breakfast, I ate half of it for lunch. I ate half of the last half for dinner. It tastes great but I may have to come up with a plan on how to eat the whole thing. Eighteen dollars is pricey but it is for 2+ meals. I ate my meal on the standing bar while listening to Neil Young. They had a handwritten sign that they are discussing a possibility of offering half sizes. They had another sign that stated that it is cash only and that they are looking into credit card/other forms of payment in the future. I'm more of a fan of sauces which they don't really \"relish\" in.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "Finally checked this place out after going to Dekalb a dozen times. Not the most traditional place for Dekalb as there heroes are huge and therefore you probably wouldn't be able to sample other vendors. But if you're a fan of sandwiches i wouldn't pass up this place. Sandwich is not cheap but the quality of meat and cheese make it acceptable. The menu is pretty gigantic so pretty sure you could find whatever combo you could dream of. Closest thing to a jersey sub that I've been able to find in NY.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-26", "description": "Passed by this sandwich shoppe a few times while walking around the market. Wanted to get a meal to go and figured this would be the easiest thing to carry back.\n\nIncredibly difficult to figure out what you want due to the extensive menu (the options are nice to have though). Between two people got the #19 \"Mike Piazza\" and #53 \"Giovanni Da Verrazano\" (total $26). As we are waiting, you can see the cheese being put on the bread first, then rolled through the toaster oven - meat is then placed on afterwards; similar to what you would see at Quiznos. Sandwiches were still warm by the time we got home (with a small pit stop to a wine store). Piazza has tons of sliced pork, some mozzarella cheese, and not too much else. Meat is okay but the bread is rough - even the olive oil couldn't soften the bread. The Verrazano wasn't much better - fried eggplant was oily and the bread was equally tough. Tried adding ingredients to it as leftovers to no avail.\n\nReally feel the bread needs the most work here. Also, an option for half-sandwiches would be ideal as well.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-04", "description": "Food: 6/10\nService: 7/10\nAtmosphere: 5/10\n\nLioni is located in the Dekalb Market Hall, and offers a ridiculous number of sub/hero options. Actually there are so many options that it's kind of overwhelming and can be hard to find exactly what your looking for (i.e., there's a ton of permutations of Italian cold cuts, but you won't find a standard \"Italian\" on the menu).  The quality of the meats always seems good (cold cuts are great and the veal cutlet is pretty well done), and the toppings are kept cold and fresh.  Unfortunately, for me the bread on a sub/hero is one of the most important aspects of the sandwich and it just seems like the bread looks better than it is with Lioni.   On a veal parm sandwich the bread was toasted and ended up acrid and barely edible due to how hard the exterior god; on an Italian cold cut the bread went un-toasted, but still had an uncanny ability to cut the inside of my mouth.  \n\nIn an area that is oddly starved of true hero/sub shops, Lioni is probably the best of the bunch, and the extensive menu is fun, but it's not a place that I would go out of my way to try again.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "My first visit to Deklab Market was a huge surprise when I found they had a Lioni location.  I've been going to the Lioni in Bensonhurst for a few years for amazing Italian Heroes!\n\nLioni is known for having over 150 sandwiches, each with fun clever Italian references via name and slogan.  Ex.  #1 is the Frank Sinatra \"My Way or His Way - It's the Best\" or #83 the Ray Romano\" Everyone Loves This Hero\" and even #63 the Danny Devito \"Take A Taxi For This One\".  They request ordering by # given how large their menu is.  \n\nLioni's signature is their fresh mozzarella which is great on any sandwhich.  From this location, I've had the #54 and #78.  Although I did enjoy both sandwiches, I do feel the ingredients aren't as fresh as their main location.  Notably, the eggplant from the #78 which was dry, chewy, and didn't taste fresh. These are absolutely huge sandwhiches that'll almost guarantee you leftovers for later.  \n\nAlthough this Lioni is still good, I definitely recommend the fantastic main location to anyone who loves Italian culture and food.", "author": "Joe G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "I went here on a Thursday afternoon during prime lunch time in this area. Their menu is extensive and it is seriously a booklet of sandwich choices. Everything is done fresh to order so expect to spend about 5-10 minutes waiting in your selections. Most sandwiches will run you about $20 including tax.  I ordered #111. You can chose the type of bread you want which is a nice treat. It was really good! I am so glad that they lived up to all the hype I have heard about their sandwiches from co workers. I will tell you the sandwiches are big and thick- it's hard to get a full bite. I had to bite it in two parts. One bite I get the top of the sandwich with half of the items. The next bite was the middle to the bottom of the sandwich. Everything tasted fresh and the sandwich definitely can last two meals or be shared with a friend. You won't feel cheated if you share this either- you both will be satisfied and/or feel gross for woofing all of that down in one sitting. They have so many choices I will definitely come back.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "Great tasting hero shop in Dekalb market with an insanely long menu. Over 100 sandwiches. You literally have to spend time reading the whole menu to figure out which sandwich you want plus it's way too overpriced. My favorite sandwich shop, Parisi's Bakery, in Nolita is comparable to this place except that it's pretty much 5-10 bucks cheaper and gives you huge portions as well. What I don't get is, rent is definitely higher in Manhattan yet this place charges 15-20 for a hero in Brooklyn. They are definitely making a profit for every sandwich sold but they are tasty. It's just a tasty sandwich at premium pricing.", "author": "David H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "There are over a 150 sandwich combos you can have here! Your tastebuds will never be bored!!! All of the sandwiches are made fresh to order! I've never been disappointed with whatever I've ordered!!!!", "author": "Tony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "I will say, the menu is as overwhelming as the size of the heroes here.  There are over 150 choices and they all have catchy names like the Sophia Loren and the Vic Damone.  I went with a Ray Romano with Swiss cheese.  I was shocked to find out 2 thin slices of cheese came up to $2, totaling up to a little over to $14.  Now I know why they had very few customers.  I have half a hero for later because it is quite the monster.  There were quite a few choices that I could tried, specifically the ones with their homemade mozzerella.... hey  maybe for another day.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "I love a good Italian sub, and I was thrilled that I could get one from Lioni at De Kalb Market in Downtown Brooklyn instead of having to schlep to the wilds of Bensonhurst. \n\nYep, absolutely, a delicious Italian sub, good even at the high prices they charge. Quality ingredients, good bread. Up there with the best Philly Italian hoagies I've had. But the horrible service makes me highly unlikely to return. \n\nThe folks from the mother ship in Bensonhurst really need to spend some time at De Kalb Market and see how inept and apathetic the service is there. Orders took forever to come out and were incorrect. When the orders were eventually done, the cashier made very little effort to announce order numbers. The guys behind the counter huddled together scratching their heads over the \"intricacies\" of an order. Lots of people just standing around waiting (and waiting and waiting) for their sandwiches to come out; you could practically see the cobwebs. \n\nThe ludicrous number of options on the menu don't help. \n\nIf these folks whittle the selection down to a couple dozen options (you can always order your own combination) and put in a non-moronic staff, I'd happily pay $17 for a sub that good. Otherwise, no.", "author": "Bill R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-14", "description": "What a disappointment. Big, bland, and expensive. I think I would be ok with this place if it wasn't so damn expensive. The sandwiches are really big though so in a sense you are paying for two sandwiches. I guess it would be ok to split with another person. I feel like for this to  really work the sandwich ingredients really have to be top notch and they are just ok. I had a prosciutto, mozzarella, and pesto sandwich and something was a little off with the prosciutto.  Pesto was just ok. Damn sandwich was just shy of $20.  Won't be trying this place again. Too risky considering the price.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "The menu here is overwhelming at first glance, but the long list of sandwich options are slight variants of one another.\n\nTheir meatball marinara sub was slightly dry inside, while the bread was toasted a bit too much. WAY to crunchy with each and every bite, leaving crumbs of charred bread on my lap. I would prefer a soft hero, not one cooked well-done, but that's just me. \n\nI might come back to try something else, as their sandwiches are HUGE and are two meals worth.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "I haven't been to the original location but I was extremely impressed by this one. I've been to Dekalb Market several times and totally overlooked this stand previously, but I learned my lesson. We ordered #21 Jerry Vale with prosciutto, mozzarella, pesto, and olive oil - it was delicious and there was a very generous portion of meat on the sandwich. We split this sandwich between two people AND still had leftovers. Pro tip: Before the movies at Alamo, go down and grab yourself a sandwich here and enjoy.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "I liked the Bensonhurst lionis. This one is crap. It's so filthy I got food poisoning. The staff doesn't care. The food isn't fresh.", "author": "Z B."}], "servesCuisine": "Sandwiches", "priceRange": null, "name": "Lioni  Hero Shop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/3ZYpirRPIHKSACFJhhRw1Q/ls.jpg", "@type": "Restaurant", "telephone": "+19293794082"}