{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-23", "description": "Overpriced for the size and quality of the burger. Cherry Lime Ricky was good.The burger patty itself was just okay. Now why I wouldn't come back is they served cold bacon and cold caramelized onions on the burger. Like out of the refrigerator cold, very weird. Why not warm these things up on the grill when making the burger? Lazy? For the price and reputation I was expecting more and won't be back.", "author": "Trini S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-17", "description": "I've been here twice to grab something quickly for breakfast. Similar to what other people have said in their reviews, this establishment is definitely overpriced. The poor customer service also doesn't help. When I asked the woman at the counter about pricing for some of the breakfast items (which didn't have a price listed) she seemed bothered, and ended up turning around and talking to the cook -- so much for friendliness. It's safe to say I probably won't be returning here.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "This might be New Yorker blasphemy but I think these burgers are the equal or better than Shake Shack. Typically, I've had them delivered (when they used to be on caviar) but now go into DeKalb Market for pick up. \nBurgers are charred and flavorful. Fries are great, always salty and very crispy. The chocolate shake is super chocolaty and crazy thick - had to use a spoon to scoop it out! \nThe only thing is I wish the customer service was a bit nicer - the girls working the register were more interested in their friends (who were leaning on the counter) rather than expediting the orders. Just leaves a bit more professionalism to be desired. \nOverall, a top option when deciding which vendors to go to in the food hall!", "author": "Julia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Im guessing I was fortunate to have a good interaction with the workers here. (A woman took my order). The food came out within minutes of me placing my order. The burger was very delicious  but super tiny for $8.00. The French fries is a separate charge. They were great as well but were bigger than the burger. Like I love French fries a wholeee lot but if I'm ordering anything with it, I don't expect that an order of French fries is suppose to be bigger than the burger. Aside from portion sizes, I know I'm gonna plan on eating it again just because it's not too much places that makes turkey burgers downtown.", "author": "Shamorra B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Came here on the urge for a burger. I passed on McDonald's and thought why have fast food when I can have a good old fashion American burger?\n\nOrdered the single burger with lettuce, tomato and cheese. The patty itself was well charred and wasn't too greasy. Just wish it didn't cost me $9 bucks for a little bit of Americana.", "author": "Stanley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "This burger joint is the spot!! I got the signature burger with fries and it was delicious (medium rare ofcourse). However my only problem is that the signature burger with fries came up to 18$ which was pretty expensive if you compare it to the amount of food you get. But other than that the burger was really good and the fries was good. Staff was friendly and helpful, I will not likely go back to get another burger that's how tasty it was.", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "This is likely the most reasonable and regular place to grab a bite to eat.   Every time I go by their busy. The employees are sort of aloof, but I think it's because they stay so busy.  So this time I waited it out and purchased a single Burger with lettuce tomato onions and cheese. It was only $7, so I added a bag of fries which was only $3 more.  The food came out pretty quickly and I was glad it was made to order. The burger was cooked medium well, but not dry. The order of the ingredients was weird (bun, ketchup, onion, lettuce, tomato, pattie) but it was nothing to swap it around. I'll likely come here again when my bf insists on coming to this food court.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-22", "description": "The workers are incredibly rude and disrespectful. Will yell at you, will yell at each other, and they never apologize. Food is just okay, though also overpriced, so it's not worth putting up with people offending you to get it.", "author": "Elizabeth A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-21", "description": "This was my second time coming here. The first being several months ago. I enjoyed my burgers and fries then. I went back yesterday and the cashier was very unprofessional and kept adjusting his underwear or pants. They wouldn't let me get a well done burger. They said they only do medium well. Picture of what my burger looked like is below.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-26", "description": "Just to reiterate what another reviewer said - the people who work here are a-holes. I asked for some water from their soda machine to put in my 2-year old daughters pink sippy cup and they refused (on Christmas Eve I should add), saying \"they don't do that.\" I had to have the girl repeat herself because I was shocked that they wouldn't give a toddler a bit of tap water. Might want to work on that customer service Andrews!\n\nThere are far better places to eat in Dekalb market hall with better service, I wouldn't waste your time at this booth.", "author": "Debra L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "So this burger spot takes five guys burgers and makes them with better quality ingredients. When I bit into their burger it immediately reminded me of five guys burgers, which happens to be one of my favorite burgers anywhere. But after a couple more bites i could really tell that the ingredients here were top notch and that they were able to get the same flavors without all the grease. I loved it.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-02", "description": "The food is ok. The cashier is rude. She is multitasking and she doesn't pay attention to the customer and you never know if she's talking to you. She should be nicer. She was giving me my order and I asked for more mayo and she got annoyed that start picking another order before giving one more.Never coming back.", "author": "Sabrina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "While on our Dekalb Market food journey we also had burgers and fries. I am a well done burger type of girl. I like my burger pretty much charred. I know taboo but I prefer my meat fully cooked. Andrews will not do well done. Still craving a burger I gave in to their medium well, as their max cooking temp. I have to say it was very good, no red which made me happy \u0026 very flavorful. The fries were a bit too salty for my preference but not bad at all, nice little crunch. Overall, really nice burger give it a shot.", "author": "Millie R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-06", "description": "Incredibly disappointing.  Real bummer as I was excited to try this spot after reading a press piece on it.  Customer service is terrible.  The young black lady working the register is slow and slightly aloof.  It took her about 7-8 mins to get through a transaction with the person in front of me.  The person in front of me gave me a look like \"what the heck is going on?\".  She would talk to the kitchen staff or an older guy that I'm 99.9% sure was Andrew that was hanging outside the stand (looked like the owner).  He didn't seem to care that there were customers waiting as he was talking to the cashier and kitchen staff like it was a private conversation.  You can tell that Andrew is one of those guys that has \"peter pan syndrome\" someone that has never really grown up just by the way he holds himself and speaks when there are clearly customers waiting.  The kitchen seems inexperienced too.  They were slow and checking the burger over and over again.  It's not a filet mignon its a smashed patty doesn't need to be so examined and checked cooks pretty quickly.  MY BIGGEST CONCERN was the black guy working the burgers was talking to a man who was working with raw meat towards the front of the stand.  The guy doing the burgers kept on leaning up on this guys raw meat area making me super worried for CROSS-CONTAMINATION.  The burger guy would lean up and place both his hands up against the table where the raw meat was about a foot away from him.  Really dumb and dangerous.  Additionally, when I was waiting a guy came up and asked how big a single patty was and the black woman said 6 oz...and then they are quarter lb patties.  The guy responded saying well a quarter lb is 4 oz and she said ours are 6 oz a quarter lb.  The guy looked at her oddly and said no thanks and walked away.  After the guy left she started complaining about the customer to ME! Like what? Probably shouldn't talk negatively about customers or potential customers to another customer!  Mind blowing.  I'm not going to complain about price bc I knew what it was going into it.  Yes, they are expensive.  It is what it is.  The burger itself wasn't anything special.  Not much flavor.  I hate to say this bc I don't think shake shack is the end all be all but shake shack is definitely better than this spot.  I did think the fries were pretty solid though.  \n\nOverall, customer service was terrible.  And quite honestly customer service was pretty bad across the board at this food hall.  Seems like a lot of these spots are satellite locations and there isn't much oversight or training for staff.  You can tell they don't really care about customer service and customer feedback given this page is UNCLAIMED.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-06", "description": "Funny that other reviewers commented about this place not making well-done burgers. I had the opposite problem; I wanted to try a burger here but they would not make it medium rare or even medium. Medium well or nothing. If I want a hockey puck I'll go to the NHL store.\n\nI can't take a burger place seriously that will only cook it to one temperature - shows a lack of either A. Cooking skill B. Quality of the meat or C. Willingness to satisfy customers. Ended up not trying it at all.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "Unbelievably rude people working at this place. My pregnant wife asked for a well done burger and they said \"she wasn't pregnant enough\" because she is early on and not fully showing, like the extremely pregnant women next to us that got a well done burger. I've never experienced anything like this at any restaurant. DO NOT EAT HERE. Actually will be taking this one a step further and reporting to better business.\n\nOh, and the burger was mediocre.", "author": "Ari D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Fell in love with their burger! Perfection. Juicy. The bun was the best too. Soooo soft.", "author": "Gregory S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Excellent burger, but slow service. My son (15 y.o) said it was the best burger he has ever had. My wife said not best, but really good. I ate elsewhere.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Andrew's cheeseburgers at down to earth delicious. I've been here multiple times and the quality is consistently great. My staple choice of toppings is mushrooms and caramelized onions and it hasn't failed me so far. The burgers are juicy on the medium side of medium well which I personally like. The fries are crunchy with just the right amount of salt.", "author": "Julia K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "What's up with the turkey burgers!?  Get it together and stock more turkey.  People love your turkey burgers.  \nI've gone at least 10x and been told they're out of turkey burgers.", "author": "Alex B."}], "servesCuisine": "Burgers", "priceRange": null, "name": "Andrew’s Classic Roadside by Hard Times Sundaes", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/dzDd5bll5qZj2jA4kOvHVA/ls.jpg", "@type": "Restaurant", "telephone": ""}