{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "Food is great, when you can get it. Half the time they don't have the turkey burger, which is a shame since it's hard to find a good turkey burger in the neighborhood. Quite disappointing walking over the and then losing the crap shoot. \n\nUPDATE: still having way too much trouble keeping those turkey burgers in stock. Honestly, the number of times I've been told they have no turkey makes me wonder why they even put it on the menu. The food is still great when available.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Do not understand what is going on with these reviews - I was a big fan of Hard Times Sundaes when it was a food truck in Mill Basin (as in, a big enough fan to actually go to Mill Basin to get it). It was always clear to me that Andrew was making my burger and I always felt he was very respectful of the food, even reverent. I am so happy Hard Times Sundaes has become even more accessible at Dekalb Market.\n\nIf you're paying $17 for a burger, you're doing it wrong. If you have high maintenance requests, you're doing it wrong. If you want to question the motives behind the madness, you're doing it wrong. If you want an unctuous, cheesy burger that would stain your paper bag with grease stains and smell amazing the whole way home, look no further. This burger is truly delicious. If you're interested in trying famous burgers of NYC, you must be sure to include Hard Times Sundaes on your list.", "author": "Rose B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-13", "description": "The owner wants you to pay top dollar for a burger. And then has to the balls to tell how you have to eat the burger and what temp he will only serve it to you.. please don't bother stopping at this place ..not worth it. And the guy at the register  is very rude...", "author": "Billy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "So we stopped in the food court after a long day at the Bronx Zoo and an equally long subway ride.  So we saw some signs for the food court and went on to find it.  We went down the escalator and I went crazy.  It smelled so good.  They had so many different choices. I wanted to try everything, but after the long day a burger and fries was what I really wanted. We got the signature burger and fries.  It was simply awesome.  The fries were thin and crispy, almost like a potato chip.  \n\nEverything was great.  I would come me here and get a burger and fries again.  Also the price we paid seemed like a good value for what we got!", "author": "Ben S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "The owner of HTS, Andrew, was extremely rude and abrasive to my friend and I.  I have read articles where he brags about \"running with the bad kids\" and that was very obvious in person.  After ordering some burgers from his, I asked Andrew for a little more information in his burgers.  At this point be became very aggressive for virtually no reason and starting yelling at me.  \n\nIf you look at the other reviews on this thread, it's clear that he has a serious anger problem.  Probably overcompensation for something...but I'll keep it G-rated.\n\nI highly recommend against going here.  It appears that Andrew has no concept of how to give good customer service and, sad to say, the burgers really weren't very good at all.  Shake Shack is much better.", "author": "David K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "This is the perfect burger. \n\nThe chuck has the perfect fat content and is cooked to the perfect temperature resulting in a juicy patty full of flavor held in by the perfect sear. It's perfect.  \n\nThe patty is served on the wonderful Martin's potato roll, arguably the best vessel of all time. Consider any review insulting the potato roll irrelevant. Try this burger as soon as you can.", "author": "Casey S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-23", "description": "Ridiculous! I ordered the chili and was given a half filled cup of chili. When I asked to have more chili put in the cup I was told , \"That's how the manager wants it.\"  Eight dollars for what amounted to three, maybe four, tablespoons of chili is insane.", "author": "Olivia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-17", "description": "Rude- yes. Slow-yes. Bacon, Egg \u0026 Cheese- the best ive ever had. Hands down. Have had it at least 4 or 5 times and it's consistently the best.", "author": "Jase M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "If my memory serves me right, which after years of head trauma, rarely does, I believe this is the only place serving a burger in the DeKalb Market Hall, if that's the case, you could say this is the best burger in the market. However, if you took about a 4 block walk west of the market, you'd find yourself at Shake Shake and a better burger. Now don't get me wrong, I'm not touting Shake Shake as the greatest burger, just using it as a comparison. And it's a fair comparison. The burger from Andrew's, or Hard Times Sundaes, I'm not sure which to call it, is a thin, smaller patty (maybe 4 oz) cooked on a flattop, served with American cheese (and bacon in my case) on a Martin's potato bun ... sound familiar? It's a pretty good burger, but nothing special. It comes very close to the beloved by many, Shake Shake, but the burger is just slightly less juicy. I will say this, their bacon is better than Shake Shake, though that isn't much of an accomplishment, considering Shake Shack is rather notorious for undercooking their bacon.\n\nIf you want a truly good burger stop by Brindle Room, Minetta Tavern, or The Spotted Pig ... none of which will be served on the preposterous, Martin's potato bun.", "author": "Mike F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "Rude, dismissive and not at all tasty. My sister and I hit up the Dekalb Market Food Hall last night with high expectations, so imagine our disappointment when she bit into her burger only to be greeted by cheese (not what she ordered) oh, and.....a PIECE OF PLASTIC in her food. \n\nTo add insult to injury,  when she went back to the stand to ask for a replacement,  the cook proceeded to use his gloved hands (the gloves he was using to handle other people's food) to man handle the burger and fries and then accused her of lying. We didn't get a replacement meal, or a refund. Just left the food and walked away. Really appalling.", "author": "A L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-24", "description": "The burger was so tasteless I couldn't even finish it (and I love burgers).  The ingredients stale and the meal overpriced.  Very disappointed!", "author": "SS F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-22", "description": "The burgers here are actually pretty good, but the customer service and cleanliness is not ok! Waited 20 minutes on a VERY slow weekday, not even during a peak hour. There were only 2 other customers and there were 5 people on staff. The guy cooking the burgers stopped halfway through to reach his hand into the tip jar, and then he didn't even change his gloves??\nMe and another guys burger sat for a few minutes while the girl working there made one of the other employees a milkshake, she then screamed my name and was really rude when she got around to handing me my burger. I can usually deal with rude people, but yeah just go to Shake Shack.", "author": "Ali L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-31", "description": "If you like your burger well done DO NOT GO HERE ! I asked for a well done burger, and the cashier goes , we don't do well done burgers here. So I asked not even upon request , he says no it's the owner policy. How do even expect to keep customers if you don't even try to accommodate their needs? The burgers are very small \u0026 mediocre if anything with pink blood coming out. I can pay the same price down the block on court st for shake shack and get my burger well done !! Will be reporting this piece of shit to the department of health \u0026 better business bureau .", "author": "China M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "The breakfast burger was unique.  The combination of the poppy seed kaiser roll complimented the sandwich.  The burger patty was juicy and is cooked to the perfect temperature beef should be.  I also liked the fact that the egg was not super runny.  This was a joy to eat.", "author": "James D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "French fries were fine, but they mixed up my order and were incredibly rude and gave me a hard time when I tried to ask for a new burger without cheese. Staff spent time with chatting with each order as orders sat on the counter, getting cold. Don't bother with this place, you can do so much better for the price.", "author": "Toby L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-21", "description": "this upset my stomach was a complete rip-off. 17$ for a crappy burger with some decent fries is not worth it....", "author": "Ruskiy P."}], "servesCuisine": "Burgers", "priceRange": null, "name": "Andrew’s Classic Roadside by Hard Times Sundaes", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/dzDd5bll5qZj2jA4kOvHVA/ls.jpg", "@type": "Restaurant", "telephone": ""}