{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "I've gone to BAM only a few times, but I've never been disappointed with any of the performances I've seen here. The programming is always fantastic and culturally/artistically relevant. It's an amazing venue and that is part of the fabric of NYC culture. \n\nI saw Kid Koala here for Nufonia Must Fall, and the show was amazing. The venue had wonderful acoustics. The seats were uncomfortable, but the beer I bought at the concession helped. \n\nImportant note: You cannot take bottles that you buy from the concession inside the theatre, but you can purchase a BAM cup, pour your bottle drink it, and then take that onto the theatre during a performance.", "author": "Jeannette L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "What an awesome theater! So many of the theaters in Brooklyn are pretty gross and not managed very well. BAM Rose Cinemas is clean and offers a lot of comfort while you view you film.  \n\nI've actually only been here twice but I will keep coming back! All I really have to say is get here early! We arrived at 1:40 for a 2pm show and it was already sold out. Granted it was a very popular film in the 1st 2 weeks of opening but films here sell out quickly because of the small theaters. We ended up buying tickets for the next show which was at 4:50. We were advised to return by 4:10 because the theater would be crowded. We entered at 4:15 and as suspected it was already very crowded. We had to sit in the last row. I'm assuming it's not that busy all the time but be prepared if you're seeing a \"in demand\" movie. \n\nFortunately, there are lots of great restaurants and bars in the area. So if you have to wait around for a bit until another show you have a lot of options for food and drink nearby.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "I've been a movie nerd since I was a kid. My dad would always watch horror/thriller movies and he would always ask, \"who did it?\". I was trained to figure out the culprit in every film. \n\nAnd I haven't found my spots to watch movies in NY.  That being said, I've been wanting to go to BAM Rose Cinemas in my quest for my favorite NY theater. When BAM announced their Witches' Brew series highlighting films like Hocus Pocus, Häxan, Witches, the Craft (a fave) and Suspiria, I was ecstatic.\n\n Suspiria was the must in my book. Most of the films I watched a million times. Suspiria is a classic, horror, Italian film and definitely one of many Dario Argento's masterpieces.This film is a must in a theater atmosphere. The evening showing was sold out almost instantly. It would have to be a matinee. I actually do enjoy matinees especially rainy Sunday afternoons. This was a chilly Saturday afternoon but good enough. The matinee prices are also only $10. A steal when it comes to NY. 15 minutes ahead of the movie and it was already packed. The show sold out. I loved the intimate space. There was also free buttons for the Witches Brew event with the wicked protagonists.\n\nThe film was stunning, eerie, beautiful and truly brilliant. People found so many scenes funny. The dialogue is on the campy/kitschy side but that only adds to the masterpiece in my book.\n\nI forgot my favorite thermos and had to ride allllll the way back. And they had it waiting for me right at check in.\n\nI can not wait to see even more movies here!", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "BAM! And then it hits you!\n\nBAM is great. For movies, for performances, for a nearby night out.\n\nI've seen a bunch of movies here, and several different performances. They never disappoint. It's easily one of the biggest things I miss about living in Brooklyn.\n\nFor performances, save the wine/beer glass and reuse it again and again on future trips!", "author": "Mickey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "This is an incredible theater, WOW. I went to see Malpaso Dance Company (highly recommend if they tour here again) and was very pleased with the view from my seats. I paid $30 for first row balcony seats and had one of the best views. It was a dance show so I definitely appreciated being up above.\n\nThe theater itself has a very cool vintage vibe and the seats all have some sort of elevation to help you have a clear view regardless of who's sitting in front of you. You should definitely catch a show here.", "author": "Lissette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "It's hard to summarize BAM just because it consists of so many different buildings and spaces. I've been to concerts and shows at the Howard Gilman Opera House. I've watched movies at Rose Cinemas. I visited the rooftop terrace of BAM Fisher back before all you could see was new construction. And of course, I also took many school trips out here as a kid. There's something for everyone. Be sure to get a yearlong membership with your NYC ID! It also qualifies you for some kickass local discounts!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Like Emeril, I love me some BAM! There are live shows and movies playing all of the time. I've been here for cinema, plays, events, and they were all fantastic. The staff is very friendly and accommodating. Came for a concert too and the sound system was great. I highly recommend this artsy and old school epicenter of experiences.", "author": "Via G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "My favorite movie theatre in Brooklyn. What I love most about BAM is that their films are carefully curated. I could know nothing about a movie, show up to watch something and I'm guaranteed to like it. The theatre itself is beautiful and since it's sandwiched between Ft Greene and Slope, there are plenty of bars and restaurants to check out before or after your movie. The BAM cafe will host separate events like live bands, music and art gallery displays from time to time. It's also a nice place to catch a drink before a show at the Opera house. There is so much to do in this gem of a building. If you've never been you must check it out.", "author": "Maya T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "I recently used my new BAM membership to get half off movie tickets ($7 - thanks ny id). The movie theater we went into (#3) had a good sized screen but we were forced to sit up front (too close for my liking) since the theater was packed (it's pretty small). I don't know if that's normally the case or the fact that we went on a saturday.\n\nYou should note - the showtime of the movie is the actual time the movie starts, and not the time the preview starts. Previews run before the showtime so don't arrive 10 minutes late as you normally would with other movie theaters.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "I caught the recent Robert Plant show here at BAM and I was impressed by the venue.  The seats are comfortable, the viewing angles are excellent and I really like the overall cozy feel of the place.  \n\nThe acoustics are also excellent and sound quality is solid.  It's also very easy to get here if you live in Manhattan, thanks to its proximity to the Barclays center.  \n\nBathrooms, like many other venues, can get pretty congested.  But that's just one minor blemish.  Otherwise, this is definitely a great choice if you're looking to catch your favorite artist or orchestra play in town.", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-07", "description": "The movie selection is great and the old school architecture is fantastic.  HOWEVER, the seats are so cramped that you're sitting almost on top of one another.  In getting to my seat, I accidentally knocked over this girl's soda.  Space is way too tight.", "author": "Paul H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-20", "description": "Yo what is up with this place and the epically long god for sakes time it takes to turn movies over, it's the same frigin movies all month AT LEAST with little to no turn over...even the bad ones!?!", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "BAM cinema theater in Brooklyn it's the best in Brooklyn. Their films go from rare independent, underground, avant-garde, indie, documentaries to Oscar nominated Blockbusters. Their theaters sizes varies but they're always clean and what's best NO ADVERTISING while you wait for your film if you like to arrive early to grab good seats. \nThe section where the cinemas are located within the Majestic building was originally a music hall and transformed into BAM Rose Cinemas in 1998. \nThis is an absolute gem in the neighborhood!", "author": "Varenka R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Got my Blackness on at opening night of year's 'Dance Africa.' We miss you, Baba Chuck. AGO!", "author": "Candice K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Came here to watch movies with a few friends. Definitely a classic location. The movie theater was packed, but pretty small. It was nice in a way, though, kind of felt like you were watching the movie with 300 of your closest friends, lol.. there was talking during the movie, but people's voices don't really carry and the crowd was very laid back and respectful. \n\nBecause it's more of an artful space, the previews were shorter and, honestly, more interesting. There were no reminders/ annoying jingles to encourage turn off your phone (I never heard a phone ring) and another bonus: there were no ads encouraging you to buy concessions or other products. Now THAT was much appreciated! \n\nI purchased an adult ticket at a kiosk for $14 and a large bag of popcorn for 4.75. Popcorn was warm and buttery, but I couldn't eat the whole bag. I enjoyed the entire experience.", "author": "Kenya K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "Really love this place! It's within close proximity to home, the selections are amazing, and the space is clean and incredible. Love, love love!", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "So.... \n\n1. there's no huge stadium style seating\n2. the snacks/food offered are nothing special\n3. while i love convenience of buying tickets online, I'm not a fan of the $1.50 surcharge.Buying online reduces labor, why does it cost more ?\n\nDespite this i really enjoy watching movies here for two reasons:\n\n1. They always have the movies that interest me. Usually 2 or 3 at the same time.\n\n2. the audience. I've never encountered serial texters. constant chatterers or unruly kids here.This theater tends to attract an audience that seriously enjoys film.I'm far from a film aficionado, but appreciate an audience that is well mannered at the movies.\n\nIf it wan't for surcharge this would be a 5 star theater.", "author": "James F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "This is my new go-to art-house theater. My husband I miss our theater back in Orlando and that theater only had one screen. Imagine our enjoyment when we discovered we had 4 screens to choose from!\nWe bought tickets recently for the latest Jane Austen period piece. It had already been out a couple weeks and we were able to get tickets but the theater was small and almost full. I would say if you know it is a popular movie to buy your tickets in advance and get there early to reserve the best seat.\nI can't wait to go back to see upcoming documentaries or newly remaster foreign films. \nThe concession stand is typical cinema fare and regular cinema concession prices.\nMy only complaint, because the bar was set high for me, is that wish they sold beer and wine and upgraded snacks to enjoy with the movie. Our theater back home was a dining theater and it was always a pleasant experience to share a bottle of wine and truffle popcorn with a group of friends.\nI will still gladly accept my 4 theaters and a nice meal before/after instead.\nGreat place for Brooklyn.", "author": "Leala V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "They show new indie movies mixed with events like their current spectacular 80s series with the likes of \"sex, lies and videotape\" and \"River's Edge.\"  A star-studded \"Kicking and Screaming\" showing brought Parker Posey, Josh Hamilton and Chris Eigeman to BAM, and I had the honor to meet Brooklyn legend Noah Baumbach in person. My quip about the similarity between me and the \"Greenberg\" protagonist made the encounter awkward enough to be a scene in a Baumbach movie.\n\nThe only downside is the men's room. The urinals look like they were designed in 1936 and have to kept in place due to their landmark status.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "This is a great space, love how they've kept the old feel to the place yet upgraded to the times.  The upper level is beautifully decorated especially the huge windows. Look forward to coming here again in.", "author": "Esmeralda C."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}