{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Beautiful theater experience. If you appreciate the arts this is the place for you. The building is beautiful and has an antique vibe. The staff was nice and courteous. The sound, commercials and ads all added up. Though these things generally go unnoticed in most theaters, here it is given special artsy attention. \nAnd the popcorn of course.", "author": "Gittel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "I've been to Harvey and Fisher, as well as inside the lobby of the main space.  All great spaces, in their own right.  I've never encountered an unprofessional or discourteous staff member.  Temperature is always good.  Spaces are clean.  Fisher is an accessible space for anyone with impairments.  And I have never seen anything her which I did not like.  Stellar work, overall.\n\nOnly 4-stars due to location, as it isn't the most convenient location for me to get to....and it's always so confusing (for me) where to pop up to be closest to the appropriate performance space.  And reception for my ATT iPhone is pretty crappy in that area of BK.\n\nStill, highly recommended venue for some of the best and diverse art the city has to offer.", "author": "Christopher M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "This is my favorite cinema in the neighborhood.* It's not just because they have a carefully curated selection of films that includes:\n\n-topical local selections (think Central Park Five) \n-excellent indies (think Fruitvale Station) \n-nostalgic favorites (think The Secret of Nimh, Enter the Dragon) \n-things you didn't know existed but might enjoy (think Live Action Puppet Shorts)\n-the mainstream flicks you actually want to see (think Wolf of Wall Street or Inside Llewyn Davis) \n\nIt's also because the cinemas here are actually clean, civilized places. If I was to drop my jacket on the floor here I would pick it up, rather than assume it was lost forever, permanently stuck there by a horrifying amalgam of soda residue and bodily fluids.\n\nAlso, the online ticket purchase/pickup is so quick and painless. I don't understand why I pay a surcharge for something that's easier for everyone involved, but I do like never having to speak to an actual person. \n\nThe worst things you might encounter here are (1) pretentiousness and (2) a pothead knocking over a Wet Floor sign, and the painfully awkward laughter that ensues. The former people usually keep to themselves though. And the latter...wasn't me. I swear. \n____________\n\n*And by \"neighborhood\" I also mean the surrounding four neighborhoods or so. Really, almost anywhere except for the Nitehawk. And maybe the Sunshine.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "I came here to watch an event at the Howard Gilman Opera House. A good theater to host an event. Good amount of seats for a few hundred people. No bad seating in the theater even if you are on the top level of seats. Sounds travels real nice in the house.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-09", "description": "The building is a gem \u0026 ambiance inside great. Just hope the city does something about the problem once the sun goes down of scores of big rats running around the surrounding streets. Must be all the construction in the area.\n\nIt's not fun to come out of the theater in a good mood \u0026 have to run to your parked car. :( Don't plan to return.", "author": "Richard K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "It's BAM! The community staple that has a movie theater. \n\nI get excited just b/c it's clean theaters allow me the pleasure of relaxing and not worrying about a critter scurrying across my feet.. \n\nI like that they have the blockbuster hits and artsy fartsy movies. It plays to my love of different kinds of movies. I wish they showed more than 4 movies at a time, but i get it they want to keep it small. \n\nAlways an option when going to the theater!", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Saw Rimbaud in New York at the Fisher.The play leaves a lot to be desired but it's worth a shot .The theater itself is comfortable and has good sight lines.I'd like to see something better here at some point.I hadn't been in this neighborhood in years and I enjoyed exploring it.Keep in mind there are a number of restaurants in the area.We parked on the street.you are almost across the street from the Barclay Center.", "author": "John K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "You're bound to encounter two types of movie-viewing audiences in New York City:\n\n1) The audience that brings outside food in styrofoam to-go containers into the theater, checks their phones throughout the movie, and then yells obnoxiously at the screen.\n\n2) The audience that chuckles at every single nuanced tic from an actor, respectfully whispers about art and form and mise en scene to one another, and assumes they are entitled to both armrests.\n\nBAM Rose Cinemas falls under this second category. Their oft-impressive roster of indie flicks and foreign films is the reason so many pretentious liberal arts theorists flock here. And I will choose this breed of pretentious asshole over the obnoxious asshole any day. Hell, I'm probably one of these pretentious assholes myself. I mean, I'm mocking high-brow, amateur film critics by writing a self-referential Yelp review about them. So meta.\n\nMost cinemas in the city are like Target on Black Friday, just hordes of unruly citizens you want nothing to do with. By contrast, BAM is a stroll through Prospect Park, pockets of semi-pleasant citizens you, well, probably still want nothing to do with, but at least there's less of them. It's super clean, in fantastic condition, orderly (meaning the audio and video work for the entire running time of the film), and for the most part comfortable (so, the seats are a bit small). It feels like film class. With popcorn. While still being a legitimately great date spot. Unlike the chaos of most New York movie theaters, BAM Rose Cinemas is a place of civility.\n\nThe suburbs don't score higher than the city in many categories, but film theaters are certainly one of them, at least for the casual movie-goer. And premier venues like BAM Rose Cinemas dial it back to that suburb speed (a compliment). If I see a movie playing at both BAM and someplace a fraction closer in proximity to my apartment, I will likely still choose BAM. Unless I'm being super lazy, but then that one's on me.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "The theaters are small, but upstairs, in the Rose Cafe, it's gorgeous. The lights transcend you to a different place. I imagine this is how heaven would welcome you. It's a really beautiful space for events. I'd definitely go to an event or lounge like this.", "author": "Mallory L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-11", "description": "This used to be my favorite place to see a movie but I just discovered they got rid of their matinee ticket prices. This was the only way I could afford to actually go see a film in the theater. Ticket prices everywhere have gotten so insane so the matinee pricing was great. I asked the ticket seller and she said yes they had stopped it weeks ago. It is a shame, not all of us can afford the full price. \n\nAlso, another thing I used to love (although I know not everyone liked) was that they actually started the movie at the start time so the ads/previews were played before it. The last two times I have gone the ads/previews started at the start time and went on for like 15 mins, just like a the big chain theaters. \n\nSadly BAM Rose Cinema is starting to lose its arthouse charm.", "author": "Sara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I hate going to the movies these days. I love going to the movies. I love seeing interesting things projected on big screens with engaged audiences. I hate crying babies and morons with laser pointers and idiots who think they're in their living room or at a bar. I hate most theaters. \n\nBAM is different. The movies they show tend to attract better crowds, I guess? People aren't giant assholes. The films are good. The seats are mostly great. They aren't dicks about us smuggling in a metric assload of popcorn and two bottles of wine which we never do. The prices are totally reasonable if you're a BAM member. \n\nThis place kicks ass.", "author": "Brian V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "Where do I begin? I love BAM. I suppose that's a good start. Why do I love BAM? Because where else can I catch film, theatre, live music, festivals and grab some drinks?  \n\nLove catching films here but you can just read my review of the Rose Cinemas if you want that. Lets talk about plays. I've seen Sam Mendez direct plays and Kevin Spacey star at them at the Harvey. That's pretty serious stuff for someone like me. (Even though I think A Beautiful Mind is overrated, they both have much much better work. It upsets me both are best known for that terrible terrible film) The Harvey Theater is a nice intimate place to catch a great play. Check the website often because you don't know what celebrity will decide, \"Oh I want to do something cool and different. I'll perform in Brooklyn\" (Lets be real, you know that's what they are thinking) \n\nThey have the BAM film festival every June, which kicks ass. Rooftop screenings, directors Q and A, extended cuts, short films. It's a serious orgasm for film junkies. I plan to hit it up heavily again this year.\n\nThis year I finally got to hit up the Crossing Brooklyn Ferry festival. In only its second year, it showed why it was such a hyped event and I hope this becomes a staple at BAM for years. I walk into BAM with a free beer sampling from Brooklyn Brewery. A sampling means, getting two samples and then going back on line. Walk on line, proceed to front, drink and repeat. Over and over again! Hey I needed to try them all.................   a thousand times. They also were selling Brooklyn Local One, which by law I must get. I saw some bands I had never heard of before and rocked out to them. JAPANTHER FOR LIFE! Though I was waiting on Brooklyn's own TV on the Radio. Great performance which I would say capped off an excellent event. The BAM café is awesome. Great drinks and tasty brews, this is a hidden gem I honestly wasn't aware of before the event. It's gorgeous inside and a great place to catch a performance. Not to mention a dance party. Made tons of new friends at the event. The experience was the highlight of one of the best days of my life. Keep the Crossing Brooklyn Ferry going.\n\nSo whatever the reason, BAM has something for you, trust me.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "The most polished theater in all of Brooklyn in all facets, including picture quality and interior. I wish I had known how stellar this theater was years ago, but it was relatively new when I was a kid, so I came to know it better more recently. I've seen the the cinema packed to the brim sometimes, reflecting how popular this theater is and how widely appreciated its selection of films continues to be. I may be late to the party, but I'm enjoying it all the same.", "author": "Brett S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "My favorite place for artsy fartsy movies in Brooklyn. Always clean, relatively cheap ($14-non members) and their dessert/snack options are sooooo good. The building is also gorgeous and the staff is friendly.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Love this theatre and its staff.  The films and the film series are outstanding. My one complaint is the design of the larger theatres upstairs.  There are no center aisles, so if you get a seat in the middle you won't be able to leave your seat without disturbing a whole lot of people.   And the side seats give a somewhat distorted view.", "author": "James B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-16", "description": "BAM is still a great place to see a movie. I get here less than I used to and I let my membership lapse because of moviepass (more on that in my separate moviepass review) With all of the changes to theaters in general I think it might be time to at least spruce things up a little. I don't need recliner seats here but maybe new seats and new carpet. I don't like Pepsi products so that is kind of a bummer on the concession front.", "author": "Eve S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "strolling memory lane as my folks lived around the corner decades ago.  was an infant thus no recollection and my first time here\n\nbeautiful cinema and performing arts theater, great indie selections not available where i reside w/quaint setup and low key atmosphere to duck into. sights / sound / seats / setup were good.  i like these smaller production theaters as this place houses inside one of brooklyns finer institutions \n\n2pm cinematic show on a friday ran $10 and look forward to my next visit here", "author": "Clark G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-13", "description": "I love BAM and all its arts venues. I really do.\n\nBAM Rose Cinemas has a really great roster of films available. But, without some customer service, what's the point?\n\nLast week, I saw a film at BAM. While my movie was played in theater 4- I unfortunately heard everything going on in theater 3 (I saw \"Les Mis\" with a \"Django Unchained\" soundtrack). \n\nI'm not much of a complainer, really. But when the cost of a movie is as high as it is today (not BAM's fault), it would be nice to enjoy what you've paid for. There was no one at the box office when I left and I've called BAM three times and left three messages in the past week to discuss with the manager. No response. \n\nit makes me thankful that this year my film membership went elsewhere.", "author": "Randi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Great Theater! We saw Jimmy Kimmel Live during his one week visit to Brooklyn. The theater is GORGEOUS! The balcony seats were a great place for the band and were nestled in he corner. The bathrooms were conveniently located in between the two floors. They were clean and well stocked. I can't wait to come back to see another performance at this theatre. LOVE!", "author": "Stella K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "This is a great place to see a film - the theaters have good sound and sight lines. The building itself has gorgeous aesthetics that most movie theaters in the city don't have. On top of that, it's right by Atlantic Center so it's easy to get to by public transportation. \n\nThe theaters themselves are a bit small, which I think is actually a positive thing, but a lot of the showtimes can sell out so make sure you get there a bit early to get a good seat.", "author": "Dave M."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}