{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-25", "description": "I am pretty lucky to live steps from this theatre. \n\nLately, I have been going here more frequently to enjoy movies. And although the theatre only shows 4 films at a time, they always do an amazing job with their movie selection. Kudos to the movie curator. \n\nFor $20, you will get a movie admission ($12), a small popcorn ($4) and a small soda ($4). Pretty good deal. For $20, you might be able to get a half-decent cocktail in Manhattan. And that's a big MAYBE.  I think the former is a better run for your money. This is why I love Brooklyn. You will have to put a gun to my head for me to move to Manhattan. LOL. \n\nI truly believe in the People's Republic of Brooklyn. There's no place in the world like Brooklyn. I love you Brooklyn.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "I love attending movies here. you just have to arrive early to avoid stepping over people sitting on the ends. I've seen a handful of movies here with no issues. The popcorn is always delicious. I enjoy going to this theater because you avoid the young noisy crowds that are prevalent in the city. This is a laid back theater that's good for couples and families IMO. \n\nLast time I visited though the girl at the ticket booth had a terrible attitude. Had i not been running late for my film I would have asked to speak to her supervisor.  Don't do customer service if that's not your thing!", "author": "Tonya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Best movie venue in Brooklyn... good selection, beautiful theater architecture, clean and comfortable seats, amazing screen definition and the people who attend shows are the type who feel at home in an art gallery or museum, and are respectful of the movie-going experience.", "author": "Primo L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-30", "description": "I don't get this!!! I purchased a ticket, it was fully booked at the time (Trisha Brown Dance Company, January 30th 2013) in the orchestra area, but on the day of the performance there are all of a sudden millions of seats available! \n\nThere is also no refund/return policy, I can't even switch from one ticket to two (didn't get one for my husband since there weren't even two seats next to one another at the time) BUT NOW THERE ARE PLENTY OF SEATS, even better than the one I got in advance!\nSo, that can only mean that there ARE people returning their tickets!\nI don't understant this! If someone does, please explain!", "author": "Maria C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-04", "description": "Sound was muddy last night but it greatly improved for second half of show. I doubt my saying something to an usher made that change but I was surprised that they were not more on top of fixing it sooner. Sound was terrible. Could not hear voices or understand when they spoke.\nStill a great venue with a very organized and efficient staff who make it easy to get tickets and find seats so that the whole evening is an enjoyable experience.", "author": "Josie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-30", "description": "The irony, I would come here 3x a month and then became a member and started to come like every other month! \nI love Bam, I do. It's close to my neighborhood, clean and still has the indie vibe.  They show really amazing independent films, but sometimes the screenings are like at 2pm in the middle of the day...really? I know they try to get it all in, but who can see a movie at that time? Earlier in the year I saw a few really bad indie movies and wondered if the person in charge just lets anyone put on a movie, but it got better. \nI come for the q and a's afterwards, I just like questions I guess. \nDon't get the popcorn with the \"butter\", it's not real and might give you a headache. I used to get it all the time, but no more!\nThe seats are quite the tight and yes, if it sounds like it's going to be a good film, it will be packed to capacity, so always plan ahead and come before the show starts.\nIn all, it's great...although I noticed I was charged $8 for a movie instead of $7...but whatever, it's still worth it.", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "Have been going to arthouse cinema in NYC for 15 years. But for some reason never went to this place until recently. Wow, what I've been missing! Loved it. Beautiful place. Very civilized crowd. I will be coming back.", "author": "Bill D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "Great indie movies playing almost every night, and pretty affordable. The whole theater is unique in its history and decor, and it is well kept by the very friendly staff. Sound quality, screen size and sight lines are great despite the small feel of their theater spaces. That however I view as a plus. It's not too crowded so you can really enjoy show. The snack bar was a bit limited, and not very well displayed. I've heard that there was a full bar here, but it wasn't immediately obvious to us. Over all I think we'll be returning back here, and may become members because we enjoyed the show so much.", "author": "Cydney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Love this place. Comfortable theaters, great movies, $10 student tix. #winning", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "Here is my business card, matter of fact here is a videocassette \"BAM\". Ha that brought back memories. Got to love \"in living color\". That is the nostalgic feel I get when I visited this place for the first time.  \n\nBAM Rose Cinemas was created in 1998, and also houses the BAMcinématek. With showings of foreign, and independent films. \n\nDefinite piece of history the architecture lone is enough to come here, created during the early 1900s is just remarkable, great date spots. I came here for Dinner \u0026 a Movie. Only saw the movie. \"Roman Holiday\" Audrey Hepburn. Now the theaters could use an upgrade the seating was pretty much dated compared to other cinemas. I guess makes you feel like you're in the old-school movie your watching.\n\nAlso don't do what I did, so excited I sat in the wrong theater. Django unchained started playing didn't resemble, Audrey Hepburn. I think she is prettier. Quickly ran to the right cinema. Was able to get a seat even though was a packed like no tomorrow to my surprise.\n\nI didn't purchase anything there as I carry my own snacks in my bag. Really why would I want to pay $14.00  bucks for chocolate. BAM don't think so \n\nIn all wonderful date spot, your date will thank you do some research before you get there homies.", "author": "Andre N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "I saw Puscifer here. Maynard James Keenan's voice is meant to be heard in a place like the Howard Gilman Opera House. The acoustics were mind blowing and I was taken to an other level. I can say no more.", "author": "Christian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-04", "description": "Decent little theater.  Love that it shows the harder-to-find movies!", "author": "Ava R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "I've been here 2x. Each time in different areas of the building but both awesome times. First time I saw a Redbull Music Academy music \u0026 laser show \u0026 the second time I saw comedian Hannibal Burress. Like any venue the drinks \u0026 snacks are overpriced so pregame  \u0026 eat prior or try to sneak in your own beverages \u0026 snacks. The 2nd floor bar \u0026 waiting area is WAY better \u0026 cooler \u0026 the bathrooms upstairs are cleaner \u0026 quicker. The sound acoustics are great. There's not a bad seat in the house. Views were good. Entering \u0026 exiting was quick as well. No long lines. I will definetely return.", "author": "Maggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "Wow.\n\nI've been to an array of theaters in the city, and BAM, by far is in my top 2!\n\nNot your average pop-corn and soda AMC hell-hole of a theater. This is a genuine theater where real life performances are held, yes, these do exist!\n\nThe crowd is older, distinguished of sorts. The theater itself is smaller, more intimate (aka, you don't have to bring your glasses, but you probably still should). \n\nThis place is clean, and also, they have solved the age old annoyance of terrible previews! They have great music playing prior to the movie with well put together slide show of upcoming events at BAM. YES. I love you BAM!  \n\nLastly, I was able to purchase my friends' tickets and have them held for them at the counter without a ton of hassle. It was great! I can't wait to return. \n\n(Also, if you're looking to impress your date, after your movie, go across the street to see the windows all lit up! It's truly a beautiful light spectacle! Yay flashing lights!)", "author": "Catalina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "I love BAM! No matter what type of event I go to there, the staff is always knowledgeable and friendly. The family and I viewed the film, 'God Loves the Fighter' based on the not so nice life in the capital city of Trinidad WI. My only complaint is that I really wanted popcorn but did not want to shell out $6 for it. It was clean and cool. When we left though, only the 1st floor bathrooms were and since its not multi-stall (is that a word?), the wait was a few minutes longer than usual. No biggie. Looking forward to Dance Africa in may!", "author": "Tawana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "I came back after many years to see The Ballet Nacional de Cuba during the Si, Cuaba! festival.  The theater is the right size for many works. I wish ABT will change its venue and give the winter season here. The transportation is superb to BAM.\nVery nice theater", "author": "Sara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-26", "description": "Unfortunately I let my membership lapse since I moved to Astoria. Coming here was one of the bright spots of living in Clinton Hill. I loved going to discussions, watching dance and theatre events, and checking out the occasional movie. Barclays may have come to the hood, but it will always run second to the culture here.", "author": "George D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-10", "description": "Came here bursting with excitement to see Anthony Bourdain...left feeling like I got cheated. My tickets we're rather expensive, considering I was all the way at the top (nose bleed). Being a huge Bourdain fan, didnt mind spending the money. The problem was the sound system. If you're going to hear someone speak, isnt SOUND probably the #1 most important thing? I spent the entire time straining to hear Anthony speak. It was muffled and many times the people in the downstairs front row were laughing, meanwhile, the nose bleed people were left looking around saying \"did you hear what he said???\"\n\nThe fact that I had to lean forward and strain to hear took away from the experience and made it stressful. It got to the point where I was giving the death stare to anyone who coughed. \n\nI love Anthony...but, what a let down, BAM.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "What a pleasant way to experience a movie!  \n\nLike the Landmark Sunshine (and now less so than the Angelika which has seen better days), the BAM Rose Cinemas offer a classy cinema-viewing experience.  In one of the Brooklyn Academy of Music buildings, three theaters offer some of the best independent cinema in New York City.  The seats are plush, the popcorn is fresh, and the atmosphere is very adult and sophisticated, arty but not pretentious.  This is a great place for a date or even to see a film by oneself.  There seems to be a mutual respect for movie goers that you just don't get a Kips Bay or the Times Square movie theaters...people don't text on their phones throughout the whole show.  I think this may be my new theater...well, behind the Landmark Sunshine because they really do have the best popcorn in the city.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Very cool place. First of all their cinema isn't the typical cinema around. They carry independent hard to find movies who are aired in theatre style rooms. Their shows are a little too out of the box for me, and their plays as well but I have always enjoyed myself. They also have a lounge that offers light food, a full bar and more. Dress to impress, but kept on the artsy side- this isn't the MET after all :).", "author": "Daniela T."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}