{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Definitely one of the best places in the city. BAM is an amazing entertainment forum. This is perhaps the most important reason why I want to live in Brooklyn.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "Fun(ky) theatre close to our place. Thought we'd give it a try. \nNice computer kiosk option to skip the line and buy tickets like I'm checking in at the airport. Note: better spacing of movie start times may help eliminite long lines.\nPopcorn was awful; clearly made the night before and tasted like packing peanuts, or at least how I imagine them to taste. Unfortunately it's Pepsi products, but whatever I can deal with that. \nThe theatre itself (#2) was cozy, fun old filament style lightbulbs, not stadium seating but not expected, especially in NYC at an artsy theatre.\nGood for proximity and price, bad for popcorn.", "author": "Briggs S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "Great selection of movies, comfortable, clean theaters, well behaved patrons and decent pricing.\n\nOh, and my gentleman friend is pretty sure he spotted Zooey Deschanel leaving the ladies room. \n\nSo there you go.\n\nOh! and they have super simple automated movie ticket machines to the left of the ticket window...can you say convenient?", "author": "Mia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "This theater allows you yo see quality movies without going to manhattan. This place also does live productions that are really good. On Fridays this place has live music at the bam cafe, get there early to get in.", "author": "Marsha D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-23", "description": "Great selection of films, nice theaters, long lines for the restrooms and no real milk for the coffee.  When we tried to order Christmas tickets for Les Mis, the system wouldn't take advance tickets and we had to go through the entire check out before they told us.", "author": "Karen V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-26", "description": "Awesome! I've only been here once so far but I will certainly return. Not only does it host ballets, plays, etc but it also is a movie theater and has a cafe (BAMcafe). Very easy to find, with a very convenient parking lot right across the street ($17 event parking price). \n\nDecor is lovely - very ornate carvings. Setting was pretty intimate and the stage was larger than I had expected for the size of the space. Tons of staff - didnt have any problem finding someone to help us with finding our seats. \n\nOnly complaint is that the seats are really tiny. Im not a particularly tall person (5'6\") and my knees were hitting the chair in front of me. I also felt bad because the gentleman seated in front of me couldnt fit into the seats (and frankly, he wasnt even that large) and he had to sit on his coat in order to sit on the arm rests rather than the seat. They really need to be a bit wider. My sister even complained about the size of the seats, and she is a petite woman. Too small to even comfortably cross your legs. \n\nThat aside, def. worth going to. A GREAT element of this community.", "author": "Ave H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "No\nLeg room,\nGood views in\nOpera House.\nA well booked space near lots of subway lines.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "im a very particular moviegoer and this is one of my favorite theaters to come to. the whole experience of going out to watch a film needs to be so much more now than it used to be, mostly because you're paying $12. at BAM theres 4 screens total and i know at least 1 of these has stadium seating, which is pretty sweet. they always play a good mixture of mainstream and semi-independent movies, so theres something for both your hipster friend and your non hipster friend! \n\npositives:\n$12 for admission (which is ok cause the stadium style seating makes it worth it)\nclose to tons of subways, easy access\nalso close to target... so thats always a plus for me\nvariety of good films play here and rotate out often\n\nnegatives:\nridiculously full on thurs, fri, sat, sun nights (this seems to be a favorite place of many movie goers)", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-28", "description": "After this past New Year's debacle, when I was trapped in Brooklyn in the middle of the night for several hours with no way out, I vowed never again to return. This was the same night when I started my evening at Barcade (see review). But, my vows are notorious for being bullshit, so you can guess I ended up in Brooklyn last night again. Voluntarily even.\n\nThis movie I've wanted to see over a year - \"Kaboom\" - was playing here as part of a Sundance Festival U.S.A. thing - they pick several satellite cities and feature one of the films there for one night only. Randomly, as fate would have it, they were showing the ONE movie I wanted to see at Sundance for this one night in Brooklyn. I felt I had to go. I tried to make everyone come with my, but in the end only convinced Scott B. and Brian S. to. Which was good - it's nice to have wingmen, but you don't want to go crazy. I don't talk during movies, so it's not like I'm really hanging out with them anyway.\n\nIf you are looking for BAM, it's easy to find- look off in the distance and there's a big, ridiculous rotating sign. It was so stupid/awesome I had to mention it here. I was in love with it.\n\nThe space is nice. I wouldn't describe many places as \"classy\" (especially, probably in Brooklyn) but this place was. You can tell it's been kept up and renovated, but they make it sort of look old and epic. The cinema is just one part of the larger building. There's also some sort of Opera performance space on the opposite side and I think a few other things there as well. Easy to get through from the Atlantic stop on the 4/5, even if the snow/freezing puddles made it temporarily difficult.\n\nI would totally go back here for another sort of special movie event - there was a Q \u0026 A after the movie, so I heard Gregg Araki and Thomas Dekker talk about the movie. Then I had Mr. Araki sign an old \"Nowhere\" VHS tape after, which he did graciously. All in all, a great evening (glad Scott B. was game, I was being kinda nerdy). Minus one star because, well... Brooklyn (obviously).", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "I just saw the production of Ghosts by Ibsen.  Brilliant rendition, adroitly reduced to an hour and forty minutes without intermission by the director.  Was riveted throughout.  Superb acting, great sets. Harvey theater is incredible. BAM is a jewel.", "author": "Jake F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "Saw Fruitvale Station here, pretty comfy and spacious, my only thing is that they could use a few more restrooms.", "author": "Cathia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "I love BAM. I saw Patti Smith there in 2005 when she had her 30th Anniversary of Horses. I felt like one of the only young adults in the audience. BAM is usually for the 30s-50s crowd, but it's very hip. \n\nLike the previous person said \"BAM has my heart.\" \n\nIf people have spending money and free time, I really recommend taking a trip to BAM. You will have lived a better life for having gone to BAM. \n\nThe only thing about BAM is that its location is not that obvious.", "author": "Denise C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "No better theater than Cinema 3 in NYC.  Cinema perfection!", "author": "bryce E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-01", "description": "The good: The building itself is quite beautiful. The mosaic work on the floor of the atrium is gorgeous and the detailed woodwork throughout the building was quite admirable. I sat in the front row of the balcony and had a superb view. The girls handing out programs up there were very nice. Also, the restrooms on that level were spotless and never too crowded.\n\nThe bad: You can' t bring drinks into the auditorium. I understand the reasoning, but I saw no signs indicating this anywhere. I'm sure I missed them, but still, it was annoying to have to chug a $6 glass of Merlot like a sailor on leave. Also, the front atrium was lacking in directorial signage. I had to wander a bit and look lost before an employee asked where I was trying to go and he pointed me in the right direction.\n\nAll in all, it was a fine experience and I won't mind coming back. As the 3-star rating says, it was \"A-OK.\" No better, no worse.", "author": "Keith T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "A beautiful space, though the whole night was bittersweet, realizing that it may very well be the end of NYCO as we know it. A friend and I enjoyed a wonderful evening at BAM watching Anna Nicole. The performance was wonderful and the house was perfect for the performance! BAM and NYCO didn't skimp on details: pink carpet leading into the building and an amazing pink grand curtain. My only complaint is that the lobby didn't really seem able to be able to handle the large, sold out crowd of Fridays performance. There was a lot of long lines leading to elevators and big crowds in front of orchestra entrances before the top of the show. Other than the foot traffic, this was a very enjoyable night in a wonderful venue!", "author": "Dixie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "I went here for my birthday this year because they just so happened to have a one-day showing (on my actual birthday) of my absolute favorite movie, Moonstruck. Since I was a bit too young to catch it in the theater when it came out, I grabbed my chance to see it on the big screen at BAM. While I've been to BAM's theater productions, I'd never been to their movie theater, much less on a weekday. I was pleasantly surprised from start to finish. \nThe parking was easy and affordable and located right next to the theater. That was the first plus. The theater itself was absolutely beautiful! The staff was friendly and attentive. Getting the tickets was a breeze especially since we were in a bit of a rush. The snack area was really nice with a diverse selection of decadent and healthy snacks such as apple chips, etc. \nThe theater was quaint and the seats were comfortable, the picture quality was good and so was the sound. Overall, we really enjoyed our experience at the theater. It's better than a crowded commercial theater and the movie selections are great because they mix classics with current films. I highly recommend this theater!", "author": "Karrin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "I went here for the final fantasy instrumental concert on April 2nd and the place is beautiful. it's a bit hairy to get to by car at the moment because of all the construction but it really is a beautiful building and the acoustics are remarkable. Very nice - I would like to stop by here again. Great venue.", "author": "Christina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "Student tickets are $9, monday through thursday.\n\nIts never crowded which makes for a relaxing movie-going experience. The theaters are in good condition and clean. They even have cookies from Baked in Red Hook alas no salty brownies:(  One star off because it sometimes takes a bit for newer releases to make it here, maybe thats due to only having 3 screens.\n\nIf there is an Almodovar to be seen I'm here.", "author": "vanessa g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "I rarely go to the movies these days, unless there's a film out that's best experienced one a huge screen and volume blasting surround sound.\n\nBut when the MTA decided to shut down both the F\u0026G this weekend, I decided to stay local and catch the new Danny Boyle flick - my first movie outing since moving to NY/BK.  BAM's a pleasant 30 minute walk from my place, and the theaters are tucked into the larger arts complex, so you could easily walk by a 100 times without knowing there's a movie complex on that street (no marquee).  As such, it's kind of a hidden gem.  \n\nIn many cities, the places that show the artsy/independent films are often a bit run down.  BAM could compete as one of the nicest I've experienced.  Classy old-school ornate theater but totally modern comfy seats with cup holders.  Steep enough layout so you don't see the heads of the people in front of you.  The fellow attendees all seemed polite - not a single phone rang, nobody was texting away or yammering to their mates.  The only negative would be they charge mega-theater prices for concessions - small popcorn and coke were around $7.  Smarter folks would use Yelp to find a local purveyor of interesting munchies and smuggle them in!\n\nOh yeah, another reason I'm not a big movie goer lately is the $12 it costs to see an often blah flick.  Matinees at BAM are only $7.50\n\nFor once I'd like to thank the MTA for prompting me to explore more local entertainment options.  BAM might now be my defacto place to go when itching for a night (or day) at the movies.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-05", "description": "Awesome old school flicks, good location, beautiful lobby. Fresh popcorn, too.", "author": "Camille R."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}