{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "I love the movies they show. I love the ambiance. Prima! I loved them enough to become a level II member. I have a few things that just drive me crazy though. \n1. You're an art house cinema. Why are you serving Regal Cinema Yellow No. 5 popcorn?\n2. Your cinema club is such a great idea, but managed in such a haphazard ridiculous way, where do I start? Half of it is online. 1/3 of it is managed by a 3rd party. 1/3 of it never answers the phone and keeps 9-5 hours. 100% is still sent by mail? Why, if I'm allowed to buy membership online, and you have a numeric receipt system, do I then have to wait 2 weeks before I can get discounted tickets? This is a movie, not elective surgery. Just print the membership number out in the receipt email? Why on earth don't you do that? Why must I wait until Monday, to call....to get a temp pass? \n\nThat's it. The rest is love. Sigh.", "author": "erin a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "Oh I just love coming here.. It's always a wonderful experience! My last two visits were to see the Alvin Ailey dancers, and then to see the Dance Africa performance this past spring. Each time was electric.\nI especially enjoy seeing people of so many races and cultures coming together to enjoy these wonderful shows. Definitely will be there a few more times in 2011!", "author": "Chrisi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "Great movie theater. They show new movies, some that are not in wide release around the city, special features, and programs on different cinematic themes or works by a specific director or star (I think they call these \"cinematheque\"). \n\nI remember when they did the massive renovations at BAM and opened the movie theater and re-did the performance space and they really did a great job. There are 3 screens, good but expensive popcorn (it's still a movie theater even if it's a good one), and I have it on good account that they sell decent coffee. \n\nThe prices are around a dollar cheaper than you'll find at the Court Street Regal and theaters in Manhattan, plus it's just a nicer movie-going experience and you can see things that aren't playing anywhere else in Brooklyn, except maybe at the Brooklyn Heights Twin. Instead of tons of talking and people yelling \"oh snap!\" and \"don't open that door!\" people actually come to watch the movie and not just provide commentary. You can also become a member, I think for $75 a year, and buy $7 or $8 tickets with your card.", "author": "Sam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-29", "description": "Really beautiful building with 4 theaters inside, concession booth, all the amenities of any big movie theater except they play foreign films! I really enjoy the fact that there isn't stadium seating here and it is independently owned PLUS I saw a matinee here for $8. CAN'T BEAT THAT! Apparently Werner Herzog will be there in March to present a movie of his, but it is sold out already womp womppppp", "author": "Adina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-19", "description": "Last year I was treated to something truly special at this theater: a screening of LITTLE MURDERS (1971) followed by a q \u0026 a with Elliot Gould and then quite possibly the greatest awkward moment I have had the privilege to witness.\n\n(N.B.: If you are ever granted the opportunity to see that film, you must.  It is a very funny and very weird little something, written by Jules Feiffer and directed by Alan Arkin, that contains great moments of Beckett-like absurdity set against an early 70s NYC milieu.)\n\nMr. Gould was very nice, responding to certain film nerd queries in a pleasant manner and with an earnestness he need not have employed.  After the q \u0026 a, we filtered into the lobby for open bar and a mingling.  This is where my story occurs.\n\nNow, let me preface the following with a little description of my friend Pauly.  I love the guy and I owe him eternally for his years of friendship but he tends to get himself into awkwardly hilarious situations with disturbing frequency.  The reason for this is that he is is the nicest human being you will ever meet but also exceptionally nerdy. His wife allows him a room in the house for his vast collection of action figures and he has an array of busts of Marvel superheroes arranged on his mantel, so I think we can all agree that I have offered a fair and accurate description. \n\nFurther, both Pauly and myself have a slightly odd obsession with the work of Mr. Gould.  The source can be traced mostly to his work with the director Robert Altman (i.e. M*A*S*H and THE LONG GOODBYE).  However, you cannot discount his turn as Ross and Rachel's dad on FRIENDS, an under-appreciated gem of a performance.  \n\nWhile I am at it, a succinct description of Mr. Gould ca. 2009: attired in trousers hiked above his navel and a wool cardigan, he currently bears a more than passing resemblance to a kindly old Jewish grandfather.   \n\nSo, we are mingling in the lobby of BAM and fortifying ourselves with alcoholic beverages.  Pauly \u0026 I are hovering near Mr. Gould, slowly getting drunker and waiting for the moment we can approach him and, surely, impress him with our knowledge of Altman so that he quickly becomes enamored with us and we are the best of friends for all time.  That is the plan, at least.\n\nTime progresses and Pauly \u0026 I are now well past the point of mild inebriation.  We see our opening and walk over, shaking hands with our admired future-friend and introducing ourselves.  We stick to our Christian names for the moment, assuming that he will assign us special nicknames at some point in our impending BBFdom.\n\nThis is when it happens, that magical you-had-to-be-there apex of awkwardness: Pauly launches into a long, involved description of a Batman comic book.  \n\n(Later, during the first of many reconstructions of this event, it is determined that something in the comic reminded him of LITTLE MURDERS, the film we had just seen, though Pauly failed to mention that critical fact during the actual conversation.  I believe the comic in question was BATMAN: GOTHAM KNIGHTS but I am not absolutely certain.)\n\nMr. Gould listened patiently to this unnecessarily detailed, nay unnecessary on every conceivable level, description of a comic book for a full five (5!) minutes before politely excusing himself.  I stood mute witness to the entire glorious exchange and I cherish the memory.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "I became a member of BAM and its one of the best things I've done that has helped me enjoy Brooklyn more. I am there weekly. They have great arty movies and series as well as the mainstream movies. The only thing is that the bathroom is a little small so there is always a bum rush to use it when the movie lets out", "author": "Bryan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-25", "description": "One of the best places to catch artsy, indie and even some mainstream flicks in  BK. \n\nOne thing that irks me about this cinema is the previews. You can never time it to miss the previews. Sometimes the previews start before the written show time and sometimes after. This means if you are five minutes late you could be missing the first part of the film.\n\nCinemas 3 and 4 are the larger theaters with the bigger screens and have that old theater grand movie experience. Cinemas 1 and 2 are much smaller and have the art house cinema feel and because they are small you better get to the movie on time. All the theaters have nice, clean and comfy seats. \n\nImportant note the popcorn is kind of meh even though I buy it anyway", "author": "Anastasia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "What a great theatre! Super convenient from the 4 train. I've seen two plays here. The actors BAM brings in are fabulous, and the venue is nice. A very quaint performance space.\n\nVery well staffed. There's even a small bar inside where you can get a sandwich before the show.\n\nI'm a fan!", "author": "Jamie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "I can never do BAM justice! NEVER. I love it. i have seen shows here, theater performances, and endless movies. so jomi joy and i after our fabulous deniz dinner caught the latest almodovar film @ one of the places i had to do while visiting. BAM Rose Cinemas. Love, love, love!\n\nThe best, plan to find out what's happening @ BAM before your next trip to NYC. or at minimum catch a flick at BAM ROSE. xoxo", "author": "Vanessa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-09", "description": "Outside of the funky Cinerama in Seattle, this grand old theather in Fort Greene is my favorite place in the world to see a flick. \n\nThat said, without any further adieu, here are my two best moments from BAM Rose Cinemas: \n\n* Punk rock legend John Doe, of the band X, played a free show at the upstairs cafe in between showings of the X documentary, \"The Unheard Music,\" taking requests from appreciative fans. So fuckene cool. \n\n* During the premiere for \"Away We Go,\" I arrived way late and had to step over all the VIPs (including writer Dave Eggers and lead actor John Krasinski of The Office) en route to my friend Q, who was sitting in the middle of the huge row. \"Excuse me, pardon me, excuse me...\"  Hilarious.  \n\nBAM's gotta be one of the coolest movie houses in America.", "author": "andy t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-17", "description": "Stunning. \n\nBreathtaking architecture. Meticulously tiled outside, gorgeously arched inside--- like the ribs of a filigreed mermaid. \n\nAmazing special programs, this Saturday I went to see \"Away We Go\" and at the end Dave Eggers, Vendela Vida, and two lead actors came out to have a Q\u0026A session. \n\nThey have a great student discount for people 25 and under Monday-Thursday. They show mainstream films as well as essential anthology. \n\nSo beautiful and majestic, I would watch all my movies here if I lived in the neighborhood! It's so special, the old Penn Station of movie theaters. I'm definitely going to go more often!", "author": "Lisa Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "Best theater in Brooklyn.  By a long shot.  They have first run indies, as well as a great \"cinematheque\" program (aka really cool old stuff) programmed by folks who both know and truly care about, well, you know...film.  \n\nThe venue itself is stunning, combining both modern details and the charm of an old-fashioned opera house, and frankly, it's nothing short of the crown jewel of the neighborhood.   The theaters are large and generally quite comfortable (a sold out weekend show in the largest theater being an exception) and the picture and sound quality are well above average.  \n\nMinor gripes: $12 movies, no more batch candy (what happened, BAM?) and only average popcorn.  Regardless, BAM is infinitely preferable to the Angelika in Manhattan, and certainly on par with the IFC Center and Sunshine Theater.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "I don't think the Howard Gilman Opera House was the right setting for Edward Scissorhands. Perhaps it would be more well-suited for things like.. opera? \nGood orchestra/sound and lighting. \nThe seats felt crooked. We seemed to be leaning towards the left so when we stood up we almost fell on top of each other. I imagined us causing a domino effect and seeing a string of people falling off the balcony...", "author": "Natalie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-29", "description": "Dating back to 1861, BAM is a cultural center that embraces both the traditional and the avant garde. You'll find a little bit of everything here, from the sublime - music, dance, plays, lectures and symposiums, and film programs - to the unusual, like bodybuilding competitions.  Its present home, which opened in 1908, includes an opera house, a legitimate theater, a mini-multiplex with four screens, and a cafe that serves as a live music venue appealing to all tastes - it features everything from Latin to rock to klezmer to jazz - on weekends, in addition to being a reasonably-priced restaurant open Thursday through Saturday and on performance nights.", "author": "Gourmet G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-25", "description": "My review is for the BAM OPERA HOUSE: terrible Men's room (gross urinals, terrible sinks), uncomfortable seats (not enough leg room), and then there's the programming. Unlike BAM HARVEY, where I've never seen anything I didn't like, I've only ever seen one thing I actually liked at BAM OPERA... \n\nI came here a few times a few years ago, a couple times a couple years ago, and I've been here twice in the past week. Way back when I went bonkers for \"Sasha Waltz: Impromptu\" (which was the only dance performance that's ever made me cry -- it was harrowing), b\n\nThe two things I saw this week both had me rolling my eyes and actually contemplating leaving... \"Woyzeck\" was absolutely massacered -- it was more Cirque de Soleil and Stomp and Blue Man Group and Cabaret than it was Georg Büchner, I hated it -- being faitful to the text or even the story was the last thing on their mind... \n\nAnd then there's the Steve Reich/Anne Teresa De Keersmaeker/Rosas I saw the other night: they butchered Pendulum Phase (rushing it's ending, completely murdering the entire concept of the piece), the two women dancing along to Piano Phase was a moment of genius (the overlapping shadow-play was stunning), Marimba Phase was interesting but nothing special, Eight Lines had sloppy unfocused dancing, Four Organs had absolutely terrible technically hilarious dancing, Drumming Part 1 was just uninspired and redundant dance-wise, and last but not least I was mortified by their treatment of Ligeti's \"Poème symphonique pour cent métronomes\" -- rather than starting them all simultaneously a few \"fierce\" dancers \"preciously\" started them individually, and metronomes weren't all the way wound, and you could barely hear them, it was used almost as an intermission... No intermissions, a pitch-black auditorium, you couldn't leave if you wanted to... \n\nAnd then there's the Pina Bausch \"dream-scapes\" nightmare, but I'd rather forget about it.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "My friend and I were lucky enough to get discounted tickets for \"As You Like It\" and were worried our rear orchestra seats would have a pole in front of me blocking the view.\n\nHowever, when we entered the venue, I was surprised how intimate the setting was compared to other theater venues I've attended in the past.  \n\nIt was my first time at BAM and I admired the rather unfinished look it had with the exposed brick, beams and the rusty looking ceiling.\n\nThe cafe is also simple sellling sandwiches, water and coffee but you're really there for the show.  I have to commend the set design and the lighting made it very inspiring and romantic\n\nI'll definitely be back for the Dido and Aneas show if I can get tickets.", "author": "Neline S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "An odd selection of movies playing here but a quality cinema nonetheless. They have a huge IMAX screen with real stadium seats, the kind where you can sit behind Shaq and still have an unobstructed view of the screen. They show mostly independent films here but will also have some mainstream attractions as well. You can come here and enjoy a film without feeling cramped or dirty or like you have to contort your body to get the best view of the screen.", "author": "Lorenzo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "Saw 'The Wackness' here last night with ma girls.\n\nClean, spacious, and though there wasn't 'staduim-style' seats, the 9:30 show had only 10 other people (yup, I counted) hence our view was completely unobstructed.\n\nNo complaints here...I'll def come back.", "author": "Lady O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "My go-to movie theater, albeit with a limited selection. I appreciate that BAM has the bargain ($10) matinees for the first show of the day, relatively few previews, and comfortable seats. Can't comment on the refreshments, but with it being so close to Atlantic Terminal and many restaurants in the area, I'm a fan. I want to go see a movie in their big theater sometime.", "author": "Ray S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-01", "description": "I had never seen a movie until I came here.  The realism of the picture, the presence of the sound... I nearly had a fit.  It provoked me to rent \"DVD\" films, but they could not compare to the gilt glory of the BAM rose cinemas.  I went to see another moving picture show in Manhattan but the experience was so poor that I was compelled to throw down my hat and reproach the proprietor with claims on my behalf of skullduggery and lolligagging, plebian candy salesmen.\n\nWhen my landlord evicted me, I made BAM my home for six days. Not only did no one complain, but I managed to sustain myself quite happily on their nutrient-enriched candies. It turns out the joke was on me, because the darkness made photosynthesis difficult and I grew gravely ill.\n\nWhat I wrote above was a creation of my gigantic brain, but the sentiment remains.  Don't fuck with the other cinemas if they have it here.", "author": "Jake A."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}