{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-07", "description": "BAM shows great movies, even if the selections don't change as often as I'd like. Generally if there's a movie out that I want to see, it ends up -- at some point -- playing at this theater.\n\nBonus points, too, for the cool concessions! In what other cinema can you mix 'n' match your own candy (BAM charges by the ounce)? I recommend a gummy worm/Swedish fish/chocolate-covered peanut combo. Yum.", "author": "Krissy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "This review is specifically for the Howard Gilman Opera House, since all the other sections of BAM seem to have their own entries here on yelp, but the Opera House doesn't. \nThe Opera House is the main theater at BAM, seating over 2000 patrons. It's a classic, beautiful theater, well-kept, with ornate ceilings. If you're not-wealthy, like me, you'll likely end up in the top tier, which is admittedly vertiginous, but affords a perfectly lovely view, if you don't have bad eyesight.\nMost recently, I came here with my family for a post-Christmas performance of The Nutcracker. When I was a little girl, my mom gave me a copy of the book, \"A Very Young Dancer\" (like probably most girls my age!) Somehow, it never inspired me to want to dance ballet (the book made it obvious that ballet required coordination, among other qualities I am lacking), but The Nutcracker always lurked in the back of my mind, although I never actually bothered to go see it. Well, now we've seen it! I was a little surprised that the vast majority of the audience was adult, as I somewhat thought of this as a 'family' show.\nThe American Ballet Theater dancers were definitely extremely talented, and there was much twirling and tutus. The first pas-de-deux between the principals was bring-a-tear-to-your-eye lovely. However, I know this is a 19th-century story by a Russian guy, but some of the ethnic stereotypes in the second act were distractingly outdated. The costuming could definitely be adjusted to reflect a more cosmopolitan worldview without sacrificing the sense of the exotic.\nStill, we all enjoyed the show, and it definitely made my parents' trip to New York appropriately Christmas-y!", "author": "Althea A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-25", "description": "I had high expectations when I went to see one of my favorite bands, The National, at BAM.  That said, I was also a little afraid that balcony seats would be far and acoustically inferior.\n\nI was wrong.  It was perfect.\n\nAfter the show, the Cafe was lively and crowded.  We opted to go somewhere else, but I will be back for more music.  Definitely.", "author": "Diane A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "Cool theatre.... Very old school style.. I saw Beats, Rhymes and Life here.  Despite the multitude of hipsters/yuppies that seem to frequent this place - i still think its a good place.  I need to hit up this spot more often.", "author": "Dew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-03", "description": "Leaving aside the fact that downtown Brooklyn-thanks to collusion between a succession of incompetent politicos and Ratner Inc-has become an open construction pit/poorly designed Rubex Cube, which detracts from the overall experience, BAM is still the foremost cultural-artistic institution in this borough. \n\nThe Brooklyn Academy of Music is something we should all be proud of, and if given the opportunity, patronize. I still remember watching a video-opera created by Steve Reich at BAM many years ago, which was an indescribable experience. Even performances that I regretted partaking of, e.g. an interpretative dance piece that proceeded at a pace more glacial than a typical Stanley Kubrick film, were enhanced by the wonderful atmosphere. \n\nI can't recommend it highly enough.", "author": "Gerard P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-25", "description": "Officially my new favorite movie theatre... and here is why:\n\n1. BEAUTIFUL architecture\n\n2. Previews start about 10 minutes earlier than the movie call time and end about 5 minutes into. Brilliant... Makes it so late comers don't miss too much, but early birds do not have to sit forever.\n\n3. Walking Distance, not only to my house, but also to 2 3 4 5 C G B D M R Q N \n\n4. Avant-garde and Indie flics in addition to mainstream ones\n\n5. They have a membership club for avid-movie lovers!\n\n6. Stadium Seating\n\n7. Clean Bathrooms\n\nLove, Love.", "author": "Justine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-06", "description": "Imagine a mixture of movies, an old world movie theatre and minutes from multiple train lines.\n\nSuch is BAM. \n\nI will be back.", "author": "Adina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "I have been here several times for receptions.  They have a gorgeous space for entertaining, great catering and very centrally located.  We saw a wonderful musical performance last night in addition to the reception and it was a lovely evening enjoyed by all.", "author": "Pia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "BAM has my heart. \n\nMy favorite venue in the City. \n\nThe acoustics in the BAM opera house are amazing, the space is elegant and beautiful and the seating is well laid out. I've seen a bunch of shows here like Sufjan Stevens' BQE, The National and St. Vincent during the all-night Takeover party and it's always phenomenal. \n\nThe BAM Cafe is also a great space. It could be it's own separate club. The light fixtures and windows are stunning.  It's a fun place to grab a drink, dance and listen to musicians. \n\nI highly recommend staying on BAM's mailing list because they have some of the best shows and events around. \n\nOh yeah, I also got to go to a BAM after party and meet Sufjan Stevens and then I ran into him a few days later while he was waiting to see a show at BAM.  He was just the sweetest guy.  I have a bit of a crush. So for many reasons, including allowing me to chill with one of my favorite artists, BAM has my heart.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-13", "description": "Facility-wise, this is everything i want a theater to be. It's spotless, the building is gorgeous, the lobby is spacious and inviting, and the big auditorium is amazing. (AH-MAY-ZEENG.) Even the shoeboxes are well-maintained and serviceable.\n\nEverytime I've been there, the crowds have been quiet and polite and respectful to the point of weirdness. Good weirdness, though. \n\nThe retrospective series are terrific, and I've seen so many good movies I would have otherwise never caught on a big screen. BAM Rose is a great resource for film buff/art house showcases, and I feel really lucky to live so close by. \n\nSadly, I find that a lot of the first-run movies they get fall to the \"I have zero interest in this\" camp, and I don't have as many pressing engagements here as I would like.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "The BAM Cinemas is great place for a movie. They host a wide variety of films, from art house indies to the latest hollywood monstrosity, just be sure to know what you are going to see beforehand or be adventurous and liberal with your time, because with so many niche films you will find the wrong one and be like \"wtf is this that I am watching? I  think i need an adult!\" \nIt is a beautiful movie house. Being a partially restored antique with modern fixtures and awning. My favorite theater is #3, with stadium seating and gorgeous ceiling.", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-01", "description": "Yesterday, C. and I went to BAM to see Michel Gondry's new film, \"The Science of Sleep.\" The movie was awesome, and while this isn't my favorite independent cinema, it's well worth supporting.\n\nBAM's first-run films will attract a more mainstream audience -- and represents some of the best of film today -- while the rest of its schedule will attract true cinemaphiles.\n\nThe theaters are surprisingly large and auditorium-like in their design and feel -- and the seats aren't totally comfortable (the rows in theater 3 in particular feel overly close together). But I'd go again and appreciate their selections and schedule!", "author": "Heath R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "Such a cute theater in the lovely area of Fort Greene. I went here last night to watch the movie, \"Diving Bell and the Butterfly\":  A French film which will leave you touched, tortured and amazed.  I will not spoil it, but this is a fantastic true story that I would highly recommend.  As for the theater, it was quaint, sells out quickly and provides Brooklyn with an alternative to watching unique movies.\n\nYour best bet is to order the tickets online prior to going and if you like you could easily sneak in some candies, but they do have a concession stand that sells the typical movie treats.  The screen was \"ok\" nothing amazing, so don't expect it to be a Loews super experience, but I really enjoy the fact that it is an older style.  \n\nThe area around the theater is bustling, with restaurants and bars which is great to go pre or post movie.  I will def be back and look forward to my BAM experience.", "author": "steph d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-10", "description": "i had no impression either way about the theater facility itself, but I like their movie selection.  But I give it 4 stars b/c so many theaters can leave me with a negative impression (dirty seats, bad smelling, etc.)\r\n\r\nthe place seemed nice enough.  i saw \"the science of sleep\" there the other day.  small theaters, but if you sit in the back it works out pretty well.  The crowd is generally appreciative of film, which I find nice.  A lot of people stick around to see all the closing credits.\r\n\r\nI'd go back and see movies there, though.  Sure.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-20", "description": "I've seen a couple of dance performances here, and the theater is very, very nice, expansive, and I really enjoyed sitting on the balcony and being able to see the collective shape of the company as they performed theme pieces to Sigur Ros and Radiohead. It was \"far out\". It was \"tubular.\" \n\nAs other reviews have shown, the great thing about BAM, which leads it to having multiple Yelp plugs under its different parts, is the variety you get out of one place. The cafe is large and caters, and the cinema is decent, kind of reminds me of the really slanted super-stadium seating 3-D theater in The Great Escape amusement park up by Lake George. The cinema also has great special events and retrospectives, check out their calendar online often if you're a cinema buff.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-19", "description": "Artsy-fartsy, indeed Rhad, but always my top choice for a flick in the n'hood! Of course, when the competing movie theaters in Brooklyn are the ass UA multiplex on Court/Atlantic or the wee Cobble Hill sticky floor shoebox, it's not hard to rise to the top. However, BAM's theaters are always clean, quiet and well-attended. Plus, in addition to screening first-run indie pics, they program amazing rep series and guest curated shows. Not really a bad seat in the joint either, sort of a panorama design in the large space. Lastly, the Fort Greene n'hood is getting better all the time. Most of the good eateries are parked a bit north, but it's only a 5-10 min stroll to digest in front of a really large screen. And if you don't feel like a flickering image, you can dine, see a play or a concert under the same roof! It's just one more reason NOT to use the subway on the weekends!", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "A civilized place to watch a movie?  Yup, this is it.  This may be the only place in Brooklyn I ever fully enjoyed my movie experience.  The theater I was in is old and beautiful too.", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-13", "description": "I have yet to see a film here even though I bought a ticket--at an inflated price for Brooklyn I might add. One extremely hot summer night my friend and I opted for an air conditioned movie theater and ended up here.  We got our tickets well before showtime, went to get something to eat and then returned. When we got into the screening room it looked as if they had oversold because there were no empty seats. The usher said that was probably because people had snuck in from other shows and told us to see the manager. They would not give us refunds only passes. When I came back to try to see a movie they said everything was sold out. I asked for a refund which was refused. They could use a retraining in customer service and theft control. The IFC is so much better without the attitude. Plus the atmosphere there is like yuppie apocalypse. Like if a UFO landed filled with gentrifiers. Get over yourselves, it's  BROOKLYN.", "author": "Amina A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-28", "description": "This is a good local theater showing independent movies including one about French soccer star Zinedine Zidane (which was terrible, by the way) and it does its job well.\n\nThe theater was nice and clean and they managed to get four theaters in a space I wouldn't have expected them to fit two.\n\nThe only major downside was the lack of stadium seating (what? I can't get seated comfortably while being educated?) and no refills on soda. The prices on said popcorn and soda, though, were completely reasonable so I can't complain too much.\n\nOne other thing -- the theaters are contained in the building that says Brooklyn Academy of Music along the top, so make sure you're on the lookout for it.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-08", "description": "Gorgeous architecture and a nice, intimate setting in each theater. But a suggestion: don't sell popcorn during NT Live or any other *theater* broadcasts--they lack the soundtrack and amplification of studio films and therefore the noise of a neighbor's popcorn chomping is especially maddening (and unnecessary at a 10:00 a.m. screening, no less). I doubt BAM would sell popcorn for a live play, so why do so for a telecast one? Especially when tickets are $25 apiece.", "author": "Yochi O."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}