{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-04", "description": "I must echo what other wise reviewers have said before me. BAM Rose is fantastic! Such a great theatre that plays the kinds of films I want to see. \n\nTonight I went with two guy friends to see \"Escape from New York\", the early 80's Kurt Russel flick. I had always wanted to see it but never had the chance. Loved the film and saw it with a good crowd who made it even more fun by laughing at the 80's cheesiness in many parts. The only thing that kinda sucked was the quality of the print. There was never a shot in the entire film that had true black in it. The negative had faded and everything that was supposed to be black now looked maroon. It was distracting at first, but I got used to it. After hearing what a great theatre this was, I figured their prints would be really nice. But I'd rather see a scratched up film than no film at all!\n\nAdmission is $11, but you can become a member of their cinema club and enjoy discounted or free tickets depending on how much money you spend! I'm tempted to spend the $300 for unlimited movie tickets per year.", "author": "Aimee A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "Yup BAM is great. BAM cafe has free live concerts on most Friday/Saturday evenings, just make sure you head over before the concerts start to snag good seating. BAM Rose Cinemas is the best local choice for independent movies and even some mainstream ones, however the theatre seating is less than ideal. Another reason I rate them less than 5 stars is one painful musical I was subjected to a few years ago. It's hard to forgive for the three precious hours of my life forever lost on a musical about Edgar Allen Poe directed by Lou Reed. I like Lou Reed, I like Poe, but putting the two together is apparently a recipe for disaster. \nJust check Yelp before you go to see any musicals... current Edward Scissorhands musical sounds like it could be another potential train wreck...", "author": "nara f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-09", "description": "A reason to live in NYC!\n\nThey show the semi-arty new releases, but every night one screen has original programming that goes pretty deep and brings up beloved or fogotten masterpieces and curiosities. They had a whole series of late-period Robert Aldrich--who else does that? More and more, big-time stars like Elliot Gould and Robert Redford are coming here to do appearances in conjunction with retrospectives in their honor. My only complaint is that usually their best selections play one day only. Nothing really to do about that. Keep an eye on the schedule and go.\n\nAlso good: the old, grand building its housed in. And, on Friday and Saturday nights, the BAM Cafe upstairs from the theaters has a free party with live music, ever week. See a later movie, then stop there and make a night of it.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "Great theater - good location, elegant space, good sound, nice patrons for the most part, civilized place to see a movie in NYC.  A pro AND con is that it's independent which is good (we need more good independent theaters) but you won't get discount passes - but if you join their movie club that allows for discounts over a period of time.  Plus there are good places to eat right nearby or on Atlantic Ave or in Fort Greene and parking can be had.  Thanks BAM!", "author": "Jeanne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-27", "description": "It's really brilliant to go out for a walk in your neighborhood with no determinate plan and end up at a movie (usually one with some sort of artistic quality and substance) in a gorgeous \u0026 cool setting like BAM Rose Cinema.\nTickets these days are $11 bucks (I hate $12.50 tickets so this is like  a deal)- $7 if you're a member, and they play everything from very independent to foreign and mainstream indies. I've also noticed that just about every day they throw in some random film so you never  know exactly what you're gonna get... unless you check online : )\nThere's also great events like screenings, special guest speakers and various festivals throughout the year.\nLOVE!", "author": "Emilyna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "Gorgous theatre, close to trains wonderful selections of films!  NEW FRESH \u0026 Brimming with select bodies of film work, Every month you can catch something new!", "author": "Joanna W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "Here's an underrated aspect of BAM: It has some pretty good popcorn. The big chain theaters with their cushy stadium seats and their three-dees, they just toss a garbage bag of kernels in the popper and as far as they're concerned that job is done for the next couple hours; they forget about the secret ingredient, by which I of course mean love, also sodium. Not BAM. They care, ever so marginally more. Their popcorn is delightfully yellow and just oversalty enough. It's usually fresh, often hot, and always delicious. It doesn't really require artificial butter-flavored oil topping, but rest assured that should you choose to go that path it will merely be one or two orders of shouldn't-exist-in-nature rather than three to five. Compare that to the frequently stale, leftover scroungings of flavorless Styrofoam you'd get at the big boys. Yessir, BAM popcorn doesn't quite reach the level of the IFC Center's crisp organic goodness, but it's still some of the best you can get at a theater these days. That's why I can't help but smile each of the (on average) six times a week people stop me on the sidewalk to ask how to get to BAM, because I know that as soon as they decipher my shamefully awful and imprecise directions, they'll be enjoying themselves some delicious popcorn.\n\nOh yeah and I guess BAM shows indie movies and stuff too, which is pretty sweet to have near your apartment so you don't have to go too far when your girlfriend wants to see some artsy jerk-off flick where nothing ever even explodes in slow-motion underwater and you're not supposed to cheer when a foreigner dies. But don't worry, they also show normal shit too, like where the title starts with the name of a comic-book character and ends in a number. In all seriousness, it made me a bit sad when BAM started showing more mainstream blockbuster-type fare, but I can see the need, and if anything it just makes the venue more versatile. That said, a little part of it/me died when they were screening \"The Love Guru.\"\n\nI was tempted to give BAM a rare five stars, but my principles prevent me from awarding such an honor to any theater without a slushie machine. I have a specific superficial set of expectations for the ideal movie-going experience, namely, sitting in a dark super-air-conditioned theater in giant comfy seats while munching popcorn and slurping slushies (with the actual movie being quite secondary), and sadly, BAM falls just a bit short. But get a slushie machine, and maybe some slightly more cushy seats, and then we'll talk.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "BAM Rose is a gem.\n\nNot too long ago, I saw Milos Forman debut his latest movie here and do a Q \u0026 A with the audience after. Before the film, he was just hanging out in the lobby, talking with people. That's what this place is like: humble and excellent.\n\nThe building is about 100 years old, but the use of space is contemporary. One of the screening rooms is actually tucked up under the vaulted, ornate ceiling of what used to be the 1000-seat Carey Playhouse. The screen itself is recessed within an arch and the seating curves around like an amphitheater, making for one of the best venues in the city to sit and chat before the lights go out.", "author": "a n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-04", "description": "Don't walk but runnnn here to catch a flick at any one of its film series all year round. This is Bklyn's answer to the Tribeca but only better! I say this b/c I'm a Brooklynite that calls it like she sees it. The quality of films shown here rivals the Manhattan centre and the quality of vendors nearby (location location) only makes my case stronger. When you are in the 'hood, make a stop to BAM Rose Cinemas part of your Bk experience - you won't be disappointed.", "author": "Chante R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-22", "description": "Love the programming and the fact that it is around the corner from the house, but the  customer service at BAM Rose Cinemas is HORRIBLE! The Manager there was horrible and his supervisor even more horrible - supercilious and condescending. They made a mistake and gave my husband the wrong tickets and then made him wait around for the person who made the mistake to come back from her break to exchange the tickets. Really? Exchanging 1 adult ticket for 1 kid ticket and returning $4 requires an in person identification - even when the mistake is theirs? Pathetic.", "author": "Nana P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "I'm a fan of the movie theater here. They show current indies as well as a few oldies. It's clean and only has four screens. I've been to the cafe on free music Fridays and Saturdays. The space is gorgeous, but for popular bands, go early. The cafe can get full easily and you may not get in. They have a bunch of tables and also serve bar food in addition to alcohol. It's a great place to lounge and relax with a few friends on a lazy Sunday.", "author": "Hung L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "Beautiful building, beautiful theaters, great selection of films.", "author": "Jillian B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "Beautiful venue with magnificent and grand opera house.  Great venue to see any theatrical/musical performances.", "author": "Alf O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-01", "description": "I feel the need to say how impressed I was by the experience I had today taking my 7-year-old daughter to a show at the new Fisher theatre at BAM today. It was a lovely space and a high-caliber production followed by a dignified Q \u0026 A session with the artists (for kids! kids got to ask questions!) and the tickets were only $12! That is an affordable price for New York City parents who would like to introduce their children to good theater but cannot afford Broadway. Good job, BAM.", "author": "Leecia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "The entire Brooklyn Academy of Music organization is a New York gem. The architecture of the buildings is gorgeous and the Rose Cinema is my favorite place to see a movie. The screening rooms are smaller than the average theatre, for obvious reasons, and it's a lovely place to catch a new or classic film. There is so much going on at BAM and I highly recommend movies here. The selection is always top notch and the crowds are the most respectful I've seen in New York.", "author": "Francisco G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-14", "description": "Love that there isn't a crowd but for 12 dollars a ticket and no student discounts from Friday-Sunday, definitely not a fan unless they're playing something super good here.", "author": "Diana F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "I love BAM.  When and if I ever leave Brooklyn, this will be something that I'll miss.  I generally find street parking right in front during the week (forget the weekends for movies in Brooklyn folks).  The price of entry is a necessary New York evil.  The movie selection is second to none in Brooklyn, and certainly in the top 5 theaters in NYC in general.  Great art house classics, great indies, top notch foreign films, nice short run stuff.  Beautiful old building, low attitude, nice bathrooms, though a little inconvenient.  Decent snacks, though here they could step it up to meet the quality of the entertainment and decor.", "author": "Tim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "This is definitely one of the best neighborhood theaters I've encountered in the 5 boroughs.  Every New Yorker should take some time to see a movie in different neighborhoods around the 5 boroughs, it's really one of the great aspects of New York.  I've had some great experiences at Cobble Hill Cinemas for instance and many different ones in Queens including Forest Hills, but this one really is up there among my favorite.  I think they only have 3 or 4 screens, but the architecture and design is incredible, the feeling of the theater is unique and happens to be a perfect setting to really dive into a movie, and you don't get any rowdy juvenile delinquents here (Like the ones you might encounter at the United Artists in Astoria).  BAM in general is one of the many great things that makes Fort Greene a special neighborhood, but specifically BAM Rose Cinemas is a much needed feature to an area of Brooklyn that is scarce on cinemas.  I would describe it as quaint, cozy, and special.  $12 adults.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "The ultimate movie experience! Not just your average theatre, its set in an old opera house and its stunning! They also have awesome cookies available! Can't wait to go back.", "author": "Carolina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "The main BAM location at 30 Lafayette Ave houses the: Howard Gilman Opera House, BAM Rose Cinemas, and the BAM café. \n\nI've been to several performances/events there throughout this year(including September's cool Takeover event, the National, the BQE performance and for several movies).\n\nThe BAMcafé (on the second floor up) is a cosy ballroom- type space where you can snack before a performance and/or browse through various goods in the bookshop. Conveniently, there are also bathrooms on this level, which were clean. Note: I can only vouch for the ladies' room, sorry guys..   \n\nOnto the Howard Gilman Opera House... The interior is stately and beautiful, you have to go there to see it because- \"no photos! please.\" Security is really strict on the no pictures/recording front. I have to say that I hate this one factor. I wish that they could be more lenient and perhaps allow a \"photo-taking allowed, but no flash photography\" rule?....\nNevertheless, I will keep going to BAM to enjoy the various live performances and movies that they showcase. Go there via mass transit (it's the most affordable/convenient way) if you can.", "author": "Laura Z."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}