{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-03", "description": "I was here for the Feist gig last night.  I supposed because it's an Opera house, they are a bit stricter.  You cannot bring drinks into the venue.  You cannot use your cellphone during the show.\n\nThe sound was surprisingly not that great.  Feist sang that she didn't like that it was a seated show, so she asked everyone to come by the stage.  My friend and I went down from the mezzanine \u0026 the sound was a little better.  It really should have been louder.  \n\nI was surprised they let everyone move up and even get up on the stage at the end.  I guess that made up for the general stuffiness of the place.", "author": "Jennie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-25", "description": "The place to gain creative experience in a different perspective, because it is the perfect place to see small, independent movies. After the movie, go and get something to eat the cafe.", "author": "Ma-e M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "Been to the opera house and the cafe- and attended several dance events there.. \nBeauty that demands your attention I guess comes to mind when I think of the establishment. and there is always a guarantee that each season will host a bevy of eclectic performances from african dance, opera, cuban nights in the summer and ballet..its an over all must experience of brooklyn..\n I love it.Really fun good times!", "author": "Mango J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-03", "description": "I used to be a member of BAM, which was fantastic when I lived a few blocks away; cheap tickets, specials screenings, and invites to cool parties for the \"young\" BAM members (if you're in your 20s or 30s).\n\nSince moving farther away, I haven't renewed my membership, but seeing a movie there last night made me want to. The popcorn! The movie selection! And the guy who always tells you to squeeze in because \"you're going to have to sit next to someone anyway.\" It's all part of what makes BAM unique and one of the better cinemas in the city.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "Beautiful. Modest. Well-kept.\n\nA staple of NYC culture. BAM has been around for more than 150 years promoting the arts. Everyone in Fort Greene is extremely lucky to have to this institution within walking distance.\n\nI've been a member since 2006. For about $80 a year you get discounted movie tickets for you + a guest. If you go once a month, it pays for itself.\n\nYou're not going to find mainstream movies here like 007, Prometheus, or Taken, which is totally fine with me. It's more like Zero Dark Thirty, Beasts of the Southern Wild, or the Descendants. \n\nCheck out the cafe upstairs. The food is really good! And they sometimes have free comedy shows on Fridays. But be sure to check if there's a private event before you plan to go to the cafe. Several times I've tried to walk upstairs to the cafe after a movie and have been stopped because of a private event.", "author": "Steven M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "Bam cinemas is the kind of place where you can catch a new release (the best new releases) or a classic any day of the week.  \n\nMy boyfriend brought me here on Valentine's day to see the 1938 movie Holiday with Katherine Hepburn. It was perfect!!! \n\nConclusion: Great for dates and special occasions.\n\nThe theater looks like small concert hall adding to the antique feel and transported me back to that time.  A lot of the audience was dressed kind of odd.  I wasn't sure if they were hipsters or if they confused valentine's day with Halloween and dressed up for the 60's.  They looked cute though.\n\nConclusion: Is not your usual movie theater.  It's special.\n\nI learned what a repertoire is for the sake of this review and I think it's pretty cool they will feature a collection of films from a particular filmmaker, movie character (like Dracula) or film festival.  That's great for those that are into film/ film history.\n\nConclusion: Film majors, film fanatics, film lovers this is your home.\n\nWithout a doubt one of my favorite places in NYC.", "author": "Leslie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "Architecturally, BAM is beautiful, inside and out. Modern yet classic. Spacious yet intimate. \n\nI've been to the BAM Cafe before to watch the free live performances but never made it to see a theater/dance one so I was excited to experience Water Stains on the Wall by Cloud Gate (a Taiwanese contemporary dance company) at the Howard Gilman Opera House section of BAM. When they have tickets for $20, you have to take advantage!\n\nFirst of all, what I love is that on the BAM website, you can choose a specific seat and they also provide approximate photo previews of the area your seat is in. How awesome is that? It means you and your friend(s) can buy tickets individually, arrange to sit in the same row and more or less know what the view will be like! \n\nAfter much hesitation on where to sit, my friend and I chose to sit in the Mezzanine Center section, Row J. We had a great view! I actually don't think you can have a bad seat in the house. The seats are comfortable but there isn't much leg room. Even for a petite person like me, I thought we were a little cramped.\n\nThe bathroom was clean. Always a good sign.\n\nConveniently close the Atlantic-Pacific Station/Atlantic Terminal/LIRR so you really have no excuse to make it down to Brooklyn for a show at BAM. No excuses! I'll definitely be back to watch more performances here!", "author": "Julia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-21", "description": "I love BAM but...\nThe seats are so uncomfortable and claustrophobic: there's no room for your legs or arms or cushion for your head or middle aisle pathway for quick exit.", "author": "Yvonne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "BAM's movie theater is just so pretty.  While it lacks 3D screens and whatever else is being served up at the midtown theaters, its a beautiful building and entrance, has ceiling moldings and details in the theaters, and stadium seating.  \n\nUsually a limited selection of a few mainstream and more independent movies.  $12 or $7 if you are a member (it makes you want to be a member!).  Usual selection of movie-going eatery fare (popcorn, soda, candies) with a few more unique additions like soft-baked cookies and pretzels.  Sometimes, you do see the most absurd collections of hipsters at certain movies, and the theaters can get a bit crowded, but still.... BAMcinématek Events are also well worth the trip.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-08", "description": "I hate to slam BAM, but this is not my favorite place to see a movie. \n\nThis afternoon, I attended an afternoon matinee. I'd purchased advanced tickets online. When I arrived at the theatre, the ticketing machine would not recognize my credit card. Another patron was experiencing the same error message. A BAM representative at the ticket counter told us that [although we had confirmation number from our original purchases] there was nothing she could do. I had to purchase a second set of tickets. If the first set of tickets appears on my credit card statement, I am welcome to return to BAM and argue my case for a refund. \n\nMy friend and I saw a film in Theatre 3 which has long rows and a relatively small screen. The ideal seats for prime viewing are smack in the middle of the theatre, so if you're seeing a a movie in this space, arrive early and check your claustrophobia at the door.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-27", "description": "I've seen prettier.\nLayout is bizarre, but it\nDoes its job: show films.", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "Saw the Nutcracker here last night. Excellent production! The skills of some dancers does not match up to Lincoln Center's Nutcracker dancers, timing was off and dancers were not precisely in sync with each other; nevertheless, it was still a very good show. Since its the holidays, naturally, you will hear kids crying during the performance. We sat in orchestra seats. They were comfortable. You can sit anywhere and get a good view. The 430pm show was not pretentious and less snotty than Lincoln Center's.", "author": "Jimmy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "Guys, if you live within walking, biking, subway, train, or airplane distance of BAM, get yourself there. I'm a patron and it really makes me feel like a part of my community. Also, the programming is insanely good. The buildings are beautiful. There are great restaurants and bars nearby. It's just the best and you should go and, moreover, become a member and enjoy the benefits BAM offers. The customer service rocks.", "author": "Sara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "BAM was a really dope theater, very unique. I saw the Tribe Called Quest flick here, which was also really fresh. All the hipsters there seemed to laugh at every single thing in the movie even if it wasn't funny. I guess it was trendy to laugh that night or something, that was pretty annoying.\n\nBrooklyn, be careful this hipster shit is a pandemic... it's spreading.", "author": "Spence B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Very nice and clean - the staff is welcoming and it's just great to walk into such a beautiful building to watch a movie.   The seats are comfortable, and it's actually not too cold.", "author": "Jen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "Where can you pay less than $40 for orchestra seats for a beautiful mid size theatre in NYC? Hardly anywhere but here.  \n\nThanks to my friend, I was able to finally watch a highly acclaimed dance rock performance by Hofesh Schecter, \"Political Mother\" on its final night last Saturday.  Wow. What an intense, visceral, mind blowing performance!! The show ran for a little over an hour with no intermission, keeping everyone focused on the stage and figuring out what each move and scene represented. \n\nWith diverse offerings and a cool cafe to kill time before and after a show, I intend to come back and watch other shows in the future. Anyone who lives nearby should pay for the annual membership which provides discounts for tickets to all its venues (Rose Cinemas, Harvey Theatre, Howard Gilman Opera House and Fisher). If the subway commute isn't your cup of tea, try their shuttle bus that runs from Manhattan to BAM.", "author": "Mona L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "Great location.  Near Atlantic Terminal.  Theater.  Cinema.  Dance. You will find something you like.", "author": "Stella A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-08", "description": "BAM sure cuts a striking figure in Fort Greene. As my boyfriend puts it, America's oldest performing arts center (founded in 1861) was Brooklyn's claim to fame way before NYC's creative culture put it on the hipster map. If a building could swagger a bit, BAM would. \n\nAccording to BAM's website, Henry Beecher Stowe, Susan B. Anthony, Sojourner Truth, Gertrude Stein, Langston Hughes, Frank Lloyd Wright, and Amelia Earhart have all spoken at BAM. The hallways seem to reverberate with their gravitas, even as the windows shine with glimmering digital light displays that evoke stained-glass windows, and the interior has been updated tastefully to reflect the minimalist tastes of the 21st century. \n\nThis was the perfect venue for Crossing Brooklyn Ferry, our latest excuse to explore BAM's main theatre and upstairs BAMcafe. The sightlines and acoustics in the large, general-admission hallway were both blissfully clear, and the empty orchestra pit permitted listeners to get out of their seats and up close to the stage. The lights and fog turned Atlas Sound's already ethereal set into something close to awe-inspiring, and as Beirut took the stage, it was easy to picture him standing alongside the ghosts of crooners past as they too looked out over a rapt audience. \n\nComing out of this traditional theatre setting and into the high-ceilinged BAMcafe section is a cool experience, too: all of a sudden, you've got high-rise Brooklyn views and a floor lit by those stained-glass light displays. It's lovely. My only complaint here is that it's not the best place for a DJ set (our occasion for going up there), as the high ceilings seem to create this subconscious, self-conscious effect in the crowd, and people seemed less prone to dance. It also seems a bit harder to hear the sound coming off the stage, and impossible to see the action, if you're standing in the back. \n\nOne final non-performance-related note: the coffee is SO GOOD. I know y'all went out to the lobby to get a beer, but seriously. If you're planning on dancing all night, might as well partake (cash only!). I'm glad I did.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "Great spot to catch those artsy films that, after viewing, make you better than everyone else. :) I love how their matinees on the weekend are at 2 PM. I also love how they show older films as well, just like Museum of the Moving Image does.\n\nNot sure if all the theaters are like this, but because of the way the building is built, all the seats are at an angle to the screen. If this bothers you, I suggest getting there early, as the center of the rows fill up easily. However, if you end up on the side, you get used to it eventually.\n\nThere's always something good showing, so I recommend getting on their mailing list. Some of the older movies only show for one day, so it's definitely useful to have the calendar so you can plan accordingly. Enjoy!", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "I am in love with BAM Cinemas, and I am not afraid to tell you about it.\nGreat movies, clean theaters, nice employees, great movies, and great movies. god bless.", "author": "Janson L."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}