{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "Discovered this little gem that isn't quite so little about 7 years ago I was changing life cycles and figuring out life on my own. At the time Brooklyn itself really became an enclave that was helping to heal after one of my greatest time of loss. \n\nIt's not that I hadn't previously known it was existed, I just didn't realize how exclusive most of the content was and how special it would become to me. While BAM Rose does show some mainstream films their selection is carefully curated to its audience. For the most part this is the only theater in BK that you'll see films from the African and Caribbean Film festivals or series. \n\nTwice a year, patrons flock from near and far to binge for 3-7 days on some of the best films created by people of color from all across the globe. It's incredibly special to have the opportunity to see films I might not have otherwise hadn't they been showed at BAM. \n\nWhen I had the opportunity to secure a membership through the IDCNY program, I jumped. It allows me the opportunity to see exclusive content, attend members only events and network...an absolute joy. \n\nFor my most recent visit, over 4 days I submerged myself into films created by the Caribbean Diaspora. Rich in content and culture they questioned and challenged everything from faith to family, religion, sexuality and everything in between. \n\nThe location is clean, welcoming and staff is always accessible to answer questions or address concerns. There are enough bathrooms to deter lengthy waits and the concession stands will cater to your snack/ sweet tooth habits. No complaints here.", "author": "Sasha B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-11", "description": "Attended Andy Borowitz event last Saturday.\nLoved the easy access to LIRR.\nNice looking theater.\nHowever, the Mezzanie seats are so close together that my knees were aching after 45 minutes and I am only 5'2\".\nFor this reason I will not return to an event there.", "author": "Cher W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Best movie theater hands down.. I'm not talking in Brooklyn but all of NYC.\nEverything about this theater is on point: from its landmark status to the eclectic movies, or works of art, that they present.\nThe building is elegant with its high ceilings and lovely architecture inside and out.\nA lot has changed at the Peter J. Sharpe building:,I remember the orange cushioned seating that welcomed you when you entered. The convenient kiosks that you utilize to avoid the lines for ticket purchasing. Alas, both are gone replaced by mobile phone ticketing and such.\nWhat hasn't changed is the courteous and top notch staff that works at BAM. I always encounter smiling faces and warm greetings.\nThe concession stand carries fresh and delicious popcorn.\nI also love the framed posters that adorn the wall.\nIt's great to see Cary Grant winking at us as we enter Cinema Paradise.\nThere is a ticket booth to purchase tickets for BAMs special events and theater presentations.\nI've also discovered this lovely waiting room with comfy sofas: one can sit and gather with friends until your movie starts.\nI've recently become a BAM member. Check online for all the discounts one can enjoy with BAM membership.\nPre or post movie there are wonderful eateries near BAM. I highly recommend Baba Cool for delicious coffee, Atlantic Social a sports bar with delicious wings, 67 Burger for yummy turkey burgers and Emmys for great pizza near Fulton Mall.\nSee you at the movies!", "author": "Fawn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-13", "description": "Since moving to Brooklyn BAM Rose Cinemas has given me film moments that I'm super grateful for. I enjoyed seeing Get Out in the theatre setting similar to an opera setting with the red molded awning. The concession stand is very affordable and the employees have always been nice. They offer discount pricing for seniors and I believe students too. They also have a membership where you get discounted tickets. I do not have a car and it is very accessible by bus or train. They offer presage tickets and some screenings have \"talks\" after. I will definitely continue seeing films here.", "author": "Megan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "I will have to begin by saying that this is really a 3.5 star review rounded up because the employees are friendly and helpful.\n\nWhat I love about this theater is their selection of interesting and artistic films (though as others have pointed out, they might want to rotate them more often), their matinee and members ticket discounts, their better than average concessions stand and the building itself which is far more interesting than the chain theaters.\n\nWhat I do not love here are the uncomfortable seats and lack of leg room. So while I appreciate the classic theater look, I'd appreciate a more comfortable seat more!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-31", "description": "This movie theatre is nice and historic but it's in need of sum repairs I really expected more from this historic plc but I guess not. The bathroom was so dirty and unkempt iam so shocked I cant get over it but the outside is still beautiful and amazing looking the movie theatre part was so tight  lookin not spacious at all I didnt visit the other parts but they seem like they may have been a little better looking hopefully this plc plays all types of movies from film festival to regular movies which are in the movie theatres which alot of people didnt know like my cuz she was surprised to kno this plc plays movies that are in the movie theatres today we went to see US which wasnt bad but I cant explain my feelings about it but the ending was definately a wow moment ..", "author": "Gwendolyn O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Came here on a lazy Saturday afternoon to see a movie - can't believe I've never been here before - it's awesome! For some reason I had this idea that they only showed indie movies and foreign films so I never thought to come here, but they also play select major motion pictures. All shows are $15 for adults, but it is half price if you are a member, which is really an incredible deal. I was able to become a member with my NYC ID for free. \n\nThe theaters are small and have pretty standard chairs, nothing fancy. It is incredibly clean and well maintained though so it was one of the most relaxing and pleasant movies I've been to. The BAM building itself is also very beautiful and it's a very classy place to see a movie. This would be the ideal spot for a movie date. \n\nThey also have a limited concession stand with basic popcorn and drinks.", "author": "Natalie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "**BAMboo Review** BAM knows how to treat the kids right. Never been to one of their cinemas and yes, I know it's a shame but I've just attended the 17th Annual BAMboo festival. What a cordial yet ambitious gathering of kids, tots, and ghouls and unicorns galore. Numerous games with prizes whether you won or not. A bouncy house. And a DJ. A magician doing tricks and dressed up voluteers handing out treats. If you had no pail or bag, they provided that. They had a best costume contest. There was a hay baler/autumnal arrangement background that we loved and took many pics in front of. Caricature drawings, art stations, and just fun, fun, and happiness amongst kids. My 8 year old niece and I are super thankful and grateful for what BAM produces every year with BAMboo. If it's not the thing to do for you, let it be the thing to do before that thing you do on your next Halloween!", "author": "Jason T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "BAM Rose Cinemas is a very cozy theater with comfortable seats, quality projection and audio and, most importantly, a great selection of creative, entertaining and educational films.  I saw Boyhood and Eights Grade here.  The best seats in the house are in the middle, not unlike most theaters, however due to the short and wide layout there are not as many available.  At least this was true for the screens I experienced. There's a ton of great things to do and places to eat in the area so it's not hard to call this a destination cinema.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "I've always heard great things about B.A.M before even going there. I went there a couple of weeks ago to see the movie \"sorry to bother you.\" The movie was weird, but I'm here to tell you about the theater and not that movie. When I got there all of the tickets were sold out. I didn't know you could purchase tickets on the B.A.M website. But overall, the theater was nice, the bathrooms were clean, and the staff did what they had to do. This theater is a little bit out of my way, but I properly would make the trip to see another film here if I had too.", "author": "Rasheeda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-05", "description": "We liked it, but unless you pay $150 per year for membership per person, the movies are $15 each + $1.50 service charge if you buy on-line which given the number of empty seats in the huge theater, that was a rip off. If you have the membership, the movies are $7.50, so you really have to go to a lot of movies to get the money back. idk. Brooklyn movies are more expensive than Manhattan movies.", "author": "T T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I'm proud and honored to write a review for BAM. I've been a member for three years now and I have enjoyed the benefits of my membership immensely. It goes without saying, BAM and all it's local sister sites add to the cultural beauty of Brooklyn and the community. I've seen many movies, plays and special performance at BAM. I feel BAM and it's amazing staff keep getting better and better. \nIn the past few months, I've participated in an annual BAM membership appreciation gala and two movie screenings. It's a wonderful thing to live in the neighborhood and know BAM exist. BAM is surrounded by many other great cultural center but I find BAM to be very unique in their programs and offerings. It also helps that with your membership, you are offered access to special events first. It's also nice to get first dibs on special concerts, shows and discounted movies. I can't say enough good things about BAM as I will continue to be an active and enthusiastic member.", "author": "Percy H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "This review is for BAM Rose Cinemas. To say the least, very disappointed with the protocol for their selling of tickets. I commuted a lengthy distance for a movie to be turned away because \"there were no more seats available in the theater\" despite purchasing tickets ahead of time. I was severely disappointed to find that out that the theater sets aside an certain amount of tickets for BAM Members (since they are free for members) so even if you buy tickets in advance...a BAM member will likely to take your spot in the theater. There needs to be a better protocol for online ticket sales. If I was able to purchase a ticket online, they should have a better idea of how many tickets they can set aside for members versus non-members.\n\nAlthough we got our refund, I don't think this is a fair way to treat those who are not members with BAM. I will never go back here for a movie...ever again. Extremely disappointing.", "author": "Candice M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-13", "description": "So I went with my friend to this theatre and I have to say I was disappointed. First, the movie ticket was $15 if you aren't a member of BAM. The theatre needs to be updated, the seats were uncomfortable, the screen resolution was not great. They don't ever have to worry about me coming back there to see a movie. Comparing the them to other theaters I recently went to for less, this place is awful and has no value.", "author": "Michelle J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Went to see the movie \"Coco before Chanel\" here its was a while back . (there only play documentaries movies here ) b.a.m is not your typical movie theater, there have an opera house as well too  , as well a stage for plays and musical theater concerts. i would definitely would come back to this theater  for a documentary movie (B.A.M) !!!!!!", "author": "L L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "I haven't come here for a while. Last night I had a really nice dinner with my BF and then came here to see Spike Lee's BlacKkKlansman, which was very good. The building hasn't change much. The theater is goreous and the seats are comfy. The guy who took the tickets was nice and gave us good directions to our theater. I really like to come here for other shows as well because my BF has membership discount. Will come back for a dance performance later the season. Overall it bought back good memories and I enjoy watching a good show (movies or dance) in a beautiful environment.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "Came here for the BAM hallaween event. Gave BaM the check in do to the great event for the children. They had candy coloring and games for the kids. It was an outside event. The best thing was the bouncy house for the kids. As my son loves those things. They had people dressed up and of course parents and kids where in there costumes. It was a very nice and i hope BAM does this next year. Oh yea lets not forget about the good music...", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "I'm getting really tired of the entitled whyte pypo who go to BAM and act like it's their living room. I swear it's as if people make the decision to go to nice, pricey movie theaters just to be annoying. This is why I choose to travel farther to theaters like Alamo and Nitehawk Cinema; where it's required for the patrons there to shut the fuck up or get out!", "author": "Raine O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-04", "description": "Great place to see a movie - too bad they get new movies as often as SJWs have a sense of humor about anything.", "author": "John J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "As a proud BAM Member, I have been taking full advantage of my BAM Membership. I have had the pleasure of seeing many movies (at half price) so far which included Don Cheadle's spectacular performance as Miles Davis in Miles Ahead, Sally Field's recent movie Hello, My name Is Doris as well as Oscar nominated short films and animated films. The highlight was being able to watch the Black Panthers Documentary that was shown on the same day as the Dr. Martin Luther King Celebration held at BAM. \n\nEverytime I walk into the BAM Cinema I take a moment to enjoy the ambiance in the lobby. Inside of the Cinema is a cute snack/refreshment area. They serve some of the buttery and freshest popcorn that I have ever tasted! The upstairs and downatairs theaters are both clean and neat. In my opinion, the movie theater seats are comfortable. This is my favorite place to go to see films!", "author": "Alexis M."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}