{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "This was my first visit to BAM and I was pleasantly surprised!  Great venue!  Beautiful both inside and out.  Show was innovative and creative.  Super convenient to get there.  Lots of things to do and see in the area, also.  Quality programs in a venue bursting with character and history.", "author": "Andie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Great indie theater, though it is packed full with almost exclusively elderly people and hipsters.\n\nProbably the only indie theater I've been to in NY that has stadium seating. However, there is not much leg room, so once the movie is done, unless you want to be a little rude, you have to wait for the old people that like to watch the credits for no reason completely get up and move in order for you to pass by to exit the row.\n\nAs a frequent moviegoer of all of the chain theaters in the city, here are some tips:\n- The popcorn is pretty good (pretty oily, even without the butter).\n- The large popcorn and soda costs $10, which sounds much cheaper than you pay at an AMC or a Regal, until you realize that the \"large\" sizes here are probably closer to mediums at the major theaters.\n- If you are like me and can't stand when there aren't free refills on popcorn, just ask the server nicely if there are refills, and have a dejected face on when she says no, and then if you are lucky like I was, she may take pity on you and agree to give you a refill anyway.\n- Matinee showtimes, which don't exist in the city, are only $8, compared to the full price of $12.\n- There were only 2 trailers and NO commercials (one of the best things about the experience here). This means that the movie started only 3 minutes after the scheduled start time, as opposed to about 20 minutes at chain theaters, so be careful and plan accordingly.\n\nAfter discovering this place, I will definitely be making the trek to Brooklyn every now and then instead of settling for just always going to Landmark and Angelika.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Indie films and documentaries? Then you are in the right place. I've been here a few times. Most recently I went for the caribbean film fest. There was a great Q\u0026A after. If you have a membership, you get a discount on tickets. I strongly recommend supporting our local cultural establishments.", "author": "Melia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "I rarely go to the movies, so who am I to judge? But after coming here to see Central Park Five the other day, I'm asking myself why I bother traveling any further to see movies. This is ridiculously convenient. I love that BAM is so multi purposed. If you are into the stadium reclining seating of iMAX theaters, this theater may not do it for you, but otherwise you should consider it. They also tend to play a mix of big commercial films as well as independent films, so the selection offers options for whatever your interest may be that day. They also offer all the bells and whistles that you'd expect at other movie theaters- popcorn and oversized candy. I do question how well this theater would work for anyone with mobility issues, since there are lots of stairs and stair climbing required. \n\nPlus when you step out of the building and bump into someone that you used to date,  they'll assume that you are leaving from watching the new dance or live performance showing at BAM and that somehow you became very cultured once you guys broke up....All from checking out a movie at BAM Rose Cinemas.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Nice, celan and confortable theater showing the best releases of the season. Great location where before or after your movie you can enjoy a stroll through Downtown Brookly", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "After getting my NYC ID card (if you dont have one get it. You can get 1 yr memberships to most NYC cultural institutions as well as movie discounts) I came here to get my free yr membership for the half price movie discount. This is the only place where you have to wait weeks to get your card and they wouldnt give me a temporary card so having made it here and wanting to see the movie playing on that day I stayed and waited for the box office to open only to find out there was a server issue and it wouldnt be playing. Pretty shabby first visit but undaunted I returned a few weeks later after receiving my membership card,this time to see The Martian. I was running a bit late so had to skip the concession but I see they have cookies from Baked so thats a big plus. \n    I love the fact they did not show any commercials. Just a few trailers. Thats a big plus. Also after my talky crowd at AMC 34th last week the quiet and respectful crowd here was very much appreciated. The film itself was fantastic and that of course added to the enjoyment.  The seating was not stadium but the theater wasnt packed so I had nobody in front of me so no problem there. \n    All and all after my first rocky experience I will surely be seeing lots of movies here as it is only a few train stops away on the D,has well mannered crowds and half price is the right price.", "author": "Tory L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "I am surprised that I have not reviewed BAM, I guess I was not Yelping when I lived in BK.\n\nAnyway the theater is great and I think I have seen a live show here as well. Very easy to get to from anywhere. I love the architecture and it just has a great feel to it.\n\nThey also have interesting things always going on.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "I have never not enjoyed the films I have watched here. Perhaps it's the fine selection of documentaries and indie flicks that BAM shows. Or perhaps it's my refined taste. Don't make me choose.\n\nActually, the only time this place kinda stinks is when you see a show that is booked. Then man, you better get here early and sit on your hands or something. The popcorn is alright.", "author": "Mike O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "I know it is lame to say with BAM only a few blocks from where I habitat and I've never been there. So finally got a chance to go see a show here recently. A Morrissey concert. I've been to a couple of his shows recently in NYC. One at Radio City and Terminal 5. How different both where.\n\nThe theater is a lovely space. Everyone who worked there that we talked to was helpful and very nice. The seats are generously spaced compared to other venues. The concert here is a seated venue and I was impressed. I wish more concerts handled concerts this way. They let the fans stand in front of the stage. There was so complaints by people blocking views, no drunk people, no hassling from the docents to sit down(like another place I reviewed), the security was firm but not aggressive. The crowd mixed with Brooklyn hipsters, baby boomers and diehard fans. \n\nI will definitely want to come back and see more performances at BAM and way to go Brooklyn!", "author": "David N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "This is definitely not your average movie theatre. It's a great place to go see a movie that isn't playing everywhere else. Was able to see Only Lovers Left Alive without having to trek all the way to Manhattan. I've seen a few people mention that the tickets prices are cheaper. Maybe with some films that is the case. I still paid $13 for my movie. However, since that's the average price of a movie ticket these days, it didn't bother me at all. \n\nThe theatre is small but very clean and well maintained. It also seems to draw a more reserved, well behaved crowd than your typical movie theatre.", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "This is a really awesome place to see a movie.  I had a day off while up in Brooklyn to play a gig and I wondered in here.  The theater is lovely and makes you recall what is special about going out to see a movie.\n\nHope I can make it back someday.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Insanely beautiful lobby, great cafe, high ceilings with architectural touches inside and out.  Old and new cinema entertainment and festivals are really impressive.", "author": "Mr B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "One of my favorite theaters. Has never been disappointed with any aspect of performance. Always clean, Staff is always so incredibly sweet. \nI love their choice of older films, especially during their themed festivals. I just recently became a member because I was visiting so often! 100% recommend-go out of your way for this place.", "author": "Cherry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "Love that they offer real drinks in addition to the regular move theatre fare. Its always clean, staff helpful, and honestly the people who go to see movies here aren't obnoxious. You wont have to put up with talking, texting, interruptions for the sake annoying people, laser pointers, and distractions. I do wish they had a larger selection of movies and more show times available, but its cool that they show so many indie films too.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "This review is long overdo. I love this movie theatre. The films skew on the art house side, or highly reviewed critical fare.  The staff is super friendly and the prices are great  9.00 for a ticket instead of 14.00 is always a thrill. \nThe theaters themselves are fairly small - sort of old school -no stadium seating here. \nProbably best of all is the crowd, quiet respectful and a nice ambience overall. \nConcession stand gets extra bonus points for the popcorn! \ndefinitely worth a trip wherever you are in the city.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "I recently saw John Legend, here, and was very impressed with their work. They truly did an amazing job.", "author": "Giacomo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "Got to see a Q\u0026A with Justice Scalia here. Acoustics in the theater were pretty good, but then again, I was sitting in the front row, so I'm not sure what it was like for people in the nosebleeds. The theater itself is really nice, with balcony seating. The design of the interior is very intricate, especially the ceilings and the huge windows that light up from the outside. The place is also close to the trains (Atlantic Ave. Station). What I didn't get was why the stage was so dusty! Wouldn't have killed them to run a swifer through it before the event.", "author": "Tamanna R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "Came here to listen to Star Talk lecture by NEil Degrasse Tyson and others. Loved the venue, the ambiance and the theater. Feels a little old but in a good way. It's a short walk from the nearest subway train.", "author": "Venkata M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "So much more than a movie theater!\n\nThis place is great.  The entire experience was great.\n\nPre-ordered tickets online, and the \"automated\" kiosk, spit the tickets really fast, once I swiped the card that I used online.\nI notice and appreciate small details like that.\n\nThe entrance way is grand, and had an art exhibit/sale featured.\n\nThe counter people at the popcorn stand were friendly, fast and efficient.\n\nNice bathrooms.\n\nThe theater itself, institutes architectural elements of the original theater, framing the modern and wide screen.  Comfortable seats, with about 30 long rows,  with about 40 seats per row.  Get here a little early, if you want a center seat, because the rows are singular.  You also probably want to make sure you do your bathroom break before you sit down.\n\nOverall, a great experience, in an awesome venue.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "One of the best places to see a movie in New York City.\n\nBeautiful architecture, great mix of indie, mainstream, and repertory films. They often do advance screenings of films with the director and/or stars present. These always sell out so you usually need to book in advance, but always worth checking out.\n\nThey also have a deal with Sundance so they occasionally will present a few films in advance of their regular release in conjunction with the festival. \n\nThe film pricing here is standard, but one nice thing is that they actually do have matinee pricing, which is a true rarity in the city. I think it is about $8 or so.\n\nA great space to see a film.  If I lived in Brooklyn it would be my theater of choice.", "author": "David W."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}