{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-24", "description": "So glad that BAM is a convenient walk from my apartment.  Love the cinema choices and the performances. The building is gorgeous and lovingly restored.  My only complaint is that I wish that they did a better job with community outreach to older and ethnic residents instead of trendy Manhattanites.", "author": "Janet C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-05", "description": "I loved it.  Like the movie theatres I remember from my childhood, without the  heavy clouds of smoke...you can look up at the beautiful ceilings if the movie bores you!", "author": "Wanda N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-16", "description": "i like this place because it's named 'Rose'  and so am i.  \nthat's legit, right??\n\nreally, i just appreciate  theaters with a little character.  i'm so bored of the massive multiplex.\ni wasn't familiar with the area, so the building from the outside was a little obscure.  there was scaffolding covering the address, and i almost missed it, due to the fact that it fronts the face of a government building.  inside the decor shines of pre-deco visage.  facilities are clean and the auditorium was large.  \n\nminus a star for the cafe being closed, though i was probably there on an off hour.", "author": "rosie l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-17", "description": "An okay place to see movies.  It's not really better just because it's BAM.  I saw BORAT there to a packed crowd which was fun.  The theater was this great old-fashioned movie house type theater which was great.  I also sat a few rows behind Heath Ledger and Michelle Williams and stood on line behind them for popcorn.  That was funny.  I guess the only way I can sum up BAM Cinemas is to say: \"Heath Ledger thought Borat was really funny--even the naked dude wrestling scene.\"", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "I love this place!  It's the first place I check when I want to go to see a movie.  There are so many options for other things too - music, talks with writers.  It's a great Brooklyn center of all things cultural and exciting.  So glad to have it nearby.", "author": "Alyssa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-02", "description": "Better than some indie theaters I've gone to in terms of size and seating, but the selection is pretty much the same.  Only they also have a mixture of mainstream stuff.", "author": "Li M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-16", "description": "They do a great job of picking films here, but unfortunately BAM is coasting on that--the seats are really uncomfortable, the sound muddy and the screens small.  Once the sorts of movies they show become available for simultaneous streaming--or even just soon after screening--I'd recommend staying at home. Cheaper and more comfortable. And i say this as a huge supporter of BAM who wishes that they'd invest some money in these theaters to bring them up to modern standards.", "author": "Richard B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "I've seen some great performances here, including an absolutely magical \"performance\" of the silent film \"Pandora's Box\".  The space is quite large, and they have some interesting movies come through.", "author": "David J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-09", "description": "I loved this place, I saw Sufjan Stevens here about a month ago.  The place was beautiful, it was easy to get to, even though it was sold out and we were in the back the seating was arranged nicely so I could see over the people in front of me.  I would really like to see another performance there...everything seems very professional and classy.", "author": "Moira B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-21", "description": "I a good place to go if you want a little bit of history added to your movie experience. The theaters themselves are actually rather small for my liking and the chairs can become a problem. Again, the ambiance is nice though. They are however better know for their indie films so that is always a plus!", "author": "daniel s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "when you want to see a film like a civilized person and sit in comfy seats, enjoy lovely snacks, peep some cute dudes and soak up a truly brooklyn experience then go to court street cinemas. ahahahahaha, NO. don't do that. though that is a whole other kind of truly brooklyn experience (go see anything, doesn't matter what, at 3:40am at court street and see what i mean).  BAM is awesome. BAM is beautiful. BAM is maybe all you need to be up on cinephile stuff and impress that lad/lady who majored in film at that fancy liberal arts school.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-10", "description": "Fans of BAM pay attention to this! I called BAM to find out about student rush tickets. Latasha was very nice but she said in order to get student rush tickets I not only need a student ID but I need to be 25 tears old or under. I'm 33. I'm a student and cannot afford the high price tickets. They refused my $10 even though they have nearly 60 seats left for the last night of Lipsynch. They will not sell all those tickets and could at least get my $10 + my friend's $10. This is 100% age discrimination. I was told that they get a lot of complaints about this but refuse to change it. Statistically (especially now with our current economy) most students are over 25. Last I read the average age of students at community colleges is 28.  Most Graduate Students are in their 30's. I'm a theatre student and have no job. I should be encouraged to see this show \u0026 the theatres (with interest in theatre declining) should be pushing student tickets more. If you are fan of BAM call them, write them and get this changed. Theatre isI called BAM to find out about student rush tickets. Latasha was very nice but she said in order to get student rush tickets I not only need a student ID but I need to be 25 tears old or under. I'm 33. I'm a student and cannot afford the high price tickets. They refused my $10 even though they have nearly 60 seats left for the last night of Lipsynch. They will not sell all those tickets and could at least get my $10 + my friend's $10. This is 100% age discrimination. I was told that they get a lot of complaints about this but refuse to change it. Statistically (especially now with our current economy) most students are over 25. Last I read the average age of students at community colleges is 28.  Most Graduate Students are in their 30's. I'm a theatre student and have no job. I should be encouraged to see this show \u0026 the theatres (with interest in theatre declining) should be pushing student tickets more. If you're a BAM fan call them, write them and help us get this changed. They are putting on shows that they should want more people at, especially students, and this is not acceptable. Most Broadway theatres only require a student ID \u0026 do not need to limit the age. With so many middle aged people going back to school now why would anyone want to limit who can get in? Without the student rush tickets I can't afford to go. It's $75-$150! Help me get this policy changed so more people can be enlightened \u0026 educated through theatre!", "author": "Marie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-30", "description": "A place that is committed to new works and new takes on old works, I have never encountered a place that is quite as vibrant as BAM.  I have seen performances here that I would never get to see anywhere else, both home grown and imported..", "author": "Pat D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-12", "description": "this is my first choice of theaters when i'm making plans to see a movie, so it's too bad that they only show a few at a time.  but, that being said, the theaters are super-clean; the audience is sooo respectful (i HATE when people talk during movies -- this isn't your living room!!); and independent, only-in-selected-theaters movies are often available here.  quality stuff.", "author": "Lily T."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}