{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "How many other movie theaters show current films with 8.50 tickets? I can't think of any nearby.  BAM is a wonderful institution, and I'm so happy I made it official with a membership.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-04", "description": "BAM is a gorgeous theater. My bf got tickets for us a few hours before a movie yet we ended up going really late. We showed up 20 minutes late and the staff people told us to talk to a manager. A manager ended up giving us new tickets for use at any movie! So we ended up coming back a few days later to use them. The great thing about movie watching here is that it's not crowded! It's clean, spacious, great seats - stadium seating which I found better than any regal cinemas. They also have a concessions stand that sells ice coffees and ice pops plus popcorn obviously. Overall a great place to watch movies.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-02", "description": "Meh,  very very small. I would rather wait for the movie to come out on DVD. I felt like the guy next to me was sitting on my lap and I got to hear him digest his popcorn so that was nice. Ohh and of course the 6' 8 \"giant sat right in front of me, grrrrrr.", "author": "K M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "They feature stadium seating but it's not your typical movie theater.  There's something unique, off-beat and historic about this place; a true Brooklyn landmark.  Not to mention, BAM offers various type of movies - from classics to indie films and even a few mainstream movies.", "author": "Deana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "TOP NOTCH MOVIE CINEMA. \nBAM Rose CInema, I am so glad that you are here. I am so glad that you are a part of the cultural landscape of the area. \n\nThis isn't the type of spot you would go to when you want to see the 3D version of MIB3, but it certainly is a movie venue where you can catch movies (new and old) in a more intimate and artsy arena.\n\nThe prices are fair and the staff is friendly. Really great mix of flix. SO SO SO glad BAM Rose Cinema is here to stay!", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "I've seen two shows here now: Ra Ra Riot a couple years back and Jeff Mangum this past Thursday. Of course I may be biased since I saw the show of a lifetime in Jeff Mangum on Thursday, but the venue definitely enhanced the experience.\n\nThe theater is beautiful with high ceilings with intricate detail. The sound was excellent. I typically prefer standing venues, but for those shows where it's appropriate to sit, the BAM is where I'd like to be. \n\nHaving the BAM Cafe to hang out pre-show is a huge bonus. It's so nice to be in a beautiful, clean space with plenty of beverage choices before seeing a show. It's never too crowded (even with a sold out show) and there is plenty of seating at the many tables which makes for easy pre-show conversation. \n\nSince the show sold out in a matter of seconds, I did not get tickets. BAM has a will call only policy, which I love, because it prevents people from buying multiple tickets and profiting off of them at a huge up charge. I'd much rather my money go to the band I'm paying to see or to the venue that is putting on the show. However, it is a bit of an inconvenience if you buy tickets in advance and end up not being able to make the show. I was hoping to capitalize off this arrangement so I just showed up at 7:45 (opener went on at 8/doors at 7:30). \n\nThe BAM staff was incredibly helpful starting from outside the venue. A staff member directed me to the Will Call line that moved very quickly. Once inside, another staff member directed me specifically to window 5 and then another staff member (I'm beginning to lose track, there were so many of them!) led me to the window. They were able to locate two tickets in the 11th row, center stage! \n\nI was so caught up in the magic of Jeff Mangum's performance that I actually left my Blackberry behind. Sam from security (possibly the head of the department) tracked me down the very next day by calling some of my contacts and eventually figuring out what my personal email was. He was so thorough, I suspected he was doing so for the tip he expected, but he absolutely refused it when I offered! He said that he just hoped I would be back. Well, of course I will!\n\nIn summary, the BAM is a fantastic place to see a show, provides ample helpful staff, and if you lose your phone, you'll get it back the very next day!", "author": "Terry T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-03", "description": "I attended the \"Tabac Rouge\" show last night (Oct 2) at 7:30 pm. The performance was so fantastic, and the venue so gorgeous, it is a shame that the whole experience was marred by one employee. My wife and I had tickets for the upper balcony, and the ticket-taker downstairs instructed us to take the elevator up to the third floor. We did so, and when we went through the curtain to the balcony, the woman in charge of the balcony barked at us to get out, that they weren't open yet. Her rude tone was really too much to put into words--as if we were naughty children who needed to be made to feel shame and guilt. I explained that we'd been told downstairs that the balcony was open, and she could be more polite. Those were my words: \"Ma'am, you could be more polite. We were told. . .\" Again she snapped at my wife and me, again the nasty tone that has my blood boiling even now just thinking about it. She was a middle-aged, African-American woman, but I didn't see a name tag. When the balcony did open (about 15 seconds later, although she'd acted as if we were unfathomably just barging in), she was the woman taking tickets. \n\nIs this woman always so nasty, or only to paying customers? Is this the kind of person and tone you want representing your beautiful theatre? Every other aspect of the evening was great, but when one is so deeply insulted, the rest is really ruined.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "I think one of the reasons my wife wanted us to move out to Brooklyn was to be closer to BAM.  This place is great.  We love the \"Eat, Drink and Be Literary\" series, and have gone here for a few other events as well.  Great venue, great outlet for ideas, art and culture.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-10", "description": "So, I gave up Diet Coke on January 1, 2011. \n\n(Inside your head): \"What the hell does that have to do with a crafty little cinema showing indie (and semi-indie) flicks in Brooklyn? \n\nOh, right. Ok...so, my ONLY exception to this \"no Diet Coke\" law...is that I can enjoy an XL at movie theaters. Because as all of my current and former recovering DC addicts might know, movie theater bubbly fountain soda is quite possibly sent from God himself. He must like movies. \n\nSo on a recent Sunday when faced with \"what shall we do today?\" my undercaffeinated, zero-carbonation little heart sung \"LET'S SEE A MOVIEEEEEE!\" \n\nI'm not so sly anymore, but my 4-eyed friend agreed due to lack of energy. Maybe he needed a DC too!?\n\nAnd thus we found ourselves wandering to BAM Rose Cinemas to catch Win/Win (Paul Giametti, wrestling, semi-drama...fits well for both of us - highly recommended!). Tucked inside the Brooklyn Academy of Music...just enter and head to your right, purchase your $12 (ouch) tickets, and then head over to concessions (MAIN EVENT) for a soda (eeeee!) and snacks. Decently priced, and they've got professional student like folks working as opposed to the sometimes disenchanted youth of most movie theaters. \n\n*matinees are $7.50. \n\nAscend the stairs, and voila...4 well-suited theaters for viewing. You won't get the fancy stadium seating/VIP footrests, etc...but the chairs are comfortable enough and it is VERY clean. It's got some very nice architectural elements, and depending on which movie you see...you  might just feel really above average in the intelligence department, just based on the company. \n\nLooking for a movie house or a Diet Coke? Well, this is a pretty grand place for both. It'll be part of my rotation when I need a fix...Or ya know, need to see a \"film.\"", "author": "Colleen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "A true Brooklyn original...  I dare you to find anything like it in any other borough.  150 years of history pushing the envelope and bringing cutting edge art and culture to the masses.\n\nConsidering it's right behind our building I may be a little biased, but I love going to BAM and think its worth the trip even if you're coming from another 'hood.\n\nHighlights:\n - Beautiful, historic building\n - Friendly staff\n - Great mix of films:  Current off-beat indies, some worthy mainstream stuff, and some really great classics\n   - Lots of guest appearances:  Directors, actors, etc. come in for introductions or Q\u0026A's\n\nTips:\n - Buy tickets online for high-demand films at peak times as they often sell out.  They have kiosks that make picking up your tickets super-fast\n - The theaters are not huge.  Show up early for good seats.\n\nThe only complaint that I have is that the \"main\" films showing at a given time do not change out very often.  Luckily there are many short run Cinematek shows that come and go quickly to keep things interesting.\n\nThe BF and I joined as members... not cheap at $130 for a dual membership, but you get $5 off almost every show and it encourages us to get out and culture ourselves.\n\nGO!", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "BAM!\n\nBAM Rose Cinemas is a pretty sweet spot to take in a little entertainment on occasion. First of, it's gorgeous inside and out with refined columns, lofty ceilings, architectural moldings and lighting outside that attracts the eye. The movie theaters are very large, though almost every show I've been to here has been full to the brim.\n\nAdd a great selection of films, a cafe, live performances and BAM, I'm in love!", "author": "Jane K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "I love going to the movies at BAM. The theaters are beautiful, the movies (both new releases, classics, and the scheduled programs) are always interesting, and it feels like a nod to a time when going to the movies was an event. My goal is to become a BAM Cinema Club member to inspire me to go more often. An excellent venue for seeing a film!", "author": "Chey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-21", "description": "If you want to see a film that you can't find anywhere else and support a historic art center, go here. This theather is just one of the incredible sections of this beautiful building. They show some great films in a small intimate setting. \n\nGet there early as the seating is limited and you want to sit in the middle of the theather or have a good view. \n\nBAM also has live performances for a lot less than anything you will find in Manhattan which I plan to check out.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-04", "description": "In my little corner of the world (Bay Ridge, Brooklyn), we have one movie theater - the Alpine.  Its not a great theater and there really isn't much I can say about it except that its in my neighborhood.  They are trying, but they have a long way to go. If you wanted to use a Highlights Magazine reference, the Alpine is Goofus and the BAM Rose Cinemas is Gallant.\n\nWhile BAM isn't in Bay Ridge, its only a short R train ride to Pacific Street.  And its worth every minute of that trip.  BAM has beautiful theaters, plesant employees, great fountain sodas, decent popcorn and other assorted delicious treats.  They also have discount shows before 5:00 p.m. ($7.50 a ticket instead of $12).\n\nI recently saw Black Swan at BAM and the theater, while full, did not feel cramped or crowded.  I have also gone to film lectures here (Paul Thomas Anderson gave a Director's Talk) and that was a great time, too.  \n\nI have to agree with other reviewers -- this is the theater to go to, not the Court Street UA, unless you like fights, stale popcorn, and dirty bathrooms.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Nice movie theater - ticket prices are a little high ($14) and the selection ranges from more mainstream art house movies (the kinds of things that would play at a multiplex) to some exclusive engagements day and date with Manhattan, and the Cinemateque programing which is excellent, challenging, and often presented in 35MM. (They have a Real D 3D auditorium which is used for those rare art house 3D flicks).\n\nClean and comfortable, definitely a unique cinema space", "author": "John F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Glorious. Beautiful, clean. And kudos to whoever had the brilliant idea to show previews BEFORE the printed movie time, so that when they say the movie starts at 420, it actually starts at 420. My only complaint is that you can't put the butter on the popcorn yourself, but I guess you can't have everything..", "author": "Camille M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "A good place to see movies, it gets really crowded sold out.  Order tickets ahead of time and get there early for good seats.  Not the biggest screens or most comfy seats but a good place to see movies in Brooklyn.", "author": "Alice E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "BAM is one of my favorite places to see a movie due to the exquisite setting, their classic film screenings and the eclectic moviegoers that frequent the cinemas. The convenience of the venue cannot be overstated, especially since it's accessible by nearly a dozen subway lines (and LIRR). \n\nI docked one star for the cramped and uncomfortable seating in the theaters.", "author": "Marques J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Love this place. Pretty sure I always will. Cool events with cultural variety. Yummy food depending on the event. Nice staff and in an almost regal historic setting.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-30", "description": "Beautiful, beautiful interior and very nice people working here. I went for the Sarah Silverman and Friends show and had a nasty cough. The staff was so nice about getting me to water and letting me just hang out in the back because I didn't want to bother anyone, even had a chair back there for a quick escape.  I'm not a NYC girl and for sure getting to Brooklyn with the trains down was a little messy for a Texas girl, but once we got here we found the subway station right around the corner. If I lived here, I'd want to see stuff here all the time. Cozy and beautiful, it made Sarah Silverman singing a song about a \"c%^\u0026\" even feel classy. Because I know class.", "author": "Brandy C."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}