{"aggregateRating": {"reviewCount": 254, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "i live in astoria, so this is quite a troop, but i must say that this is one of the best cinemas nyc has to offer. \n\nthey have cheap movie tickets. get here.", "author": "Coleen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-01", "description": "I normally sneak into other movies, besides the one that I paid to see. Sometimes i walk out of movies in the beginning when the movie sucks so sneaking into other movies is ripe justice.\n\nSince I rarely go the movies, often going 3-4 years in between seeing a movie at a theatre, I may not be the right person to yelp about a flick house, but still.\n\nI Like BAM Rose.\n\nThe seats rock. It's in Brooklyn and I normally bring Sushi and single Malt into the theatre. If any BAM Rose worker is reading, please don't stop the flow!\n\nI recently saw Zack \u0026 Muri Make A Porno and though I brought in Sashmi and outside goobers, it has nothing to do with my enjoyment of the movie.....which was non-existent. That movie sucked like a small infant to a leaking nipple.\n\nbut I digress.", "author": "Richard B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-11", "description": "I love the performances here and the matinee movie for eight dollars is pretty damn good !", "author": "Halcyone H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "This is the best place to watch movies in Brooklyn. The theaters are grand. There is a great selection of movies. If you become a member of the BAM cinema club, you can go to the movies for $8. If you live close enough and go often enough, the $75 yearly membership pays for itself quickly.", "author": "Lena E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "This review is about the BAM Cafe. \nI first came to BAM over 5 years ago for my aunt's birthday. My family and I greatly enjoyed the Sunday gospel brunch. I brought a few of my Manhattanite friends into Brooklyn this weekend and after hitting up the Brooklyn Flea we came to BAM Cafe for its happy hour from 6 pm - 8 pm. The buiilding instantly wowed my friends and while there wasn't live music playing, there was great music and it was simply relaxing and chill vibe to grab a drink and relax. I love Brooklyn for many reasons, and one of those main reasons is the cultural diversity that you find there a lot more often than in Manhattan. The crowd was a great mix.\n\nAlso, what a great deal for the happy hour! We ordered 6 drinks among each other - cocktails, prosecco, and beer - and our tab never ran more than $40. We left before the 9 pm performance to have dinner but I wished we could have stayed. \n\nI can't wait to come back to BAM again for a performance or to the cafe for another drink when I am back in the neighborhood!", "author": "Connie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "Excellent movie choices. The movies are popular indie flavor, and the crowd is often a smart one. THe interior is beautiful in many spots. A great experience.", "author": "Bob N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-28", "description": "If they played more than 3 movies at a time, I would go here more often.  It's in a central enough location, there's good food and drinks in the area and the theater itself is very clean, organized, and overall well-kept.\n\nAlso, I love going here because I feel like I'm \"into the arts\".  I know- I'm a dork, but it's true.  It gives me a chance to check out what else is happening at BAM.", "author": "C J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-31", "description": "I had a really good view of the top of Patrick Stewart's head from my eagle's nest seat high atop the Brooklyn Academy of Music. Yes, it WAS Patrick Stewart's head I was looking at, but given that he has no hair, the view of his shiny crown got boring after 3 hours.\nThis was my first New York theater experience outside of Manhattan, and it really made me appreciate the cosy little off-Broadway venues like The Public Theater, and Michael Imperioli's Studio Dante. In contrast to their intimacy, BAM appears to be loacted in a former furniture factory, so the ceiling is exceptionally high. Instead of creating a drop ceiling during renovations, the architects seem to have seen this as an invitation to build the world's highest, steepest bleachers. Unfortunately, my seat was second to last row of the \"gallery\", which meant an extraordinarily long hike up the stairs, stepping over the corpses of expired pensioners as I ascended. Not a problem for a young pup like me who grew up roaming around the Scottish highlands, but if you're elderly, out-of-shape or injured, this would not be pretty. \nI am not afraid of heights, but when I made it into the theater, even I experienced a little vertigo at the sheer drop before me. Not for those of a sensitive constitution. The stage was almost beneath me as opposed to before me. My seat itself was bizzarre in that it was a tall bar stool, and on one side was the aisle, while the other was a wall, so I was all by myself. Not terrible in that I didn't have to sit next to some man in his sixties, grunting audibly ever few seconds in order to show that he totally got that line, but the wall partially blocked my view of the stage.\nI essentially had a bird's eye view of the performance, far enough away that I couldn't see the actors' faces, and at such an angle that it really was the tops of their heads I was observing. The result was that I felt really disconnected from the performances, and did not feel engaged in the play at all. \nI did attempt to cheer myself up at the interval by repelling back down the mountain for a drink, but the vodka they served me was so cheap and vile even I couldn't drink it; this was the true tragedy of the night.", "author": "Julia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "Beautiful theater.We saw ABT's Nutcracker. The ushers are kind of lame, but other than that, it's great.", "author": "Stina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-23", "description": "BAM is the perfect movie theater. new and old important movies. a majestic building in a great neighborhood near bars and restaurants (i love Berlyn across the street)  never a too-big crowd even on a saturday night. makes brooklyn feel like brooklyn in the best way possible", "author": "L. S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-12", "description": "I'm so glad to have a repertory theater like this so vaguely close to my apartment. Also, it is a rarity these days to find an indie theater that will still put real (er, fake?) butter in your popcorn. Eat it, Film Forum!", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-25", "description": "Great theatre.  Nice selection of lesser celebrated rare and independent films.  I've always had a good time here, and the crowd is never obnoxious.", "author": "Koku K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "Love it. Clean, small, good seats-sound-and screen. Great selection. Easy to get to.", "author": "Sharon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "My favorite thing is to enjoy Pierrot Le Fou on a giant, wide screen framed by a red arch inlaid with flowers that complements the movie's greens and blues and leave awed and physically nauseous from ennui.  I have got to go back there soon.  If only for the red arch.", "author": "Dian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "The limbs and flourishes aside, shakespeare, the beauty of this theatre makes it worth the trip. At least five stars for the arch above the screen. Wit or witout.", "author": "Tom D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-30", "description": "Favorite place for films in the neighborhood. The show a good mix of art-leaning mainstream stuff (Gondry, Jarmusch, Jonze, etc.) and some more obscure art/foreign stuff.\n\nThe real treat is the building though. I wish I knew more about the history of the building, but the renovation and conversion into a multiplex was done tastefully, so the whole place feels elegant and there are still plenty of decorative details left from the original incarnation to make it interesting.\n\nSeats are comfortable, theatres are a good size and dimension. Snacks are predictably expensive.\n\nAnother good reason to attend: the crowds are almost universally knowledgable and respectful. It's rare to have talking or backlit-LCD abuse here, and that makes for a much more civil and enjoyable moviegoing experience.", "author": "Tom C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-02", "description": "BAM Rose Cinema is so beautiful! Architecture, history, decor, good movie selection, indie movies, decent prices and showtimes. I only wish that I lived closer to go there all the time. Great date locale, too. ;-)", "author": "RL K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "Beautiful theatre. They only play selected movies ( usually indie). I had a hard time looking for the theatre at first, due to its misguiding exterior of the building.", "author": "laura y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "The Sundance Institute is at BAM - I came here to see 'Rocket Science' with a few friends.  It's conveniently located near practically all the subway lines (2, 3; 4, 5; B, D at Atlantic Ave; M; N, Q, R at Pacific St; G at Fulton St.) and also located near some pretty good restaurants.  The theaters are big and pretty clean.", "author": "Diana N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-21", "description": "Good good theater. Great seats, snacks and impressive looking place. Also love the movies they have, always something I wanna see at bam.", "author": "Rhubarb M."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "BAM Rose Cinemas", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LrWiWIw5LqphCblP4H5HoQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186364100"}