{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Great addition of schezuan style food in the area! Still one week into their soft opening but already pretty busy! Our hostess and waiter was very helpful and attentive as well.\n\nWe ordered the dry hot pot with beef which came with default spice level of 10, which was actually not too spicy!\n\nThe Dan Dan noodles were a bit spicier even though it was labeled at 6. Good nevertheless.\n\nThe scallion chicken was amazing. Enough amount of meat to scallions ratio.\n\nWill definitely come back", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "Amazing service with great vibes, and the food was top notch Chinese eats. Great Chinese eats. 10/10 recommend garlic sauce chicken.", "author": "Tsering P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-12", "description": "Came by with some friends who were showing us around Brooklyn and was very glad we did! The food was incredible. I loved the spiciness of their dishes and wished we had a place like this in Houston (I'm sure we do, I just don't know where...). We had the dry pepper style fish, pea leaves with garlic, and dan dan noodles. Everything came pretty spicy but that was perfect for us! We actually ordered the fish on the more mild side because I was told this place does spicy, SPICY! Only complaint was that it took quite a while to get seated for a group of four but the hostess was really sweet and got us into a larger booth since we had been waiting for about 40 minutes.", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-11", "description": "Excellent food and service. I had their Garlic sauce chicken and my daughter had the shrimp lo mein. Both were sooooo good. The waitress was attentive and friendly. They also have bubble tea for 4 bucks. I had the Thai and my daughter had the Taro bubble tea. I will definitely be back soon.", "author": "Deniece H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-04", "description": "Wednesday night in the market, saw that this spot had opened up. Large sit-down restaurant serving up your typical Chinese fare in a very trendy location.\n\nLooking at the menu, most of the items are familiar, and to top it off you can adjust the spice level of each. Decided on the Black Bean Style with Fish ($20) and a glass of wine ($7ish). Entree comes in about 10 minutes, piping hot and drenched in the black bean sauce. Fish is a little fatty, but overall a pleasant taste. However halfway into the meal, the chili oil became a little overwhelming. I think when you adjust the spice level, they increase or decrease the amount of chili oil in the dish. This can be a little too much oil texture depending on how spicy you wanted it. \n\nThings I liked here were the helpful servers and the free green tea to start off. Overall I felt like the price to quality ratio wasn't there, so probably will not return.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Been coming here since last year. I thought since I've been on Yelp for so long, am buzzed off of a large coffee, and even more buzzed after drinking one of their new-ish giant fishbowls of tasty booze-punch (great addition to the menu guys!), that it's high time I write my first review, and why not start with the place which gives me the happiness and fuel through their food and drink to put up with shopping in the Trader Joe's ten feet away which has a level of crowding and noise on the weekend that can only be compared to that of a factory farm for KFC chicken.\n\nHan Dynasty has killer food. For some people, who, for lack of a better term I'll refer to simply as weiners, \"killer\" may be slightly literal, as the heat of some food can be too much for them to handle. I admit, this used to occasionally be the case for me, but my tolerance grew with each subsequent visit. Now level 10 spiciness isn't enough. It's very good, but not enough. Han Dynasty's food has made me stronger. The reward of which is being able to discern more flavors within each dish. As one of the friendly (and sexy) employees said when I mentioned this to them, \"Welcome to the club.\" Gahdamn, these guys get it.\n\nThere's a lot of these aforementioned flavors to choose from: cumin-style lamb, beef in spicy sour pot, double-cooked pork belly, cold beef tendons in chili oil and dan dan noodles are all dishes I can happily eat again and again. I try to resist and on the times when I can force myself to try something new, I'm never disappointed. Take my advice and do what I did last time, bring at least three friends to try more dishes.\n\nThe portions are generous as well. In a market hall where a sandwich can cost $3 less than a full entree here, this spot seems like the best value in the space. Good luck leaving hungry. If you do, lament on deserving the rascal scooter you rode in on.", "author": "Chava B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-15", "description": "My good friend and I came here after work to have our monthly chats ! The restaurant was fairly empty and the staff is super friendly. They told us all about their menu options while we waited and then when we were seated they waitress gave us even more information about the food choices. We ordered the fried chicken and fried fish (spicy or course) it comes with white rice. They also bought us soy and duck sauce as well as green tea. I really liked this place and will definitely be back to try the other items on the menu.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-18", "description": "This place really needs a change of menu. Ny husband loves spicy food, but even he found the unrelieved heat of the two dishes we ordered to be so monotonous we had them take away one mystery fish dish that was barely touched. The cumin beef was bone dry, tough and chewy, and powdery in texture. For the premium pricing charged here, the cuisine should be first rate, cooking-show quality and the ingredients impeccably  combined. It's a bad deal, compared to just any other restaurant you could choose in nearby Chinatown. Eighty dollar bill, twenty dollar meal.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-28", "description": "I've been to the 3rd Ave location several times so I was excited for a Handy Nasty closer to home. \n\nFirst things first -- while the address says it's at 1 Dekalb, it's actually in Dekalb Market (by Trader Joe;s). My poor Uber driver circled several times while Google Maps said we passed the restaurant. \n\nThe food here is A+ and the same quality I've come to expect. What was not up to par was the piss-poor service. It was weekday lunch, not super crowded, but things took forever, things were forgotten, water glasses remained empty. I constantly had to flag someone down and remind my server I had ordered things. They comped a glass of wine but honestly, I'd have paid double to not wait 20 minutes with 0 liquid access. \n\nI've had delivery from this Han and it arrived timely and in stellar condition, for what it's worth.", "author": "Anne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I've come here countless times. Here's what stands out: the people at Han Dynasty treat everyone like family. Literally I know everyone by name and as soon as I enter, am greeted by familiar faces.\n\nService really is spot on. Yes you can get solid Sichuan food elsewhere in New York. But the service here knocks all other options out of the park.\n\nKevin, Robin, Johnny, Mike, Gina and Carl do a terrific job in making guests feel at home.\n\nThe food is amazing - tasty, big sized portions with the option to increase the spice level up where needed. Chef is extremely accommodating: one time my wife was craving just some simple steamed veggies and they brought it out no fuss.  My go tos are the Kung pao chicken, cumin style chicken and pickled chili shrimp.\n\nThe beverage program is awesome. Seriously they have better drinks relative to most high end pubs I go to. Great beer (Kevin's constantly in search for the best beers to pair with the food and they work). Great cocktails. Ask for Mike or Gina. They seriously rock. \n\nGive this place a shot if around the downtown area.  Service, Food and Beverage are all top notch.", "author": "Shaz J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-13", "description": "Had dinner here last week, seriously this place has by far the most delicious Chinese food I have ever had! It is awesome my favourite part of this place is that the food comes at different levels of spiciness!!! There are top notch drinks as well I had pineapple cider that was amazing , we ate at the bar and our bar tender Carl was awesome!!!", "author": "Donald T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "We 3 ladies ordered waaaay too much food and our server at one point apologized for not having us at a larger table (obvs not his fault we are extra)! \n1. Spicy cucumbers - yummy and fresh!\n2. Sesame noodles - great in conjunction with the cucumbers. \n3. Scallion pancakes - a little greasy but tasty \n4. Cumin Fries - also tasty, crinkle cut with good flavor but not overwhelming cumin\n5. Dan Dan noodles - not too spicy, but I realized I like the sesame noodles better\n6. Dry pepper chicken - yum. \n\nI love this place and will definitely come back.", "author": "Stacey P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Excellent service. Server named Bri Bri recommended a great dish to me and really took the time to make sure I got exactly what I wanted.  \nMike the Bartender did a fantastic job taking care of me at the bar. Overall great experience every time I come here.", "author": "Sal R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Food here is so delicious. The beef tripe had me coming back for more after one week--seriously.\n\nIncredible: Beef tripe, willingness to split a check four ways (wow--thanks!)\nGreat: crazy peanuts, dry-pot style lamb/beef, cumin lamb/beef\nMediocre: Service (it's inconsistent and sometimes very slow)\n\nYes, everything is very spicy. Welcome to Szechuan people!! Muahaha", "author": "Sophia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "Like all of the places in dekalb market hall, han dynasty is a fun and delicious modern take on an old favorite...but also like all the other places in dekalb market hall, it's in a basement....and it's summer. That said, the portions are so big and salty Chinese deliciousness, the service is quite accommodating and the interior is huge so plenty of room for friends. I'm sure I'll be back...especially when it gets cold out.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Definitely try the Dan Dan noodles! I got mine meatless and asked for chili oil on the side as I like things extra spicy. I also received complimentary Chinese herbal tea since it was my first time there. Great location in the Dekalb Food Hall.", "author": "Shivani S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "How can a restaurant NOT know how to cook rice. I read so much GOOD reviews. Liars\n\nTripe and tendons dish hand so much sesame and peanuts on. It to enhance not drown the flavor out.\n\nThe only OK dish was Dry Pot Fish", "author": "manying w."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-17", "description": "Did not enjoy the service here at all, would have preferred take out therefore we did have our food boxed up. which ended up leaking out of their to-go containers rather quickly and we threw it out before we could make it home", "author": "Marcy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "First time I been here and I love it. The garlic chicken and shrimp was done to perfection plus the waiter was more than helpful. Would love to come back!!!", "author": "Theo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Han Dynasty in Brooklyn!! Couldn't be happier!! Arguably the best restaurant in the area. My boyfriend and I love coming here. Our dinner tonight was no exception! Solid drinks, the Dan Dan noodles and dried pot chicken are a must! The staff is amazing, especially Mike the bartender. Can't wait to come back!", "author": "Christine T."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}