{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Great food and great service! I come here regularly, my favorite server is David, he's such a nice guy. I recommend coming here during off hours, as the service and wait time for food is much faster.", "author": "Khai B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-17", "description": "The good news was that the two items that arrived were awesome ... dumplings in chili oil and the Dan Dan noodles. Unfortunately we sat at the bar and the bartender was totally impaired.  It was 1230pm. Lunch. She slurred, she took our order 4 times. At one point she drooled while asking us for the second time if we had ever eaten there before. It was all mildly amusing watching her fumble around.  Finally we just gave up on the mains ever arriving since she very clearly could not actually enter the order in the system.  We got charged for 3 items, 2 of which we asked for the leftovers to go but that she just tossed into the garbage. She forgot to charge for 2 drinks. It was really embarrassing.  Will definitely go back because the food that we did eat was really great.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "YES YES YES. I love Han Dynasty. The cuisine here  is quite flavorful and I believe they have different spice levels for everyone. Dry pepper wings and Dan Dan noodles all the way!  If you like beef then the scallion beef entree will hit the spot! I am going back again and again. Service was prompt. The servers were friendly AND the happy hour is the best! $6 wine $7 mixed cocktails. I hung out with a friend here for hours and we didn't want to leave. The ambience is pretty modern with some Asian flare and most importantly it was very clean. 5 stars all the way.", "author": "Samuel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Glad to have a 5 star place in close vicinity. Service is always fast and great. Love the cumin friends and the beef low mein. Never afraid to try anything new here as the food here has never disappointed. Place is always busy from opening to closing.", "author": "Yar R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Love it here! I have gone here a couple of Times and every time the food was great. Kong pow shrimp is my favorite. Deff check this spot out if you are in the area! Wish they had outdoor space but it's been fun going to all winter.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "Been here a couple of times, and enjoyed it. Unfortunately tonight a busy server literally picked a fight with the perfectly nice couple at the table next to us for no reason. It made the whole meal really tense and awkward.", "author": "Christopher W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-09", "description": "Terrible service. Their wait times are atrocious. The food quality is okay at best and not nearly worth the wait time. If they can fix the service, there may be a morsel of hope for this place", "author": "T S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Love coming here. The food is incredible. The bartender was very entertaining and had great suggestions on what to order. I've made this a regular stop to load up on great Chinese food and have a few laughs.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-31", "description": "Been the this location three times--sadly, it's just underwhelming. Appetizers are good, especially the pickled veggies. The spice level seems extremely toned down. Maybe that's because it's in a more commercialized food court/market type setting? Maybe it's because they give their white customers less spice? I wouldn't be upset if that's the case, I know that that is a common practice. But, I specifically talked to the waitress about wanting things spicy and with the peppercorn flavor, and was still let down; I ordered a level 10 dish today and it tasted maybe like a 5-6. I've been here multiple times since it's so close to my apartment, but I think it's about time I find Szechuan in this city that isn't a let down.", "author": "Thom T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "Good but not mind-blowing. I liked the flavor of the dan dan noodles-- spicy and numbing-- but the noodles were overcooked. They should be springy and chewy, not mushy. The dry fried chicken wings were mediocre-- very crispy but not flavorful. I was worried that they would be super spicy (on the menu they are a 9/10 spice level) but you can pick off most of the chilis. The dominant flavor of the wings is cumin, which is not my favorite. We also got the garlic chicken, which looked and tasted like your average Chinese food take out place. My son really loved the wonton soup (with house made wontons.) Prices are a little high for the size of the portions.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "A few weeks ago, we made a reservation for 10, but then showed up with 16. The manager was so lovely and accommodating. Our giant family dinner was a wonderful success because of the manager's hospitality and the delicious. The waitperson was so attentive and directed us to some really crowd pleasing dishes. It was all around a wonderful wonderful meal!", "author": "Courtney B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "Poor service and food was overcooked and small portions. They changed waiters without even telling our party and didn't check in on us. Do not recommend. Waiter didn't even say thank you when we paid our bill and kept rushing us to take payment.", "author": "Joseph N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Incredible food and came fast. The food is very authentic and not at all americanized. The pickles veggies were unreal. Chose dry pot w steamed tofu because did not want super greasy and it wasn't, was perfect. Husband and I shared those two items and we were perferctly full for very little money. The cold Torrontes wine was perfect to complement the Szechuan spice. Can't wait to return.", "author": "Alexandra W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-18", "description": "We ordered 3 dishes, a dry pot with chicken, beef noodle soup, and a cold appetizer of beef tendon.  The sauce and seasoning they used for all 3 dishes had ma la (numbing spice) in the dishes and was quite yummy but I couldn't quite differentiate the taste between the 3.  Everything ended up tasting the same.  The noodles were soggy and over cooked unfortunately but the staff and ambiance was really nice.", "author": "Xiaoyu Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Han Dynasty is always perfect. The dandan noodles and wontons in hot oil blow my mind every time. \n\nI also love trying new main dishes every time. I think my favorite so far is the dry pot with lamb. Yum!", "author": "Brian F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "Normally I don't negative reviews , but this place made me make an exception.The food was awful, but the service was even worst. They gave us dirty looks, told us to hurry up while we were leaving (my dad is in crutches with a broken leg). Not a fan of this place, rather go somewhere else", "author": "Mitch S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Bomb.com it's really good great noodles and food that you can customize. The place spot in dekalb market.", "author": "Zak K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "It was my first time going to dekalb market and i saw this restaurant.  This place is Schezuan style chinese food.  The best schezuan style dish is hands down is dan dan noodles!  This place did not disappoint.  We had the dan dan noodles and the garlic sauce chicken.  Perfect for 2 people.  The food was deeeeeeeelicios.  Im craving the dan dan noodles- must try!", "author": "Meetu W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "What an amazing place! Can't speak enough! My fiancé and I come basically once a week and have an amazing time every visit. The food is fresh and delicious, drinks on point, and service- amazing!! Our favorite person is Gina at the bar, her fun and energetic spirit makes the night. She is on point, remembers every part of your order and just all around makes you enjoy your visit. Mike and Han are also amazing! Overall we come back here whenever at Dekalb again and again! The Dan Dan is our favorite dish by far but their lunch specials are also fantastic!!", "author": "Brittany P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-19", "description": "Was able to get a seat here pretty easily, you can shop while you wait so the location was ideal. The food was not on par compared to other Han Dynastys. If you are looking for a quick imitation of the other Han Dynastys then eat here. However beware that the quality of food and portion size is not the same. Most importantly they had the nerve to overcharge my credit card.\n\nWarning to all customer: Keep your receipt so you can appeal the total amount you paid including tips with your credit card company. This place will tack on additional amounts thinking that customers will not notice. I for one will not be returning to this location.", "author": "Eric L."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}