{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "How is it this place gets a total 4 star rating? Food is literally the same as my corner take out joint BUT twice as much if not more. Do NOT order any drinks - just seems like no real bartender - but maybe could order a mimosa (hard to screw that up). Look the place is in a mall environment I get that, but the music and overall loudness (chairs screeching on concrete floor) doesn't make for a quality experience. It's packed, or got packed, but I'd have to believe there was some hype AND this mall/market place has BK hype all over it. Stop by any of the small market shops (counter order and seat yourself) within the market area instead. I gave two stars because the service was okay (never had a check back midway through our meal though).", "author": "Fred F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "I'm surprised this spot doesn't have better reviews! I often frequented the EV location during my time at NYU so imagine how excited I was to learn that they'd be opening one near me in Brooklyn! I will say, my opinion may be a bit biased because I am OBSESSED with Dekalb Market in general. \n\nHan Dynasty is small and they don't take reservations for parties smaller than 3 people so I've always had to wait to be seated. Luckily, they have one of those pads where they take your name and number and text you when your table is ready. Though I've had to wait the 3 times I've been there, it's always taken less time than what they initially estimate it will be. Service is great - pretty attentive even when it's busy. But like I said, it's a small spot! \n\nThis might sound bad but some of the dishes with Szechuan peppers taste almost the same? Don't get me wrong, still delicious but I would not be able to tell which dish was cooked which style in a blind taste test. Regardless - whatever you choose, I'm sure it'll be good! Must get apps are the wonton in chili oil (reminds me of the wontons from Din Tai Fung) and the dan dan noodles!", "author": "Maria J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "Decline. I've been to Han Dynasty a few times. I'll start by saying when the food is prepared well you shouldn't have any issues. On the other hand, don't get too specific with custom requests for your meal. It'll only lead to frustration and a  higher bill to correct the kitchens mistake. The staff waiting our table was very polite. No complaints there. The issue was when we asked for extra sauce on the garlic chicken. Extra sauce is new unbearable spicy. When the food was brought back the \"new\" dish was a rubbery, washed off, freshly microwaved recycle of the formerly unbearably spicy chicken. When I received the bill, I was displeased to find there was two dishes of the garlic chicken being charged. The billing matter was resolved, but the stench was in the air. You might be lucky though...", "author": "Mario C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Are you vegan, but have non vegan friends?  Then this place is amazing!  Just choose wisely.  \nThe good: shared the dan dan noodles (sans meat) and eggplant with my vegan sis, but the non-vegans also devoured both, so we ordered another round of the dan dan..\nThe bad...after trying some of our friends not so great tofu dishes.  Granted, I'm not a big tofu fan, so I wasn't expecting amazingness, but the tofu was especially bland.  I do love scallon pancakes, and unfortunatly the ones I make at home (pre-packaged and frozen, available in most chinatown freezers) are way better than the ones here.  They also told us our table was needed by another reservation (totally fine-we we're just waiting for the check anyway) but then took about 10-15 min to actually bring the check.  \n\nEven though the check was slow, our food came out quickly, so that part was great.  I'll be back the next time one of my meat eating friends wants to grab dinner together.", "author": "Heather Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "Got dan dan noodles and Kung pao shrimp (lunch). Total came out to $24 including tip and tax. Much cheaper than if I were to get something else at the dekalb market! Service was great! Complimentary tea. Fast and good. Food def is true to the name of this place. All the food have a sezchuan twist/spice to it. The dan dan noodles are a bit more peanuty than usual but still good! Would come again if I was hungry. I wanna try the pork buns (looked good on my right) and the  dry pepper chicken (guy on left had it, looked good tol)", "author": "Christine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Really awesome! This review is for their delivery which came on time and was so flavorful, not soggy, not oily. Really yuuuummm.", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Food is fantastic!!! Gina, our server, is THE BEST!!! Actually, everyone there was amazing. I can't wait to go back and I plan to bring everyone I know there. I highly recommend the Hot Sauce Chicken,  the Hot Sauce Tofu. and the pork wontons, but, honestly, you can't go wrong.", "author": "Clarence R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "I love this place!  I've been to a couple of the Han locations and they are all great!!!!  I feel so lucky that I live right around the corner from this place!  We sat at the bar this time, and Mike was taking care of us.  He was great and hooked us up with a couple shots on the house.  The drinks were great, and STRONG.  We ordered the Dan Dan noodle, which has the best flavor, the scallion pancakes, and the dry pot chicken.  Pretty much get these everytime, but everything on the menu looks great.  All the other servers and staff all look like they are having a good time, and work well together, which adds to the atmosphere, and overall vibe.  Keep up the great work guys!", "author": "Josh H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Han dynasty serves authentic Szechuan, hands down.\n\nTheir food is oily, spicy, and loaded with peppers of all ilks. \n\nDon't expect to get a Ton of meat in any given dish. This is not a chines take out joint that gives you eight millions pieces of chicken per order of general tsos or whatever.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-31", "description": "Disappointing. Heard good things from Chinese friend who's been to the other location. Dan dan noodles is totally wrong - no red chili sauce with scallion but some light brown sauce that is not that very spicy. The noodles are also too thick. Texture of the eggplant garlic is good, but again sauce is all wrong - much too thick and sweet and not enough garlic. The scallion pancake and crispy cucumber were pretty good, however. Would try again if friends really want to go, but do not recommend.", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "I ordered hot sauce fish scallion lamb and rice noodle. From my four year experience living in Szechuan, they tastes pretty authentic to me.\nI arrived at 8:30 and there is still a long wait before me, it seems to be a really popular place and I have no idea why they only got 3.5 on yelp. Also, the time estimate on waiting notice text is not accurate, remember to check with the waitress every 10 mins so you might get seated earlier.", "author": "Yiqun C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "We love Han Dynasty...great addition to the neighborhood.  Most of the Chinese food in the area is total garbage. This is legit. We also love seeing Gina's beautiful smiling face behind the bar most times. She always takes great care of us!!", "author": "Paul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Wow! This place is amazing. At first I just went to Han Dynasty because of school assignment to analyzes Service escape, now I fall in love with this place. Service was extremely friendly and stuff were super helpful. I ordered Cold noodle in hot chili oils. It tasted way better than I expected. At first I just want to order something just to sit and do assignment there. But now I craving for that noodle and can't wait to go visit Han Dynasty again. Tasted great and recommended to people who love Sichuan and Spicy food. Plus the price is cheaper than I expected. Must go restaurant in City Point Mall, Brooklyn.", "author": "Kagome S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "OMG! This place is amazing!!! Jennifer at the front check in is amazing. She is honest and upfront. Also, Gina, the bar tender, in a jewel! Gina will help you pick the best beer for your meal! She is and absolute angle! The food is amazing! I would recommend the house favorite #1 Dan dan! It's absolutely spectacular!", "author": "Enrrique I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Authentic Szechuan food. Food comes out quickly and hot. Lots of bold delicious flavors. Service is always friendly. Love the free tea that hits the table when you arrive.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "One of two full service restaurants in Dekalb Market Hall, Han Dynasty offers up spicy, oily (in a good way) food in huge, family style portions. \n\nWe ended up getting way more than we needed. But that's the best part...\n\nFirst to arrive were the spicy cucumbers. Absolutely delicious. Sweet, spicy, and full of sesame flavor. \n\nThen we got the scallion pancake. Nothing to write home about. Pretty standard. But good.\n\nThe cold noodles with chili oil were absolutely wonderful. The noodles were chewy and the sauce had just the right amount of zing. \n\nWe also had a veggie soup with tofu that was full of flavor but also nice and light. Hated the tofu though. \n\nThe best thing on the table though was the Double Cooked Style fish. It had such a nice flavor. And the fish was crispy but also flakey and moist. I loved it!\n\nOnly sad part? No dessert. \n\nWill def be back!", "author": "Marcus Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "Over priced and not good. They try to be more authentic Chinese except it is not. The food is very salty and sweet. Their spicy level 10 is not even spicy. This is for non-Chinese people who have no idea what authentic Chinese food is supposed to taste like.\n\nThe service is also very unprofessional. We sat at the bar and the bartender asked our order three times because he doesn't want to write it down.", "author": "Kay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Wow. We just had a great meal here with fast service, friendly staff, and great food. Our waiter shared my love of good beers and educated me on their offering. The food came so quick but surprised me. Fish and tofu bowel was perfect. My go to place at dekalb market now.", "author": "Todd D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Finally a delicious Chinese restaurant in dobro! The food is well balanced flavor, not too spicy but just right. The Dan Dan noodles and Dry Pot style are so fragrant and delicious.  As a Chinese person I am so sick of people thing General Tso and Sesame Chicken are Chinese food.  Thankfully they are not even on Han Dynasty Menu. Also the atmosphere is very trendy and cool.", "author": "June K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Great food. Great people. It was honestly the best Chinese food I ever had. I recommend the vegtable fried rice, the Kung Pao tofu, and the vegetable dumplings. The server Marion was extremely nice and the hostess Aretha was also very nice. I had a great time there.", "author": "Nora O."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}