{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-05", "description": "Ate here a few times and already a few let downs, thought it might have been the first time, but this is now worth mentioning. \n\nMapo Tofu has no minced meat, only Tofu. Should note that in menu or don't sell Mapo Tofu. \n\nI also just picked up lunch today. Very disappointed at the lunch menu, got the Dry Pepper Chicken, and it was just all dry pepper batter, hardly any chicken meat. \n\nI think management need to seriously review what's been served in pricing and what is actually being sold as listed, skimping out on ingredients on what you're selling is not a good idea. I personally feel cheated on these two occasions already, might just be worth it to hop back on the train and get over the bridge to Chinatown.", "author": "Qi X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Han Dynasty is a wonderful place for any occasion: celebrations, consolations, reunions, you name it. They have an impressive and endlessly customizable menu and a full bar, and every dish comes out amazing. The folks who work here are friendly and helpful, and the food always comes out fast and fresh. The restaurant itself is pretty but also very accessible regardless of your attire or mood.\n\nIf you don't know what to order--get the cumin fried tofu! It's amazing and vegetarian.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-19", "description": "I've been to six different Han Dynasty locations, so you can call me something of a fan. I've also been to this particular location about 30 times. \n\nThe food is sometimes excellent, but it's way too inconsistent. Some days it's amazingly wonderful, and other days it's just alright, and occasionally it's pretty bad. \n\nIt's a bit too expensive for a daily takeout routine, especially since I'd have to order two dishes if I want a protein and a vegetable (though that would be enough food for 2 people). \n\nUsually the staff is great.\n\nSometimes takeout takes way longer than they estimate. which can be frustrating. I recommend to call ahead. I'd prefer to order online and pick it up, but their Seamless/Grubhub/Caviar prices are significantly marked up from their menu prices. I understand they're trying to make up for the fees that those services charge, but it's still pretty inconvenient for the consumer (and they're the only restaurant I know of which marks up their prices like this).", "author": "R C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Wow hostess is so rude. There was a group of four in front of me and they had just talked to the hostes so they made a path for me to come in. Hostess immediately snarked at me. SIR!! THERE IS A LINE. I said, you can't talk to me? She said Im not done with the group. There is a line. Litterally the line is just me and the group of four in front of me.Then came my turn spoke to an older lady. She said would be 20 mins wait. Never called back!!! This should not happen as first contact with a restaurant. Btw, I come here almost every week. I guess I'll just spent my money elsewhere.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Han Dynasty is a hot new restaurant in downtown Brooklyn. We kind of just stumbled in there even though there were so many other good restaurants around. It's in the Dekalb Market.\n\nWe came in during lunch. There weren't that many people which was great for us cause I was ready to eat. We started out with this delicious house tea while we browsed the menu.  I wish I had gotten the name of it. It was that good. It sorta warmed us up for was to come.\n\nLooking at the menu was one of the hardest things I had to do. There were so many good dishes to choose from. All of them reasonably priced and all of them large enough to share. The food came out beautifully presented and was really delicious. We had the dun dun noodles, a fish dish in a spicy broth and a spicy sauteed pork dish. Everything we ate had a nice kick to it.I love Schezwan style food. Anything that is fiery spicy is alright in my book. The food was absolutely wonderful and service was everything. A very attentive staff with attention to detail. When I'm back in New York I'll definitely be back here.", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-30", "description": "Having first discovered the lower east side location of han dynasty years ago, I was kinda excited to try this venue out today. I was told not to expect a lot from friends who went earlier but I was willing to give it the benefit of the doubt. It was a terrible decision. I ordered the dry pepper chicken, vegetable fried rice and the salt and pepper shrimp and they were all substandard. The rice looks like plain rice with big pieces broccoli and the fried chicken was not fresh. \n\nSave yourself the trip to this one and just go to the east village location instead. It tastes like a cheap knockoff of the original one.", "author": "Sharanyan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-24", "description": "Came for happy hour and stayed for Carl! Not only did he serve us the best tequila cocktails, he also kept us engaged with charming riddles and good laughs. Thanks for the good times and excellent service! ;)", "author": "Edgar O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-10", "description": "This should really be 3.5 stars. The food is a bit pricier for what it is, and I wasn't crazy about the hostess denying me booth seating since we were only a party of two (the restaurant wasn't busy). The entrees on the right side of the menu can be skipped (pricey, oily) and not all that special in terms of flavor, execution or presentation. The left side of the menu features small plates and appetizers but I think these are the dishes that were done really well. Get the Dan Dan noodles and the wontons on chili oil.", "author": "Sophie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "I used to live in Philly and loved going to Han Dynasty in University City and I can't express the joy I felt once I found out they had these in NYC too. I've been to this one and their EV location and honestly, though both of them are delicious and don't disappoint, this one's atmosphere and service makes it shine. I'm also convinced the Dan Dan noodles (which you HAVE to order) are better here. My partner and I come here almost every weekend and it is scrumptious every time. We try to order something different each time and I always leave feeling full and content. Very much recommend the Dumplings in Chilly Oil, the Chicken Garlic Sauce Style and the Dry Pot Style (if you don't mind a spicy kick). Their drinks are also amazing (the margarita they have is great and their fish bowls will have you set for the rest of the night). The location in Dekalb Market is also a plus!", "author": "Alejandro C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-07", "description": "I had the Kung Pao chicken. I guess that the cooks idea to make the dish spicier is to add copious amounts of dried peppers to the dish. I found that there were more peppers than pieces of chicken. Not the best Chinese food I've ever had. The down side was, for the meal and two beers, it came to $52. Ya, not coming back ever.", "author": "Coby P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Delicious food, reasonable prices, nice \u0026 clean environment, great portions \u0026 friendly staff. Also, they have a great lunch special option. I'll continue to come back here.", "author": "Estela S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-23", "description": "As with most of the places in Dekalb Market; everyplace looks pretty good and under delivers . Han Dynasty is a member of this group of under achievers. Let me preface , all the people who work here are very pleasant. This is no small feat. With all  the complaints they must get from the food I would think they would be in foul moods, but they are very nice. \n\nAlso the price/value is very fair for Dekalb Market. So what's wrong with this place?.......... IT'S THE FOOD! \n\nI love pretty much all NYC Chinese food. From the over priced places to the holes in the wall and all in between. \n\nI probably have Chinese every 2 to 3 weeks. \n\nThe food here is pretty bad. It is not Szechwan in any way shape or form. \n\nWith all the pretty good Chinese restaurants in NYC, do your selves a favor and avoid Han Dynasty at Dekalb Market.\n\nI feel bad writing this as people make their livings here but I feel bad for everyone else who works hard and can spend their hard earned money for more than adequate Chinese food in the 1,000s of places in the city.", "author": "Thomas Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "I normally go to Han Dynasty for take out, and I love their dishes especially the Wonton Soup and the Chicken Wings. Both are very filling. On this occasion, I decided to eat there with my mother. The staff is very hospitable and we were seated right away. The portions are very large and everything is shareable in my opinion. We had the cumin crusted chicken and the fried rice. My only issue is the peppers in the cumin crusted chicken. Its hard to chew and feels more like garnish. Other than that, I would go back again.", "author": "Phi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-10", "description": "The front staff is nice and the food it tasty. However I was dissatisfied with the unaccommodating cooks. I simply asked for the dried pepper flakes to be added to my $14.10 house special fried rice and they refused even though I offered to pay extra and it was mistakenly in my house rice preciously thats what made me ask for it again. Won't return as there is too much competition to deal with nonsense. Especially $14.10 nonsense.", "author": "Tish B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-27", "description": "Love this location- right next to Trader Joe's and under Target. I can do my grocery shopping after grabbing an early dinner and whatever else I need from Target then head home! This location is always busy but the wait time isn't bad, I usually just grab a coffee or ice cream or snack or browse Trader Joe's and time flies. The staples I always get are wonton in chili oil, fried chicken wings, mapo tofu, string beans with minced pork and dandan noodles. Note on the dandan noodles- it's really spicy for some reason. I just ask for the chili oil to be separate and add it according to my taste. Love this place, I always leave satisfied and full!!", "author": "Susan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Hot damn so good. Dry pot with pork was amazing - pork was tender, plate was perfectly spicy (charts a \"10\" but will be a 6 to a Szechuan regular). The sauce was balanced, perfectly salted. Ditto for the Kung Pao with Shrimp. Generous serving of shrimp, large and fleshy, sauce was sticky and thick, absolutely proper for the dish. The surprised of the night was the cabbage: buttery and soft without being soggy, great little app to share. Definitely coming back: clean, delicious Chinese and spicy on top of it.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "This is usually the highlight of my Sundays and I am so sad that bathing suit season is coming up and I need to pump the brakes a little! The menu is quite extensive so here are my top recs:\n\n-Sichuan pickled veggies to start.\n-The dan dan noodles are a MUST.\n-I personally prefer the wontons over the dumplings in chili oil because they are a little more meaty/plump.\n-Dry Pepper chix wings are dope. Fried to perfection.\n-Best veggies are the pea leaves with garlic or the string beans.\n-The entrees really depend on what you are in the mood for but the Dry Pot is one of the more popular ones. \n\n*Note: Beware of the spice levels noted on the menu. Things can get HOT.", "author": "Jess D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "GINA. BAR. Saved our night. She is the loveliest server and bartender we've ever had. She deserves all the things. (Promise we just met her tonight). Food was amazing too. Thanks for showing us the highest level of hospitality.", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "\"A life without good spicy Sichuan food is a sad life and one without prosperity and happiness\"- Proverb originating from Boerum Hill District, 21st C. AD\n\nI have always loved my neighborhood of Boerum Hill. I've lived here long enough to see all the changes, but there was always one thing missing; a great Chinese food spot. \n\nSure there are plenty of places to grab a bucket of fried wings, egg fried rice, and fried shrimp in a stapled bag.  Don't get me wrong.  There ain't nothing wrong with any of that.  I'm sure my joy of a good sweet and sour pork lunch special makes my ancient ancestors roll in their graves.  I've probably been shamed into some type of curse.  But I always wanted a place nearby I could bring friends to have some Tsingtao and authentic dan dan noodles.  And if the place had a lazy Susan, it would get an added bonus.\n\nLuckily, the food gods answered all my prayers recently with Han Dynasty.\n\nThe food is delicious, bold, and wonderfully spicy the way true Sichuan food should be. The servers and bartenders are great and friendly people.  I would highly suggest the dry pot tofu or beef, the salt and pepper shrimp, scallion pancakes, and the house special fried rice.  Your white friends will stare in awe when they see a fried rice that's delicious that doesn't use soy sauce.  Oh white people.\n\nAlso no meal is complete here without their specialty, dan dan noodles. As a Taiwanese dan dan noodle aficionado who has scoured every hole in the wall Chinese place with a health code C or the dreaded pending rating, I can tell you that these pass the taste test with flying colors and without the C rating! I see some have complained about the service.  Nothing could be further from the truth.  They're all friendly, wonderful people.  So I'm gonna go ahead and say the people that wrote the bad reviews are most likely douchebags. I said \"most likely\"- don't at me bro.\n\nThis place is perfect and a wonderful addition to the neighborhood.  It's a great place to hang out with friends especially during their happy hours where they do $25 beer buckets. Now if only the neighborhood gods could answer my prayers for a late night food spot, a karaoke spot, and a sketchy illegal mahjong den, we'd be golden.  But seriously, if you like good Chinese food in a chill atmosphere, this is the place.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-26", "description": "Pros: A lot of options - and plenty of choices for vegetarian/pescetarian.\nCons: Every dish is too something...too salty, too sweet, too rich, overseasoned. \n\nI tried this place twice. Was unimpressed the first time, but wanted to give it another go. Ordered different food the 2nd time so I have tried a variety of dishes. Everyone agreed that the food was mediocre and over-seasoned. No issues with service. I wouldnt say this place is terrible, but personally I will not be eating here again.", "author": "Debra L."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}