{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Love this place! The service is great and food is just the way I like it: spicy, salty and oily. Highly recommend the spicy crispy cucumbers and dry pot tofu!", "author": "Gabi O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "As much as it hurts me to say this, because LES location has been my go-to for a while, but the Dekalb location is the best! First visit here and ordered my usual dish, chicken in garlic sauce, and it was like a whole other dish! The flavors were amazing! I don't know if the chef added some spices or a different kind of chili pepper but I was blown away! Even the chicken pot stickers were like a whole new flavor for me. The downside? I won't be able to go back to the other locations, which are much closer to me, because I only want to eat at this location for eternity now. So bomb!!!!", "author": "Alby B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Exemplary service \u0026 spicy Chinese cuisine on a higher level. Probably the best Chinese I've had as an American who doesn't frequent Flushing, Queens often enough. But I know what's special, and this food is special.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "I like their dan dan noodle, scallion pancakes and spicy wonton. Let them know if you can't eat too hot. Their bill already including 20% tips.", "author": "Vivien S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Amazing Food!! wow this place is the real deal!!! Forsure eat here!! you wont be sorry!!!", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "Traumatic tourist trap Chinese food. \n\n\nDo they have chefs in their kitchen or just kids are experimenting. I ordered a quick lunch. Noodle was like British canned noodle- soggy and superior low quality. Plus, they put a gallon of sauce on it that makes the dish not edible because it was too salty, oily, sweet and spicy. In addition, there was almost no meat in it which normally supposed to be filled by meat. I finally met who are able to cook Chinese dish badly.", "author": "Kristine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Really cool spot, wandered in here based on a recommendation and it didn't disappoint. Good was great and the staff was very friendly and welcoming. Gina took care of me most of the night and was wonderful, introducing me to everyone and making me feel part of the crew. I'll definitely be back! The Dry Pot was delicious.", "author": "Craig J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Delicious food, friendly staff, very convenient location. I'm so glad Han Dynasty is finally in Brooklyn! We got the wontons, pea leaves, dan dan noodles, and kung pao tofu. All were excellent, and large portions. It always irks me to pay nearly $20 for a vegetable dish, but the pea leaves were so delicious I'll accept it. The dan dan noodles are hands-down the best I've had in the city. Can't wait to go back!", "author": "Allison P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "Han Dynasty is one of my favorite go-to places for dinner. However, this review is for vegetarian/vegan options on the lunch menu. The lunch would be equally amazing, if the location catered more lunch menu items for vegetarians/ vegans. Observations:\n*Currently, only TWO items on lunch menu for vegetarians/vegans.\n*Dry Pepper Style only available for Fish and chicken for lunch, and not for Tofu.\nOne star each for the two vegetarian items on the lunch menu.\n\nPS: signed up for yelp to especially post this review!", "author": "Ess G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Once again another great experience. I just love this place great food and people. Dumplings n Chilli Oil was amazing", "author": "Tony T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Honestly, Jennifer the hostess made the experience. Very kind and professional ! \n\nFried rice was delish and scallion pancakes.", "author": "Chris R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Love this place. The Dan Dan noodles are top notch and I could eat the hot pepper wings for days. Had excellent service. Our server Yun couldn't have been more helpful or attentive-- thanks for making our dinner experience that much more enjoyable!", "author": "Joelle D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-01", "description": "This will be my first and last time ordering from Han Dynasty. I came here for take out and ordered the hot sauce garlic. I the food smelled great but was inedible. Instead of a sauce i got chicken soaked in oil. It was so oily and disgusting I couldn't even finish my meal. $17.37 in the trash. The only thing i was able to eat was the rice", "author": "Keisha F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-05", "description": "Slow, inconsistent service. My main came out before my appetizers, which shouldn't have taken so long because they didn't require cooking. Hot sauce fish was not very flavorful or spicy despite request to amp up spice level to 9. \n\nA nice big space, nicer than their East Village location. Use the wifi, there's no cell service in that basement. Let this place work out its kinks a bit longer.", "author": "Ken W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Last night, I had a terrible Postmates courier show up to pick up my food, realize he forgot his card at home, and spent an HOUR AND A HALF trying to find it before cancelling the order. I called Han Dynasty to ask them what was going on and they updated me, so I went there to see if I could just pick up my food myself. \n\nWhen I got there, I spoke to the manager I had talked to on the phone who is an absolutely lovely person and I can't believe I don't remember her name but I do remember the equally wonderful hostess' name (Aretha) and if anyone from the restaurant is reading this you can ask her to know which manager I'm talking about. Not only had she prepared an entirely new order for me, since the old one had been sitting there for two hours, but she gave it to me free of charge! Said I deserved it after having to wait for so long. I want to emphasize that I was not very demanding on the phone, I never seemed angry or even dissatisfied so it's not like she gave me the free order to placate me. She just did it because she felt genuinely sorry for something that wasn't even her mistake. \n\nAnd then the food was great! This part of Brooklyn is an absolute dead zone for good Chinese take-out  and this is just what it needs. I got the Chicken Garlic Sauce and the Dan Dan Noodles, which have earned their reputation. Just a warning: the portions are massive! You can easily split something between two people, which also helps cut down on price.", "author": "Henry R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-23", "description": "Food tastes great there, and it's really fast to get the food. But that black waiter really pissed me off, he has strong opinion on us and treated us poorly. When I said thank you to him for many times, he just turned back without even look at me. Seriously if you don't like your job, just quit, no one forced you to work there.\n\nAfter he served us, I saw it clearly that he swept the couch using the broom for floor, this is totally disgusting and disrespectful.\n\nWill never go there again, very frustrated on this.", "author": "Haiyang W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "Chicken here was the most disgusting thing I've had in a while. Had one bit and threw away the rest. Which was $10+ of overpriced garbage food. As a whole, the food court at City Point is trash and this place is no different. Go if you want to overpay for garbage", "author": "Bryce W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-04", "description": "Overpriced and not very good.  This might be what passes for quality Chinese/Sichuan cuisine elsewhere, but in NYC you can't run around the corner without finding better.\n\nPortions were small, the cost was high, and the quality was just not good.  What was labeled as 8 in spicy was anything but, and swimming in a syrupy sweet sauce like you'd expect from Kung Pao Chicken at a Panda Express.  I would have chalked it up to a bad dish, but the three appetizers we ordered weren't any better.  The dumplings were on par with a bag of frozen dumplings you'd find at Costco.\n\nI hope it's just opening week jitters, but I'm not convinced.", "author": "John N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "2:10 PM on a Friday\nThe place was only 2% occupied yet I still had to wait for a very long time for a server to come to take my order.\n\nOrdered braised beef noodle soup. Noodles came out overcooked, soggy.\n\nFlavor of the broth and beef were about 2.75-3 out of 5 stars.\n\nWhen I was ready to pay, the restaurant was about 1% occupied then, yet I still had to wait for a very long time again to request for my bill. \n\nGot tired of waiting, I stood up and paid at the bartender.\nThis place seriously needs an overall manager", "author": "Yelper R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Same amazing dishes as other Han places and never have to wait!! We live right next door so we come here at least once a week. Our regulars are the stir frys black bean, garlic sauce and kung pao (we can't eat spicy). Also love the scallion pancake, the chicken dumplings, spicy beef noodle soup (way superior over the regular), and any of the veg dishes. While I'm giving them 5 stars, I'd note that we got take out once and it was a dud - servings were tiny, I ordered the noodles and they gave me rice (??). Just eat here!!", "author": "Kathy W."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}