{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "I actually loved the meal that I had here. The location is nice right inside Dekalb market. They have many good items at a discounted price during lunch time (before 3), so I ordered the double fried pork belly. Then I ordered the dan dan noodles and the wontons in chili oil. They served tea in one of those iron skillet pots, which was very nice. The dan dan noodles were a large portion and tasted delicious! They had a peanutty-ness to them and less spice than I'm used to. Really everything was great I can complain. The only thing was that the pork belly was really just bacon. The slices were thin but really Flavorful. The whole meal came to $30 and we had leftovers, so really a good deal.", "author": "Ani S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-14", "description": "My husband and I have made an official promise never to eat here again.  While the food is delicious in the moment, the amount of garlic used wreaks havoc on the stomach and causes vile breath for literally days.  We love garlic + use it in everything we make, but have never experienced anything like the pain of Han Dynasty's garlic except for the three times we've eaten here.", "author": "Gabriella K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "The dan dan noodles are amazing and spicy! The dry pepper fish is out of this world too! And the garlic dish was also amazing! The service was also fast and attentive, so yes I'm going back. Often!", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "This place is awesome! The drinks and food are spectacular! Yun was our server and did a fantastic job. Would recommend this spot to anyone!!!! Gina at the bar was also amazing!", "author": "Joe P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Love the place. The dan dan noodles are unreal and the lo mein is great if you want a cooler bite. I docked them a star because the consistency is spotty. But when they are on, the Kung pow and garlic sauce entrees are exceptional. Definitely not your average take out.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Amazing service and excellent food. Friendliest staff and the seating was quick and so was the service.  The food was served soooo quickly and it was soooo yummy. Love love love the dry pot chicken dish- definitely coming back!!", "author": "Ada D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "The quality of the food at this particular location is subpar. I've always been a fan of Han Dynasty but it seems this location still has a number of kinks to work out. The Dan Dan noodle is one of the most popular dishes on the menu but here the noodles were over cooked, lacked flavor, and had a very small amount of pork. In the past at their other locations, the amount of pork and the flavoring was much better. I'm not sure if they changed their recipe or if it's just this location but everybody at the table was disappointed. We also had the hot sauce style fish and it lacked flavor as well. That's saying a lot since usually it's one of the most flavorful dishes on their menu. The portion size also shrunk as compared to their other locations. \n\nOn the bright side, the string beans were top notch and the service was decent. I hope in the future they can bring the food quality up to the standards of the other locations, though.", "author": "Jordan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Have to say I'm impressed! Was ready to shit on hipster Chinese food but this place is legit. We only had the dan dan noodles and pork dumplings in chili oil today, but based on those, the quality is very similar to Michelin rated Cafe China in Manhattan. So happy for good quality authentic Szechuan food in our hood!", "author": "Kel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "Delicious and good service-- slow on drinks tho. Not a fan of \"how we do things here\", but our waitress let us order apps first, then entrees. Food came super fast! All tasty (dumplings in chili oil... yum!). Only downside was our Dan Dan noodles were way tooooo soft. Will come again.", "author": "Tracy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "My wife and I just got takeout from Han Dyansty (we can't live without the pickled vegetable soup with flounder) and I had to update my previous 2 star review.  Everything we ordered was to perfection.  Quantity and ingredients lived up to our 3rd avenue expectations and after each bite we just looked at each other, smiled, and nodded.  Feeling pretty stoked that Han Dynasty is our dependable go-to place for Szechuan food.  Awesome!!!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "I stopped by early November on a Saturday afternoon, got seated relatively quickly. It's pretty spacious place. Tried the braised beef noodles and pork belly. The ingredients in the noodle dish tasted fresh, and has slight heat to it. The pork belly is spicy/sweet, somewhat oily but delish. Both were of good portion. Will go back again.", "author": "Judith L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I love sitting at the bar here. There are red lights that mask the redness of my face when I drink alcohol. I always get the dan dan noodles and spicy cucumbers. I'm really glad they opened a brooklyn location here. There's not much good Asian food in general in this area. This is a welcome addition", "author": "Sophia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "The first time I went I got the dumplings in chili oil and we also got a black bean beef, pepper shrimp and a fish dish which I cannot remember. We also got scallion pancakes. Our waiter was so great and I loved the food! I went back for takeout and got garlic sauce beef and it is excellent! I will be back to try more!", "author": "Jasmin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-25", "description": "Passable, serviceable overpriced American Chinese food. The service is prompt and friendly, the dishes not that different from your average corner hole in the wall place. They're open Christmas, so they've got that going for them and they're the only sit down restaurant open most holidays in the area. You go there more for the convenience than the taste.", "author": "L Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-30", "description": "I was eager to try this place because I went to the one in the East Village years ago and enjoyed it. But this was very disappointing. I'm not sure if it's because I got take-out or the food is just not good, but in any event, it is definitely not worth the cost. I got double cooked fish, which was soggy; eggplant in garlic sauce, which was way too sweet; and wontons in chili sauce, which were fine, but sort of flavorless. In general, the food was also way too salty. Unfortunately, this area continues to lack good Chinese food.", "author": "F. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "I tried Han Dynasty for the first time in Brooklyn and the food was amazing. Everyone at my party loved the food and it was so delicious. The vegetable lo mein was my favorite. I also loved the service at Han Dynasty and it was so nice to have friendly people greeting you. You will not be disappointed if try Han Dynasty.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "The food itself is very greasy. Like they bath it in grease to the point that the flavor is grease. My stomach hurts now, but it did help my hang over.", "author": "Kema G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "This place rules. We work across the street and order lunch at least twice a week because the lunch specials are an amazing deal and a perfect amount of food. I try the cucumber appetizer at every Szechuan place I go to and this is by far the best. Perfectly crispy, sweet hot and garlicky. Truly a perfect dish. Other highlights are the black bean fish, mapo tofu, scallion beef!! Dumplings in chili oil are sooooo good. I almost always get takeout but ate there tonight and the staff was lovely and super helpful and great. Besides Dekalb Market this hood can be a bit of a food desert and we are so glad Han Dynasty is here!! Thank you!", "author": "Jenna W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-20", "description": "Ugh no. Just no. I've been to the East Village Han Dynasty and loved the cumin lamb stirfry, and my friend who lived in Philly used to rave about their chicken wings, which he called the spiciest thing he'd ever put in his mouth. So when this place opened in my friend's building, we decided to go instead of try one of the multitude of stalls in this food court. We also could have just bought something to warm up in her apartment from Trader Joe's, but no, we decided to sit down and eat here. It was terrible. Granted it had been opened for two weeks by the time we went so maybe their kitchen staff are not trained yet, but the food was not good. The chicken wings were the most edible dish we got, and even those were overly salty. We ordered the chicken fried dumplings, which my friend thought were dumplings cooked chicken-fried style (as in chicken-fried steak). They were boring, standard, and essentially pan fried chicken dumplings. The aforementioned dry pepper chicken wings, which had a spice level of 10 out of 10, were barely a 2. We got a Dry-Pot beef, which you might assume from the name and description, would be a dry stir fry but it was covered in a thick sauce. (Don't call it Dry-Pot if there's a sauce.) I got the cumin lamb that I'd tried previously at the East Village location, but here it was not fragrant, kind of wet (the cumin lamb I had before was definitely a dry stir fry), and the pieces of lamb weren't cut well because they were stuck to each other by sinews. We got the Crispy Rice pork, which was covered in a thick overly sweet sauce that rendered the \"crispy rice pillows\" soggy and chewy. The sauce was so sweet it reminded me of bad sweet-and-sour Chinese takeout. We also got the Dry Pepper style beef, which I braced myself to be very spicy but it was not spicy at all - not even a 1. The meat was tough and definitely dried out though, even though once again we thought it was a dry stir fry and it turned out to have a wet sauce. Everything we ordered that was supposed to be spicy was not even close. To say that this meal was a huge disappointment would be an understatement, and now none of my friends will ever go near any Han Dynasty again, despite my argument that the East Village location was delicious (at least it was when it opened). I give it 1 star for food, and 1 star for attentive service (the food came out quickly).", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "So thrilled that Han Dynasty is finally in Brooklyn. I've been to the East Village location a handful of times and have never been disappointed. Our go-to order is chicken wings, wontons, cucumbers, and dan dan noodles, all of which are amazing. It's usually one of those dining experiences where we stuff ourselves, then sit around for another 30 minutes until there's enough room to eat one more wonton or one more chicken wing. It really is that good. We stopped by the soft opening of the new Brooklyn location with a group of friends over the weekend, and I'm happy to report that the food is just as excellent. We added some cumin tofu and dry pot beef to the mix, and everybody walked away full and happy. This location hasn't yet worked out it's cocktail menu, but I'm hoping for some of the giant bronze pineapple cocktails to hit the bar soon. The only small hiccup, there was a wait for our table (which was fine, you can grab a beer and meander around the food hall) but the cell reception in the basement is pretty much nil, so I had to keep checking back in with the hostess to make sure we hadn't missed the text for our table. Anyway, a small price to pay. As this place is dangerously close to my apartment, and right downstairs from the Alamo theater, I'm sure we'll be back again and again.", "author": "Amanda H."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}