{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-10", "description": "Since I enjoy spicy food, I visit here pretty frequently with co workers for their lunch specials. \n\nI usually order their dry peppered chicken, which is great for their spice but chicken can be on the dry side. Their spiciest item on the lunch menu is their dry pot pork - which is fatty and definitely packs a kick in my mouth like it promises (hence, spice queen rate level 10). I also recommend their dry pepper chicken wings - which is tender and juicy and finger licking good! \n\nFor the one time I went there during the weekend when I was not working, we ordered drinks from their full bar menu and the drinks were definitely on the strong side.\n\nSo why the three stars? Everytime I go there, the tea is luke warm. Nobody likes luke warm tea. :(", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "The food here is fantastic. Had the mapo tofu and the double cooked pork recently. Both were excellent. The best Chinese food I've had in Brooklyn, with the possible exception of Pacificana for dim sum.", "author": "Matthew Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-14", "description": "Service was ok, giving 1 star due to food tasting terrible. A simple garlic sauce beef never tasted so fake. Legit tasted like cheap powdered flavoring.", "author": "Ang K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "This place is so good! My third time here so this review is accumulated / less biased?\n\nMy go to is the chili oil noodles. Noods all day errday. Im thinking of starting a petition so Han starts selling that oil in bottles. Please!\n\nThe vegetables are all very fresh. My mom ordered this \"bland\" ass vegetable dish-turns out it wasn't bland at all. The vegetables were so fresh-it's juices were mixing together to create a unique broth in itself. Yumm\n\nI've gotten a couple meat dishes here (pork and lamb). Other people seem to dig it while my loyalty lies still with the chili oil noodles. Chili oil noodles #1!", "author": "Bonnie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-06", "description": "Food: 8/10\nService: 6/10\nAtmosphere: 7/10\n\nWhile not technically considered part of the Dekalb Market Hall, that's where this outpost of Han Dynasty is.  Every time that my wife and I have been, the restaurant is packed and doing a ton of business.  While the service can be a bit lacking at times (e.g., forgotten bar drinks) due to the volume of diners, we've never had any real issues out of the kitchen.\n\nI really like that Han embraces its sichuan roots and isn't afraid to pile on the numbing heat when prompted (dry pot style or hot sauce style are big winners if you're in a chili-head mood).  Another underrated aspect is the complimentary pot of jasmine tea delivered to the table about the same time as water is poured at the beginning of the meal.  The Dan Dan noodles are a must try and the Three Cups Chicken probably doesn't get the love it deserves (it might be just a tad sweet, but really a nice dish and one that happens to make for awesome leftovers!).  \n\nIn brief, I'd say Han is every bit worth checking out, especially if you're already making a long day of shopping at the mall above.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Yes! I am glad I finally stopped in to try Han Dynasty in the Dekalb Market before a movie. \n\nThe food was great and the portions are big, so the higher prices aren't as bad. I love the spicy fish hot pot. It packed some heat but not enough that you can't handle it if you like spice (it was rated 10 out of 10 for spicy on the menu - don't be scared!). We also got double cooked pork, which is basically a bacon belly extravaganza with some leeks to make you feel like you are eating some greens. Both were salty and delicious, but not too salty - and we have leftovers that didn't last long in our fridge. \n\nThe service is just ok. It is annoying to be sitting with empty water glasses or for your check when staff is sitting at the bar or chatting. \n\nI am glad to have some nice spicy (non-takeout) Chinese food in the area.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "I was sceptical about coming to this place. I thought it was chinese food for American people. I was glad to find out the food was pretty authentic. The dan dan noodles were the best, no spicy at all, although they say is medium spicy. Fried dumplings were ok. The pea leaves were a bit overcooked and salty. The garlic sauce shirmp was ok too but not the best. The shrimps were goos size and very fresh but the sauce was a bit too thick. Rice was too saggy and poor quality. Service was good and they have a great happy hour special with $5 beer. A bit overpriced for chinese food but no so bad for Dekalb Hall, where everything is extra expensive.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-29", "description": "I'm not sure if I just had a bad dinner but as a Chinese American this is not good Chinese food. I ordered the braised beef noodle and Mapo Tofu plus a side of spicy wonton in chili oil sauce and man was I disappointed. The noodles where soggy meaning they've been soaked in the soup too long. The rice was perfect for frying since it was hard and dry but not to eat as a plain side with the tofu. The wontons were good but they were the size of a dime and looked like fake Chinese fast food takeout wontons. The tofu barely had any minced pork which was sad. Service here was great though and location at dekalb market can't be beat but I'd take a Xi'an Noodle here any day...", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "The new Han Dynasty is open at last in the Dekalb Market Hall, which kind of makes this the best food hall now alongside the other great full service restaurant in here, Fortina across the way.\n\nThey have the same awesome food as the other two NYC locations. It's between the small East Village location and the huge Upper West Side one in terms of size, though they have a convenient takeout window at this one.\n\nGet the Dan Dan, Kung Pao Chicken and Mapo Tofu for all the staples, and you'll be very happy.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-05", "description": "I only ordered delivery from Han Dynasty and it was a miserable experience. I ordered 3 dishes - Dan Dan noodles, tofu pot and pea leaves and paid $75. $10 of that was for delivery and tip (the $5 delivery fee does not include tip). The portions were TINY and the food was mediocre. Extremely disappointing given the cost", "author": "SK S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Solid choice - would recommend.\n\nWe ordered the Beef n Tripe with Chili Oil ($13), Cumin Fries ($8), Wontons with Chili Oil ($8), Dan Dan noodle ($9), Dry Pot Beef ($19), Hot Sauce Fish ($20), Cumin Pork ($16). There was happy hour beer too for $5 each.\n\nFood was good. Portions are sizeable. The right amount of heat that it is spicy and fragrant but will not kill you.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Han Dynasty is finally in Brooklyn!\n\nThey got a primo location in Dekalb Market Hall - right by the entrance, with full restaurant seating (more spacious than their East Village location).\n\nThere's also an order/pickup window in the back by the elevator if you don't want to wait for a table. They'll give you food in takeout containers, and you can just grab a bench at the communal tables nearby.\n\nTheir prices are on par with their EV location, if not $1 or so more here and there. I guess it comes with the luxury high-rise territory.\n\nTheir menu is basically the same as their flagship. You have all your appetizers and small plates (like their famous dan dan noodles and wontons), and then you have all the standard entree dishes, most with different meat options. All conveniently labeled with spice levels.\n\nI had the double cooked pork belly. It was a LOT of food. Not proud to say I ate it all because I didn't want to carry around leftovers the rest of the night. Perfectly cooked fatty pork belly with leeks and peppers dripping in black bean sauce. So good.\n\nWill definitely be coming back! Entrees are on the pricier side ($15-20), but they're really two meals. And they have weekday lunch specials for $10!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-22", "description": "Umm. This was overall an odd experience. My boyfriend and I got the dried pepper style chicken and the string beans. \n\nThe dried pepper style chicken was terrible. It was just bits and pieces of friedness. No chicken. No meat. No good. When I asked the waiter what was the most popular, he said this one was...And I can't comprehend that at all. The spice level was good, but the concept of that being the best dish doesn't make any sense. \n\nThe string beans were pretty solid. The taste was good, but the string beans were a bit undercooked. Needed a little more time. \n\nTHE SERVICE: Supposedly there were no busboys, so no one cleaned our table. And I understand if it was busy, but it was pretty dead. Also, when our waiter came over he was so angry about how there were no busboys and vented it out to us. We can also see him getting heated as he walked away. He made it well known to the WHOLE restaurant that he was angry. Also, they charged my boyfriend and I the wrong bill. Like... What is going on.", "author": "Frances T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "I came to Han Dynasty right before it was about to close. I went to the take-out area and Kai, at the window was really nice.  He let me know I would be the last order of the evening and gave pretty good advice on things to try.  Since I was getting something quick before the movies, I went for fried rice.  The wait was less than 5 minutes and the rice was fresh fluffy and hot. The flavor was pretty good despite the rice being super pale.  I would certainly come back, even if it's to try Kai's favorite dish, the scallion dishes.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Great Chinese sit-down restaurant in DeKalb market hall. I've been twice since the soft opening and have tried the chicken in garlic sauce, Dan Dan noodles, hot sauce chicken and eggplant. All were tasty, not as spicy as I expected (hot sauce chicken was considered a 7/10 and I thought it was more of a 4), and the ambience was nice. I will take off a star because I think the service is still figuring itself out, and the hot sauce chicken didn't have enough chicken in it - more cabbage and celery (aka filler veggies) than the star of the show, chicken. \n\nDefinitely good for groups of all sizes, and the entrees are huge. I'd recommend sharing an entree and other item for every 2 people. Enjoy!!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "The ambiance of the restaurant and the staff were great. Sadly the food was terrible. It came out from the kitchen less then 5 minutes after taking our order. Everything tasted like it was from a can and in a giant vat of sauce. I got the crispy rice, which had a few soggy peppers and puffed rice cakes. Husband got the dry pepper chicken which came out warm temperature and really greasy in thick batter and tiny pieces of meat that were overpowered by the overfried batter.\n\nI think the new Dekalb food hall is great, and again atmosphere of this place was good. Wish the food matched everything else.", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "Never disappointed! I really like the dry pot pork and dumplings in chili oil. Bartenders Bri and carl are the best. Beers are always changing so be sure to ask what's new \n\nOver all service and atmosphere is great here!!", "author": "Michelle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "I have found \"my dishes\" at Han Dynasty and they have worked out enough of the kinks that it's one of my go to's now at Dekalb Market. Service is good except when you need to get the check (somehow I'm always trying to pay when there is a staff switch). Usually there is no wait for a table and this location makes it easy to come with a big group of friends. (They can offer a prix fixe or family style menu and pick for you). Also, the bar menu is pretty good - there's a TV to watch the World Cup. Can't do that at a typical restaurant. Music is definitely more American than Chinese, but I like whoever is DJing. Also, every single server is friendly, eager to please, and pretty funny. Definitely more expensive than Chinatown, but the service and location make it worth the extra buck. The lunch specials are extra worth it - I definitely wish I was around during the weekdays to partake!\n\nThe good:\nMapo Tofu - silken tofu, lots of sauce to go with your rice, big chunks of leek. Would also welcome peas or scallions or something else green\nDry Pepper Style Triple Flash Fried Fish - Crispy, salty, tender, flaky white fish, with lots of pepper (don't eat the pepper, just pull out the fish). Its spicy, but in the dry ma la numbing way, not the wet hot sauce way. When I did this as take out, it was much too oily, but eating it here was perfect.\nDry pepper chicken wings - just tasty and spicy\nbeef tendons in chili oil\nCumin Style Lamb - delicious and tender, spicy.\nPea Shoot Leaves - Dou Miao is reliably good here, just expensive\nAsparagus - reliably good, tender, and expensive\n\nThe bad:\nDan Dan Noodles - I just can't like these, I think they're mushy. Probably just me since most other reviewers are fans. \nSpicy cold cucumbers - oddly syrupy, too much liquid", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-10", "description": "Only a 4 because the East Village location is slightly better and a sure 5. Regardless, excellent Chinese food that stands above the rest. Best bang for.your buck down in the often overpriced Dekalb market as well. Menu features a fun and atypical selection of dishes that force you to order more than you can handle -- a good problem at a good restaurant. Quick service and reasonably priced, making you wait to to come back Keto-friendly options as well, which is rare with Chinese food! Have returned since.", "author": "Matthew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "If I could have a baby with the dan dan noodles, I would. And then I would eat it.\n\nSeriously this place is really good.", "author": "A. F."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}