{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "The food is not bad as previously stated by Thomas. The food is tasty but,it has an uneven temperature part of the fried rice is actually cold which is strange. the food is tasty. The spicy fried wings topped with pepper,really tasty , lo mean tasty, even the water is tasty.", "author": "Marsha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "This place is amazing! So glad to finally have a decent Chinese option in downtown Brooklyn!!", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "So happy Han Dynasty finally opened! It has quickly become our go to Chinese food place in the area. I like that you can pick the level of spice for all the dishes and the free tea is a nice touch. My faves are the dan dan noodles, chicken in garlic sauce and kung pao chicken. They are often very busy, but haven't had to wait long for a table yet and the service is fast and friendly.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Went there for lunch on Lunar New Year.  10 minutes wait.  Food is served family style.  Servers are knowledgeable.  Some of the tastiest Chinese food I've head and reasonably priced.", "author": "Lou B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-14", "description": "I started coming to this place when it first opened. Food was good but I love the convenience as I live in this building. Unfortunately this place has become popular and the service level has dropped drastically. I am reluctant to go back . Watch out for the server at the door . She is extremely rude. No request please. You lost a long term client for both lunch and dinner. I hope you are listening.", "author": "Stanley L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Definitely one of my favorites in New York!! Beef tendon in hot chili oil is my go to appetizer. Dry pepper chicken with a side rice is amazing. The perfect amount of heat in every bite in every dish they serve.", "author": "Raxhalle O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Made a reservation for 10 on Easter Sunday. Staff was very accommodating. Food was very good.", "author": "Jerri P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Super quick food and stiff cocktails. It's fast food but with quality ingredients (one hopes) and a liquor license, what more do you want? We had a hiccup on one of the order (wrong order came out) but it was quickly remediated. Overall it's a great spot for lunch (decent portion) or a date.", "author": "Clari B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Three stars for the service and decoration. The food itself is very tasteless. I guess they deep fried everything then put sauce in it. Lots of restaurants in China town or Flushing is a lot better.", "author": "Tiki Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "This is the third NYC location for this Philly baby dynasty.  First time brand new building. Other locations were previously restaurants. This is a private sit down restaurant located in a huge food court. Very novel to me is the take out window on the side away from the entrance to the dining room.\nThis is the one disclaimer I put in. One of the bosses is my nephew, but if it wasn't great, I would not give a review or drive in from Long Island. We paid for our meals. \nThe menu is the same as the other locations. Dishes have spice rating on a one to ten scale. All 6 of us were familiar with the menu.\nThey will gladly customize spice to your order.\nAll dishes can be vegetarian and they ask if any food allergies.  High end professional hospitality. \nWe started with two sesame cold noodle and one Dandan (spicy) noodles.   1 order of scallion pancakes. We ate them so quickly that I didn't take pictures.\n\nThen we moved on to vegetables.  Bok choy with black mushrooms.  No heat. Baby tender bok choy surrounding nice tasty firm black mushrooms in a mild sauce. Simple preparation that lets the flavors come through. \nEggplant with garlic sauce, spice level 3. An old time favorite of mine since my vegetarian days in the '80's and '90's. Great sweet spicy dark brown sauce with garlicky and scallions. Caution.  High water content of the eggplants hold onto the high temperature of the wok. Do not rush to dig in. Give it a moment to cool.\nNext is my favorite dish in all Chinese cuisine. Mapo Tofu with Minced Pork! They will make it meatless and it will still thrill. A bowl of heaven that comes to your table. Spice level 7. This is a must for spice lovers. The waitperson asked if I would like it milder. I said make it regular, you ain't scaring me. If I had to choose a single dish to have for the rest of my life, this would be in the top 5.\nAt this point we get to entrees. \nShrimp BLACK BEAN STYLE. Not spicy. Perfectly cooked shrimp and bell peppers in a mild sauce. The flavor of the super fresh shrimp shines through.\nKung Pao STYLE chicken. Spice level 3.  In a regular Chinese place this is considered hot. Not here. Tasty chunks in a sauce with lots of vegetables and chopped hot peppers.\nGinger shredded duck. I like big pieces with a crispy skin. This is not to my liking,although well prepared.   I was really full at this point.\n\nStreet parking is a daytime nightmare. After a half hour of trying we came across a very inexpensive parking lot a block away.  On Hudson street off of DeKalb ave.  It is on the right side of the one way street. There is another lot on the left which is more pricey. Weekend is $10 including tax. Weekday after 2 pm $12.50 plus tax. So this makes parking a non issue.", "author": "Marc E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "What can I say. Me and my family went to the Dekalb Market to grab some food while staying about a half a mile away at the Hampton Inn for my nieces wedding the next day. There was about 20-30 of us from both families and friends getting various food. It's a great food market. My wife and I didn't feel like eating because a couple hours earlier we had gone to John's on Bleecker St. for pizza. We just wanted a drink! So while our family and friends were out eating in the market my wife and I went in to Han Dynasty to have a drink. We met two amazing bartenders in Gina and Brianna! Well pretty soon one by one everyone started to come to see where we were. We introduced them to our new friends Gina and Brianna, who made great drinks and made everyone feel at home, a tab was opened and the party began! All because my wife and I wanted one drink and we met two awesome bartenders who were great people! Thank you for a great evening ladies! Your the best! See you next time we're in town!!!", "author": "Mike M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "They told us to wait for 30 minutes and we waited for an hour and a half. I guess that's our fault because we kept saying, \"well we've waited this long..\" anyways we sat down and waited probably another 15 for water. We ended up going elsewhere. Cuzins Duzins felt bad and gave us donuts so that was tight. Five stars for them!", "author": "Duy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Everything we ordered came out so quickly and was so flavorful. Beef tendon in chili oil are a must along with the Taiwanese sausage fried rice. I recommend the double cooked pork belly as well... so addicting. Perfect family style dinner for me and my friends. Cool industrial interior too. I'll definitely be back!", "author": "Olivia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "they deserve zero star. but welp. First, they messed up my order when i said it loud and clear. but the staff just seemed worked up and gave me some attitude. And when i went back to get my order replaced. I DIDNT EVEN GET A SORRY? Like if u charging this much...it better be good? And besides that, if you really want authentic Sichuan food. As someone who is from Sichuan, I would recommend Sichuan mountain house. None of them are very close, but at least they have better  service and taste. And again, to the business owner. I have seen their interview before saying they trying to give people real sichuan food and culture. but YOU JUS WANT TO MAKE MONEY. we all know and it's fine, but deserve it earn it. don't jus be crappy now because you famous and taking advantage.", "author": "Anne W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-17", "description": "Disappointing. \nFood: \nThe Dan Noodles with Pork was greasy and lacked flavor. \n\nThe Cumin style beef was peppers-heavy. Beef wasn't tender. No nuance in flavor only a blast of cumin. \n\nThe dumplings in chili oil also lacked flavor and were mostly dumpling, very little pork/crab stuffing. Big disappointment. \n\nThe scallion pancakes were fine. \n----------------\nService: \nDumplings (appetizer) were served last, and required a few reminders to the server to get them to the table. \n\nWe had great hopes for our first visit to Han Dynasty as there are no great go-to dine-in Chinese places in the neighborhood. Hoped for this to be a 4-5 star review, but based on experience will not be returning.", "author": "Mat H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Amazing food. Staff is nice and courteous too. Don't know why the average ratings. A definite visit for Chinese food", "author": "Aaditya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Han Dynasty is a welcome break from the strange suckiness of Chinese food in South Brooklyn. Sure, it's Americanized but less Americanized than all the dirty Chinese holes in the wall dotting Carroll Gardens and Boerum Hill. The food is sufficiently spicy without being overwhelming. The Dan Dan noodles are always a favorite with us, as is pretty much any spicy chicken dish. The beer list is pretty good too.", "author": "Scott E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Great Chinese. The fried rice dishes are the best. The dry pepper chicken wings are awesome as well.", "author": "Quecvas J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "Have now eaten here twice and I will say the food is mostly excellent, particularly Dan Dan noodles, dry pork and cucumbers. However, speed of service has been dissapointing both times. As I write, I've been waiting more than seven minutes for the bartender to run my card so I can leave. The first time I came, I waited more than 10 minutes just to get a water. If I keep eating here it will be takeout so I don't have to deal with slow staff.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-20", "description": "My favorite Chinese delivery because there is seriously nothing better that delivers to Crown Heights, but it is not amazing. It is well above cheap, shitty takeout. I always spend a ridiculous amount of money, but then the food lasts three meals, so it's actually a good deal. As I eat it, though, I dream of Cafe China in Midtown. Now THAT is mind-blowing Chinese, actually mind-blowing food.", "author": "Bea L."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}