{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-19", "description": "The atmosphere was alright, seeing that they cater to all target markets considering it's within somewhat of a mall. The service was very friendly and prompt, but to me it was just okay. Nothing really stood out in my opinion.\n\nWe ordered the Dan Dan noodles - which were incredibly spicy and had a hint of peanut-y aroma - not sure why the waiter didn't alert us or remind us, not even ask if we had allergies? Even the dumplings had a chili sauce that drove our tastebuds to overdrive. We ended up ordering a side of rice just to calm down the flavours but all in all my experience was that where I can tell you I am not raving about the place or dying to come back.", "author": "Ana R V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "I. Love. Han. Dynasty.\n\nTruly. I was pretty skeptical at first because it didn't seem very authentic (and will note that the prices are NOT authentic...), but man - this place always makes my stomach happy. I also love that all of the locations are pretty consistent!\n\nIf you like Szechuan food, this is easily the place for you. We ordered the wings, cumin fries, and I personally got the dry pepper chicken.\n\nEverything has so much flavor (Szechuan, duh) and leaves you wanting more. I always opt out of rice to leave my precious real estate to the entrees.\n\nThe lunch menu is always a sweet deal, but you also can't go wrong with dinner!", "author": "Amy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "What can I say. It's really good! I loved the garlic beef with the extra bit of added spice. \nThey let you cater the intensity of heat to any dish. \n\nI will be back when in the area.", "author": "John R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Great drypot lamb! The peppers and bamboo are crisp and fresh! I would also highly recommend the double cooked pork belly! The flavor level is 1000000! :)", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "So spicy and good! Service is quick here so you don't have to worry about missing your movie :)\n\nThe wonton in chili oil is sweet and spicy, juicy and delicious. I love the dish with the fish in a simmering pot. The cumin lamb is amazing. The ma Po tofu is not bad but I've had better elsewhere. \n\nPlenty of seating and definitely one of the best sezhuan places in Brooklyn.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-01", "description": "I've been coming here for quite some time and it's a go-to favorite, since  it's so close to home. The first visit was quite entertaining, I got the idea to ask for spiked bubble tea (you know, when one craves the sugary delightfulness of bubble tea, and also vodka). After consulting the bartender and the tea prep folks, it worked out! The key, I'd say, is to do the non-milk bubble tea and stick to clear liquors. \n\nOh, the food is also on-point. I love the double-cooked style pork, the dry pepper chicken wings and the pea leaves with garlic are pretty much the only things I order from them - dine-in or takeout or delivery. \n\nIt is a touch on the pricier side though, but I think worth it when the craving hits for spice and semi-authentic Chinese food.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Been to the upper west side location few times before, first time going to the location in Dekalb. Service was really good, server allowed us to get happy hour deal despite it being a few min past the deadline, solid beer list. The food itself I thought was awesome, on par with the UWS location. First time not going as large group with the pre fixe deal, but it's still a solidly priced ~40 all in including 2 drinks and ton of food. Pork belly cold dish is one of my favorites but all the food is good and the servers are knowledgeable and will help you out.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-30", "description": "If u order from GrubHub or Yelp (whether take out or delivery, in addition to the delivery fee), each item is like $2 more expensive than the listed price on the restaurant menu.\n\nwhat's the deal with that?!\nThey rather u not use the apps? And go there to eat or order in person?!?!", "author": "N C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "The Epic Feast:\nDry Pepper Chicken Wings $11.95 A+\nWontons in Chili Oil $7.95 B\nBeef Tendons in Chili Oil $11.95 A+\nDan Dan Noodle $8.95 B\nPea Leaves with Garlic$16.95 B\nDouble Cooked Pork Belly $19.95 A\nHot Sauce Style Fish $19.95 A\n\nThis is one of the best szechuan restaurants I have ever been to. They don't skimp on the spices to cater to a certain palate. You definitely have to try out the chicken wings here. They are covered with dry peppers and peppercorn that gives it an amazing kick of flavor. We ordered 4 orders of chicken. I would come here just for these delicious morsels. Two other dishes that really stood out among the rest were the double cooked pork belly and Hot Sauce Style Fish. Remember to order that bowl of white rice to accompany the spicy dishes. Prepare to sweat during this meal, but feels so good.", "author": "Norman L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "Last night my brother, his gf and I decided to check out Han Dynasty inside Dekalb market, while walking by the food hall, and getting enticed by the beautiful aromas of Chinese cooking. We were very happy overall with our food. Food was mostly on point. \n\nWe ordered the veggie Lomein, Chicken Kung Pao, and a shrimp with oyster sauce. The Kung Pao Chicken was our favorite dish of the night. It was delicious  The shrimp dish was a bit too salty and barely enough shrimp for it to cost $21.99. That was definitely a disappointment! Lomein was pretty good. \n\nThe ambience was chill and laid back. \nOverall, the service was on point, someone was always coming up to check on us, constantly, for water, or to check on our food. \n\nI definitely look forward to trying more of their dishes on my next visit.", "author": "Tahini R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "In order, here is a list of my ten favorite things about my recent visit to Han Dynasty. \n\n1. The inexplicable, larger than life mural of Mike Tyson (replete with face tattoo) between the bathrooms. I don't know who was like, \"Chinese food in Brooklyn, gotta have Iron Mike on the walls!\" But it was a good call.\n\n2. The dan dan noodles. They taste good.\n\n3. When my mom corrected our waiter's pronunciation of dan dan noodles.\n\n4. The fact that their website is handynasty.com, and that it could very well be something very, very different if someone else had gotten there first. (I'm quite mature.)\n\n5. The mapo tofu. Gelatinous, spicy, and oh so wonderful.\n\n6. The eggplant with garlic sauce. Surprisingly excellent, even though I was skeptical when my dad ordered it.\n\n7. The very convenient location inside DeKalb Market Hall, which is quite close to my apartment. My apartment, FYI, is what most things should be close to. \n\n8. Wontons in chili oil. Always money.\n\n9. The traditional Chinese soundtrack of Friends in Low Places, American Pie, etc. \n\n10. The staff is very nice, and you really have no way of knowing who is staff and who isn't around here. In fact, I'm pretty sure a woman who doesn't even work here mixed up our dan dan noodles for us, just because she was walking by when they were dropped off, and she wanted to help out.\n\nThe only downsides as I see them were that they were out of the ginger duck which made my brother sad, the pickled vegetable soup with fish was just aight, and things tend to be on the very oily side. I know some things are meant to be oily (wontons in chili oil), but some things don't need to be swimming in oil when just wading in it would do.\n\nI'll be back for all of it though, including that ginger duck we didn't get to try this time.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I was pleasantly surprised to find such a great place at the DeKalb market. We stopped by around 5:30 to 6:00 PM on a Sunday and were seated immediately. We were happy to find out that they can change the spiciness for any dish to match your palette. \n\nWe started with Pork Belly in Garlic sauce which was absolutely amazing. The pork belly is thinly cut and soaked in this sweet and a little spicy garlic sauce. We then had Dan Dan noodles which is like a kinda peanut sauce with some pork. It was pretty good though it was like a ground pork so it was hard to get it to stick to the noodles. We finished with the Dry Pot Style which is a small pot served over a flame with chicken and a mix of veggies. It had a strong potent taste of the sichuan peppercorns and was also delicious.\n\nWe had an excellent time here and enjoyed the meal! The service was spot on as well.", "author": "Robert K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Tucked in the far rear corner of the Dekalb Food Market, is the Han Dynasty. Perfectly lit, modernly decorated, to represent boldly in a proud Brooklyn manner. Great music playing, great Sunday afternoon vibe. \n\nIt was a busy holiday weekend both Chinese lunar  New Year \u0026 Presidents' Day weekend when We arrived. The food market was bustling \u0026 Han Dynasty was a busy place too. However, as soon as we step in we were immediately, greeted by the hostess and instantly sat at a half booth. Our waitress arrived before I had an opportunity to blink. She was awesome, very descriptive about the menu, heat levels, meal accompaniments etc.\n\nWe decided to have the chicken lo mein, scallion pancake \u0026 kung pao chicken. I also ordered the Thai iced tea. Our server informed us that the meals come out as ready which was fine since they are meant to be shared. The food was brought to us rapidly one after, the other. The lo mein was the best I have had in a very long time. The scallion pancake was lite and airy. The Kung pao chicken was very good too. Everything was very good. \nPrice point is decent especially, since the meals are shareable. The chicken lo mein was under $11, the Kung Pao under $16, scallion pancake about $5, Thai iced tea $4. \n\nFood really good \u0026 sharable \nPrice point good \nGood for families, dates, friend gathering etc\nStaff awesome ! \nVibe \u0026 Music so Brooklyn, good! \nDecor cool.\nBathroom clean \u0026 guarded by two of my Brooklyn favorites, Biggie \u0026 Mike Tyson.", "author": "Millie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "Must try item: their dan dan noodles! I still remember the first time I tried it - I was hooked! Now every time we go to Han Dynasty, we always order the dan dan noodles and they never disappoint.\n\nIf you like Szechuan food, this is the place for you!! You can get your entrees prepared as spicy as you want, depending on the style you want your entrée cooked. My go to is the dry pepper style. It packs a lot of heat and has tons of flavor!\n\nI've also tried their scallion pancakes, dumplings in chili oil, garlic sauce style (for those with a low tolerance for spiciness) and their stir fry asparagus.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Definitely recommend this place! Service was quick, and the food was really good. We ordered the house rice, garlic sauce style chicken, scallion style beef, a beef lo main and a side of spring rolls. The lo main was a tad bit greasy as were the spring rolls, but that's what makes it tasty. The place was also very clean which is always something worth commenting on.", "author": "Carla T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "Fast friendly service and a great happy hour special until 7 pm each day.    We always enjoy grabbing a quick bite here on weeknights!", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-26", "description": "Horrible horrible services. I live nearby and this is the only chinese dine in place that is not fast food. That's why I still come to this over priced mediocre quality restaurant. Today I ordered on chownow for pick up at 7:15. The website said it's 45 min wait. I came by at 8:20 and they could not find my order. No explanation just let me stand and wait. Multiple ppl around me have the same issue and this place is ridiculous. No apologies and no explanation! Never coming back! This shitty Brooklyn fake chinese place.", "author": "Michelle Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-24", "description": "I ordered Dry Pepper Chicken to go and was really excited about this. BUT It was literally 80% fried flour puff (normally they wrap mini chicken nuggets in flour and then fry it. Except I think they just forgot to actually put in chicken‍). So no, I could barely find any real chicken. Now I'm gonna go cry.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This place is located at City Point next to Trader Joe's. The food was excellent!! The waiters are very knowledgable and ask you your level of spice, food allergies or concerns, and are great at suggesting what you like. Upon seating you are immediately give a pot of Jasmine Tea, and they waste no time taking a drink order. The service was great, and everything came so quick. I would highly recommend this place.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "My experience at Han Dynasty was amazing, soon as I walked in a beautiful hostess greeted me with a smile which made my day. Then a young handsome man came to take our order he was very polite and explained how we should order and what's good to eat. The food came out quick and it was amazing I love the presentation, the same young man who took our order mixed our noodles for us in front of us which was a nice little touch. It was a wonderful experience the food was top notch, service top notch. Highly recommend, the manager was a very nice young lady who didn't rush even though we were there 30 mins before closing.", "author": "Sabal D."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}