{"aggregateRating": {"reviewCount": 203, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-14", "description": "This is one of my absolute favorite restaurants in Brooklyn. The staff is always so nice, the food is INCREDIBLE and very well priced! They also have an amazing lunch menu with smaller portions of select menu items ranging from $10-$13. My personal favorites are the hot sauce beef and the beef lo mein. The regular entree items are around $20 and are more of a family style size which are a great sharing option for groups. I also like that the menu items can be customized to your liking on spicy levels ranging from 1-10. If you're a fan of bubble tea, they also offer a variety of flavors and tapioca options, but my go to is the lychee bubble tea with regular tapioca which never disappoints! \n\nOverall, I don't have anything bad to say about this place and it will continue to be one of my go to spots!", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "I've always been a little skeptical of Han Dynasty because I thought it might just be overpriced, Americanized Chinese food. I'm so glad I gave it a chance because it's become one of my favorite restaurants nearby. \n\nThe Dan Dan noodles are a must-order if you love spice. I'm also a big fan of the scallion pancakes here. For entrees, one is large enough for two people to share if ordering appetizers. I love the format: pick your preparation and pick your protein. We almost always order either the crispy rice or garlic sauce style but I also love the dry food pot style. You can also customize the spice level - I was surprised by how spicy the dishes can be here. \n\nReally great for large groups because the portion sizes are meant for sharing, but I also love ordering here anytime I'm in the mood for comfort food.", "author": "Margaret Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-06", "description": "I've been a Han loyalist for a while now and we religiously have it delivered--anywhere between 2-4 times per month we'd order from here but lately, the delivery has been lacking. The last order, it came a hot mess. The sauce was leaking from the containers and caused a disaster when we took all the containers out of the bag.\n\nWhat really annoys me through is the quality of one of their most popular dishes: Dry Fry Style, Chicken. It's basically breaded chicken bites, fried with peppers--it's delicious. We always order this. The last few orders though, it's been more of an order of fried BATTER than fried chicken. It's been a disappointment because the dish runs close to $20 and if I wanted a container of fried batter, I could've made this on my own but wtf wants fried batter for dinner?\n\nWe'll likely try and order once more and see what the quality of this dish looks like. If quality continues to plummet, it's likely we will omit this from our order moving forward. Unfortunate.", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "+ Takes reservations\n+ Food was a bit salty but tasty and spicy. We ordered: dumplings in chili oil, ginger sour string beans, dan dan noodles", "author": "Margaret R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-01", "description": "So I came here for lunch today with a friend of mine and I must say I enjoyed my time there. From the moment we walked in was greeted with a.smile and seated instantly. Our waiter took our orders right away and even another waiter who wasnt at our table came across to us to see if we were okay and asked if we needed any drinks , really liked that. \n\nI ordered the lunch special of dry pepper chicken with brown rice. I must say this chicken was hot hot and spicy, so be warned if you're not a hot pepper person. \n\nThey also have a wide range of beers and other alcoholic beverages. There's a lot of seating inside this spot and spacious enough to move around. \n\nWould definitely be back here for lunch some other time.", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "Dumplings in chili oil, pork belly buns, scallion beef, and rice... all delicious! No wait for lunch and the prices were great for the service and quality.", "author": "Billy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-18", "description": "I came to Han Dynasty for dinner on a recent Friday night, and although we were not able to make reservations ahead of time, the wait time for a party of two was only 10-15 minutes, which is a perfect amount of time to grab a beer at a nearby stand and walk around gawking at all the Dekalb Market has to offer.\n\nWhat I love about Han Dynasty is that they are able to adjust the spice levels on all of their dishes. Although I claim to like a kick to my food, truth is that in reality that kick is more of a light tap. I was able to choose the spice level for all of my dishes and even sides on a scale from 1 to 10 - I'm embarrassed to admit that my comfort level of heat hangs somewhere around level 4.\n\nI could not stop gushing about the eggplant for days. Is it strange that my favorite part of the meal was the added extra side? The flavors are amazing. The crispy scallion pancake was tasty, as was the tangy sauce it came with. I could totally see myself indulging in just the scallion pancake and the eggplant with a glass of red wine at the bar - perfect snack.\n\nSo here's the thing.. the entree was actually my least favorite part of the meal. I went with Scallion style beef, which came with a side of white rice. It's not that there was anything wrong with this entree, but it did fail to impress or even live up to the less glamorous smaller dishes that were bursting with flavor. It was fine, just fine. It did come out with flames dancing underneath the dish, which scored my table plenty of curious looks.\n\nI have not had much luck with Chinese food in this area, and Han Dynasty, although a bit pricier than your average Chinese restaurant, is definitely the best out of about four Chinese restaurants I've tried Downtown Brooklyn. Whenever I get a craving for Chinese food in the future, I will now know exactly where to go.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-11", "description": "After all the running around I searched high and low to find somewhere to eat and charge up my phone. Sigh... I wish I was able to look under yelp 1st before ordering. This place looks cute but the food didn't do it for us. My son wasnt happy at all and he would eat just about anything I tell ya.\nHis spicy beef soup was not good. His words not mine. The beef was too chewy he had to spit each one out after chewing forever. On top of that he said it was too salty. I had the cris", "author": "Shirrell H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-29", "description": "I love Han Dynasty and have been to a few different locations around the City, so how does this Brooklyn outpost compare? It's pretty consistent.\n\nWe started with the Dan Dan Noodles, Dry Pepper Style Chicken, Pork Buns, and Scallion Pancakes.\n\nThe Dan Dan Noodles at Han Dynasty are technically an appetizer, but large enough to also be a main dish. Fluffy noodle on the dry side drenched an expertly mixed flavor bomb of hoisin, pork bits, ginger, garlic green onions, spicy oils, numbing spices and peanut butter. This is THE appetizer to get here. Pork buns are fantastic, tender, succulent, and sweeter than usual. They have a peanut/sugar/spice coating and it's unlike most of the hoisin-based pork bun sauces you have had elsewhere. Scallion pancakes are average.\n\nWe got Dry Pepper Style chicken as a split entree. When I asked the waiter about the 8 spice rating and whether it was an American or Asian scale, he told me it was truly an asian scale, and the dish did not disappoint. It was loaded with red Chinese peppers and sautéed jalapeño-like peppers. The \"triple-flash-fried\" chicken was super crispy but not overly greasy, and was a bit like popcorn chicken taken to the max.\n\nQuality is better than average, pricing is average for a popular small-chain restaurant like this in NYC. The Brooklyn location is just as tasty as the others.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "We went here during the first of like many polar vortexes, it was effin freezing outside and honestly, when it's cold there are really only two things you can eat. Ramen is #1, but we were with a group and ramen doesn't necessarily lend itself to group eating. Case in point, you go to a place like Ichiran and you end up sitting in these little booths and get your food through a little curtain thingy from a waiter, it's almost like the place was designed for solo eating. I'm getting sidetracked - the point is I love Ramen but i don't get when groups of people go out together to get ramen. \n\nNumber 2 is Chinese, it's warm and saucy enough to just perfectly hit the spot. All the meals are also family style, perfect for large groups who wanna share. And literally every shareable option at Han Dynasty is perfect. The garlic style chicken and the cumin lamb are my personal go-tos (if I'm being honest, I don't ever really wanna share the cumin lamb but there's a decorum at these places). Han Dynasty also has really good pork noodles and the vegan moong bean noodles were surprisingly good (I say surprisingly bc im genuinely surprised when vegan things are good). Add that to the fact that the dekalb market location doesn't have the same crowd that the east village location has (maybe that was cause of the cold, idk) and this was", "author": "Srikanth T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "Review of the take out \n\nWait is long but I learned you can order online and they deliver \nFood was ok but way too expensive for basic items\nChicken and garlic was $10.00 on the lunch menu!! It was overly spicy  \nHan will not be building their dynasty on my hard earned salary! Nope  \n\nNot impressed...", "author": "Nakia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "Had a lunch here with coworkers and I'm oberving\nthe lenten season fast. I got the dry pepper fish with a rating of 8. \n\nThe first couple spoonful of white rice and fish didnt give me that punch of hotness. Came the third and I felt the intense spicyness of the capsicum.... tears started coming out, sinus opened up, and the ratio of white rice to fish increased by two folds. \n\nHan Dynasty never failed me. Dining with a big group (13!) unlocked the unlimited rice and hot tea level. Courteous and knowledgeable staffs is a must and Han Dynasty succeeded. Cool ambiance and table arrangement. Two thumbs up! \n\nHighly recommended if you are looking for spicy chinese dish.", "author": "Bryan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "Would highly recommend the Dan Dan noodles, it is so flavorful and amazing. Great bite to eat for spicy lovers as I usually raise the spice level to an 8. Awesome lunch deals also.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-17", "description": "I have gone here multiple times. I would suggest the hot pot. It's one of the main dishes. The seasoning is really on point for the hot pot. It has vegetables with your choice of meat. The rice is a little soft but still good. Also spicy wantons in Chile oil are good. I was disappointed by the the beef noodle soup. It's bland. The broth tastes like water with hot sauce added only. The noodles were too soft and the vegetables were bland. Overall I would not recommend ordering that.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-04", "description": "First time here. I am gluten-free and our waiter's mom has celiac disease, so he had awesome recommendations on what to pick on the menu. He suggested the House Rice Noodles and they were delicious. The portion was so large that I ended up taking more than half home. He also suggested the pea leaves with garlic and they were also yummy. I'll definitely go back.", "author": "Monica F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-06", "description": "Came here for lunch during the week at around 11:45. We were seated immediately but the place began filling up soon after. They had lunch sets (dry pepper chicken and twice cooked pork), so we got two of those, along with the scallion pancakes and the house fried rice. \n\nThe pork was good, but the chicken was a little too fried. I felt like the chicken was more batter than actual chicken. The scallion pancakes were alright, nothing special. I think the most disappointing was the fried rice. They called it a Yangzhou fried rice, but it really wasn't. It was missing a few key ingredients, like the barbeque pork. Additionally, the rice itself had zero flavor.", "author": "Claire Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "We came in on a rainy day just to walk around the city point mall. Just being there a few times many places were not open as of yet. \nI knew Trader Joe was down stair along with the food court. At the time my only criticism way that it was hard to find a seat to eat the food down there. This time we were pleased to find some sit down restaurants. Walking into Han Dynasty we where greeted and shown to a table. Staff was friendly and nice. And we were happy that we can have spicy for me and no spice what so ever for my wife. The food was very tasty and we loved the cocktails with and without alcohol. We did not eat a variety of dishes to make a truly accurate assessment. But we enjoyed what we ate and will go back.", "author": "Jeffrey R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-29", "description": "I don't know what had happened to the hostess and the waitress at this restaurant because they seem to have contempt toward certain races. Especially the hostess. I mean they were being nice to the clients next to our table and was obviously giving us attitude when we were ordering foods.", "author": "Shi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-28", "description": "Thankfully they've gotten much better since their opening blunders. Definitely try to eat in as opposed to take out, which can still take a long time. But the food here is now just as good as the East Village location.", "author": "Kelly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "I feel like if you haven't eaten at one of the Han Dynasty restaurants then you just don't wanna be down... This version is as good as the Manhattan versions. Incredibly consistent...\n\nWe've only ordered delivery but were just as satisfied with the quality of the food. Go already...", "author": "Art C."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Han Dynasty", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pEmpvMo709-OaStOwtA19w/ls.jpg", "@type": "Restaurant", "telephone": "+17188580588"}