{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-23", "description": "Mediocre Thai food.  Pretty restaurant though.  Waitstaff keeps wanting to know \"you like it?\" but if you say no, they just walk away.  The \"crispy cashew duck\" was gross.  The veggie dumplings light and pleasant.  If you like your food spicy, tell them you want it that way otherwise the they dumb every dish down, assuming everyone has a  tender tongue.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-03", "description": "Great cheap Thai lunch men...Pad Thai was very good for the price...", "author": "Jon B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-11", "description": "I had the spicy basil fried rice, and it was really, really bland. There was no flavor to the rice and the chicken that I ordered in it was also very tasteless. I had to add chili sauce so that it was edible. I dined at this place about 2 years ago with friends, and I remember that it was not bad. Maybe it is different when ordering take-out? In either case, don't order the fried rice. I know it's not a great measurement of solid Thai food, but it's a simple dish that should be made with flavor.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-28", "description": "The food here is SAFE. Don't go expecting mind blowing food. The appetizers are nice, and the drinks are decent but pricey. Its no Spice, so don't expect that caliber of food, but it will be decent at the very least.", "author": "I G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-29", "description": "I waggled between two and three stars for Lantern, because it's largely dependent on what you order.  Since no one has reviewed it and I had to add the business to Yelp, I'll go on the more optimistic side of the review.  However, understand this: your experience at Lantern will vary widely depending on what you order.  I haven't been here more than three times, so can't rank the menu fully enough. \n\nThe good:  Curries and Soups sections of the menu.  Particularly, the panang curry is delicious.  The average: \"Hot from Asian's Wok\" section of the menu.  The ginger dish was good, but left me craving even more flavor.  Too many onions and not enough other base spices or aromatics with the ginger.  (I wanted galangal, lemongrass, kaffir lime; any other additional flavoring.) The bad: some appetizers or specials can be marginal. We tried some mushrooms that sounded good from the menu, a special of lightly breaded and fried mushrooms with flavorful honey-chili dipping sauce.  The result was abysmal.  The mushrooms were indeed battered and fried, but this had been done with them totally raw so the result was a crispy batter into a cold raw mushroom.  There was no seasoning or salt in the batter.  The dipping sauce was good but too pre-processed and not fresh flavors.  The unknown: 95 percent of the menu.  I'm convinced there are good things in here but it's trial and error to find them.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-19", "description": "So I've been there once for take out and once for a sit down lunch, and both experiences were very hit or miss.  The time we had take out, the food tasted kind of blah, especially for thai.\n\nThen, when I went for lunch with a co-worker, the food was definitely better but the service was a mess.  I think I counted two, MAYBE three waitstaff, and with a place as big as it is, that won't cut it for the Brooklyn Heights lunch crowd.  Pretty much everything from getting a drink, to the silverware, to the food took a long time.\n\nI really wanted to like this place more since there aren't a ton of thai options in the area, especially since the decor is pretty cool, but it's just kind of a mess overall.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-30", "description": "I wholly regret spending $8.92 on a lunch special here, which is way too much for thai lunch anyways...\n\nThe woman taking orders was extremely rude and angry (um...okay...it's really messed up of me to be giving you business...uhh).  They were going to charge me $2 extra for brown rice so I said hell no and stuck with white.  My garlic chicken came in a tiny container and spring rolls were so doused in sauce that they were limp.  I basically spent the rest of the day kicking myself for not going to Sea on Livingston and getting their $5.95 lunch special.  \n\nNever going back here.  Not worth it.  Don't bother.", "author": "Shira K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "The mango salmon and volcano chicken are fantastic. I suppose the service can be a bit slow, but never ridiculously slow. The ambiance is relaxing, and while Lantern's not dirt cheap, you won't pay a fortune here either. I'm very surprised at some of the more negative reviews....", "author": "Patrick G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-07", "description": "Dependable Thai food, ranging from average to over-priced. Interesting decor \u0026 nicely dim lighting, cheapened somewhat by the distracting TV's.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-12", "description": "A fiending Thai foodie shouldn't have to try so hard to like this place.  Given Lantern's monopoly on the Thai food business on the Montague strip, I really wanted to love it.  The takeout pad kee mao was bland bland bland.  Chicken and shrimp fritters stale.  After getting a busy signal for 30 minutes, they first ignored me, then were rude (worse than indifferent) when I finally ordered in person instead.  While waiting, I dialed their number just to see if they would pick up.  Busy signal, but no one was actually on the phone!  What gives?  They don't bother to pick up?  Well, neither will I.  Phuket?  Yeah.  Phuk it.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "I have a lot of good memories from Lantern. When I first moved to NYC some of my closest friends took us there on New Years Eve. It was busy but not too crowded and we had an amazing meal. \nAfter I got married in the courthouse a few blocks away in my jeans on a random Monday afternoon, myself, husband and our witness came and had a really lovely lunch here. \nA few other times for random date nights..\nI have never had a bad meal at Lantern. \nThe crab rangoon is amazingly lovely. Fried (but not heavy) with crab and cheese and a chili dipping sauce...\nI am also a gigantic fan of the drunken noodle (kee mao) with vegetables. The most vegetables I have *ever* seen in this dish - fresh broccoli, squash, bok choy, mushrooms, beens, tomatoes..really whatever they've got, on top of a bed of lettuce (which i fold up, soak in the spicy sauce and eat every last bit of. mmmm\nI have also had a lovely Thai iced tea here.", "author": "Sara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-03", "description": "I had dinner here with a friend from college that I don't see so often.  The availability of outdoor seating bumped what would have otherwise been a three star review up to four stars, since we were able to enjoy a lovely, breezy evening on one of the first warm nights this year.  We shared a bottle of the Sauv Blanc (just OK wine and seemingly overpriced at $30), the Pad See Ew with chicken (I wished there were more veggies and a little less noodle) and the Pineapple Fried Rice with shrimp (wished there were more pineapple, a little bland compared to PFR at other Thai restaurants).  The noodles and rice were completely reasonably priced at $10 and $11 per dish.  We sat for a while while we finished our wine, and the waitress was kind enough to never make us feel rushed, which I appreciated.", "author": "Stacey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "I visited Lantern several times as I lived in the area for a couple of years. They have great food, good service, ambiance can improve just a little, but other than that worth the money. I think plates run between $10-20, but it's tasty and filling. Date place? Ummm, maybe like 2nd or 3rd date... It's not uber romantic. Still a great place for lunch or dinner.", "author": "Steffany E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "At this place you have to know what to order to have a good dining experience. First of all load up on the apps and drinks, they do those the best! The thai mojito and lychee martini are divine and still the best i've had anywhere (props to the bartender)! For the apps get the mango salad (it comes with yummy grilled shrimp, mango, mint and lime cilantro dressing), fried calamari, spring rolls, and curry puffs. Also ok are the vegtable dumplings and the shrimp shumai. As for the entree, sometimes they have good specials (ive had some good fish and my husband had some good chicken) but from the everyday menu stick to the Wok items, I like shrimp or vegetable eggplant basil, garlic dish is also pretty good. I'd streer clear of taking anything with chicken as its usually not very good (dry and overcooked). Their montegue fried rice is deelish with beef but sometimes a little too greasy. Also my husband said their noodles are ok. So if you know what to get you'll enjoy your meal, it took my husband and I about 4 years of coming here to figure it out but we finally did. Also the ambiance is cute and there is outdoor seating for those nice summer days. I will go out on the limb and say its the best Thai place in the bklyn heights/cobble hill/downtown area (and I've been to them all).", "author": "Liz L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-09", "description": "Excellent curry and other dishes, so I like this place a lot. But as others have commented, there's some sort of disconnect between the staff and customers. Manager must not be reading Yelp as the spotty service doesn't seem to improve.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-05", "description": "food poisoning warning!  your stomach better be ironclad or else you may end up in the hospital .  if i had listened to my instinct.   i ate the  broad sticky lantern noodles.  one hour later severe gas churning stomach pains internal turmoil, the pain rated an  8 to 10 and lasted for 24 hours. i believe the kitchen is nasty and food not fresh.", "author": "Sherry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "The food was good. The service was fast. I really enjoyed my meal. They have a lunch special which is $9 for an appetizer and an entree. They have reasonable prices as I am a frugal spender. I would go again.", "author": "Hillary S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-20", "description": "Great deal for lunch! Tasty drinks! Cute decor!\n\n...but good god, some poor service here. Servers hardly speak, and when they do, it's when they argue with one another. Got my entree before my appetizer and didn't get a glass of water til I was almost done with my meal.\n\nFor dinner, I would opt out of Lantern and take the 15-20 minute stroll to Joya.", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-01", "description": "For the price I would expect a little more. Good service. Nice clean place, but the food is only ok.", "author": "oWEN w."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-08", "description": "The first thing that got me about this place was that it was cute and quaint. They had great brunch specials starting at $8. I'm not sure if they have a weekday lunch menu, but I don't think the yellow curry I got was worth the $10. My husband had the eggs benedict and didn't complain but he rarely does. Our server only came to our table once. I suppose the wait staff could be a bit more attentive and a bit more friendly, and they could have put a bit more flavor (flavor, not spice) in the curry. I'd probably go again but there are so many places on Montague that I'd try something else before going again.", "author": "Elle L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}