{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Who lives in a pineapple under the C? (Well actually the 2 and 3 trains are closer) haha\n\nYou know what I love about Thai places. Thai ice tea. I know. That's probably as bad as saying people loving the crab Rangoon at Chinese places. But Thai iced tea is so good and they do a great job here. \n\nAnyway as you can tell from the photos be good here is beautifully presented. As is the overall design of the restaurant. We came for the fried rice in the pineapple but actually the pad Thai took the cake. It was so well balanced and ask for the hot sauce and they will bring you a selection of 4 sauces. You will want this to give the meal a good kick. The fried rice is good but I would definitely go for the pad Thai again. Which is probably a top 3 I have had in BK", "author": "Helen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-17", "description": "My second time at this place and most likely my last. This place is good if you just venturing into Thai cuisine as this place is more about Americanized Thai dishes. You may also want to skip a drink as the bartender thinks adding sugar to everything can make it taste better, it does the opposite. Overall the location is great, the vibe lively and loud but can be cozy when it quiets down. The service is ok.\n\nPS I ordered a Caipirinha from the menu, it came made from lemons and it was shaken and it def wasn't with cachaca. I chose a simple drink - I guess not simple enough.", "author": "I I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-25", "description": "We had our first date here, so this place is always going to be special to me.\n\nIt's decently spaced, with outdoor seating as well.  The interior is dim - I'm guessing to set the mood for romance, since the promenade is blocks away!\n\nThis place is one of our go-to spots for Thai food.  We have yet to be disappointed with the food, or service.", "author": "Ms. V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "The food was okay. I would come back. However, I had better. The location is cute but too dark.  They have a rugged look in here. I like the lanterns they use as lights but they need to use brighter lights for the day time. They have a cool $11 lunch menu and the food size is good. They were not cheap with food. The service was pleasant and they served our food quickly so thats great especially when on lunch break!\nThe bathroom needs a makeover!", "author": "Precious P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Came here again and got the same thing (chicken pad thai)!! Their lunch special cant be beat for $11. Quick service, nice staff, cheap and flavorful food. What more could you ask for?", "author": "Laura M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-24", "description": "This is the first time we've been here, the food and service, as well as the prices are reasonable. I have been to other Thai food restaurants and had a slightly better meal.\nHowever this is a very good local establishment", "author": "Robert R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-25", "description": "Thai restaurant on Montague with a nice, dimly lit interior. There's ample seating and a wide selection of food items. \n\nWe tried the yellow chicken curry and chicken pad kee mao. Both were a solid serving size. However, they were both quite salty and Lily to taste. The kee mao had a good amount of egg but barely any veggies and onions. The yellow curry was rather thin, but very salty and heavy to taste. \n\nFast service, good portions, but for more veggies and less oil, I prefer other Thai options in the area.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "I come here so often, I'm cool with the staff (HEY GIGI! lol).\n\nThe lunch specials are now $10, but the quality of the food has not changed.  Still delicious.  My go-to meals are the Thai Fried Rice, Pad See Ewe and the Garlic Dish.  If I go during non-lunch hours, I get the Garlic Fish.  OMG!  So delish!  I get the garlic on the side and dip the fish into it just to ensure every bite of the fish has garlic sauce on it!  If the weather permits, I love sitting outside but the ambiance inside so charming and romantic.\n\nCan't wait to return!!", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "We came here as a party of 2 at around 5:50 PM on a Friday night without reservations. At this time, it was not too busy but it got busy quickly by around 6:30 PM. Today's weather was beautiful and we were offered to decide whether we want to be seated inside or outside. We chose outside. The block of the restaurant isn't too busy (not too many passerbys) and sitting outside the restaurant felt pretty relaxing and chill. The only downside to sitting outside are the flies and bees. If you hate bees and flies with a passion, then I urge you to be seated indoors! I took a sneak peek of the indoors to use the bathroom and it was beautiful and calming inside.\n\nWe ordered the chicken pad Thai \u0026 pineapple fried rice with chicken along with Thai iced tea. Price is pretty inexpensive considering the location and ambiance of the restaurant. Waiters were super friendly and pleasant and food came FAST! Within 7 minutes of ordering my food, my entree arrived at our table! Food was delicious. Bill came out to only $40 for 2 entrees and 2 Thai iced teas including tax and tip. \n\nI would definitely come here again for a quick meal with a friend or even a birthday celebration with a small group! \n\nThe restaurant is conveniently located super near the Brooklyn Heights promenade (just 2-3 blocks down)! You cannot miss it. All you have to do when you leave the restaurant is turn right and literally follow the water. There are benches at the promenade where you can sit and experience breathtaking views of the Manhattan skyline, Hudson River, Statue of Liberty, and the Brooklyn Bridge.", "author": "Christine G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-19", "description": "The food was ok. Ambiance is cozy nice, and that's why they have two stars. I really want to give them 1 star because of their customer service. I had a date, and the waiter kept rushing us to order. Then when finished eating, he came over and placed the bill on the table w/out even asking if we wanted something else, which we did. So we order another drink. He comes back with the bill, and we pay. About 5 mins later, he asks us to leave because it's Saturday night and guests are waiting. That's the rudest thing to do ESPECIALLY after you were tipped very nicely. I wouldn't go back there. Lantern employees should get retraining on how to treat its customers.", "author": "Ti R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Excellent and very authentic Thai place in Brooklyn Heights. It is very spacious with a hip interior and an outdoor seating area too. Our main entrees were the Rama Chicken and Basil Duck. \n\nThe Rama Chicken comes with a delicious peanut sauce atop a bed of spinach. The Basil dish was not too spicy but still full of flavor. Both of the meats in our entrees were very moist and juicy. I was also surprised by how large the portions they brought us were. \n\nBest of all - this place is only steps from the Brooklyn Promenade. After enjoying a nice meal here, walk over to the waterfront for amazing views of the Brooklyn Bridge and Manhattan skyline.", "author": "Tyler L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Five star Thai food. I've had Thai all over New York, and all over Thailand, this is some of the best most authentic restaurants. Number one: everything that comes out of the kitchen is piping hot. You never get luke warm food and anything that is not fresh. Number two: every single thing I've had there is incredible. I had the crispy red snapper also called the garlic fish, wow wow wow. Best snapper I've ever had. Crispy, Flaky and not a ton of bones. They filet the fish so well. I also had the veggie fried rice, just delicious. This place is seriously blows me away. If you're thinking about going there do it!", "author": "Chanelle H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-29", "description": "Tried this restaurant for the first time yesterday, as the $11 lunch special caught my eye in passing by..\n\nUpon entering I sat near the window by the door, the place was very dark needs more lighting! Then came what lasted for about 15 minutes in and out delivery of  huge boxes which contained the restaurants food inventory the workers were bringing in speaking loudly in their native language. This was an annoyance , you  should be bringing in shipment at a different time not during lunch time when customers are present trying to enjoy their food .\n\nDespite this annoyance and safety hazard as the boxes were tipping over-- I decided to order lunch \n\nApptizer- chicken and shrimp fritter was tasty until I bit into the middle where it was still frozen.\n\nLunch-  grilled pork chops which came with a bed of grilled veggie bok choy, carrot, broccoli and white rice. This dish was DELICIOUS and filling! \n\nThe service was ok..\n\nI finished eating, and went up to the register to pay as i had to head out..The total was $11.98\nI gave the person behind the bar/register $12 , and walked back to my table on the side  to retrieve my belongings. The worker instantly came beside me and said \" Tip tip\" hand held out pointing to receipt, i was shocked!! I layed my tip on the table and walked out .\n\nThe food was delicious,  but I'm not sure if I will return if I'm going to be harassed for a tip. Please remember tip is not mandatory, and people usually give tips as a courtesy even if service wasn't good. I am one of those people who ALWAYS tip. Next time be more professional and not hungry for a tip! You will gain more customers who will become regulars!!", "author": "Lisa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Portions were big and yummy, drinks were also really great. A little bummed we couldn't eat outside but I understood because I guess people reserved specific tables there. Will definitely be back.", "author": "Sydne P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "Nice interior and pleasant outdoor seating when the weather is good at this Brooklyn Heights spot serving classic Thai dishes and some creative ones as well.  To be honest, I felt the food here leaves a little more to be desired.  Curry puffs were tiny and a bit of a ripoff for three.  They were slightly burned on the outside and didn't pack much flavor.  Penang curry was passable but lacked heat and felt like it was missing kefir lime.  Biggest disappointment was the Montague's fried rice.  Lacked flavor and the brown rice just didn't work, adding an earthiness that clashed with the other flavors.  Service was fast and courteous and prices are average.  Not my favorite Thai restaurant but not horrible either.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "I used to be a regular at Lantern but I've fallen off lately. I'm glad to report that the food is still as good as it was back then. Everything tastes fresh and hot when it was delivered I our table. The server (tall, glasses, maybe in his forties) was more pleasant than he usually is which was a bonus for me!! I had the chili basil with beef. It was not too spicy and really flavorful. I had salad as my appetizer- it looks dry because I didn't want the dressing. My friend had the pad Thai with chicken her dish was equally good. She had the chicken shrimp fritters which are always amazing!!  I'm glad to know that I can consistently count on Lantern for a good meal!!", "author": "Kia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "Friday, February 22, 2019 @ 5 p.m. restaurant was empty. My friend and I were promptly greeted and seated.\nWe ordered a rum with Sprite with a twist of lime which was pretty good as well as a pot of green tea while, we looked over the menu.\nWhen the drink arrived we ordered an order of Fried Calamari and Thai shu mai. Both were well prepared and presented.\nOur entrees were both fried whole red snappers. One with fried garlic and then other with the combo three sauces( garlic, tamarind, and sweet and sour). Both came with a side of rice. Both were very tasty, fresh, and delicious.\nFor dessert I got the Thai Ice cream which is a base of sweet sticky rice topped with peanuts, red beans, vanilla ice cream, whipped cream and cherry. Very good and just enough sweetness to end the meal.\nService was attentive without being intrusive.\nPrice for the portions are very reasonable.\nPlace was full when we left around 8 p.m.\nI will be putting this place on a monthly visit and highly recommend.", "author": "Papilindo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Great food, great service, and very clean. I always get the Drunken Noodles and it's all I'll probably ever get. I love it!", "author": "Far D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-30", "description": "Great place for lunch, one of the best lunch specials that I have ever seen. \n\nService is questionable, depending on the day. \n\nTurn around time between placing an order, and receiving a meal is extremely quick. \n\nWould definitely come back here, no questions asked. Especially in the Summer/Spring, outside seating is available.", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "I ordered take out---the food was good. I'd definitely return. The food was prepared very quickly despite it being right after work hours. \n\n\nI ordered the pad Thai with chicken ($12) and green curry with chicken ($12). The price compared to other Thai restaurants in manhattan is fair. The servings are decent and left me happy and full.", "author": "Valerie N."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}