{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "This place is bigger than what it seems like on the outside. There's a few outdoor seating and then a lot more tables inside with a bar. \n\nI love the ambiance- it was dark with little lanterns hanging from the ceiling. Has a romantic and serene decor. The service was good as well, our waiter checked up on us frequently. \n\nI ordered the pad kee mao with vegetables. It was so delicious i devoured the whole thing- I liked that the noodles weren't drenched in oil either. We also ordered the papaya salad and that was light and tasty. I did not enjoy the taste of papaya until I tried this salad- the dressing added on to the flavor. I would come back to try their lunch specials.\n\nAlso, this restaurant is so close to the brooklyn promenade so you can enjoy a nice walk with a view after dinner.", "author": "Chris L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "Seriously fast, quality Thai food from a seriously expansive, inexpensive lunch menu.  $9.95 gets you an appetizer and a main course off the lunch menu.\n\nRestaurant is clean, convenient and service is efficient.  Outdoor seating on a warm day on Montague Street in the Heights is nice too.\n\nGreat lunch spot for with co-workers or a friend.\n\nBe sure to ask for the side hot sauces.  They are brought over in 4 small glass jars with lids and spoons.  They are tasty and spicy ... Beware of the green colored, innocuous looking chili sauce - it looks mild but is the spiciest one.  All these sauces provide great flavor and an extra kick :)", "author": "Paul M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "I wanted to walk on my lunch hour and ended up strolling past here, seeing the lunch specials, and walking right in. The lady at the bar was kind and took my order quickly. Food was ready promptly - I did the $9 lunch special which gets you an appetizer and an entree... I went with the chicken/shrimp fritters in a chili glaze (yum!) and the drunken noodles with chicken. \n\nThe app was three pretty large sized balls - I was almost full after just demolishing those! The noodles were greasy (but, thats what drunken noodles are) - they are the flat wide pad-see-ew noodles (I prefer this dish prepared with glass noodles though). There were a few slices of onion, 3 slices of red bull pepper, and two slices of tomato as the \"veggies\"... if you prefer more variety, just order yours with veggies instead of meat! The chicken was white meat and thinly shaved and tender, which I appreciated. \n\nI plan to bring a coworker or two here next time I come this way - and will definitely expand my samplings!", "author": "Heather H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "The food was great. We sat outside enjoying the scenery. The people who worked there was very nice and service was quick. The calamari was Nicley fried. The Papaya salad was fresh and the noodles was boiled to perfection. \n\nMy only problem was my ginger ale was flat. They do have wonderful cocktails. The prices was pretty reasonable. We ordered 3 appetizers and 1 main dish. It came out $45. I would defiantly be back.", "author": "C. S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "A solid Thai restaurant in Brooklyn that I looked up when I was in the area with my girlfriend. To start, you get why the restaurant is named \"Lantern\" when you check out the decor in the restaurant. I would give a two thumbs up for the ambiance and decorations as they pay attention to detail and you see this in everything from the drinks to what they hang on the ceiling. \n\nWe started off with the papaya salad, which had a nice combination of radish, payaya and other vegetables. It was a bit too acidic for me so be concious of that when you order it.  For the entree I ordered the Pad Sew Ew, which was very good as well.\n\nI would come back to try some of the other dishes and I did want to highlight the service as well. The staff was very attentive and very quick.", "author": "Jason Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "This place has very tasty Thai fried rice but some of their food is a little bland. Overall I enjoyed the service and the proximity to the water.", "author": "Amiyr B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-08", "description": "This is a great place to go to for lunch. They have lunch specials that include an appetizer and the Thai iced tea is very tasty. They are also very quick to serve your food. But if you don't have to lunch special they can be a little pricey. Good food and quick service on Montague Street. It's very cozy and comfortable and they play great house music.", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Love this place and the food. I was here on Friday and Im going back on Monday. Cant wait!!", "author": "Rochelle G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "Went on a Sunday evening and was seated right away. The waiters and servers were quick to take our order, and they picked up our dirty dishes quickly, and refilled on water as soon as I was almost finished, which I'm a fan of. For appetizers we had fried calamari which I thought was awesome, not made with so much breading like most places. The curry puffs were delicious, and the chicken satay was okay. \nI had the duck in pineapple sauce which was not bad but the sauce is really overwhelming so it defeats the purpose of getting duck and my beau had duck in lime sauce which he said was good. We both had Thai iced teas which were okay, I've had better. \nThe tables were extremely close together so if you want some privacy you won't get any here.", "author": "Dee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "So yummy! Order the pineapple fried rice, 10/10 recommend! Had some questions about what was and wasn't vegan and they were extremely helpful in making sure my meal met my dietary needs!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "First off this place has the best lunch special. $9 for an appetizer and entre, can't beat that! This place is always busy during lunch hours because of the lunch special. If you're planning on coming during lunch time 12pm-3pm (i think) get there early. Large space inside and offers outdoor seating when the weather is nice. On to the food! All the apps are good. Try them all if you can. My go to entre's are the spicy basil fried rice with shrimp, chicken pad-thai, and the garlic wok with shrimp. Food comes out quick! It's like these guys know what you will order before you order! If you're around the neighborhood or looking for a good lunch spot check this place out.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "I love Thai food!! Always in search of a great Thai restaurant. Started working in Brooklyn 5 years ago and heard about this place from my coworkers. They have these amazing lunch specials for $10. I've tried different selections but the drunken noodles, with shrimp of course, are to die for!!! And you get a very tasty appetizer to go along with your selection. I really want to try other dishes on the menu but I'm in love with the drunken noodles.", "author": "Pamela H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "If you know me, then you know I LOVE THAI! I have been to this place too many times to count. And trust me when I say, everything tastes amazing! My personal favorite is the spicy chicken basil. Add that with a Thai iced tea and your stomach will be in heaven! I also like the spring rolls and the curry puffs. Mmmmm. :) The best part about this place is the price. A dinner for two including appetizers typically is around 30 dollars. Not bad considering all the food you get. My only drawback is the amount of rice they give you.  The portion can be kinda small, so if you love rice like me, definitely  make sure to order extra rice for a dollar more! The food comes fast and it's a cute little place that makes awesome dishes! What more can you ask for? :)", "author": "Lynn D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "The food wasn't so bad.  But the service sucked .  They took forever to bring our food.  We went in after reading all the reviews about how much the service sucks thinking it's not  a big deal.  But it was pretty annoying when you are hungry and seeing waiter take food to all the other tables.", "author": "Ruzina A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-15", "description": "Until last night I would have given Lantern a 3 star rating but something didn't agree with me. For appetizers; my friend and I split the shrimp rolls and steamed dumplings and I had the Montague fried rice with chicken as my entree and drank Green Tea. \n\nThe food was really good but I had stomach pains from hell which awakened me from my sleep and regurgitated all that I ate. It was truly awful and I have no clue which item didn't agree with me and I wouldn't wish that on my worse enemy.\n\nMy friend has dined at Lantern on several occasions and has had no issues. I will say, dine at your own risk!", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "The food is really great here! You honestly don't need an appetizer (unless you're rely hungry) because my food legit came out 8 minutes later! Nice \u0026 quaint! Atmosphere is very quiet and dim lighting. It's your usually Thai restaurant. Service is good \u0026 speedy what more can you ask for?!", "author": "Taheefa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "My friend suggested Lantern so we went during lunch for their $9 special. Dumplings were okay, what made them stand out was the sauce they were served in. Chicken pad Thai was delicious and I was presently surprised that although it was lunch the portion didn't leave my hungry. Will come again.", "author": "N C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "Great food, Good drinks, and beautiful ambience!!!!! This place is amazing.The prices are insanely reasonable, especially the $9 lunch that includes an appetizer and entree. The food is very tasty and so are the Thai style drinks ! Service is very quick. Ambience setters like the exposed brick walls, tea lights , the Buddha sanctuary, and floor to ceiling drapery really make for a variety of occasions if you will. And it's 2 blocks from the Brooklyn promenade. Staff are very attentive and friendly. Manger is always around watching which I personally love. Enjoy!!", "author": "Laren E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "The best Thai restaurant i have experienced yet through all of Brooklyn....hands down! And this does not come from someone new to the cuisine but who has been eating it for 25+ years, experienced a range of qualities and styles across the country and who has probably tried ~20 Thai restaurants in the New York City area.\n\nMost are decent, few are outright bad, but even fewer are especially amazing...until i visited Lantern Thai. Truly amazing amazing food, a step above the rest.....great quality, freshness and flavor. And unlike many NYC Asian restaurants....these guys will really lay on the spice if you request it! After coming to this place with my wife once, we have since ordered from this restaurant once (if not twice) per week even though we are not even in their delivery service area (thanks Door Dash!)", "author": "HumbleRumbleNY C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "I debated between giving this place three stars or four stars. Reason being is although the food was pretty good, I was not amazed by it. When it comes to thai food I tend to get spring rolls and pineapple fried rice with cashews. It was pretty good. Not the best but everything was definitely fresh. \n\nThey have great lunch specials. I did not order off of the lunch special but my meal was not too bad. Spring rolls were 5 and my rice meal was about 10. The lunch special however is 10 dollars for a good sized portion and a small apetizer. Their portions are amazing (especially considering the price). I was not able to eat it all for lunch but I surely finished it the following day. \n\nThe place itself is small, nice and cozy but has enough space. The bar is a decent size as well. My food was served quickly and the service was good. \n\nI will definitely dine here again.", "author": "Amanda R."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}