{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "Why is this place getting bad reviews? :( I really liked it here. I came here about a year ago as a surprise dinner with a friend. The servers were attentive, but not obsessive. They were very helpful in pushing two tables together for us because we ordered a lot of food for us both. The environment is very sensual (lol?). It's very dark, but it's so pretty. It is decorated very nicely.\n\nThe food was really good here too. We had the papaya salad. I REALLYYYYY loved that appetizer. It was so good! We also had the pineapple fried rice, which is served in half a pineapple. That was good too! The roasted pineapple duck was ok. It was a bit bland in the curry and it was kinda fatty. It was pretty decent though. :) I was really full with all of this food! I was about to pass out at the restaurant due to food coma, but because I'm so food obsessed - I demanded dessert! lol When my friend said we would share a green tea ice cream, people should've seen my face with shock and perplexion then go back to a smile and \"ok!\" when I was really thinking, \"What is this guy thinking?! I want my OWN green tea ice cream!\" To say the least, the green tea ice cream was really good and I've tried a lot of green tea ice cream before. :)", "author": "Cheryl P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "One of the better thai restaurants in Brooklyn. Try the drunken noodles. The vegetable dumplings were a little too soft and sticky, so maybe pass on those. Service was great. Highly recommended! We will be back.", "author": "Despina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "This is one of my favorite Thai restaurants in Brooklyn Heights. Very affordable and great food! Fast service, restaurant is clean and friendly waitstaff.", "author": "Aisha J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-01", "description": "I love this place. it's not too expensive and the food is pretty great. \nFor dinner I have gotten:\n- Dumplings (average)\n- Mango salad -- very good\n- Prik chicken -- AMAZING\n\nFor brunch (american $8 w/drink) I have gotten: \n- French toast w/fruit -- delicious \n- Eggs Benedict -- average", "author": "Shwetha V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "Good food, quick service and big portions. And definitely one of the less expensive places in the area. Great combo :)", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "I have eaten here many times. I love the latern noddles and you can never go wrong with their cheap lunch special. However the last time I went there, I was served and as I started to eat I noticed a piece of medal in my food. Luckily, they took the meal off of my bill!", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-02", "description": "I just didn't think it was worth what I paid.\n\nThe food didn't look very tasty, what I ordered wasn't all that, and the waitstaff seemed like they really didn't care.\n\nBut, if you're in a hurry and you tell them that when you order, they will keep you on time.  Small concession in my book but worth mentioning.", "author": "Jinny S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-21", "description": "Usually I wouldn't give any stars for bad service....but this experience was ridiculous. I went with my wife to this restaurant after having recieved a $5 off coupon at my apartment. When they refused to honor it (apparently it was for take out only...not specified on the coupon) we, politely, told them that they really should or else they would loose our business (and that they should honor other peoples too!) They manager then came out, leaned over and told us to leave and never come back. \n\nI know you probably think there are two sides to this story....but really, we were not causing a scene or being rude. The way they behaved was totally uncalled for.", "author": "Darwin Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-29", "description": "Lantern is consistently good.  The service is usually warm and helpful.  You can't miss the Crab Rangoon. The staff is not always great about using the seating to the guests advantage but, if you ask, you may find yourself in a secluded, romantic, booth.", "author": "Natalie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "After a morning walk across the Brooklyn Bridge, we found ourselves  famished and on Montague St. After weighing the dining options around us, we were persuaded to try Lantern based on the their $8 lunch special. For $8 you get an appetizer and an entrée. I tried out the dumplings which have a nice spicy kick to them and the Pad See Ew.\n\nOverall, the ambiance was really cute, the food was good (not mind blowing, but good) and affordable. The service could use a little help. Bringing the drinks out before the food? Or perhaps offering refills?\n\nWe left full and happy and ready to make the journey back across the bridge.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "We came here with friends on a double date and we sat outside to eat. The seating wasn't really comfortable but it was gorgeous out that we didn't want to sit inside. The food here was really very good and I didn't feel contaminated after eating here. We started out with some apps which were pretty chintzy for the price but they were very fresh and good. We had the steamed veg dumplings, crab rangoons which were amazing along with the REAL apricot duck sauce and the curry puffs. The pastry of those puffs melted in my mouth. There was a little mix-up on the soups because I had ordered the house soup because it didn't have that it came with mushroom but it did and the actual broth itself tasted so strongly of mushroom I asked to send it back. They were so nice and made me the coconut soup without mushrooms and it was so delicious I have been craving it ever since. For dinner my hubs got the pineapple fried rice with shrimp (tails on so be careful) and it was really good, as good as anywhere. And I got the pad see ew with chicken. The chicken was lean and cooked nice. I would have liked a little bit more sauce on this dish but the portion of the two dinners were pretty generous. I sipped on a mai tai which was strong but good and he had a tap beer. All in all for all that our bill was about $85 but we did splurge a little on the apps. I would be willing to go back just for the coconut soup (sorry I don't know what the actual name was but they only had 3 soups).", "author": "Heather L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "We only had dessert here, so I can't speak of the dinner menu.  The service wasn't bad, and it's a fairly quiet place, so I'm rounding up to three stars, which I would give 2.5.  It is quite rare for me not to finish a dessert.  We even asked the waitress for a recommendation: The Warm Chocolatier (3 stars) and the Green Tea Cheesecake (2 stars).  Honestly, you could do better with most desserts at any supermarket.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "*Warning: I am a vegetarian\n\nI had to take care of some business in Brooklyn Heights, after which my friend recommended that we stop by this \"amazing\" Thai place. \n\nI am not a huge Thai food fan, but I obliged. \n\nIt was a pretty day, so we sat outside. In terms of decor -- this place is really pretty inside. \n\nFood - I ordered the veg. dumplings and virgin rolls and veg. fried rice. The dumplings were REALLY tasty. The virgin rolls were disgusting...and the rice was okay. My friend, on the other hand, ordered Coconut Shrimp and a Mango Salad. He loved both. \nDessert - I ordered the Banana Lampai. OMGGGGG I loved it! (2 Stars for JUST the dessert) \n\nService - It was okay. I don't remember the waiter saying one word tho. But, I got my water and everything else on time and right.", "author": "Arshbir W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-02", "description": "BEWARE the shrimp and broccoli with garlic sauce! This joint RUINED my new year's 2012 with food poisoning after eating there December 30 for dinner. Sick for 48 hours. Never ever again.", "author": "Chuck T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "A beautiful blend of quality service, atmosphere, and above all food.  The wait staff are super attentive without being annoying. The atmosphere is chic yet rustic and very inviting.  The food was nicely presented and absolutely delicious.  Prices were very reasonable considering the quality.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "Not sure why the overall rating is so low for Lantern because the food is pretty darn good. This is by far the best thai food I've had in Brooklyn. The lunch specials (Appetizer + Entree) are tasty and well portioned.  My favorite dishes are the Pad See Ew (soy sauce noodle) and Pad Kee Mao (gravy noodles).", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-21", "description": "I am really patting myself on the back here for being a non-grudge-holder, as the last time I tried to order delivery from Lantern they were all, \"we're too busy tonight to deliver to DUMBO\" and I'm all, \"it's like a 2-second bike ride DOWNHILL\" but they would not be swayed, and I ended up ordering from Rice, which I like less and less each time I eat it.  \n\nI was angry and sad and swore I'd boycott Lantern, but the reality is that they're the only Thai I like that delivers to my apt, and oh, I just can't stay mad long.  It's not how I roll.  \n\nSo tonight apparently things were a little bit slower because they had no problem crossing the BK Heights/DUMBO divide.  I'd ordered summer rolls and Rama chicken, which get one star and four point two stars respectively.  Normally I like summer rolls very much, but these...Did.  Not.  Like.  They were like 80% lettuce and the dipping sauce wasn't sweet like it's supposed to be.  Or at least how I want it to be.\n\nRama chicken would have gotten 5 stars except that it was cold when it arrived, and yes it's about negative 42 degrees outside, but still.  Get one of those insulated cases the pizza guys get, ok?  The technology exists not to have this problem.  Once I'd re-heated it, though, YOWSA!  That is some tasty peanut sauce, and tasty chicken and spinach swimming in peanut sauce.  Could not stop shoveling into mouth.   \n\nSo Lantern,  consider yourself on probation.  Nice work on the Rama.  Please learn to make better summer rolls, though, and don't ever pull that too-busy-to-deliver-to-DUMBO bullshit again, ok?  xoxo", "author": "Becca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-05", "description": "This place was quite a disappointment. We had the virgin rolls and crispy spring rolls as appetizers which were good. but that's about the only positive thing I have to say.\n\nWe sat outside for dinner, our waiter came to take our order about 2  minutes after seating, which was great, because we were starving. BUT.. when we asked him a question about an item on the menu he couldn't answer, he left to find us an answer and disappeared for 20 minutes without finishing our order. I had to physically get up and find a waiter to tell him that we were ready to order, and then it took another 5-6 minutes for another waiter to come out. \n\nWe ordered pad thai and green curry chicken with rice. The worst pad thai EVER. It was served in a flavorless crepe, which was really strange. The green curry was nothing special, and did not taste like any other green curry I've ever had, in fact, the curry and pad thai tasted pretty much exactly the same. And neither tasted like what they were supposed to be. The thai tea was not topped with cream, way too sugary and pretty gross.\n\nBad Food, Bad Service. Never coming here again.", "author": "Helen Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Awesome food, big servings and extremely cute and relaxed ambiance. Only downside is that they weren't playing any background music, maybe because it was a Sunday night? But their pad thai is seriously delicious!!", "author": "Anum A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-11", "description": "You have to try this place and have these 3 things:\n\n1. Cheese and Crab Rangoon\n2. Pad Thai ( I love beef, and chicken) (my friend likes the shrimp)\n3. Crispy Duck (easy on the onions, unless you love onions)\n\nGood staff.  Really good staff.  Nice atmosphere, decor is really pretty and clean everything, so if you want a 'Date Spot' look no further, this is it!", "author": "Elle J."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}