{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-27", "description": "Had dinner outdoor with bf after work... was greeted at the door and was led to a table outside... quick service with the water/drinks... bf had the Great Siam Sangria - lots of fresh fruits and great amount of sweet/alcohol... while I had the Phuket Sunrise and was just as good with a great balance of tartness/sweetness/alcohol... for appetizer... we had the Thai Shumai... it was ok... and \"the daily special\" roti with special sauce... it was from a supermarket frozen packaged roti (I know... I bought it and made it once myself!!!  taste EXACTLY the same but cost me only $1.99 as compare to $6)  bf had the Thai Garden Salad... it had slices of fried tofu, fresh crisp mix greens and a great peanut sauce... I had the Tom Yum... had better... lack flavor... but it does have a nice kick!  For entree... bf had the Pad Thai... tasted pretty good... nice flavor, noodles are the right texture.... I had the \"daily special\" grilled sea bass with shrimp paste garlic sauce with asparagus... it was tasty!  The fish was moist, perfectly cooked along with the asparagus... the portion was enough for another meal!   We were being ridiculous and had dessert!!!!  I had the mango with sticky rice... it was at the right consistency, the texture of the rice was perfect, it wasn't overly sweet.... bf had the banana lampai... it was definitely more tasty than mine... which I ended up having his :-)  \nOverall... we will go back, though it is a little over priced and there are some misses... but it does serve it's purpose when the \"Thai craving\" hits!", "author": "N C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-03", "description": "I'll keep it simple.  I had a taste for pad thai on New Years Day.  We went to Lantern, planning on getting take out, bringing it back to the apartment ourselves so it was as fresh as possible while lounging in front of the TV.  We ordered a tom yum lemongrass and a tom kha coconut soup, some chicken sa-tae, and the special of the day, the seafood pad thai.  The food came, and we walked the less than five minute walk to the apartment.  Amazingly the food was just not as hot as it should have been; should have been a tip off, because for dessert, we both got what could only be described as food poisoning, and all the horrible bodily functions that come with it. It hit her first, then me: multiple painful lavatory visits (I'm doing my best not to be angrily graphic).  24 hours of misery.  An isolated incident?  Perhaps; it looks like Lantern does a decent business.  But I'm not going back.  Ever.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "I was pleasantly surprised by the food on a recent weekend for a late lunch / early dinner. I started with a spring roll and wound up ordering a second appetizer of it. For my main dish, I had pad thai and it was also tasty.", "author": "jjj z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "Great place for a lunch deal.  Red Curry w/Veg + Ginger Miso Salad was great.  Will be returning on the next visit to the neighborhood", "author": "Josh S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "Inconsistent. Lantern is basically a hit or a miss. Attentive waiters but the food...meh!", "author": "Yoshi W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-19", "description": "I went to Lantern for takeout, which I paid for with a Lantern gift certificate. The cost of the food I ordered was less than the value of the certificate. A staff member asked me to order more food to be sure the takeout total equaled or exceeded the certificate amount. The server said they would not give me cash change. I protested, asking if they could instead issue a new gift certificate for the difference. Again, the server said no. Instead, I had to order much more food than I needed, and had to pay a few dollars out of pocket. I won't be going back.", "author": "Mitch i."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-25", "description": "My first Thai restaurant i have ever been to.  I am now addicted.  Kee mao, pad thai and pad se eww are amazing. Desserts are great as well.  I frequent this place often!", "author": "Steve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "solid thai food in area...fast delivery.  good prices...lunch portion smaller than other nearby thai places though", "author": "Jigar S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "yummy cocktails, street side seating perfect for people watching, and managable portion that won't leave you feeling grossly obese after dinner.", "author": "Jonathan Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "Have only eaten in-house once, so this is mostly a delivery rating... but their Fried Rice with Duck is incredible and I've been eating it about 2X/week for a couple of months. The delivery generally arrives in 15 minutes (I live about 6 blocks away) and the food is always hot.", "author": "Erik J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-22", "description": "I love it here.  Great food and they serve super fast.  The bathrooms are cute and the wait staff are very nice.  Mmm love the Honey Duck, and their desserts? Delicious! Prices are moderate too. Definitely great for a date.", "author": "Sean G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "Nice atmosphere, good food, reasonable prices.  Their roasted duck and avocado hand roll special appetizer was excellent, as was the Pad See Ew. Service was just alright (they brought our food to the wrong table, and then brought us a dessert menu after we already had our check) -- overall very good experience and would go back.", "author": "Greg L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}