{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-03", "description": "The food today was not as good as in the past.  The tofu was tougher than I've ever had before. The rest of my dish was delicious which was basil and rice sadly the tofu messed it up for me.", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Came here for the $9 lunch special, and left satisfied. It's a very busy place but the food comes out rather quickly. Waitstaff is decent, but be vocal and get their attention, so you don't become forgotten.\n\nGood:\n-Lunch menu for the win!\n-Spring Rolls (four come in an order)\n-Chicken \u0026 Shrimp Fritters\n-Pork chops (good!)\n-Kee Mao (Drunken Noodle) must try!\n-If you show up during lunch with a party of 2, you can get seating rather quickly\n\nBad:\n-I know it's part of the lunch special, but I found the Fritters serving size to be smaller than small\n-during the lunch rush if you don't grab a waiter's attention it will be awhile before someone takes your order, or gets your check for you", "author": "Daniel J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "Good quality Thai food for average price. Good spot for dinner with a loved one or a friend. \nCurries are exquisite served with whole peanuts and my friend loves her favorite pad Thai at this spot. :)", "author": "Natalia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "Can't wait to go back here, haven't been in since last summer but the place is super laid back and relaxed especially when sitting outside unlike other places where everyone is always smoking near your food, you might experience a bit of a language barrier but it's nothing you can't handle.", "author": "Jahsid M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "Great food.  Fast service.  Never have to wait for your food when your seated there...  Only bad experience Ive had was ordering out for calamari... Not a great idea...  But lunch special always saves the day in a rush... Drinks are great too", "author": "Elissa J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-09", "description": "Ordered delivery. Food came within 40 minutes. Ordered pad see ew \u0026 sticky rice. The pad see ew was more than advertised on the menu that I gave but not by much. I took a bite from the sticky rice, which tasted like mop water. Took it out of the Saran Wrap, opened my pad see ew and saw mostly Chinese broccoli. I ordered it plain but I didn't think that meant no sauce. The whole dish is dry with no sauce. I just asked not to have any meat since the texture of the chicken in every pad see ew I've tried tends to be this weird shredded texture that I dislike. Waste of $16. Guess that's what happens when you order during a snow storm. I'm good with not ordering from this spot again.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Great food, and ambiance. \n\nThe eggplant basil fried rice was amazing, and get the salad for the appetizer!\n\nLunch specials are a steal!", "author": "Blake L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "A really nice restaurant, the ambiance it's surprisingly charming for the area.\nI've been a costumer for years and never been disappointed.\nThe food it's good, I was really impressed with the brunch  overall (and I am not a brunch person).\n\nAlso I love their lunch specials.\n\nthe best part are the cocktails, fruity and delicious.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "This place is nicely set up. The wooden tables really complements the decors in this place. It is a small place so seating is hard to find and people are rushed so they can appease to the next waiting party.\n\nI had the $9 lunch special. My choice of appetizers was the vegetable spring roll which was presented and served nicely in duck sauce. the main entree I got was the Drunken Noodle with Shrimp. The meal was not over powering hot and spicy, which makes this meal actually flavorful and appealing with a hint of spicy. I also recommend the Thai Ice Tea.\n\nYes, I would come back again.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "This is probably my favorite Thai restaurant, probably because it's the first one I've ever went to lol! I've been here a dozen times and they never disappoint. The dish I typically get is the spicy basil fried rice with Thai iced tea. Botha re really delicious. The rice isn't too spicy but it definetly had a kick that you taste. The Thai iced tea is also very good, nice strong taste with enough sweetness to make the drink taste amazing. I also had the fried calamari as an appetizer and this was very good as well. It is served with a sweet plum sauce, which is a very different taste between the typical Italian marinara sauce,but the constrast between the sweet sauce and savory calamari is quite satisfying.\n\nThe customer service is also very nice and the waiters constantly ask if you are okay with your meal. I also like that it is quite affordable.\n\nI def recommend and this Thai place will always be close to my heart :)))", "author": "Brianna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "My favorite Thai restaurant. I've come here about 3 times with different people. All people I convinced to try Thai. They all loved it. \n\nThe place is a bit small but yet have a nice ambiance. The location is perfect because there's a lot to do in that area. After dinning here take a walk down to the Promenade for a little site seeing. The views of the Brookyln Bridge and the city (at night) is really wonderful. \n\nThe wait staff here is really friendly. During the summer it gets busy especially because there's a seating area outside. My favorite thing on the menu is the duck and pineapple fried rice. It's served in a pineapple...super yummy!! \n\nMy friend had the crispy duck and sweet mama it was delicious. I swear for a second it was bacon. Lol. It was crispy and had a kick of spice. \n\nCan't wait to go back.", "author": "Tasheena S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-09", "description": "**This is NOT a Food Review!**\nunfortunately we did not even get a chance to try the food.\n\nWish I had the chance to speak to the manager face to face but my guy and I unanimously got up and walked out. We only spoke to what looked like the hostess but I definitely wish a manager was present. \n\nCame in on a Friday night on a whim after watching the movie IT. Shouts out to Bill Skarsgard. Lol\n\nThe restaurant was fairly full, but there were empty seats. We were sorta hungry and craved something in the neighborhood. We were seated and water was instantly brought out. We looked at the menu, had questions and was really excited about eating Thai food. Since my guy is allergic to all nuts, this would have been an interesting venture. The hostess kept looking at me cause I would look at him every time he passed by. We sat there making small talk about the menu and an upcoming trip. But,  in the back of my mind I'm asking where's our server. \n\nA strong 10 mins passed by and we were still sitting there. No server came to take our orders or field questions. However a couple who's of...might I add, \"Caucasian persuasion\"... listen...They were white alright. And was seated right next to us. The same hostess came with a haste just as he did us, and poured their water. \nBut what followed was extremely peculiar.\n\nLow and behold a server showed up! This was like seeing a damn unicorn! But no he didn't show up at our table. He showed up and the white couples table. After we done sat there waiting for someone to take our order! I did a double take at my guy and both got up like synchronized swimmers and walked out of that restaurant. \nI shall never returned to place where me or my money isn't respected. \n\nAnd for those who may say. Ooh you're pulling the race card or they simply just forgot.... Uh yeah, about the only few black folks that were in the restaurant from jump? Go eat a dumpling with that thought. No matter how you look at it, it was sketchy and I would have been uncomfortable sitting at a restaurant feeling like a second class citizen even if the same server showed up after they took the other couples' order.", "author": "Kheeda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "I love the location of this place, the food was typical Thai food, it was good just the place gets a little crowded during dinner time so I suggest coming during lunch, plus you get the lunch specials!", "author": "Pooja T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-21", "description": "The service at Lantern was extremely rushed. A friend and I had dinner there on a quiet Monday night. Plenty of tables were available. Yet, we were seated, the menus were handed to us, and literally before we had a chance to open them, a server asked us, \"Are you ready?\" Ready for what - drinks? No, she meant to order our meal. And she seemed surprised when we said that we were not...We were asked if we were ready twice more before we had actually decided what we wanted to eat. This overzealous attitude seemed unnecessary particularly on such a quiet, winter weeknight. \n\nThe food came out quickly and was very good. Both the pad thai and the marinated chicken (served with sticky rice and papaya salad) were delicious. The portions were massive and prices reasonable! Next time, though, I would order in rather than dealing with the overly aggressive staff.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "I've been wanting to come here for a while, and I finally went yesterday. I had the Chicken and Shrimp fritters, which were amazing (and not at all eggy like a lot of fritters can be). They came in a tangy tamarind sauce. I got the Spicy Basil Fried Rice w/tofu as my entree. It was perfect. The tofu was nicely cooked, not too soft. \n\nTo drink, I had the Thai mojito, which is basically a lychee mojito. It was strong and well-made. I need to come back here a few more times to explore the menu further.", "author": "Sonjay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "I've been coming here for years.  Great spot for lunch or dinner. The Shrimp Thai Fried Rice and Garlic Fish is excellent.  The venue is authentic and relaxing. I recommend you try it out.  Cheers!", "author": "Magda A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "Hands down.. the best Thai food around!! Always satisfying, haven't had a dish that I didn't like from here. Restaurant is clean and comfortable and I have been coming here for 9 years now. I would have given 5 stars but I think it's pretty bad when the manager doesn't know his frequent customers. After all the Lantern has been a huge part of special moments in my life llike birthdays and even wedding engagement!!", "author": "Latoya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "I'm not sure why this place doesn't have 5 stars. Not to detract from other customers' experiences, but I have found myself comfortable at Lantern each and every time.\n\nLet me preface this by saying I would never pay full price for any of the items on this menu. But at lunch time, for $9, you can get an appetizer and an entree.\n\nFor $9..this place will continue to get my business.\n\nI also had a vodka martini here (once) and it was strong and well-made.", "author": "Cristina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Such a Cute date spot. The food is always delicious. And their lunch specials come with a free appetizer. Cant beat that.", "author": "June P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "Not a huge fan of Thai food, but Lantern was spectacular! I ordered the chicken pad Thai and it was AMAZING. They serve the egg in the platter in a unique way. It is prepared in almost a omelette style with the chicken and noodles under the egg.\n\nThe customer service was good. Could have been a little better with checking in on us more often. Other than that, I will definitely be coming back. I hear they have a great lunch special!", "author": "Jourdan L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}