{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-04", "description": "This is the only thai place that i know of in BK heights.  Im sure there are more of them but I just havent walked past one yet, so ill just assume, probably incorrectly, that it is.  This is just a standard thai place.  Nothing special, not too great, not too bad.  Middle of the road, you know what you are getting lunch.  The lunch special comes with an appetizer, which could be a soup or fried spring rolls which I got.  I usually go with my favorite default Chicken Cashew nut which tasted the same as every other average spot.  Lunch was 10 bucks after tax and tip so when im craving some thai food for lunch, ill probably be back if im in the mood...or I happen to walked past a new one.", "author": "Nathan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-21", "description": "wow. I cannot believe how many bad reviews there are! We had an amazingly delicious meal at Lantern tonite. Granted, the service was pretty horrible. But, fuck 'em, we left a measly 10% tip. In general, I was really surprised how good it was. Everything was a warm bath of perfect flavor \u0026 spice. The atmosphere was perfect, aside from the hunk of wood that broke off my chair. \n\nBut still, the food was great! We got the Birds Nest thingie \u0026 the Kee Mao. Kee Mao being the Thai test entree. A standard that if you f up, you don't get a 2nd chance. But it killed. The Birds Nest was a massively solid nest of noodles, swimming in a delicious sauce. \n\nWow, what restaurant did we go to?", "author": "mike l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-31", "description": "I got the shrimp Tom Yum soup, and beef Pad Se We.  \n\nThe Tom Yum soup was alright, the soup could've been seasoned better.  Personally, I would've liked it if it had more lemongrass in it, but it was still decent.  \n\nThe Pad Se we was decent, also.  The beef could've been seasoned better, and overall dish would've been better had then been a bit more sauce and seasoning.  \n\nOverall, it was decent.  I'll probably be doing delivery again since it's the only Thai place in the area.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-20", "description": "I want to start this review by stating that I order from Lantern at least 1 time per week for the past 6 months you might be wondering why I only gave this place 1 star if I always order from them. They have got my order wrong at least 5 * but nothing takes the cake of last night when I ordered from them and 42 minutes went by I called to ask where my delivery was and they said it was on its way the delivery guy has already left. After 1 and a half hours went by I called very upset asking where my order was the woman said they had lost my order obviously I was very upset and said to her but you said 40 minutes ago that my order was on its way why did you lie she then apologized and said they had lost my order and they would remake my order. I then ask her if I was going to get a discount and she had the nerve to say no why would I think I should get something off. What a joke, I will never order from this place ever ever ever ever ever again exclamation exclamation exclamation", "author": "Mark K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "I went here for a quick dinner for my birthday with my mother and daughter. The place is very trendy, food was great and the service was excellent. I did not have a drink, but my mother did and she said the drinks was not watered down like most. To add on, I mentioned that this is the best meal I had in a long time for a birthday and upon the return of my party from the restroom, the whole staff and  fellow diners sang and played a nice version of Happy Birthday. I honestly, thought the place was to trendy to do something like that and was not expecting it either(I cried). Nevertheless, I had a blast, the food was yummy(even the new stuff I tried) and I will return again.", "author": "N S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-05", "description": "Went here with a group of friends for a b-day.... It's definitely not an authentic place - I ordered the chicken pad thai which was not bad, although the interesting thing about it was that they covered the plate witha crepe... Service was not very good - the waiters were somewhat rude.  On a positive note - they do have a variety of asian beers - singha, tsing tao, saporro...", "author": "Dew P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-27", "description": "I actually didn't have horrible service here, but it could have been more attentive and just well, as if they weren't sleepwalking. Maybe the bussers should be the waiters for a bit considering they always haul ass a lot more than the the rest of the staff. \n\nI didn't care much for the pad thai here, it kind of felt obnoxious to eat, I'm not sure why. but I enjoyed the crab dumplings for the appetizer it was creamy and maybe could have used a bit more flavor, a little salt would have gone a long way. My pad see ew was ok; I feel like a lot of places really end up with dry and not so tasty noodles, which could be from the dish sitting somewhere for too long. I think I'd rather get a drink here than anything else; sit by the small bar or outside and feel the bit of breeze and feel I guess \"cool\" because I'm at a Thai place. The long table of meet your neighbors deal isn't really that fun; I feel like the only place that should happen are at pubs and beer gardens. When drinking is involved. \n\nThe other anecdote is that I really had to do the 2 and there was only one bathroom operating. I get very nervous because I feel bad that I'm taking up so many minutes. And when I get apprehensive, I bottle the \"emotions\" in. Until next bathroom.\n\nOther than the table, I do enjoy the decor, although I'm not sure how pleasant it really feels along the quaint nature of Montague, it's a bit less inviting, but that's probably why I'd rather just drink, after a few martinis I wouldn't care about the lit waterfalls.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "I come to Lantern whenever I am downtown for work. The neighborhood is nice, it's Brooklyn Heights and it's relatively close to Banana Republic, retailers and banks :-) The food, is yummy \u0026 savory and the lunch special is reasonably priced at about $8.00. EACH and every time I go to Lantern I order the same thing ~ Chicken/Green Curry! OMG, it's so good. It comes with an appetizer and a small bowl of white rice. I hate that the rice is never enough for the curry broth but I guess it's a \"single\" portion so it will have to do. I get the spring rolls for an appetizer and I love the tangy dipping sauce that they rest the rolls on.  \n~ The atmosphere inside is pretty decent. There is a small bar in the front. There is indoor and outdoor seating available. It's quaint and dimly lit on the interior as they have candle lighting \u0026 lanterns throughout. I think it can be pretty romantic depending on where you are seated. I have had many romantic lunches there with myself LOL.  The food service is pretty quick, once they take your order. \n\nMy only complaint is that sometimes the food can be to salty, but I have sent the food back, and they have corrected problems. Have fun!", "author": "Rica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "We (2 of us) stopped in here and had the $9 lunch special. We actually got three dishes and could have gone with two. Good quality food (great to have some vegetables in a meal :-); service was not great but not that surprised...", "author": "Mark T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-29", "description": "The service could be a little better but as for the food this place gets 5 stars. I recommend the pad see eww with shrimp. It has the right blend of spices and is spicy enough to keep my mouth watering.", "author": "Ashli M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-17", "description": "I went back here, again, after having an amazing experience the first time, and ordering takeout a few times after that.  I'm not sure what it is, but it's not the same as my first meal there.  The food looks the same, but something is missing.  I felt bloated and unsatisfied after my last visit.  I was pretty annoyed that I spent $55 on a meal, and still had to go get a bacon burger from Five Guys down the street...don't plan on going back.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "The food is decent, i go during the day time when it is not crowded \n\nThe staff can be a bit more attentive and to the customer, \n\nthe atmosphere is nice and relaxing\n\nThe drinks are just OK nothing special.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Finally tried this place after walking by it a million times. The pad seiw was good but the masaman curry was severly lacking in flavor. The inside was nice enough, but you can't eat that. Staff was friendly, but with so many Thai options in the neighborhood (Joya, ghang Thai, sesame), it will be hard to justify coming back to lantern.", "author": "Max M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-06", "description": "I too believe that I got food poisoning from the noodles in this restaurant.  This was my 8 or 9th meal from this restaurant and I am completely turned off by the vile slop that I was served.  Been to the Dr. since and......I'm sick for 6 days now. I will never return.", "author": "UC C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "They got our drunken noodle just right, and the lychee teas were delicious. Eating outside in warm weather is a joy with the nice street view, though the table was a bit rickety, and the service was prompt and friendly.\n\nThe decor was unique and I needed to ask where the bathroom was, but otherwise, definitely would go back.", "author": "Adam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "Montague Fried rice (with Chicken)  were really good. Safe bet.. Go for it...", "author": "Atampreet S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Great place, excellent service. Love their cocktails, pretty good for a Thai place. Green curry is tasty. Pad Thai is good too. Some dishes, however, are way too sweet--stay away from potato curry. I could hardly eat it--it had so much sugar! Please stop with the sugar! Otherwise nice place.", "author": "Pat P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "Yesterday me and my fiance went here to eat on a romantic date. They had nice candle light and the food was good. It was filling and I had beef pineapple fried rice,Vegetable dumplings and cranberry juice. They also make the beverages  look alcoholic. The service was great, they were quick and clean. We were so stuffed that when we got up we felt it and couldn't hardly walk, we walked to the promenade to sit down, but then it made us sleepy. Yes that's how good it was.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-12", "description": "Lantern is truly underestimated and serves consistent, tasty food (and not oily like others), a unique find among the bland, overprice offerings on Montague St. My boyfriend and I are big fans of the pad see ew, pad thai, papaya salad, crispy duck rolls, Thai iced tea, and cocktails.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-13", "description": "Went on Saturday night, since we had two hours to kill before the movie started. Service was extremely fast, we got our orders instantaneously. The waiters were very attentive. I ordered the shumai as an appetizer, it lacked flavor.  The shrimp pad Thai made up for it. Not the best Thai food, but it will do.", "author": "Christie T."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}