{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-08", "description": "This is a pretty solid local thai option. Cute decor and the take out is very fast.\n\nI usually get the Kee Mao (drunken noodles) which are the broad flat noodles sauteed with basil, chili, tomato, and eggs with your choice of protein. It satisfies every time. \n\nThe portions here are generally sufficient for two as well so you can totally order an appetizer or green papaya salad and share a main.\n\nI'd stay away from anything fried unless you are dining in though, the items don't travel well and usually lose their crisp by the time they get home. No surprise there.", "author": "dave m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-01", "description": "The Grade: F\n\nHere's the problem with Lantern: It's one of SEVEN generic Asian places (Thai, Chinese, Japanese or \"fusion\") on a two block stretch of Montague Street and they all serve nothing better than below-par takeout food and $6 lunch specials. Ugh. \n\nIt's a shame because the neighborhood desperately needs good restaurants and these places -- Lantern, Tenda, Andy's, etc. -- are occupying valuable restaurant spaces that could be put to better use. \n\nWhy should I have to walk to Smith Street for a decent meal? Because of these greasy Asian takeout joints, that's why. \n\nFellow citizens, do us all a favor and avoid the Montague Street fried rice palaces like the plague so a decent restaurant -- just one, please!! -- can finally arrive on Montague Street. \n\nOh... and do you still want good Thai food? Cross Atlantic Av and visit Joya on Court Street. They also deliver deep into the Heights.", "author": "O U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "If you find yourself in Brooklyn Heights and looking for lunch options, your choices can be pretty limited. I was happy to discover this place the other day after trying several so-so places. With that in mind, my rating might be a little skewed - as taken, in part, in comparison with other establishments.\n\nThe place itself is tiny but warmly decorated - and aptly so with lanterns hanging within.  It's just a block from the Promenade, too, which is nice. And there is some outdoor seating available. Service is not rushed, although a bit slow. \n\nThe food is pretty good and flavorful. For an $8 lunch special, I really could not complain. I got the drunken noodles and was happy with the dish. It wasn't overly spicy but it was good with wide egg noodles, basil, etc. And the shumai was pretty good too - not mind-blowing, but not half bad. I was also happy when I sampled a friend's pad thai at how they managed to pull off the standard dish.\n\nYou can be sure that there are better Thai places in NYC but Brooklyn Heights, I think this place is a safe bet.", "author": "Julia L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-09", "description": "Food was great and everything.  The bill was 20.00 and we gave her a 3.00 tip (typical 15%), however the waitress was extremely rude and said the tip was not enough. Such a tacky place that I will not go back there next time.", "author": "Roy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-26", "description": "I have monthly Thai cravings (which somehow has turned into a biweekly thing) so I would say that I go for it pretty often. I came in on a Friday night after my workout. My friend and I thought the place was pretty convenient since it was only a block down from where my studio was and from the pictures via Yelp, it looked pretty cozy. Upon entering, the place was nice and dim, candles on every table. I was thinking to myself, WHAT A GREAT DATE SPOT THIS PLACE WOULD BE! After a quick menu scan, I decided to go with my all time favorite pad see ew and my friend had their drunken man noodles. We also shared a fried calamari as an appetizer. I was not a huge fan of the calamari breading, a little too hard on the outside, a total overkill for the chewy inside. It was not a good balance for my mouth, maybe if they didn't over-fry it? The entrees are huge portion wise, but don't let the portions fool you! TASTE WISE, super bland. My biggest pet peeve at Thai places are when their food is bland. C'MON FOLKS, don't skimp on your spices!! I couldn't quite tell if I was eating bites of beef chow fun or pad see ew. If it weren't for the hot sauce I asked for, I probably wouldn't have tasted anything. I tried the drunken man noodles as well, and although slightly more flavorful, it was not the drunken man noodle I was use to. My mouth is suppose to explode with flavor right? NOT HERE! You're better off going to Joya or some other Thai place in the area!", "author": "Bonnie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-19", "description": "so, i knew that mama o was going to be in town this week, but for some godforsaken reason, i failed to note that she'd be in saturday night ... and not to sound TOO 90201 about it, but i was a bit bummed because my friend was throwing a party that i'd been looking forward to for the past week. ALSO, after working 21321321 hours + doing saturday morning consumer research in the dirty jerz, i was looking for SOME kind of social outlet that weekend ... that didn't involve early-bird specials and multiple church visits. uh huh, i get it - imma brat. \n\nanywho, after picking up mama o from LGA, we quickly stashed her stuff in hermano's apartment (hallelujah! better him than me!) and decided to go to latern for some quick, albeit nice grub. \n\nright as the appies - chicken/shrimp shumai and coconut shrimp (kinda blah) - come to the table, mama o gets this really excited look on her face, pulls something rectangular out of her bag and hands me a book entitled, \"the ABCs of choosing a good husband\" all while saying, \"i really hope you enjoy this, aimee.\" \n\nshe looked so damn proud of herself, i couldn't even muster up the strength to offer-up some kinda sarcastic retort - SO UNLIKE ME. all i could stutter was, \"gee, ma ... thanks\" whereas hermano looked like he about to choke on a dumpling. \n\nthe rest of dinner was pretty uneventful, much like the food itself, with mama o grilling me about my job (yes, we eat lunch at our desks), my love life (no, no - that gay man you met was NOT my boyfriend) and my apartment (yes, i REALLY live alone and yes, there are other people on the street when i walk home from the subway). there was green curry (didn't try it, but it was veggie-filled), shrimp with asparagus (meh) and my massaman seafood (the best of the bunch). although there was more than enough, we stayed true to our yellow roots and just ate the meat. no need - or want - to bring doggie bags home. \n\nand there goes a rockin' saturday night. jealy?\n\non a side note, i did crack into my new hubby-finding guide and, apparently, i do everything wrong ... as in WRRRROOONNNG. at least that's what my super-duper christian friend, steve woods, says.", "author": "Aimee O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "I kept hearing about this place and happened to stumble upon it leaving the cinema last night. The menu was robust and the food was delicious. Service and atmosphere both admirable as well. Great drink menu and good for friends or date night. I'll be back.", "author": "Alessandra Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "My husband found this place when we first moved to Brooklyn. We're simple Thai food eaters and love our pad see ew and pad thai. We love the noodles here! You'd be surprised how often some places mess this up. We now regularly call them for delivery, and they are super fast. They're usually arrive within 20 minutes of me calling! Love the noodles and the quick delivery service.", "author": "Cathy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-08", "description": "Went for a late dinner, very relaxing/ romantic atmosphere. Spring rolls with plum sauce are yummy! Spicy basil fried rice with chicken was super good! Even the white zinfandel was delish! Will definitely return.", "author": "Ebony T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-02", "description": "Went on a Saturday night at around 6:30. Not crowded and very surprised at the casual but classy feel to the place. \n\n Ok, so I am originally for Honolulu where we have AMAZING Thai food.  I am not an expert but I do know what I like. Anyone going to Honolulu has to try Keo's Thai and compare!!\n\n Lantern was pretty good.  Flavorful dishes. Did family style of the Pad Thai, Drunken noodles and Green curry.\n\nSometimes with Thai food although ordering different dishes it can end up tasting very similiar.  Each of the dishes had its own unique flavor.  That was a plus!\n\n We wished the rice serving was a bigger portion! That's one of the best parts! White rice with the sauce! When ordering more rice they charged an extra $2.00!!  \n\nAt least I have another option other than Joya for Thai in this area!", "author": "Michele W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-28", "description": "My friend and I had spring rolls and vegetable dumplings as appetizers.  Both were tasty.  I got the drunken noodles, which weren't bad.  My friend didn't like her pad thai, but I thought it was pretty decent.  Thai mojito was pretty good. \n\nTheir service kinda sucked.  The waitresses were kinda bitchy and kept returning to our table what felt like every minute to try to take our order.  Give me a few minutes, damn....\n\nDecor is pretty nice inside.  We sat outside on a warm day, which was nice.", "author": "Lena P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "Lantern is a great place.  I often come here for lunch and sometimes for dinner.  The lunch special prices are amazing.  For just 9 dollars, you receive an appetizer and an entree.  I always get the same thing for lunch as well and every time, it tastes great.  The shumai and the pad kee mao are delicious.  Also, the service is quick, even when it gets pretty crowded during lunch time.  Take-out is also quick.  Lastly, the decor inside the restaurant is very nice.  In all honesty, one of the few thai restaurants in the area that I can trust to have a great meal in every time I go.", "author": "Zachary D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Really cute Thai kitchen in the heart of Brooklyn Heights. Lunch special comes with an appetizer and entree for $8. Not bad. Not bad at all.\n\nFriend and I sampled spring rolls and chicken shrimp fritters for our appetizer. I wasn't crazy about the fritters. We each had a fried rice dish for our entree - I had shrimp (delectable!), she had chicken.\n\nNoms.", "author": "Felicia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-29", "description": "I am not downgrading because of the food, the food continues to be decent even though I always get Chicken Pad Thai (real adventurous).  I am downgrading because of the obsessive service.  I like good service and I feel I deserve it, or at least someone does.  I hate inattentive service, it drives me insane.  Between good service and inattentive service lies OBSESSION.\n\nWe sat down and within twenty seconds (no exaggeration), the waitress asked if we were ready.  Um, no, the menu has not even moved an inch.  Thirty more seconds pass, \"You want a drink?\"  Uh, yes, but it has been less than a minute I am still putting my jacket over the chair.\n\nDrinks come, waitress hovers.  We quickly decide on our order for fear we were being mildly stalked.  Food comes in like five minutes which normally is appreciated, but not when you have only been in the restaurant for 10 minutes.  I feel like there should have been a bus load of tourists waiting to take over the restaurant, but there wasn't.\n\nYES, everything is OK, I promise.  Please give me five minutes of uninterrupted conversation.  Food portion is complete, dessert menu appears within seconds as if it was hiding under the plate.  The place was not full, why are you in such a rush Ms. Waitress Lady?\n\nNext thing I know I am paying and then I am given two credit cards to sign, neither of which belonged to me.  And finally, the excessive speed of work fails and results in a distraction of small proportion.  They brought the correct card and I am sure we were out of this place in under an hour, but it felt like twenty minutes due to the pressure.\n\nThe only thing the waitress could have done to speed it along even more would have been to stand behind me and whisper subliminal messages like, \"You want to eat faster,\" \"You must finish now.\"  Come to think of it, maybe that happened.\n\nAll in all, the food was still good though and you can't rush me when I get delivery!", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-21", "description": "Why 2 stars? \n- expensive: $10 for curry, +$2 for \"combos\" \n- watery curry \n- fairly bland \n- there are way better places in the area \n\nI was definitely hesitant to order from this place, but my roommate ate here and liked it. I'm relatively new to le BK Heights, so I figured I'd give it a shot. Well, I will not be ordering from here again when there are better places... \n\nI ordered the panang curry and green salad for delivery. I was a little turned off that all their curries are $10 rather than the $8 or \u00267.95 I find at other spots. I was then speechless when I ordered my typical panang curry with tofu \u0026 veggies, and the lady replied \"that's an extra $2\" WHAT?! So... $12 for something I typically pay $8 everywhere else??? I was silent for a minute thinking if I should even continue my order or just tell her nevermind. I rolled the dice. \n\nDelivery was quite prompt. The green salad was fresh, and the peanut dressing was tasty. The panang curry was unfortunately bland and watered down. I opted out of the combo and just got tofu, which was in addition to the string bean and carrot, and by carrot, I mean shredded carrot, like the kind you find in those packaged salads. \n\nI have no reason to ever eat here again when places like Joya are within a 7 - 10 min walk.", "author": "Stiph N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-22", "description": "I had always passed by Lantern on Montague street and one decided decided to pop in have some lunch.\n\nNice decor on the inside, pretty clean and simple. The food was pretty good went with the chicken Pad Thai and it was good. Tried the lychee martini since people kept talking about it, it was actually pretty good not something i would get often but it was alright.\n\nAll in all its a decent spot on Montague Street, but i would say this I have order take out from them and they can be extremely rude sometimes. Ive been here since then and the service has usually been pretty good but its a different story when you order take out.", "author": "Greg A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-25", "description": "i really enjoy Lantern.   I eat here maybe 2x per month.  I always feel with Thai, if the pad thai is good, I venture out into other dishes I enjoy.  The pad thai is excellent.  I've also had the panang curry.  After reading one of the other reviews. My next meal will be the green curry with tofu.  One of the drinks i  really enjoy is the thai tea and lemonade.  It is sooo tasty.  The Lyche martini is really good too.  \n\nIf you need an extra kick, then ask for the extra spices.  \n\nThe service can be a little slow, but with good company, you really don't notice.   Since I go there so often, the service is usually pretty good.  \n\nOverall, it's one of my favorite restaurants in the area.", "author": "Danielle F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-13", "description": "The tofu green curry ($10) here is quite delicious, and that's pretty much all that needs to be true in order for me to love a Thai restaurant; fortunately, there is much more at Lantern to enjoy. The curry has a wonderful flavor, slightly sweet, a hint of lime, and a little bit of heat. I say \"little\" because even when I asked the good people at Lantern to make my curry extremely spicy (complete with dramatic hand gestures, I'm sure) they fail to do so. Still, the dish is very much above average, and a little chili paste goes a long way. Lantern does their vegetables very well, which is key; perfectly crisp, not overcooked at all, really just wonderful. And did I mention the portion is massive? Always two meals. \n\nThe virgin rolls ($7) are a great choice for an appetizer. They're stuffed with baby spinach, celery, alfalfa sprouts, tofu, and avocado, and served with a very tasty brown honey-citrus sauce. Delicious, but also very light. Goes well (what doesn't?) with a bottle of their Pinot Noir ($32). And the mango mojitos? Yes, I know they're $9 but they are fabulous.\n\nAlso, Lanten has great deals for their lunch special. Just $8 for an entree and appetizer. Just don't get the hot and sour soup. It's terrible.\n\nThe staff is decent, could be a bit more attentive, but are nice people and answer all of my boring vegan questions. Overall a solid spot in Brooklyn Heights for Thai.", "author": "Lucy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-03", "description": "I'm not extremely picky when it comes to thai food but this place really isn't too hot.\n\nTry to stay away from the Pad Thais as they cook it with a tomato base and it tastes really unauthentic. The Thai ice tea is also a bit too sugared up so not too crazed about it.\n\nPad See Ew...hit or miss.. I've gotten good ones and ive gotten bad ones with rotten tofu. it was a take out so i had to throw the entire dish out.\n\nNOTE:\n\nThey can get pretty stingy when you order take out. Portions are so tiny even a small girl like me are often hungry afterwards\n\n8 dollar lunch specials are worth the shot from time to time.", "author": "Isabel L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-22", "description": "Came here on a Saturday night, it was very busy. We tried the salmon, duck, and for dessert creme brulee and chocolate cake with green tea. I wish we got a better table though, rather than sitting by the entrance and it was cold that night. Food was yummy and service was ok.", "author": "Elle C."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}