{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-08", "description": "I have never had a bad experience at this restaurant or from ordering delivery.  The food is okay.  I have had tastier Thai food elsewhere, but this is the only Thai restaurant in the neighborhood and the only one that will deliver to me.  A few restaurants in Cobble Hill used to deliver, but I guess they stopped.\n\nDelivery is always super fast.  The food gets served fast too so I assumed everything is just pre-cooked and heated.  \n\nThe Thai iced tea can be too sweet sometimes.", "author": "Jennie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "I would give it 3.5 stars, but that rating doesn't exist, so I'll be nice and give them 4.  \n\nThe food was pretty good, I had the green curry, and it was very tasty.\nService was okay.  The place is pretty decent, will definitely return.", "author": "Sam T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-18", "description": "I generally don't post reviews but my service tonight was abysmal.  I've eaten at Lantern many times and have always appreciated the courteous service, reliable and tasty food.  However tonight, the customer service was nearly a zero.  \n\nWe were informed when we walked in that the kitchen would be closing in 10 minutes.  We placed our orders and the food came out promptly.  After a few bites of our meal, the check was placed on the table and we were told to pay as they were closing.  As we had just started to eat, we didn't move quickly on the bill.  Several minutes later the staff began moving plates and asking us if we were finished.  It seemed that they were doing their best to make sure we got the point.  We paid the bill and a friend signed the wrong receipt.  One staff member, who happened to be extraordinarily rude, returned and rudely told us \"one of you signed the wrong bill!\". My friend corrected her error and handed the receipt and pen back to the staff member and he SNATCHED them out of her hand without even a word or acknowledgment of his rude behavior.  My friend was so appalled that she declared out loud that she would not return to Lantern again.  \n\nIt's really a shame the service was so poor tonight.  I don't think I'll be returning either.  I'll eat somewhere else where snatching is not on the menu.  Hope you do better Lantern.", "author": "Chantal H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "Great prix fix lunch, $9 for app and entree and the drinks are not very expensive. Good food, quick service (albeit very sterile, hence the -1 star).", "author": "Nataliya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "Pad See Ew with red chili sauce is soo good!", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-21", "description": "Called in 30 mins ahead and reserved a table for 8. Was given a table next to the front door and it was 57f and very windy. We requested the door to be closed but was denied. The manager asked us to make a reservation next time even though we already had one. This was the 5th time I left this (kept going back because coworkers wanted to) place before ordering any food. The servers and staff are very unprofessional. They treat you as if they are doing you a favor! Go to Tenda Asian Bistro instead.", "author": "Anuk F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-31", "description": "The food was as good as Thai could be but I think I would get better service at a methadone clinic. I had to remind the servers several times that they are servers and that I shouldn't have to remind them of the food I ordered 40 mins after the fact. I even had to remind them to place menus down after I was seated. Don't expect much from this place other then you might be waiting for food for hours.", "author": "James F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "I really liked the lunch special that my boyfriend got he ordered he soup of the day and the grilled pork chops! They both are really good!! I ordered the Shumai which wa tasty however, my Dish of the beef drunken noodles where not very tasty and I am sure that they are not made with beef but with pork instead. The place was nice and cheap will try it again some day.", "author": "Mariana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "The food is good, my favorite appetizer is the chicken/shrimp fritters.  The lunch specials are very affordable at $9.00", "author": "Truth H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-16", "description": "It's rather quite dark and the only source of light are the lanterns from above.  So it was nearly impossible to read the menu without squinting your eyes.  The bathroom is very cute with the tiolet and sink all in one.  Thai cuisine with an American flair to appeal to Westerners.  Their Thai ice tea is refreshing to cool off.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "I've been very pleased with everything I've tried at Lantern. I like that the noodle dishes are loaded fresh vegetables, so I can order pad see ew without dieter's guilt. The menu is very reasonably priced. Staff is friendly and doesn't rush you out the door, even after you've finished your meal. My only complaint is the mood lighting. I can barely read the wine list, and I've got good eyes.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-06", "description": "Great for lunch takeout during the day - \ngot their lunch special $8 for an entree and an appetizer -\nChli basil chicken and spring rolls for me.\n\nVery tasty, walked in and it took about 10 minutes.\nThe whole place was packed so if I were in a rush,\nI wouldn't say this was a good option.\n\nStaff was friendly but the woman behind the bar kept pouring\ndrinks and water for the servers to take to the tables - \nI was sitting at the bar waiting and she didn't offer me \na glass of water, even though she kept filling up glasses \na couple inches infront of my face. It was very busy, but ....\ncome on! One offer, one glass of water would have been very nice.", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-22", "description": "The food is amazing, truly the best Thai food in Brooklyn heights, cobble hill area. The service is fast and friendly and the restaurant itself is very cozy.\n\nMe and my friends have been here at least 10 times now and have always been very happy with the food and the service, so much better than lemongrass down on court street.", "author": "C B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-26", "description": "Our group of three came here on a weekend lunch, and i had influenced one of my companions for both of us to ask for their Pad Thai. He had chicken while I had beef. I should say i like their presentation and i like the taste. The noodles came covered by or placed inside a thin crepe from eggs with the monggo sprouts and tiny peanut bits placed immediately next to the covered noodles---the eater can decide if (s)he will take them as well with the noodles, plus fresh splashes of lime. I mixed everything on my plate and I enjoyed my meal with a glass of ginger ale (that was served in a tall glass, which made it looked elegant). Service is friendly and attentive; our server even asked if certain ingredients would be bad for one of our companions. btw, we also had their nori-rolled \"rolls of paradise\" (a variation of spring rolls), which turned out to be tasting great; it had cucumber, bacon-like bits of meat (or fish). But I just thought the place was rather dark (at least at the spot where were seated) at that time of the day; they could definitely do something to make it look brighter (somehow the hanging tiny lighted lanterns were not doing their work that time). it makes it less festive looking, I thought, to my Asian eyes. I suppose the place looks better in the evening (I hope so!). I'll try to be back if I get the chance.", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "I like this place overall.  They are fast, lunch menu is very affordable, and the curry is just spicy enough.  sometimes the quality of food isn't so consistent...the noodles can be mushy, I think it depends on how busy it can get there.  but overall recommended!", "author": "Zen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "Very friendly staff. Decor is good - nice lighting and ambiance. Tables are a little close together but it wasn't too intrusive. I've both taken out and eaten there and enjoyed. Take out was super-quick, by the way. They also deliver. Excellent veggie dumplings, and I love the tom kha coconut soup. Definitely worth trying if you're craving Thai in The Heights.", "author": "Alyssa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "My mother loves this place!!  I lived in the area so I was a bit sick of it after a while but the appetizers are great and so are the entrees!  I always ordered Pad Thai so I don't know much about the other entrees but that was consistently delicious.  I wish they had a better dessert selection.  The place has great ambiance and the decor is beautiful!  Even the bathrooms are beautiful!", "author": "L. W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-24", "description": "Not bad! \n\nThings I liked:\n1. Allowed my family and my boyfriend's family to continue the tradition of eating some type of Asian food on Christmas Eve. \n2. The drunken noodles with shrimp were just the right level of spicy. Didn't need to gulp water, but had a nice little kick. \n3. The mango and sticky rice dessert was good! I don't know how authentic this recipe was since it had some type of maple syrup-ish sauce on top, but it tasted good. \n4. I thought the pad thai was good. Snagged a few bites from the boyfriend and the noodles were moist \u0026 pretty flavorful. Can't comment on the chicken because I didn't taste any! \n\nThings I didn't like:\n1. The waiters were a tiny bit out of it..forgot the boyfriend's thai iced tea and then kind of forgot my dessert for a bit. Not bad, just a little bit out of it.. \n2. My shrimp still had the tail part on..really..? Just clean it for me! No one wants to chew bits of food and then return the ends to their plate at a restaurant. \n\n\nOverall, I'd go back.  Also, some guy had a lychee cocktail. I'm getting that next time! Looked tasty..", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-16", "description": "Was hopeful about having a local go-to thai spot in my neighborhood but it's not going to be this one. Pad Se Ew was completely bland and noodles were overcooked. Tom Ka soup had a nice flavor but the pieces of chicken in it were really tough. Slightly overpriced too. I don't recommend.", "author": "Lo C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-08", "description": "Not great. Because of bad service and bad food.\n\nDecor/ambiance was great (a little dark) and the place was clean and chic looking.\n\nFirst impressions: From the look I expected great and innovative food. But it was your regular thai restaurant menu with average prices. I was impressed with the beer prices for the imports, pretty cheap.\n\nService: No greeting by a waiter, didn't ask if we wanted drinks. Eventually she showed up, didn't say hello, made some sort of noise and nodded at my friend to order. Was kind of rude. We ordered and she rushed away. During the service she also touched my fork, which is a no no and rushed plates off our table when we were barely done with them.\nConstant flow of water - which i hate, total waste of energy.\n\nFood: I had the masaman curry...more like the mas-o-bland curry. Portion was normal but clearly missing some spices. Tasted watery. Potatoes were also cooked too much to be in a curry. Bottom of the pot maybe? My friend's food was normal but as he said, \"didn't taste very thai.\"\n\nThere are better asian/thai places in the area \u0026 they are cheaper. I don't think i'll be going back.", "author": "Darren G."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}