{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-21", "description": "Delicious thai food at a cozy spot in Brooklyn Heights. I went there on a friday evening and was happy that there were two tables available.\nI had the thai onion rings which were DELICIOUS. I had to thank the waiter for suggesting it. I also had the spicy basil rice... now It wasnt spicy which was disappointing but it was delicious. I prefer my food thai food to be spicy and not mild... what this place was lacking was authentic thai food.. but the staff is sweet and attentive and I enjoyed the appetizers way more than the main course.", "author": "Alicia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Man is this place one of the best Thai places around. It's so close to Brooklyn Bridge Park and the restaurant has so much good food to choose from. From pad Thai to tasty fried rice this place will leave you feeling full and satisfied. Pad Thai alone is probably the best meal they have, it's has incredible taste and comes with egg, scallions, peanuts and bean sprouts. There is nothing more you can add to that to make it perfect. \n\nThere's plenty of seats inside and out at the front. It's a little dark inside since they have candles at every table but it's not bad. Prices itself are very good considering how tasty the food is and the large portions you get.", "author": "Andres V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "Got the papaya (sum tum)salad- was ok but felt it was missing some sourness to give it more flavor.\n-Tom yum soup- again something was missing, there was a lot of back choy in the soup.\n-chicken skewers-was alright, came with peanut sauce n some pickles cucumber sauce.\n-white tiger sake martini- was good.\nOn the whole, had better Thai food elsewhere", "author": "Lynie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "This is one of my favorite Thai places in the area. I've eaten in twice, and ordered out once. \n\nThe service on a Saturday night was great. Though crowded my table of three received good service, and our food was brought out quickly. The dumpling appetizers were tasty, the wine was affordable, and my pineapple rice came out quickly and hit the spot.\n\nThe second time I ate in was a Friday night. We showed up at 8pm and no problem getting a table. I ordered the pad Thai, which was good. Not the best I've had, but a hearty portion and beautifully plated folded into an egg (almost like a very thin omelette). My only complaint is that the fried tofu appetizer was dry and disappointing.\n\nI ordered take out through yelp and the food arrived quickly and warm. It took about 30-40 minutes, and my pineapple fried rice serving was enough for two meals. \n\nThis is definitely one of my go-to neighborhood places for a filling meal at an affordable price.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-15", "description": "Cute little date spot! Awesome location as well. A walk on the promenade right after your dinner. Parking after 7pm gets better. I always order the pineapple fried rice and chicken \u0026 shrimp fritter. Ask fo extra sweet chili sauce. Can't go wrong with a good thia meal. Drinks are also prettier good as well.", "author": "Jennifer V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "My favorite local Thai spot. We order here at least once a month. My go to are the yellow curry and pad kee mao. Yellow curry is thick and they give you a lot. The pad kee mao could be spicier but has good flavor.", "author": "Elliott T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Lantern, as suggested by its name, is dimly lit by a slew of adorable lanterns. The restaurant is quaint, inviting, and cozy.  \n\nI ordered the drunken noodles, Kee Mao, with shrimp. Needless to say the food was out of this world phenomenal. I had the Krambi watermelon martini. The Kee Mao had a slight spice to it with tomatoes and chili. It was so good. It was hot off the wok and delightful. \n\nThe only reason I did not give this spot 5 stars is the communal dinning table. The perimeter of the dining area is lined with some tables and bench seating. For out party of three we were sat right in the center beside another group. It's not the worst thing in the world sitting with strangers but I just wasn't in the mood for it and didn't like it much. I was catching up with friends and felt like I had to be more mindful of my volume because I was sitting with other people.\n\nAside from that, this place is a dream and I'd recommend it. After we left the car parked and was able to stroll down a few blocks for some views.", "author": "Brittany A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Excellent location.\nI had the shrimp with asparagus with fried rice and chicken.  The food was mouth watering and so good. Every morsel of the shrimp and asparagus taste better after each bite. \n \nWould visit each time I am in Brooklyn Heights.", "author": "Lucie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Came here for the first time with my mom for a afternoon lunch and I have to say, I'm definitely returning! I flew in for the weekend and was starving, she brought me here and we ordered the chicken pad Thai with the complimentary spring rolls and everything was super hot and flavorful and delicious!!! I literally came back two more times before I left nyc! Would definitely recommend to anyone in the area just looking for a nice lunch to dine in or even take out!", "author": "Christina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "I have always visited this spot for the lunch specials, great food and reasonably priced by the way. This was my first time having afterwork dinner with my people and I must say..they did not disappoint. The staff was very professional, friendly and efficient, as always. And the food was amazing... my friend really enjoyed the food and the vibe. FYI no need to make reservations for parties of 5 or less. Thank you again To the staff at LANTERN!", "author": "Elexus H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "And for my 400th review, Lantern Thai Kitchen in Brooklyn Heights....\n\nActually we enjoyed Lantern so much we dined there two nights in a row! I usually don't do this, but on the second night we were hot and tired and found ourselves looking for somewhere to eat right in front of Lantern. I just chose it again as it was an easy selection to make our party of five happy. Also our feet were killing us.\n\nFirst, Lantern is a really pretty Thai restaurant. There are some beautiful woodcarvings, even on the doors of the restrooms, and hanging lanterns. The ceiling has cool exposed beams and there are also exposed brick walls. I really liked the interior, it was causal but elegant. Service was also very good both nights we were there. Lantern has a bar with decent selection of Asian and local beers.\n\nOver the two nights we dined at Lantern we had a small variety of dishes. The fried calamari appetizer was very good, and cooked perfectly.  The Tamarind Whole Fish was a crispy whole red snapper with spicy tamarind sauce. The sauce was fantastic without bringing too much heat. The Pad Thai was also quite good and served in a unique way. Instead of the egg being cooked in the stir-fry, the egg was served as a thin crepe and then mixed in with the peanuts and lime. The Massaman curry, one of my favorite dishes, was also excellent. Everything we had at Lantern was good to very good to excellent.\n\nFor dessert we ordered fried bananas with vanilla ice cream and Green Tea cheesecake. Both of these desserts were also great and not overly sweet. The prices were very reasonable, our bill for 4 people was just over $100.00 with two beers and 2 desserts and we had a lot of food. \n\nLantern Thai Kitchen is in a great area on Montague Street. The restaurant is only a few blocks from the Brooklyn Promenade, Brooklyn Bridge Park. Downtown Brooklyn is also only a 10-minute walk.\n\n4.5 Yelp Stars", "author": "Richard R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "2.5 stars\n\nI came here about a week ago and dined in. I ordered the pad see ew with vegetables - it was the best pad see ew dish I've had from a thai restaurant. The consistency of the sauce was on point and very savory.\n\nFast forward to today, I ordered takeout for their lunch special. Worst decision. The shumai appetizer was bland and the consistency of it was all-around a mushed mess - no texture. As for the kee mao with beef, the beef was so unbearably dry that I did not want to go through the trouble of chewing through it and left it on the side. Thai iced tea was the generic average thai iced tea. \n\nNever order takeout. Pretty unprofessional that once dining in and tipping isn't involved, the quality of food takes a plummet.", "author": "Jocelyn Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Such a good experience here yesterday! Was having a bad day and decided to grab a drink and eat some Thai food. The chicken shrimp fritters came out nice and steamy. The Montague Fries rice with shrimp ( ask for plum sauce and thank me later) was on to die for. The waiter was very attentive and brought everything I needed promptly. Great experience!", "author": "Kryssy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "This place is horrible. Do not ever go there. The food is disgusting. It is overpriced. The staff is rude.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Great thai food...order the pineapple and their seafood...can't miss.  Cocktails are fun too", "author": "Elaine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "This is a throwback for me!!! I remember studying at LIU and later working at my 1st job near by  a couple years ago and loving this place. Went for a recent visit and still the same love! Very hard to find. Thus place has a really nice ambiance, waiters are courteous and attentive every time I went. Love me sum black noodle and a lychee martini, calamari for apps.... this meal has never failed me. \nIf near court street, strolling  around... try it out. Hopefully  it will be just as good!! Enjoy guys!", "author": "Pamela H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "I came here for lunch with a friend and they have good lunch specials. The atmosphere is very nice, low key but beautiful. There's outdoor seating so that's wonderful on a nice day but the door to the restaurant looks like one of those huge sliding doors so they were open the entire time allowing the natural sun light in. The staff was very friendly and on there game. Always attentive and coming around to make sure everything was ok. Overall a good lunch spot and maybe a nice dinner date. Thai is always a go for me.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Great food. Decent prices. Lunch menu is awesome. Friendly and fast staff. Very accommodating.", "author": "C C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I always order the salad, red curry and spring roll.  I love it there, always the same and always perfect", "author": "Amy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-20", "description": "I usually go to lantern regularly for lunch, but  had to cut my lunch short today. \n\nThe waitress got my order wrong, which was not a big deal, but the the chef who brought out the wrong meal attempted to berate me for not being clear about my order. Will not be returning.", "author": "Stephanie A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}