{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "So my sister took me here for dinner once and it has since become our spot for just us... but I must admit I have had a few gentlemen take me here before just so I could get the food.  \n\nIf you have read my other posts clearly I am about scenery.  With this being said I love the Romantic feel of this spot.  Its Dark... strickly candle lit so if you're date is a little hard on the eyes, you dont have to stare directly into them lol...\n\nTHE FOOD IS GREAT HANDS DOWN.  I have had food from \"Song\" in Parkslope,  this other commerical spot in Chelsea whose name is not coming to me and a few other Thai places and in my opinion NONE OF THEM HOLD A CANDLE.  I Love the Shrimp Fritters which normally comec with a Mango Sauce... OMG to die for.  I would suggest not eating all the sauce and saving some for your rice (thats what I do and its worth it).  Main Course Wise, I either go for the Thai fried rice (with Shrimp/beef) or their Angel Hair Noodle... it just depends on what kind of starch I am in the mood for.  Drink wise their Mai Thai is very good but I like the Thai Mojito.  It comes witha Leeche nut in it which gives it its own unique flavor (and the nut is edible).  For desert I am all about the Banana Lampi... its sweet and the texture is a mixture of hard and soft which to me makes it more enjoyable and less overbearing.\n\nIf you are someone who is a stickler for customer service... well this may not be the spot for you.  The servers move quick and they arent always the most polite BUT if you can look past that and see how much more this place has to offer... like food, the intimacy of the decor, its not crazy pricy, the fact that not to many ppl know about it and the fact that after the date you can take a walk to the pier and see the city lights...you should be fine and this is the place for you and i cant wait for you to go there and tell me what you think.\n\n\nFood that sets your mood.\n\nMichelle B", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "Visiting from out of town with my wife and came across Lantern Thai restaurant in Brooklyn Heights. This place is a low key but but really nice Thai place. The food is great! Well deserving of a 4 star rating. The wait staff was very friendly and attentive. \n\nLet's talk food, shall we?\n\nFor an appetizer we ordered Chicken and Shrimp Fritters. They arrived beautifully plated smothered in a citrus glaze. Describing these as 'great' doesn't do them justice... They were fantastic, crunch on the outside and moist on the inside. The citrus glaze was tangy yet sweet. The portion was generous and was more than enough for two people.\n\nFor main courses we ordered Spicy Basil Fried rice and Chicken Pad See Ew. The food was incredibly fresh tastings with great presentations. The fried rice was spicy without overpowering the basil flavor. The dish was very good. My wife had the Chicken Pad See Ew. She is is Thai descent and said the dish was so good it made her feel 'As if I was back in Thailand'.\n\nThe green tea cheesecake is a must try for desert. I'll describe it as interestingly good. A definite change from the norm and a very welcome one at that. \n\nI highly recommend this place as a nice date place and a great place to eat.", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "Lime Fish Lover was fantastic! Ordered it for delivery and the scent brought every one in the office over for tastes. Super tart lime flavor, a little bit of heat, dense rich fish. \n\nThe $9 lunch set is the win and the kee mao have just the right amount of char.", "author": "She Eats Real F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-23", "description": "My office just moved to Brooklyn so a co-worker and I wanted to celebrate our new offices by dining al fresco for lunch. We walked around the neighborhood and settled on this place because I was craving Thai food and their lunch special seemed like a pretty good deal (around $8 for appetizer and entree) . \n\nI got the shumai and the drunken noodles and a Thai ice tea. The shumai were fine and the noodles were okay. My real complaint was the portion size! I finished everything and was STILL hungry by the time the check arrived! I'm sorry, but as petite as I am, I can eat as much as the football player at the next table. \n\nIn short: it's a great, fast, sit down place to go for lunch but don't come here if you're really hungry.", "author": "Belinda K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-22", "description": "The food at Lantern is flavorful and care is placed in the presentation of the dishes. The pad thai was my favorite out of the dishes I've ordered (including pad kee mao and pad se ew) in previous visits. Most items on the menu are appropriately priced -- a chicken pad thai will run you $10, for example. \n\nWhere this restaurant lags is the seating arrangement. About half of the available seats at Lantern are at the large, groan-inducing communal table in the middle of the restaurant. I have yet to meet anyone that actually enjoys being seated as close to complete strangers as they are to their own friends. Unless they're hot. \n\nThe service has also been consistently south of mediocre; not awful, but a bit slow and definitely cold. For example, my latest visit was encouraged by an advertisement in Time Out NY that read \"15% off your order when you mention this ad on your next visit.\" When I did just that, they would not honor the discount without me actually handing over the ad. For the average person, this situation would be FUBAR because the ad was not intended to be a coupon and yet the restaurant is treating it as one. Luckily, I tore out the ad before dinner and was able to call their bluff. \n\nOverall, good food, unscrupulous coupon policies and *sigh* long communal tables.", "author": "BT F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "Amazing Thai food! The peanut sauce that comes with the satae is delicious. While I have yet to have a dish there I don't like, the pad Thai, basil chili, and prik king are among the best. The staff is always pleasant and the portions are generous for the low cost.", "author": "Geoff H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-04", "description": "Good place to get take out from.\n\nWe got Prik Khing (String beans, which are excellent), Pad Thai (decent), and Green Curry.  I love green curry, and it's decent...\n\nYour average Thai place, and prices are a bit pricer than the Cobble Hill places down Smith and Court street, but that's to be expected in Brooklyn Heights neighborhood.", "author": "Simon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-04", "description": "Great area, nice atmosphere and food, cosy place. If you haven't try cilandro yet, give it a try over there!", "author": "Kon A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Been coming here for a long time and it is a good date spot. What I like about this place is that it welcomes and caters to everyone. Whether you're looking to spend or you're a little short on cash and looking for a tasty meal, this is the go to spot. If you like spicy, Pad Kee Mao is off the hizzee, and also the Basil Wok and the Red Curry are also good.", "author": "Candice F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "I love Thai food! If you thought the food was bland, you clearly didn't try the chilli-basil dish.  I came for lunch. You get an appetizer and main dish for about 9 bucks. The ambiance was nice. The waiters were very quick and efficient.\n\nMy main course was delicious - chilli basic chicken.  I've been craving it ever since.  The appetizer was lackluster - dumplings.  The portion sizes were perfect.  It seems to be a popular place for people to pick up lunch.  The waiter I had didn't speak very good English.  If I'm in the area and hungry I will eat here again.", "author": "Kiandra L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-13", "description": "Nice place with good decorations and ambiance (exposed wood, hanging lamps, low lighting, etc), but seating is pretty tight so expect to be overheard by everyone sitting around you. On a Thursday night it was pretty packed, and as a party of three we got what was probably the last available table. \n\nI got an order of spring rolls and an order of curry puffs (both appetizers) in place of an entrée, and my friends each ordered different kinds of curry. The food came SUPER quickly and was really good: the spring rolls and curry puffs were enough to constitute an entrée and both the red and yellow curry (I tried both) were good and had enough spice and flavor without burning my mouth off. \n\nWe finished the meal with a delicious dessert made of fried bananas and vanilla ice cream. \n\nI'd definitely go back.", "author": "Casey B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-08", "description": "I live around the corner \u0026 used to eat at the Lantern frequently, putting up with the thick gooey sauces that drown out any taste of the food itself for the sake of a sidewalk table in the afternoon sun, but finally got quite irritated at the erratic, sometimes quite snotty service. Nowadays, when I want Asian, I go across the street to Saketumi, more respectful both of the food and the clientele; I look forward to trying out the new Pinto restaurant, specifically Thai, that is just opening: looks classy. But Lantern? - not on your life!", "author": "Peter H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "my favorite thai cuisine in Brooklyn\nintimate, dark atomosphere..during the day very suitable for a first date..at night i would say not so much first date  because it is very dark and you want to see your date lol\nsmall tables along outter side of the restaurant with a long table down the middle..usually not crowded outside seating also avail..really friendly staff.\nfood comes out immediately,,((4 stars because whenever i order takeout the rice isnt cooked completely)). but however i order the montague fried rice w/chicken the sweet chilli sauce is delicious about $11. crab rangoons are delicious everytime.. nice quiet neighborhood until you reach court st", "author": "Lanee' T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-30", "description": "Food was okay, the worst service ever! All the watiers were on the clock having lunch and no checking on their tables, HATED this place. Never again.", "author": "Saevoun P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "Based on the reviews I didn't want to like this place, but it's pretty good. for a $8 lunch special they really give a lot. Stay away from every thing except the curries--fresh veggies, good amount of chicken and the flavors are there. Take out and go to the promenade for a great view of the city.\n\nFrom this place, I am beginning to notice that take out packaging is so much better in New York. Better plastic quality containers, all bagged in paper and plastic. But on the other side, I guess that's more for the landfill.", "author": "William H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "I read reviews and thought I'd try this place, as I was in the neighborhood. I got here a little before twelve, so it was sedate and not at all noisy. The staff immediately and politely greeted me. I knew they had a $9 lunch special, consisting of an appetizer and an entree. I decided upon the shrimp/chicken fritters and the chili basil with chicken. Believe me, should you come here, you won't regret it; I enjoyed my meal very much, and would not hesitate to come back when I'm in Brooklyn Heights again.", "author": "Roger C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-14", "description": "I didn't like their Thai Iced Tea. The Kee Mao (Drunken Noodle) was average, but do hope they can decrease the amount of oil use on this dish. It was very greasy. I ordered their Tofu curry dish with rice, and it was just average. Nothing special.", "author": "S S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-08", "description": "Decent enough food. The woman working the bar \u0026 takeout is extremely rude, does not listen and tells you how she thinks you should order. The waiters and staff are nice provide good service.", "author": "Chris N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-08", "description": "I kinda washed my hands of this place upon my first visit - last summer  - 2009.... had an amazing meal - but CRAPPY service....and after leaving a $6 tip (on a $40 meal)...which is 15%..... the waiter ran out the door....to stop me...and tell me in a stern way - 'THIS IS NOT 20% TIP!\"....are you freaking kidding me you idiot!!!??? You barely checked on us throughout the whole meal...I had to flag down bus boys for our drinks...and water...AND our appetizers......you gave my friend beef instead of chicken.....and because I can't bear to leave shitty tips.... I left you one anyway..and you came running after me?.... I was appauled.... pissed off....and swore I'd never return....\n\nWell....one year later.... I'm back at Lantern...this past sunday nite with my sister.....sat outside.....had the house soup (blanddddddd)...calamari.... very good.....and the Mango Salmon for my entree.... which was suprisingly very tasty..... grilled salmon.......with a heaping serving of fresh mango salad with mint...\u0026 cilantro....and sis had her green tea ice cream/chocolate molten cake dessert (which is really all she wanted)..... The decor may be nice inside...but the staff is what turns me off on Lantern... they are non-existent....non -engaging....and quite frankly....just not friendly. \n\nAfter our meal....while enjoying our drinks...we struck up a great conversation with the couple next to us.....only to be told - please leave....we have a reservation of 6..and we need your tables.... Well boy.... I was just about to order another drink...and perhaps a dessert......but nope...grabbed my bag.....wished the couple a great nite........and trust.... I won't be returning to Lantern again.... \n\nFool me once - shame on you.... Fool me twice...shame on ME!\n\nThank God I've been to Thailand...and experienced a real Thai meal...with REAL Thai warmth.... because this place lacks it...big time.", "author": "Alysha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "Lantern is well priced and beautiful inside. very trendy. they also give you a free app during lunch and they even have brunch specials on the weekend surprisingly. the thai food is great as well!", "author": "Sari G."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}