{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "Good decent thai in Brooklyn! I enjoy the shrimp spicy thai basil fried rice. Always taste fresh! The staff are really friendly.", "author": "Takia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Try they're lychee mojitos- amazing!! The service is great when they're not packed. Crab cakes were great", "author": "Vanessa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "Love Love Love this place!!! Location, decor, price and food is perfect for a first date or for lunch. The Shrimp and Chicken Fritters, Spring Rolls, Thai Ice Tea (cant really mess that up), Lynchee Tea and the Garlic or Basil dish with any meat is awesome and lets not forget cheap. The staff is always smiling and the food is served on time. \n\nWhen finish with dinner,  you can take a walk straight down by the pier! Simply, BEAUTIFUL.", "author": "Mo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "The first time we visited, the food was so good. But I thought it a fluke. This 2nd visit has shown me that this is no fluke. Lantern is a true gem of a restaurant. This place has become my absolute favorite. The intimate atmosphere. The tasteful music. The quick service. The delicious food. The friendly staff. I will be visiting Lantern every time I'm in Brooklyn. I'm doing my happy dance as I sip on my Capriani, finish the last of my pork chops, and write this review. Thank you Lantern. REALLY.", "author": "Mia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "AWESOME. this is my absolute favorite thai restaurant in NYC. if you aren't asian and order at the restaurant, the spicy dishes are mild at best (request \"hot\" if you like spicy). i can definitely tell the difference between ordering in house and ordering delivery.  i love the prik king, kee mao and the fried rice. the curry puffs are yummy but can be inconsistent in size (this is a small snack). also enjoy the spring rolls! \n\nthe staff is super nice. and the restaurant is kid friendly but definitely not a kid restaurant. also super fast, quality service.", "author": "J P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Lunch special: $9 for entree and appetizer. \n\nPad Thai is my go to dish, and I love it! \n\nTheir curry is also amazing. \n\nThe place itself is nicely set up. It's very dim and the decor is beautiful. Even the bathroom is nicely decked. The best part is the location. After lunch/dinner you can go to the Promenade and see the most beautiful NYC skyline. Great food, amazing place!", "author": "Denisse P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-30", "description": "Walking in the area and decided to try this restaurant. There are a million Thai restaurants near Smith St and this is pretty much the only one on Montague so I thought it had to be good. \n\nWrong. The menu has a lot of options but don't let that fool you. The food is \"Meh\" for sure. \n\nThe vegetable dumplings fell apart when you picked them up. They were soggy, mushy and bland. I ordered the drunken noodles-the chef may have been drunk when making this dish because they did not taste very Thai, to me. The food reminded me of greasy Chinese take out. The only plus was the pretty lamps and decor of this restaurant....p.s. - Thai iced tea wasn't good either!", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-28", "description": "This is a decent little thai place, and if we lived in the area we'd go back.  The interior is nicely decorated, and on a hot summer day it was nice to get out of the sun and into a quiet and slightly dim (romantic?) restaurant.  The fresh lemonade also helped with the heat!\n\nThe summer rolls were okay, pretty standard fare.  The green mango salad was delicious and refreshing, and the pineapple fried rice was quite good.  The pad thai was good, but with more soy sauce than some people like.  My panang chicken was perfectly fine, but nothing amazing.  Overall a nice meal, but I have to wonder why there was a bottle of ketchup on the table when we sat down, because I can't think of any reason for a thai place to have ketchup!  Siracha absolutely, but ketchup?", "author": "Tucker H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-08", "description": "Great place to catch a quick lunch. Went here the other day and left very excited! A three course meal only cost 8 bucks here during lunch time! Now isn't that great? The staff was very friendly, and the place looks pretty retro and modern.\nThe only thing is that they do not accept credit or debit card purchases under the amount of $10, so bring cash if you are buying the lunch special.\nIts one block from the Promenade, so when it gets warmer, I know where I will be going to enjoy my food. lol\nMoral of the story is...im going to Lantern for my lunch more often.", "author": "Cherron B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "I live around the corner on Pierrepont Street and I always go here. It is my favorite restaurant in Brooklyn. Probably for its convenience and consistency in delicious chicken pad thai, chicken and shrimp fritters and green tea ice cream. \n\nI bring friends, my boyfriend and family here (when I get to choose the place for dinner they already know...Lantern!) I also love their Lunch Special: Appetizer and Entree for $10. Plus the decor is super cute with actual lanterns and an old fashion water bowl. I enjoy the outdoor seating because the neighborhood is super cute (I think its the best neighborhood in NY! not just because I live here lol). But I usually walk right to the Brooklyn Heights Promenade after dinner since its right there.\n\nI could never get tired of this place. LOVE IT!!", "author": "Danielle E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-03", "description": "We ordered takeout from here, and I literally just threw everything away. After picking for 20 minutes and trying to find SOMETHING I could eat, I just gave up and had carrot sticks out of my fridge. \n\nThe 'Nightingale's Nest', which was advertised as served in a \"crispy angel hair noodle nest\" was nothing more than a heap overcooked, dry chicken, veggies that looked like they'd been sitting out for days, and the supposed 'nest' was just a matted clump of noodles, indecipherable from old Chinese lo-mien. The dumplings were soggy and I was nervous about how long they'd be around as well. \n\nRestauranteurs listen up! Brooklyn Heights and DUMBO is in DESPERATE need of a GOOD Thai spot.", "author": "Tracy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "This place is great , food is GREAT, the Pad se ew is probably one of the best things i have ever had, drinks are good, the only reason why ths place is not 5 stars is cause when the manager behind the bar is not there the place goes down hill, drinks are watered down , food is thrown together, its just not the same, but when he is there the place is booming, i come here almost on a daily basis", "author": "Frankie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "Good, cheap and fast.  They did get 2 of the 3 orders wrong today (near misses) but all forgiven for tastiness factor.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "When walking in you are greeted with cute decor, dark and mysterious yet romantic ambiance and friendly staff. I tried most of their dishes here and this place to me is comparable to Sea in Williamsburg. Also defeats the chains of Spice.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Found this delightfull place few years ago while walking down Montague Street. I wasn't a big fun of Thai Kitchen before, but since I tried their food I fell in love with this place. Its amazing location, near Brooklyn Bridge Park and its great place to meet friends for lunch and even have romantic dinner. Food is delicious, drinks are great. Service is quick and waitresses are polite. This is my best restaurant in Brooklyn!", "author": "Alina U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Have been to this place twice for lunch and had really good food. The Thai tea is Awesome. The lunch price are reasonable priced and are quite filling. Loved the green curry and the drunken noodle.", "author": "Kamal M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "If you're looking for a calm date night or a good hang out to converse with friends, Lantern is the place to go. The ambience creates a cozy atmosphere and the food adds to that. Calamari and shrimp fritters are great appetizers to try. For dinner I had the Montague fried rice with shrimp, which was really tasty and my girlfriend had the Garlic dish also with shrimp, which was even better then my meal. Drinks are good also, I would recommend the famous Mai Thai and the sangria. Pricing is good as well. Will definitely be back!", "author": "Ray W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "We went on Monday evening so it was quite but not empty. The waitress was very attentive and we were seated right away. The food came out pretty fast. The chicken pad Thai was good but the egg crepe on top was soggy. Will go again, though, if I'm in the neighborhood.", "author": "Francine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Good and plentiful serving of my Thai basil chicken! Yummy with relish plate too! Outdoor seating and pet friendly - will definitely be back !", "author": "Janet W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-28", "description": "I gotta laugh after reading Alysha R review....\nMy boo and I went there for the 1st time Aug/Sept 2010 and the same thing happened!(the waiter tapped on my guy shoulder to ask abt the tip--LMAO).\nLast year when we went, we ate outside. I had the Sweet n sour shrimp...was decent but it wasn't that hot in temperature. The waiter wasn't good at all...its probably the same damn waiter b/c he did not asked how we were doing or how's the food or nothing!\nO well, too bad for him, we didnt leave a tip. he sure did ask y...told him his service was horrible.\n\nFFWD--we went back last nite....we had spring rolls for app--nice n hot and tasty. I had sweet n sour chkn for entree, and he had the mango salmon....my food was pretty good, but the rice was hard as eva and not hot(in temperature) SMH! I sent it back, which they had no prob doing, but it was still hard....not even lil water they cld've put on it to get back some damn moisture...\n\nAnyway, waitress was nice this time around...we left a tip :-).\nThis place isn't spectacular, it's just a cool out thai spot.", "author": "Lyn D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}