{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "So let me start by saying I've never had Thai food so I'm not sure if this is how authentic Thai food should taste.\n\nNow that we've got that out the way,\nCame here for brunch after the breast cancer walk this past Sunday. It's a nice little restaurant (and I do mean little) located in a beautiful Brooklyn neighborhood.\nThe restaurant was very dimly lit and felt kind of cozy. We sat in a little section hidden in the back. \nI had the Kee Mao (Drunken Noodle) w/ chicken and Frank's lemonade. Surprisingly both were really good. My son had French toast and fruit (which was $9 on the brunch menu) and his was really good too (I had to taste his just to make sure they wasn't trying to poison my baby lol).\n\nOverall: I enjoyed my first Thai experience and plan on returning very soon.", "author": "Chantel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "I laughed, I cried, I stumbled. Check this place out! Very satisfied with the service - 5 stars", "author": "Nick C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Haven't been here in a while but all I say is - the food here is awesome!!  The lighting leaves a lot to be desired - way too dark which makes it hard to read the menu but after using my IPhone to see we chose the crispy duck \u0026 cranberry sauce \u0026 chicken Pad Thai.  First I have to say the Pad Thai is outstanding. Incredibly light and flavorful.  Did not even need or want peanut sauce it was sooo good.  The crispy duck is scrumptious!  Appetizers were very good.\nHot sake helped to make the entire meal very smooth.  Service is great in fact maybe a little too zealous.  If you put your fork or chopsticks down someone shows up to remove your plate.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-15", "description": "The food was great. The price was right. The drinks are deliciously gorgeous. And as I was in my fifth bite of tender pork chop, I found a piece of plastic. I spoke with my server and they gave me new food... and they de-plasticed it LOL (p.s. my food was taken off the bill).", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "I love Thai food.\n\nThis food is good. Cute for a date night or girls night out. Friendly staff", "author": "Lola O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Delicious! ! I got the drunken noodles with seafood (not on the menu). Fabulous taste, perfect amount of spice, and tons of seafood!! Come here!!", "author": "Madison N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-17", "description": "If you want fast hot food. Go here. But if you want it to taste good like flavorful Thai food, skip it. \nFrom the time we ordered to the time it was delivered was literally 13 minutes. AWESOME! Our mouths were watering and our stomachs were rumbling. We poured our special Pinot Grigio for Thai food. And sat down. What an utter disappointment! Because we had eaten there before and liked it. But this time, the green curry was watered down with no flavor the veggies were over cooked the pad Thai was mushy and sort of greasy.  I ordered green curry with chicken but they sent veggie curry. We should have gone with our gut and ordered Joya but we wanted to give the Lantern a try. Our bad. Never again.", "author": "Q G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "Pros: Solid, consistent, Thai food. Love the Pad See Ew and Pad Thai. Everything else is delicious for that matter. Curries are yum. And although I've never had one, they have frozen drinks. How awesome is that?\nGood atmosphere and generally not too crowded. And it's clean. Clean is good.\n\nCons:  Feels rushed and chaotic sometimes.  The servers are balls of stress. And the big middle table isn't ideal but whatever. It's fine if nobody sits next to you.", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Lantern has awesome Thai food, the restaurant is big enough to actually be comfortable to sit down there and the prices are comparable to everywhere else in Brooklyn Heights/BoCoCa area like $11-12 for a pad thai dish. The food is really really good. Try the volcanic chicken if you are eating in, it's on fire!", "author": "Mara P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "I have been visiting lantern for the last few years and they have yet to disappoint. Not sure why I am now giving a review...they make some of the best mixed drinks I have ever had.....the food is affordable and tasty and very much filling. Some of my favorite things of their menu...fried calamari...garlic fish...pineapple fried rice...red curry. The staff is great....very attentive and friendly....as for the ambience it is to die for the decor is great.", "author": "Vanasha D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-16", "description": "I have mixed feelings about Lantern. Some dishes, like the pineapple fried rice is really delicious while others are just so so. I took my Mom here for Mother's day brunch. Yes we could have made a better choice but, she loves Thai food and they welcome doggies in their outside area. \n\nOverall the atmosphere is nice, the food is ok and the service is hit or miss. Especially during Brunch, one of the times they should be on point.\n\n2 stars.", "author": "Valerie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "Service was absolutely amazing. The servers came around and ensured you were satisfied and that they cleaned the tables once you were done.\n\nThe food was very delicious. I had the chicken Thai home style fried rice, chicken and shrimp fritters, and the fried calamari. Def would recommend.\n\nOverall it was a great time and my friends enjoyed themselves. Coming back again", "author": "Tyra M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-12", "description": "Nice decor and ambiance! Fast, efficient and courteous staff. Ordered the drunken noodles and panang curry. Requested extra spicy and the food was closer to mild. Our server quickly took care of it and brought a selection of 4 different hot sauces and spices. We'll be back!", "author": "Jay V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "This place is decent for Thai. Spring rolls are good and Shrimp Pad Thai was tasty as well (Five shrimp for the record! Haha) The service was great. Came here to catch up with some friends and unfortunately, we can get a bit loud and laughy (that's a word now) together. They were very nice to us : )", "author": "lena p."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-10", "description": "Felt rushed.  Unfriendly atmosphere.  Workers seem like they are running a factory not a restaurant.  Unpleasant experience.  Kept trying to take plates from us.  Everyone except bus boy seemed stressed out.", "author": "Sharon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "Let me first start by saying how nice the decor is in this place. I was pleasantly surprised judging from the outside. Great ambiance and perfect amount of lighting. Service was good, nothing that blew me away. Food was very good- your typical Thai menu. I had pad Thai with shrimp which was very good and had a generous amount of shrimp. Prices were very reasonable. I definitely recommend this spot if you're in the area.", "author": "Kristina D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-12", "description": "Food was prompt but mediocre at best. Alcohol was awful--just juice in the lychee martini and the Brooklyn lager was flat. I sent the lager back and asked for Tsing instead but it was also flat. Don't even come here.", "author": "Daniel T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "Love their crispy basil duck and drunken noodles with shrimps Mmmm..... in the mood for this place all the time  (brooklyn)", "author": "Keren A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "I've eaten here for lunch and dinner on many occasions.  The food is delicious and the price is definitely affordable.  I highly recommend the hot and cold island for dessert.  Yummy!", "author": "Dianna N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "This is a solid neighborhood thai restaurant. I love getting their take out after a long day at work, and I get boxes and boxes of their sticky rice for binge eating. It's always full, especially on weekends, but they always managed to find a place for us. I've never had to wait! \n\nGood place.", "author": "Taylor P."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}