{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "This restaurant is one of a kind. Delicious food, wonderful attentive service and beautiful presentations within the restaurant and the food.", "author": "Cassandra H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "Very nice spot in Brooklyn Heights.  Very nice setting.  Came here on a couple of occasions, twice with family and once on a date.  All in all, the food is a little pricey, however, it's very delicious and you receive a fairly large serving size.  Definitely somewhere good to go for special occasions or if you're trying to go somewhere quiet and decorative.", "author": "Elijah T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-01", "description": "This place has some spot on thai food. I love their pad thai, it is one of my favorites in the city. I crave it every few days or so. In the restaurant, if you order an entree it is huge! Take out, less so but still large. They have great curries, pad see ew, and other noodle dishes. My boyfriend and I order from them every few weeks or so if we don't stop in ourselves. They have nice appetizers, funky and huge cocktails and happy hour specials. I have never tried their desserts. They also have a nice outdoor seating area which is great for the warmer months.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-27", "description": "Use to love this place but when you go in at 10:40 to a place that online say it closed at 11 and the tell you it closes in three minutes you get one star.", "author": "John J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "By far the best Thai place in the area! \nKee Meo (drunken noodle) is so very good. I have eaten a few Thai shops around brooklyn but I won't be going anywhere else except here from now on.\nPrices are reasonable and the staff are always friendly. \nAlthough I haven't had one yet, all of the cocktails they make look awesome.", "author": "Mitchell T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Great Drinks and food. Mai Tai was Strong", "author": "Leaux X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Yes, a five star review.  Great portions, service, and flavor.  I particularly like the spicy basil fried rice.  Their cocktails are also very good, and prices are much less than expected.  The curry dishes are all very tasty as well.\n\nThe environment is very romantic, I like having dinner with my wife here.", "author": "Julian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "Came  here for the lunch during the workday with colleagues. Solid lunch special - I believe it was $8 for chicken pad thai and a couple crispy spring rolls. Pad Thai was good enough for me, you can't really screw up Pad Thai that badly I feel. Service was nice, easy to sit down for lunch, and fast service. I would order take out from here too or delivery. I recommend it for a economic quick bite.", "author": "Seth W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-12", "description": "Lantern is a dark, zen Thai restaurant on the popular Montague Street. It is filled with dark, earthy wood furniture, lattices, and screens that make it feel a little mysterious but still casual. The service was okay, not the hovering type and definitely quite busy, but quiet. The prices are affordable and the portions healthy in size, but usually heavy on the carbs. We ordered:\n\nlantern noodle with beef\nmontague fried rice with beef\nthai iced coffee\ngreen curry chicken\n\nThe lantern noodle and montague fried rice were very similar to each other, with large strips of tender beef, egg, lettuce, and scallion. It was tasty, but not remarkable, and definitely heavy on the carbs.The iced coffee was waaaaaaay too sweet. My friend really enjoyed the green curry chicken. \n\nOverall, Lantern makes a solid neighborhood staple and a lunchtime regular restaurant. Maybe I'll be back!", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-29", "description": "Totally solid place. Their best dish is the grilled pork chop, always good. I'm also a fan of their shu mai and the chicken and shrimp fritters.  Also the montague fried rice is really good. Their noodle stuff is fine, nothing special. Service is alright but I usually get take out.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "I visited Lantern in January for the first time.  I had the Ginger dish with chicken.  It was delicious.  The ambience is warm and comfortable.   I returned last night and ordered the Garlic dish with beef.  It did not disappoint.  The ingredients are fresh and perfectly prepared.  I will return on my next trip to NY.", "author": "Melinda G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "We come here occasionally since it's a bit far from where we live, and each time we are pleasantly surprised by how good the food is and how fresh it tastes. Far better than our neighborhood delivery spot. The prices are very reasonable for what are great portions, and service is attentive and swift.", "author": "Barbara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "Let me just say that I stepped into Brooklyn Heights for the first time, and I plan to move there as soon as possible, marry rich, have all of my babies there, and grow old and happy there.\n\nSurely, I'll order from Lantern a lot when I'm there as well.\n\nThe beau and I were absorbing the flavors along Montague Street when hunger pains set in, and, admittedly, the need for a restroom. We just said, \"Thai. Okay. Good.\" Haha. We walked into a (very dark!) room and were seated. The impressive aspect, which neither of us partook in, was the cocktail and sake menus; something to try in the future, as the Thai Strawberry Slush seemed intriguing. Otherwise, it was business as usual: Adam got Chicken Pad Thai, and I got Chicken Pineapple Fried Rice. (Ho-hum, like a predictable old married couple...) Both were delicious and, despite the extremely large portion sizes, we both cleaned our plates. Backtracking a hair, we split an appetizer of spring rolls...and they were nothing special but did satiate our hunger pangs as we waited for our main dishes.\n\nCool little place, indeed. Just turn the house lights up a little.", "author": "Allison C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-15", "description": "OK, so it was lunchtime. Had appetizers and drinks. The crispy springs rolls are good. Crunchy not oily(but keep in mind its 1 spring roll cut in half). The chicken \u0026 shrimp fritters were good, the coconut shrimp was meh! The waitress had NO IDEA HOW TO IDENTIFY DRINKS!!! THERE IS A BIG DIFFERENCE BETWEEN VODKA AND RUM! \nMaybe next time only take out.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "Love the lunch special deal.  For $9 you can get an appetizer and an entree.\n\n::Ambience::\nEven it was during the day time, the restaurant was pretty dimmed. They do have an outdoor seating area during the summer time.\n\n::Food:: \nI ordered the eggplant basil beef with shumai. My friend ordered green curry chicken with shumai. They were both very good. We shared.\n\n::Service::\nThe staff were friendly.\n\n::Fun fact::\nThe restaurant was pretty empty, when we arrived around 12:30PM. However, it got packed around 1PM.\n\nConsider it was a pretty good cheap lunch, I would go there again.", "author": "Wei V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-21", "description": "We moved to Brooklyn in June 2017 and we discovered Thai Lantern. This became our go-to place for out of town visitors until 2 days ago. We took our friends from Australia for dinner and the food quality was terrible. We returned 3 dishes - vegetable dumplings, green curry and massaman curry - the last 2 being our staple foods for every visit prior. When we complained to the duty manager, we were presented with a complimentary dessert which was equally as bad. Awful, awful, awful food experience - we had 4 excellent visits prior to this so not sure what happened on the day. We were still charged for ALL the dishes including the 3 returned ones.... We will never return.", "author": "Sapna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "Food was pretty decent.  The crispy snapper was amazing! !!! The Guava Martini was also Amazing. Prices are a bit high but it's expected in this neighborhood.  The rent must be a hard pill to swallow. I recommend this place.", "author": "Debbie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "The massaman curry is delicious. I also always go for the Thai iced tea as a refreshing start to a delicious meal. My only complaint is that I was waiting for my friend and I wasn't seated, although there were many empty seats. But, that's New York!", "author": "Gabriella N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-29", "description": "Cute Thai restaurant in Brooklyn Heights. Dim lights, husky toned wood and light linen decorated the restaurant. \n\nI had the Drunk Man Noodle and was very satisfied with the flavor, but was expecting bigger portion after knowing the size another Thai restaurant chain Spice would have given me for the same price. Needless to say the food was still yummy and spicy just the way I like it.\n\nMy mom had the Garlic Fried fish which was HUGE! I mean this thing looks liked it could have dropped out at me if it wanted to. Presentation was definitely a strong point for Lantern.\n\nMy thai Iced tea was bland. I have yet to find a Thai restaurant that uses the sweet milk for that extra kick like lemon thai in Wellesley, MA. Other than that I could see myself going back to Lantern for a casual dinner again.", "author": "Sheri S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "This is a great romantic spot for you and your honey and a great spot for friends to go to catch up. The ambience is beautiful and warm as soon as you walk in. The candles and dim lighting make it peaceful. The wait staff was very attentive and the service was swift. The food was enjoyable. I had a special ( can't recall the exact name), with calamari, scallops and jumbo shrimp with broad noodles and peppers. It was scrumptious. I plan to visit again in the near future.", "author": "Dom S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}