{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "We love this friendly place! The food is tasty and the vegetables are fresh.", "author": "D Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-28", "description": "This could be your last meal! We ate here last night. I have a severe peanut allergy and of course notified our waiter of this. There was even a sign saying to mention any allergies. I was assured that what I was served was peanut free. A few bites in I realized that my meal was riddled with them. I am still paying physically for the meal I ate here.", "author": "Brianne P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-24", "description": "I really like this place the food is good and the servers are nice and attentive. It's close to everything in Brooklyn heights. I have lunch or a late dinner there often. The prices are reasonable. The drinks and appetizers are tasty. I recommend giving it a try if you have a craving for Thai food.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I love coming here for lunch with my son.  We always look for room at the outside sitting area. The food is pretty non-authentic but good. Good pad thai. Mediocre dumplings. Really good thai iced coffee. No complaints.", "author": "Irene G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "Have eaten here once with the lady and her parents as well as delivery on multiple occasions.\n\nAtmosphere:\n- Fun Thai restaurant vibe with an out door front seating area\n- Long table in the middle of the restaurant\n\nService:\n- Good service\n- Prompt delivery, always hot\n\nFood:\n- Good pad thai - go to when I don't feel like going out or cooking\n\nDrinks:\n- Strong drinks that have a lot of flair\n\nOther:\n- Go to for delivery\n- Would definitely go to with friends if we wanted a low key night", "author": "Matt B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Great food, very consistent. Excellently and timely service. Always a pleasure to dine here.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Came here with some out of town friends. The dark candle lit venue was nice, once our orders were taken the servers were constantly checking on us. Everything was delicious.  I recommend the Tamerand snapper", "author": "Stephanie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-07", "description": "The better of all the Thai restaurants in the neighborhood and by the promenade. The staff is friendly and they have a lot of dishes that aren't typical Thai restaurant menu items (more than just pad thai and curries).  The decor is pretty and the service is good.\n\nIt can be a little dark in there and the tables are pretty close to each other so depending on what kind of night you are there .... you'll experience it differently.\n\nI like the yellow noodles with curry and chicken.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "Lantern is a cute Thai restaurant in Brooklyn Heights with really good prices and satisfying dishes.  The interior is nicely decorated and dimly lit.  The soup and salads are very generous portions to start your meal.  The entrees are enough to share if you have an appetizer.\n\nWe had the eggplant basil with shrimp for $12, which had a nice tang and kick to it.  We also really enjoyed the pad see eew with veggies and tofu.\n\nThe service was very attentive.  I would definitely come back!", "author": "Sheila S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "Lantern is a really solid restaurant. They have a great lunch menu. ($9 for an appetizer and entree) and the food is delicious. Recommended dishes are: the curry puffs (although I wish they came 4 to an order and not 3), chicken and shrimp fritters (the sauce is SO SO GOOD), Pad Thai, Lantern Noodles, \u0026 their fried rice. I tried their garlic dish their other night with beef and I wish they enhanced the garlic flavor more -- still very delicious, though. The service is also really good and attentive. They are good with the pacing of each dish and they don't try to rush you. Seriously worth checking out if you are in the area!", "author": "Jess P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Excellent fare with ultra observant staff!", "author": "C C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-03", "description": "I feel like the odd man out.  A bunch of reviews said the food was flavorful; a few said it was bland.  I found the food to be extremely bland.  Perhaps they cater to their customers -- typical American palettes.  However, I will tell you this:  If you like spicy, aromatic, flavorful food, you *will* be disappointed by Lantern.\n\nThe food is obviously high quality.  Fresh, well prepared and nicely presented.  It was just very bland.  I ordered the red curry with shrimp and ordered it \"extra spicy\".   When we received the bill, it appeared as \"Red Curry, Shrimp.  Spicyyyyyyyy\"   (yes, there were extra y's.)   However, there was just the very vaguest hint of spice.  Just barely on the periphery of the flavor.  My wife's fish was nicely presented, but bland.  I was sad.\n\nThe satay was nice.  They obviously have a real grill.  The spring rolls were, again, bland and not very flavorful.\n\nThe drinks are a bit watered down and expensive.\n\nThe service was passable.  I wish they were more attentive and less forceful about taking plates and whatnot away.\n\nI've been here twice and found the same thing twice: bland food, watered down drinks, and passable service.\n\nI don't think I'll be coming back.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-26", "description": "Well I used to go here before they decided to not add seasoning to their food.  I can't believe they made salmon not taste like fish!! (Disgusting). They were also in a huge rush to seat people and paid no attention to us while we were seated! Yea I'm never going back.", "author": "Harmonie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-04", "description": "Pretty decent waiters for a mid day weekend lunch hour. Food comes pretty quick. Had vegetable dumplings it was great. I wouldnt advise for calamari unless you truly love rubbery calamari. Also had ram with tofu and padtai. the presentation for the padtai was great.", "author": "Kimberly Sue F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-19", "description": "The Lantern is incredibly solid, not great, but very solid.  If you're a baseball fan the Lantern is like a solid 3rd starter on your team that is reliable and can be penciled in to pitch 200 innings and garner 13-15 wins.\n\nIf you're looking for a place to get good thai food, at a reasonable price, with a good atmosphere, ample space and a bar, then this is a great option.\n\nIf you're looking for something more, like a really romantic date spot, superb quality food, or unique presentation, then this is not the place for you.\n\nI got the vegetable dumplings as an appetizer as well as the drunken noodles.  Both items were above average quality, enjoyable, but not mind-blowing.\n\nAgain, if you're looking for an enjoyable dinner spot, where you what to know what you're getting yourself into then try the Lantern, if you're looking for something special or adventurous, go elsewhere.", "author": "Steven C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "This place is solid takeout, nothing special, but totally solid. The pad se ew, is really the way to go, but the pad thai was pretty good as well. The beef with cashews was mostly veggies-not a lot of cashews. The highlight was definitely the shrimp and chicken fritters. We tried the chicken satay, but for the price, it was definitely not worth it.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "When you walk into this restaurant, you'll see a huge curtain which leads you to a beautiful restaurant. Its quite dark in there since they turned majority of the lights off and put up candles. The waiters are pretty attentive and are extremely friendly. As for the food, I definitely would recommend this place!  They give a generous portion and the food are delicious compared to most thai restaurants in NY.", "author": "Bonnie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-20", "description": "I went to lunch here yesterday with my coworkers. We were a group of 5 and were seated at the long, family-style table in the middle of the restaurant. We all ordered off the lunch menu and got an appetizer and entree for $9 each. I think that's a great deal for lunch!\n\nThe service was speedy and friendly. I love the romantic, yet casual feel. I also love how it's not pretentious. I would definitely go here again.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-28", "description": "One of my favorites in Brooklyn Heights. One of the perks is that they have outdoor seating which is so nice in summer time.... sit outside have a drink and apps.  Th e reason why i gave it only 4 stars is because the inside is sort of small and tight space.  I've been here many many times and always get the same thing for a meal though. Ginger vegetables with tofu.... its just so tasty I crave it all the time.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "The ambience is perfect. Good food and affordable! One of my favorite restaurants in the city", "author": "Saanya D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}