{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-21", "description": "I ordered lunch special ($9) with spring rolls. I got the pad thai with beef. It was rather bland. The dish looked sad and there were only like 3 pieces of beef. The spring rolls were all right, but they were soaked with orange duck sauce from typical takeout restaurants.", "author": "Patrick N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "Great lunch special, environment is very intimate. Their pad-thai has improved over the years. Pad see ew is also very good. The thai iced tea and the lychee thai iced tea complemented our meals nicely. Definitely worth a try.", "author": "Mace L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Never in my life did I think I could get a decent meal for $10 in a cute restaurant in NYC. \n\nLOVE this place...though I'll admit I've only been here once. I know it's a solid Thai restaurant when they have 4 different sauces/spices on a rack to choose from. I got their Pad Thai and my friend got their Pad Kee Mao. Both were delicious, though I'd recommend the Pad Kee Mao. It was absolutely delicious. \n\nI love the ambience in here - the exposed brick wall and interesting lighting makes for a festive and chic atmosphere. This restaurant is small and intimate but energetic and lively. I can't wait to go back!!", "author": "Dee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "Food is great \u0026 the Thai Mojito is even greater. Fell in absolute love with their chicken shrimp fritters.", "author": "Vanessa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Great food , went on a beautiful day. Sat outside with a couple friends and ordered off the 9$ lunch menu. LOVE how it comes with a complimentary appetizer. Started myself with the Strawberry Thai Slush as my drink \u0026 fell in love. Definitely a good spot for Thai.", "author": "Dae S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "I came here on a dinner date with some friends not too long ago. \n\nWe sat outside since the weather was pleasant.  The outside seating area is very nice, clean and spacious. (I've eaten inside since, as well and it's awesome; great ambiance). \n\nI ordered a shrimp Pad Thai and the vegetable roll appetizers. My husband and friend's ordered onion noodle something and tofu appetizers and they liked everything except the tofu appetizer. lol\n\nBesides \"Sea\" and \"Beet\" I had never gone to any other restaurants for Thai food before.    I wasn't a big fan of Sea and I'm hopelessly devoted to Beet so this was a gamble for me.  Thankfully, the food was actually very good!!!  It arrived hot, well presented and fast!  We were all satisfied with our meal that evening and with the service.  The serving staff are very nice, attentive and funny.  We were treated very well. \n\nSince then I have ordered the shrimp Pad Thai several times for lunch and dinner delivery and so far it has always been delicious!   They're also very nice on the phone.  That might not matter to some people but often times when I call into nice or okay restaurants they shout and get frustrated or sound terribly disinterested in my order and existence.  That really bothers me since my patronage is what helps them grow; it feels like they just want my money and don't want to give quality service.\n\nI have become a loyal fan of Lantern.  They offer what matters most to me, quality food, a kind staff and consistency in both. \n\nLantern I luv ya!", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "Was just here. Food was good but the service was terrible. Waited 10 mins for a server to take our order and got my drink late during my dinner. Not coming back", "author": "Gie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "this place is amazing! And affordable, the food is great and the service is wonderful, highly recommended", "author": "Mary M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-24", "description": "been ordering delivery from here for eight years\nand finally had to write a review tonight.\n\nLantern is inconsistent, and recently, the woman who takes delivery orders\nis um, mean.\none night i'll order a meal, it'll be delicious.\nthe next night, not so good. no idea why this is. different chefs?\n\ntonight, called to order my usual \n(which they messed up the last time and refused to refund\nand the time before that, strange hard black bits\nthroughout my entire meal)\nasked for virgin rolls\n\"sorry, out of virgin rolls\"\nasked for fish cake\n\"sorry, no fish cake\"\nasked for my usual\n\"last time you order, you send back, it's not white rice brown rice too oily...\"\n(no idea what she was saying, but\nwas basically telling me she wouldn't send it)\n\nnever had this type of issue with Lantern, but\nthey've been going downhill past few years.\nsighhhhhhhhhhhhhhh\n\nbye.", "author": "Marie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Went for dinner, Lantern has a fairly pleasant modern trendy design with a large communal table in the middle and outdoor seating on the street.  The food portions are generous, and quality of the main courses was pretty typical of NYC Thai.  For my taste, a bit too sweet and lacking complex flavorings and spice.  Fried tofu and spring rolls failed to impress us.  Service was quick and food was nicely presented.  In summary, it was OK if you're in the mood for Thai but nothing special.", "author": "Cary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Took my girlfriend here for her birthday, the food was amazing and inexpensive. I let them know it was my girlfriends birthday and they came out with a yummy desert and sang her happy birthday. I'd suggest the snapper, the sauce is so good.", "author": "Shantal W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "Fun little neighborhood spot with good Thai food, though I wish the prices were a tad less \"Brooklyn Heights.\" It's just chicken and rice, right?\n\nPresentation of the food was very pretty on the plates, and the chicken satay and Thai fried rice were both delicious. Service was just a little slower than I would have liked, especially for a quiet Wednesday evening. But I would absolutely eat at Lantern again.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-10", "description": "For years Lantern was my go-to downtown Brooklyn thai place.  We lived on Henry St for several years and either dined in or had delivery at least once a week. \n\nHaving move to the Midwest I would visit the area every few weeks and get lunch delivered once a week.  I noticed a dip in quality but I wrote it off as busy lunch issues. \n\nI came back to Lantern on a business trip and came in at 6:30 for an early dinner.  Not busy so there wouldn't be the attention to detail issues. \n\nBeing a one trick eater I ordered the thai dumplings and chili basil with chicken.  \"Extra extra spicy please.  I like my mouth to burn when I eat thai food\".   Ok the waitress said. \n\nThe dumplings were on the table before I came back from warding my hands - note good hygiene - which I found odd.  They were bland beyond compare and the sauce was even worse.  \n\nI was still holding out hope for the entree but when it arrived I thought the kitchen was somehow connected to a thai restaurant in Springfield, MO. \n\nIt was sweet.  No spice except a little black pepper.  No chilies of any kind.  It is called chili basil!\n\nI asked the waiter why it was sweet, not spicy.  She pointed to the spices on the side and said \"I brought you spice on the side\".   I said \"I asked for extra spicy\" and she said \"we make medium spicy\".  She then basically asked me to go somewhere else if I wanted spicier food.  \n\nThe manager, who remembered me from hundreds of visits, asked if she could make it again as I requested.  Again it was not hot and had barely discernible chili flavor.  \n\nAfter dumping a ton of chilis in fish sauce and ground red pepper I came close to the flavor I remembered.  The manager said if you want it spicy you need to ask for fish sauce and chilis to be added.  \n\nBottom line - if you want a cozy wood atmosphere with great lighting and a nice Pinot with mild thai food come on down.   If you want a little fire look elsewhere.  I know I will be. \n\nThe end of an era.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-09", "description": "Found it impossible that these guys sat myself and my girlfriend before another couple, and that second couple was attended to first.  I will also enter into the court that this second couple were both Caucasian.  No greeting at our seating, no nothing.  We did leave and not even eat, so I can't be a judge of their cuisine, but its bad enough that service, one of my three major components of dining outside, was heftily looked over. What made matters even worse was the fact that my girlfriend is a Yelp Elite member, and instead of getting another 5-Star rating potentially, they're retrieving a 1-Star from each of us, based on attentiveness alone.  You never know who you're serving.", "author": "Diamond B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Food is 5 star thai. Lunch special is amazing. The only thing i dislike is the waiting staff isnt very friendly, not mean, just not too attentive, and they rush you out quickly. Not necessarily a good date spot but definitely a great lunch break spot.", "author": "Nora M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "Yellow curry was pretty good for the price. Lunch special is a great deal, $9 for a very large portion and delicious shrimp and chicken fritters.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "I use to eat the traditional Thai dishes here which are all good.  I am really enjoy the options under: hot from the Asian wok, my favorite is Prik King.  This place is great and really affordable.  There's even dining on the sidewalk", "author": "Bill T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "9/16/15 \nAt work and hungry and I love Thai so i thought this would be a great idea mostly because my coworker suggested it. So I ordered the lunch set. Appetizer were spring rolls with plum sauce and Pad Se Ew with shrimp. Exactly ewwwwwwwww total was about $9. The 2 Spring rolls were wet with plum sauce, the plum sauce was all over the container and the inside of the bag. The Pad Se Ew was without egg (I asked for it without egg) and dry! All my noodles were destroyed and in one dry clump. The spinach was uncooked but somehow mixed well. There were 4 medium shrimp with tails still attached and the food was delivered cold. \nI won't be having Lantern again. Didn't even request a refund. Wasn't in the mood. I really enjoy filling my belly with food that's good to my mouth. I'm disappointed.", "author": "Beth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "The crab rangoon is amazingly lovely. Fried (but not heavy) with crab and cheese and a chili dipping sauce...", "author": "Yuxi H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "First time going, and I definitely thought the atmosphere was really intimate and warm, and the decorations were amazing (went around Halloween). I especially liked all the little touches they did for the holiday (cobwebs/pumpkin lanterns/etc.) and I think it mixed really well with the lanterns they already had set up. As for the food, my Basil Fried Rice was amazing and the portions were huge. I also got to try the Pork Chop which was also really great, but a little dry in some parts. \nThe dessert was hands down the best thing. The \"Hot and Cool Island\" they gave use was fried ice cream in a strawberry sauce and they brought it to our table lit with blue flames. Coolest thing I've seen in a while. Otherwise the service was fast, although the servers weren't particularly talkative. Not too pricey either. Definitely worth a shot.", "author": "Josephine T."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}