{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "Beef fried rice and crispy basil duck is super awesome", "author": "Raksith W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-09", "description": "Have been informed that this place microwaves their food!!!! That explains why our food wasn't warm and didn't taste good. I wont be back!", "author": "Kory F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "I've been coming to this restaurant for over five years and was never disappointed. The staff is always courteous and polite, my food was always cooked well done and brought out on time.", "author": "Rae C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "They get five stars because their food delivery is so fast.  food is delicious, I like their green curry vegetable tofu. Their volcanic chicken is also very tasty! Old standby...., delicious and fast!", "author": "Claudia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "I love the food and ambiance, but slow service and staff is generally rude.  Better to grab lunch.  Daytime staff is slightly more attentive.", "author": "Stella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "A lovely place to visit after a walk on the nearby promenade. Take in the views, then take in some Thai.", "author": "Val K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "i meant to give this a 3.5 but i rounded up to a 4. \n\nthe place isn't bad. it isn't great either. if you must have thai and you're in brooklyn heights, it will do the job. i had the cashew beef with rice for 10 dollars, which is relatively cheap for a dinner. \n\noverall a MEH but will be back if i need a thai fixin!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-15", "description": "How do you ruin a Pad Thai? It's the most basic dish in any Thai kitchen! Here it's just gloppy and tasteless. Barely edible. All the food here is overly salted, overly sweet and just an offense to the fine cuisine of Thailand. Stay away!", "author": "Tom I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "I love their food and their place - they got a great lunch menu and the food is always fresh not greasy like at other thai places.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "only reviewing the spring/egg rolls:\nConsistently very good. Very crunchy and not too oily. They come with excellent sauce and on the whole very very good.", "author": "Jay J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "As far as thai restaurants in Brooklyn and Manhattan go, this is a really good one with very reasonable prices for lunch and for dinner. $9 lunch special gets you an entree and an appetizer. Delivery can take a long time (like an hour at peak lunch time). Nice looking interior though not the most comfy seating.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "I had a nice experience at Lantern. Although the lighting is a bit dull, the interior is beautiful and it's cozy. I've had Thai food a couple times in the past, but I've never eaten Pad See Ew. It was a pretty good choice, and I enjoyed it. It was delicious, and filling. The service was lovely.", "author": "Karen P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-26", "description": "Came last week with a friend to catch up over lunch.  I'm on a budget so the lunch special was just perfection, $15 after tax and tip for the app, entree and a thai iced tea.  Service was good but the food was forgettable", "author": "Samantha U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "The food is delicious and the service is excellent. They are fast and friendly. Lantern is the place I treat myself once a week for lunch because I enjoy it so much. Great experiences always. Been here at least a dozen times already.", "author": "Cindi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "Great place for lunch great lunch deals. The food is delicious and bursting with flavor. Service is quick as well. It's a great ambiance and close to the Brooklyn promenade. Perfect date restaurant.", "author": "Rachael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "I was plesantly surprised by this place. I've passed by it many times and yesterday I finally had a chance to go in and am certainly glad I did. \n\nThe menu is quite tantilizing and tasty. You could tell everything is super fresh. The decor is quite nice as well. I will be coming back here.", "author": "Harry B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-19", "description": "oh lantern how you have disappointed me :-( \ni went for dinner on tuesday because i was in the mood for thai food, but not in the mood for the crowds and loud music ala sea  in williamsburg) . i order the tasty pork chop dish and my son ordered the garlic dish. we were both enjoying our food when all of a sudden .......\nwe hear a loud cough (from behind the bar) we both turn around and it's a waiter spitting in the bar sink -- yes, spitting in the bar sink. almost like he was seconds away from vomitting --- but in the front of the restaurant in the sink ????? he then proceeded to clean the sink out but i could not help but wonder where the ice and beers would be stored ??? would it be stored in that sink ??? just gross, gross, grossssssssssssss ! \ni immediately stopped eating asked for the check ! sorry lantern but i cannot eat here anymore.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "Ordered Pad Thai and dumplings. Great food, staff was attentive and prices are good. Will definitely come here again.", "author": "Bebe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "My first love with Thai food! Now there's no going back. Great food, outdoor seating,  chill ambiance. Love the Pineapple fried rice \u0026 thai ice tea", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "Yummy! This place is great! The food is flavorful and you've got a ton of options. I absolutely love the Volcanic Chicken!! It's half a chicken full of sweet, tangy flavor mixed with vegetables. You can share it with a friend (just make sure to order a side of jasmine rice so both will be satisfied). The desserts are also delish! As a bonus, you're just 2 blocks away from the Brooklyn Promenade. So after a nice meal, you can enjoy a nice scenic walk. Highly recommended :-)", "author": "Valeria D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}