{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-03", "description": "All I'm saying is: how rude is it to shove alcohol at your patrons and immediately after, passively aggressively rush them out so you can close up? \n\nI've dined here a couple of times over the years and the experience was usually average: an impersonal customer service, but the food was good --which is not saying much because it's hard to mess up Thai food. \n\nBut last night customer service was not only lacking, but downright rude. My friend and I were not ready to order when the waiter was. But when we were ready to order he ignored us. Ok whatever, not the reason for this review, but it was the start. \n\nWe finished eating and drinking. The restaurant was emptying out. Then a waitress comes over and asks us if we would like another round, so we accepted. They brought the drinks and immediately informed us that it was closing time with an attitude of \"hurry the f**k up\". \n\nI took my time because I'm not going to get sick from downing alcohol for their sake. Well then, they proceeded to clean aggressively around us practically sweeping underneath our table. They asked again and again for us to pay the bill. By the time we left, it wasn't even closing time as listed on yelp. \n\nI shouldn't have tipped them. I feel ripped off.", "author": "Aidi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "This was one of the first Thai spots I tried after moving here from Seattle. I was on a date. The service was great. The food was delicious and I ended up a happy customer. Why a four star, there wasn't anything BOMB! WOW! EXCITING! \n\nIt was over ally a great location for a date, romantic and all. Then we walk along the water area.great location. I see there are some lunch specials for 9 bucks. I would love to come on my lunch from downtown NYC. Order ahead, hop on the train, and plenty of time. I miss my old stomping grounds, this place will always have a special something in my heart. \n\nKeep bringing out the pineapple fried rice in a half pineapple; favorite. The drinks were mighty tasty.", "author": "Daisha N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "I visited this place this summer twice and had outdoor seating the first time. Fantastic restaurant, your pineapple fried rice is to die for! It reaaaally hit the spot. I haven't tried anything else but I'm curious to find out more.\n\nThe second time was indoors, nicely dim and intimate. Ordered the same thing because it was so good the first time. There aren't too many good Thai spots in the area, you guys are doing a great job. Keep it up!", "author": "Cynthia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Came here on a Saturday night with my mom and A and we were seated after just a bit of a wait. We really enjoyed the fried rice and fried whole fish here and so far, this place has been better than the other Thai places we've tried. I'd come back here again just for the fish so I can understand why it was so packed.", "author": "Brietta Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Love the service but my pork chop was burnt . I will be back to give them a second chance ... will let you know how it went ..", "author": "Donna D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "I used to order from here regularly. They've always been a busy place but as of late, they seem much more busy. I do typically enjoy their food. Their lunch special is a great deal, entree and appetizer for under $10. The food is your standard Thai dishes. Wouldn't be disappointed going her.\nUnfortunately, when I got my food from here last week it was not a pleasant experience. I ordered the Chicken Pad See Ew. As I ate it I discovered quite a bit of egg shell in it.  By that I mean and entire egg shell. It was smashed but still significantly held together. How could they be careless and not notice this?", "author": "Nick S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "So I went to this restaurant because it was suggested by my date and I had told him after we ate I would like to go to the promenade park which is nearby. We arrived there early on a Friday afternoon (we were trying to avoid the rush hour) and we sat inside. The ambience is nice. It felt nice and cozy perfect for a first date! Now I'm really picky when it comes to food. I don't like onions, scallions or tomatoes... things in that nature. I know I know most of you guys must think I'm crazy but don't judge me! So I ordered the chicken fried Thai rice. And I TOLD the waiter I ONLY want eggs and broccoli in it! Simple right? Boy was I WRONG. I got my food and it had onions, tomatoes everything I don't like. Now I didn't want my date to think I was crazy and I didn't feel like telling the waiter to take the food back so i just sucked it up. *sigh*. I was really hungry though that day I only had breakfast and at that point anything would suffice. So I just pushed the onions and tomatoes aside like a little kid and ate majority of the food. The food wasn't bad. It was a bit bland. It needed some sweet sauce to make it just right. I don't think I would come back here again if I had a choice. Overall it was just mediocre. Oh and my date ordered curry puffs as appetizers which I never had before and those were good.", "author": "Yami C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "Lantern has a nice calm vibe, dim lighting to set the relaxing mood. The appetizers are GREAT! Definitely recommend the calamari. I didn't really like the garlic chicken dish, it could've used more flavor in my opinion. The pineapple fried rice was great though! Wish it had more pineapples though.", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "The Volcano Chicken, Shrimp pad see ew, cucumber salad, and calamari was excellent. Get your camera ready for the Volcano Chicken it's litt on fire so dope!  Nice for date nite especially in the summer because the promenade is a block over.", "author": "Lipstick L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-18", "description": "I really want to give this place a three star rating, but I'm pretty sure I got food poisoning from here when I ordered the Lantern's noodles...\n\nThe decor is gorgeous. Very dark and sensual and modern. It's lit with candles and very dim lighting. The food presentation is also impressive as is the drink presentation (there are paper roses made from straw encasing in the straws when they bring your drink order!). The food was delicious. The service is fairly good. And I would have no complaints and given it four stars. Until the check came... it's a little pricey for the quality of food. Three stars then! But wait... an hour later, my stomach started a war against the rest of my body. Sorry Lantern, two stars for you.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "I love this place; however, I am not a fan of communal seating. That being said, the food is always delicious, service excellent, and they have amazing hot sauces!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Went to Lantern for a casual Father's Day lunch and had a fun time. Lantern offers summer outdoor seating which is a huge plus (and they're dog friendly!)\n\nWe ordered a variety of spicy Thai curries, the steamed vegetable dumplings and the spring rolls. Everything was really tasty; not mind-blowing, but solid. \n\nThe service was also very nice and fast. \n\nOverall, Lantern is a great option for a laid-back, budget-friendly meal on Montague Street. I'll be back!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-16", "description": "I ordered the pad thai with shrimp. First time having boiled salad shrimp. Food was no season and very bland. Will not be returning.", "author": "Demetria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Lovedddd this place. Everything was delicious! The waiter was very pleasant and nice. Very nice spot. Will definitely recommend and go again", "author": "Sabrina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "This is my go-to thai spot in the neighborhood. The establishment is clean and cute, quick service, decent prices and portion sizes. Love the coconut soup. Pad thai, drunken noodles, wok dishes and curry are all solid. Surprisingly good dessert as well.", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "Fried Calamari was stale, smelled heavily of fish, and the batter was soggy. Worse Calamari I have ever eaten...\n\nFORTUNATELY THE MAIN COURSE WAS BOMB DOT COM\n\nDrunk Noodles with chicken and shrimp  was perfectly cooked and the spice to the noodles was perfect.\n\nThe other one I got was the night and gale noodle thing but that shit was delicious too. with some white rice I was in  heaven,\n\nOVERALL good main course shitty appetizers.", "author": "Escorpio V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "food was thai okay however not eight protein or meat. it was like a bowl of rice to one chicken strip.  the drinks are not worth it as it relatively have no taste to wat it's advertised as.", "author": "Kisa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "My sister and I had dinner here last night after our movie.  We were seated quickly, considering it was a Friday night and the staff was friendly and attentive enough.\n\nI ordered the calamari, which was bland and rubbery. I would not recommend it and I ordered the drunken noodles with shrimp, which was great.\n\nUnfortunately, I barely touched the drunken noodles because of a stomachache from too much popcorn, therefore, I asked for it to go. They took my plate to the back and came out with a small white carton. I thought it was rather small for the amount of food left behind but shrugged it off.  Long story short, when I heated the meal the next day, the leftovers was less than half of what I left behind yesterday.  I paid for a full meal, so Lantern essentially ripped me off.\n\nLesson learned, ask for a carton and pack the meal yourself. You have no idea what happens when they take your plate to the back. So what happened to the rest of the meal I paid for? How does food just disappear like that?  Would I go again? Maybe, but there's a ton of great Thai places in the city to try. I won't miss Lantern and they won't miss me.", "author": "Nedra J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "The atmosphere is AMAZING; wooden screens, flickering orange lanterns cascading at various heights from the high ceiling, candlelight, everything.  The service is excellent as well (well, while I was in on a Saturday afternoon and one of the three tables in the restaurant); I can tell all the staff are incredibly kind and professional.\n\nPortions are huge, so don't worry about the value.  Trying to save some money, even if I ended up being basic, I ordered Pad Thai and then added pineapple.  It was yummy but, like most Thai food in New York City, wayyy too sweet.  The sauce was clearly full of sugar and lacked the full, savory taste that I really needed to be satisfied.  The mix of vegetables (onions, green onions, peanuts, shiitake mushrooms, carrots, and more) was generous and delicious.  The cabernet sauvignon was also too sweet for my taste, and not that high quality.\n\nI'd go back with friends to enjoy the environment...but sadly not my ideal date spot because although the design and service are \"wow,\" the food isn't enough to impress.", "author": "Jenna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Lunch special is incredible - just 9 dollars for an appetizer + main course. The mojito there is great (there's even a lychee in it!)\n\nA+ Food\nA+ Drinks\n\nUnfortunately the waiters can be inattentive and aloof. The only thing getting it to 5 stars!! agh! Will be returning because the lunch special is unmatched- especially in the area.", "author": "David I."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}