{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Service was a little slow and drinks were overpriced but the food was terrific. We ordered two curries and a noodle dish as well as calamari and a salad and everything was very tasty. Would definitely go back!", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Excellent food. The decor is nice and casual. The food is perfectly seasoned and the price is right. I had the chicken and shrimp fritters, the Kee Mao, and for dessert a DELICIOUS fries ice cream with strawberries that they set on fire before serving you. I also had the Thai Ice tea lemonade which was delicious. I truly enjoyed my meal and the company I was with.", "author": "Shelly Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "Went here the other day and ordered my usual Pad Thai. I've tried a lot of Pad Thai and I really enjoyed it here. Reasonably priced, too.", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-25", "description": "This restaurant is about 15 feet from my sisters apartment so anytime I'm there in a Thai mood this place gets the call. The food has always been good, fresh, and delivery is extremely quick. I've ordered from them over 5 times and while sometime small is sometimes off about one of the items overall every experience has been a good one. The Pad Thai is alright, their curries are great, and the basil fried rise is a must try.  It's definitely worth checking out, you may not love it but at bare minimum you'll probably like it.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "I ordered a Kee Mao and it was good. Not the best Thai I would say but better then a lot other places. I might visit it again.", "author": "Neel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-09", "description": "Lantern is close to my job, so my friends decided they wanted to have dinner there. I frowned and agree. \n\nI will give you a disclaimer before you read this review...I AM THAI. \n\nOk with that said, my friends and I are seated pretty quickly, right near the door. We order some beers... Chang ($5, thai beer) and some appetizers, Curry puffs ($6) and chicken and shrimp fritters($6). I order a Green Curry ($10), thinking they cant mess it up because curry comes from a can and you add coconut milk. Mind you I order my curry in Thai so my waiter knows I'm Thai and I want some spicy curry. I said to her VERY SPICY. She shakes her head and understands. My friends order a Massaman Curry ($10) and a Garlic - Vegetables ($10). They were very satisfied with their food. I on the other had had water downed curry. The waitress came back and asked me if it was spicy enough and I looked at her and said no. I found out later that they put cut up bird chili in the curry to make it spicy... NOPE not spicy enough I pop those suckers like candy. \n\nSO in conclusion if you want watered down curry, Lantern is the place to be. I have to say the appetizers were not bad and the beers are cold. I wouldnt go back though.", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-26", "description": "I'm like a moth to this Lantern --  a very stupid moth who keeps going back, deceived by the pleasant look of the place and the seemingly happy people dining there.\n\nIf you like Thai food straight from the box (one that unfortunately did not come from Trader Joe's) look no further.  \n\nI'll say this -- the staff is accomodating.  They didn't blink when I told them my first selection was inedible.  Perhaps it's happened before.  In any case, I'm still shivering when I recall the brown sauce that was drizzled over my  tofu pad see yew.  Pad see yuck?\n\nAfter sending that back,  I ordered a green curry vegetable thinking that would be safe.  WRONG! Dehydrated powder mix at its absolute saltiest and watery.  Ugh.  I cursed the chef so many times on the walk home that I literally needed to wash my mouth out with Listerine.  Gross!", "author": "Natty G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-25", "description": "If you're looking for Thai food this place is a safe choice. The food is pretty good and flavorful plus they also have a $9 lunch special that comes with an appetizer so you really can't complain. It's a great place to catch a quick lunch.", "author": "Mervin W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-16", "description": "I usually have good things to say about this restaurant... Good food, price and service. But today they get an F for service. I sat at my table for over 20 minutes waiting to be served, while people that came after me got A+ service. I watched servers walked right past me when it seemed obvious that I had not placed my order. I eventually walked right across the street to Heights Cafe where I received prompt service with a smile.", "author": "M C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "Food was amazing. I had the Basil Fried Rice - AMAZING. I had the spring rolls as appetizers that was also pretty good. The Thai Iced Tea was not disappointing as well. Didn't have problems with the service or the cleanliness. Everyone was pretty friendly.\n\nSince I sat outside, can't say much for the ambiance indoors and I went during lunch, so not sure what dinner time is like, but I highly recommend this restaurant (especially for those who have not had thai before)", "author": "Nic P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-31", "description": "Service sucks.  As in, take your order while trying to up-sell you, and ignore you for the rest of the evening.  OH WAIT, come back to take your money.  \n\nFood is ok.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "I love NY you can eat delicious almost everywhere, and this thai place its one of those!!! I had and spicy curry that it was delicious and reaaaally hot, im mexican so I dont care but if you are not used to spicy food be careful. My husband ordered noodles and there were amazing as well!! I completely recommend the place, its also cozy and great service!!!", "author": "Eliska A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-03", "description": "I love this place. My girlfriend and I enjoy their lunch special when i come to visit. Had chicken green curry and shumai with an iced coffee. Delicious!", "author": "Mark M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-13", "description": "Lantern is a bit pricey for what it is, but I do enjoy the food. I've had ginger chicken and chicken fried rice. I also tried their Thai iced tea with lemonade. I liked it all.\n\nMy boyfriend has been ordering vegetarian dishes though. With the vegetable garlic dish, he didn't feel full and it looked like a lot less food than I got. Like they'd done the chicken dish and not added chicken or replaced it with any extra vegetables. It's not like it's cheaper either. He also didn't enjoy the tofu in the yellow curry.\n\nTheir delivery is really fast - the food arrived within 10 minutes. The atmosphere for dine-in is nice too. I didn't have any problems with the service.", "author": "Heather A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "One of my top priorities when moving neighborhoods is the convenience of good Thai.  Luckily for Brooklyn Heights we have that in Lantern!  Food is great.  Drinks are great.  Quick service.  Easy to order take-out (though at busy lunch/dinner times you may not get an answer first call, just a heads up).  Nice lunch specials (appetizer + entree is $9).  Fun outside seating in the front during nice weather.  My usual thai order rotates among ka prow, kee mao, pad thai, basil/chili fried rice and panang/green/red curries.  So far I've had great pad thai and panang curry here, good ka prow and ok kee mao and spicy basil fried rice.", "author": "Brendan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "My favorite! Go to this place all the time. My friends love it too.\nMany dishes are tropical, eg. mango jumbo shrimp! Lantern's noodle is marvelous. Crispy duck is delicous.", "author": "Tiantian X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "Really good food, i love their basil vegetable fried rice! I always go to this place when i am I'm the area, going to the movies. I love the interior of the place, its very pretty and clean. It's usually quiet and calm here as opposed to other places i've been at. I wish this place was closer so that i could visit more!", "author": "Xiomara T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "I like the food... we ordered so much!  Everything was good.  Its pricey though! We were 3 and we paid around 40 each as the portions are like french cuisine!\n\nWe were pretty attracted by the website but you have to try places irregardless and judge them yourself!\nI like the flavors, specially the pineapple rice, the entrees, the classic curry... the food here feels nice to be while with friends, its a nice environment,its pretty nice and stylish, sometimes chaotic because its crowded.  Just go!", "author": "Lorrs L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-22", "description": "Decent place for lunch. Usually get the lunch special Pad Thai. Not bad.", "author": "Bryan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-26", "description": "I have been to this place a couple of times before and everything was good, the service, food, drinks and atmosphere. However this last time I don't know what happened. We got to this restaurant and they sat us right away, however they didn't tell us that they were closing right after they seat us our server comes and says\" they told me to come and take your order because the kitchen is closing\". This man had the biggest attitude ever as though we did something wrong. First off why did they seat us if they knew they were closing and then choose to rush us? My boyfriend and I didn't fuss we gave our entire order right away. The drinks,appetizers, and entree arrive all at the same time. The appetizers that were ordered was the crab wontons, calamari and the shumai dumplings. Half way into eating my fried crab wontons I am chewing on something different. I take the food out of my mouth and that is when I see a piece of foil paper.  They take all of the food away because I immediately lost my appetite. They take it off of the check and the manager never came and said anything to us about this mishap. At the end of it all I have made up my mind to not eat at this restaurant.", "author": "Racquel W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}