{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-26", "description": "The decor is pretty cool with nice, mood lighting.  The restaurant is in a nice area but it's funny that the clientele is not from the area.  The food is not that good but it's Thai so they can get away with it because they give you a lot.  I ordered an appetizer and a main meal and they brought it all out at once.  I sent the dinner back.  Of course, when they did bring it to me after my appetizer, it was cold.  Could have called that one.", "author": "K C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Delicious!  I work around the corner so it's the best and they deliver.  Awesome!  I've yet to eat in, but can't wait.  The ambiance is amazing.", "author": "Tracey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "UPDATE: I think the service here is a little rushed. It obvious they're trying to get you out the door. I was still eating, as was most of the people I was with, and they brought the check. I mean, come on, we're a large group that is obviously celebrating a birthday, you already get extra added gratuity for our group size, you don't need to rush us out as well.\nI'm still going to keep the 4 stars since I like the food.\n\nI love coming here for the lunch specials. Sometimes I come here in groups at night as well. The only problem I really have with the place is that it is so dark, the lighting is \"mood lighting\" but that makes it hard to see at night (which is why I like to go for lunch).\nThe lunch special is great because you get the appetizer and the entree. I particularly like getting pad sea ew (which is my go-to at any Thai restaurant). The only thing I have to say is that the tofu in it is a little bit harder than I like, I understand that it's seared but there doesn't seem to be any softer center. This might just be a matter of personal preference.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-30", "description": "This is a good place to go to for lunch, since they have a $9 special, which includes an appetizer and an entree. There are four appetizers to choose from and a greater selection of entrees.\n\nThat being said, I have had better Thai food. The chicken and shrimp fritters are flavorless and the meat inside is dry - it crumbles when you bite into it and you really need the sauce it comes with to vamp it up. The pad see ew is not spicy despite the chili next to its name. However, it tastes decent mild and if I pretend that it's not supposed to be spicy, then it's satisfying. I usually order my entree with chicken, but I decided to be adventurous and try the shrimp. I am really glad that I did. The shrimp really made the meal jump from two stars to three stars. Many Thai places overcook the chicken slices that go into these dishes so I was a little worried that it would be the same with the shrimp. These were fresh, cooked just right, and a decent size. They weren't jumbo, but they weren't tiny either.\n\nIf you're in the area, and looking for a cheap lunch around $10, then give Lantern a try. Otherwise, I would skip it and find some place better; it is not worth a train ride.", "author": "SukMon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "I had never eaten Thai until a few months ago when a co-worker told me to trust her that I would like it (I am a bit of a picky eater). Laterns chicken pad se ew is life changing!  I really can't believe I waited so long before trying it. The lunch special is an amazing deal - $9 for an app and entree and the portions are generous. \n\nSince I am a few Thai fan, I have started trying other resturants and as of now, nothing compares. \n\nThey have a large staff and the turnover seems pretty fast but I have never felt rushed here. The decor/vibe is really chill and relaxing.  I work in the area so we probably go to lunch here once every other week or so.", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-29", "description": "Lantern's pretty exterior masks pretty average Thai/asian fusion food that bring the entire cuisine down to the lowest common denominator. \n\nDon't get me wrong. The food isn't bad; it's just not great. You leave satisfied but the food is really an afterthought. With that said, I did enjoy the green curry here even though you can get it at many other places. I guess what makes up for the food is the ambience. Dimly-lit and intimate, it's a conducive spot for drinks and conversation. \n\nLantern is a safe bet - average food at average prices, decent service,  housed in a clean and contemporary space. Then again, so are many other places.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-19", "description": "While the food was good and savory, Lantern left us in the dark when it came to service.  For a party of four ordering everything from appetizers to drinks to entrees, one would expect a more attentive waiter. Unfortunately the service was almost non-existent forcing us to ask for things like refills and the check more than two or three times.\n\nThe food deserves a higher rating but there's just no excuse for poor service, especially when the check is over $100. Their reputation for awful service and so much more to chose from in this awesome neighborhood will no doubt leave this place in the dark.", "author": "Jay F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-29", "description": "Lantern is definitely not a four star establishment.  But they're pretty consistent, so I have no complaints.  I'd recommend their crispy duck salad, papaya salad with shrimp, and pad see ew.  However, I wouldn't recommend their eggplant basil dish - very strange, thick/ overly sweet sauce.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-18", "description": "Chicken and shrimp fitters are great...while the fried rice are just ordinary. Anyway it's tasty.", "author": "Nianyi W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-17", "description": "I found the service to be very horrible. My boyfriend and I decided to go here. When we walked in it was so crowded so we knew it would be a wait. The staff offered us a seat at the bar to have some drinks in the meantime. We sat at the bar for 30 mins and none of the staff looked our way to serve us any drinks. I kindly got the attention of the female staff and I explained to her that everyone was asked if the wanted something to drink at the bar except for us and we've been here for a while now. The female staff then looked at me and walked away to serve another table. At this point I wanted to leave, and if it was not for my boyfriend convincing me to stay as he observed what was going on I would not have stayed.", "author": "Shernell G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "This is about a 3 star place. The food is good and overally pretty decent but what makes it a 3 star you ask? It is one of the growing groups of not really true Thai owned restaurants but rather Chinese owned. \n\nWhile the food is reproduced quite well, what is really missing is the warmth of the a true Thai owners would  show. Rather this is just a nice looking interior that produces food. There's really no passion here it is just too make money. The reception was lukewarm at best. I hadn't finished my meal and the server was trying to get my plates because certainly they were trying to move the table. I still barely finished my meal and the server already placed the bill on the table. Maybe that was a hint?\n\nOverall, if you are hungry, sure this will certainly do the job but honestly, they lack the je ne sais quoi of the Thai culture and I rather patron a Thai own establishment.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "I absolutely love this place! Their food is beyond good. They always have great service. I love the cashew chicken and mossamon curry(sp)! And you can't forget the Thai iced tea (absolutely delicious) if you want an appetizer get the Thai spring rolls! Yummm!!", "author": "Mary J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-21", "description": "Been eating here for years. The food is good, consistently. I usually get their curries, spring rolls and drinks. Service is always hit or miss. If it's busy it's a miss . I had dinner here last weekend when they were busy , and service was not good. The waiter was missing, it was difficult to get new drinks/check. Also waited a while for someone to take our order.", "author": "Nina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Quick service, really delicious food, the veggies were cooked just right in my opinion, not soggy or overcooked at all. \n\nThe soup was just okay. But I definitely recommend this place!", "author": "Ben K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-30", "description": "Food was fine, nothing to write home about, a little on the pricey side but the portions were generous. The service was HORRIBLE. It seemed like everyone who was a server was very young and inexperienced so i'll give them some leeway but it was bad enough that i won't come back again. They never checked on us to see if we needed anything, a server dropped my garnish on the floor and was aware of it but never bothered to pick it up. There's too much competition out there to have lame staff esp. when there's a ton of staff just hanging out doing nothing.", "author": "James H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-13", "description": "This is a public service announcement - I got food poisoning after ordering the Massaman curry with chicken. It seems that the chicken was not cooked properly. It was either the curry or the Thai salad with bean sprouts. \n\nMy recommendation - steer clear of the chicken curry!!", "author": "Hank J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Not a bad option for lunch at $9 ,includes an appetizer (shrimp fritters , spring roll or salad). I usually order the Kee Mao or Thai fried rice, both very good. The grill pork chop is not bad either, good portion.", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-23", "description": "Underwhelming and over priced\n\nJust finished my bland and tasteless dinner\n\nWas in the mood for Thai and thought we would give this p,ace one more try.... Mistake!\n\nWe had the Tom ka gai soup, definitely lacking in flavor\nAlso had the pad se ew, the chicken actually tasted gross... Maybe frozen??\nFinished with green curry, another miss\n\nLesson learned, never again", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Great food. I tried the Tamarind red snapper and was not disappointed. It's enough for two people. The crispy basil duck is also fantastic. Can't wait to go there again. The staff is also great.", "author": "Desiree W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "It is a hit or miss depending on the time of day or week when you decide to come in. 90% of the time I have ordered take out, and if it is very crowded, I notice that the take out food may not be the best.  I generally like to order Thai fried rice, pad see ew, and drunken noodles.  I would like to order more, but the prices of many of their specials are just too high.  Plus, they recently increased their prices throughout their menu.  Unfortunately, I may be attending Lantern a bit less in the future.", "author": "Lauren W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}