{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Food is great! No complaints. Delivery is also great and prompt. \n\nAs a side note the waitress we had today thought it was acceptable to tell us the amount she should receive for tip. Not acceptable and quite rude actually.\n\nNonetheless, it did not change the good experience and the quality of the food.", "author": "Erica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Drunken noodle very good. Delicious Montague fried rice which is there Thai rice but with brown rice. Good deal.", "author": "Keyla G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Love this place and it's vibe and ambience! Got the Thai iced which was good but became very watered down with all the ice. The veg dumplings were alright. The entrees were all amazing. The red curry, pad Thai, and spicy basil fried rice were so Delish. Also SO REASONABLY PRICED! Definitely recommend :)", "author": "Radhika K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "My Favorite Place to eat in Brooklyn! My favorite Thai Restaurant ever, from the food to the atmosphere and the drinks. Every time I go to Lantern I always have a great experience even when I'm doing take out.. Love it", "author": "Nelida M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "It was a pretty cool spot. The place is so relaxed and nice. Food is cheap and really good. Thai ice tea is amazing", "author": "Ernst F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-18", "description": "Dependable Thai, right on beautiful Montague Street.\n\nThe room is darker and uses more wood than most of today's space-age, loungelike Thai restaurants, and it's very comfortable. It's also a fairly large space, and in good weather they have outdoor seating.\n\nThe menu is standard, and they do a good job of the classics. I have particularly enjoyed their basil duck, pad Thai, and duck salad. They cater to both the neighborhood residents and the many people who work nearby, and in the week they have a lunch special. \n\nThey now have brunch on the weekends, with a menu that's not Thai at all. That seems like an odd choice--they do what they do so well, but they're probably reading the market right. And the regular menu remains in force, too. That's what I'm happy to order from.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "Stumbled across this place while on business. The ambiance is great, low lights with lanterns hanging. The food was delicious and fresh. We tried the red snapper as well as the shrimp with asparagus. Definitely worth trying!", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-08", "description": "On Wednesday, The bf \u0026 I went to one of his favorite restaurants near his workplace. The decor of the restaurant, is very interesting and asian-like. I love how it's very dim inside and you can just smell that asian scent from the incenses, ahhh... but anyways, back to reviewing -- \n\nSomething I loved about the restaurant is that they offer a one complimentary appetizer but bf \u0026 I got two. One being \" Thai Style Shu Mai\" (Chicken \u0026 Shrimp Dumplings) and If there is really one or two complaints about this restaurant is that -- I've tasted better at Japanese Restaurants and there is definitely something wrong with their portion sizes. I understand appetizers are suppose to be a sample small dish from a restaurant, but seriously 3 shumai's!? The other appetizer we got was \"Chicken \u0026 Shrimp Fritters with Honey Chili Sauce\" and oh great, another dish that only came with 3 fritters. Overall, the texture was crunchy and I did love it.\n\nEntrees, I got a \"Grilled Chicken Breast Marinated Chicken Breast Oven.\nServed with Garlic Mixed Vegetable\" and I loved the way the chicken was  cooked to perfection and the way I like it and It was nice, tender, soft and delicious. The vegetables, were perfectly cooked and season and pretty good ,although I feel the dishes could have been filled up more. The bf, go\"Grilled Pork Chops,Marinated in Thai Herbs, \u0026 Served Sauteed Greens\" and The pork chops looked amazing, definitely different and  it was cooked to the perfect texture and very sweet and tender. \n\nSo overall, not bad service.... just need a better portion size!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-10", "description": "A pretty good Thai place in Brooklyn , they serve some really good food. Starting with the appetizers that I've tried; calamari, chicken sa-tae , and vegetable dumplings. The only one I would recommend is the calamari. The other two you can live without. Entrees that I've tried are ;\n(recommend)  pad see ew, drunken noodle, green curry\nPad see ew is friggin delicious, and my fav must try.\nDrunken noodles are good, but pad see ew beats it Green curry is yummy, not really spicy.\n(pass) pad Thai, whole garlic fish, honey duck. \nPad Thai was nothing special, I've had better. \nGarlic fish did not have a lot of flavor, not worth $23\nHoney duck had a burnt smell to it, and weird taste. \nThe decor is really nice, good place for a date. But keep in mind that it is really dark inside. Could have more lighting. Service was alright, could be better. The price is ok, but don't expect to get stuffed. The portions are kinda small. Overall great restaurant, will probably visit again when I go back to New York.", "author": "Wilson Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "I always get the spicy basil fry rice with chicken \u0026 spring rolls. Too Tooo good! FYI if you love spicy dont 4get to ask about the spicy tray.", "author": "I C Y U N V S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "Four stars for the pad see ew, three stars for the three pieces of dried shrimp that it came with. And as we all know, the average of 3 and 4 is 3.\n\nSmall piece of plastic in my food didn't help, but I actually don't mind that stuff much. Get the pad see ew with a different kind of meat.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-10", "description": "Decent food, green curry and crab rangoon (although not Thai by any means) were decent, coming from someone who lives in California.\n\nThe reason for so few stars, however, is the service. Our waiter persistently came to our table every 5 or so minutes to ask if we were done. We had over an hour and a half until Lanern's closing time so I didn't understand the rush, and I felt as if my meal/experience were being intruded upon. I didn't give our waiter a huge tip, and he yelled after me as I walked out about not giving a good tip, and chatted angrily with another waitress about it. In my opinion, if you don't provide good service, don't expect a good tip. And if that's the case, don't add on to the subpar service my complaining about my lack of adequate tip. \n\nI'd recommend this place if you want some take out, but don't eat here, it isn't a welcoming environment at all.", "author": "Lily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "I have been here several time. This is the place for some great Thai food. It is quite and the atmosphere is great. I visited once on valentines day and the decor was very romantic. The food is cheap and the food portion is good. I would revisit.", "author": "Tashana J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Lantern's food is ALWAYS well made and delicious. Be sure the thai iced tea and fried ice cream here, very worth it. The neighborhood is wonderful and the promenade is only a short walk away. HOWEVER, one star off as I have ordered from lantern, twice and the food is subpar compared to when dining in.", "author": "Pearl S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "Great spot in Brooklyn. They have a lunch special for $9 and it comes with an appetizer and a main dish. I had the chicken and shrimp fritter for appetizer and the eggplant basil for the main entree and it was up to par. I also had the Thai ice tea which was really good too. They have outdoor seating which sets a nice atmosphere for the summertime. Definitely recommend", "author": "Ellie O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "The decor is really nice, cute spot. The food is very well priced, the curries my friend and I had, had weird after tastes but the apps were good. The other food around us (not curries) smelled and looked delicious. We may have just ordered poorly, try something other than the green and yellow curry!", "author": "Josie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "Been here for the past two years and overall not any major complaints but a bit inconsistent with service (hence the three stars) the Chicken Pad Thai is my absolute fave! (4.5 stars) and the shrimp fried rice is delish too (4 stars) recently tried the calamari and it doesn't come with your typical marinara type sauce, but more of a sweet but tangy sauce. (3.5 stars) The Brooklyn location is 10xs better than the NYC one...", "author": "Christine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "This restaurant has an amazing pre fixe lunch special Monday to Friday from 11 to 3. We were there for our co workers birthday. The pre fixe specials come with complimentary appetizers. I ordered the shui mai for appetizers. It was mediocre at best. For the entree, I ordered the beef drunken noodles and I wish I could have that dish every week! I am still drooling about it as I'm typing this review! \n\nFood aside, the service was phenomenal! My coworker received an ice cream treat on the house cause it was her birthday. Rarely do you see such generous offers from restaurants. Great service, amazing food!!", "author": "Jason H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Cute little Thai place. Tom Kha Gai (chicken coconut soup) was right on point - transported me back to Bangkok and Chiang Mai in an instant. But the Tom Yum soup was kind of very ketchubby.... Pad Thai was fine, so were the drunken noodles. Thai tea was very sweet but otherwise amazing. Cute decor. Nice prices. Went with a large group", "author": "Wanmeng Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "The Good: LOVE their Pad Thai, Kee Mao, Thai fried rice, and shrimp fritters! The ambiance is also very nice. Its a great place to bring family, friends and dates.\n\nThe Bad: Sometimes when its really busy, it can take a while to be served. Plan your schedule for that day accordingly.\n\nThe Ugly: N/A", "author": "Dolores O."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}