{"aggregateRating": {"reviewCount": 433, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-10", "description": "I stopped by here one day for lunch and had a really nice experience. \n\nThe atmosphere is very nice and I like the lighting/decor a lot. They also have a really good lunch deal where you get an entree and an appetizer for $10 which is great especially considering the decent portion sizes you get. \n\nThe staff was super friendly as well, they didn't rush us and seemed to know just the right moment to come around. \n\nThree stars because the food wasn't anything special (still good though.) I had ordered the tofu pad Thai and the spring rolls. I'll probably be back sometime too for their great lunch deal and satisfying food.", "author": "Claudia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "Love the volcanic chicken----which is a show stopping meal, because the chicken literally comes on fire! My friends enjoyed the crispy duck and whole snapper, which is also visually impressive.\n\nThe spicy basil fried rice wasn't as spicy as I've had it at other places, which means  you should ask for extra spice.\nThe curries are passable, but not spectacular.\n\nOverall decent Thai food that will fill you up...", "author": "Jay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "Such a cute spot for Thai! Servers were nice \u0026 gave recommendations from food to drinks. Very impressed.", "author": "Carolina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-26", "description": "Lantern Thai restaurant in Montague street is always my go-to lunch restaurant whenever I'm in Brooklyn Heights neighborhood.\n\nLantern is popular for the $9 lunch special that includes an appetizer, then customers can choose from noodles, stir fry or grilled entree options. The dishes are freshly cook and delicious. Except for my recent visit where I found that my pork Shumai was somewhat uncooked. I asked the waiter if it was frozen, he apologized and immediately replaced it with a well cooked replacement.\n\nAs always, staff are awesome and nearby. They are ready to help whenever you need anything.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Staff is always on point. Food is delicious and comes out quick. Perfect for lunch breaks.", "author": "Kaitlyn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Amazing food!\nAmazing service!\nAmazing experience!\n\nI just got back from Thailand and this restaurant is as authentic as it gets! So so so good.", "author": "Salina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Literally the best Thai food I've ever had. We go every time we're in town. Love the curry, fried rice, pad Thai and everything else we've tried. Can sit inside or out and have always had great service.", "author": "Andria E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "Lantern made me miss the Thai places in my tiny college town because at least their drunken noodles were spicy and didn't taste like overpriced fusion spaghetti with wide noodles and coated with the flavor of cooking oil. Sad, I really thought that this area would have a lot more to offer, but alas, it's a little too commercial to have good food. \n\nI will say the food was not as dry as airplane food, though the bathroom could possibly be found inside a plane, it was practically standing room only.", "author": "Claire P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "I visited this restaurant plenty of times and every time it never fails me. I ordered my go to of drunken noodles and shrimp. This dish is very flavorful and spicy which gives a good kick. The atmosphere of the restaurant is very dim and calm which makes it an great date spot. The space is pretty small. The waiters were pretty attentive to your needs. Overall a good spot to check out.", "author": "Kevina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "The best Thai in Brooklyn heights! Fresh and quick delivery. Drinks are a little pricy compared to area and uniqueness but food is the best! Love the spicy basil rice.", "author": "Jessi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "I had a very nice time here. My friends and I went last to celebrate her new job and apartment. The atmosphere is very cozy lighting is comfortable and low. The staff was very attentive and had positive energy. This place is a Thai restaurant and their menu had a great variety of flavors and options. We had appetizers and 3 main dishes and drinks. I had curry puffs that were absolutely delicious. My friend had a wrap thingie with avocado in the middle and it was delicious. ( large portion ) for dinner I had curry chicken and I couldn't eat it fast enough it nearly blew my socks off. A large portion with great flavor. My other friend ordered a tofu dish that was delicious as well. They also ordered shrimps (can't eat) and they looked really good. My friend ordered a sweet rice and coconut dish which she enjoyed  and took the rest overs home lol. They said the alcoholic drinks were good abut I orders the jasmine tea it was perfect for my throat. I have no complaints about this place and I can't wait to go back. The bill was very reasonable for 3 people we paid about $100", "author": "Tina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "I love Lantern!!! I am a huge fan of fried rice from Saint Louis and NYC has a different type of rice that I don't like very much. After having the Pineapple Fried Rice at Lantern, I am in love and it's as close to Saint Louis rice as I'm going to get! I even brought family to Lantern when they came to visit and they also approved the rice which is huge! \nThe rice can be served in a pineapple or as a cone shape on a plate. It has pineapples, cashews, raisins, onions, carrots and you can add chicken or shrimp. I always get shrimp. They also have a cheese wonton appetizer with crab that is amazing!!!\nIf you are ever in the Brooklyn Heights area I strongly suggest Lantern. It's a nice, cozy restaurant that has outdoor seating on a quiet residential block. It's one block away from the promenade so after dinner you can stroll over there to get great views of the city!", "author": "Tabitha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Yummmm pretty much sums up my meal. \n\nThis is a nice, intimate Thai spot with indoor/outdoor seating. Atmosphere is chic. A/c was pumping on this summer night (grateful). It's located by the Brooklyn Promenade, so parking will take some time.\n\nWait staff was on point...felt a little rushed at first, but then again it was a Saturday night. However once orders were in, both drinks and good came out in a timely manner. \n\nAppetizers were good. We had spring rolls and some type of chicken skewer, and curried puff sorry, can't remember the names). The sauces were tasty. But the real deal was my meal! I had a whole snapper in tamarind sauce with jasmine rice. Everyone at my table was up in my plate!!! It was more than enough, not too spicy and well prepared. If you go here I totally recommend trying. \n\nI did get my big girl drink on...I had some slush type drink with liquor(another name I can't remember). But it was good and I'm not a drinker. Everyone at my table enjoyed their drinks and food as well. \n\nThis place was a hit. I would go there again. Prices were reasonable.\n\nNote to self: Write my review sooner so I could tell you all the names ....smh", "author": "Janelle H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "This is my to-go spot. If they delivered, I'd be ordering from there all the time. In my opinion you can never go wrong with Thai. \n\nFor appetizers we got fried calamari and friend tofu. The calamari was light and crispy. Must try. The tofu was bland. It wasn't crispy. For tofu I didn't expect much. It's probably all about the sauce. \n\nThis time around I ordered the Green Curry (recommendation from a friend). The green curry was delicious af! The curry is semi-sweet and savory. It is spicy but not so spicy that you'll have a runny nose. The green curry comes with a side of rice. But I had to order two because there was just so much curry left. (Currently craving it.)\n\nFor drinks I ordered a watermelon martini. I associate watermelon with refreshing so I was really looking forward to it. When it came it was far from it. I did not taste watermelon at all. It tasted disgusting like the cherry cough syrup your mom made you down as a kid. The waiter came to check on us and asked us if we liked the food and drinks. I hated my drink but didn't want to trouble them to change it. If I order it and don't like it, it's not their fault. Just won't order it next time. But my friend convinced me to ask them to change it. They changed it no problem and took the drink away. I asked for a safe bet mojito. Can't get that wrong. It was really good. It was strong but not overpowering. However, both drinks showed up on the bill. So that's really annoying. I didn't notice until later. \n\nI give it three stars based on this experience. But overall the experience was very pleasant and would definitely go again.", "author": "Bennet G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "Third time here, great pad sa ew (forgive me if I spelt that wrong) Its a noodle dish with a type of chinese lettuce and your choice of beef (what i get), chicken, shrimp, and tofu. \n\nthey have a great lunch special (not on weekends) where you can get lunch for 9 bucks. great deal! I always get the soup (always miso) but thier other stuff looks great too. \n\nfast service, very efficient. maybe make sure you guys have enough soy sauce dispensers so you dont have to take mine please? \n\nbut they dont pressure you to eat fast which I REALLY appreciate.\n\noutside eating is available but I preffure inside. very nicely decorated, although a bit dark.", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "Lantern is a great choice for a cheap and quick bite to eat. The menu is simple with great choices to pick from. Excellent service and a friendly staff.", "author": "Almaria B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-20", "description": "Used to really like this place but stopped by for lunch today and the quality of the food and service has declined tremendously.\n\nTheir lunch special is good, comes with an appetizer and entree for $10 so maybe order takeout!?", "author": "Cara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "I love ordering \u0026 eating at lantern! My favorite thing to get is the pineapple fried rice with chicken and or beef!", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "The best Thai place in Brooklyn heights! Delicious food, fast service, great dinner experience. Would recommend!", "author": "Molo H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "During jury duty, the judge gave us a little over an hour for lunch one day. Which is just enough time to get some lunch at Montague Street. Lantern advertised their $9 lunch special on a marker board just outside their restaurant. For $9, I was curious so I stepped in. It was too dark inside for the lunch rush. Did they forget to pay their electric bill? It is not necessary to make a restaurant so dark in the middle of the day. Are they hiding something in the dark?! \n\nI sat down anyways because I made it that far and I was running out of time. I ordered the Grilled Pork Chops lunch special.  I was presented with two pork chops laying on top of a bok choy and american broccoli medley vegetable mix and white rice. \n\nThe pork chops were not dry, the vegetables were a perfect side and it's Asian, so you need some white rice to round off the meal. For $9 it was worth it. If I could give Lantern 3.5 stars, I would. The flavor was okay. Nothing out of the world. I wished there was more \"grilled\" taste but it was okay. For the price, I was happy. It was just not enough flavor, lighting (ambience) and service to push it to a 4 star. Please turn on the lights! Ambience in a restaurant doesn't mean you need to keep it dark!!! \n\nonto more jury duty adventures....", "author": "Sally W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lantern", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "101 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/pZvKoHX1duSLs-DUhuLlfA/ls.jpg", "@type": "Restaurant", "telephone": "+17182372594"}