{"aggregateRating": {"reviewCount": 31, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "Philly Cheese Steak in New York City From Skyline Deli, Brooklyn https://youtu.be/Ri8jdcmlW1w\n\nSkyline Gourmet Deli is always busy. It's located in Downtown Brooklyn. Overall, it's the best deal in the area that has seen wave of gentrification within the last decade (10 years). Everything is the that area (Downtown Brooklyn, NYC) is incredibly expensive - from Chipotle to Metro Café, Pot Belly to Panera Bread, and finally, Five Guys to other misc. restaurants/fast-food establishments. The reason [   Skyline Gourmet Deli    ] is such deal is because they've kept their hood prices relatively aligned with \"hood prices\" even though the neighborhood has changed drastically.\n \nFries and Sandwich range less than $10, and compare to other establishments offer the a similar deal, [ Skyline Gourmet Deli  ] beats them because of the quantity of food. No longer would you be disappointed or hungry for the lack of food,  [ Skyline Gourmet Deli ] offer an incredible portion to satisfy even the hungriest of individuals.\n \nAnd for the more health conscious individual [           Skyline Gourmet Deli] has not forgotten you - they offer salad at non-competing price points; a salad at Metro Café (same ingredients) will cost you $10.00. At [    Skyline Gourmet Deli   ] it'll only cost $6.75 with a bottle water included, thus, achieving a healthy meal and hydrating at the same time.\n \nToday, I purchase one of my favorite items from [  Skyline Gourmet Deli   ]; the Philly Cheese Steak on a hero (only $6.00). OMG!!!!!!! [pause for mouthwatering effects] The Philly Cheese Steak is the mecca of this establishment - the caramelized onion, the green peppers, the thinly sliced steak covered in the classic American cheese (disclaimer: I think American Cheese is America's worst creation), and finally, the item bring this tasty, heaven sent bundle joy, the Italian bread (yum!!!!!). \n\nIf you're in the area check out Skyline Gourmet Deli.", "author": "Darrel F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-31", "description": "Got food poisoning from this place TWICE, the food orders are always wrong and breakfast is usually undercooked. This place is terrible and they always get the order wrong.", "author": "Juan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "Must've been drunk ! Saw my bank statement I ate here lol. All I know is I was Greasy as Tom Brady on an oil wax lol. White shirt had sauce and Katie left for work or something but i couldn't get a hold of her so I came back and got a tuna or turkey hoagie which filled me and later on we saw avengers with my friends . It was fun they all died", "author": "Jim R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-13", "description": "Disgusting customer service. Ordered food with specific directions to leave dressing on the side. Deliver it dripping in dressing. Call the place to have it changed and they refused to do so and tell me there is nothing to done. Left me on hold for 15 minutes and kept hanging up the phone on me and giving me the run around. Never ordering from there again.", "author": "Gabrielle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-05", "description": "I used to work in the area and I would always order for delivery. Food is average, but a little expensive.", "author": "Tamara L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "There are Boar's Head signs posted all over the place, inside and out, so I ordered a sandwich and specifically requested Boar's Head ham. I don't know what inedible frankenmeat they actually shoved into that oversized marshmallow they called a roll but it was a frightening bright red and full of gristle--exactly like that crap my high school cafeteria told us was \"ham\". Since I didn't eat it back then and certainly wasn't about to eat it now, I was out 8 bucks. Why do they pretend to sell something decent if they have no intention of actually doing so? Do they think we can't tell the difference? Also, there's nothing \"gourmet\" about the place. They probably should stop calling it that.", "author": "Marie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "Over priced store and orders take extremely long.\nI bought 2  croissants egg white, little onions and cheese and paid almost $15 because they charged me as a full omelette (EACH). Sorry i could be wrong but i thought a omelette consist a combination of meat, vegetables, mushrooms etc ALL TOGETHER .. never again, \"Go Detox\" on bridge st are better.", "author": "Stephan A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-17", "description": "Ordered from here for breakfast and lunch. Really disappointing food. Their egg sandwich was alright (even though they didn't toast the bagel like I asked) and their hash browns were pretty good. But their chipotle chicken salad sandwich was awful. The roll was small and there was a tiny amount of chicken salad on it so the sandwich overall was not filling. The chicken salad was super dry and not flavorful. Also, I asked for plain chips and they gave me salt and vinegar chips, which I hate. Won't be ordering from here again.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "I go to school nearby and this is my go to place for breakfast lunch and dinner! The guys are so nice! The food is great! Try their #11 on a spinach wrap. It's so good!", "author": "Yoali T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "This is going to be my new breakfast spot without a doubt. It's an \"in and out\" deli. By that I mean you order your food, get your food, pay and get out. They seem to be fast, efficient and reliable. The prices are matched with other places nearby and the quality of food is better than most. \n\nYou can order through Seamless and/or Yelp for much faster service. If you order online there is also no minimum. \n\nThey have a prepared menu you can choose from or create your own. They have a $6.00 minimum for credit and debit cards which is also average for the area. \n\nThe cashier staff is also friendly and efficient.", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "Gourmet deli food? Hmm sounds pretty good, right? I had their chicken culet and cheese sandwich. The chicken was hot and crispy but the bread was saggy by the time I ate it. The sweet peppers give the sandwich extra flavor but I wish they have added more cheese, lettuce and tomato, it wasn't enough to balance the peppers.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "A good lunch spot! Convenient from my place of work too\n\nI reduced one star because of the unorganised way the paying and ordering for your items occurs when it's busy; they pretty much just randomly start taking people's orders or payments and people will just shove in front of you.", "author": "Randy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-05", "description": "Not only has the \"Skyline Deli\" renamed itself the \"Fantastic Deli,\" but the sign now boasts that they are serving \"Brooklyn's Best Food.\"\n\nThings They Are Not.\n\n1. Modest.\n2. Serving Brooklyn's Best Food.\n\nThings They Are.\n\n1. A reliable spot for fairly cheap, tasty sandwiches.\n2. Open 24 hours.\n3. Somewhere I'll be buying many a $5.50 #15.*\n4. Right next to the R train.\n5. Somewhere I'll be back for a cheesesteak, because it looked surprisingly good. \n___________\n\n*Chicken cutlet, melted cheddar, jalapenos, sweet peppers, mayo, lettuce, tomato. That's a lot of stuff for only $5.50. And it was sizable, and pretty damn good, too.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-26", "description": "If you want to get chewed out for ordering on Grubhub before 7am, then go here and get verbally beatin up. Their customer service before 7am sucks, everyone knows it. They have so much competition and they're rude to customers early in the morning?! Talk down to your clients! thats the best idea right?! Beyond Rude.", "author": "Christian L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "They worst place 7 dollar min order wouldn't let 6.00 order slide for reg customer .. worst place...high priices bad ...customer service worst..", "author": "Joe H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "They're fast, good food, always get my order right, and friendly. It's perfect since my workday is so hectic and they deliver hot food on a timely matter. I basically order from them almost every other morning and have yet to have a problem. I recommend the egg whites, grilled chicken, and veggie breakfast wrap especially if you add avocado. It's very yummy.", "author": "Miguelito J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Skyline makes the best sandwiches in downtown Brooklyn the line is sometimes long but they always move fast \u0026 everyone gets taken care of. Will definitely recommend this store", "author": "Jasmine R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-14", "description": "I've been stopping by here for almost 20 years because it's near my office.  The owners are nice but the guys behind the deli counter are miserable and confused.  To be fair it might be because they don't speak English very well.  I ordered a $6 Triple Decker B: Roast beef \u0026 Turkey w/cole slaw \u0026 Russian dressing.  Here's what I got: 3 slices of staling bread, 2 slices of roast beef, 2 slices of turkey with cole slaw on the sandwhich instead of on the side, as is the usual.  The place has just renovated so it seems cleaner and brighter than it did before but it looks like they're serving less for more these days.\n\nTo be fair their breakfast meals are great if the guy behind the counter gets it right --which is a 50/50 chance in my experience. Expect a line in the mornings and during lunch hour so it may take 5-10 minutes to get your food and go.  \n\nThe place is also frequented by some very interesting neighborhood characters!", "author": "L A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-29", "description": "Just lost me as a customer.\n\nI've been coming here for over a year and the employees were always very polite. Today I got a foul smelling and awful tasting bottled soda even though it was previously unopened and not their fault. Their politeness disappeared when I told them about the situation and suddenly criticized my taste and said there was nothing wrong.\n\nI was confused because they seemed very friendly when I stop by and as a frequent customer, I would think they would be a little more lenient and understanding. I guess their true colors showed. Goodbye Skyline. Luckily there are alternatives in the area.", "author": "Adrian L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "Thier food is very good if you order ahead the wait time is not to bad ... But the coffee Is HORRIBLE !!!", "author": "Joanna T."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "The Skyline Gourmet", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LCYp-ARf9D5_g--mkjh8pg/ls.jpg", "@type": "Restaurant", "telephone": "+17185221963"}