{"aggregateRating": {"reviewCount": 31, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "Now know as Skyline Deli, they are the bomb.\n\nopen 24h (its the only thing!!!) The people do their job, can hold a conversation if you are trying to have one.\nOh and their sandwiches are great! My personal favorite? Philly Cheese steak! They do it right.", "author": "Andres D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-26", "description": "Good coffee and quick food. its a decent place to buy simple items.  I have never had a problem.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-03", "description": "Four stars for a bodega? The same you gave to Brooklyn Fare down the street?\n\nLet's put it this way, there are a lot of things this place doesn't necessarily have going for it:\n\n- It's not particularly large, as there's a good chance if more than two people are here to buy anything at one time there won't be a ton of space for you to maneuver past them.\n\n- There's not a ton of selection, and a lot of the pre-packaged stuff leaves some look-and-feel to be desired.\n\n- Sandwiches are kind of small.\n\nThat said, let's talk about the fact that it's open 24 hours a day. How great is that? There's there's nowhere* that can prepare you food at 2 a.m. between Jay St. and Flatbush and outside of the Duane Reade up on Atlantic, which certainly doesn't make sandwiches, there's barely anything open.\n\nThe staff does nothing more than give me what I asked for and take my money -- which is great and all I want them to do.\n\nDid I mention it's open 24 hours a day?\n\nThis neighborhood is screaming out for late night food, or a local bar with some grub, but for now Fantastic Deli is exactly as the name implies.\n\n* - That's not even hyperbole.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Love them! They cook my food just how I like it. I order breakfast everyday from them. They practically know wat I order all the time n jamal and his brothers are really nice. Good family business. Good service.", "author": "Redgem M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "Godsend for NYU-Poly students", "author": "Albert A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-07", "description": "Food is ok about 3 stars.  Its not the reason for the one star. Its the service received.  I ordered a Ruben with jalapenos.  Then i paid with a debt card.  When the sandwich was done the lady behind the counter looked at me with a stare and was like you owe me 50 cents and i was like no problem just run my card again.  She looked at me with disgust and then told me you owe me 50 cents for the jalapenos, which i replied to with i don't have any cash.  She just threw the sandwich at me and said you owe me 50 cents next time. Not a pleasant place and would not recommend it to anyone.", "author": "Ankur P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-20", "description": "I love this place. Great staff. Typical Deli selection and typical exorbitant Deli prices.", "author": "Rowland H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "my dad and i were looking for a place where we can get a quick breakfast while my mom and brothers were at the hotel waiting for us. we saw this place while we were walking back towards the hotel, we saw this small deli. one thing i like about this place was their breakfast section prices were really cheap. i order 5 turkey bacon and egg roll (2.50 per roll) while my dad got a big water bottle and coffee with the total of 16 something. my dad and i thought wow the prices was really cheap with the among of stuff that we had bought from this deli. The cooker cook the food quick too especially since we order 5 breakfast sandwiches. luckily enough this place was a few blocks from our hotel. i would definitely visit this place again if i am in town.", "author": "Julie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-09", "description": "Skyline Deli is hilarious. Being 24 hours with the exception of late Sunday nights where they pack it in for a few hours, and the only 24 hour place around there besides the Duane Reade, in this particular neighborhood, with a mix of construction workers, locals, scantily clad patrons from Kevin Barry's, and night workers, it's just an incredibly interesting intersection. \n\nCondensation from a fridge that's not cool enough; an A/C that's never on, but there's an old rusty fan blocking the Pringles that is. One security camera in case things get rough. And a night cashier/manager who is one of the cockiest mofos ever, but he charms the pants off of every lady that comes in. And they banter, and it always makes me laugh. He says to me, \"Vic, you gotta help me, I am looking for a nice Asian girl who is also a Muslim, I can bring her to my parents, and I'll take care of her, that's perfect\". \n\nNow there are two deli guys here; one is not a deli guy, he works slow but is a nice person, just doesn't have the skills. Now, the other guy, he's a deli guy, he'll memorize 6 orders and get them all done in record time. And your sandwich will be pretty fat.\n\nTheir sandwiches aren't remarkable but they are good and priced moderately; you can get a chicken cutlet sandwich with some very good fries for 6.50, no tax. \n\nConvenient for late night (their breakfast lines go very quick as well), but it's the laugh and the really good banter and people that keep me coming back.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-26", "description": "Sandwiches aren't remarkable, but with $6.50 on all sandwiches, not a bad place for the area.  Also open 24 hours a day, too!  Too bad they don't got alcohol.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-19", "description": "This is a run-of-the-mill NYC deli. Nothing is special about it except for that fact that is a bit cleaner than most. They have the usual deli selection with small portions of deli meat on each sandwich, the normal line of regulars during breakfast and lunch, and typical prices ($6.25 with tax for a hero). Eh The only good thing is (for those of us racking up credit card points) they take them for purchases of over $5.", "author": "Kay Z."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "The Skyline Gourmet", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LCYp-ARf9D5_g--mkjh8pg/ls.jpg", "@type": "Restaurant", "telephone": "+17185221963"}