{"aggregateRating": {"reviewCount": 2, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-01", "description": "The food at this place is consistently good and should be a destination for a sandwich or their fresh baked croissaints. Unfortunately service gets in the way of me making it a consistent stop. If there is nobody in line step right in. If you see even one or two people standing in line you could be spending the next twenty minutes or more waiting for the order to be filled and to get checked out. Space is at premium in here so it gets a bit more cumbersome if more people start coming. Basically it's 5-8 minutes per customer to get served.\n\nLet's talk about the positives though. All the sandwiches are made with a fresh ciabatta roll that is crispy on the outside and soft on the inside. The aforementioned croissant's are egg-y and delicious. I've been told they're quite Parisian. You can't go wrong with the meat here. It's usually been slow cooked or roasted fresh daily. The honey baked ham is awesome. He has a plethora of sides to choose from and you can pre-order a Thanksgiving dinner in November. In the summertime his gazpacho is fresh and tasty. Beat a path to Cobble Hill Park next door and enjoy! The service is definitely a 2 to 3 star situation. The food  is a solid 4 stars. Also don't forget to check out the cheese case for some interesting stuff and some of the best Talaggio I've had.\n\nUPDATE: This mainstay of my Cobble Hill life has just closed as well as his other spot, Nova Cafe on Court street. He's apparently going for the ride with his wife's new job in Hong Kong. Best of luck.", "author": "carl g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-17", "description": "This  take out food establishment is gone.  It was way to good to call it just a \"deli\".   RIP -  Veranda place Deli [ aka the Red Door] , I had to give you only one star .   The space  is now occupied by  Ted \u0026 Honey's and we pray for them too.  They may need even more prayers  than the defunct  Red Door.", "author": "jim r."}], "servesCuisine": "Delis", "priceRange": null, "name": "Delicatessen Verandah Place Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "264 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": null, "@type": "Restaurant", "telephone": "+17188521991"}