{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "Quite often, I've found myself ditching the Dekalb food market for metro feast salads. Although this place seems to be known for the buffet area, there are flies flying around during the summer time. Something about open air buffets are off putting to me and seem unsanitary. \n\nAs for the salads, small salads are $6 and large is $8 with 5 toppings each and a choice of protein. I usually get a large with kale, Cajun chicken, fresh mozzarella with French dressing. The large salad lasts me 2 meals. It is my holy grail since most places do not serve fresh mozzarella. \n\nI highly recommend the salads here! (:", "author": "Ruby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Super fast with all kinds of foods available. You want a salad? They have it. You want sushi and noodles? They got it. Breakfast? Yep. Sandwiches? Mac and cheese? Fresh fruit!? They have it all.\n\nPrices are really great for the quality and freshness of their foods.\n\nThey have a huge selection of hot buffet items all day, along with a salad bar, breakfast bar, pressed sandwiches, Mexican, sushi, and a ramen/udon bar.\n\nI love their udon. Lots of ingredients and their broth is very flavorful. A huge bowl is less than 8$. Sushi is always fresh and well made, and very affordable.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "I've walked past this place a handful of times and never thought to go in until one day over the past summer. I was impressed with the food options; buffet style hot foods, salads,  fruits,  coffee,  etc.\n\nI was more than happy to grab the tropical probiotics mango and pineapple juice with a fruit salad.  I'm thinking of trying their hot food one day and definitely their coffee at some point. \n\nThe location is spacious and located right at the corner so it's visible. That particular block has more pampering establishments (nail, eyebrow salons, etc.) so it's refreshing to have a spot to go to for various types of food and beverages.", "author": "Jessy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-01", "description": "This has to be one of the best buffets in the downtown Brooklyn / Boerum Hill area!\nI'm a southern cook, but their brisket can give me a run for my money! The selection is amazing! They even have the nerve to have breakfast food y'all!", "author": "Shawanna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Pretty much sell everything at good quality. My favorites are the California burger or the Chicken Tacos. Will one day try the buffet, noticed they have Italian dishes like Ziti \u0026 stuffed shells. Yum!", "author": "Jasmine S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "Decently priced and palatable food for the area given that everything else in area so overpriced. When they first opened i felt like the quality was better especially the hot food area. I do enjoy their breakfast sandwiches tho. \n\nI want to recount my last visits at establishment. I treated my team to breakfast a few weeks ago. One of the items i ordered was listed as 5.45, my colleague noticed the price when i got back in office and was like dang i buy that everyday and pay 4.25. Low and behold a few days later he orders the same thing with potatoes and pays 5.95. Im not sure if it was sexism at play but that was a real turnoff not to be consistent with your pricing. Hey maybe he was getting the homie discount.", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Been here only for breakfast. Like the food made and oatmeal but haven't tried their breakfast buffet so I can't comment on that. Love the oatmeal and the fact you can add extra toppings provided by them. The only thing I would say I don't like much is that they don't  place fresh daily fruits. Sometimes they seem fresh and sometimes it seem like they have reused the same fruits from prior days. Which with bananas and stthey look old and brown", "author": "Ana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Pretty decent food.  Hot buffets, salads, smoothies,  juices, paninis, curly fries, pizza, sushi, cake, chips sodas, etc. U name it , they have it !\n\nAmple amount of seating as well. \n\nAnd the check out line moves pretty fast. 5 cashiers total. \n\nTheir staffs are friendly as well. \n\nWhen they first opened they had a promotion going on 10% off for employees around the neighborhood. \nNow they only offer student discounts.  Which is still a plus!\n\nOverall good addition to the busy streets of nevins in BK.", "author": "Katrina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "They have a little bit of everything here. Hot bar, sandwich​ counter, pre-rolled​ sushi, and a build a salad bar. Lots of pre-packaged stuff as well including drinks, candy, and breakfast items. \n\nIf you work or live in the area I'm sure you can find something to eat here.\n\nI tried a hot sandwich with roast beef and it was huge and delicious, as I would e​xpect from a deli here. The muffins they sell have attractive flavors but are super crumbly so don't eat them if you're trying to stay clean.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "The food is great!!!!!\nThe customer service is beautiful and outstanding\nI love the variety of foods and it is very clean en their bathroom!!!!!!\nI definitely recommend this place if u want a quick brunch or coffee shop environment \nExcellent spot", "author": "Michelle E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "We had breakfast here and it was real good!\nMy daughters opted for the fresh food bar, which I think is a ripoff. $8.50/lb for fruit? Scam! With that being said, everything on the \"fruit and potatoes for the price of steak\" bar was fresh and delicious. I'm not a fan of this type of thing, but they loved it. \nWe, parental units, had omelets ($4, including coffee and potatoes) and they were excellent... as well as being a great deal! The potatoes weren't very good, but for $4 I'm not gonna complain.\nService was amazingly friendly and the place is bright, shiny, clean, new and inviting. \nThis place rocks!", "author": "Charles S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "Very impressive deli nestled in the backstreets of downtown Brooklyn. \n\nThe quality and the selection on offer definitely put it in the upper echelons of NY deli's - they have a massive steamed salmon freshly made each day. In addition, from memory, they regularly feature a nice selection of salads (Greek, Caesar, seafood, mozzarella and cherry tomatoes); sausage and peppers; Chinese chicken; fried chicken; roast chicken (basically lots of different types of chicken); lasagna/pasta; hot mixed seafood; duck; char siu pork or other varietals thereof... And many more. This is not an exhaustive list but any means. \n\nThey also have a salad bar which looks pretty good but I've yet to try and a sushi and ramen bar which also look very tempting. \n\nNB - if you're coming for the deli come before midday. It's pretty quiet before then and the food is mainly undisturbed but come midday and the lunch rush hits the buffet begins to look like the remnants of the fall of Rome - the salmon disappears very quickly. \n\nOh, they also have a very good selection of snacks and drinks.", "author": "Tommaso S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "After passing this place for a while on the bus I was finally in the area to finally go in and grab some food. I think of this place as an extensive deli with an array of options. If you just want to grab some chips and juice you can do that, but you can also grab hot food which is situated in the middle of the establishment. For the most health conscious there is a section where you can create your own tossed salad made; and for those who enjoy sushi there is a place for you in the far right corner from the cashier. The three star rating has nothing to do with good or bad but the fact that this really isn't nothing special about this place, the food is good, reasonable priced, and I was satisfied by the food provided here, so good job  .", "author": "Kaycia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-30", "description": "Me and my husband have ordered from here quite a few times. The only con is when I create my own salad, sometimes they dont have 1 or 2 of the ingredients I asked for. But they do call to let me know so I can chose something else and they are pleasant. Other than that, we like this place :)", "author": "Chel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "Metro Feast is a stressful and affordable experience during a lunch rush, letting you choose from anything and everything so that you can get a quick and easy bite before presumably getting back to work.\n\nI asked about the Cuban sandwich - what kind of mustard did it have? \"Regular.\" I didn't press further, since the guy in charge of the sandwich area clearly was not interested in answering my questions or taking any more time on me than necessary (fair enough during a lunch rush), but it didn't matter anyway. Though I ordered a Cuban panini, I wound up with something that appeared to be roast beef and tomato or something like it. It was a decent sandwich, but most definitely not what I ordered.\n\nWhy am I giving this two stars? Speed and variety, and the assumption that other people mostly get their orders right. Here's hoping, because my experience was not great.", "author": "AJ P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Food is amazing! i got the bacon cheese burger deluxe with onion rings, it was so good. The bacon was crispy and the burger itself wasn't oily like most burgers are. The beef was a bit dried up but when you bite on it, its bursting with flavors. i should had asked for some sauce on the side.\nMy total was less than 10 dollars and it came with a drink. i totally recommend coming to this place. i will be coming back to try more of their stuff.\n\ncame back today and its as excellent as always, the burger was even better than before. the place is definitely one of my favorite spots to grab food.", "author": "Jacky M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-27", "description": "This place leaves their garbage literally all over the sidewalk. It's disgusting. It tells you a lot about how they prepare their food. Check out their inspection reports [http://a816-restaurantinspection.nyc.gov/RestaurantInspection/SearchBrowse.do]", "author": "Emily T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-09", "description": "When ordering on Seamless, didn't ask what type of bagel I wanted. Called 5 minutes later and said it was already out for delivery so I couldn't choose what type, which in no way was true. In the text box I asked for my bagel to have tomato and be toasted. They added the tomato but the bagel wasn't toasted.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "The much awaited Metro feast is open!  Months of walking by and anxiously awaiting this deli opening has paid off.  Today is opening day and it is evident this has the potential of being a go to place on the way to the 2/3/4/5 subway.  \n\nThere is a variety of food.  The hot bar has numerous selections.  Refrigerated beverages to go. There is an udon bar and sushi. There is a sandwich bar as well. \n\nThe man behind the udon bar was incredibly nice and friendly.  He offered a sample of the soup- it was very tasty and spicy- great to warm you up on a cold day like today.  I couldn't help but then decide to actually sit and have a quick lunch. I had the salmon roll ($6.25).  It was fresh and tasty.  The seaweed salad ($3.99) was delicious and almost crunchy with a sprinkling of sesame seeds. \n\nThe cashier was also very friendly and apologized for not having chopsticks due to the brand new opening and offered me forks.  It seems like everyone is settling into the flow here.\n\nI can't wait to come back and hopefully be able to give it the full 5 stars.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "I've only had their buffet and their iced coffee. But I think it's great. They have many options for breakfast and lunch. Service is really fast, very friendly staff. Their roasted duck and ravioli is my favorite. Food gets kind of old by like 6-7 so try to go earlier.", "author": "par n."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "Metro Feast", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "340 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/AgUWgKcnNomDMPKRD9T1tw/ls.jpg", "@type": "Restaurant", "telephone": "+13476893295"}