{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "Good variety of breakfast food on the buffet. Over easy eggs are perfect and free small coffee if you spend $4.50 on breakfast. Good deal if you can't decide what to eat or want to keep up on a Keto diet.", "author": "Isis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Metro Feast is a buffet style takeout with a small sitting area. It also has a salad counter with fresh veggies, a grill, and a sushi counter. They even make burritos and pizza I think. I eat here at least once a week, usually when I can't decide what to eat or when I'm tired of the monotonous food in Downtown Brooklyn. I love that they have a whole fish out on Fridays and their food is generally solid and consistent every trip I take.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Got the Italian omelet. Very good. Despite the attitude of the cook, I have 5 stars. The employees were very nice and smiling. Haven't seen too much of that since being in NY. Highly recommend this restaurant.", "author": "Jerome N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "Surprisingly good sushi for a great price. 50% off after 7:00pm!\n\nThey have a soup station where they make noodle soups according to your taste. Especially worth checking out when it is cold outside.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "At this time prices are decent due to the discounts. Myself and several other have eaten from here no food complaints so far. My only pet peeve is the same with all buffet style places; reaching over food to get to other food, lids left off soups, dry fish and chicken, oily fried food (list goes on). Overall I recommend the place if you haven't tried it. It's ok for veggies and buffet salads (no reaching over food).", "author": "Clari B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "The staff were friendly both times I went, and I found myself really impressed by the wide selection of food. I got a Gyro and Sushi, and both were quite tasty! Haven't tried the hot buffet, but the food looks like a typical Chinese American buffet with additional American dishes like fried chicken. Prices are good too, glad that's it around!", "author": "Byran D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "Love this place. It's clean, well run, has reasonable prices and the food is good. Made to order or ready to go salads, sandwiches and smoothie bar as well as a full on hot food and salad bar with chicken, Chinese food etc.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Only been open 3 days on a test run but all I can say is I been there 5 times already.  Food is excellent and can't wait until they have the grand opening !!! Highly recommend!!", "author": "brian d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Probably the cheapest sushi I have ever seen in the city... And it was good!! Very budget friendly.", "author": "Siyu J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-20", "description": "Don't waste your time. Low quality unhealthy food for high quality prices. After taxes it's almost $10 per pound. They do have some fruit \u0026 salad.  But who wants to pay almost $10 a pound for some lettuce and orange slices ???? No sneeze guard and homeless people are always hanging in front of this place.  Just not a pleasant dining experience.", "author": "Billy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "My son and I have been staying at the Hotel Even across the street from this place.  I like my hotel, but like most hotels, the food and other amenities are almost always over priced.  Metro feast is only a very short walking distance from the hotel.  For the past three days, we have eaten there for breakfast and each time the food was excellent and so was the value.  I ate there for dinner one of the nights I was here.  I highly recommend this place.  it is clean.  The food is wonderful and very inexpensive.  I highly recommend.", "author": "Jeffrey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Obsessed with the fact this is right around the corner from me. Everything looks delicious. Granted I only got the sushi (which could have been better but could have been way worse also) and an overpriced large Tropicana apple juice (4$ - that's highway robbery) but the food that was out looked absolutely amazing. Also due to heavy construction in the area the eye candy isn't necessarily something I object to. Can't wait to try more things.", "author": "Lola C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-07", "description": "When I first walked into this place I was shocked at how many options they have. We're talking any food or meal you could imagine. Cheap too! I got a panini and it was fantastic.", "author": "Casandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Great place to get a big ass tasty salad. Was one of the first ones there when they open around 11 and the ingredients were so fresh. Would come here again to try everything else. Good price too.", "author": "Rod R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "Terrible sushi, not worth the money even with the grand opening discount. The hot food buffet doesn't have a sneeze guard, yikes.", "author": "Chloe R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Strawberry vanilla yogurt is awesome! Not too sour and sweet as well fair price", "author": "Xie N."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "Metro Feast", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "340 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/AgUWgKcnNomDMPKRD9T1tw/ls.jpg", "@type": "Restaurant", "telephone": "+13476893295"}