{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-22", "description": "Went for dinner with a friend.  We ordered Chicken wings and pulled chicken sandwitch along with salad.\n\nFood was served in reasonable time . The chicken wings were not that awsome and the resturant skimped on celery , carrots and blue cheese. The wings were oversalted and I could only eat a few before giving up. \n\nall in all a not so great experience. \n\nThe resturant offers simple American food at a high price with below average product quality.", "author": "Umer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Love this place!! The food, service and ambiance are excellent.  There's a cool, comfortable, rustic, modern atmosphere. TVs for sports watching are a plus! My fave dishes at brunch are the chicken \u0026 waffles and the Norwegian Benedict. Believe me, the portions are ample!! Not only do they serve a hearty plate but the flavors are delicious - elevated pub cuisine for sure. The cocktails are great, too - Alex at the bar is friendly \u0026 the beer selection is expertly curated. Servers are on point and the GM even came by our table to check on our experience. All in all, a great place, whether you're in the neighborhood or need a great destination spot!", "author": "A L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "They just changed their brunch menu and what a great decision. Went here a couple of times for brunch over 2016 and it was meh--conceptually they had the right idea but the portions, presentation and flavor were just not worth the $17. But my husband and I were perfectly happy to shell out $15 for the pulled pork benedict (called a \"Smoked Ugly\" with a chicken option). I will say that they kept the chicken and waffle, which I have never had but seems a fan favorite. I've had their shrimp and grits for dinner and pleased to see it transition to brunch (segue ingredient, eggs, what else?). I am so excited to come back and try the stuffed french toast and ranchero tacos and, after a run, might be able to justify the gigantic breakfast sandwich topping the menu.\n\nOne thing about ambience: couples with small babies come here. It doesn't really give off the family vibe especially since there are huge TVs lining the wall and a bar occupying one whole side of the restaurant. I wrinkle my nose at sports bars in general since I have no sporting bone in my body but the great beer selection, airy space and now kick-ass brunch makes me more likely to come here.", "author": "Gayle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Have been here for brunch and dinner. Both meals were totally great. Highly recommend the chicken and waffles and the duck confit tacos.", "author": "Olaide O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Walked in here randomly after work one Thursday evening and was very surprised.  Amazing atmosphere and very attentive waiting staff.  I sat at the bar and ordered food.  The food was amazing. I had the salmon blt minus the bacon. It was delicious.  I'd definitely recommend this place to anyone who wants a great quality meal served hot within minutes. I ate my food so fast I forgot to take a picture.  I'll definitely be back!", "author": "Lorianne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "I had brunch here on Easter Sun.\nThe french toast was delightful and I will be returning soon.\nThe atmosphere is very laid back and contemporary.\nWe enjoyed our meal at the bar with Mike as our bartender.", "author": "Marce P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-14", "description": "This one time we tried to go to Smorgasburg in BK, only to realize we had arrived there on the wrong day. Womp womp. Enter Uglyduckling.\n\nWe had some decent beers and burgers-- nothing to write home about, though. The sad part was some basic beeyotches that sat next to us complained the entire time about their meal and their experience (I believe an exact quote was: \"I didn't know the salad would have this much lettuce\"), so as we were quiet and polite, we were totally ignored by the staff, who was doting on this harem of haters.  Next time, maybe the manager could have handled this situation so that we could have had refills and service in an appropriate time frame.", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "The place is kinda small but the service was good while I was there. My party of three enjoyed our entrees. Two of us had the short rib grilled cheese. This sandwich was so freaking good!!! My friend and I agreed about that. It's served with shoestring fries which were crispy. I'm not a fan of shoestring fries but these were good. My other friend had the chicken and waffles which she said was delicious. It's a small menu so I'm sure they do most of the things right.  Happy hour well drinks were $6. They were just okay.\n\nI will be back!", "author": "Nell W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Return? Probably not, food was pretty bad. I would have given it a 2 if not for the service was very nice \nAtmosphere (3+) - More of a restaurant crowd than a bar crowd. High ceiling, nice bar. Has a lot of tvs but doesn't have a sports bar vibe\nFood (2-) - chicken \u0026 waffles (2- - included 2.5 pieces of chicken of which only 1 was edible), salmon (3), aegean salad (3 - salad was pretty good but the dressing was to lemony)\nDrinks: $7 beer, $10 vodka\nService (4+) Helpful, friendly, and attentive \nCost = Total tab w/ 2 drink before tax/tip $81", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "It was a Saturday afternoon and a random stroll down Smith Street, when the chalkboard sign caught our eye. \"Shrimp-n-Grits\" and Chicken \u0026 Waffles...yes, please and thank you. We were greeted and seated quickly. The decor was rustic, the service was exceptional (Thanks Dennis) and everyone in our party of four, enjoyed their drinks and dishes. Can't wait to go back for dinner.", "author": "Aidah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "Service was ok - water was not filled as quickly as other restaurants. However, it may have been related to there only being two wait staff.  It took a while to get the second mimosa that my friend ordered. Also - had to ask twice for ketchup and overall, I think it was just related to the afternoon brunch rush.  Both guys were extremely friendly and tried their best. \n\nMy friend got their chicken and waffle sin the spicy aioli, which we also had to ask for because it's their, \"new policy,\" to have the customers ask for it because nobody ate it.  Definitely can appreciate food waste, but wish it came out with the meal (not in a plastic container) because it added a sauce component to the dry waffle and chicken.  The chicken had a nice crunch, but the meat was not tenderized at all. Under-seasoned and the waffle was generic - nothing memorable or special.  Presentation was good overall though (see other Yelp pics).  My other friend got the shrimp and grits, which being from the South, she thought it was too soupy.  There were also chunks of grits that did not absorb the sauce at all, leading to a clumpy piece of tasteless grits.  The dish came with a total of five pieces of large shrimp that had the tail on.  Lastly, I got the pulled pork eggs Benedict with the hollandaise on the side.  Solid meal - it came with two pieces of English mcmuffin with a good layer of pork, a salad, and southwestern hash that was filling.", "author": "Hannah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-19", "description": "Nice staff, good food and beer. A nice neighborhood joint. Had the burger that's stuffed with brisket - yum!! The Ugly Duckling sauce was described to us as an aioli but it's really more like a thin thousand island. Burger served with shoe string fries. Side salad was big enough for two! Lots of local brews on tap.", "author": "Catherine Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "Strolled in after the gym for a yummy bite. Their Hawaiian coffee was delicious ... kinda strong for me but delicious.  I asked for double whipped cream and they didn't hesitate at my odd request. So I guess the staff was nice and accommodating. For the food... it wasn't amazing for me but my guest enjoyed their meal. I got the smoked ugly and I just couldn't enjoy it ... I barely tasted the pork and the hollandaise sauce was so overwhelming. We got deviled eggs for the table and it definitely lacked seasoning. The chorizo sausages were probably the most enjoyable part of brunch for me.  If I had to go back here I guess I would ... but not because I choose to.  This area of Brooklyn has some pretty amazing food options... this one isn't on my list. This one is a three star for me. I'm", "author": "Connie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "This place is super cool. Wide open space, real pub-like feel, and an excellent selection of beers and cocktails. My mint julep was a tad overliquored, which was the biggest disappointment. But I'm looking forward to come back and try the other drinks.\n\nI got the smoked ugly, and it was wonderful. Savory and well cooked home fries, fresh greens, soft and chewy pulled pork, plump poached eggs, and some lightly toasted English muffins. My boyfriend got the pimento burger, and the chipotle aioli apparently lived up to the hype.\n\nThey have tons of weekday specials apparently and they give away a coupon for Seamless when you pay!", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "I've always heard a ton of great things about the food and drinks in this nifty neighborhood of Brooklyn and was pretty excited to try out what they had to offer! Wife and I ventured out... \n\nTheir menu size is perfect - not too cluttered, not too lacking. Often times we would look at two things on the menu and wish that they had particular items that you could mix and match from, but here, I think the pairing done in the kitchen was great. \n\nEverybody seemed to rave about the fried chicken and waffles - you look left, look right, everybody had ordered this. Unfortunately, I wasn't really in a fried food mood and opted out, and went with the salmon dish which was cooked perfectly and their house sauce complimented the dish very well. Could the portion size have been a little bigger? Sure. \n\nTheir beer menu is quite extensive as well; however I wish the organization made more sense on the menu, it was all scattered; maybe this was intentional? I ordered \"the uglyduckling\" and by far has to be one of my favorite beers of all time! \n\nOverall, the decor was nice and the price was reasonable; great place to bring a date, especially because there are a ton of dessert places around (or movie theater down the block) to extend your date! I'd definitely come back if in the area to try the fried chicken and beer.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "All the necessary elements are there: great food, great service, great atmosphere. What takes Uglyduckling to the next level is the incredible hospitality. The staff, the manager JP, and the owners, are regularly engaged with all the patrons, not just doing that drive-by \"hey howzit goin\" schtick you get so often in chain restaurants. Would happily recommend to people looking for a place to enjoy a night out with some amazing people.", "author": "Sean M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-28", "description": "I would say Mediocre food, and ok service if you count the busser as your waiter as well. The Mac and cheese reminded me of Velvetta and the portion was kids meal size for the price, not worth it. Also not kid friendly what so every so if your thinking about a family dinner go somewhere else. We got the pork tacos, they came with two. Small and simple but they did taste good. The pork chop had barley any flavor, seemed the \"glaze\" didn't hold well and just seemed runny and a mess, best part about the plate was the mashed potatoes and corn which were great. The brisket burger was ok but lacked anything really special, best part about that dish is the fries and sauce that comes with it. Personally won't be back because they really don't have a wow factor or anything to make me want to come back. We were also sitter near the door with a cold breeze coming in every two seconds, which didn't help the dinner experience. And although service was subpar we still tipped 20% because we are in the industry but wasn't very deserving. We seen our waiter three times.", "author": "Renee B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-24", "description": "I chose to celebrate my graduation from graduate school by having a family dinner here. The food was to my satisfaction but our engagement with our waitress ruined the night. The waitress was not 100% attentive to our needs in a pleasant manner...she was utterly rude and lacked customer service skills. She blatantly \"complained\" about her interactions with our party, with her coworker ear shot from our table. When attempting to address this she became confrontational. All in all the manager was able to address our concerns, especially this situation.", "author": "Shaqwanda E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "This place was excellent!! The atmosphere was comfortable, not pretentious, but still classy. The food excellent!! I had the pear and goat cheese salad! Yum! My husband had the brisket grilled cheese and he was effusive, and let me tell you he is not often effusive! The customer service was also  excellent! I would definitely recommend this place!", "author": "Jane C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "I was trying to go to Cafe Luluc down the street for brunch but it was packed and they have no idea how to form a line so I came here instead. First customers in that place for about twenty minutes but they were still busy opening so we didn't get any extra attention. In fact they forgot part of the order. Anyway, the chicken and waffle was incredible. Glad I didn't wait for Luluc.", "author": "Vandad C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}