{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-23", "description": "The best thing going for this place is the beer selection, and the atmosphere is nice. But when you look at the menu, it sounds good, but almost comes off like it's poking fun of the Brooklyn culinary scene rather than catering to it.\n\nThe menu looks like someone took every possible trendy ingredient in this neighborhood and tried to combine it into every dish.  Burgers with pork belly and a FRIED quail egg on top?  Poutine topped with duck?  A lot of the ingredients seem like overkill and an after thought. \n\nI got the Baja salad which was pretty underwhelming for $11 - lettuce, tomato, corn and black beans - no cheese or meat, or an option to add any, and the tortilla \"strips\" were 5 or 6 tortilla chips thrown on top.  It was appetizer size.  They were also out of several other dishes on a Saturday night.\n\nWe also tried the chicken with noodles - the chicken resembled, and tasted, like terriyaki beef, which was kind of odd, and while the noodles were excellent, they were swimming in a pool of cream and oil.  Also, it took a good half hour plus for our food to come out.\n\nIt just seemed like the menu was unnecessarily unhealthy - half the items had something fried, and given that they're a craft beer bar, the dishes are way too heavy to pair with beer, unless you have an iron stomach.  I think the food was decent, and the beer selection was good, but if I eat here more than once a month, I'm going to have coronary artery disease by the time I'm 40.", "author": "Dana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "What an eatery.  Great beer selection and the brunch is to die for.  The chicken and waffles were out of this world \u0026 believe me, I know fried chicken.  I wish I still lived in this area because I'd come by every weekend.  The gentrification of Brooklyn is a scary mother.", "author": "Giancarlo E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-30", "description": "A bit disappointed after reading the raving reviews here. Staff are really nice and friendly though. We ordered eggs ugly and smoked Benedicts and all our eggs are over cooked - not runny at all. My lobster is also overcooked or not fresh cos it's rubbery and dry. They out of pulled pork and substitutes with bacon and that's rely good bacon. Will I come back ? Mayb yes for beers and burgers not so much for brunch like dishes.", "author": "Shanny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Dennis was amazing. Very little wait time. He even remembered my wife and I. Wish I took pictures, but my breakfast sandwich was phenomenal. And my wife's shrimp and grits was out of this word (had to taste that ;) lol). No need to recommend cause busy appears to be great and plus I wouldn't want you guys crowding up the wait area but you gotta try it. \n\nSee you soon Ducky", "author": "Edward W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Ahhh absolutely love this place!! Been here twice so far for brunch and dinner and each time has been amazing. First off the setting is so cute. Love the decor and the feels. For brunch I had the cheeseburger with fries and then for dinner I had chicken and waffles and both were delicious. Also tried the hummus platter and oh my god it was literally an explosion of delicious flavors. definitely one of my favorite Brooklyn spots!", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Uglyduckling is an eclectic mix of food, coupled with an admirable selection of draft beers (~30 in all). After reading a previous review that included a picture of their chicken and waffles, I had to try it out.\n\nCame in around 7:45 with no wait! Lara was awesome -- service was very prompt and sincere, something that I am notoriously critical of, considering I also work in the industry. \n\nWe ordered the sweet corn and pork belly fritters with a mango jalapeño sauce. While my partner didn't think it was so great, I thought they were decent, especially compared to our main courses, but they could have a bit more seasoning and pork belly.\n\nFor main courses, we ordered the Steak and Potato dish that came with fries and a steak in a red wine \u0026 Jack Daniels reduction. It was tender and had the right balance of sweet and savory. \n\nWe also had the chicken and waffles, served with pure maple syrup and a spicy aioli. I LOVED this dish. The chicken was boneless, tender, and seasoned perfectly (which is apparently a secret blend of spices). It was a generous amount of chicken paired with an equally generous waffle. All the flavors were harmoniously brought together by the aioli and the surprisingly light maple syrup.\n\nAll in all, I would definitely come back to try the poutine and the other main courses. This place is very promising!", "author": "Bernardo M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "Menu is completely different than what is listed online. Good craft beers listed on their menu and then you arrive and they don't even have mediocre craft beer, just the worst domestic and fake craft. So we wasted our time. Then we sit down and the prices for the food are higher than listed online making them comparable to other bars in the area with better reputations. All of these changes felt like red flags so we went down the street to Clover Club instead.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "I visited on a Wednesday around 6PM, it was practically empty and my party was seated right away (It did start to get more crowded later on)They had a great selection of craft brews with a knowledgeable staff! I highly recommend the deviled eggs (4 pieces per order) and the chicken and waffle! If you are dieting, this is a worthy spot to commit a cheat day!", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "The beer selection was overwhelming but amazing. I ordered a delicious beer brewed with mangoes, but it came in a pretty small glass which was unexpected. I'm sure the size was written on the menu somewhere but I didn't notice it.\n\nThe food was good. Not too much to choose from but delicious. Go for the portobello sandwich and a side of haricot verts, you won't be disappointed. Great atmosphere as well!", "author": "Kiefer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Just left this wonderful new place on Smith street. Had the duck poutine (if you don't know what this is ask a Canadian) corn/pork belly fritters and the ugly ducking burger. Everything tasted great \u0026 the service was right on. Saw someone having the chicken and waffles going to have that next time. If you are in the area give them a try...", "author": "Anna G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "So we had the Ugly Duckling in our sites for some time now and stopped in for brunch. Place was packed but after a short 10 minute wait a few tables opened up and the experience begins. Nice atmosphere and huge tap beer selection.\n\nPros; chicken \u0026 waffles were great. Crispy chicken no bones over a super light waffle. Nice maple syrup and slightly spicy sauce was good accompaniment. Big hit. Second dish was steak and eggs. Although delicious a bit disappointed in amount of sliced hanger steak in the order.\n\nCons; I like to mop up the egg yolk with some bread...no bread, seriously!!! You do French toast, burgers, scallop sandwich,,,no bread, really. Second was it was around 3pm and asked if we could have an order of poutine since it was a highly talked about item. No we don't serve that during brunch only dinner. \n\nSo to round off our experience because dining and especially brunch should be an experience,They could have exceeded our expectations by getting bread and asking if they could make an order of poutine to satisfy a guest request. Yes they were busy but we gave you an opportunity to generate more revenue but no way. They didn't even ask the kitchen even when you will begin serving it in 2 hours anyway, at least make an effort. It always mystifies me why wait staff simply don't introduce themselves. So simple and welcoming yet no one does it anymore. If wait staff was a bit more engaging this could have been a 5 star review.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-10", "description": "Nice place. But really bad service. I really hope it was that day only since waiter looked way hangover and couldn't remember anything we asked for as well as change plates not even while brunch but when we were ready for dessert. Yes we ate dessert of the same plates.", "author": "Alina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Very good food, I ordered the pulled pork sandwich and also tasted the waffles and chicken. The bartender was super friendly and attentive. I will certainly be back. The drinks were also delicious and strong!", "author": "Courtney D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-30", "description": "I've only been here once... It seems like a really good place for brunch. I had the chicken and waffles. The chicken was good but the waffles were soggy. No bueno... Everybody knows that waffles should be crispy on the outside and like butta on the inside.", "author": "Hardy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "\"A\" Rated. Staff was very pleasant, service was great. Food was excellent. Deviled Eggs with bacon is a must try. Had the pimento cheese Burger, it came with Sweet and Potato shoestring fries which was a nice change up from the norm. Nice beer selection as well. I would definitely recommend and will patronize again...thumbs up", "author": "Richard R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Terrific, unpretentious service and a great wine list put together by a sommelier that clearly knows it front to back.  owned and operated! The food is tremendous. Pasta on level with at much more reasonable prices...maybe the best pasta in NYC? The mafaldini is so simple and yet so incredibly flavorful.  were unbelievably cheesy and doughy and amazing. Crispy Little Fish are definitely worthwhile. Only underwhelming dish was the artichoke appetizer which I would have preferred to be cooked slightly longer and would have liked to see for less than Desserts also need a little work, as both the olive oil and chocolate cakes were too dry for my tastes. Amazing coffee, though! Overall a wonderful experience and I hope to come back if I can ever get another reservation.", "author": "Debra A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "The chicken and waffles are everything yelp says they are. There is nothing I can say that other reviews haven't already, except that I stopped here Saturday evening with a friend, and am still thinking about that perfectly crisp chicken and super soft waffle on this unfortunate Monday morning. My friend got the mac + cheese with bacon and also loved her food. We both ordered cocktails (Hurricane), and loved the flavor and how much of a kick it had. \n\nThat's not what I'm here to talk about though. I've logged into yelp after all this time to praise this place for its service. I haven't had service as wonderful as this in ages. The place was busy, but we were seated right away. Our server, Kate, was friendly, funny, and really helpful. Besides her, there was another woman whose name escapes me who also checked in on us every so often. But not only were the servers super attentive - the busser cleaning off the table next to us ALSO checked in and asked how everything was going with our meal, and if we needed anything. We constantly felt taken care of, and like our patronage mattered, which doesn't always happen in busy places with a reputation like the Uglyduckling has. \n\nAlso I should mention that they were handling a very large group for a birthday gathering at the time, and it was wonderful to see them taking care of not only the group, but every single customer in the joint. There wasn't a frown to be found in the entire establishment. Especially not at our table. If you feel like the prices are steep at all, believe me when I say that the service + food more than make up for it. \n\nFor service alone, I'd come back here. For ambiance and decor, I'd come back here. For the delicious food I have yet to try, I'll *definitely* be coming back here. Thanks for a wonderful way to cap off a Saturday shopping trip, Uglyduck!! Writing this review has been a great Monday morning pick-me-up. You are a gift that keeps on giving. x", "author": "Kandace F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-02", "description": "If you're going for the chicken and waffles don't waste your money. What I got was okay chicken and a pancake that was pressed in a waffle iron after it was made. \n\nI had a craving for chicken and waffles. I was in the neighborhood so I went here because of other reviews. I wish I didn't. This was a complete waste of a cheat day. It took forever for our food to arrive even though there was only two other small groups when we walked in. When I went to the restroom I could smell that something had burned. This was perhaps the reason for the slow service.  When the food finally arrived I was extremely disappointed. The waffle looked a deflated ball and the chicken was eh.  I had some of my friends fries, they were really good. That's the reason for one of the two stars. \n\nThe server was nice. He was the only one working which was fine because it wasn't busy. Also he tried to be as attentive as possible. But he can't serve what isn't ready. He was the reason for the second star. \n\nSad to say, this place was a let down.", "author": "Tricia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Breakdown of ratings:\n\nAtmosphere/decor: 4\nService: 5\nBeer selection: 4\nMac n' cheese: 4.5\nPimento Cheese Burger: 3\nButtermilk Fried Chicken \u0026 Waffle: 4\nPrice: 3 (it's what one would expect)\n\nI ended up here because my girlfriend and I were trying to go to brunch at Cafe Luluc. It's kind of pathetic that we didn't make in time given the brunch there ends at 5 p.m., but oh well. We weren't that interested in their dinner menu, so we wandered around for a bit and ended up here. I know Uglyduckling also does brunch, but this review is for their dinner menu. It was a great experience!\n\nIt's kind of smallish, but it wasn't terribly busy when were there, so it was fine. The decor was plain, but in a good way. It had a nice homey feel. We were greeted immediately by who I can only assume was a manager there. He was really friendly and enthusiastic. In fact, when we were seated at a wobbly table he immediately fixed it for us. Our server was also great (I think her name might have been Sommer?). They have a great selection of beers, but were out of the one that I initially ordered (unibroue la fin du monde from Canada). She brought me a sample of another one that she said was similar (Boulevard Tank 7 from Missouri). I've never had either so I can't compare, but the sample she brought me was delicious and I went ahead and got a pint of that.\n\nWe ordered mac n' cheese to start. Now, I LOVE mac n' cheese in general! And this was some fantastic mac n' cheese. The pasta shells could've been cooked a little better, but they weren't bad. The cheese sauce was phenomenal! I could have been happy just eating that.\n\nI ordered the Pimento Cheese Burger. It was ok. The aioli was really tasty, the bun was pretty good, but the patty itself was just eh. I ordered it medium rare, and it was quite juicy in the middle (maybe a little too bloody, but it was ok), but the edges were dry and overcooked, and seasoning was a bit bland. It did come with some great fries though. They were a mix of sweet potato and regular and I liked dipping them in the aioli that came with my girlfriend's meal (she doesn't like anything spicy), which also happened to be the same thing that was on my burger. My girlfriend got the Buttermilk Fried Chicken \u0026 Waffle, which she enjoyed a lot. \n\nOverall, it was a great experience. We both had a really great time and I would definitely recommend stopping by.", "author": "Jana W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "This is a newcomer to the fine array of Smith Street eateries.  I tried it on New Year's Day for a late lunch/early dinner and enjoyed their special sweet potato and chorizo beignets which were more like hush puppies than beignets.  They were tasty morsels and a perfect blend of sweet and savory.  Their signature fried chicken and waffles was a little pricey ($16) for what it was but good to know they used boneless thigh meat for both taste and convenience.  There was a hint of spice in the chicken which was intriguing but not overwhelming.  The waffles were perfectly done in the Belgian style.  The spicy aioli it came with worked better with the beignets than the waffles.  Their version of poutine took a turn from the traditional cheese curds and was instead made with melted provolone which somehow worked with the ample pulled barbecued beef which smothered the perfectly hand-cut French fries.  There was a lot of flavor and protein in the poutine which could either be a shared appetizer or an entree.  The food however is just a nice backdrop to the extensive beer selection including their own Ugly Ducking ale, lager or pilsner.  Go to U.D. with no expectations for healthy eating but be surprised with the interesting vegetarian offerings including sautéed kale and bean burgers.  Our server was a little slow but par for the course since it was a holiday and a little busy.  She was pleasant enough and I was more fascinated by how she was able handle the heavy dishes and still carry off her low back black dress!  U.D. felt more like an upscale sports bars with the games playing on the screens than a hipster hangout.  The cuisine and craft beer make it a cut above the average sports bar though.", "author": "Wailana W."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}