{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-02", "description": "Came here last Sunday for brunch. It was a cool place. We were seated right away even though we were early for our 1:30pm reservation. \nFood- I had the Burger and Sangria. It was pretty good. Hubby and daughter got the chicken and waffles and side of fries. They said it was good.\nThe Burger brisket was just ok for me. I thought the waiter had put the order for regular burger. When I ordered it he said there was a regular and brisket I said change it to regular. When it came out I realized it was the brisket which was fine. No big deal. \nThe service was ok they were professional. \nI may come back again.", "author": "Anne Marie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "The food was so subpar. The service was incredibly subpar because they had one waiter for the whole restaurant. We sat for nearly 20 minutes and had to ask for the menu because no one came to greet us. We had to pay for bread and butter AND it came out AFTER our meals. My friend was told that she would get 'English Breakfast' tea and they brought her Lipton. Anything we asked for took more than twice as long as usual to get. The chicken lacked flavor and was cooked too hard in some spots. It's a beautiful space so it's really a shame it's so subpar in every other way. I see why it was empty....\n\nI recommend maybe going for drinks but keep your expectations to a minimum for nearly everything else.", "author": "Taylor T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-05", "description": "DO NOT COME HERE UNLESS YOU WANT TO BE HARASSED BY THE OWNER. I came in with my two friends. I spent nearly $60 on a meal (about $100 total) only to be demeaned and maltreated by the \"owner\" bald man, (unsure if he was the owner or manager) of the establishment while we ate. Even before we were seated, he antagonized us and assumed we weren't going to be spending money probably based on our ethnicity. The waiters were great, but the maltreatment we received by the owner clouded our meal and ruined our evening, and we will NOT be returning to this establishment. If he were truly worried about his business, he wouldn't be harassing paying customers for trying to eat a meal in peace.\n\nUPDATE\n*****And in regards to his response, it is not acceptable, in my opinion, for a man to yell or raise his voice at a customer for any reason. My friend was eating a mini cupcake I got her for her birthday and he somehow had a problem with that regardless of the fact that we spent ~$100 on our bill. Him yelling at us then being offended that we \"took it personally\" is the perfect example of toxic male energy and I advise everyone to be careful when visiting this establishment. \n\n*****And correction to his response, since he obviously does not remember the event correctly, we were a party of 3. We made a reservation, waited patiently for our friend who walked in 5 minutes late and were seated. She did not eat, but 2 of us did and the bill still totaled ~$100. The owner is delusional to think we were \"harming\" his business in any way when were clearly adding to it and expected to be treated like any other paying consumer.", "author": "Jennifer E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "I enjoyed that meal. This meal included a poached egg, onions and tremendous flavor. Family friendly restaurant and bar. This place has a very nice atmosphere. The staff is friendly and professional. Excellent food!!!", "author": "pamela j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "I went back here for dinner after loving brunch a couple of weeks ago and it was wonderful from start to finish - it is my new fav spot - the doughnuts were amazing", "author": "incognito i."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-16", "description": "My girlfriend and I selected this spot for our biweekly brunch tradition in her neighborhood~ Right off the bat, you will notice that their menu prices are suspiciously expensive for both food and drinks. Although the coffee was good and their décor charming, tables are positioned wayyyy too close together - you can't have a conversation without the people next to you hearing every single word!\n\nOur waitress was snooty and impersonal, and the food was just alright? Definitely not worth $22 each for my shrimp \u0026 grits or my friend's chicken \u0026 waffle. And who in their right mind charges $13 for a weak mimosa that comes in a tiny glass? Uglyduckling... sit down, be humble.", "author": "Kristina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-14", "description": "I've been meaning to try this place and finally did this past Tuesday! I made a reservation for 4 people at 6:30 PM but called the restaurant to let them know we were running 30 mins late and they had no issue.\n\nWhen we arrived, we were seated immediately and greeted by Edward. He was an amazing host and explained the menu to us thoroughly. We ordered Calamari ($13.00) and Wild Mushroom Crostini ($12.00) as the appetizers and it was really good! The Calamari was extremely crispy and paired very well with jalapenos and zucchinis. The Wild Mushroom Crostini was fantastic as well. We asked for more bread and Edward had no issue with that.\n\nFor entrees, my friends got The Salmon Fillet ($22.00), Pork Tenderloin ($23.00), and Mac and Cheese ($13.00). I got the infamous Fried Chicken and Waffle ($22.00). The fried chicken was more of a chicken cutlet so it was really easy to eat. The waffle was REALLY GOOD! I would definitely recommend this entree. Their portions are huge for the price. \n\nOverall, my friends and I enjoyed our time here and would recommend!", "author": "Racheal D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-11", "description": "It's surreal that Larry's review of Ugly Duckling way back in 2015 is so on point for 2019.\n\nI had been waiting to try Uglyduckling for years because it's in the hood, but also *just* far enough away to not go. But you will always get my attention with chicken and waffles. And truly, brunch in our area is almost nonexistent, so I was near psyched when I was able to get a brunch ressy at Uglyduckling on the weekend so easily.\n\nAnd then you understand why.\n\nTruly, you head into the restaurant off of Smith St. and it is quiet. Not quite dead. But more quiet than a brunch place during brunch time on a weekend in New York should be.\n\nWho is maybe the owner or GM clearly controlled the floor and kindly welcomed us in. There were TVs around us set to different stations. Our waiter was sweet and attentive enough, and he did refill our water plenty.\n\nBut the french toast we got for the table was not special. My chicken and waffles were...I wouldn't say bland. More like \"meh\". I could make my own better (both the French toast and friend chicken. I don't have a waffle maker). The cocktails were fine.\n\nIndeed, more of a bar (in food, drinks and decor) than an actual place to brunch.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-23", "description": "Some co workers and I got off of work early this past weekend. We decided to pay Uglyduckling a visit. \n\nI love the decor. Fresh and welcoming. \n\nWe ordered the devil eggs as an appetizer. Very delish! It comes on a bed of greens and sliced cherry tomatoes.\n\nMy co worker ordered a Cesar salad with a side of bacon. My other co worker and I ordered the Brisket burger. \n\nFood arrived. Caesar salad was in a soup bowl. No room to mix and eat. He got a large size of bacon. Worth the up charge. \n\nI got my burger cooked medium, salad instead of fries. The burger was tasty but I wasn't expecting a heap of brisket meat on top of my burger meat. My friend didn't enjoy her burger, so she just nibbled on the fries. \n\nI had a good time. The staff were very kind.", "author": "Jo P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-10", "description": "Not sure what happened since I first came here. Recently came back with friends and ordered the chicken and waffle which was bland. Chicken was overcooked, dry and tough to chew. Waffle was deep fried and had resembled more of a funnel cake than waffle. This wasn't bad...just different. Friends orders were mixed up numerous times. No one really enjoyed their food. Notable was the mac and cheese which was very watery and lacked flavor, very bland.\n\nPerhaps I'll give this place another shot down the line, no time soon thougb.", "author": "Hubert L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "Came here for lunch, it was quiet and enjoyable. Shrimp \u0026 Grits were very filling. The brisket burger was delicious. I enjoy eating here and will be back. It's a bit pricier than a quick lunch option, but it's quality food and worth every dime.\n\nGood:\n-Brisket Burger\n-Shrimp \u0026 Grits\n-Simple reservation via Yelp\n\nBad:\n-None", "author": "Daniel J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-07", "description": "Visiting NYC for the day and my handy YELP app led us to Uglyduckling for brunch. One train ride and a few steps and we had arrived! I was pleased with the suggestion. We arrived on a Saturday afternoon famished and was seated and greeted immediately. DRINKS PLEASE!! The Mimosas and Sangrias were great - as in perfect alcohol infusion and so were content until the food arrived! \n\nFood did not take too long either. I ordered the Shrimp and Grits. I'm always amazed at how restaurants can deliver their own spin to such a traditional entrée. The S\u0026G here was so tasty and well seasoned - nice and moist however not soupy and topped with a poached egg. Kudos on poaching perfection! \n\nMy partner had a hiccup with the Chipotle Egg White Omlette and it was immediately resolved with an item switch - Chicken and Waffle. It too, because I had to taste everything, was tasty! You will never get tired of signature dishes here!\n\nThere were a few forgetful moments with the server but all in all a great visit. I will return!", "author": "TK B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-24", "description": "A wonderful brunch place in Brooklyn. Loved the rustic decor. Staff is also very friendly.\n\nThe food was decently priced and delicious.\n\nThey only have regular or decaf coffee. No lattes on any other fancy brunch coffee drinks, one has gotten used to in the NYC brunch but free refills!\n\nI ordered an egg white omelette that came with greens and home fries. Everything was perfectly prepared.\n\nLovely Brunch place in Brooklyn.", "author": "Shruthi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "Hey I just had the calamari - it was one of the best! I haven't received the rest of my food yet and I'm already excited \nThe service I received has been nothing. It exceptional and I appreciate it . \n\nJulian and Ashley and third guy (don't know his name , he's sooo busy and doing great I didn't want to interrupt him). \n\nI'm few tops away on the G and life has just begun . This spot is so worth it . \n\nAlso note to the public: stop waving your hand and calling out to your server (especially when they just left your table). It's annoying and embarrassing to the human race. This was in regards to a 16 top that had no idea of what patience means and their lack of understanding of calming the f*ck down. Your water will be refilled , just for you not to drink it . \n\nMan, I do not not miss the bullsh*t.", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Off the path of Atlantic avenue and tried this place for the first time.\nWasn't over crowded and enjoyed a free beer with Yelp check-in when buying any entree. \n\nOur sharp and charming waitress, Kaitlyn, was helpful and quick.\nBest of all she was just personable and nice.\n\nThe food was enough to share with the Ugly duckling sandwich, which is a nice chicken cutlet, topped with an egg, bacon, and sandwiched between 2 ample waffle halves.  Included fries and that was MORE than enough to share.\n\nI just liked the vibe and the people in here and the food was diverse and tasty.  Everything popped out in under 10 minutes. \n\nNice draft beer selections too.   Will be back.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-15", "description": "Came here yesterday for brunch. I don't know where to begin. This place looked so promising with such good reviews but it turned out to be the biggest disappointment of this year thus far. At first glance of the menu everything was very overpriced. $13 for a Bellini? $22 for eggs Benedict? Maybe if the food and drinks were good the prices could be forgiven but this was not the case. We ordered Mac \u0026 cheese and Brussels to start. The portion size of the Mac was a joke plus it's pretty much velveta quality. The Brussels were drenched in oil and not crispy at all. We ordered shrimp and grits which came in a soup form with an egg on top. Also ordered the waffle sandwich which I'll discuss shortly and salmon eggs Benedict which was nothing special and the salmon was a little strange tasting. The waffle sandwich on the menu that I received said that it came with fried chicken and shoestring fries. When we received the plate it came with really poor quality grilled chicken, just dry and flavorless. The fries were thick cut and stale not \"shoestring\" at all. Also the \"waffle\" was a soggy old eggo consistency. I asked the waiter about why my menu said fried chicken and not grilled and he stood there and told me that it's grilled only and never came with fried chicken. He made me feel like I was stupid when in reality I looked at a menu posted on yelp from 3 months ago and it clearly said fried chicken. Forget this place, don't waste your time or money. Every dish was borderline terrible and also my friend said that she had an upset stomach all day after that food.", "author": "Julie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-13", "description": "Went here while driving through Brooklyn and the quality of food for the price was just terrible. The \"Uglyduckling favorites Mac and cheese\" tasted like velveeta with pulled pork. The flat bread was flavorless, the tacos just tasted like BLEH. Chicken and waffle were the only decent item.", "author": "Quinten D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-19", "description": "A fine place to grab a bite, but with all of the good food around NYC I wouldn't stop here unless I was out of options. Service was a little spotty, but ok overall (water refills and slow to get rounds of drinks). \n\nFor the food - nothing really stood out, but favorites were fish and chips, cauliflower, and the asparagus. I think the vegetables were good mostly due to butter/cheese. Fish was crispy and batter was light. Fries were standard.\n\nEverything else was ok - we had olives, mussels, charcuterie (the bread served with this was hard enough to chip teeth), brussels sprouts, ugly burger.", "author": "David H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-20", "description": "I hate to leave places a bad review, but I did not like the way I was treated at this establishment. I had previously been here for the shrimp and grits and it was very good. This time get grits had been mashed to a mashed potato consistency. It wasn't so much the food that bothered me. I let the bartender know and he assured me it was grits. He offered to changed it, but he had a very snooty attitude about it. It was as if I was making an invalid complaint. I decided to keep the meal but I didn't eat it. When the check came I told him I had not liked my meal, he had a really snooty and arrogant attitude. Hence he took the meal of the check, which is why I'm giving the place two stars. I did not take the food with me, even though he insisted. I hate wasting food or this type of reviews, but I was very unhappy with my experience. I don't think I'll be coming back to this establishment.", "author": "Diana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "Guess what night it is?!?!? \nDATE NIGHT!!!!\n\nSo we were hungry after a long day of cleaning and other things, didn't feel like cooking, and my Queen looked to me for the nightly sustenance. I pulled up yelp, made my way to the date night folder and viola, Ugly Duckling. Lol, that's not exactly how it happened but these are the cliffnotes. (Remember cliffnotes from college? Lol)\n\nThe cab drops us right in front of the spot and I commend them for have the double layered door during these cold months. We walked into this warm, well-spaced, delicious smelling restaurant and were immediately greeted with a \"hello\" from Carter and a smile from \"Aubrey\". She guides us to booth seats near the rear and brought us menus and water. The place looked beautiful and kudos for the duckling on the wall near our table, it really carried the theme. After soaking it all in we were ready to order AND WE WERE HUNGRY. Aubrey sensed this and made her way to our table to offer drinks and get our entrees cooking. I had the butcher and my Queen went with the warm apple cider...I asked that they add bourbon to hers and STRONGLY suggest you do the same. Our drinks came, and like always I had drink envy. The butcher immediately reminded you of the crown royal whiskey, and though it was well made I wasn't a fan. The warm apple cider with bourbon on the other hand was ordered IMMEDIATELY after I finished the butcher lol. Apple, cinnamon, bourbon, and that warm feeling on your cheat....sigh, kinda wish I had one right now.\n\nOnce our drinks were warming our souls our calamari appetizer came out. It looked more like a calamari salad and that was appreciated. Calamari lightly fried, parmigiana cheese sprinkled within, pepperoncini, sliced olives, and spinach. A well thought out combination of flavor with no greasy or oily residue and we finished every bite. \"Another round of drinks, same as hers please\" I said as Aubrey followed up on our starter...Carter brought them right over.\n\nNow for the main event, even though everything was great so far. I like going against the grain so I made sure NOT to order the chicken, it seemed every other picture on yelp was of the chicken. We had a surf and turf night, me with the Flatiron Steak and the Salmon Fillet for my Queen. They came out in record time, we still has calamari salad when they arrived allowing us many different flavors and apple cider to compliment them all. So normally we'd dive into each other's plate but the yogurt that accompanied her Salmon is my old nemesis so I watched from across the table...still fed her some steak and fries though. Steak, cooked medium well with a smooth peppercorn sauce (if you remove the peppercorn) and a side of fries. Salmon, cooked medium so that the crust was perfectly flaky but the inside still tender and releasing a light steam. These meals fit so comfortable in our tummies and accompanied by the cider, twas a great choice. \n\nNo desert as they only had the chocolate cake and that wasn't going to end well for me. lol\n\nPlease note that Aubrey and Carter were the only people serving and they didn't miss a beat. There was never a feeling of, \"dam where's my food/drink?\", instead the general feeling was, \"wow, that came quickly\". Huge thanks to both of you for making another date night a success. \n\nAmbiance: 5/5\nService: 5/5\nStaff: 5/5\nFood: 5/5\nDrinks: 5/5 (get the cider with bourbon....just do it)\n\nCash and credit happily accepted here... plz tip in cash if you can.\nWe'll be back ;)\n\n... date night list coming soon", "author": "Quincy T."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}