{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "The name of the restaurant caught my attention, not to mention, I love duck. So I took my boyfriend here for dinner. We had the flatbread, duck poutine, chicken and waffles, and the crispy duck special.  Everything was delicious and hit the spot.  Practically growing up on smith st, this is my new favorite. The waiters were super friendly, and we even spoke to one of the owners on our way out.  We gave our compliments and cannot wait the explore the rest of the menu. We'll  definitely be back!", "author": "Jaimee G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-24", "description": "If I was only rating the beer and atmosphere I would give it a 4.5. But the food is really not good. So if you only want a drink, great place to stop into, but come full. Very friendly service.", "author": "Abe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Awesome food. We had the chicken and waffles and short rib tacos!", "author": "JJ K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "My friends and I randomly got off the subway and decided to yelp somewhere to eat. This place had pretty good ratings so we decided to try it out. It had nice lively atmosphere and friendly staff. They also aren't stingy with the wine. We all had the steak, which was okay. The portions aren't too big so you may want to order an appetizer. Overall I like this place but I wouldn't necessarily come here for the food.", "author": "Justin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "Had dinner and drinks.  Great music.  Good crowd for a cold night.  Food was surprisingly awesome - including the key lime pie.  The beer selection is superb.  I'm an amber beer person and the empire is cold, served fast and with a smile. We had a table about half way back.  No rush to service.   Will be back.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-10", "description": "Ok, I'll begin with:  this is a GREAT addition to the neighborhood.  It's cool looking inside, it's casual but not divey, and above all, the food is awesome.  I'm a picky eater and not only are there several items on the menu that I find appealing, but I've been a couple times and the food is always fresh and just really high quality.  Again:  food: great (although almost every time they have run out of a dish or a main component of the dish).  \n\nHowever, there are some small issues that prevent me from returning often or wanting to take friends there.  I write this mostly for the manager's radar.  The place seems caught between identities..it's earthy but also a bit artificial.  The lighting is way too bright (fake candles, no!) and the music is a little cringe-worthy (It goes from Natalie Imbruglia, to DMB, to random 80s or 90s song).  The TVs are a bit over-kill, they could probably benefit from a few less, but maybe that's the intent?  Kill the lights, find some consistent good music; it would be a huge improvement and bring a more consistent crowd who is there not just to watch the game.   \n\nHope you stay put!", "author": "BK B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-26", "description": "Nice place but overtime I have eaten here I have got sick.  Not sure why but on my deathbed each and every time.  It is a shame it is nice inside but food may kill you.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-14", "description": "Went here with the family for dinner on our last night in New York.\nThis place left much to be desired.\nFirst, I want to say that the only item in the pictures on their Yelp page that they still have is the chicken and waffles. (Which is what I ordered and it was delicious!) When I asked the waitress about it she said, and I quote, \"Yeah, yelp lies. We don't have that stuff anymore and we haven't for a while.\" No big deal, but those pictures were part of the reason we decided on this place, so it was mildly disappointing.\nThey do have a magnificent beer selection and their cocktails and sangria are on point.\nWhy the two stars, you ask?\nWhen we got there, we were one of 3 tables in the whole place, and there were a couple people at the bar. We were sat promptly and ordered our drinks and some appetizers.\nThe beer samplers and appetizers came out pretty quickly, and were pretty good....but that is where the good stops.\nWe ordered our food pretty quickly after we sat, but after 40 minutes, and watching multiple tables be sat, get their food, pay and leave, before we got our food, we got a little concerned. \nMy question is....why didn't our waitress notice and check on our food? She was MIA, we kept trying to get her attention, but to no avail.\nSo we mentioned something to the guy who appeared to be the owner and he went in to the back to check on it for us.\nThe kitchen manager came out immediately and told us that he was sorry and that they were having trouble with their printer in the kitchen and he would get our food out as quickly as possible. It did come out pretty quick after that, and everything was going great...till my sister found a long hair in her fries, before she had even eaten a third of her food.\nAt this point we were running a little late (which isn't completely the restaurants fault but they certainly didn't help), but in an effort to speed things up, my dad had already paid the bill. The manager did nothing but apologize for the hair, he didn't offer to take it off the bill, or bring her another one...nothing.\nBecause we needed to go, the rest of us got our stuff wrapped up to go.\nI understand that sometimes places just have off days, so I wasn't going to even write a review about it until I just went to eat my leftovers and was surprised to find none of my leftover chicken, which I had about half left, in my container. They did give me a whole waffle, instead of the little less than half that I had left....but they took my chicken...why?\nNot that I live in New York, but for anyone who does, I wouldn't recommend this place. Like I said, every restaurant has their 'off' days, but this was just too many things that could so easily go wrong again.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "Have been here a few times since it opened, the chicken and waffles are divine. The portion was really big, I shared it with my sister in law, and we still had leftovers! Decent beer and wine selection, fast service. There is something lacking in the atmosphere, probably just because it is a new establishment so the staff are not entirely settled in? I will be coming back to see them for sure, lots of potential :)", "author": "Satya A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Amazing beer selection. The food is phenomenal. I had the burger and it was perfect.  Different with the cheese and pimento peppers.  Also met Mike the owner who was so friendly and went out of his way to make sure we were taken care of.   Nice to see a great place like this in Brooklyn without the attitude!  Also it's kid friendly but wasn't stroller central so you can come sans kids.", "author": "roger d."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "The first time we tried Ugly Duckling it was unremarkable and didn't warrant a review. However, our recent visit left us so incredulous I had to write one. The entire ordeal was a series of WTF moments:\n\nBizarre, opposing response from staff: My husband ordered an open-faced omelette and immediately noticed no bread was included on the plate and asked our waiter for toast. The first waiter responded with \"we don't do that\" and walked away. Seriously. Didn't offer alternatives. Nothing. So I waved down another waiter and suggested that perhaps an english muffin would work. His reaction was significantly better: He explained that they truly don't offer stand-alone bread items on the side but that he could see what he can do. A few minutes later he came back with a toasted english muffin. Great. Problem solved. Awesome.\n\nWaiter called me a liar, basically: My chicken and waffles looked fantastic, and I naturally cut into a piece of chicken first. I mean, one always goes for the chicken first, right? Anyway, I was disappointed before I even tasted it. I could tell immediately that it was not what was described on the menu: It was a thigh instead of the breast. I'm very particular about dark meat - it's too fatty for my tastes. So I grabbed a menu from the bar and confirmed that it should be a breast. When I described the issue to our waiter, he told me: \"It's a breast. They only use the breast. It's always the breast.\" I said it's not, and he said \"maybe it's the batter that makes it look weird like that.\" So I gave them the benefit of the doubt and tasted it. My mouth confirmed what my eyes already knew: It was a thigh. So I flagged the waiter again and told him I know it's a thigh. I ordered the Eggs Ugly Duck (eggs benedict with crab instead of Canadian bacon) to replace it.\n\nWaiter implied he did me a favor: The Eggs Ugly Duck came out relatively quickly, and it was fine. As he dropped off the plate, he said: \"I went ahead and took the chicken and waffles off the check.\" I thanked him in the moment but later expressed to my husband that he didn't have a choice. Of course you have to remove a bad item from the bill.\n\nI got vindicated: The same waiter came to check on my eggs benedict, and I told him it was fine. He then knelt down next to me and to my surprise admitted that he was wrong about the chicken. He said the kitchen told him that \"it should be a breast AND a thigh, not just the breast, and that it's wrong on the menu.\" I told him that both pieces were thighs, and he said \"we got it wrong twice.\" I appreciated that he told me that they were wrong - that took courage - but the fact still remains that he initially called me a liar and then made up the super lame \"maybe it's the batter\" excuse on the spot. \n\nIn the end the same waiter swung by with the check and tried to help smooth over the weird experience and said \"if you give us another chance, we will do better next time.\" I appreciated that mea culpa.", "author": "Ginger C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-16", "description": "Revisited here tonight to find that the fabulous menu has been changed . The choices are still plentiful but when 2 of our 3 entrees were disappointing due to ironing out some wrinkles we were left dissatisfied . Expecting the chicken \u0026 waffles to be actual pieces I was surprised to see a few chicken strips on a thin waffle. The hamburger was cool and nothing to recommend . The owner came by to chat \u0026 he was very friendly \u0026 inviting. He even offered us a round of drinks before the entrees were brought out. I believe this restaurant has great potential \u0026 I'll return since I think they just need a bit more time to get themselves together .", "author": "Vivian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "First of all, if you like beer, you'll like Uglyduckling! They have an enormous selection of craft beer with 30 drafts on tap and a handful of canned beers to boot. This is probably the most drafts Smith St. has to offer! They even have their own Uglyduckling draft, which was pleasantly balanced with deep flavor. \n\nSecond, come hungry! The menu itself is plenty of reason to stop by with its creative take on classic American grub. My first time I tried the chicken and waffles, which were insane! This dish comes with a hefty buttermilk waffle, atop which sits the most succulent, crispy chicken I've ever tried. I tried the chicken by itself first, and it was so juicy and tender, with a spicy crust to give it that extra kick to perfection. And then I tried the chicken paired with the waffle and maple syrup: to call it amazing would be an understatement. It's the type of bite that makes you audibly exclaim, \"Oh wow\" in spite yourself and then proceed to shamelessly lick the plate clean. The second time I visited I tried the Uglyduckling burger, which was also fantastic! This burger comes with a generous patty, pork belly and fried quail egg. My medium rare order was perfectly cooked, and the burger tasted out of this world with the pickles. I'm excited to come back and try the pan seared scallops with risotto, and also the hummus plate, which looks like a work of art on their website.\n\nThe place overall has a great vibe, with sophisticated filament bulbs drooping casually from the ceiling against gorgeous wood paneling for walls. The decor is upscale, but it still feels comfortable to just relax at the bar and enjoy your meal, whether on your own or with friends. Plus, the owner is incredibly friendly and welcoming, and a great delight to chat with. I'll definitely be coming back for more beer, grub and good times!", "author": "Paula E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Very impressed. Chicken and waffles masterfully done. Tasteful atmosphere. Very friendly owners. What's not to love?", "author": "Charles M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "An amazing new spot in cobble hill. Warm, welcoming, clean ambiance. The food is fantastic and the staff are very friendly. They have 20+ craft beers on tap. I couldn't recommend it more highly. I'm now a regular.", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-14", "description": "Love affair is over. Disorganized service, overcharged for the beer vs what's right on the menu and puny 12oz drafts (their largest size) just don't do it for me. Nail in the coffin is \"taco Tuesday\" which last week was advertised at $12 for 3 tbd tacos and a beer. Tonight it's $20 for 3 (ground) beef tacos and a beer. What's in the taco? Meat... And cheese. Sweet deal!", "author": "Eric W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "We went on Sunday night and had a great time. Our bartender, Steve, was a very charming host. The beer selection is quite good, particularly the draft offerings. The Left Hand Brewing Milk Stout was absolutely delicious.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Amazing food great service. The food is definitely worth the price, the portions are satisfying. The lobster mac and cheese is great! The ambiance is relaxing and I appreciated being able to watch all the games that were on.", "author": "Joy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Great place - amazing service and good array of beers on tap.  You must try the pickle chips!  Great place to meet up with friends.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Would give 4.5 stars if I could ! Great experience- amazing food (risotto and burger especially)! Wish I could describe the creaminess of the risotto but you should taste for yourself. Burger was cooked perfectly and bar service was on point. Brandon the chef is amazing and very personable- came by to meet all the patrons!", "author": "Elizabeth T."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}