{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "I'm really, really impressed with this place. It's probably the best service I've had at a restaurant this year, in addition to great food and wonderful beer selection. There's something on the menu for everyone, whether you're watching your calories or want some cheesy poutine, dammit!\n\nSome friends and I came here for brunch on a Saturday, and it was surprisingly not packed. We were seated immediately and attended to by a sweet guy and great busboys. \n\nI ordered an open-faced omelet with delicious fresh veggies and amazing, crispy potatoes. Yum! My friends enjoyed their benedicts/chicken \u0026 waffles, it was clean plates all around by the end of the meal. \n\nWe saw the owner chatting with people, and helping out when needed -- really the staff just seemed to enjoy working there.\n\nYes, it's a little pricier than some places nearby, but I think it's worth it for the experience and higher quality food.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-29", "description": "The food is great but beyond that, service is poor, drinks are weak (and expensive!), and it's too loud. \n\nI returned two days in a row because the food is so good but the lack of proper service will keep me from coming back. I had the shrimp and grits both days - perfectly good shrimp with veggies and grits in a savory sauce. My friend had the pimento cheese burger and enjoyed it. Boyfriend had the pulled pork burger and the pork was very flavorful.\n\nThe first day, the waiter/manager tried to rush us out when 3/4 of the restaurant was empty and my friend still had half a drink left. The next night, it took forever to order, and to get our check. Meanwhile, the staff was by the bar socializing. How many people does it take to serve 7 patrons at the bar? 4.\n\nWill not return.", "author": "Asmika D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "The chicken and waffle IS THAT GOOD and I'm not even a chicken and waffle fan because I'm always let down. I had their salmon Alfredo with spinach a few weeks ago and that was good as well.", "author": "Isaiah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Oh. My. God. I love this place! They had me at burger with Brie and carmelized pear and they kept me with the shrimp and grits. Amazing food, drinks, atmosphere, and service. I've been here 2 days in a row and I'll be back tomorrow!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Came here for brunch and super impressed with this place. The interior finish sports a industrial rustic with class -- the entire glass storefront opens to the street on nice days. \n\nImpressive list of beers on draft! I tried and loved the empire cream ale; it was a crisp aromatic golden ale with a cream top.\n\nFor brunch, I got the Eggs Ugly Duck, which was an eggs benedict with steamed lobster! I always liked a spin off of classic eggs benedict and the ugly duck does it well. It also comes with a salad and some delicious seasoned potatoes! \n\nMy boyfriend ordered the chicken and waffle that came with spicy aioli sauce, which was also very good. We liked that it wasn't a bready fried chicken, though the waffle was a bit soggy for my preference. \n\nThe waiters were all super friendly and attentive! Overall, it was a pleasant brunch experience that I would definitely recommend to others.", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "The bartender was very friendly, and very knowledgable about the beer selection. The manager went out of his way to get us a table and the waitress was great even though we didn't eat and just drank! All in all a great experience, Really love the staff! Although we didn't eat there this time, we we've eaten there before and it's delicious, with great portions! Love the mac and cheese.\n\nUpdate: they just updated their bar which is much smaller then it was before, bummer. But it was really nice experience as usual. Nice bartender, and good selection. The reason why I took off 2 stars is how expensive it is!! We got 2 beers and it was around 20 bucks!! They also charge tax on alcohol, isn't alcohol already taxed? First time I paid tax at any bar ever. I probably won't go back because of how expensive they are, and that's the real bummer bc it's the spot I usually tell friends to meet me at, now I'll tell them to meet me at one of the many other great spots on Smith street.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "The atmosphere of the place was decent...nothing stellar, but the the bartender (guy, late 30s) was a jovial spirit.  He got me started with a beer that worked perfectly for what I was craving at the time.\n\nThe main point to my review is the food.  It was amazing.  I came for the poutine that I'd been craving but the menu has recently changed due to a new chef or some nonsense to that matter.  Instead of leaving, seeing as I was already enjoying a great craft brew, I opted to go all out and order the Steak-Frites ($23).  When the plate came to me with an already cut into strips steak with a nice garnish or carmelized onions and shallots (I believe) draped ever so delicately with a healthy serving of fries to adorn the presentation, I thought, \"look at this sh*t,\" sarcastically.  Nevertheless I dove into the first strip and was immediately sent into culinary ecstasy.  The steak was the best that I've had in quite a long while.  It was just juicy and tender and cooked to a perfect medium well as I requested.  The fries were nicely seasoned and a mixture regular and sweet potato fries.\n\nAdditionally, my companion had the Burger with pimento cheese and some other fixings.  It was well-cooked and pretty decent, but the flavor was lacking a bit.  I expected more seeing as the steak was so amazing.\n\nOverall, good visit and I'd stop in again for another happy hour.", "author": "Keilon L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-27", "description": "Bruh- this place is a joke- i got conned by you fake yelpers out there...food is weak, service sucks  beer selection was pretty good though...this place does not belong on smith st...hopefully the TEMP. CLOSED changes to Permanently", "author": "Thomas D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Great food , went there for brunch.. I had the chipotle omelette.. It was great , the home fries were seasoned and delicious . My bf had the tacos, he loved them. The mimosas were good. Friendly place . Can't wait to go back again.", "author": "Nika G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "With one exception noted below, I really liked this place.  Very impressive beer selection.  They had a lot of interesting stuff and a great variety...though I thought the flights were a little expensive.  Food was very good.  Burger was great and I loved the mix of sweet potato and regular fries...though I thought that was a little expensive too.  Only disappointment was my mushroom burger, which had two of the smallest portobello mushroom caps I have ever seen--they were so small and thin that I wondered if they were shitake mushrooms instead.  It kind of made me questions quality control in the kitchen, because it was such a pathetic serving.  Our server was nice and they were all on top of things.\n\nThis is a much needed addition to the neighborhood for eating and watching a game.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-12", "description": "If you want to entertain guests who are vegetarians/vegans or are those yourself, this is a great place to eat. If, however, you're craving chicken and waffles, take that craving elsewhere. \n\nI came here with HIGH expectations of the chicken and waffles but it didn't live up to the hype AT ALL. The waffles were so thin and the chicken was lacking in flavor and weirdly wet inside. \n( I'm still trying to figure out why that would be. ) On the flip side, I came with my Mom and GodMother who raved about the salads they had. \n\nWould I come back just to appease my vegetarian mamas? Probably not.", "author": "Sade E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "I was in Cobble Hill recently and was looking on yelp for a place to have dinner.  I am so glad that I found this restaurant.  For an appetizer, my friend and I shared the deviled eggs, and for the main course, I had the tortellini with cheese and shrimp, and my friend had grits with shrimp.  We were very impressed the quality of the food, as well as the attentiveness of the servers.  I would definitely go back.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Very nice place, and I like it in first sight. Came here with friend.\nGood atmosphere, friendly stuff. \nWe ordered steak and my friend ordered their special of that day - fried calamari with bbq sauce. She didn't know that bbq sauce is spicy, so when she tried it, she didn't like them and we asked to change it. The waitress and the manager said it's not a problem and they will make calamari plain. We were very appreciate for it. \nAs for me - my meal was tasty. I liked it, especially the sweet potatoes that comes with steak.\nI had really good experience,  I would definitely go again.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "This is my favorite place to brunch in the city. I came in two weeks ago and when I came back in today, both the owner (Dennis) and the bartender (Candace) remembered me - and my name - and my whole story (where I live, what I ordered, what neighborhood I just moved from, etc). \n\nIt's hard, in this city, to feel \"home\" anywhere; it's always so lonely, even amidst a sea of people. There's a reason I come back here --- not only is the food INCREDIBLE and the draft beer selection exceptional, but the vibe in this space is positive and easygoing and those who work here go the extra mile to make me, the customer, feel appreciated. \n\nI can't say enough good things. Go here.", "author": "Caitlin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "LOVED this place! We only had drinks but the food looked delicious and the service was great. Everyone had a smile and helped out where needed. I would definitely recommend and go back again for food!  It's a sports bar feel, but more high end. 4-5 tvs.", "author": "K M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "Oh my where I start with drinks?!?! Amazing and wings were good. French fries were also delicious, highly recommended", "author": "Sharla J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Had a great late night dinner while walking along Smith Street visiting bars on a Saturday night.  The server at Uglyduckling was friendly and helpful.  Great food and beer.  We enjoyed the 10oz stuffed brisket burger and the filet mignon.  The steak was tender and grilled to perfection.", "author": "Jeff R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "I'd give 3 1/2 stars if I could.\n\nCame here for an early dinner with the hubs on a Friday so it was not crowded and seats were aplenty. The place has a nice atmosphere, great service, very decent food. \n\nWe sat at the bar, I ordered a dirty vodka martini. The bartender/waiter steered me towards their pickle martini. It was okay. Not briny or salty or pickly enough. I'd had a not great DVM the night before at the NoMad restaurant so, pretty bummed at a second fail. \n\nBUT the beer selection at UD was pretty darn terrific. I got the Finback Oscillation, my husband got an IPA from Anderson Valley (CA) something called Grose. Both were delicious, complex, so good.\n\nMy salmon BLT was okay to pretty good. The bacon wasn't so present but the bun was great, the salmon was tasty and juicy, it did the trick. It came with shoestring fries which were done to a beautiful crisp but it was a mix of regular and sweet potato fries. That wasn't said on the menu and I was not happy about it. Why sweet potato? Just give me the real shit. \n\nHubs ordered mac n' cheese and the beet salad. The MNC was damn good. I held myself back from scraping the cheese from the bowl as the waiter took it away. Yum. \n\nWe shall return.", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "Great value, good food. Love the mac and cheese (add bacon!). What really makes this place is the neighborhood vibe that they've cultivated -- friendly and familiar. We keep coming back.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Stopped here for a family breakfast. Has really creative and tasty food. I got the Ugly Duckling Breakfast Waffle.\n\nIt is a cheddar cheese waffle with fried chicken, bacon, an egg, and maple syrup. Really creative and tasty sandwich. It was VERY filling. The only complaint was that it was a little too salty (and I love salty food). This is a very minor complaint.\n\nMy brother got a burger he said it was the best he has ever had. My mother got shrimp and grits and said they were very good. My father got the pulled pork dish and said it was okay. My mother got mimosas and said they were pretty good, but they were expensive.\n\nThe ambiance is loud and crowded at brunch time on a weekend. Not insanely packed, but our chairs were a bit to close to other tables and the bar.\n\nOverall a definitely a place to try out. Would I go again? Maybe, if I was in the mood for that amazing sandwich.", "author": "Joseph N."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}