{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "Good chicken and waffles. That's usually my go-to when I'm here. Had the steak once, and it was marinated and too sweet. The fries/sweet potato fries were good. Hope to try the burger next time, looked delicious. Old fashioned was sub-par.", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "3.5 stars! Staff is well mannered and patient. The beer selections are smashing. The burgers are delectable. The chicken and waffles... a disappointment. Little under seasoned and dry... and some of the saddest waffle I've had in a while.", "author": "Ani Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-21", "description": "Food was decent but bartender's service was slow and unattentive. We were sitting at the bar and had to wait 10 minutes to get menus..,", "author": "Julie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "**Brunch Only**\n\nFood: 4.5 stars\nDrinks: 3.5 stars\n\nThe Chicken and Waffles were fantastic. They come with both syrup and a spicy aoili, and each added it's own interesting twist to southern comfort food classic. We also ordered the Eggs Ugly Duck, the lobster was a bit off, but other than that the dish was perfectly prepared.\n\nDrinks, particularly the Bloody Mary, could use a little work, but all in all we were very happy with the brunch selection.\n\nDine on!", "author": "Robert B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "This place is amazing. customer service is great. The decor of the restaurant is really cool. Grear for a late date. Food is really tasty. Seasoned just well. Might have to make this my new hangout.", "author": "Tyheem M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-27", "description": "cool hipster-ish vibe\nawesome beer list\ngreat menu\nfriendly staff\n\nbbq beef poutine... OMG YES!!!! i can have this in buckets. \n\nchicken n waffles.... gives that buttermilk spot a run for its money. try mixing the maple syrup with the sriracha aioli... suggested by another reviewer, i tried it, it works!!!\n\ndefinitely will be back!\n\nEdit spring 2015: different chef, no more poutine, and the chicken and waffles were nothing great. Beer list is still pretty solid but the place kinda misses the mark now", "author": "Gennady K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "Totally solid pub menu, with great beers on tap.", "author": "seth l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-20", "description": "Friendly but poor service--they may have been short a waiter, bc I'm pretty sure the manager/owner was waiting on tables. Fried chicken was okay, but the waffle was Waffle House quality (ie Leggo my Eggo), and barely warm. Wings were good, and you can have a mix of different kinds. They were out of two different beers, and it took forever to get our drinks. Won't be coming back for dinner--there are better spots in the area--but maybe for beers and wings if there's a game on.", "author": "James S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "The vibe , drinks, and service are all good. It's a fun atmosphere with a number of tv's for the sports enthusiast. The food was served promptly.  The food is good, but not great. I thought some dishes needed some improving. My daughter ordered the appetizer Mac and cheese and for the price it's just ok and macaroni is a cheap food item it should not cost what it does.  The hummus appetizer was a nice size but the hummus needed more flavor. My husband ordered a burger with fries. They should replace the shoe string fries with thick cut fries. My shrimp and grits was tasty and my other daughter enjoyed her baby back ribs.  I think it's a good place but a little pricy for the quality.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Came here on a Friday night with the bf.  We've been meaning to check it out since it opened... mainly since we live around the corner.  \n\nI thought the decor was nice-- the place looks great.  I personally like the wood \u0026 exposed brick.  They have a decent beer selection.  Sure, there are places with better selections, but I wouldn't go so far as to call their options \"mass market swill.\"  The menu isn't incredibly imaginative but we thought it was done well.  It's just slightly fancier takes on traditional bar food... but I guess that's exactly what a gastropub is supposed to be.  We had the steak \u0026 one of the burgers for the dinner.  Both were cooked well.  To start we had the poutine \u0026 chips and salsa/dip.  Okay, I would have actually called the poutine \"disco fries,\" but it still tasted good.  The corn salsa \u0026 bean dip were also tasty; the tortilla chips were homemade but the portion was a little small.  The microgreens garnish was a bit corny but otherwise I thought everything was fine!  (I can't comment on the much-discussed chicken \u0026 waffles but someone at the table next to us got it \u0026 I thought it looked great.)\n\nYes, the TV tuned to the Weather Channel was odd, but seeing as how I'm not a sports fan I guess I didn't really mind.  I certainly watched the Doppler radar more than I did the Yankees game.  (That being said, it's a decent place to have a beer \u0026 watch a game, if that's your thing.  There were 4 or 5 large TVs.)\n\nI wasn't bothered by the crowd as much as some other reviewers.  Old?  I mean, sure, the crowd was a little older than Boat Bar.  But bridge \u0026 tunnel??  I've been living in this neighborhood for a few years now \u0026 I've yet to see the B\u0026T crowd!  I guess the patrons just weren't hipster-y \u0026 pretentious enough for some. \n\nThe service was very friendly, if a little slow, but they were busy that night so I wouldn't hold that against them.   My only complaint is that they took too long to turn on the air conditioner on what was a very humid night.  But I'm sure they won't make that mistake again. \n\nI don't know why people found it \"weird\" that the staff were recruiting customers from off the street.  I think it's pretty common \u0026 acceptable practice for a new business.  And in fact, I was greeted on the street by one of their hostesses a couple weeks back \u0026 she gave me a card for a free beer, which I thought was a nice touch.  It's what motivated my bf \u0026 I to go, so I wouldn't have called it \"weird.\"\n\nOh \u0026 I thought the place was pretty affordable.  We got two beers, two starters \u0026 two entrees \u0026 the bill only came to $66 (we didn't even redeem our free beer card).  The burger was only $10.  Some reviewer found that to be \"overpriced\" but maybe she's new to NYC... $10 for a burger (plus homemade chips) is not bad at all.  It's only a few bucks more than Shake Shack down the street \u0026 that's fast food!!\n\nSo not a bad time at Uglyduckling.  They're not reinventing the wheel \u0026 they have a few minor kinks to work out, but I thought it was a decent-enough addition to the neighborhood.\n\nI'm puzzled by some of these bad reviews though.  I actually find it \"weird\" that some of the bad reviewers are singling out the positive reviews as shills, when they each only have one review to their name.  It appears like they have some sort of vendetta against the business owners.  Either than or they're just really pretentious assholes.  Or both.  \n\nAnd no, I'm no shill myself.  I have no affiliation.  I thought it was a nice enough business.  I wouldn't travel out of my way to go here, but since I live around the corner I'd probably stop by again.  It's a nice neighborhood spot but definitely not a destination for trendy foodiots.", "author": "Matt P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Very lovely place to eat. We went mid afternoon for something stronger than lunch but lighter than dinner. I had the chicken and waffles,descrumptious!!!! My friend had, mistakenly, received salmon on a bed of spinach, which she thankfully ate and enjoyed. Great manager, Kevin.  We will be back!  I ate too fast to take a picture, maybe next time maybe not. Yum.", "author": "Paula L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "I've been to UD about 3 times already and I absolutely love the fact they have an array of beers on tap and their bartenders are knowledgeable about almost all of them. I'm a fan of their salmon appetizer and main course. Haven't' ventured off to anything else on the menu. If it ain't broke, don't fix it ;)", "author": "Alex W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "The food here sounds better than it is. The place is nice, the food is not bad, and service is friendly. However this isn't somewhere I would return to, since it's pricey for mediocre bar food.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "We had a 11 person group and the staff was more than accommodating. The bar had an awesome selection of local beers with most on tap. I had the Manhattan and it was perfect! The wings (Cajun and buffalo) were amazing. The Cajun was a nice moderate spice but super crunchy. The lobster mac and liver mousse were also incredible. I had the hangar steak and it was served coated in a sauce that seemed based in molasses, which was tasty. I'd recommend this spot. The staff is very nice and the food/drinks were on par.\n\n***the menu is different from most reviews. Apparently there's a new chef and many things from the menu have gotten cut.", "author": "Kimberly D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Had Fried Chicken and Waffle for brunch it was delicious!  I will definitely come back for dinner.", "author": "Ellen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-05", "description": "Food was good. Nothing spectacular. The prices were good for what you get. I'd go again if I was in the neighborhood.", "author": "Mahalania F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-09", "description": "We came to brunch here since the line at Cafe Luluc was a bazillion people long. There was nobody in the place, which probably should've made us turn and run. Well, all of the options were overpriced, including brunch drinks. My friend wanted the tacos without pork, but apparently, they don't cook to order - everything is already mixed/cooked? Like a fast food restaurant? Um, OK. Service was also lackadaisical, though they did seem concerned since neither of us wanted to finish our meals nor did we ask for more drinks, though we definitely were in the mood for them. We went down the street to have much cheaper mimosas and bloody marys", "author": "Kelly W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Had dinner at Uglyduckling tonight with friends, really great experience.  All of us got the ahi tuna burger which was really fresh, cooked just right and served on a delicious roll with great fries and sides.  The kale side dish was amazing, great flavor and texture.  And of course we had many beers, a few of which were among the best beers we have ever had.  Loved it, will be back.", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "I was here the other night and it was fabulous! Had the scallops rissoto- omg it was so delicious and rich. My friend got the steak- it was a perfect medium rare! And the atmosphere was really great, busy and fun but laidback. A great addition to the neighborhood! Can't wait to come back and try the chicken and waffles.", "author": "Marina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "Went one Friday on a living social deal.  Surprisingly good. We had the chicken and waffles and the salmon with spinach salad. Very comfortable environment. .shout out to kevin and the lovely bartender. We will definitely visit again..on a personal note..take care of yourself kevin we need you around! !", "author": "Nikki B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}