{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "GREAT new restaurant in Cobble Hill! Great outside and inside decor - Cool gatstropub restaurant vibe with an amazing craft beer selection. \nGood place for everything- a date, meeting friends, even a family dinner (i was there with my hubby and baby).\n\nThe owner, manager, hostess, and waitress were extremely warm and accommodated my pouty 15month old. They came over to make sure everything was okay multiple times-not in an annoying way; just a \"is everything cool and can we do anything more for u way\".\n\n\nWe shared the pork belly and sweet corn fritters as an appetizer. Comes with a mango(?) jalepeno same that is not hot at all.  Weird sounding combo but very yummy. A perfect guy appetizer for your hungry date (who happened to be my husband , in this case!) . He had the chicken and waffle and liked it a lot. A little different from your typical soul food menu item- a bit crispier and maybe need some powdered sugar (?) for presentation. But still good.  \n\nI had the ugly duckling burger-needed the ketchup for a sauce addition. But was cooked to my medium well perfection and yummy. The chips were a hit with my son. Handmade thin potato chips with sea salt with sliced pickles on the side. \n\nOverall, a great addition to the neighborhood. Will definitely come back and have already recommended to fellow Brooklynite foodies.", "author": "N N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "went for dinner on a Wednesday night and was pleasantly surprised by the whole experience.\n\nthe inside is rustic yet modern and very cozy...especially with the chilliness outside.\n\nthe food was awesome...shrimp tacos were super tasty as well as the muscles in a delicious broth.\n\nmy only complaint is that the bartender acted like he knew everything there is to know about beer (not uncommon in this neighborhood) and actually gave us the wrong information!  oh man...bartenders need to stop trying to impress beer drinkers especially when their patrons tend to know more than they do!  can i just get served a beer without a history lesson on hops attached to it?      \n\ni will return.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-15", "description": "Solid beer selection. I tried the duck poutine and it was good although I'm not sure I'd call it a poutine. It has a kind of sweet gravy which was strange. But still good. It's also a nice spot to watch sports. Lots of TVs.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "I've died and gone to ducking heaven! Deviled eggs were outstanding and well accompanied with a simple salad. Mac n cheese was cheesy and yummy with perfectly cooked minishells. Fried chicken and waffle......juicy, lip smacking, flavorful. Outstanding. ....best chicken I've had in a long time! Steak frites was tender and covered in a chimichurri sauce that works well. Last but not least.....my favorite element to this bar is the 30 beers on tap with an emphasis on local breweries! Well done Ugly Duckling!", "author": "Alfonso C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "The steak is seasoned in a very bizarre manner.  You might like it, but it definitely wasn't what I was expecting.  And it was medium well when medium rare was requested.\n\nBartender/Manager was inattentive and condescending.  \n\nWaitress was awesome. Like the space.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-31", "description": "Pros: Food was tasty. We had the ugly duckling burger and the steak sandwich, both of which were well cooked.\n\nCons: Service was rough.   When I asked for a drink that was on tap, they said they didn't have that one today.  No problem, I selected another one.  When they came back with my drink, they gave me a different one from what I had ordered, with the explanation that \"they tasted the same\" and that the other drink I wanted wasn't available today either.  Additionally, the drink order took quite a while.  Further, we wanted to sub our fries for veggies, but the server couldn't tell us what the veggies were.  We opted for that anyways, but we were served something that was primarily squash, a vegetable I hate.  Finally, when the bill came, we were up charged for the veggies, despite not having been warned of that previously.\n\nAll in all, despite solid food, the overall experience was negative enough that I will not be going back.", "author": "Elle K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-02", "description": "On our way to Cafe Luluc, we passed it multiple times \u0026 didn't have a wait (with customers inside though).  As a result, we decided to try it out for Father's Day.\n\nThe atmosphere/ambience and service were decent, but the food was mediocre.\n\nWith all of the rest of the options, we probably wouldn't come back anytime soon.", "author": "Ada C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-01", "description": "I'd like to see this place around for while. Smith street is not an easy street with places shutting down left and right- high rents most likely being the reason. \n\nReally amazing service and great touch on the food and beer list. It is the feel you want from a classy gastro with the right amount of noise and bar atmosphere joining forces with fine cuisine.\n\nI am down for another round.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "Can't beat this place! Great food, great drinks and super friendly staff.  Whether you're heading here for a low key brunch or watching a game on one of the many flat screen tv's, Uglyduckling is where it's at.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "Walked in today at 3pm, seated by an uninterested waiter and ignored. Walked out and took my business to a place that knows how to treat a customer.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "The service was good. Servers were attentive. Food was great. We had the devils on horseback. The right combination of creamy and crispy. So good my girlfriend wants to make them herself (and she hates oysters!) \n\nMy girlfriend had a burger. Pretty standard deal if you had one at a diner.\n\nI had the chicken and waffles with the aioli and maple syrup. Individually they were ok. Chicken was crispy waffles were soft. BUT when everything came together the flavors really became more than the sum of its parts. They blended together so well I couldn't eat them separately after that first bite. (On their website they say you have a choice of regular or red velvet waffles. I didn't happen to notice that on the menu at the restaurant. Maybe I missed it.) The meal was great and I'd definitely go back for more.", "author": "Richard P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Pulled pork was amazing! The Irish coffee was tasty as well. The restaurant had a pleasant vibe and I highly recommend this spot for brunch", "author": "Eric G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "I came to Ugly Duckling after Char No. 4 served me pancakes that tasted like ginger from a sushi plate. \n\nHere, the service was quick. The bar tender is hot. Chicken and waffles were superb! And the draft list is excellent! \n\nI will definitely be back for more!", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "Starved after the Brooklyn Half Marathon this place was our post race destination!!! Talk about ridiculously good! The brunch was to die for. It was an indulgence I waited weeks to have! My bestie loved her Bloody Mary (not my thing) and the Hawaiian Coffee was yummy and strong! Bring on the food! Chicken and waffles and shoestring sweet and regular fries.... Salty and delicious!!! Our waitress Alexandra was super friendly and attentive offering us some beer suggestions! I almost wanted to tell people walking by who were checking it out to come in and try it out! Definitely a return visit is in the future", "author": "Tricia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "I think Uglyducking is awesome all around, but perhaps especially to watch college football when you aren't a college student.  I called about an hour before our game was about to start and asked if they could set a table up for five, any time between then and the game.  They told me they would have a table to us by kickoff.  When we arrived we saw our table set up in a prime watching location, so we went over and sat down.  Within a minute we were warmly and enthusiastically greeted, the TVs were changed to NBC and we were asked what we were drinking for the game (and no judgment from the waiter when I eschewed their top notch beer list for numerous gallons of prosecco over the next four hours).\n\nFood was just perfect, and they had something on the menu for everybody.  When three more friends showed up, they had no problem pulling up a table and adding a few chairs.  The night was seamless (except for the painful Clemson loss).  Most of all, the restaurant staff really made it a fun evening for us by keeping the drinks flowing and sharing in highs and lows.  They were flawless.\n\nTakeaway, this place is perfect for guys' nights, girl's nights', parents, your cousin and his friends in college, and everybody in between.  Great job making a comfortable place to spend a night out.", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "Chicken \u0026 Waffles!!!!\nThey were everything chicken and waffles should be. \nChicken: light, crispy, well- but not over seasoned, fresh out of the fryer. \nWaffles: airy, fluffy, pretty perfect density. Crisp on the outside and soft on the inside. \nBoth paired well with the other and were equally tasty in either the syrup or the sriracha/mayo dip. It was cool to be able to get both sweet and savory on the same plate. \nAlso, I was a little fatty and had the mushroom kale risotto. It was risotto-y. Lots of shrooms and it remained hot as hell to the last bite, which I was very pleased with considering I destroyed the chicken and waffle first. I was way too excited to begin eating and burned my mouth, but I can blame no one but my crazy workout beforehand which left me ravenous with hunger. \nCan't wait to try more of their menu!! Yay!!", "author": "Marissa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-06", "description": "I went to ugly duckling based on all of the Yelp reviews promoting the chicken and waffles here. I had been craving chicken and waffles for days and had been excited to try their version...The breakfast I received made me want to throw my phone in frustration. The waffle was SOGGY!!! The whole point of fried chicken and waffles is to enjoy the crunchiness/ crispiness of both foods. If sogginess was fine then I would have ordered fried chicken and pancakes...wtf don't go here for this dish. The chicken was well seasoned I must say but it was boneless... Not my fave. Oh not to mention both me and my mom got soggy waffles which makes me think they consistently serve them soggy/not crispy. Think of eating fried chicken with a flat pancake with waffle indentations that serve no purpose...exactly the same gross flavor.", "author": "Brittany A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Fair pricing for fairly good food. I got the shrimp tacos which were pretty delicious. The only downside was that they forgot about our table which ironically enough was the largest party there (four people). Forty-five minutes later, we finally got our food and it was amazing. That might have been our hunger talking though. They knocked off 10% off our bill in the end and we walked out appeased.", "author": "Tracy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "This place is good. The service is good, the food is good, the drinks are good. But its not that memorable. \n\nEverything was made with high quality ingredients and tasted fresh. There were a few things about it that make it so we probably won't come back unless we happen to be in the neighborhood but if we are we would order a burger and the ugly poutine again because they were so worth it!", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "My boyfriend and I came here for brunch because we were in the neighborhood and saw it had 4.5 stars. My food came out cold and I had to wait for it to come back out while my boyfriend ate his meal, which was pretty annoying but I understand that sort of thing happens at a busy restaurant. I expected them to maybe comp one of our drinks for the inconvenience, but they did not. The main reason I'm only giving 3 stars is because the food wasn't very good. The burger was over cooked and the pulled chicken eggs Benedict was dry and kind of flavorless. Our waitress was friendly and the drinks were good but I doubt I will be returning.", "author": "Kerri M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}