{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "I was looking on Yelp for a quick dine in dinner, The name Uglyducking caught my eye! When I walked in, sadly, there was no one to seat us, so we sat down our selves. Our waiter came in a few seconds with the menu and recommended the popular dishes. We got the chicken and waffles, and the burger. Both dishes were good and satisfying. I would try the spicy sauce they recommend, it taste just right with the chicken and fries from both dishes. Overall, I will definitly come back again to this place, especially to try there brunch menu.", "author": "May L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Best steak I've had in years! Last night I ordered the hanger steak, which was temporarily replaced with a filet minion, and it was incredible. It was perfectly cooked to medium, flavorful, and came with an delicate sauce that complimented the steak perfectly. We also ordered the mussels and chicken and waffles. Both were very good but the steak was definitely the winner.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Not the most traditional chicken and waffles but they're damn good \nService could not have been better either. Nice selection of beers.", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "I probably wouldn't go back for food because the menu doesn't have that great of options. My sangria was great though!", "author": "Katelyn R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "Nice cozy place. Staff was pleasant. But their signature chicken and waffles has dry chicken and the service was slow. The chicken wings were good.", "author": "Sydney R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "I was satisfied with this meal!\n\nInitially I wanted to try another brunch spot, but calling ahead I was told the wait would be up to an hour and I was getting hangry. Yelped a few spots and came across Uglyduckling and I'm glad I did! \n\nWalking in, no one really greeted us and we had to go up to ask for seats (which was one negative point.) There were two tables of two along the way that were VERY close to each other, it almost seemed impossible to get in there. (The one next to the wall seemed like a very claustrophobic area.) I asked if we could sit toward the other wall because it was out in the open so he gladly picked up an extra chair for me. There was some football game going on so at one point fans were cheering super loud and it scared the bejeezus out of me.\n\nAnyways, on to the food. I almost always get eggs benedict when I go for brunch because that's the only time I can get it and I love it!! I got the Eggs Ugly Duck, which on their website says it has lobster, but on the menu in the restaurant it was lump crab. They give you a side salad and some home fries on the side. I don't like home fries but my boyfriend ate almost all of them so I guess they were good. The salad was meh, not enough dressing, ate one leaf that tasted okay but ate another leaf that just tasted like a leaf with no dressing which is unappetizing to me. The benedict itself was quite tasty! The hollandaise sauce was spot on, the poached egg was runny, the bread wasn't too hard to cut but wasn't soggy and they gave a generous amount of lump crab! My boyfriend got the Smoked Ugly, we split our dishes, and this benedict was also really good! This one had more flavor, due to the pulled pork, and was obviously more meaty which he enjoyed more. I thought they were both delicious and I think it depends on what you're food mood is that day and which one would suit your tastebuds at that very moment so I would definitely recommend both.\n\nFor a drink, I got the lemonade which was actually very yummy! There was a balance of sweet and sour, I can't handle sour things too well so I like when my lemonade is on the sweeter side. However, they put so much ice that after 20 minutes of having my drink it was so diluted I didn't even want to drink it anymore.", "author": "Kara N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "Meh. Pluses and minuses. Such high hopes for this place. Loved the name and I loved the look. Staff is friendly and the food was fine. Nothing great, but not bad. Prices are high and the part that killed it for me were the drinks. The drinks were pricey and sounded delicious, but were mediocre. At least my drink was strong. Mediocre and weak plus expensive is the worst. This place is lackluster. I'd go if invited, but wouldn't go out of my way.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "The chicken and waffle were even better than I expected but the real winner was the Mac and cheese with lobster. \n\nGreat relaxed environment and parking isn't too bad on a Friday night. \n\nGreat food. Amazing service!!!  \nWill definitely be back.", "author": "Joey V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "Walked in with no reservations. Friendly staff, nice, open interior. My only complaint is that the food took a little while to come out. The table next to us were seated after us but somehow they got their appetizers and main course before us. \n\nI ordered their classic burger. It was good but I don't think it was worth $14. Their shoestring fries were the highlight though--super crispy and a mix of regular and sweet potato fries. Probably wouldn't go back for their dinner service.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-13", "description": "I stopped in for a burger a few weekends ago, during that weird lull after brunch and before dinner (late lunch/early dinner?). I was sat way in the front which felt odd but I didn't protest. My server was friendly but forgot a few of my items, and I had to flag him down many times. The burger was decent but didn't come with cheese like I had ordered. The place feels like a mix between a sports bar and a nice sit down place, so maybe too many things are happening at once. Stop by if you're in the area and want a bite, just be prepared to leave feeling like you deserved a bit more.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "Strong entry in the chicken and waffles sweepstakes.\n\nWhen craving chicken and waffles, not sure anymore whether the go-to should be a trendy pub such as Uglyduckling versus a bona fide Southern restaurant or chicken place.  The thing with pubs is that they also serve winners such as barbeque shredded beef poutine - at $11, still a must try.\n\nHappy with the choice of dark meat for the chicken - after all, dark meat is better.  Good batter crunch on the chicken with a light-enough waffle.  Dish is served with syrup, but really wins when the syrup is mixed with a side of barbeque sauce (available by request), as served at the Back Bay Social Club (in Boston).\n\nDo get the side of bacon, candied.  It's not just for EpicMealTime.", "author": "Steve L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "My sister and I came here Friday night and it was packed. No seats available and only one server and one bartender, so we both thought we might be in for a long night and decided to get drinks while waiting. We decided we were hungry though, and instead of waiting for a table we ordered food at the bar. \n\nThis place just might have the best burgers my sister and I have ever had. She ordered the regular cheeseburger and I had the pimento cheeseburger, and we barely ever finish food but the two of us completely demolished those burgers! They were thick and tender and juicy, the bun was light and soft, and the pickles tasted so different from anywhere else and really brought out the flavor in the entire meal. My sister and I constantly exchanged satisfied looks with every bite. \n\nIn addition, the ambience of the place was great. It's got a more upscale kind of feel without being too bougie, if you know what I mean. It's polished and classy for a relaxed night out with someone you're close to. Might not be the best atmosphere for a first date though, it was kind of loud given that it was a Friday night, but my sister and I had no complaints.\n\nHowever, I decided to write this review mainly to commend the server and the bartender that were on duty that night. I wish I had gotten their names to include them! Despite the fact that they were definitely understaffed and overwhelmed, the two women on staff were attentive, friendly, and absolutely on point with their service. They both kept apologizing to us for any sort of wait because of how busy it was, but 1) the bartender was 100% aware of her patrons - my sister and I would be almost finished with our beers and she would immediately offer us another drink and have our empty glasses cleared with our next round in front of us before we could even notice, and 2) as I was scanning the place and people-watching during our meal, everyone seemed focused on their company and like they were genuinely enjoying themselves - no heads turning looking for the single server who was running around busting her butt, or hands up trying to catch her attention. THAT was impressive. I've been a server and a bartender and so I know how hard that must have been for the both of them, and how great the service must be at this place. I believe the manager came in to help halfway into our dinner, and as we were leaving I stopped to tell him his staff is great and that they made our night, which I really never do.\n\nDefinitely will be back here again soon with my boyfriend, and will be recommending this place to all my schoolmates in the area. Thank you again UglyDuckling!", "author": "Arlene A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "I really love this place.  I've had dinner here three times and each time, I was impressed.  The food is fantastic.  The shrimp tacos are really great.  My friend had the mussels and said they were also terrific.\n\nThe aura is really nice.  Rustic and comfortable.  Convenient location on Smith Street.\n\nI'll be back!!!", "author": "S K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Came here for a birthday brunch-making rsvp was a breeze and they were so accommodating with the changes i had for a party of 7 on 8/23/15.\nusually restaurants aren't really flexible with seating and time, especially when running late and on the weekends. but because it was  the weekend and trains were horrendous as well as traffic; we were all running late. not only did they seat us without our full party- and completely understood our situation, they were also so freaking sweet! so bombdiggity!\nthe full staff was so friendly and it was truly a warming atmosphere. \n\nbeing in the hospitality industry i feel like we don't often receive warm smiles or gestures, which i understand- it's tough, tiring and busy. but despite how disoriented and a hot mess my group was because we were all rushing to get there, they made sure we were comfortable since we step foot inside. they were patient as we chatted away, trying to decide what to eat  as we waited for one more guest to arrive before making our orders. they did not rush us which i loved! it was fairly busy but not packed to the point it was hard to breath but still busy. i love this neighborhood and i love this place, it's just so cozy. \n\nmy friends were psyched about ordering booze for brunch of course, i had the eggs ugly duck, which is eggs benedict but with lobser. NOM NOM NOM! it came along side with some greens \u0026 home fries. OH HAIL YASSS. i was contemplating on this dish or their chicken and waffles, but how can i NOT order eggs benedict for brunch- it's my fav! it did not fail me, super yums. my friends all seem to enjoyed their food as well, a good number of us had the eggs ugly duck. they also enjoyed their boozy drinks. staff was also attentive to make sure we had everything we need as we pigged out and chatted out. \n\ni even did some ice breaker games there and made my friend drink water out of a baby bottle for the rest of the brunch, and you know what? no judgement, weird looks or questions asked, they just let our table chat away and enjoy ourselves. often times, in other places  especially for brunch when they're busy- when they want us to hurry up and leave they would constantly ask us if everything was okay and if we were done if we want the check...etc- but not at  uglyduckling, they are just awesome cause they gave us time to chat and didn't rush us but still made sure we had the stuff we needed as well as tending to all their other happy guest.\n \nplaces like these is a gem. i'm a party pooper saw them prepare my cupcakes. the staff is just so darn awesome. sang happy birthday with my friends! aside from the food- i feel like what perfects an atmosphere is the people who serve there- thank you uglyduckling staff. i would come here again and again and again. \n\np.s. i just noticed my friend wrote a review based on the same day here too, holy cow you guys went out to get candles for the cupcakes?!?!?! YOU GUYS ARE A WHOLE 'NOTHER LEVEL OF AWESOME. thank you for making my birthday so memorable :) the reason why i love being in hospitality is because of people like you- this was not just a brunch- made me totally want to go beyond in the future for people i encounter too just like you did for me. seriously dude, thanks uglyduckling staff xoxo", "author": "Caroline T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "UglyDuckling\nNY: Brooklyn: Cobble Hill\n6:30pm Thursday 22 October 2014\nFour Stars\n\nAfter a 4 hour wait in Brooklyn criminal DWI part, I needed some comfort food. I sat at the end of the bar. It was happy hour but beer didn't really appeal to me. There was low volume reggae music playing which was not out of place for the place. There are four flat screen tvs and about 30 taps. I asked for water three times which would have upset me but the Bartender recognized the mistake and introduced himself to me. After this, my customer service was great. I had the chicken and waffles. The boneless chicken was good but not really chicken and waffles to me. The breading was well seasoned and crispy but the lack of chicken skin was disappointing. The inside was moist and tender. The waffle was okay - it wasn't very crispy but had good flavor. They served it with mildly spicy aioli and maple syrup. The sweet and creamy made a good combo. I asked for hot sauce. No franks but sriracha. I mixed it in with aioli for the perfect amount of heat. I also had a bulleit rye on the rocks. The big glass and the cold draft ice made the drink taste good but portion seemed on the smaller side.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Walked right in early on a Saturday evening, got seated right away. The table service was OK, the barman was great -- very knowledgable about their vast beer selection, was a delight to order from the bar. I was intrigued by the menu, hoping my stomach were as big as my eyes. We waited a while for our meal, even though the place wasn't jam-packed, and they messed up my friends order, but comped it for her. I ordered the Chicken and Waffle sandwich was really good. The sweet and russet string fries were a great texture. My friend's burger looked really good, and she said it was cooked just how she wanted. I would go back again to try something else. I felt like it was a little expensive for what it was, but overall, decent prices for the neighborhood.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Love it here!  Great beer selection, good vibe and delicious food. Chicken and waffles and the burger are both equally as amazing.  Can't wait to go back!", "author": "Allie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "I was disappointed in this restaurant. I ordered the chicken and waffles. The waffles were not crispy, nor was the chicken. The  food came out as if it was cooked and then nuked in a microwave. My husband ordered the breakfast sandwich that came with fries. I must say the fries were excellent; they were  the best thing we tasted. \nBloody Mary was decent ( really small though ) and the Hawaiian coffee was a nice way to warm up. Ambience is nice, beer list is decent, the food was mediocre- will not come here again.", "author": "Kristy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "You must come here!!! Best drinks and best brunch. The food is amazing. There is nothing bad on their menu.", "author": "Briana L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-21", "description": "Eh no thank you. Over priced, and weak drinks. I only tried the French fries, but for $7 I thought they'd be the best French fries I ever tasted. Ultimately, they were a joke. I'm sure the hipsters in the neighborhood would love this place though.", "author": "Shantal W."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}