{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "We went here a few weeks ago while visiting Brooklyn. Stopped by around 2pm on a Thursday and it was empty. It's a nice place with a clean bathroom. It had a nice looking bar and we enjoyed our food. My husband got the chicken and waffles. He liked that it was tasty crispy boneless chicken. I got a BLT salad, which I always order if it's on a menu. It was very good but not the best I ever had. Overall a nice place I recommend to check out.", "author": "Valerie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-23", "description": "Grabbed dinner here before heading to the Barclay Center:\n- Nice atmosphere \n- Excellent microbrew selection + One price for all selections (love that!)\n- Burger + fries were a solid choice\n\nYes- would recommend if in the area...good for dinner and/or drinks.", "author": "Steven S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-19", "description": "Chicken and waffles, good beer selection... all I could ask for really. The later hours helps too I'm an area that's so quiet. Came in on a Monday and it was dead. No idea what it's like on Friday or Saturday.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "This place was delicious!  Had the lobster, shrimp, asparagus, mushroom risotto.  It was perfect.\n\nI wish I had room for desert but I'll have to try it on my next visit.\n\nThe beer flight bartender choice came out with good selections, cider was delicious as well.\n\nCan't wait to try something different next time!", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-23", "description": "Scenery was nice. Staff was nice too. Wait for the food was about half a hour. Food wasn't special. Overall, eh. This rating is mostly based off the food. Everything else was fine", "author": "Franklin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "Expensive, and not worth it.  I was with my parents for 2beers and 3apps, and my fiance (Stacey) arrived for dinner.  Stacey had a beer (all beers were happy-hour) and my mother had 2 white-wine glasses over the evening.\n\nThree apps, 2 main courses, 2 sides, the drinks, and a tip came to ~$200.  So, not terrible but not at all cheap or medium.\n\nThe mussels had to be sent back to the kitchen - half the plate had not opened.  When the \"replacements\" arriving, many of them had not opened either.\n\nThe shrimp and grits were tasty - I liked the plate.  Mussels were salty, and had issues.  The calamari was not good, and despite being in a big bowl, was hardly touched.  I did not eat the wings, and the crab-cake (at one, it was expensive I feel).", "author": "Liam R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "The chicken n waffles are awesome!!!!! I split it with a few people but would definitely order it as a main dish next time. I had the salmon blt sans bacon and really enjoyed it. I'll be back!", "author": "Fallon G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-20", "description": "It was an underwhelming experience to say the least. The first thing that confused me about this place is that it seems to be more a bar and not a restaurant. It feels too small to be a full-fledged restaurant. There were 4+ people at the bar having a very loud and drunken convo coupled with the loud music, it was impossible to have a one on one convo at our table without shouting. The kitchen is so close to the eating area that our clothes wreaked  of combined kitchen smells. It clearly states on the Yelp page that if you checked in, you would receive 1 draft beer. When the bartender came to take our order and I asked him about that he looked at me bewildered and said \"I don't know what that is?\". It was very awkward. He ended up not charging us for the beer, but still it was super weird he didn't seem to know about the deal, or perhaps even what Yelp was. I ordered the duck, and it was mediocre. They used way to much salt. My husband has a burger and he said it was just \"meh\".  The price point was not equivalent to food and the overall experience.", "author": "Nana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "Came here for dinner \nThe guy serving us was great very knowledgeable about the beers and menu \nThe crab cake was ok according to hubby nothing to write home about \nThe calamari looked amazing\nBurger was super tasty\nCute decor", "author": "Maya B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Absolutely awesome! Candace was  the best! The food, service, drinks were all the best. Looking forward to coming back asap. Aubrey was the sweetest. Please have them both on October 24th. Thank you also to to the incredible chef. Portions are huge.", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-11", "description": "A fine pub kind of place with a laid back atmosphere but just an overall strange experience. My friend made a reservation by phone but when we arrived the hostess had no recollection that this had happened. Luckily it was not full so we were seated anyway. Our sever then proceeded to tell us the four or five items on the menu that they were out of, which really then limited what we could order. Then when our food arrived, it was normal pub fare but at high Brooklyn prices - a standard grilled cheese (nothing fancy...like this could be made at home) and a small bowl of tomato soup was $18. I will say that my hangar steak on pear and goat cheese salad was really tasty, so that was certainly the highlight of the night! They cooked the steak perfectly.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Strolled in on a Saturday afternoon for brunch around 1pm with a party of 3. Seated immediately. It filled up more when we left. Waiter was very friendly. \nStarted off with the Hawaiian coffee. They have a good selection of adult brunch drinks. The Hawaiian coffee was better than the Irish coffee.\nWe tried the deviled eggs, sausage, and the smoked ugly with pulled pork. The sausage was the best. Crispy skin but tender deliciousness on the inside. The deviled eggs were nothing spectacular but the greens on top of them were tasty. The dressing for the greens is really good and light! The smoked ugly was filling and the poached eggs were made to perfection. The potatoes they came with was mediocre. Overall I had a good experience and didn't feel rushed enjoying my Saturday brunch! Would come again!", "author": "Brittany M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-23", "description": "I gave three stars because they did not impress me that much. I would not take here chicken again, tacos were so so. It's nice ambience, but really need to work out on the food.", "author": "Alina K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-08", "description": "Our waitress was sweet \u0026 attentive, but the kitchen took waaaaay too long. A fair amount of tables, but not packed. We spent almost 2 hours there \u0026 over an hour of that was waiting on food. The chicken \u0026 waffles were amazing as was the Mac \u0026 Cheese. We also really enjoyed the spicy pineapple margarita, calamari \u0026 brussel sprouts. The whole baby chicken \u0026 mashed potatoes were not eaten \u0026 taken off the bill. The chicken had much too strong of an herb taste, almost like eating potpourri \u0026 the potatoes lacked creaminess. We'd probably come back if we were nearby, but definitely wouldn't seek it out again.", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Dinner and brunch were both outstanding.  The staff was friendly, efficient and professional. The food was delicious and well presented. The cocktails were very tasty. The atmosphere was rustic and homey.", "author": "Lawrence T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "This is one of my favorite place to go to for brunch. There's no ridiculous long waiting game before you get to sit down and order away to your heart's desire.\n\nTwo of the dishes that stood out on my visits here were the fried chicken \u0026 waffles (you must get) and the smoked ugly. Both are the highlights from their brunch menu to be honest, and I'm trying so hard not to be bias about letting you know that of the two, fried chicken and waffles are the better choice. I only mentioned that because I love fried chicken but like I said, not trying to be bias, so those are the top two dishes to get when you're here!\n\nService is friendly, they have several TV's for game watching and a nice bar area to watch the TVs.", "author": "Donna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "Came for dinner. I got a dry-aged ribeye steak that was flawless. It came from Los Paisanos next door, a butcher who is known for flawless meat.\n\nFor dessert, a cookie skillet. It's a cookie in a small cast-iron pan with ice cream on top. What more could you want? Just don't burn your fingers on the pan, like I did. Because it's hot.\n\nAnd the bartender is a kind man.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Amazing food and cocktails!!!! We came late on a week day and had to wait 10 min to be seated but everything didn't disappoint.  Started off with launchpad drink which was amazing and long island ice tea was great.  We got the gnocchi which was cheesy,  fresh and perfect portion.  Then we got chicken and waffles. The chicken was perfectly crisp and the waffle was perfectly sweet with the syrup.  Next we had the pear salad that was devine! The pear was perfectly cooked and soft and the greens were dressed with the right amount of dressing.  For dessert we got the chocolate chip cookie in cast iron skillet topped with ice cream.  Our server was great.  The seating is a little crammed and not that many seats.  In prime location and I see why it's always busy totally would go back!", "author": "Brigette U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Great beers on tap ! Chicken and Waffle on point ! Great experience overall .. Will definitely be back !", "author": "Noel R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-10", "description": "We were in the neighborhood looking for breakfast around 11:00am and this seemed like one of the best options. We gasped a little at the prices, $19 for breakfast tacos, and something like $22 for french toast. Regardless, we were in a rush and decided to give it a try. \n\nWe both opted for the avocado toast, given it was the most reasonable item on the menu at a whopping $10 (Cafe Gitane in the city, which has the BEST avocado toast only charges $7.25). \n\nUGLYDUCKLING is HOME TO THE WORST AVOCADO TOAST IN ALL OF NEW YORK CITY. \n\nThe bread was stale, and then toasted. So it was more of a cracker texture that crumbled and cracked when you ate it. It wasn't a thick slice of fresh, moist multi-grain, it was store bought - probably a month ago. The fried jalapenos looked like large boogers placed on top of a brown/green overripe avocado spread.  The spread of avocado was meager at best, and again tasted of an avocado that had started to rot. \n\nSadly, I wish I had better things to say, because the staff were really nice. The kitchen needs to step up their game, use better ingredients to justify these outrageous prices.", "author": "Taylor F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}