{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Maybe we got the wrong things? If you're going to charge $15 for Mac n cheese it should be really good. If that flatiron steak is bad it shouldn't be $25. A million places in the neighborhood have better food than this.", "author": "Nicholas D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Very cute decor and a really great brunch menu! Excellent customer service. I was pretty late for my reservation of 6 people and the owner held the table for us! \nDefinitely would recommend!", "author": "Kayla L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Went here for Easter brunch today and really had a great experience. When we first arrived we didn't have a reservation and were told they m have a table available in about 15 minutes. We waited the 15 minutes and were pleasantly surprised that a table was available for us. We had 3 of us in our group and we all decided to try something different. The burger had brisket in the middle of it and packed the burger with a lot of flavor. My sister loved the salad with pears and goat cheese as well as the Mac and cheese that she ordered. The Mac and cheese was really creamy and cheesy. We also tried the Hawaiian coffee which was a delicious treat. Our service was great and any questions that we had were easily answered by our server.   We didn't try the chicken and waffles but most of the tables around us had one person that had this menu item on their table so we definitely were intrigued.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "Pretty poor food and service, and pretty pricey. Better places available on Smith Street.", "author": "Cosimo M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "Came here with two of my girl friends tonight because one of them were craving fries and I remembered that they had decent shoestring fries.\n\nThe atmosphere here is very chill.  The music is loud and the tables are kind of close together, so my friends and I really had to project our voices.  As for the food, the dinner menu seems a bit limited in my opinion because I took a while deciding what I wanted.  I can definitely say  that the deviled eggs hit the spot, but my personally customized order of grilled chicken was just mediocre, especially since it was a tad bit pricey.  The chicken and waffles seem to be the highlight of this place, which I really enjoyed my first time around.  My friends both ordered burgers and they were overall happy with the order.\n\nOverall, this place is worth trying!  My waitress tonight was very accomodating and pleasant, which really improved the experience of dining here.", "author": "Wendy X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "Good beer selection.\nThe bartender poured a nice flight.\n\n- Abita, Purple Haze\n- Zero Gravity, Little Wolf\n- Platform, Life Itself Sour\n- Founders, Breakfast Stout\n\nAmazing flavor beer. bartender gets 5 stars. Decent food, but could be better.", "author": "Jason D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "I would give this place zero stars I just left there and sat at the bar and got completely ignored.  There were literally 3 people there.  I walked right out I didn't give them a penny of my money.  Two bartenders and no acknowledgement. No wonder it was empty. Avoid at all cost!!!!", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-13", "description": "I'd bet my review earns one more star if I went back this winter / fall for brunch or lunch. Had read a lot of good things about Uglyduckling via Yelp, so had to go check it out. I think we dropped in on a Friday or Saturday night around 8 and while it was crowded, we got a seat right away. As soon as we walked in, we were greeted by a big breeze of very hot and humid air (in the middle of the summer) - we were hoping to fight the heat, not stay in it. We almost walked out, but stayed. The beer list is pretty extensive, but for whatever reason, they were out of a lot that night. I was craving a burger, so I opted for the Ugly Burger. It was very average (not a lot of taste honestly), as were the fries. By the time we left we were sweating. I would definitely go back and try other things though. (note: we did go back after that time on another night, and it was still abnormally hot in there, so we left, so it wasn't a one time thing)", "author": "Ali C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "So good! Great atmosphere, great location, staff was warm and friendly, did I mention the food was incredible? Cause it was. All of it. From the salmon tartar to the salad to the burgers, all amazing. Can't wait to go back!", "author": "Paula S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "My best friend and I was in the area and decided to try this place. From start to finish, the service and food was on point. We both ordered the special which was the Braised short rib with mushrooms and creamy potatoes and a side order of Mac n cheese.  After all that good eating we still made room for dessert which I'm glad we did not skip it. The cookie dough baked in a skillet with vanilla ice cream was amazingly delicious. The Chef Pablo served us the whole night and even split our cookie dessert for us. I will definitely make my way to this place again!!!", "author": "Nadia F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-28", "description": "Food is not as good as the menu sounds. It should be great, but it's slow, cold, and not worth the subpar experience. The ambience too is lacking - cold, too bright, and with too many TVs. No wonder it's usually empty.", "author": "Renee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Molly and Jason are so warm and wonderful to  be around. Great conversation at the bar. Definitely will brighten up your day. I spent way more money, because I was having so much fun. Only problem with Jason, is that he doesn't know anything about sports. Please help him in that area lol\n\nThe hanger steak medium well with a glass of valpolicella was amazing as well. Delicious. Pear salad w/ salmon or chicken is also a go to for me after my workouts.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-16", "description": "Food was enjoyable but lacking a little something (rate 3.5 stars). If I was to recommend something it would be to stop serving the baguette that as been toasted/dried out to the point tasted stale with your dishes. Mussels with fresh bread or fries and cheese plate with fresh bread or crackers. TVs made this place feel more like a sports bar but the service was great. Enjoyed our night here", "author": "Nathalie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "My friends and I came over from Queens for chicken and waffle. Parking in the area is nearly impossible, at least on a Friday afternoon. We got there soon after it opened so there weren't many people there and plenty of seating. We ordered the chicken and waffles and the pulled pork sandwich. The chicken was so good! It was a pretty big piece of chicken and it was super juicy. I'd go back for just the fried chicken. The waffle itself was pretty good. Nothing too special. I liked that the syrup wasn't too sweet. The pulled pork sandwich was also pretty good. In general I liked the food but the prices were on the higher end. I would definitely come back if I were in the area but I wouldn't go out of my way for it again.\n\nWhen I went there was a $5 happy hour going on. I believe it included sangria, beer and something else. The place itself is pretty cute. I definitely liked the atmosphere. There are also 2 bathrooms!", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Great bar. Laid back atmosphere and knowledgeable bartenders. Definitely a good place for friends and family.  Highly recommend.", "author": "Drew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "Fruit beer ? It was my first time ever having it but after one sip I changed from liking beer to loving beer ! They have a really good variety and their food menu is pretty tasty as well . I had the skirt steak and he had the chicken and waffle - not the best but definitely not the worst . My waitress was very sweet and the bartender will talk you til the store closes - awesome !", "author": "Anessa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "My boyfriend and I came for brunch. The staff was very welcoming and friendly from the time we walked in. It's small restaurant but has a good atmosphere. The food came out very quick. I got the 10 oz Stuff Brisket Burger. It was so good and juicy. The Rosemary French Fries that came with it were really good as well. My boyfriend got the Shrimp and grits, which he really enjoyed. I would definitely come back!", "author": "Ashle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-22", "description": "They had very few options on their lunch menu to begin with. My friend got the salmon, and I got a burger. We BOTH got food poisoning shortly after. And to top things off, the food didn't even taste good. Have these people never heard of seasoning?", "author": "Ashley O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Not even worth talking about! Started off with no service and didn't bother to stay for the food.", "author": "Mahlet M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "I live in the neighborhood and used to love this place and came here often. Not anymore. They changed it from more of a beer bar and it's really gone downhill. Came here to brunch and all the breakfast items are around $22 - on the pricey side imo. On top of that all the egg dishes but one have pork so it's difficult if you don't eat pork. On top of a $22 egg sandwich they also don't do substitutes for the Pork bacon. Won't be coming back.", "author": "Emilee H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}