{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "The service was spectacular and the food was delicious. Came here for brunch with some friends and 2 kiddies. The staff was really friendly and attentive. I ate the Chicken 'N Waffles which were amazing. The chicken was flavorful and the waffles were wonderfully fluffy. The Hubs had the Shrimp 'N Grits. He said we was a little hungry after but still enjoyed it. We got the Mac 'N Cheese and Parmesan Rosemary Fries for the kids and they seem to enjoy as well. I would definitely return!", "author": "Channelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-20", "description": "I dined at The Ugly Duckling on a Sunday for brunch. I had the Cajun shrimp and grits with a poached egg. I also had the Red Sangria. My dish tasted great but the service (or maybe that particular server) wasn't attentive at all. Overall I enjoyed my food and drink.", "author": "Catherine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Good food and good service! I liked they have good selection of beers. Also warm and nice atmosphere.  Try the breakfast sandwich, it's like fried chicken in a waffle sandwich. Super delicious!", "author": "Yejin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "I was very satisfied with brunch here. Despite the limited vegetarian options, the deviled eggs (minus bacon crumbles) and the bread basket (pastries from bien chit down the street) made me super happy. The deviled eggs were perfectly tangy with arugula. The pastries were all amazing of course. It was a strange perfect meal. I heard the tacos were amazing, and the chicken waffles was so-so.", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I came to here after reading reviews on yelp about it. I wanted to go somewhere close by where I live. I came here on Saturday for brunch. We were greeted once we entered and got seated immediately. My boyfriend was looking at the beer list and one of the host noticed it. He came over and asked him what he prefers and made recommendation. He also gave him a free tasting without asking which is great. The atmosphere here made you feel cozy, relax and homey. As for the food, we got the chicken and waffle, stuffed French toast and a side of pepper bacon. I absolutely love the chicken n waffle. The chicken was so crispy outside and juicy inside. The French toast was crispy outside and savory. The pepper bacon was crispy and juicy. Overall, I would come back here.", "author": "Cristina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Love this place. Their happy hour special sangria is sweet and refreshing for only $5. Can't get better than that! Food: mac and cheese - creamy, cheese and gooey. Shoe string fries are too die for, a combination of potatoes and sweet potatoes cut finely and fry to perfection, can't get enough of them.... sooo goood!\nYou can skip the nachos. They were meh, bland and nothing out of the ordinary. I can't wait to go back and try their chicken wings, they surely good yummy!", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "The ONLY reason we dined here was to satisfy a craving for chicken and waffles. Unfortunately, it was overpriced at $20 and not up to par. As soon as I saw the dish, I raised my eyebrow while in a state of confusion. Why was my fried chicken presented as if it were whiting? The flavor was basic, nothing spectacular. Our server was a pro, always anticipating our needs without us ever uttering a word. The ambiance was very relaxed on a Friday night and great late hours too.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Came here on a chilly night after a comedy show.  It was warm and toasty inside.  Staff was extremely friendly from start to finish. Ipa and whiskey shot special was a great idea.  Taco duo was delicious.  I would definitely come back here next time I'm in brooklyn.", "author": "Dana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "came on a tuesday afternoon. liked that it was quiet. took some time to order cuz there was only the bartender but food came out quickly after the order went in. fried chicken was juicy n crispy. I prefer dark meat but I always give props when they can make white meat tender n juicy. not a great fan of their chipotle aioli. my partner had duck tacos that could've used a sauce or a dip. it was a bit dry. gave an extra star for service. and I had their house rose which was light n refreshing, good for a rose (check in offer) but i looked at their drink menu and they've got a good selection going. $3 tacos aftr 5pm on tues. half price bottles on weds. live music on thurs. see you again soon.", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "Went to try this place out last night with some work mates after a conference we were all attending together. Found it in yelp and it was even better than anticipated. The calamari was light and not drenched in grease - which was excellent. I had the pork loin and took the owners suggestions of sides. The black pudding was delicious, brussel sprouts cooked perfectly, and the caramelized onions done to perfection. Everyone's meal was great and we were all impressed. Talked to the owner a bit since it was a slow Monday night and he was a delight. Great place to get some food and drink I highly recommend it if you enjoy food and are not just looking for the same old boring dining experience. Don't just order the chicken and waffles, branch out and get out of your comfort zone. One of my coworkers did that and was really impressed with the duck confit. I tried a bite and it was cooked perfectly.", "author": "Lin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "We came here after a movie because of its yelp reviews. We ordered the shrimp and grits, stuffed French toast and the stuffed burger. The French toast was good but it was breaded and fried and the maple syrup was \"oily\" maybe from butter added? Shrimp and grits were good but the burger was off the charts - as were the fries- Jason talked me into ordering it med - I usually order my burger rare - but Jason was right - it was perfect!!!\nI'd order that again for sure!", "author": "Leah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "3.5 stars\n\nI really wanted to like this spot. Really nice interior, lots of beers on tap, and solid cocktails. \n\nThe problem lies not the speed of service and the food itself. Mac and cheese was not good. It's not really Mac and cheese. It's pretty unfortunate how few vegetarian options there are here. Maybe dinner is different, but this was the case for lunch. \n\nI'd give it another shot at dinner or brunch on a weekend.", "author": "Evan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "Food was great we had the salmon blt and the street tacos. Took about 15 mins to come out which was very fast ! The server we had only asked us what we wanted to drink once and once we said water and gave our order he never returned. We were going to order drinks after but wanted to eat first but chose not after that. The vibe was great and very chill now the food is a little expensive to be ready to spend if you come here in a group. Overall chill place i just felt like my waiter shouldve came around more then one time and i kinda felt rushed out the place even though it was empty. Isnt the owners fault or the foods fault so I will give it a four star.", "author": "Xavier V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-23", "description": "Poor Service, absurdly expensive, kids menu ONLY at brunch.\n\nThere is really  nothing good I can say about Ugly Duckling.  We ordered the \"special\" three flatbreads for $35, but they charged us for three flatbreads at the regular $13 a piece..twice! Moreover the flatbreads themselves were minimal, not nearly as interesting as their description. It took so long that we ended up leaving after the starters because after 50 minutes, no one had come by to ask if we wanted dinner.  I truly hope they were just having a bad night.", "author": "Maggie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Went on a Sunday for brunch. Service was fast and on point. I got the Chicken and waffles which were so delicious. Chicken was cooked perfectly ,and the cocktails were yummy. Would definitely come back here.", "author": "Roe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "It's a good spot that didn't fit the name food was good but I dunno if ima try it again", "author": "Shotah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-21", "description": "To be fair I didn't eat here, but the manger was very rude. We have a deal to get a free draft beer (from a previously purchased deal) and he would only allow us 2 options, when I made a point of saying the deal was valid for ANY draft he would not allow it despite no fine print. I asked if he would include another beer that was the same price and he was just rude and difficult to work with. Will never come back nor recommend it to anyone.", "author": "Claire L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "Very nice place, and I like it in first sight.The chicken and waffles were amazing.Good atmosphere, friendly stuff.Their egg white omelette is awesome.The salad and fruits are served fresh.Solid beer selection.The waiter and manager were really nice. I had  good experience,  I would definitely go again.", "author": "Mark R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Quick summary: good food, friendly staff, nice design, expensive.\n\nFriend and I got in around opening to avoid having to maze through a load of people. The waiter was super friendly and we got a good conversation going and we felt welcomed. The front area of the store was completely opened up since it was a nice day and it had a nice open  and warm atmosphere. \n\nWe ordered 3/4 flatbreads (all but the curry one I beleive). The mushroom and the shortrib flatbreads were AMAZING. I would go back just for that. We also ordered the chicken and waffels and shrimp and grits. Both equally amazing. \n\nDrinks were on the pricy side but a norm for the area. Not the largest selection. Ours were on the stronger side. Defintely ask the waiter for reccs if you're concerned about that. \n\nOverall, I would come back and the food was worth the money.", "author": "Liza R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "I came here late Friday evening and I must say the food, the drinks, atmosphere, the staff,was great... Alex super chill and funny, Jason the bartender was awesome our drinks were on point...definitely will be back.", "author": "Samantha H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}