{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Excellent food and chill atmosphere. Great find if you're in the area! Open and relaxed environment...even during the day! Breakfast also available during weekdays.", "author": "Kandice A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "After my original visit, which was marked by a very off night from the serving staff, I was contacted by the owner (Dennis) who wanted to apologize and even offered me complimentary free food and drinks. I look forward to going back and must say it was quite a classy move! \n\nIt goes to show that even the best of places sometimes can have off nights.", "author": "Jake L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "The food was just okay in my opinion, but I do like the name of this place.\nMaybe it's supposed to be a hidden message, like \"our food is ugly, but it's beautiful inside.\" Idk lol. \n\nAnyways we came here around 1p.m for Sunday brunch and got seated within 10 mins! Not bad considering it was Sunday lol. We ordered 2 of the deviled eggs, a waffle chicken sandwich, pulled pork Benedict, tacos, and a burger. \n\nThe deviled eggs were very unsatisfying. I'm usually the one that picks up the 2nd deviled egg wanting more, but after one of these I wasn't craving for another one. \n\nThe waffle chicken sandwich wasn't bad, the chicken was a little spicy but it gave that nice kick and they put pepper bacon inside. The fries were delicious though! But fries are always good lol. \n\nMy bf was meh about his pulled pork Benedict. He said nothing special stood out to him about his food which is surprising since it looked like there was so much flavor in it. \n\nThe waiter was nice though, and even if the food wasn't as good at least the service was!", "author": "Grace K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "This place deserves 2.5 stars but first let me start off with their poor service. We barely saw our waiter and they could barely fill our glasses with water. My boyfriend and I ordered the salmon tartar and steak. The salmon was so poorly under seasoned. I don't know what type of sauce was on it but it did not do it justice AT ALL. As for our steaks, they were cooked perfect (medium-rare) but that's about all they did that was good. Everything else was lacking flavor, I don't understand where these great reviews are from because I did not receive that same service. The prices are absolutely ridiculous for what you get. It is not worth it, save your money for places that are way cheaper and actually know how to season food properly.", "author": "Nicole R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "Food is good, customer service is amazing and impeccable decor. I think this place deserves more credit than what it's given. I enjoyed my time here and will be back again", "author": "Kevon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "Ordered two small sides to pick on while we were watching some football. One was awful, the other, fries, was ok. Beers were good...draft beers, cold and fresh. Ordered one cocktail, Beer Spritz, was terrible, sent it back, ordered something else, but the send-back-cocktail was still on the bill. Bad business. 2 beers, 2 cocktails, 2 seltzer, fries, and brussel sprouts...74$ plus tip. Not worth it. Not going back. Staff was real nice though, but that is about it...that is where they earned a star.  So many other places on Smith Street that are well worth it. Pass on this one.", "author": "J D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-21", "description": "I came in for a tasty beverage as I love the cocktails here and the lovely staff but I was overcome with sadness when I overheard the staff saying that they will be taking off the chicken and waffles from their menu?!? WHAT?!?  This is where I come for this!! Now where am I going to go for brunch? Going to have to find a new place. Unfortunate.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Had a great time. Candace was our waitress and was wonderful. The service was A+. Aubrey also was wonderful. We will be returning on Wednesday 10/24/2018 and we would love for them to be there. The food was wonderful and very filling and the portions are huge.", "author": "Deborah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Absolutely awesome! Candace was the best, attentive, personality was fun...Aubrey was fabulous as well. Food was FANTASTIC..thanks to the chef...great food, great friends, great service...what a night!! thank you all.", "author": "Grammy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Gloriously amazing dishes for brunch! We came by here for brunch at about 3pm (still serving). We got sat down quickly and was treated nicely. I ordered the pull pork benedict which I have been craving for a while. My first time here btw. The pull pork benedict was delicious in every way. The pork wasn't overly salty as the way i like it ans it was soft ans chewy. My husband ordered the burger which was extremely juicy and flavorable. Nice fries and their sauce compliment well with the food. Definitly coming back for more to try and highly recommended.  \nAtmosphere was relaxing, chilling, and comfortable.", "author": "Sherra L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "I hesitated to order the shrimp and grits as I find it is hard to come by good shrimp and grits. It was quite tasty and exceeded my expectations.", "author": "Chini N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "3 stars for service only. Was walking around the area with a friend and settled on this place for food around 2:30pm due to reviews and pictures on yelp. Was quickly seated and given the menu. Not sure if it was due to the time I got there but the menu was limited and didn't look that promising. I got the chicken and waffles while my friend got the salmon BLT. The chicken was NOT crispy and really dry. The waffle was sort of soggy in the middle but crispy on the ends? Not cool since I was hungry. My friend's salmon blt didn't seem to taste any better. Over all the food was disappointing but the waiter was nice. Would not consider revisiting based on the food I received from them. I do believe in off days with food so can someone recommend me a good time to revisit?", "author": "Jane N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Obsessed with the burger here! My friend had the calamari and she loved it as well. Great spot, the doors open up when it's warm giving you a little bit of a nyc rooftop feel. I saw the chicken and waffles on the brunch menu .. can't wait to try! \nA very nice craft beer and cocktail menu... This spot is exactly what Cobble Hill needed!!", "author": "Regina D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "Great group experience! Food was great. Staff helped us take pictures. Nice atmosphere and good for parties of 10 or less.", "author": "Mary Ann D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "This sweltering Tuesday got much better once I had a margarita ($6 on Taco Tuesday) and the fish and chips at Uglyduckling! The fish is flounder, and hits the perfect ratio of fried satisfaction without being too heavy. Casual vibe with good music, and a nice bar that didn't feel awkward to eat and drink at. I'll definitely be returning here!", "author": "Alison A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "Poor service. I arrived with my fiancé and future mother and law on a Saturday just before 7:30pm. When we walked in we were surprised by the lack of diversity-but fine. The restaurant was relatively full but the two tables right in front were empty. The server (he was the person in the front) says there is about a 45 min wait. \"Ok what about these two tables?\" \"They are reserved for reservations\". Ok we discuss our options for a moment. I ask \"what time is the reservation for?\" As two couples walk by us to leave the restaurant after finishing their food. \"8:45pm\" We all look at the time-and watch the now 4 empty tables being cleaned. We left and ate somewhere else! Treat all customers right and you won't get poor reviews, seems like there are a few of them.", "author": "Tahira C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Had dinner here with 2 friends on a Saturday evening, the restaurant was busy, but we were led to a table right away. The atmosphere is cozy- perfect for a winter evening.\nCocktails were very good - I had something of their house menu with \"dangerously\" in the title which had just enough spice. I had the shrimp and grits which was flavorful and came out piping hot- somehow it wasn't overly heavy like grits can be.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Food is delicious here. Had the flatbread, brisket burger, and chicken and waffles. It's a cute spot, too. Would def come back!", "author": "Maddy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Luckily, we easily found a parking spot near the restaurant. We arrived on a Sunday around 2pm and didn't have to wait for a table. Service was exceptional from the moment we walked in to the moment we left. From the brunch menu, we ordered the fried chicken and waffles, as well as the shrimp and grits; we also ordered deviled eggs and shoestring fries. For drinks, my boyfriend had a Mimosa and I had a Sangria. My Sangria was perfect - not too strong, not too weak, not too acidic, not too sweet. \n\nMy boyfriend really enjoyed his deviled eggs. The shoestring fries were crispy and packed with flavor - garlic and herbs. I've yet to try better fries than at Balthazar, but these, although different, take the #2 spot for me. \n\nThe fried chicken was incredibly moist (ugh I hate that word... but ... the chicken was... moist). It was well-seasoned from the first bite to the last. I wouldn't compare it to the fried chicken I had in Memphis, but I've never had better fried chicken in NYC. Same thing for the shrimp and grits. The shrimp was perfectly cooked and well-seasoned. For a shrimp and grits dish, it was surprisingly light (in a good way). Whenever I'm the mood for either dish, this is the spot I'm going to. \n\nOverall, we were impressed and will definitely be back.", "author": "Ilona K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "Came here with my family for early dinner. Our waiters name was Kaitlyn who was very nice and personable. We order kids sliders which my kids really liked while me and my husband got the Flatiron steak and Taco Duo. My steak was good but I learned the Taco Duo was more my thing. My family and I are new to Brooklyn so we are happy to have found a spot we can bring the kids and get a tasty meal.", "author": "Katie M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}