{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "The Good.\n\n-The fried chicken and waffles. I was initially concerned when our server came out to confess that they'd only be using chicken breast that evening, but the flavor was excellent. Perhaps it was more like chicken fingers and waffles, but I loved the remoulade that came with it, and the chicken was well seasoned, and the meat tender and moist. \n\n-The chorizo-stuffed mushrooms. Nothing too crazy, but a solid appetizer, well-executed.\n\n-The Stevens Point Nude Beach wheat beer I had. Never seen it on tap anywhere, had to order it,* thoroughly enjoyed it. \n\n-The beer selection. With around 30 taps and plenty more in cans, you should be able to find something you like.\n\nThe Bad.\n\n-The beer list. It's very oddly organized. Some of the beers are listed only by the brewery: Which Sam? Which Abita? Which Captain Lawrence? And some are only listed by the name of the brew (i.e. Sweet Action). There are also no prices; I was told, \"Most of them are $7, but some aren't.\" This is easily fixed, but it should be fixed. \n\n-The pricing. Again, it's a bit strange. The chicken and waffles are quite affordable (I think it was $17), but the Uglyduckling salad was $14. Don't get me wrong, it was a nice salad, but it's priced like a main when it's not substantial in the least. Throw some meat, cheese, nuts in there and we can talk.\n\nThe Ugly.\n\n-The fact that these minor hiccups make me want to talk about what a beautiful swan I hope Uglyduckling turns out to be. \n\n(Please don't punch me in the face.)\n______________\n\n*Perhaps because I recently spent time on my first nude beach. At least I think it was a nude beach...if not, that man LIED TO ME.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "I've wanted to check out Uglyduckling ever since it opened, and finally had a chance to. It's hard to stand out on Smith Street due to all the other restaurants, but Uglyduckling has done a good job. The space is part of the old MTA building that's now next to Lululemon, so it has super high ceilings, and painted brick walls. Looks great. They also have 30 beers on tap (nothing too crazy, but some good local crafts).\n\nTheir menu is also pretty extensive. Whether you want to eat by land or by sea, they have several options. Don't be fooled by the name though; they actually have several vegetarian options that sounded great. But of course, that's not why we came here.\n\nThe Ugly poutine (provolone, duck confit and sweet BBQ) was solid. Not your typical poutine, to say the least. The BBQ sauce goes well with the duck, but don't expect something reminiscent of Canada. The fries were bit soggy, likely due to the deep bowl they were served in, but still good.\n\nMy friend and I both got Uglyduckling burgers. Sadly, they've changed their menu a bit (either permanently or for the week I was there). Their website still lists their namesake burger has having a fried quail egg and pork belly. The one that was available when I went (first week of September) instead included fried cheese (I forgot what kind) and grilled onions on top. Not quite as adventurous, but it was still a damn fine burger. The breading on the fried cheese (I forget what kind it was) added some nice texture (kind of like when you get the Shake Shack burger with a fried mushroom on top). I got mine medium rare, and it was cooked perfectly. They offer three condiments (ketchup, mustard and mayo) and the burger tasted great with any of the three.\n\nSince we ordered the poutine, we didn't want to overdo it with the fries, and they allowed us to make a substitution for any of the other sides, without additional charge. My buddy did the grilled veggies (squash, cucumbers, and possibly other gourds). I did the sweet potato hash, served with kale. Delicious, but totally defeated the purpose of not getting fries. Definitely worth it. Only complaint was that the sides were a bit oily, so it made the veggies seem a lot less healthy.\n\nService was great. Our waitress made some great beer recommendations (and gave us samples in fancy glasses). Also, I left a bag on the ledge behind our table, and when I came back looking for it two hours later, our waitress popped out of nowhere and handed it to me. Can't beat that!\n\nAll in all, Uglyduckling is a welcome addition to the neighborhood, and I'll definitely be back. Hope to try the duck confit sandwich for lunch.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "Went here after work\n Drinks and Thai wings at the bar were great. It was even better that it was happy hour. After having drinks at the bar we decided to have dinner. I had the chicken and waffles which I enjoyed - separately. My boyfriend really enjoyed the burger. Would recommend- no question!", "author": "Linda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "I was sad to hear that the Mac and cheese with lobster was no longer on the menu, sigh. I had the ugly duckling sandwich which is really chicken and waffles with bacon and fried poached egg. I guess I arrived on a good day because the food was delicious. And soo filling. The fried were tasty and my sandwich was good. My fried had the chicken and waffles and she enjoyed it. My dish did not come with syrup but that chipotle mayo sauce. I was not a fan of it. I used some of my friends syrup and completed my meal. I would come back here to try something else on their menu, probably for dinner next time around. \n\nThe service from the waiter was good.", "author": "Jenn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Uglyduckling is the newest addition to the many adorable shops and eateries along Smith St. This street is a favorite of mine -- so naturally when searching for a nice place to grab a drink/grub after a crazy week at work, my friend and I wandered into Cobble Hill. \n\nOnly 2 weeks old, the Uglyduckling offers a diverse selection of American /Gastropub cuisine as well as a nice wall of craft beers on tap. It has a cool, hip vibe with the mismatch wooden panels on the wall, giant tv screens, vintage lighting and chalkboard artwork to name a few. There's not a whole lot of seating but for the size of the place, they definitely utilize what space they have. We decided on sitting at the bar for dinner... and much to my surprise, they have bag hooks! Ladies (or gentlemen) your wishes have been granted. But in all seriousness, its a small but important perk.\n\nI thought to myself, \"what to choose, what to choose\" when glancing at the beers along the wall. And then my eyes fell upon the Left Handed Brewing Co. NITRO MILK STOUT. I've been searching for this beer for the LONGEST time. So glad it's at a bar nearby! And might I mentioned it was perfectly poured and delicious. As for the menu, very interesting items. I ended up choosing the Chicken and Waffles ($16). I was intrigued at the combination of the classic dish but with a side of spicy aioli. The buttermilk waffle was fluffy and equally crispy as the corn-flake crusted chicken. The spicy aioli was a nice touch, although I'm not sure if everyone would like that combination of flavors. But all in all, my dish was great. I would definitely order it again.\n\nNot only was the food tasty, but the staff was personable and welcoming. Most of the staff are from Ireland so I immediately struck up a few conversations about my good ol' days studying abroad in Limerick. Made for some great banter. Next time... my eyes are on the Pork Belly \u0026 Quail Egg Burger. Wishing the staff of Uglyduckling the best of luck! I'll be visiting again very soon.\n\nP.S. They're creating a brunch menu and a happy hour which should be finalized within a week or so. So keep your eyes peeled.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Uglyduckling, you're the one, who makes bath time, lots of fun!\n\nHmm, maybe I should re-think that and replace \"bath time\" with \"meal time\". That would make more sense.  Let's go with that.\n\nUglyduckling will make your meal time fun.  I went with friends and sampled the duck poutine, the uglyduckling burger and the loaded fingerlings.  Everything was excellent.  I really liked the duck poutine and even my buddy who had never previously had duck nor poutine was a fan.\n\nWe sat at the bar and received prompt, efficient and knowledgeable service.  The beer menu was interesting but I agree with those who say you won't see any rare finds on the menu.\n\nI'd definitely go back, for bath time or anytime!", "author": "Bill T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-25", "description": "We got at the place at 7:30pm and we order starters, after 40 minutes the waitress came and said something happened with the order and theee is no appetizers. It is a shame that the service is terrible!", "author": "Marie Nadine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Amazing staff, delicious food and overall a great atmosphere. They have a great selection of beer on tap. It's a great neighborhood bar and they didn't disappoint.", "author": "Kateryna P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "Went here for brunch and was extremely disappointed. Not at all accommodating, would not make an omelet without mushrooms or take mushrooms out of any dish on the breakfast menu. Ended up ordering avocado toast, which they told me they wouldn't add an egg to even though it's listed as an available extra on the menu. I guess the kitchen was overwhelmed with egg dishes... yah, it's brunch. When it came the dish was basically two pieces of wonder bread with a slice of avocado on top. When bill came they charged me extra for the non-existent egg. Super overpriced in general for what this place is. Won't be going back.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "Uglyduckling has got some of the best brunch we've ever had.  This is a great and popular spot on Smith that we've been wanting to try for some time.  \n\nWe were happy to be able to get a table with minimal wait so we went right to ordering the Ugly duck eggs with pulled pork and chicken \u0026 waffles.  Definitely two of the more popular dishes as we saw a lot of people ordering the same things.  Only issue we had was how long it took them to get us the menus after being seated.  We waited almost 10 minutes just to get some water so I got up myself to get the menu, and that's when they came over.  It didn't seem so busy that they couldn't bring over the menu as the patrons are being seated, but it turned out they had a limited amount of  copies so we had to wait for the menu.  \n\nAnyway, after finally getting the menu and putting in our orders, we also had some coffee while waited and admired the intimate decor of the place.  There is a surprising amount of beers of tap so the bar was a popular spot as well.  We didn't have any beers this day.  \n\nAfter a decent wait time, our meals came out.  The chicken and waffles plate was huge!  The chicken was nicely seasoned and fried without it being greasy or messy.  Even while sitting on top of the waffles, there was no oil that dripped down to make the waffles soggy, this was very nice.  It was served with a boat of gravy on the side so you dip and drown as you wish.  \n\nThe other plate was the smoked ugly with pulled pork. This is basically an eggs Benedict with pulled pork instead of ham.  We were also very happy with this dish.  The pulled pork was on top of toasted English muffins and topped with two poached eggs and hollandaise sauce.  The whole thing tied together so well with just the right flavors and meat quantity.  The pulled pork was a little sweet, and not in a bad way, mixed with hollandaise and runny egg was amazing.  The plate was presented with a small salad and some home fries to ensure nobody leaves hungry.  Everything about it tasted wonderful! \n\nUglyduckling is worth a visit for any meal of the day, not just for brunch!  We loved it here and will gladly return in the future.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Stumbled upon this little spot with a friend for brunch ! Thought it was great ! Service was good, food is good. I had the ugly duckling eggs benedict and my friend had the chicken and waffles. Never understood the name of the place though... I'm not sure if ugly duckling was a metaphor... but I just assumed I'll be having some duck ! That was the first thing that came to mind and got me craving for duck! 1 star down for such a tease! But, I would definitely come back again to try other selections. I'll forgive ya. If i get a free drink the next time I come by! or extra sauce! jk..sort of.", "author": "Johnny Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "This restaurant boasts it's brunch menu which has Chicken and Waffles as their star. A trip to the bathroom you can see 3 after 3 after 3 consecutive of this dish waiting. \nNow Sweet Chick also have this thing going but unlike that hack of a restaurant, Uglyduckling serves the whole cuts of chicken while not looking like a unkept dive bar. Service is great. Their egg white omelette is awesome. My only complaint is their chicken is a bit dry.", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-08", "description": "Meh. I don't know how long this place will last. Burgers are thoroughly medicore, served on a dry buh and completely overpriced. The tap beer and cider tasted vaguely of chemicals.  The muscles we ordered as an appetizer came with six completely unopened. Yup, they served us 6 dead muscles.  Who is paying attention in that kitchen?\nOverall I was thoroughly disappointed. \nThere are so many better places on Smith Street. If you are going to do simple pub food and charge artisanal prices it had better be worth it. Nope. Not this place. \nAlso, had to ask multiple times to have our water refilled. \n\nWomp womp.", "author": "Jaybird N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "My co-workers and I went to uglyduckling for a holiday happy hour, and it was fantastic! The bar was decked out in beautiful Christmas decorations, playing Christmas music and overall had a very cozy feel. Not only were the happy hour drink prices so reasonable, their food was incredible! All 8 of us ordered dinner and everyone loved their food (the french fries are out of this world). Highly recommend the Salmon BLT. Our server was very attentive and helpful. And let us stay for over three hours! Looking forward to my next visit!", "author": "Charlotte B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "Charming new restaurant in Cobble Hill! Great ambiance and decor - I love the wooden planks on the walls and the amazing craft beer selection. \n\nWe shared the pork belly and sweet corn fritters as well as the ugly poutine to start. The ugly poutine was amazing! Juicy pieces of shredded duck confit, brown gravy and cheese melted over fries. Not exactly poutine since it just had regular cheese, not cheese curds, but I liked their take on it. The fritters were mediocre - they were pretty dry, especially the pork belly inside it. I think pork belly should always be juicy from all the natural fats, but this dish really didn't do it justice. The fritters came with a tiny smear of some kind of sauce (which looked a bit questionable - a bright yellow sauce that somewhat resembled congealed chicken fat) but if it had more sauce it might have helped the dish.\n\nFor mains, we ordered the chicken and waffles and the ugly duckling burger. The chicken and waffles were pretty good - the chicken was cooked nicely so it stayed moist inside, and the waffle was pretty good too. The burger had nice big strips of bacon inside but it was really strange that it had absolutely no sauce in there, no mayo or anything. That, coupled with the fact that my burger was actually well-done instead of the medium I asked for, made the burger extremely dry. I had to ask for some garlic aioli to just add SOMETHING to make it easier to eat. \n\nOverall, a great addition to the neighborhood, but as a new restaurant they still have a few kinks to work out.", "author": "Tiffany F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Amazing amazing brunch!! \n\nCame on a Saturday about 1pm and not a huge wait! Which was great, because our original place was at least a 40 minute wait. Love their brunch cocktails $4 draft and $8 cocktails! \nI ordered he frenchtoast! Came with two pieces of French toast with bananas and cheese inside! The bread was crunchy! And came with a side of fruit! \n\nWe also ordered the famous chicken and waffles! The only complaint is the waffle wasn't crispy enough, or warm enough! The chicken was good! Not dry at all! Fried and enough to share with two people! \n\nThe breakfast chicken waffle sandwich was not bad as well! Waffle as the bread between the pieces was fried chicken, egg and bacon! Can't ask for more in a waffle sandwich! \n\nString potato fries a must as well! Combination of potatoes and sweet potato string fries! Must order! Amazing find on this place!", "author": "Sandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "Walking on Smith st in the rain, I Yelped for some grub and saw Uglyduckling with 4*'s and quickly crossed the street. First impression, maybe my concept of 'gastropub' is totally off. I wasnt expecting it to be spacious and restuarant-y. But as that rain turned to snow, and we was hungry-bordering-hangry, : there's tv's, it's March madness they have food. It's cool. \nA couple of things make this review 3stars and I'm kinda leaning toward 2 and a half. \nThe restaurant itself must be very new. The staff must be first job kinda people, but I can't really be sure only bc the millenial feel of the whole neighborhood just might be the entitled problem. \nBut I digress, I ordered the Braised short Rib tacos and I do admit they were tasty. Presentation needs a bit of oomph. 3 soft tacos on a plate with some kimchi looking onion. Meh. \nMy plus 1 ordered the chicken and waffles sandwich with came with these shoestring fries that were a nice texture, hopefully they were house made but I didn't see anywhere that was stated so, assume frozen. \nSandwich sounded so good on the menu. The chicken itself, should it be a little spicier? There was a pink spot in the piece I had and there were spots on it that seemed like fatty bites. The waffle got soggy on the bottom half. The bacon was good and peppery. We both say, this place is just ok. I only ordered 1 drink and although it was a nice mix of tart and sweet, I didn't taste a lick of alcohol.", "author": "AnnMarie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Tracey was fantastic she was very knowledgeable about all the house beers and what they were serving for happy hour as well as understanding what I wanted to eat as far as an entrée versus a small plate. The presentation of a small plate was great the food was juicy and full of flavor I recommend this place to a lot of new to the area people", "author": "Ell M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-09", "description": "Beware of the overinflated Yelp reviews! Came here for brunch and was a disappointing experience from start to finish. Should have known something was up when I stepped off a bustling Smith St and into a dead cafe with music blaring just enough decibels to be annoying. \n\nFood: they didn't prepare the French toast yet (which is strange an hour after opening) so had to order something else but ordered the Benedict dish, chicken and waffles and the burger instead. \nThe only bright spot was the chicken and waffles - average at best but when compared to their bland, soulless excuse for a burger and the cobbled together Benedict it becomes sublime. \n\nService: Sloppy and lazy. I'd understand if the joint was packed but the place was empty and our waitress couldn't have seemed more apathetic (or hungover). Zero refills offered for water or coffee. \nTo top it all off was overcharged an extra dish - for the French toast that \"couldn't be prepped in time\"\n\nAtmosphere: came for brunch but feel like this place would be a much better bar. Great selection of beers if only the wait staff made the place feel more inviting. \n\nSmith St is a bustling and competitive street especially for eats with this high of a price point. Skip this place for brunch and go literally anywhere else. You, your wallet, and your taste buds will thank me later.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "No, Uglyduckling doesn't have 1 duck dish on its menu- but that's ok. My friend and I came here for early Tuesday dinner specifically to eat chicken and waffles. The powdered sugar-sprinkled waffle was doughy and the fried chicken was crispy and hearty. This felt like a traditional no-frills c\u0026w meal except for the spicy aioli. I totally get many c\u0026w dishes come with a splash of heat. Don't get me wrong I embrace spicy flavors but in this case, if mixing sweet with savory is the name of the game, I'd much rather drench my plate with maple syrup than a creamy spicy mayo-based sauce more applicable for frites.\n\nOn weekdays, Uglyduckling opens at 4pm- instead of embarrassing yourself and trying to open a locked door like we did at 3:58, check if the foliage has been placed outside the entrance once you arrive. We were delightfully surprised by the free three-beer sample on Tuesdays of which they have ~30 varieties on draught to choose from. The waitress was very nice!", "author": "Jerry Y."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}