{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Was treated to brunch by my sister yesterday at this lovely establishment.  I had the Shrimp \u0026 Grits and the Roasted Pear and Goat Cheese Salad, my sister had the Pimento Cheeseburger.  Absolutely delicious, we were both very pleased with the food and service provided by Peter and Andrew.  Can't wait to go back!!!!  Prices are very reasonable as well.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Went there for brunch today. All of the servers were super nice and the food was delicious. Definitely a place worth visiting again soon.", "author": "Raisa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-22", "description": "A shame such a good restaurant has gone so downhill. We used to love Uglyduckling and would go all the time -- a perfect neighborhood place for some interesting burgers, great beer selection, at a reasonable price. Unfortunately, after the most recent overhaul(new management or owner maybe?) all three of those things are no longer the case: the menu has changed, and gone are the various burgers; the 30 beers on tap was slashed in half, and they don't do beer flights anymore; and the price of everything went up $3-$5 (The $14 burger is now $18 I think?).  And service on a Friday night (not even half full) was atrocious: we didn't get a single water refill until after we got our entrees, even after asking twice, and when we tried to pay, no one would pick up the credit cards so after waiting, we finally just dropped cash.  Such a shame. Avoid.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-18", "description": "Been here twice already and was thinking about going again last weekend. Love this place. Great dry rub wings and sweet/reg fries here. Good draft list and chill hip hop music most of the times I was there. Nice clean bar area and open air storefront during the summer.", "author": "Calvin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Extremely nice staff and I love the atmosphere! Food is great and best of all was the chicken pot pie soup", "author": "Joanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Excellent pub experience with great tap list,  good wines and superior pub food.  Watched the ballgame on one of the multiple screens without the need to turn out the buzz or the overwhelming loud music.  Everything in balance.  Will take the First train from the city back to this spot to grab a game,  a brew and some grub.", "author": "Barry C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-16", "description": "Came here for a brunch day with my GF the decor was nice. We ordered the chicken and waffles and a Benedict. I must say the chicken and waffles was pretty delicious on par with Buttermilk Chanel and the Benedict was mediocre. Overall it is a typical American brunch place that is neither amazing nor dissappointing.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Solid restaurant here!  Food is so good and the staff is so nice.  The chicken and waffle dish is perfect.  Not too greasy.  Also very kid friendly.", "author": "NYC T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Great place, great food, great drinks!!!! Must come here whenever in Brooklyn  French 75. Get it. Love it!", "author": "Nikki L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "I went here last night for dinner. Pretty quiet in there and was greeted by an extremely dry waitress. Not that I expect a waiter to be this bubbly, hyper person, but she was like REALLY DRY, and seemed like she just didn't care. Meh, whatever I am here for the food. I ordered the Mac and Cheese and my girlfriend got the chicken and waffles. Food came out super quickly which was nice because we were starving. The mac and cheese was ok. No bread crumbs on top, no flavor, just lots of cheese. Once I added some pepper to it it was better. My girlfriends chicken was ACTUALLY RAW. She tore a piece off and the chicken wasn't cooked AT ALL inside, even though the skin was crispy. Understandably we had to send it back. We waited for a while for them to bring out the dish again, although this time instead of two pieces of chicken, she got one (WTH?). The chicken had a decent flavor to it although another piece would've been nice. The waffle was soft, and not toasted like one would like. \n\nOverall food was blah, service was blah. Beer was good. Would definitely not go back.", "author": "Brittany M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-16", "description": "Beware that the cobb with pulled chicken includes heavy bbq sauce on the chicken . . . and half a deviled egg instead of the sliced whole egg or two you might expect with a cobb.  Way too sweet.  My friend liked his chicken and waffle, though.", "author": "Natalie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Great food, great service and great atmosphere! Went here with friends for dinner and the chicken and waffles, burger and steak were standouts. Great selection of beer too. Highly recommend! Can't wait to try their brunch.", "author": "N K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Great spot to watch a game. The food is delicious (the burger is sooo good). The beer selection is on point. And its all reasonably priced. Can't beat it.", "author": "Jessie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-29", "description": "Came with my best friend and stepson food was delicious. Chicken and waffles are tender and juicy. Not a wide variety of choices but decent menu . Drinks are pricey but affordable wish the mimosas were unlimited would of got more my girlfriend and I had two each. The waiter and hostess were very attentive, and patient as we took a while to figure out what we wanted. The atmosphere was comfy the building had a woodsy cabin feel like i was in the Montauk having brunch by the lake. (minus the lake) lol. Overall it was a lovely Sunday brunch would definitely come back.", "author": "nyala s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Great food! I tried the chicken waffle. It is so good! I tasted their steak and eggs Benedict with crab! Omg it was good too. Lol everything I had was good. The coffee was bottomless coffee which was a plus. The customer service was good too. I been here twice and both time was awesome. I will be back here and I recommend everyone to try them out.", "author": "Tillie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-04", "description": "Have to give credit where credit is due.  Ugly Duckling has great food and a bunch of TVs!  I just make sure I bring cash. :)", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "Went on a Thursday night around 7.  Was pretty dead but still had a good atmosphere.  I had the cajun wings and a salad, both were good.  I live in hotels 4 nights a week so I eat out a lot and rarely review places but the bartender Brian was personable and a nice guy who also gave me a road shot on the house so I figured today is the day I start reviewing since I rely on Yelp to feed me 4 nights a week I should contribute.", "author": "Dan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "This is a lovely looking restaurant with great service and good food. Cocktails were very good indeed. My friend's fried chicken and waffles with maple syrup was a great comfort food dish for this cold, rainy evening. I had Tuscan kale, cooked just right, and macaroni and cheese, which was creamy and hot. This is a nice restaurant with a very pleasant ambience.", "author": "Karen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "Decided to check out the Uglyduckling after seeing all the reviews raving about the chicken and waffle, figuring it will be something different than the norm. I was definitely not disappointed. \n\nThe chicken and waffle was delicious! The chicken was tender and the waffle was fluffy. The prices were reasonable and the meal was hot. I will definitely go back if only for the chicken and waffle. \n\nThere was a large beer selection, although several of the drafts had run out, including the Uglyduckling Pils - which I assume is the house beer. The two beers I tried were pretty good, but there was nothing that set them apart from hundreds of options out there. \n\nI thought the almost rustic decor was great and the atmosphere was nice. The music was turned up about halfway through dinner and I thought it was a little too loud for the size of space, but nothing you can't overlook. \n\nThe service was just ok. I went on a Tuesday night and only one waitress was working, resulting in pretty slow service overall. The waitress was friendly enough and I didn't hold the slow service against her too much because she was the only person working. I will say, however, that the Uglyduckling delivers food and the delivery guy seemed to delivery quickly since he was in and out of the restaurant probably 7-8 times while I was there. \n\nMy party of two arrived around 7:15pm on a Tuesday evening and we got a table right away, but the place had filled up by the time I left. Overall, the Uglyduckling is definitely worth checking out!", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "We just had beers but they were delicious and the food looked equally as good. We will definitely be back here for a simple date night or with friends to grab some food and drinks. Very cool spot on Smith St.", "author": "Christine K."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}