{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-05", "description": "Restaurant was basically empty, only one one waitress was on duty ( she did ok) and the bartender, party of 8, 6 adults and 2 kid ( they \"kids\" had MAC and cheese) and liked it, I had the brisket burger and it wasn't bad, my friend had the short rib sandwich and said it was just ok, another had the shrimp and grits and said it was also just ok also, another one had the shrimp salad when asked about it, she just shrugged (I'll let you call it), the main reason why I'm giving you the restaurant 2 stars is because 2 people out of our party and the chicken and waffles and said it tasted and I hate to use this word \" digusting\" waffles tasted like frozen eggo waffles and chicken tasted stale ( they might just have had an off night or maybe our expectations were just too high, based on the reviews), Hey you win some, you lose some. Most of the food was left on the table and they didn't even bothered to ask why but maybe the waitress was just overwhelmed because she was the only one working or maybe not.", "author": "Wale S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Again I'm in the area working and decided to stop by for a drink and food and the chicken and waffles is amazing", "author": "Ariel F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-04", "description": "Went here for lunch because my friend wanted a seared tuna sandwich.  We asked for the back table because it was a hot day and they had the doors open.  \n\nThere is an extensive list of craft beers on draft, but we weren't drinking.\n\nI wasn't too hungry so ordered the mussels, he had the seared ahi burger.  The waitress was nice, didn't spend much time with us.  My mussels were good.  It was a good sized order for an appetizer.  There was a lot of garlic (I spent the rest of the day smelling).  His burger was served with fries.  Unfortunately it wasn't an ahi steak, but a patty of ground ahi.  It was, however, not overcooked.  \n\nAll in all it was a decent meal.  Not the best and not the worst.  I would go back to try something else.", "author": "Deb W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "FIVE STARS!!!\n\nI came here for brunch and I am in love with this place! We had a total of six people but when we got there, they didn't have a table that would fit us. The owner came over to us and offered the first round of drinks on the house (what??). \n\nAfter waiting which seemed like forever (we were all very hungry), the food finally came. The owner gave us a free salad for the long wait which was super nice because he didn't have to do that. \n\nThe food was delicious! I ordered the steak frites. It was tender and the sauce went well with it. My boyfriend had the chicken and waffles. The waffle was super fluffy, the chicken was moist and crispy. The chicken and waffles came with a spicy aioli and it is SUPER DELICIOUS!\n\nI cannot wait to go back! :)", "author": "Karol L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "A lot of beer on tap and a lot of food choices. Got the delicious deviled eggs and mussels for appetizers. Both were good. The chicken and waffles were a bit disappointing. Our waffle was so soft and not crispy. Flavor was good. Chicken had a lot of flavor but it comes with one little piece. At least ours was. The lobster sandwich was okay. The lobster part was good but the bacon was too overpowering. I had to separate the sandwich and just eat the lobster.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "AMAZING!\n\nChicken and waffles are a must.. Their beers are awesome.. Fried pickles to die for!\n\nTheir service was awesome, and everyone was extremely nice and helpful.\n\nMy boyfriend and I are coming back for sure!", "author": "Olivia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "My wife and I popped in here for dinner and drinks (and to watch the Cubs game) on Saturday night. Great atmosphere - the space manages to avoid the overcrowding that you get with seemingly every restaurant in New York. We sat at the bar and received outstanding service from the bartender, Ryan. Maybe he knew about our shared name? Probably not, but he was great anyway. I had a plate of ribs and my wife had the salmon BLT. Both were excellent. The ribs were falling off the bone, had great flavor, and were combined with tasty sauce. The beer menu rocked. I think they had close to 30 beers on tap and offered samples of anything we were interested in trying. Finally, the place stayed open well past closing time to appease the sports fans and the random walk-ins. Overall, great experience and we will definitely be returning in the future.", "author": "Ryan V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "The Ugly Duckling is a fitting name. The atmosphere is deceiving. Everything sucks big time. How can you mess up twice serving hot milk for coffee? Our food came out cold. But then again, maybe I'm wrong, cold poached eggs might be a new trend. Half the menu was unavailable. Small portions, big prices. Rude hostesses and service. \n\nSave your money and go somewhere else. Even McDonald's does better breakfast!!", "author": "R P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "I didn't know what to expect - but the name was very catchy. I came in for Sunday brunch - the restaurant was packed. However the wait was under 5 min. \nThe ambiance is great - very low key and bar like feel. They have a huge draft beer selection.\nI got eggs Benedict and a friend got the chicken and waffles - both are highly recommended.", "author": "Elina A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "Didn't know what to expect but it was a great place to indulge.\n\nNote: they didn't have the poutine when we were there on 2/19. Sad.\n\nThe tasty...\nMac \u0026 Cheese  (creamy \u0026 milky)\nChicken \u0026 Waffles  (tender meat but the waffle could have been more crispier but the batter was yummy!)\n\nThe ok...\nBurger  (cooked to perfection however the flavor fell flat. More season? More salt?)\n\nGood beer selection. Good for crowds of 2, 4, 6. Good for casual date spot. Good service.  Love the ambiance.", "author": "Helena W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "I never do reviews on a place unless ive eaten there twice. I like to make sure that the food and service is consistent across the board. I ONLY review places that's worth my time. \n\nThe food here is amazing! I had the chicken and waffles during brunch, and I was impressed. The waffles are thinner  but still so delicious. They are so delicious you probably don't need to add the syrup to it. The chicken is actually chicken breast. It's favorable and I'm not sure how its prepared but it's well seasoned. NOT SALTY or GREASY!\n\nThe staff is professional and welcoming. I felt relaxed and at home the whole time. The bartender Candice was awesomce. I would recommend this place to anyone who is looking for a good place to eat, chill vibes, and strong drinks.", "author": "Eri L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "They just changed the menu and not for the better.  They took the pulled pork sandwich off the menu which was my favorite dish there.  They also changed the french fries.  They use to serve a mix of plain and sweet potato fries, I preferred just the plain. They have now switched to just plain fries BUT they are seasoned with rosemary and parmesan cheese.  Who puts rosemary on french fries???  I was thinking of ordering the short rib sandwich.  I tried to order it with no cheese but the waitress said it can't be ordered htat way because the chef said it would fall apart.  Sounds crazy but she said he would not make it w/o cheese.  I will need to find a new place for bar food, too bad.", "author": "John S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-02", "description": "Brunch was good, cute place. I got the chicken waffles. I think the waffles were pretty good, i like how it's softer than most places I've had it at. However, the chicken was slightly over fried so it gets lower ratings for that. Also, for a place with brunch, there was limited amount of nonalcoholic beverages.", "author": "April C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "I kept walking by and meaning to check out Uglyduckling since they opened, but from the outside they give more of a bar-scene-vibe, so I've walked by multiple times deciding on dinner elsewhere. I had some friends in the area and we wanted to catch the football game,  so thought it'd be the perfect opportunity to give it a try! Not going to lie, I had gone in with low expectations, sort of expecting your typical bar food, however, was pleasantly surprised! \n\nThe menu has a wide variety- from healthy to artery-clogging. I was starving and after a long day at work, had a craving for comfort food. I started with the ugly poutine which was delicious! Definitely, not your typical poutine, but I loved how the BBQ paired with the duck confit and provolone-- mMm, we were having fork wars over who got the last bite. For my main, I got the chicken \u0026 waffles- the chicken was very well-seasoned, fried to perfection and was so flavorful! \n\nThe service was great. I can't remember the name of my cocktail, but it tasted like juice which was dangerous. I don't doubt that I will come back for the poutine \u0026 chicken \u0026 waffles.", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-23", "description": "Music was blasting way too loud to enjoy dinner. \n\nExcellent beer selection! That I DID like. Server was nice, too. 2 stars solely for these reasons. \n\nFood I did NOT like. Zero stars. \n\nThe steak was awful. It was seasoned with a ton of ASIAN spices (lots of soy sauce) and was way too salty. It's not what you'd except for a dish with a FRENCH name. Steak frites should just be a simply cooked steak last time I checked, not Korean BBQ beef. They obviously used poor quality meat; It was super tough; the chefs were probably trying to mask the crappy meat with the soy sauce and god knows what else. Well, we noticed and it sucked. I was lied to. \n\nLobster roll was a forgettable $24 spent.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-31", "description": "First of all, walking into this place is like walking into the suburbs. \n\nSecond of all, having been here for dinner, I think it's fair to say that a good number of these reviews are from employees or owners. \n\nOnly someone who was paid to write it, would call the Chicken and Waffles, \"the best in Brooklyn!\" Like one reviewer did.\n\nI mean, c'mon guys. What did you do? Just cut and paste from your press release?\n\nIf you want a laugh, read some of the reviews.", "author": "Will B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "So randomly I bought the living social deal for the ugly duckling just hoping that it would save me one night from boredom. Very shortly after that night was present and I invited my dear friend to step out. It's a close a while to decide and we got more than one entrée but we were definitely a fan of the chicken and waffles and the waitress was very friendly. I would recommend this spot for a night out with friends, even a game night would be ideal.", "author": "Nahshona S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "I went here for brunch on a Sunday early afternoon, and it was amazing. Had the breakfast sandwich (made with cheddar waffles, fried chicken, fried egg, and bacon! Decadent and delicious) and two sangrias, which CANNOT be underestimated. Truly delicious, a shame they don't do pitchers of it. \n\nI'd love to come back for dinner or drinks sometime. A little pricey, but standard for the neighborhood. Good work, Uglyduckling.", "author": "Stacy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-18", "description": "Let me start by saying we went here on a whim since I was craving chicken and waffles \u0026 thank god we did. The chicken \u0026 waffles are absolutely to die for.. my husband had tacos \u0026 he really enjoyed those. Unfortunately the service is lacking big time \u0026 half the time they don't have advertised cocktails which is a bit disappointing especially for a sangria lover. On the other hand if you're a beer drinker this is definitely the place you want to try since they have tons and tons of beers on tap. The only other downside is the bartender hasn't been friendly anytime we've ever been there \u0026 it's been a few times. very hipstery joint which would definitely benefit from some nice personalities \u0026 better service", "author": "Katie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "The sign out front caught my eye with \"short rib tacos, shrimp and grits and 30 taps.\"  The aesthetic is on point.  Nice trendy, rustic decor.  The bar is pretty big and takes up half of the restaurant.  They have 4 tvs if you want to catch the game that are visible from almost any seat.\n\nWe had the fried pickles which were awesome.  Big portion with a delicious BBQ ranch dipping sauce.  We also had the salmon BLT with shoestring fries.  The BLT was also delicious.  Nice, soft roll. Decent piece of salmon. Great lemon aioli.  Shoestring fries were a mix or potato and sweet potato and they were pretty good.\n\nWe are big craft beer fans and this place says it's a gastropub with 30 taps.  We were in on a Saturday late afternoon and they maybe had 20 taps working and not a single IPA! That was a disappointment.  I settled on an Oskar Blues Mamas little yellow Pils and it was great but not what I had my mind set on.\n\nI will definitely be back for the food and hopefully a better tap selection.", "author": "Paul G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}