{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-14", "description": "The menu looked promising but the food and service didn't match up. \n\nIt was a cold rainy Oct Sunday, the front door was left open and we were in the way of the draft so some of us kept our coats on? \n\nThe regular coffee was mediocre and not made better with cream. My husband and friend hated their shrimp and grits which was more like wet porridge?\n\nI got the bfast sandwich and the chicken ? thighs were fried well but waffle soggy and didn't taste cheese. Maple syrup was on the thinner side lacking flavor.\n\nService was super slow, food came out cold. Plenty of brunch places on the same street.", "author": "Thy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "We gave this place 4 tries. I really think their staff ( including chefs) left last year and this place went to hell. The first time we went last year, it was decent. Now? What the heck is going on??\n\nService- 2/5\nFood 2/5 \n\nIt's just not good. And sadly, that's pretty disappointing as it's hard to mess up gastropub food. \n\nMy fiancé and I went here with a group, and it straight up took 25 min for 1 cocktail. Forget another one. \n\nPrior to that, they messed up our salmon ( freezing cold in the middle- not even kinda edible- we're talking reallllly not edible) and the shrimp and grits were soaking in some weird oil. It was so bad, they comped our drinks. \n\nIf the happens once or twice, I'd be more forgiving but 3/4 times, it just becomes our fault for being fools and going back. I wanna like this place, but idk. They don't seem to really care, so you shouldn't either. Save the trip", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "In the words of Guy Fieri - this place is the capital of Flavortown! \n\nThe food here is awesome and you won't leave hungry. Which is always the plan, isn't it? My friend and I came here before seeing a movie to get some food and hang out since it was a gorgeous day. She got the burger - which I've had before and is super flavorful (hello Flavortown!) - and I ordered the truffle fries and the goat cheese pear salad. A surprisingly delicious combination that left me satisfied on all levels. Gotta love goat cheese and truffle!!\n\nThe ambiance here is your usual gastropub vibes with a nice wood bar, random knick knacks and a few TVs. Oh and random music with no consistent genre. It's a good time :)", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "I had this bookmarked when it came out on one of the Yelp Brooklyn letters. And on a quiet Sunday late afternoon we decided to go. Cold night so there was plenty of parking and the place was quiet. We were seated right away and the staff was very friendly. We ordered the appetizer of Calamari with spinach, olives with parmesan cheese. Now I have read the reviews about this place and I was starting to rethink going here. However, the waitress and bartender were super nice and our food came out right away. The appetizer was yummy, calamari wasn't chewy and the spinach and parmesan complimented it. Now we ordered the Chicken and Waffles, cause come-on this place is known for this according to the Yelp Letter. BTW the waitress said good choice....and it was! Our entrees came out fairly fast. They fried chicken was a boneless chicken breast which I was ok with since I didn't want to get too messy. The waffle is thin but goes great with the chicken. It comes with a maple syrup and a chipotle mayo( I think the name was something aioli). It was really good! We were very happy with our selection and the service. Not sure if it was because it wasn't so busy or maybe what we ordered. We will be returning, next time we'll try the Mac-n-cheese which looked really good!", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "Went there for brunch the other day and it was a very forgettable experience. Needless to say, we won't be back.\n\nMy wife requested the breakfast tacos without pork, and apparently the eggs are already mixed with pork, so they couldn't do it....so I guess you can't scramble eggs without pork huh? No plain eggs available? OK, fine. I guess a brunch place does not have plain eggs.\n\nI got the shrimp and grits and the grits and sauce were good, while the shrimp were obviously not fresh. On top of this, it's really overpriced for the portion you get.\n\nService was horrible. An example is we gave our waitress the card to pay, I got a notification in my app immediately that they swiped, then the card only made its way back to our table 15-20 minutes later after asking 3 different people where it/our server was.\n\nKeep in mind this place is not big, had plenty of staff members and was maybe 50% full.\n\nWill not be back. Not really sure why it has good reviews.", "author": "Drew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Randomly walked in here on a Friday night. Really didn;t know what to expect, but I like this place.\n\nHad the calamari, French fries, crab mac and cheese and the bok choy. Also had a crab cake that would have been a bit better if it had a spicy ranch sauce to accompany it. The calamari was really good, though. My only complaint was the mac and cheese - not as cheesy as i like from a baked mac and cheese, but it's all good. I hear the chicken and waffles here are a hit....\n\nThe service here was great, and it's a good place to catch a game. Will definitely be back here again.", "author": "Karsten V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Came here for brunch. The food was-ugly sandwich and chicken and waffle-amazing. Our server was very kind, helpful and knowledgeable. The beer selection and the fact that they were showing some of the Sunday football games made the experience perfect!! I definitely recommend it for Sunday brunch.", "author": "Jenairis V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-17", "description": "Waited 40 mins for our food  -  tacos and fish \u0026 chips.  '\nThe fish  was small pieces of nothingness covered in a crust. The chips were skinny fries and occupied most of the plate.   Service was horrible!! Awful experience my first day in Brooklyn.  Avoid this place!!", "author": "Jay L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-26", "description": "I've been eyeing this spot for a minute because the menu sounded fantastic. Ugh! So disappointed. Shrimp and grits, not enough shrimp or flavor. It broke my heart. The chicken and waffles... I think Clinton St. Bakery has ruined me. Cocktails were lacking in any kick; seemed pretty watered down. I was just deeply disappointed.", "author": "Akilah R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-20", "description": "NO THX. Should have left right when we noticed the bad vibes, but stuck it out because starving. Rude waiter / cocktails nasty / wack vibes / gross food and not accurate to menu. Keep reading for fun details: \n\nWhat we ordered: Gin and Tonic\nWhat we got: Probably lemon Lysol\n\nFix: Asked waiter for beer instead. Beer arrived in lipstick covered glass.\n\nWhat we ordered: Grilled asparagus with lemon and Pecorino \nWhat we got: Steamed cold limp flavorless asparagus with no cheese \n\nFix: Told waiter no cheese. He tried to gaslight us and tell us we were wrong and then brought out powdered Parmesan. Ok dude. \n\nWhat we ordered: Mushroom Truffle Flatbread \nWhat we got: Cardboard sponge, no truffle. \n\nWhat we ordered: Wedge salad.\nWhat we got: Iceberg lettuce and an incorrect dressing. No toppings. \n\nThis experience was so unpleasant I still think about it from time to time and shed a little tear.", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "Loved the food here! Came here for dinner with the family on a Friday early evening (5:45pm) and was seated immediately. FYI- Mostly family with little kids eating at this time so come early if you don't want to wait.\n\nWe had the calamari salad to start and chicken with waffles, crab cake for entree.\nThe calamari salad is fried calamari mixed into mesclun greens with feta, olives and banana peppers. This was so delicious! They give a lot of calamari so definitely share this or get it as a main.\nChicken and waffles- deliciously season chicken (not dry) over crisp fluffy waffles. Just remember to take a pic (for IG) as soon as this dish comes out and take the hot chicken off the waffle! If not, the heat will cause the chicken to be less crispy and the waffles to start getting soft. \nCrab cake - yes singular! You get 1 cake on top of asparagus spears, side salad and corn with bean salsa. This was good with real crab meat and not a lot of fillers but not sure if it's worth $25. \n\nThe one thing that bothered us was the service. They only bought 2 small glasses of water for me and my husband and didn't bring anything for my 4.5 year old daughter. Plus they never came by to refill our water unless the half bottle of stale water on our table was it. Honestly couldn't figure out if that was for decor? For the vase of flowers? Or for us to drink?", "author": "Janet Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Just went there a few \n\nWe started with the Mac and cheese, crab cake and wings... The waiter gave my sugar  the option to split the wing order into two flavors, bit of which he thoroughly enjoyed.. the crab cake was yummy! While the Mac was cheesy, I've had better...\n\n\nI had the shrimp and grits as my meal and while the portion looked small at first sight, it hit the spot and left me full! It was Soo full of flavor! \n\nSugar  had the pork chop that he said was good\n\nWe topped it off with the cookie skillet dessert that was a super sweet treat! \n\nOverall it was a good experience and I would go back there again..\n\nI recommend giving them a try.\n\nThe waiter was attentive without being overbearing or annoying.", "author": "monique n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "Love their ugly sandwich!! Best combo of waffles and grilled chicken and the finger fries were a great add on as well! We got seated right away and the service was very good. Highly recommend this place and can't wait to return!!!", "author": "Nini N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-08", "description": "Pros:\n- Nice service\n- Nice ambience, not too loud or crowded\n- The tacos used in the Rancheros Tacos were excellent. They really saved that dish from complete mediocrity. \n\nCons:\n- Really subpar food. We got the deviled eggs, Chicken and Waffles and Rancheros Tacos. \n- The chicken was rubbery and had no semblance of presentation. \n- The potatoes with the tacos were awful, I took one bite. Why do so few places even try with the potatoes?! Just don't include them if you aren't going to do it well. \n- The deviled eggs were meh. I've had way better.\n- The coffees most prominent flavor was burnt. \n- Will not be returning for a meal.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Uglyduckling is not so ugly! The food here is all presentable and pretty and the servers are all very attentive.\n\nFor appetizers:\nWe had the fried calamari and the chicken wings. The fried calamari was different from other places that serve fried calamari. It was mixed with salad and olives and some dressing that the calamari did not need sauce to be dipped with! The salad and the calamari meshed well together and I could not stop eating it. The servings were HUGE. It was more of an entree itself!\nThe chicken wings- there are 3 flavors you can choose from. I think each order comes with about 8-10 wings. I'm not too sure of the amount. The options include Thai chili, dry cajun, and buffalo. We had the dry cajun and the buffalo and it was very good. They were a bit spicy but if you can handle the spice, def try! I personally liked the dry cajun and thought that the buffalo was good but didn't really stand out.\n\nFor the entree:\nI had their famous chicken and waffles. They serve a huge serving of chicken. It had maybe 3 BIG pieces of chicken and delicious waffle. The waffle and the syrup wasn't overly sweet, nor dry. The chicken was juicy and not dry either. I secretly enjoyed their chicken and waffles better than pies n thighs :x \n\nOverall, this place is a really great place to come if you're around the area! Chicken and waffles is popular here so you can't go wrong!", "author": "Gloria K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "Heading to a movie at Court Street, we of course looked to Yelp to save us from the misery of walking around aimlessly for a good restaurant. Uglyduckling popped up with its great reviews, and we were eager to try out this gastropub in the middle of Clinton Hill. The prices seemed standard for the area, and upon walking in, we found that it wasn't too busy or overrun by any groups in particular on this Friday night.\n\nWe were promptly seated and took in the wooden interior look while we got our water poured. The place had a cozy wooden-cabin feel, but not the flannel type. \n\nThanks to Yelp, we got a free glass of wine each, to which we paired with: Pork Tenderloin in a mushroom sauce for me, and a Salmon Fillet for my partner. The wine was better than we expected, and in 15 short minutes, our entrees came. Unfortunately they got my side dish wrong (roasted brussel sprouts) and I was brought string beans (haricots, on their menu) instead, but they made amends by bringing me a side of brussel sprouts in addition about 10 minutes later. I appreciated that they acknowledged the error and tried to make up for it. My partner's salmon was excellent, but the side asparagus lacked any flavour, simply boiled, its only saving grace was the slather of butter around it. My string beans and brussel sprouts were especially good, and the mushroom gravy on the tenderloin really did a lot for my hungry belly. Everything was good, but the tenderloin lacked nuance in my opinion.\n\nWe ended up having an additional drink after - a Mezcal special for my partner, and the Grapefruit/gin drink for me. Both were incredibly well done and for cocktails set at $11, it was really a bargain.\n\nOverall, we enjoyed our experience at Uglyduckling and I appreciated the service here.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "I came here with some friends for brunch on a Saturday. It's a cute little brunch place with some traditional brunch foods, like eggs Benedict and breakfast tacos, as well as other more lunchy foods, like chicken \u0026 waffles, and burgers. The server was friendly and attentive (definitely no complaints there!) but I just didn't think the food was really spectacular or special. My chicken \u0026 waffles came warm and not hot, which was a little disappointing but we were a party of 6 so maybe that had something to do with it...? There are a lot of awesome brunch places in Brooklyn, but unfortunately I didn't think this was one of them.", "author": "Rie U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "They have all the best foods here under one roof! Burgers, fried chicken, chicken wings, fries and fried calamari. Perhaps adding a pizza would make it the ultimate place to eat daily. \n\nI ordered the brisket burger, it was a tad salty but super delicious and satisfying. The fries were among the best fries I have ever had. That ugly sauce is good stuff. My girlfriend ordered the fried chicken and waffles, the chicken breast was as freaking moist as a soaked bounty wipe. All that in the best way! The waffle was my favorite waffle out of all the fried chicken and waffles I have sampled. I couldn't forgot about the fried calamari, olives, arugula, fried calamari and vinegary goodness. Most unique take on fried calamari and it definitely works. The fried chicken wings were exactly what you expect from a buffalo wing. Overall everything here was absolutely delightful, maybe a little too salty at some bites but I would definitely come back again. \n\nAlso great service with smiling faces, cant forget that!", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Just happen to be in town after visiting the newly developed industry City in BK and was looking for some goods eats after a failed attempt to get in the Dekalb Mall(no parking). So the closest spot near by was Uglyduckling and to be honest I was a little skeptical by the photos posted on yelp. The place looked very upscale and the way I was dressed that night I didn't fall into that demographic.\nSo, me and boy still gave it a try. It was a mixed crowd. Some where on dates, a few drinking at the bar, and others just hanging out . The first thing that popped off the menu for me was the chicken and waffles. Now I've been on a comfort food binge lately and my standards have been increasing since I'm happy to say I've been to some pretty good spots lately. So back to the chicken and waffles.... I seemed like the most appealing thing on the menu for me and boy did U.D not fail me. The chicken was crispy and juicy. The waffles were slamming and I left stuffed and praising God AMEN. So if your in Bk and you want some good chicken and waffles this should be a spot on your radar!", "author": "Brandon H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-22", "description": "Went for brunch. The mimosas were great, the food was ok (the chipotle omelet was returned for lack of flavor, but the chicken and waffles were better.) Service was excellent though! And we enjoyed the atmosphere (bar, TVs, casual dining). All in all, great ambiance for a decent price.", "author": "Keila H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}