{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-04", "description": "Very underwhelming. It took forever to get our food and when it got there, parts of the dish were lukewarm while others were just cold. Beyond the food not being the right temperature, in general it was bland and greasy. I'm not sure how this restaurant has such a good rating but from my experience there are much better options in the neighborhood.", "author": "Mal H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "It's hard to describe my feelings about Ugly Duckling. Honestly, it is very forgettable. Nothing really creates a memorable feeling. The food is okay. The drinks are fine. The environment and ambiance is a warm wood factory-esque vibe.\n\nService was fine. The staff was friendly. \n\nI could go into detail... but... it just is. Nothing bad about it, but nothing memorable. I would recommend elsewhere.", "author": "Ollie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Thank you to the great staff at Uglyduckling for accommodating my large birthday party of 14! We had an absolute blast, service was excellent, great menu with options for any palette. They provided a delicious cake for dessert and even sent the table a round of shots at the end! I highly recommend and can't thank the whole staff enough.", "author": "Minda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Overall this place is definitely worth a visit. Came on a Saturday night and were seated right away. Great beer selection. The short rib taco app was very tasty. The wife had the chicken \u0026 waffle which she enjoyed. I came here for the stuffed brisket burger. One of the best burgers i have ever had. The combo of sliced brisket inside the burger was different and very good. Service was excellent. i'm taking off a star because of price. Felt it was just a little too expensive. I will be back for that burger!", "author": "Nino B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "I came here for brunch with my friends. Super cool brunch spot in downtown Brooklyn. Definitely would recommend it. Our waiters name was Katie and she was very nice, helpful and quick with our drinks. I got the chicken and waffles which was amazing. Will certainty be coming back and hopefully will get Katie again serving us!", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "I really like this place.\n\nI loved the dish that I had for brunch which was the Smoked Ugly. Essentially it was eggs Benedict with pulled pork and a side of potatoes and salad. The eggs were cooked to perfection and the pork was cooked and seasoned fantastic as well. The salad was fresh and crisp. It was just an overall great dish. I didn't feel heavy or stuffed after which was a good feeling. I also tasted the chicken and waffles which was good as well. The chicken is actually in strips with the same taste as fried chicken on the bone. The aioli sauce on the side was to die for. The ambiance is super chill. Ambience and atmosphere always says a lot and I believe is a direct reflection of management. There is definitely a good vibe here. Our waiter Andrew was very friendly and attentive. Overall it was a great experience and I definitely want to come back for those poached eggs! The tap selection looks pretty awesome too. The taps are built into the wall which make it look really clean and non traditional in a good way. I may have to come back during a more appropriate hour to try the beer!", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "A fantastic craft beer selection and super friendly staff. Aubrey and Julien both went out of their way to make us feel incredibly welcomed and we will definitely plan to come back.", "author": "Vicki L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "Great neighborhood spot. Rotating beer selection...solid food. Best place to come when you want to watch football without forcing your wife to go to a sports bar ;-) #protip", "author": "Travis D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Our favorite spot in the hood. Great to grab a cocktail and snack mid-week, killer brunch selection, always a good game on the TV's. Bartenders are always super friendly and helpful. All around a solid establishment.", "author": "K-T O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "While visiting New York last week, my wife and I dined at the U.G. We loved everything about this place. It was our anniversary and the  staff treated us like royalty. We shared shrimp and grits, a mushroom truffle flat bread, and the ugly house salad. The drinks were great and the food we ordered was delicious. The next time we are in town, we plan to dine here again. Thanks for a great time and wonderful meal.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Visited this establishment with friends. We all had a great time. Relaxed atmosphere, good food and a friendly, attentive staff!! Everyone enjoyed their meals. I had the pulled pork sandwich. It was excellent. Great place to go for drinks and dinner with friends. They don't rush you out the door so you can hang as long as you like. Nice place for a night out with friends.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "A BIG Thumbs up to the Manager/host. He was super sweet for reserving a table for me when I called to see how long was the wait.. I was sat right away when I arrived to the restaurant for a table of 4. \n\nWe all started off with drinks: 2 Ugly Marys (which is a bloody mary) ($8 each), 1 Mimosa ($8) and 1 Rushing duck st out nitro ($8). Highly recommend trying their Ugly Mary.\n\nFor our main course, we ordered: Smoked Ugly ($16) - Poached eggs with smoked pulled pork, hollandaise with a side of house salad and home fries, Eggs Norwegian ($19) - Fresh Norwegian smoked salmon, poached eggs, hollandaise with a side of house salad and home fries, Breakfast Sandwich ($18) - cheddar cheese waffle, fried chicken, fried egg with a side of fries , Chicken \u0026 Waffles ($16) - fried chicken, Belgian waffles and a side order of bacon ($5) and non-alcoholic ugly mary ($5) Total = $124.12. \n\nMy friend had the chicken and waffles and he said the chicken was not dry at all. My bf had the smoked ugly which he liked the twist of having pulled pork with eggs benedict. Definitely not your average eggs benedict. I had the Eggs Norwegian which is something i normally get for brunch. The eggs were poached perfectly and the hollandaise was buttery and creamy.", "author": "Cynthia Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-01", "description": "Stopped in for a low-key weeknight dinner a couple weeks back. Dinner menu was fine but nothing very exciting. We had the fried calamari, chicken wings and the salmon. Portions were very generous, but the food was mostly forgettable. Chicken wings were heavily sauced and spicy but too sweet and the chicken itself was a little listless (probably overdone?). The Mediterranean calamari was an interesting alternative to your usual fried calamari offering but it tasted a bit soggy; ultimately we ended up only finishing about half the serving. The salmon was well prepared but nothing spectacular. \n\nOn top of that there were a few hiccups with the service; it seems like we were seated during a handoff or shift change and so our actual server didn't see that we were waiting for quite some time. Not really their fault though and they were profusely apologetic about it so not holding it against them too badly. \n\nHonestly can't see myself coming back for dinner given the overall experience, but they do have a good beer menu so perhaps I'll be back for a pint.", "author": "Ramesh D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Needed to find a good brunch spot in Cobble Hill and Uglyducking was it. I went out with a dear friend and she selected the place because they serve Eggs Benedict, which is a favorite for hers, my only requirement is alcohol. \n\nThe location it's self was medium sized, not too big and not too cramped either, the service was quick, our orders came out in a few minutes.\n\nI had chicken and waffles and was not disappointed.  The chicken was boneless and seasoned well. The waffle were a little sad but they did the trick.\n\nOver all it was a good experience, I would definitely go again.", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Great place and friendly environment. The food I ordered was really delicious and had a good flavor to it. This restaurant is really unique the wait was not long at all. I came with a large group also and we only waited for like 5 mins. Ask for the workers' recommendations!", "author": "Wendy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "I absolutely loved everything about this place! The service, food, and ambience was great for brunch. \n\nI ordered the French toast with a side of bacon. The French toast was absolutely amazing! The bacon was cooked to perfection. The portion was substantial for the price. I also had a drink that I can't remember the name of but it was made with gin. The drink was so refreshing and nicely made. \n\nI will definitely come back here. My waiter provided excellent service. Overall, this place exceeded my expectations.", "author": "Jana P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Its not about how you look on the outside but what you have on the inside that counts. I love the name of this place and how it pays homage to a building that was deemed one of the city's ugliest buildings. Inside, this craft beer bar is quite the opposite, Wrapped in wood and low hanging laps I find it rather elegant. Taps galore from some of the best breweries around and a great menu to pair them with. \nPRO TIP: beer and some live music after work", "author": "Cesar I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Great place for a casual Brooklyn brunch with a fun gastro pub atmosphere. Chicken and waffles here were delicious- waffles had the perfect balance of light, soft, and crispy, and the chicken was very tender. I also really enjoyed the Roasted Pear \u0026 Goat Cheese Salad. Service here was very friendly and fast, and there was no wait for brunch on Saturday at 1 PM. There's definitely nothing ugly about this awesome Brooklyn spot!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-21", "description": "Came here with my husband and a friend for brunch on a Saturday during the world cup. It had a weird vibe; like you know when you walk into a place and you feel like something happened there? That was it. My friend and I ordered Molly's iced coffee and my husband got a bloody Mary. His was quite good and had a nice kick to it. Our special iced coffees on the other hand were very diluted and tasted like watered-down White Russians.  It took awhile to get our food ordered but the food came out fairly quickly after that. I ordered the shrimp and grits, my husband got the chicken and waffles and my friend got the eggs Benedict. All meals were mediocre and certainly not worth the high price tag. My shrimp and grits dish was drenched in sauce, the shrimp was was good but everything else needed a little work.  My husband got the chicken and waffles and they were not great. Definitely not coming back.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "I love this place. I stumbled upon it after going to an archery class that wasn't to far from the restaurant and I've been going back ever since. A friend of mine recently moved into the area so I had to share this gem with her. I'm happy to say that she enjoyed it as well.", "author": "Y A."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}