{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-14", "description": "Service really slow our waitress took a lunch break while still waiting on us. We all got the chicken and waffles two out of the three were cold and had to be sent back. I do not think we will be going back.", "author": "Janae W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "If wish I could give more than 5 stars lol! This place was so awesome! We had Dennis as our waiter (maybe he was an owner/manager) and he was beyond accommodating, patient, and attentive. My friend and I got there and like typical girls, we were chatting for a few minutes before even looking at the menu lol, but Dennis didn't rush us at all. We had the \"ugly Mary\" (their Bloody Mary) \u0026 Moscow  Mules. Both drinks were made perfectly, not too weak but not too strong, just perfect for a Saturday afternoon brunch. I ordered the chicken and waffles, while my friend had the stuffed French toast and deviled eggs. We also shared shoe string fries with the chipotle aioli. The fries were both sweet and Idaho potatoes which I enjoyed; it was a nice combination and the chipotle aioli was so delicious. I would put that on everything if I could! I tried some of the French toast and it was amazing! It was French toast stuffed with marscopone cheese \u0026 bananas. It was so sweet and hearty and so good!!! My chicken and waffles was some of the best I've ever had. I've had this meal at other places and this knocked them out of the water. (I know my southern/comfort food, my BF is a good ol' boy lol). This was so amazing. If I wasn't so full, I'd eat more! The portion sizes were perfect, you definitely do not leave here hungry. I can't wait to come back!!!", "author": "Kristen K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-28", "description": "Came here for dinner but only served brunch until four on a Saturday!! Who wants eggs and breakfast until so late into the day?! Nice draft menu though.", "author": "Sara T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "Decent fare, no wait. Operable large façade windows allows fresh air on warm summer mornings and hot summer nights. Bloody Mary's were spicy, and definintely umami as promised - just not sure how. Great beer selection, great food. Nothing mind blowing, but definitely on point.", "author": "Kailey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "The food and service here is amazing! Unique menu options are well-crafted and the servers and manager genuinely care about their customers. Would definitely come here again! Very satisfied!", "author": "Albany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "Came here for brunch.  Got the fried chicken and waffles with a pointsettia cocktail.  It was delicious and I ate/drank the whole thing.  Only gave it four stars because there wasn't anything too original or different about it.  But the staff was friendly and attentive!", "author": "Gina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "I came here with a groupon and my party ordered eggs benedict with lobster, steak fittes, and chicken and waffles. For the most part, every plate was tasty! Everything was fresh, seasoned nicely and was very well presented on the plate. The only thing I would change is the portion sizes. Both men in my party left hungry after brunch! And they aren't very big guys!  I also thought prices were a bit high, and I probably will not come back here without a groupon unless I was in the mood to splurge. Service was nice and our waitress was very polite and attentive which is always a plus!", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "This place is awesome! Great staff, great beer selection, I've had the salmon, chicken and waffles, and now steak and eggs (replaced the French fries with sweet potato hash) with spicy aeoli... Omg so good!", "author": "Bethany S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Very good food and service. I went with my girlfriend for brunch. She had the steak frites which tasted fantastic and I had the fried chicken and waffles which might be the best fried chicken and waffles I've ever had. The waiter and manager were really nice. They tended to us quickly. Everything came out fast.", "author": "Jorge J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Brought a 20 person group here which took over almost their entire seating area. I chose 5 entrees for the group to choose from (hint: if you have a large group, the restaurant will perform better on a limited menu so make it easy on yourself, choose a good array of entrees and your group will be happier in the end). Everyone ordered at one time and our food came out basically all at the same time.  I warned the group that if everyone ordered chicken and waffles it would take longer - still about half the group (mostly international and bound to choose C\u0026W) ordered but there was no delay. Everyone was able to eat together and food was hot and super delish. I preordered some apps so there was lots to snack on. The devils on horseback are TO DIE FOR. The staff was amazing and we felt like super VIPs, they made me look like a rockstar. Thank you guys, it was really awesome!", "author": "Karen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Had Sunday brunch. Chicken \u0026 waffles are amazing, especially the waffles, buttery and crispy just the way I like. It's a lovely and lively restaurant with friendly services. Saw a big selection of beer,  so definitely will try them next time.", "author": "J G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-18", "description": "Came here last Sunday. Gastropub atmosphere and attentive service. Had the chicken and waffles: quite disappointing. The chicken while tender lacked seasoning and the waffle seemed more like a crepe than a waffle. Will probably come back again to try one of the burgers on the menu. Hopefully that's not a disappointment!", "author": "Tara B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-11", "description": "My husband and I came here over the weekend for late lunch when it wasn't busy at all. I like the look and the atmosphere, though the TVs confused me a bit since it has the generic-y hip, decent-restaurant decor and vibe. \n\nWe ordered the Ugly Mary and a beer flight. They were out of one of the beers we requested, but no biggie--they have lot of options and a menu full of great descriptions. For some reason, which was never disclosed to us, our drinks took close to 20 minutes to come out. I know it wasn't the server's fault, but I would've appreciated a quick word about it since I kept seeing her bring drinks to other tables. I can only speculate. The bartender did look a little slow-moving and was distracted in conversation. \n\nThe burger was good, just a tad overcooked (well done when I'd requested medium). The fries were off-the-chart fantastic! They were a thin and crispy mix of regular and sweet potato fries. Still dreaming of them now. The chicken and waffles were ok. My husband said he thought the waffle was better than the chicken, which is something I've never heard him say before. There were lots of large bones and not a ton of meat, but he enjoyed it anyway. \n\nWith all the other options in the area I might not come back just for the food, but I'd stop in for a drink or to try some new beers...with a side of fries, of course!", "author": "M M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "Wow!!! Thank goodness for a great bar in this area. I had the lobster sandwich and it was amazing( I got talked into it but I'm very happy about it). When I have a long and hard day at work I come here to relax. The staff is not only helpful but attentive. This place is my little cheers. You can go to to any bar in Brooklyn but if you want a great beer, chill environment and just enjoy yourself this is the place.", "author": "Sommer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "I was here the other night with 2 friends and had a really nice dinner. Two of us ordered the steak frites with chimmichurri sauce and the other one got a salad. We also had the pickled vegetable plate for an appetizer and it was really nice. My favorite was the pickled (lima?) beans. I also thought that the mixed sweet potato/regular potato fries were excellent. \n\nThe service was also really nice and helpful. They refilled the water often and gave a great beer recommendation that my friend was really impressed with. \n\nI'll definitely come back another time. I'd like to try their brunch too; it looks really nice!", "author": "Alison B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "The kitchen was already closed but they have an exceptional draught list. The staff was very friendly and clientele was mixed. Low key on a Thursday night but the game was on and the atmosphere was welcoming, homey and semi hip. Chill spot.", "author": "Allie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "I have been here a few times and this place never disappoints.  Never to crowded and the staff is extremely knowledgeable and helpful.  There menu is fantastic and I have recently tried a deep fried cod which was fantastic.  Great beer selection and sports on TV.\nLook no further for brunch or lunch in this neighborhood.", "author": "Barney S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-22", "description": "The food's good, but nothing special -- it's too expensive for what it is. The service is really where they fell apart, especially considering how quiet it was. One of my party's dishes came out almost 15 minutes after the rest of ours.", "author": "E M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "Place was amazing, even though it started out rough and they had run out of a couple of our first choices, the food we got was really good. Crab cakes are bomb and the Mac n cheese with bacon in it was unbelievable!", "author": "AJ O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "Outstanding beer selection. So nice to be greeted by the owner. Awesome burger. Maybe the best beef stew I've ever had. Fantastic atmosphere. We were out for an adult night but I am looking forward to bringing my family back to jump on the kids menu. \n\nAttentive staff imbued with obvious pride in their delectable dishes and inspired tunes emanating throughout. Warm, welcoming, wonderful oasis in the winter wonderland.", "author": "Jason C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}