{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "I'm a little late in writing a review for Uglyduckling but regardless here I am better late than never. I made a reservation here for a party of 12 for my birthday in March and while the restaurant isn't huge, they were very kind to accommodate us. The service was great and our server came by to check in on us frequently but not to the point of annoying. I ordered burrata as an appetizer and a smoked ugly as the main. Both were very delicious. I didn't hear any complaints from my friends so it's safe to assume all 12 of us were pleased with our orders. We also got a free shot for the table when they heard it was my birthday. Overall, a great experience here and I definitely recommend for everyone to come visit.", "author": "Phoebe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "The food was DELICIOUS. I had a salmon BLT and my date had the short rib. My sandwich was moist and flavorful. I tasted the short rib and the flavor was amazing. We also ordered the chicken wing appetizer and that was almost pretty good. Overall the experience was good.", "author": "Sasha M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "Good, not Great. The space and vibe are very cool. The service was friendly and approachable. But, overall, the food was \"just ok\". The menu is interesting and the choices are varied, but the \"delivery\" was average. Ordered the Ugly Breakfast Sandwich, and although nothing on the plate was bad, nothing was great either-average waffle, average fried chicken, etc. Others at the table ordered the Breakfast Tacos and they were also average-the \"filling\" was sloppy and the corn tortillas were so soggy and greasy that it required fork and knife to eat the tacos. Although the beer/cider selection is excellent, I'm not sure that would be the reason to bring me back---Grade: \"B-\"", "author": "Carlos D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Their duck a l'orange was fantastic. Peking duck was also decent. Duck duck duck duck", "author": "Jonathon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Came in from out of town and couldn't have asked for a better night out in Brooklyn! Super friendly staff and perfectly portioned food!", "author": "Dianne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Great service and amazing cider! Variety of beers and drinks l, but most of all Julian was very welcoming and helpful.", "author": "Vivian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "A friend and I stopped in for dinner last week. \nThe space is great as was the food - we had the shrimp and grits which were delicious.\nMy only complaint is the service. The waitress was very nice by she was the only 1 working that evening. She sat us down and we waited 15 minutes for menus and another 15 for her to come back and take our orders. Totally unacceptable.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "This is the second time I've eaten at UglyDuckling. First time I was very impressed with the Calamari, Short rib tacos, and Old world flat bread. \nSecond time my mistake was ordering the Cajun rub wings, they were a disappointment, along with the bar bill. \nI'll be more careful next time to just drink a beer or 2, cause this place hits you over the head for mixed drinks.", "author": "Jim B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-09", "description": "The restaurant looked so cute and the menu was perfect!  Everything looked great but expensiveeee.  And then the food was just mehhhhh.  I don't want to pay $18 for a salmon eggs benny that I can make way better myself at home.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-12", "description": "This was a tough review to write.  On one hand it's an amazing piece of chicken, on the other hand the waffle was garbage.\n\nSo lets get down to it, came by this place with a friend to try it out.  Saw they had fried chicken and cheddar waffle.  My friend saw fried pickles.  Boom we in there like it's a 5 o'clock free crack give-away.\n\nNot what I expected, so lets review the good points.  \n\nService was good.  The waiter bartender was very attentive.  Gave us a carafe of water and always came by to see how we were doing.\n\nFried chicken was kick ass.  It had some bit of heat, like a tickle in the palate to let you know it was there.  Meat was tender and juicy and from the shape of it probably thigh meat.  My guess is thigh meat that has been deboned, pounded, brined, dredged, then fried.\n\nCheddar waffle was a thin floppy soggy eggo.  Did not taste any cheddar.  They should have gone with a thick piece of Belgian waffle here to get that 40:60 ratio of meat:starch.  This sorry excuse for a breakfast staple broke the dish for me.\n\nFried pickle was standard fare, nothing to write home about.  It's a pickle that's breaded and fried.\n\nOther things to take note of...\n\npoor presentation.  This place is either going for a hipster feel or a old school bar feel with mac \u0026 cheese and chicken \u0026 waffles so there is no uniformity here.  Hipsters would have used copper moscow cups for our water and beer.  Old school south would have gone with paper plates, plastic utensils and jelly jars.  This was like \"What if the Four Seasons sold comfort food?\".  \n\nFor now this was a bittersweet dissappointment and until this place actually finds its identity, I can't see it survive against the likes of clover club or buttermilk channel.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Enjoyed just about everything about this meal. Would return. \n\nPro: Friendly, patient service. Wings were spicy but not burn your mouth spicy. Pasta was surprisingly good for an American bar. Greek salad with shrimp was more than enough for an entree, also fresh. Beers are all the same price, which seems honest. \n\nCons: $110 for items listed above + 4 beers. Seems a little steep... But I supposed it's on par for the area. If you get there around 6:30, you'll be surrounded by children.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Great beer selection. If you are not dieting, amazing food selection. We managed to get a super healthy salads with chicken and beef. So good!", "author": "Inna S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-17", "description": "Used to be good and plentiful. Now they changed the menu and everything is about twice as expensive as before , even burrata is around$17 and it's new on the menu. Most places around it's less than $13. The dishes are tiny now the burger is twice less than other places and $20 in price. Don't know what happened-it used to be one of my go to places", "author": "Iryna B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-28", "description": "The fries were good!\n\nPork chop - bad, tasted like someone's first time making pork chops, dry even with the maple syrup. Only took a couple bites and sent back but was still charged.\n\nCrab cake - eh, nothing special. also its not lump crab - its shredded\n\nDuck Crostini - duck was way overcooked, maybe its supposed to be ugly?\n\nBrisket Stuffed Burger - no noticeable texture or flavor difference from a normal burger, uninspired. \n\nMac n' Cheese - Worst I've ever had in a restaurant. You know in college when someone added too much water to the easy mac - same sauce consistency, watery and inedible.\n\nService was fine, but I expected more", "author": "jake n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Great food, good portion sizes, great service, cool space! What else can you possibly ask for. The cookie dessert is basic but delicious!!", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Had a very enjoyable meal here with my family. The staff was pleasant, knew the menu well and were appropriately attentive. The food was quite good. Particularly enjoyed the meat \u0026 cheese plate, the Mac \u0026 Cheese with short rib and the Brisket Burger. I loved the decor with wood \u0026 metals, very cozy. The beer selections offer so much variety. The owners \u0026 staff are eager to please, ask for feedback and want very much to please. Well done.", "author": "BklynCraCra B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "A solid four rating.\n\nThe burger got the job done but I definitely wouldn't put it in my top five.\n\nHappy hour had a great selection and prices.  Food was a bit overpriced.\n\nAmbiance is cool and the bartender was super friendly. \n\nTip:  stick to happy hour", "author": "Rocio T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Brunch only review \n\nI got to a birthday brunch incredibly late. I hate being 'that' person, but i was. I frantically texted my friend to get seated and let the staff know they can order for me. I crossed my fingers that they would seat the group without me. And you know what ; they did. How amazing is that? Not many places do, so I really appreciate that accommodation.\n\nI only ordered benedict eggs with pulled pork, but was pretty happy with it. The eggs were runny, the English muffin was crispy, there was a lovely amount of pulled pork, a small side salad and some crispy potatoes. The only thing that keeps it from being a 5 star dish, is the amount of sauce on the pulled pork and the hollandaise wasn't flavorful enough. I did come away full with my order though!\n\nSo I came into the restaurant with some baked goods. Hoping to enjoy some cake with the girls, I tried to secretly ask the waitress if it would be ok to have them there. Pleasant as can be, they checked with the manager /kitchen and they (yet again) accommodated. Since I didn't bring candles, do you know what they did? THEY WENT OUT AND BOUGHT CANDLES. For four cupcakes. What kind of amazing service is that??\n\nThank you all for helping to make my friend's birthday a great one!", "author": "Doris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "So this review is based on the food. I ordered the salmon and pepper bacon with Mac and cheese. \nSalmon-cooked well veggies that accompanied it were good\nPepper bacon-doesn't actually taste like it has pepper, just has black flakes on it. Decent serving size though.\nMac and cheese- presentation is awesome, but lacking in the flavor dept. If you are a mac and cheese connoisseur then you won't be amazed. \n My friend had the salmon blt which she loved and also seems to be a popular item.", "author": "Jay D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "There's always a great selection of beers. The food is great. Much better than typical bar food -  from chicken and waffles to shrimp and grits, tacos...\n\nThe staff is friendly and super attentive. \n\nAlways a solid go-to choice for good food, drinks, or to watch a game.", "author": "Jeff F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}