{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Help! I'm addicted to Uglyduckling's chicken and waffles. Seriously help me because not only is it on their brunch menu, you can get it for dinner too!!!!\n\nFood is outstanding, mixed drinks are strong and satisfying. This is hands down one of my favorite spots in the hood. On other occasions I have ordered mac and cheese and the ahi tuna burger (which are both delicious) but, even at this moment, all I can think about is their chicken and waffles.\n\nBONUS - They have lots of TVs! Great for watching games and making new friends at the bar.", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "I love this place almost entirely for the chicken and waffles. Are they the best I've ever had? Maybe not - but they are pretty dang great. This is a must order. \n\nSecond, the design of this place is warm and modern - They did a great job. You can also catch games, order some beers, and hang out for a while. \n\nI would like this place more if they had a better happy hour and lowered some of their prices, but all around a good spot.", "author": "Sheela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Amazing Service from staff, they really aim to please.\n\nBig Thank you to Ben, Alexandra and bartender (Irish coffee induced my sister into a state of tranquility for the rest of the day aka kept her mouth shut)!\n\nCame with a party of four to tackle every dish on the menu that appealed to my taste buds (no shame in my game). The clear highlights were the Cobb Salad and Stuffed French Toast, my oh my were they good.\n\nThe Cobb salad is not your basic Cobb salad, I mean they threw a deviled egg in there.\n\nThe Stuffed French toast blew us all away, don't get caught ordering this if everybody is gonna be dipping in your plate (make sure you tell them to order their own). French Toast consisted of fresh whipped cream, mascarpone, and a corn-flake/cereal kind of crust.\n\nI actually ordered the Pimiento Burger w/ mix-match fries (sweet potato and regular) which was great and split half with the sister, in exchange for some of her Chicken and Waffles w/spicy aioli and syrup. I was left with one bite.\n\nIn summary definitely a place to return to, great food, great staff, nice vibe. Just keep your eyes on your fries!", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Came here for brunch with my girlfriend. For starters we had their specialty coffees. Hawaiian, and Irish Coffees. Then I ordered Deviled eggs!!!  Then for the entrees we had the Ugly Duck sandwich, and she had Chicken and Waffles!!! Service was quick, and the server was very polite and professional. THIS PLACE WAS WORTH THE WAIT!!!!!", "author": "Brownhornet1975 .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Great spot! Excellent food and good drinks! Had the burger with fries! The garlic aioli was perfect touch.", "author": "Maribel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Finally tried the food this weekend and damn, another 5 stars are in order.\n\nIt was fourth of July and I'd just polished off a double hamburger. So, clearly I required a steak. 'Murica. \n\nWe ordered the steak frites and went to TOWN. I have no idea what they marinated it in (or what that green sauce was on top) but it was so flavorful. Now, I'm not one for embellishing steak. Normally, I like to appreciate my meat nice and simple. But this was an exception. Even the fries were great. It was potato and sweet potato cut super thin and spiced. \n\nKeep it up, Uglyduckling!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Came here for brunch. I enjoyed the Smoked Ugly and my BF enjoyed the Stuffed French Toast. Solid Irish Coffee.", "author": "F A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Food is great here, and friendly staff is great with kids. Definitely worth coming back to eat the chicken and waffles  (yum yum)! Can't wait to try the shrimp with grits, and the mac and cheese is delicious! The salad and fruits are served fresh. I give them 5 stars all the way!", "author": "Ricardo J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-13", "description": "Chicken and waffles -- maybe had a bad day. We all ordered the same dish and they were all dry, dry, dry. The waitress was kind enough to take all three dishes off the tab so we left her a large tip instead.", "author": "Ally W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Went for dinner last night with my daughter and her boyfriend.  The food was delicious and the portions generous.  Started with the short rib tacos full of delicious short rib perfectly done and the calamari salad.  The salad was perfect and the calamari was not chewy and perfectly fried.  I had the Shrimp and Grits which is the perfect dinner on a chilly winter night.  Real comfort food.  My daughter had the salmon and her boyfriend had the tavern burger nothing left on their plates need I say more.  Will be returning to try there other offerings.  Bonus live music on Thursday night.", "author": "Karen D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "Two words. Ugly Mary. This was one well made bloody mary that packed a punch. The pimento cheeseburger and crispy french fries were also nicely done. The pimento wasn't overwhelming and a nice addition to the perfectly cooked burger. I'd forgo the lackluster  chicken and waffles though. Fun atmosphere with plenty of TVs to watch a game. I'll be back to try one or a few of their 30 draught beers.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "hands down some of the best chicken \u0026 waffles i've ever had\n\nperiod", "author": "Abul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "The chicken and waffles were amazing. My wife got the shrimp tacos as well and it was very good. The place has great ambience and staff was friendly.", "author": "Allen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Brunch here is delicious!!!!! We got the pulled pork eggs Benedict and the waffle chicken breakfast sandwich!", "author": "Emily O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "Have eaten here multiple times. Nice service quick meal. Pleasant atmosphere. Good bear selection. Lots of TV,s all over the place.", "author": "Gif A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-19", "description": "The food here is fine, but it's completely overpriced and the service is really slow. I hope they stay closed so something better moves in!", "author": "Laura D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-28", "description": "Idk how this place got 5 stars!  EFF this sorry ass place!!\n  \nI walked in and nobody greeted me or seated me.  I sat myself (and that would be okay if there was a sign) and waited for 5-10 minutes.  I watched these 2 fools, the bartender and the waiter talk to customers and glance over at me and look away.  I never got a menu, a glass of water, or even started a conversation to order.  Can't say much for the food since I didn't even stay that long.  I walked here, sat myself, waited patiently....I sure as hell WON'T ask for the menu so I can give them money!  Sorry ass place that I'll always remember....NOT to go ever again!", "author": "A D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "I came here for dinner. My friend and I were indecisive on what we wanted to drink so we were offered to taste a couple beers and wines from the menu... 5 minutes in and I knew I was a fan of this place.  \n\nWe shared the \"devils on horseback\" - four deviled eggs with fried oysters, served with a small salad. The eggs and the salad were both delicious. \n\nJust as we were finishing our appetizer, our meals came out. I had the ahi tuna burger with fries. The tuna was cooked perfectly, and the wasabi and teriyaki sauces provided a nice, mild Asian flavor. I don't normally like sweet potato fries, but I liked these. They were small and crispy, and when mixed with regular potato fries, they were amazing. \n\nAs a side note, I liked the rustic decor and staff was extremely friendly. I'll be coming back!\n \nTip 1: Mondays are buy one get one burgers (beef burgers). \nTip 2: There are taco deals on Tuesdays.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "I commend this place for being of service to the community..you are awesome!  Very rare that a business can serve you with great food and also help save a life.", "author": "Tbaby L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Decent food, amateur service. We liked the menu and interesting cocktails. There are lots of TV screens which is nice if you like sports. Crowd included a mix of ages though mostly friendly hipsters, a few with babies. Chicken and waffles were good--fluffy waffle, chicken crisp on the outside, juicy inside. Flatbread with mushrooms and truffle oil was tasty but smothered in arugula--maybe to hide how few mushrooms there were? Spinach/Watermelon salad nice, all ingredients fresh and ripe, but again, very little watermelon, only a few nuts and tiny bits of goat cheese, and the whole thing was served dry. Had to wait a while to get someone's attention to ask for dressing and when it finally came it was so cold it was too solid to pour. Guys in our party loved the Thai chicken wings. Crab cake had good flavor but too much filler. Waiter pushed drinks when we arrived, ignored us during the meal, then dropped off the check--while asking if we wanted dessert. Huh? We did want dessert but decided not to bother. If I go back it will be to sit at the bar.", "author": "S H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}