{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Came with a group of friends on a Friday night and was seated quickly although my entire party did not arrive yet. Service was great and food came out in a timely manner. I ordered chicken and waffles and this may be my new favorite spot for just that. \n\nThere was more than enough chicken to accompany my waffles and normally, I would finish off the chicken before the waffles. Will be returning soon!", "author": "Cally H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Food was great! Went for weekend brunch and everyone enjoyed what they ordered. Located in a a nice area and great atmosphere.", "author": "Allison E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "Came here a few times 4 years ago when it had an extensive tap list and better tasting food... now their kitchen is down to 1 person or two and 2 people on the floor... really slow and bland food.  Waffles werent very crispy or fresh (cold), chicken wasnt very crispy anymore, grits were flavorless... bloody mary was super watered down and lacked any umph of horseradish, pepper, etc.  Very sad.  Ill miss this place.", "author": "Ben T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Just say yes to Uglyduckling. \n\nI met up with my cousin for an early dinner(?). I had to choose between Uglyduckling and Cafe Luluc, which i like the name for Uglyduckling more (score). We had just missed brunch by 2.5 seconds, but that's ok because Chicken and Waffles are on the dinner menu (yes!). \n\nI ordered deviled eggs for my app, nothing too crazy. My cousin had the mussels. OMG so good, that sauce makes me want to scream. Nice and flavorful. Dip the bread that comes with it into the sauce, a match made in heaven. \n\nMy Chicken and Waffles was the star of the show. Best I've ever had honestly. Waffles not too thick, just good enough for syrup sopping. Chicken seasoned to perfection, nice and juicy, accompanied by spicy aioli sauce (yum). I love spicy. \n\nMy cousin reported that her goat cheese salad with side of grilled salmon was great! \n\nI ordered Sangria which was the flavor of the day. Can I suggest a Chicken and Waffle flavored sangria by Uglyduckling please?", "author": "Bria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Ugly Duckling Breakfast Sandwich is incredibly delicious. It's a waffle sandwich topped with fried chicken, bacon and egg. It comes with shoestring fries that were great as well. It's a very large portion so come with a good appetite! My friend had their chicken and waffles and was very happy as well. Also their pepper Bacon served as a side dish was perfectly seasoned and cooked. The best bacon I've had ever. However, their deviled eggs were so-so. I'm a russian girl and prefer my moms deviled eggs :-)", "author": "Marina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Great woodsy interior with giant chalkboard beer menu and 20-some odd taps.  Servers were all VERY friendly.\n\nHad the chicken \u0026 waffles plus Irish coffee.  The portions are generous and I was seriously stuffed - we delayed our shopping plans because it was so good.\n\nThis is one of my few 5 star ratings because it well surpassed my expectations.", "author": "Forrest C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "If you need grease after a night out of drinking or you just want to stuff your face with something delicious and terrible for you; come here and get the cheddar waffle fried chicken sandwich with bacon and a fried egg; drizzled with maple syrup. It comes with a side of French fries too. I dare you to eat the monster with your bare hands. It's delicious; just do some push ups after.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Excellent choice for dinner. Loved every bite from the roasted beet salad to the very generous portion of the awesomely creamy and delicious  Mac-n-cheese with bacon (oh the bacon!!!) to the excellent recommendation of our waiter for the evening special - fettuccine Alfredo with smoked salmon and asparagus. While feeling a bit skeptical about the flavors (never thought to mix smoked salmon with Alfredo sauce) I must admit it all jived perfectly well, making our taste buds happy little buds. Compliments to the chef! And of course the bartender who made our delicious mules.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Came here for lunch twice. Both times the food and service was amazing! Got the deviled eggs and chicken and waffles and will be back again :)", "author": "Ester M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Foodiwse, these guys are doing really good things here. Had brunch - found the menu to be rather typical. But once the food came out, it was typical done very very well. Good job guys!", "author": "Imran N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "We came in a little tipsy to the Ugly Duckling after seeing one of the last Daily Shows. One of the last good ones anyway. Seating was easy to get but the place seemed vibrant. The owner was strolling around and checking on everyone, and you get the feeling that this place deserves to succeed.\n\nThe menu is diverse and healthy. We found plenty of options for our annoying Whole30 diet. Of course, alcohol is prohibited on the diet, but we drank up more red wine anyway. \n\nThe bill was steep, but we got a great meal of deviled eggs, salmon and chicken. They even tolerated all of our veggie for carb substitutions.\n\nGood luck Ugly Duck, you deserve a spot on Smith.", "author": "Sean B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "First time here which turned out to be a pleasant experience. I arrived around 1:00pm on a Sunday. I opted to sit at the bar, the doors where open it was a nice day. Ryan came over to greet me immediately. My drink of choice was the French 75 which was pretty good. Once my  party arrived we ordered, the food was very good. I would suggest a little more seasoning to the chicken. Overall great experience would return", "author": "Shakirah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-14", "description": "Ordered through Grub Hub the restaurant doesn't take phone orders.  Placed order said it would be here in 30-40 minutes then updated to 10 minutes later.  Then well over an hour went by tried to call the restaurant for 20 minutes they finally answer and say they haven't received any grub hub orders and this is the only way to order.  Also yes when asked had trouble with phones too.  Grub hub called me 4 minutes later and said the restaurant turned off their grub hub just now and was ignoring there delivery orders....   ignoring their deliver orders and he blamed grub hub.  They said no he's just not taking the orders.  So now almost two hours after ordering and nothing.", "author": "Felicia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Foods amazing - wether you go burger or chicken and waffles. So good! Just ordered a Sierra Nevada pale ale on draft which I love but it tastes awful. Based on taste I wouldn't say the keg is bad just the line needs to be cleaned. That's all. Not trying to be the beer police. Just want everyone to try a great Sierra Nevada! Stephen from Ireland - great bartender!", "author": "michael s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "Ok I just left this place. Came in at 215 \u0026sat at the bar for brunch.There were 4 of us. We took about 5 minutes to decide what we wanted to order. We each ordered a entree and an order of deviled eggs to start.\n\nI had a mimosa \u0026 it was delicious. My boyfriend had the ugly mary \u0026 it was the best bloody mary we both have ever had.\n\nHere is the problem. This place has been open for some time now \u0026 should know how to handle a full house on a Sunday for brunch. Your bar is in Carrol Gardens !!!! You will have people coming in constantly!!!\n\nWe waited 1 hour for our food!!! Sat at 2:15 and didnt get our food untill 3:25!! Parties of 2 that arrived after us got their food before us. I'm sorry but an hour wait for brunch food ? Yes the food was delicious \u0026 Yes the bartender kept the drinks flowing, but That is just too long to wait for some chicken and waffles. Anddddd our appetizer came at the same time as our food. I dont understand why simple deviled eggs could not come out before our food since we did ask for it as a starter...\n\nThose that were seated at tables got their food much quicker than we did and I dont know if it is because we were sitting at the bar or If the kitchen was short staffed but for me personally, there is no excuse. For the horrible wait , I have to take a star away.", "author": "Alexia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Myself and friends gathered at this well reviewed establishment to  celebrate a close friends belated birthday. The place is typical small but cute nyc/ cobble hill type restaurant and I think most would  enjoy the food quality and portions, presentation, and very reasonable noise level, even with 3 TVs going. Ducklings first of two missteps came when a friend asked the waiter about cutting a burger for us to share, only a moment after he said he could get us whatever we needed. He seemed to fall out of what had been a relatively attentive and approachable character and blankly looked at us saying \"you can cut your own burger\", in a odd sort of dry tone. Even McDonalds will slice a burger, so we didn't think the request was off as our bill easily surpassed 125.00 dollars. We were then incorrectly charged nearly 40.00 more pp at the end of the night by same waiter which he corrected with no explanation, only after we caught the mistake, and then we left. We won't be back but can fairly see why it's considered a good place to check out and do recommend.", "author": "Cross D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Great fried pickles! Great menu otherwise, too. I'll be back to try more. \n\nGreat beer selection (and helpful list and bartenders for someone who doesn't know much about beer). Loved the atmosphere (floor to ceiling industrial windows that open out on nice days).", "author": "Meg M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-08", "description": "After ordering delivery and being told that the average wait time was 30 minutes, we have been waiting for over and hour and a half for our food (simply Mac and cheese and a salad) to arrive. We have called the place over 10 times, reaching a busy signal only. We have not received any update on our food, nor have we even been able to contact the restaurant to ask if we were getting either food or money back.", "author": "Emily E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Superb customer service.  We were visiting from out of town.  Unfortunately there was a mix-up when placing our online order and dinner wasn't ready when we arrived.  The bartender went above and beyond in making things right by offering us a drink on the house and then eventually comping our dinner due to the long wait at a busy hour.  Never once did we have to complain or ask for anything additional.  And our dinner was amazing.  Would strongly recommend.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Have you ever gone out to eat and the experience of trying a new restaurant and chatting with friend made your day?\n\nWell, eating at the Uglyduckling was such an experience. Although the place is a bit small, it's just right for a small group or brunch/dinner between great friends. The Uglyduckling is a restaurant nestled on a block filled with many other great eating options but what makes UglyDuckling so great is everything about it. Once you arrive, you will be greeted by a friendly wait staff and a restaurant ambiance that that will make you feel as if your eating in your own home. \n\nAs for the food, I enjoyed the amazing French toast, stuffed with an amazing filling that I can't recall right now but the whole dish came together very well. Especially with the fresh fruit that garnished the dish. \nI so enjoyed my meal and my very good friend did as well. He enjoyed a plate of very well seasoned chicken and waffles. \n\nI will, recommend UglyDucking to my friend and others.", "author": "Percy H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}