{"aggregateRating": {"reviewCount": 443, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Uglyduckling holds a special place for me - it was one of the first restaurants we went to when moving to the neighborhood 4 years ago, and we've been over a dozen times since. It's one of those Smith St. staples that I hope never goes away. If we're ever looking to eat out and we don't have a specific place in mind, my default is *always* Uglyduckling - a very solid 'A' across the board: layout, ambiance, service, drinks and food. This place is great for a casual dinner or to catch a game -- and even though they have a handful of TVs and throw up a game if one is on, I wouldn't describe it as a sports bar and it doesn't have the typical downsides of one (e.g. TV volume not too loud, doesn't attract a rowdy crowd, etc). In terms of food, their Chicken \u0026 Waffles is my go-to -- always good.", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "Went here for a quick dinner with a gal pal and I was pleased to find out there was a happy hour menu INCLUDING food. \n\nSpots like this makes me extremely happy because a lot of places only have drinks as happy hour (I'm from the west coast where food is always common on HH menus). \n\nWe didn't order any drinks because I'm doing dry January but they had good steaks for IPA beers and wine. \n\nWe ordered: calamari, two fish tacos, flatbread and a salad (regular menu). \n\nI wasn't too excited about the flatbread, it was served nicely but something about it tasted a little off to me. Tacos and calamari were great and so was the salad.\n\nI've been here for brunch and that is yummy too. also, reservations can be made through yelp easily. All about efficiency!", "author": "Chary S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "2 1/2 stars realistically. We came here based on the great Yelp reviews, and i'm not sure why they are so highly rated based on my experience. I wouldn't be back. \nI was hoping for much more. Upon arrival we were promptly greeted and the waitress tried to seat us at a communal table. I'm not sure if there is anything I hate more than communal seating. I'm not spending $40 a head to be crammed up some strangers butts whom i've never met, nor do I want to hear their entire conversations. \nI asked for a non communal table and luckily a couple were open \u0026 we were accommodated otherwise we'd have gone elsewhere. \n\nOnce seated, we ordered two drinks. They came out very quickly, accept that I had ordered a glass of red wine and a glass of white was sent to me. The waitress quickly took it away, but it wasn't replaced with what I actually ordered for a good while. The red that finally came out was on the tart side and near being spoiled. Since I used to be a waitress, I never like to send stuff back unless it's totally undrinkable, so I dealt with it. \n\nWe ordered our entrees, mussels and the shrimp and grits pretty quickly after. These also took forever to be served. Upon seeing the presentation, I was quite impressed with the mussels. The shrimp and grits were just ok looking. Upon diving into the dish with my fork I was shocked to find how shallow it was and how little food portion was there for $21. \n\nI hoped it would be good enough to make up for that but it wasn't. Honestly, this was about as flavorful as sucking of a cardboard box. The shrimp was completely flavorless and the entire dish was under seasoned. The mussels were far better than my dish, the broth that they came in was the highlight of the meal. The vibe in here was a lot of people looking up at the hockey and sports on the tv's which is not my thing. \n\nOverall, this dinner was just really disappointing on many levels given our expectations.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-03", "description": "Really great spot in BK! Came here for Sunday brunch with a friend and was pleasantly surprised with the food. Got the chicken and waffles (of course!) and it was DELICIOUS. Really better than expected - chicken was juicy and tender (no bone either which I like) and the waffle was sweet and fluffy. The dipping sauce for the chicken was also delicious - really good! \n\nThe drinks were solid but expensive. I got the Irish Coffee - which was literally just whiskey with some coffee and whipped cream. But actually tasted pretty good! Then we got the Guy's mule which was so good and refreshing. Really nice drink!\n\nThis isn't a lively brunch place, though. At least on Sundays. So if you're looking for a place with a fun, energetic vibe, this is not it. It is way more low key and you can actually catch up with whoever you're dining with. \n\nThe service was good at first but once more people came in, it slowed down. I would just be more attentive to your customers throughout their whole meal. But, overall, okay service. \n\nAwesome place. Would recommend.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-13", "description": "My second time here and i'm even more impressed with the food then i was last time. The staff is very polite, attentive, and have good energy. The cocktails are very good! The Cool Duck \u0026 the El Patito, are smooth! The food speaks for its self. The chicken and waffles are amazing , the mac and cheese is one of my favorite , the additional 3 dollars from the sides is worth it. The Burgers are really flavorful, ordering the peppercorn steak as we speak and the Chicken Capriccioso. I can't put this Cool duck down it's so unique, and i practice mixology as a hobby. The steak was very well prepared , the flavor was well balanced , the type of beef they used , sliced and med well just like i asked . The Chicken Capriccio was cook perfectly, the fresh greens and  mozzarella cheese made a great combination. Overall i'm looking forward to brunch again, and trying the rest of the menu. The owner was kind enough to tell us the specials ! He did not disappoint !", "author": "Ricky F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-07", "description": "Been to ugly duckling twice. And twice had an ok experience. The food is okay. The first time I dined in with a friend I had to go back k through my camera roll to remember what I ate. I had the shrimp and grits and my friend had chicken waffles. They were alright nothing too memorable. Ok at best. I went back alone months later to give it a shot. I had a burger. Again nothing too memorable. Wouldn't go back for thirds. Sorry.", "author": "Karla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "So happy to see good food and service return to the neighborhood!\nStopped in for the first time in over a year and I was certainly impressed! Greeted by friendly servers immediately, and definitely a cute to bring a date!\n\nPasta San Paolo, the duck liver terrine, and the s'mores are all amazing!\n\nI'll definitely be coming back!!", "author": "Matt J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "Lunch/dinner food here is amazing. I loved the bacon mac and cheese and fried chicken and waffles. However, the brunch leaves much to be desired. First of all, when I order steak and eggs, I don't want gravy all over it, especially when it's not mentioned anywhere on the menu. If I had known it came drenched in gravy, I would have asked for it without or just ordered something else. The steak cut was also a strange choice for brunch. It felt very dinner-like, not something you would eat with mimosas. Staff and atmosphere are cool, and prices are great.", "author": "Amiee O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "Everything we ordered here was excellent. The cheese plate had some really great cheese. The shrimp and grits amazing! Flounder the sauce made it taste  not just like fish but something else. it was great! Totally recommend", "author": "Ken S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-07", "description": "Came here around 2pm on a weekday and we had the restaurant all to ourselves. We ordered from the pre-fix lunch menu they had. For starters we got the friend calamari and the chicken BLT for the main course. The calamari was a bit salty but the chicken BLT was delicious as the grilled chicken breast was well seasoned and flavorful. It comes on an Italian roll, I would have preferred a different type of bread (egg or brioche) but it was still good. I also asked for a mix of lemonade \u0026 iced tea.. it was ehh. Overall it wasn't a bad experience.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-08", "description": "Decent food. Seemed a little thrown together with not much technique. A little too expensive considering the ingredients.\n    one quite annoying thing was they didn't have change of $100 bill even though it was crowded in the restaurant and at the bar. they suggested that I walk a block and a half to rite aid if I need to change. Very unprofessional.\nI will not go again, there's too many other options in the  area.", "author": "Matt L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "Don't try it !! \nThe waitress was really nice and trying her best she really wasn't that knowledgeable on the menu but she did try \nWe had the meat and cheese platter not sure why but they used season bread (meaning they seasoned the bread with some adobo which is so weird)  we also ordered the mussels which were very bland (with the same season bread lol  ) \nMy girl friend ordered the chicken with mash potatoes the chicken was not well cook but the mash were very good creamy and garlicky \nI had the steak frites which was cold and dry \n\nI really don't suggest that restaurant but you won't know unless you give it a try", "author": "Myrisse D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "My friends raved about the Mac and cheese here so we decided to come here on a Friday night. We made reservations but saw that there were a lot of empty tables. Maybe it was too cold? \n\nGot the crab cake as an appetizer. It was absolutely delicious and the greens were tasty. However my friends said it would've been better if it was a bit more lumpy. We also got the fries to share. Didn't expect it to be so thin. Wasn't that great flavor wise. \n\nI got Mac and cheese which is a side for myself. I wasn't too hungry and I'm a small eater so it was the perfect portion for me. I must say it is one of the better Mac and cheeses I've had in awhile! I do recommend this  \n\nMy friends felt the food didn't taste as good as the first time they came here. \n\nThere were two servers and they both asked if we wanted some alcohol. When we told the guy no, he was surprised considering that it was a Friday night. Felt a bit pushy and judgmental. I mean good thing we weren't recovering alcoholics \n\nFound parking a block away.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "I ventured out to Brooklyn one day because I was told to check out this restaurant. Now me traveling outside of Manhattan is a big no no for me but I thought why not it's nice out let's check it out. When I got here it's your typical Brooklyn restaurant but with a twist, I loved the booth seating and open space. We stared off with the fried pickles...hands down I loved them! We also tried the cucumber salad and although it doesn't sound like much it was AMAZING, I would definitely order it with shrimp next time. The garlic bread was also good and I loved that it was on the perfect bite sized bread, this made it easy to share. We also had the calamari fritti, this was freshly fried which is really good but be careful they also have it mixed with fried jalapeños lol not funny because I don't like much spicy food. By the time our main course came we were so full but still very happy with our choices. The service was good and the manager there was very attentive to his clients and the staff, this is very important to me because you know he is paying attention to every detail. \n\nWe loved the place so much that we decided to host a dinner with a bigger group of people and they accommodate us so well that we will definitely come to Brooklyn more often. Love love the vibe here and the chill setting! Thanks Uglyduckling for making my trip to Brooklyn memorable!", "author": "Sarah V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-12", "description": "I really want it to give it a 5 star but I can't.\n\nWe walked in around 3:30pm (odd time, I know) and was informed that the brunch menu ended and the kitchen is not open yet for dinner. We were offered to sit at a table until the kitchen opened back up in about half an hour or come back. We decided to sit at a table because we were with friends we haven't seen in awhile so no big deal to chat with them in the meantime (plus it's freezing outside).\n\nThings were going well. We were introduced to our waiter Andrew who said he'll be taking care of us for the night. Good intro and was digging the vibe of the restaurant (loved the decorations). He took our drink orders and everything went well. Later he came back when the kitchen opened up and took our dinner orders. \n\nShortly after, someone else came out with our food from the kitchen. He brought 3 plates (probably max he could carry) and came out with the last plate (mine) 2 minutes later. No big deal except it was shrimp and grits and that's not what I ordered. I gave him a confused look and told him that wasn't mine. I saw him walk over to Andrew to talk about it and saw him walk back to the kitchen. During this time, I never got any communication. No \"we're sorry\" or no \"what'd you order again...?\" or no \"we'll be working on fixing your order right away.\" NOTHING. \n\nSo I told my friends to start eating and halfway through their meals still no one from the restaurant was letting me know about what's going on. Should I be even expecting my dinner at this point? Eventually my boyfriend asked the other waitress since it looked like Andrew turned into the bartender and never came back to our table to check on us and never told us he wasn't taking care of us anymore. We politely asked her if she knew what was going on with my meal.. is it in the works at least? She went back to the kitchen and came back out and never gave us any update. Okayyyyyy....\n\nEventually when all the friends finished eating their meal, my dinner finally arrived. So I ended up eating it while everyone else watched me. \n\nI don't mind that the restaurant messed up my order (it's not great but it happens...). I'm more upset of how they handled it. No apology and no communication of what's going on. Because of the horrible service, I was expecting to see a discount for my meal or even comping it. Not even that. \n\nAnyway I give it a 1 for service especially given it wasn't a super busy night. I'm only adding the additional star because the food was legitimately good. I ordered the short rib grilled cheese, comes with side of fries.", "author": "Mabelle L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-06", "description": "This is a brunch review.  Under cooked waffle, fried chicken lacking crunch. Generally not tasty food.\n\nThe atmosphere was not warm or cozy despite all the wood paneling.\n\nThis restaurant could be anywhere where mediocrioty reigns, i.e the suburbs, Tampa, you name it.", "author": "Stef G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-21", "description": "S- Service was a 5 employees were on point with request and checking on us.\n\nT- Timing was a 5 the food was prepared and served at decent intervals, It didn't feel rushed.\n\nA- Appearance of the venue was a 4 the space had an industrial touch to it and the setting had a nice ambiance for brunch.\n\nF- Food was a 2 surprisingly the menu did not appeal to our tastebuds, but the selection was mouth watering to draw attention.\n\nF- Frequency, would I return again was a 2, the food really set the score down for this place. Unless I'm getting drinks before meeting someone close by i'm not likely to return. Overall a solid 3 in our opinion", "author": "Derek Athena A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-28", "description": "Okay, honesty is my policy. Don't let the stars be a reflection of my perception of the food because i thought the food was tasty. The three stars is because i thought the restaurant was overpriced and they didn't have two of the drinks I wanted (clearly subjective here) so low on stock in the L section. My friend and I shared the rib tacos and chicken wings. Both were pretty good and served hot so no complaints there. I had the the shrimp and grits which I was told was a popular plats and I was NOT disappointed. Everything from portion to flavor was on point, so again the stars are not an indication of meals' taste/quality more of the other factors that make up the eating-out experience. Ambiance is chill and not loud; good spot for a date or lowkey plan with friends. I would suggest to keep it to a small group because it didn't appear to be a big-group type of spot.", "author": "Caroline G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-20", "description": "Chicken and Waffles! \n\nCame here for dinner and ordered chicken and waffles. Definitely not disappointed. Delicious waffles. Buttery, crispy, and fluffy. With a generous splash of syrup that waffle is out of this world. The fried chicken was definitely dark/white meat which made it all the better. Super crispy crunchy battery wrapping a  juicy/tender piece of chicken. \nI would come back just for the chicken and waffles. \n\nOn the other hand, my apps were pretty good too. The calamari salad was unique. Crispy calamari tossed with arugula and olives in a nice vinaigrette. Great start to a heavy meal. \n\nGreat spot to grab a great bite to eat!", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Thanks to Alex and Jason service was superb! \nJason is the bartender who makes marvelous drinks and also has patience to inform you on ingredient that would be more to your liking depending on your preference.  Alex is the waitor who also does the same with food . Best combination both qualified in making things happen your way. I had a pleasant experience on a Friday afternoon", "author": "Kez G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Uglyduckling", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/C1lGcRxbITOSR2hDs9o5JA/ls.jpg", "@type": "Restaurant", "telephone": "+17184513825"}