{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "The five star review is for their GLUTEN FREE pizza.  I've been trying a bunch of different places in the city and this is by far the best GF pizza I've had so far.  Tastes like normal pizza!  My husband happily eats it and he isn't avoiding gluten.  Also really liked the meatball appetizer.  Great option if you're in the neighborhood and don't want the regular Montague Street choices.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-06", "description": "Place is very cute. The pizza is alright. It would be really good if they would stop burning the bottom. I went three times but the story is the same. Other food is good! Nice staff as well ;)", "author": "lena p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "The other reviews aren't wrong; lovely service, deliciously thin / foldable pizza (where the only downside is that you might end up eating more than you had intended to), and peroni is on tap (hey I'm from London don't judge). I reckon this is as good as a pizza place can get in my new 'hood .", "author": "Sadiq B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Tara was our waitress and she was great and very sweet. My mother and I shared a salad, it was huge and tasty! We also shared the bruschetta pizza-YUM! We also ordered the tartufo which was also huge and AMAZING! I also recommend the iced coffee, so good! Great view, great food, great service, and great prices!", "author": "Amanda J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "They just added gluten-free pizza to the menu. It's tasty, and also an extra $4 per pie.", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Always amazing! Free delivery in BK Heights, order online off their website. They have a pizza with truffle oil that is absolutely amazing! Don't like truffle oil? This pizza will convert you.", "author": "Margaret A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Dellarocco's is a great pizza place with a pleasant ambiance and delicious pizza.  Finding good gluten-free places is a difficult task even in Brooklyn and NYC.  Finding the spot harkens me back to the days when I was not on a gluten-free diet.  You can barely taste the difference in a gluten-free pizza compared to a non-gluten free pizza!  My non-gluten free husband even thinks the gluten free pizza is outstanding.  The margarita simple yet divine is a great choice for those that want a great no frills option.  It's in a great area of Brooklyn heights in which you can look around and shop while you wait for a seat.  Definitely worth trying for all those GF-ers out there!", "author": "KT S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Atmosphere is cozy, service is wonderful, food is always delicious! Meatballs are heaven!", "author": "Johanna E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Met a friend for an early dinner and drink before watching a film at Brooklyn Historical Society nearby. Super cute and cozy.  A very Brooklyn feel.  Margherita Pizza is yum, good for two of us and we ordered a crustini appetizer.", "author": "K R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "Best pizza ever! I've been to New York five or six times and have been in search of the perfect pie - this just might be it. Totally worth the trek. We had the arrabbiata, and it was the perfect blend of salty/spicy. Love, love, love.", "author": "Kristen T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-04", "description": "Ok. Not great. Can someone explain to me why it's so hard to get decent takeout in this affluent neighborhood? You'd think...", "author": "Hal G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Brooklyn Heights needed a restaurant like this one. Sottocasa, Forcella and Grimaldi has nothing on this place. At the end of the meal we went to meet the chef who then told us that he is from Naples big big guy.....and so funny\n\nI am giving Dellaroccos 5 stars because the food was amazing !!!!", "author": "Peter F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Delicious!  They make whatever pizza I want without cheese (dairy free).  Always friendly and helpful there.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "Great pizza and a really clean and nicely coordinated environment. The Graeco pizza is wonderful and fresh and the pizza equally delicious. I would definitely recommend trying this place out if you're in Brooklyn heights on Montague!", "author": "Nicole A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Phenomenal! Just ordered a gluten- free pizza from them for the first time, having passed by the shop many times.  Funny that we can get gluten- free pizza in the hood, but no gluten free beer for blocks.  Sadly, Dellarocco's says they can't deliver beer....really happy to find such sophisticated gluten free nearby.  And I look forward to having a meal there with friends.", "author": "Jane S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "This is a terrific addition to the neighborhood, and would be in any neighborhood. The food is that good. I've been twice, and each time had a delicious meal, salad, pizzas, wine and dessert. The pricing is on par with most other restaurants of its kind. The interior is clean, and modern yet not stark. Stylish and comfortably casual.\n\nI have two complaints...one fixable, one likely not.\n\n1) The positioning of the tables...we were a table for two, and the position of our table was such that my friend kept having her coat knocked off, and her chair banged into by servers and patrons being seated. It got a little absurd. We even scooched our table over to try to make more space...but it didn't seem to help much. For whatever reason, there wasn't a wide-enough pathway for folks to pass-by, and they kept using that route anyway. I get that this is NYC, but this is an avoidable problem. They need to look at reconfiguring some of the table placements to avoid this problem. Fixable.\n\n2) A**hole Brooklyn Heights parents who let their kids run around the restaurant unchecked, and yelling. We were there early-ish on a Friday evening - about 6:30 PM - so family time, I get it, but c'mon... two moms who were there with about 4-5 kids, and some of the kids were running around to all the different tables, and then the littlest was just wandering around their own table SCREAMING...and the moms, completely un-phased and even bemused...there was once a vague, off-hand \"honey, stop that...\" Seriously? Ugh. BUT, considering the nabe, I doubt this one is fixable...though that didn't stop me from trying with a few pointed glares. Yeah, I'm that person. So what?", "author": "Day H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "I wouldn't call this NY pizza, but it was delicious and Italian style. I literally have no complaints about anything in this place and with all the pizza joints in NY, that's truly a compliment. Great service, cute place, well seasoned and sauced pizza! We had a regular cheese and a prosciutto pie and both were terrific. Highly recommend checking this place out!", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Great Brooklyn Heights find. Tasty/authentic brick oven pizzas and cozy atmosphere. Great pizzas. Can't comment on the salads as we didn't order, but saw several at adjacent tables and they looked delicious.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-18", "description": "Really love the pizza here, but when the person at the front forgets to bring your pizza after waiting 35 mins for takeout outside the front door... Makes you question the service.", "author": "Sean H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "An excellent place with excellent food and first rate, friendly service.\n\nNeeding to take a break from a fairly long walk, we found Dellarocco's of Brooklyn. Unlike some of the other reviewers, we hadn't heard of it at all.\n\nThere was a nice vibe immediately upon walking in. Sort of trendy but balanced with a family friendly feel.\n\nOur waitress was all smiles, enthusiastic and efficient. The restaurant was highly staffed for that time of day, which was late afternoon. When we arrived, there were only a few tables occupied but by the time we left, it was one hundred percent full.\n\nThe food was far above what I was expecting.\n\nWe started off with the Meatballs Napoletane and the Bresaola salad.\nThe meatballs were four small homemade style meatballs. The rich but delicate marinara let the flavor of the meatballs come right through. The Brasaola sald was a delight. Thinly sliced braseola, shaved slices of a well made parmigiano and arugula that was lightly dressed in a gentle lemon vinaigrette.\n\nThe pizza was close to perfect. Our first was the Arrabbiata that had hot soppressata as one of the ingredients. You could taste the quality and freshness of the tomato through the other spicy flavors. It could have been just a tad hotter for me but that's not a complaint whatsoever.\n\nThe second pizza was a clam pie and was surprisingly good. High in clam flavor and enhanced with the freshness added by the cherry tomatoes and parsley.\n\nThe ONLY thing I would improve upon would be that these particular pies would have benefited from a slightly more defined crunch in the crust. ONLY Slightly.\nI am sure that when I get there again, if I ask for that, I will get it.\n\nThe wine selection and the beers on tap are thoughtfully chosen and appropriate. The day was hot and I had a superb chilled rose' that I am still thinking about.\n\nI look forward to finding a reason to get back to that neighborhood soon, just knowing I would be able to eat there again.", "author": "Edward -."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}