{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Big fan of the eggplant parm and meatballs. Pizzas are unbelievable but the eggplant parm is Hall of Fame material. I'd put it up against any place in NYC. Best pizzas are probably the tartufata or zucchini, but honestly every pizza that we have tried has been phenomenal.", "author": "Clio M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "Fact: I love Dellarocco's personal Neapolitan-style pies!\n\nWell maybe they aren't technically personal pies but I eat them as such... and I kind of hate sharing pies that are less than 16 inches in diameter. I've gotten into a horrible/amazing habit of going here after my long runs and just devouring one of their delectable pizza creations within 10 minutes. Oops.\n\nJust check out their menu and you will see that they have a pizza for everyone with an assortment of red pies as well as an impressive assortment of white pies. I always get the Arrabbiata pizza which comes with mozzarella, hot soppressata, fresh basil and spicy extra virgin olive oil. It's got a small kick which really just warms you up all over and tingles your lips. It really hits the spot.\n\nThey also have some great appetizers (hello juicy meatballs!) and Brooklyn Brewery beers on tap plus a good assortment of wine. It's supposed to be a pizzeria and wine bar. Great hybrid. The space is also pretty casual nice (they combined two shops so there's ample space for groups of any size) and it is kid friendly. Management is great.\n\nDellarocco's is definitely my new favorite pizza spot and a wonderful addition to the Brooklyn Heights hood! Go check it out!", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Friendly staff, cozy place, nice neighborhood, really nice food and awesome pizzas! We had a white pizza (i.e. no tomato sauce) and it was super good! The bread and crust was perfect and the toppings fresh and taste. Even the arugula (or rucola, as I'm used to call it in Europe) was crispy and tasty.\n\nStaff seated us immediately (no reservation), were very attentive and delivered the food immediately. Overall, a really nice experience - recommended!", "author": "Stefan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Awesome gluten free pizza! Friendly staff, warm ambiance, great Brooklyn Heights spot.", "author": "Natasha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "Beautiful place, excellent pizza \u0026 menu, Modest prices,\nFriendly service \u0026 great location, I would defiantly return even though parking is scarce in that area of Brooklyn Heights", "author": "Michael R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "I love pizza. I will eat pretty much any pizza, even frozen pizza is edible in my book.\nHow unbelievably happy I was to discover Dellarocco's and it's a block away from my apartment. I ordered delivery ffrom them a couple of times and was like \"wow, this is good pizza\". Last week, I finally went with my daughter to celebrate an occasion and ate at the restaurant. It is a comfortable space, with very attentive servers. We ordered the Tartufo pizza which has mozzarella, Gorgonzola, shiitake mushrooms and truffle cream. We were both in heaven and vowed it was the only pizza we would ever eat again. The other notable menu item is the eggplant parm...it;s like no other -- truly the best I have ever eaten. We took what was left over, which was not much, and ate it cold the next day. It was that good.", "author": "chris g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "Located in Brooklyn Heights, Dellarocco's is a small pizza shop with a varied menu.  In addition to a small selection of appetizers and salads, it offers red and white pizzas, as well as calzones.  My group ordered two salads and a porcini mushroom pizza.  The salads arrived quickly and were delicious.  Our pizza was light and tasty with fresh ingredients.  We ended our meal by splitting an order of cannoli. \n\nWe arrived early on a Sunday, among the first customers.  However, by the time we left, the restaurant was nearly full.  The service was pleasant without being overbearing and we all enjoyed our meal.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "Get to the Chase:\n\nPros:\n1) Easily accessible from both Manhattan and Brooklyn (N/R, 4 and 2 trains all within 10 min walking distance)\n2) Pizzas are not overly greasy or oily; They are freshly made and some are quite delicious.\n3) Waiters are polite and attentive, but not annoyingly so\n4) Unpretentious, and quaint decor (perfect for both dates and groups)\n5) Desserts are knock-outs!! Lemon sponge cake and tiramisu! YUM! Could eat all day, and wish the portions were even bigger\n 6) Won't break the bank! Which is why I love brooklyn places like this (they don't succumb to the ever-increasing popularity to drive their prices up)...5 pizzas, 2 desserts, couple of drinks split among 5 people came to $25ish/person which includes 20% tip. \n7) Citi Bike rack is right next to it\n\nCons:\n1) Not all the pizza's are knockouts (i.e. arrabiatta...just tastes like a pepperoni)...some are kinda what you can find anywhere else", "author": "Sumito A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Having just completed a lovely pizza tour of the neighborhood, I can say with certainty that this pizza is amazing. Had the capricciosa and the crust was superb, charred and chewy in all the right places. The toppings only complemented the crust and overall, the pizza was delicious and well-priced. A highly recommended neighborhood gem.", "author": "Anna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Yes this place is great the pepperoni pizza is spicy and. great the cheese pizza is a little to much cheese. it's not good it's awesome.", "author": "Reed M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Yum yum I love this place! \n\nI went here for my mother's birthday and everyone loved the food!\n\nThis pizza place has a great quaint rustic aesthetic with a visible pizza oven in the back. I loved watching the pizza coming out while waiting for my food!\n\nThe pizzas are on the smaller side so we got a few to share, plus the caprese appetizer, which was fresh and delicious. My favorite was the veggie pizza but the classic cheese was great, as well. I also enjoyed the Nutella dessert pizza at the end!\n\nThe service was wonderful, as was the food. It's a little on the pricier side but that's to be expected for the quality, so I'll definitely be back to treat myself!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-18", "description": "Expect a long wait for food.  The arugla salad was delicious.  Had the pizza with clams.  There was maybe one clam that had been cut up and sprinkled over the whole pie.  Dough looked uncooked and was soggy and limp, except for the outer crust which was yummy.  Bathroom visits were a must after this mess.", "author": "Laila B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-27", "description": "Wow.  When did a slop of marinara = cherry tomato sauce?\n\nI ordered a \"Siciliana\", listed clearly on the menu under \"Red Pizzas\" as \"Cherry Tomato Sauce with Eggplant, Smoked Mozzarella, Shaved Parmigiano\".  I asked for no mozzarella, due to lactose issues.\n\nPizza arrives with chunks of cooked eggplant and shaved parmigiano.  Um, cherry tomato sauce?  So I flag the waiter and ask whether it was supposed to have tomato sauce?  He goes away, I see much fluttering in the kitchen and he returns with the same pizza with a spread - no, a SLOP - of marinara sauce spooned over the top.  At least half a cup's worth.  He asks if it's OK that they just added marinara on top.  What??!!?? I was speechless.  And truthfully, STARVING.  So although I probably should have sent it back, I just took it.  \n\nBut really?  Why would you DO that?  I can't believe they would completely ruin a beautiful pizza they just cooked that way.  So much for the crust.  And so much for my belief in the professionalism of the kitchen here.  So sad.\n\nTwo stars for the lovely arugula salad and the four glasses of wine.  And our waiter, who was perfectly nice.", "author": "JW B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "Cary C. took me here during my birthday week to celebrate. We got the gluten free White Pesto pizza to share. The portions were tiny but full of flavor; we debated getting another pie but opted to share dessert instead. Dessert was meh so I wasn't too thrilled w/ it.\n\nDellarocco's interior design is really airy and spacious with generous gaps between tables to move around. We we seated near the ovens so it was very warm during our meal- an overhead fan might be a good idea to install near the kitchen. Bathrooms were clean and sufficient.\n\nPizza was really delicious but super $$$ for the size. Brooklyn really has gone the way of the 1%. All political statements aside, it's a place to get good gfree pizza.", "author": "Ro C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "I had a really good lunch here today. I started off with the spinach and goat cheese salad. My bf ordered the meatballs. Both were amazing and were much bigger than we were picturing because we weren't very hungry for our pizza. We ended up getting the four cheese pizza and overall that was good as well. I would have been full and happy with just the appetizers. Would definitely eat here again.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "I've been here eating in and taking out and the pizza and service is consistently very good. My favorite pizza is the capriciosa I LOVE it it's so delicious! My friends love the margarita pizza. Order take out easy phone call and they always arrive within 20 minutes. Not 5 stars as the pizza can be a little soggy in the middle. Tho it's delicious and definitely my favorite pizza place in Brooklyn!", "author": "pamela b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "Cozy simple decor with oven in the back.  My four cheese pizza was delicious and went well with a glass of red (gotta stay down to earth while trying to be classy, muhahaha).  The arugula salad was refreshing, and again paired well with the pizza.  My date's sausage pizza was also good.  It was a perfect date night with my pizza loving husband.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Heavenly pizza!  The lively dough is shaped when you order into a 12\" round which is remarkably thin. Our Pizza Dellarocco was delicious with sausage, peppers and broccoli rapini while a second house special was spicer and even more wonderful.  Service was prompt, and gluten free is also available.  The place has a broad and exciting menu of salads and starters as well, but one look at the big red hearth oven made pizza irresistible.", "author": "Nancy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-17", "description": "Called to get delivery, and the person who answered the phone couldn't have been more rude. \n\nDo you deliver? No, 5pm.\nOk, but you do deliver? No, 5pm.\nI understand you start delivery at 5, where do you deliver? BK heights.\nHow far do you deliver to? BK heights. \nSir, how far do you deliver to, what is your boundary? No dumbo.\n\nThen he hung up.\n\nCalled back and he hung up again. \n\nThis place has horrendous customer service and the pizza isn't worth putting up with their attitude. \n\nThanks for hanging up on a customer and we'll be sure to spread the word through the neighborhood of our experience.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Best Pizza ever. Love this place in the neighbor. The ingredient is very fresh and perfect size. The crust is amazing. Whatelse you would ask for pizza.", "author": "YO Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}