{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "The food here is really fresh and delectable. Excellent and truly underrated pizza with light doughey crust and flavourful sauce, plus whatever toppings come on each specific pie, amazing salads (spinach and goat cheese with mango and pistashios is my personal favourite), and a decently priced wine list. Desserts are not their strongest suit, but my standard for those is ridiculously high and in any event that's not why I come here. Service is good for the most part. The space itself is light and airy. It's not cheap but one feels that the ingredients and the quality of the food are worth it. \nOverall it's a good dining choice.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "We were here for the Photoville exhibit and were hungirily looking for a nice place to eat. We got the margherita and Siciliana pizzas. The margaherita was not as good as I have had before but good nonetheless. I really like the Siciliana pizaa which my mom got. Will def go back if we are in the area.", "author": "Mehwish K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-24", "description": "Don't get it. Please explain to me how pizza that's burned on the outside and soggy and soupy in the middle is acceptable and even applauded. I'm guessing the oven is too hot. But I just don't get it. Another place on Atlantic the same problem. If this type of pizza is your thing, then this is the place for you. Salads were decent. Thought we had found another go-to spot as we've lived in the neighborhood for years (my husband all is life) and my daughter loves pizza...but no. Very disappointing.", "author": "S V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "This is a great place to enjoy a glass of wine and a nice intimate Meal. The pizza was perfect, and the staff was very friendly.  Love the walk across the Brooklyn bridge and straight to the restaurant. Grabbed an ice cream afterwards. Amazing!", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Excellent pizza! I spent 13 years in the pizza business. I had their gluten-free pizza with a friend. I couldn't tell it was gluten-free. The crust was chewy and airy like a traditional crust. Definitely on my return list!", "author": "Pasqualino I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "I've passed this place many times, sometimes considering going in, but for the most part, just imagining how other Italian places would provide a more unique experience. There is not much street appeal to draw in the unassuming pedestrian, but the simplicity of this pleasant pizza cafe makes the dining experience all the more memorable. I initially walked in asking if they had coffee and they responded \"No, but we have espresso\". That'sx` when I knew...Everything about this place was right. Authentic, genuine, and artful from the service to the band of goombahs tossing dough by the brick oven. How could I have overlooked such a charming establishment? There is only one person to thank for bringing Dellarocco's to my attention and that is the lovely blonde-haired boy/man who felt so inclined for some pizza on such a hot summer day. The boy/man chooses to withhold his identity due to the contention of this yelp review. Anyway, the indulgence of his presence may have skewed my perception of this culinary exploit. As we shared our prosciutto argula white pizza, each bite became more enjoyable with the lightness of our conversation. I could go on with the irrelevant details of my company, but for now I can only advise the creatures of the Yelp realm to not simply glance past the average appeal of the Dellarocco awning. Maybe instead take a step inside, even sit down (!), and let the enchanting Italian service and fresh oven feels take you away! Thank you", "author": "Katie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-01", "description": "I was decent, but the pies are way too small for the money. You can walk down to Julianna's or Grimaldi's and get so much more for your money with better quality. It seems like a lot of these small brick oven places are opening in Brooklyn heights to compete, but they all come up short, either in quality or price. Stick with Julianna's or Grimaldis. Much better.", "author": "Scott D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "This place makes good pizza! I would only dine-in though. I tried to have it to-go one time and it was soggy by the time I made it home. The bruschetta and zucchini pizzas are my favorite. The crust is crispy and thin, but not too thin. It's just right. I've tried most items on the menu and I felt all have been pretty satisfactory. I recommend the tartufo gelato or tiramisu for dessert.\n\nThe restaurant itself is a cute little place. The staff is also very friendly.", "author": "S C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-09", "description": "Generally really love this pizza but tonight I think they served me a pizza that had been laying around for a bit.  Why? It was ready before I could take off my coat to have a beer and it was already cold and soggy after walking home a block. \n\nToo bad. Lost a customer.", "author": "Tania P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "I love this place.  First of all, they remember me and act like it's a special occasion when I return--just the kind of feeling you want to have for a pizza joint in Brooklyn.  But this one is special:  because, for the most part, I can't eat pizza anymore.  Since having to go gluten-free two years ago (I'm one step away from Celiac disease--) I have adopted a very Paleo diet....Most substitute foods are complete crap, so I eat a salad for dinner every night at home, and--for the most part--stick to meat and potatoes when dining out.  But Dellarocco's has a gluten-free crust that is truly delicious!  I feel like a normal gal here and can get my \"comfort food on.\"  Whether on a warm spring evening or in the depths of winter, Dellarocco's is delish!", "author": "Sandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "I am so glad to have Dellarocco in my neighborhood.Their pizza is comparable to Grimaldi's pizza, maybe better. Everything is very tasty, especially the white pizza is my favorite.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Perfect neighborhood pizza joint.  The Sicialana is sublime.  Great staff. Yelp making me write more words to count as a review.", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-13", "description": "In a word: Wonderful.\n\nI read the other reviews before I went and this place gets reviewed on the pizza. Trust me on this: It's the other stuff you really want to try. Such as the knockout caprese salad, um... on a stick. Or two sticks to be precise. It comes on skewers and there's olive oil should you wish to dip your caprese bits in there. I didn't think it needed it, the tomatoes were bursting with flavor and the cheese was soft and delicate. Perfection.\n\nI chased it down with an order of meatballs. Perfect meatballs and I swear I could taste Italian grandmother's tears in them. Four, in a big bowl slathered with red sauce (meatballs, not grandmothers).\n\nI had a chat with the staff and it turns out that much of the stuff they use to make your food is honest-to-goodness imported from Italy. Obviously you can't get the fresh stuff anywhere but from local sources but whatever they're doing works very well. They were all eating lunch and trying out new stuff that didn't look like it had made it to the menu yet. Excited to see where they take this place.\n\nThe decor still has a sparseness about and there's almost that new restaurant smell about the place. It's wonderfully airy, modern, and bright.\n\nPeople love to moan about Brooklyn Heights being a culinary meh-land. Maybe they need to vote with their mouths and start eating at great places like this.", "author": "Jules A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Brooklyn Heights' rule of culinary mediocrity has a few exceptions, and Dellarocco's is now one of them.  Molto bene!  \n\nThis is not, repeat, not Brooklyn style pizza.  It's Neapolitan, made by a real life Neapolitan (with a few Mexicans) spinning dough on their fingers and turning out some tasty pies.  \n\nUnlike the thin/dense/crisp crust traditional Brooklyn pizza, this is light, doughy, chewy, yeasty, with the occasional wood fired burn blisters.  Very good.  Buffalo mozzarella, high quality oil and meat, and delicious sauce. Bravo!\n\nLeave the gun, but take the cannollis.  Delicious mini/cigarette style Neapolitan cannoli.  Ultra crisp shells freshly stuffed with flavored ricotta cheese and sprinkled with nuts.\n\nFriendly, efficient service.  I still can't get over a good restaurant in Brooklyn Heights. \n\nI'm holding off on five stars until they do something about the unacceptably high noise level. I went late and it was only 2/3 full, but between the music and the customers conversing/shouting, and the blonde wood on the ceiling and everywhere else, it's quite loud.  \n\nCan't wait to try the good looking salads and calzones.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-16", "description": "I was excited when this place opened since a charming rustic restaurant seemed like a nice addition to the nearby Montague Street strip.\n\nIt was $14 for a 12\" pie, with artichokes, prosciutto cotta, mushrooms and olives...a little expensive but I figured with the toppings it would be worthy. Not the case...I opened up the box to find a pretty sloppily slopped together pie. Mozzarella covered less than 2/3 of the pie, there were maybe 5 slivers of artichokes on there, a handful of olives, 10 matchstick-sized strips of prosciutto and a few mushrooms. The toppings were so measly and unevenly placed, I was kind of appalled. Plus the bread was a bit chewy.\n\nI also ordered their meatball appetizer...for $11 you get just 3 small meatballs that are nothing special. You are better off traveling to the Meatball Shop where you get 4 big meatballs for $7 that are full of flavor and freshness.", "author": "Clarita H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-28", "description": "I had the pleasure of attending a soft opening at Dellarocco's.  The space is bright and modern with high ceilings and plenty of room. There is a bar with beer and wine and an open kitchen in the back with a bright red pizza oven (it's very eye catching). I really appreciated that it was nice and cool inside despite being 90 degrees outside, a packed house and a wood burning pizza oven in the back.  All the food I tried was good and the staff was great.  The draft list was right up my alley with Peroni, #9, Six Point, Brooklyn Brewery beers, and a few others.\n\nI can't wait to come back and check it out after the official opening.", "author": "Sean R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Gluten free heaven! I am so happy to have found this place! \nThe place is beautiful, service was friendly and warm, the GF pie was excellent! We chose the arugula and prosciutto. The crust was thin and crisp and delicious (really unusually good for gluten free). The cheeses and meat were super high quality ingredients. It was a fantastic pizza, I can't wait to come back again and try other pies- really nice menu, great find!", "author": "J L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-26", "description": "The pizza is solid.  While you can get much better within a half mile walk, this place is respectable for dine-in.\n\nThe reason I give it 3 stars instead of 4 is the horrendous delivery/pickup options.  Oddest deliver hours ever (like no delivery before 5pm on a weekend - including football Sundays) and even worse, borderline impossible to order over the phone.  I believe out of 6 attempts to get delivery I have been successful once and even that order took about 5 phone calls back and forth to get everything squared away.  \n\nIf this place is going to hog most of the sidewalk with 4+ bicycles it would be wise for them to USE them to actually deliver their product.\n\nEat in and you will enjoy your night.  But if you're looking for delivered pizza in cold weather when Football is on, look elsewhere.  I would recommend Sosta.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "If you like soup on a thin soggy crust, this is your place. Also the waitress says that's the style.....", "author": "Laura G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "Delicious eggplant parmesan (probably one of the best I have had) and pizza and great option for lunch in the area. Staff is friendly and the restaurant is pretty. Fun watching the guys in the back making the pizzas in the brick oven and I would highly recommend for a sit down brunch in the area.", "author": "Cynthia M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}