{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Greek salad is fresh and crispy and yummy , really a hybrid as it has fresh mutz on it. Margherita pizza was wonderful As was the sausage pizza . Xhan ( pronounced John) was a terrific server. We will be back to avoid the lines at the other more famous pizza places closer to the bridge. Worth the walk and the beauty of the river front on the way to boot !", "author": "Janet B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Great pizza. Cute setting. Not over priced. The service was on point. They have many options for both white and red pizza. You can eat the whole pizza by yourself and not feel like trash afterwards. Would definitely come back.", "author": "Cheryl L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "It was a boring, weird Saturday and I was hungry. \n\nHungry for pizza. But I also didn't want to endure the shame of eating an entire large pie by myself. So I decided to try Dellaroco's personal margarita pie to-go. \n\nAnd oh, did that little pizza pack a punch. Everything about this pie was amazing -- the thin lightly burnt crust, the rich tomato sauce, the cheese. Everything.\n\nI can't wait to return and actually dine in like a real human!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "This is really the best pizza in Brooklyn. I love it. Service is always good, great apps, and killer eggplant parm.\n\nHighly recommend.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Best gluten free pizza ever!!! One of my favorite restaurants in the neighborhood. \nThe servers are all very nice.\nThey now have a room in the back that can be reserved for small parties.", "author": "Jillian W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Good Italian pizza if you don't want to wait, better calzones. If you don't mind the wait and want phenomenal pizza, check out Sottocasa on Atlantic Ave and Smith Street or Juliana's by the Brooklyn Bridge.", "author": "James C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-02", "description": "The pizza was good--we got the margherita and the arrabiata. The salads were good--big enough to constitute a meal, fresh, and a balance of toppings and greens. The bar a pretty well stocked with beer, wine, and liquor. The ambiance while a little sterile, can get a little cozy when the sun goes down. They have enough space for larger parties (5-7 people) which is nice if you're out with friends (but would you really be out with friends in BK Hts.?) Only downside? The place is way more expensive than it should be.\n\nI know, it's Brooklyn Hts. but that's no reason to overcharge people for mediocre food. Yes, it's good, but I've had better elsewhere. The pizza was cooked pretty well, but because the sauce is kind of runny, the slices were a little soggy in the middle once we got them. It was also about the size of a large plate. \n\nIf you are looking for a personal size pizza and don't care about price, this is a good place to go--your going to shell out at least $16 for a pizza for one. But if you don't want to spend 20 bucks on pizza for one (you won't have leftovers) find someplace else.", "author": "Shayla G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I love the vibe here. Great food , Great service , delicious crisp cold draft beer!!  Beautiful clean place to dine in!", "author": "Aga N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Great neighborhood place with lots of families enjoying pizza and conversation at tables all around us.  You watch your order from shaping the dough to being inserted in their brick oven.   Very tasty!  Pleasant waitstaff.  Delightful dinner prior to strolling the Promenade.", "author": "Jim U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "Excellent pizza!!! My boyfriend and I came to Brooklyn from the UWS to check out Grimaldi's however the line there was insane, so we opted to come here and honestly I'm very glad! The pizza was extremely fresh and cooked excellently. He had the calzone and loved it as well. Prices were very good. I would definitely come back.", "author": "Jill W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "This was the best pizza I have had in New York. Not only were the staff lovely and attentive but the food, wine and atmosphere was delightful. Cannot wait to go back", "author": "Grace S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "A very good pizza place in Brooklyn on the way to the Brooklyn bridge park!\n\nI had a caprirossia to go and it was ready inside of 10 mins!\n\nI'm glad I have leftovers!", "author": "Shafraaz K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Motto Bene Dellarocco's- Sicilian deliciousness !  Skip those places with lines down by the dock and enjoy a great meal in a hip style NYC Brooklyn authentic neighborhood - great execution on food and atmosphere!", "author": "Joe V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "Great new addition to Brooklyn Heights...gorgeous space, awesome service (I can only speak to dine-in, not delivery), and really fresh brick oven pizzas. \n\nI had the Marinara pizza because that's what my date preferred, but I can't wait to try the Vongole white pizza!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "The staff was friendly and the pizza was delicious.\n\nI came in with a co-worker and we ordered the Tartufo Pizza (Truffle Cream, Gorgonzola, and Mozzarella). The flavors were not too overpowering and surprisingly light! My co-worker ordered a side of red sauce to go with it and it was an excellent choice.\n\nDefinitely worth checking out.", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "I can't believe I waited this long to try this spot. One of the few establishments in the neighborhood with truly delicious food. I was here with the b/f last Friday. I ordered the 4 flavor pizza and he ordered the 4 cheese pizza. Both were excellent. I'm excited to go back to have an entire zucchini pizza- SO delicious. Love the atmosphere and the service was on point. Reasonable wine prices. And what really puts the cherry on top is that the homemade tiramisu is made with mascarpone-as it should be- and it actually came dangerously close to my mother's. This will be a new date night destination. If you are in the neighborhood you have to eat here!", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Love the calzone bianco. Love the margherita pie. Love the radicchio salad. Love the staff. Love the owners.\n\nI work up the street and try to get here at least once a month for lunch. It's usually not very crowded at noon. And it's a great place to go to sit back, sip one of their ice cold draft beers and enjoy the great food and company.", "author": "Jim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "So, my four friends and I devoured 5 pizzas easily. Love it, love it, love it. The hardest part is choosing what to get! \n\nThis restaurant has a family vibe, but you can definitely hang out here with some of your closest friends. The trick is to get here early so you can get a table. \n\nSome minor complaints - the draft beers could be larger. Also, the ambiance is a little too sterile for my liking, but when the food is this good, the focus is on the food. And maybe your fellow eaters.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Great take out Pizza! \n\nGo with the Caprese, Calzone Classizo, Margherita red pizza and Pesto white pizza.", "author": "Joshua C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "This restaurant serves really great pizza.  If there is a downside, they only come in one large size, making it expensive unless everyone can agree on one pizza.  That said, I would go back in a minute.  It is really good with really nice servers.", "author": "Paul G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}