{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-17", "description": "Delivery was quite speedy but the pizza was ice cold- something you should expect on a rainy December day if you don't insulate the box.", "author": "Karen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Dellarocco's was perfect. My boyfriend and I happened to get a rare day off for lunch together and made him decide where to go, and boy, did he make the right choice. \nThe servers were so friendly and made sure our waters/drinks were refilled. The white pizzas (Dellarocco and Brigante) were so perfectly thin, yet soft and chewy. The crusts were nicely charred. My favorite was the Brigante - the arugula, cherry tomatoes, and prosciutto combination resulted in a light, savory, and bittersweet flavour. The pizzas came out at a reasonable time. The ambience and gloomy day outside made the experience extra cozy.\nOnly downside is the tables were quite small, I can't imagine being able to fit an additional plate aside from our 2 pizzas, but that was not an issue for us.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-06", "description": "I went on a Saturday afternoon around 3:30p to avoid crowds, and the place was empty. \n\nMargherita STG: it was supposed to have mozzarella di bufala and it didn't. The cheese was hard and not milky like it's supposed to be. When confronted, the waiter confirmed it \"was\" mozzarella di bufala. Absurd. Just look at my picture. \n\nDellarocco: it was burnt, above and below. Just look at my picture. Nothing else to say, other that the ingredients weren't fresh, especially the sausage. \n\nI have no reason to ever go back. Felt like I was treated like a tourist.", "author": "Giacomo C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-03", "description": "Very rarely do I feel the need to post a review, but in this case I felt compelled to do so.  Recently, I had an urge for cheese pizza.  There are a handful of local places I like to go to within walking distance, but this particular night I thought I'd try something different, so I went to Dellarocco's and ordered a whole pie to go.  Well, saying it was terrible is an understatement.  When taking my first slice, all the cheese just slid off the pizza and I was left holding a soggy, doughy slice of bread.  Not only was it undercooked, but I could literally hold it up and water as well as grease would run off it.  If it at least tasted decent, I may have given this place 2 stars,  but it didn't.  If I could have given 0 start I would.  I threw it out (it was late and I wasn't in the mood to go back to the restaurant).  Seriously though, I've had frozen pizzas that were 100 times better.  If this wasn't Brooklyn (we are known for our pizza) and there weren't any better options, I may not have even commented.  Go somewhere else...trust me.", "author": "Brooklyn H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-04", "description": "This place looked promising as they offer vegan options. The pizza is cooked in a brick oven and the pictures online for the vegan margherita looked amazing. Well, the pizza was not. First off, the sauce is very salty and very acidic. The crust would be fantastic if they didn't burn it. The bottom of the pies were charred. It was awful and all I tasted was burnt bread. I ordered two pies, so for the hefty price I was expecting a lot more than what I got. Both pies were burnt almost to a crisp. I had to throw them away. The one good thing I can say is that I spoke to the manager and he was very courteous and very apologetic and did give us two free pies so we would return and give them another try. I did that. I did the best I could and ate around the once again burnt pies which were not as severe as the first time but still I had to throw out half of one pie and some of the other. I'm not sure what the problem is. I'm guessing they don't clean their ovens. I've had brick oven pizza many times at different places and never had this problem. Needless to say I will not be returning.", "author": "Gisela A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-15", "description": "The food was delicious Not until I found out how unsanitary they are...\n\n\nThis review is regarding on health aspects. The pizza tool to turn to the pizza is left directly on the floor. Rack is right next to brick oven. Why can't they store it properly after each use??\n\nSecond, no gloves was worn while cutting the prosciutto. If I can see this while dining. I don't know how clean is the rest of the meals are prep.", "author": "Gracie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "What a great place! I was staying with friends from the  city and went to Brooklyn bridge park. We walked by the crowds at the other pizza spots and found this one. As soon as we walked in I knew it was the right place to be. The pizza was incredible. I'm not usually a crust lover, but this was perfect. Washed down with a beer, everything hit the spot! Seems like a local place for sure. Definitely coming back!", "author": "Molly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "If you're looking for friendly, warm atmosphere and delicious Neapolitan style pizza, don't even mess around. This staff and kitchen consistently earns show biz tips from me. Bonus level: become a regular and stop receiving a menu when you sit down. You'll have it memorized. Go and eat.", "author": "Yotam Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "I love this place. I've come here each year that I've been in Brooklyn for an annual event and it's amazing every time. Great pizza, great bar, great service. Accommodates my large group every time (32 people this year, called ahead in early afternoon). I'll continue to come back every time I'm in Brooklyn.", "author": "Bert J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Fast delivery and delicious hot pies.  We got one GF white with truffle oil and another regular crust Margherita. I will be back to try more!", "author": "Megan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-04", "description": "closer to 3.5, but oh well.\n\nWe popped in for lunch while in Brooklyn walking around the neighborhood and had the arrabbiata pizza and an order of the meatballs with shaved parmesan, tomato sauce and fresh basil.\n\nThe pizza had a very tasty charred crust and was a good size to share, but the middle half of the pizza was extremely soggy.  Even when folding the slices in half to pick up to eat the tips of the cheese and topping sloughs off and leaves you with wet dough.   The flavors of the cheese, sauce, toppings and dough however were otherwise quite good.\n\nThe meatballs were enjoyable, especially with the slices of shaved parmesan and fresh basil in each bite.\n\nPrices were on the medium to high side, and the ambiance of the place was pretty bright and cheery I thought.  Not a bad spot, but definitely not a must visit spot or a place I'd go out of my way to return to before trying other spots for pizza in Brooklyn first.", "author": "Deniz V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "This is the place is the best! My husband and I LOVE coming here. It's cozy, the service is good, and the food is delicious. People wait in line in Dumbo for the pizza and it doesn't compare to the pizza here. It's authentic and tastes like it was made in Naples. The salads are also AMAZING. We always split the Spinaci Salad, meatballs for an app and two pizzas, then finish the meal with cannolis that are out of this world. The filling they use is perfection. We leave full and happy...how it should be. Highly recommend stopping by for a wonderful meal!", "author": "Natalie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Awesome gluten free crust pizza. I don't even have to eat gluten free and it tasted amazing!", "author": "Charles D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "I was visiting New York, and struggled to find good Gluten Free food. My friend brought me to Dellarocco's and not only was it the best Gluten Free pizza I've ever had, it was honestly better than my remembrances of \"normal\" pizza. If that's any indication of the rest of their menu, I might have to move to the city just for this place. \n\nThanks guys for the delicious time! The atmosphere was also sweet and intimate.", "author": "Savannah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "Visited Dellarocco's last after a brisk walk through Dumbo and BK Heights.  What's better on a cold night than some brick oven pizza?  \n\nThis trip we started off with the same salad as before - Spinaci (spinach, goat cheese, mango cubes, pistachios and balsamic vinaigrette).  It's still $10 and still a fantastic salad.\n\nNext up The Salsiccia 'Red Pizza'.  Yeah yeah it's the same pizza I ordered the last time I went but why mess with something that's so good!?\n\nAfter we finished the delicious sausage pie, Hubs looked around the crowded dining room, and over at the table next to ours and said \"wanna order another pie?\"  Pshh yeah I do.  For our 2nd we ordered up the Four Cheese option.  I told you in my first review I'd be back for a 'White Pizza'... it took me a couple months to get back but it was so worth the wait.  The Four Cheese is fantastic.  Mozzarella, Gorgonzola, Provolone, Parmigiano and a dash of basil ($13).  Despite it not having any sauce it was so creamy, and this cheese combo was crazy good.  It was a little nutty but salty, and had a kick to it.  Crust was great, a little chewy but thin.  Hubs commented that the pizza wasn't heavy.  Our whole meal was really light - and we left with happy bellies.   Such a good meal!  Great service \u0026 atmosphere too. \n\nOne of my new fav pizza spots in NYC, I'm totally loving Dellarocco's!", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Super food, with the blackened crust on a Brooklyn style pizza like I like.  The center of the bottom was wet with ingredients, but after I knife-and-forked that part away, it was easy to pick up. The kale salad was huge, and could be a portion for two. The meatballs appetizer was heavenly and hot, with tender meatballs like a warm hug for your stomach, given by an aproned grandma still hot from the kitchen. \nNice local beer selection, too.  Try both local and seasonal, you won't be disappointed. The decor is very clean and current, with nice marble bar, and an organized-but-small pizza kitchen open in the back. Not your Brooklyn Bridge, checked tablecloth type place. I'd come back, absolutely!", "author": "Robin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "They do a very good job with their pizza here. It's quite similar to what you would eat in Napoli. It gets soggy in the middle and crunchier in the crust, it's the style of this type of pizza and I love it. Sometimes the tomato sauce it's on the tasty side, only note.\n\nDelivery is fast and the staff it's nice.\n\nThe restaurant itself it's simple. No pretense nice family spot.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Very tasty pizza and will definitely be coming back. Great flavor and a nice fluffy crust came with our two pizzas. The pizzas we ordered did come out a bit salty, probably because we ordered one with sausage and the other with another cured meat.", "author": "Robert A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "BEST GLUTEN FREE PIZZA\nEating gluten free often involves a disappointing series of compromises, especially when it comes to pizza, well no more!  The GF pizza crust at Dellarocco's is made in-house and when fired in the +800 degree oven, it comes out light, fluffy and crispy and is indistinguishable from normal brick oven crust.  My wife and daughter could really not tell the difference between my crust and their regular crust.  \n\nWe had great appetizers; all of the food was delivered quickly, and with polite attentive service.  Anyone with Celiac out there is within walking, driving or flying distance of Dellarocco's should try this pizza to remind you of what it was like to dine out without having to make compromises.", "author": "William T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-22", "description": "This is a cool neighborhood pizza joint that has some solid GF pizza. This visit, however, the pizza was undercooked. I was so tremendously hungry that I inhaled it...so even undercooked, it was good.", "author": "gary g."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}