{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "exactly what brooklyn heights needed! friendly owners of heights cafe... authentic delicious pizza. Chef from Naples, also super friendly. Grimaldis has some competition..", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-09", "description": "Good pizza, but not so good for delivery. It has a nice char on the outside crust, but otherwise quite soggy.  i imagine if you ate it in the restaurant if would be better.", "author": "Roberta S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "The pizzas we ordered had very good crusts: chewy, slightly smokey and not very thick.   The toppings offered are, for the most part, vegetarian friendly. While one pie is probably enough for two not very hungry people when coupled with an appetizer,  why deprive yourself? We had three pies and one appetizer for three people and finished every bit.  The caprese skewers were plenty big enough for three people.  Wonderful texture, but a bit bland.  Our pizzas were the margherita, the arrabiata and the four cheese.  My favorite was the four cheese as it was very strong and pungent.  The arrabiata was not as spicy as I would have liked nor did it have enough soppresata, but it was also quite good.  The margherita was ho-hum, not that special.  Try the spectacular tartufo!  The tiramisu: eh.  I like Lassen \u0026 Hennigs much better.  Its creamier and sweeter.  I will definitely go back to Dellarocco's.  A very nice addition to Brooklyn Heights.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "arugula salad topped with slices of parmesan cheese + margherita pizza, my favorite meal in Brooklyn Heights. the staff is always very friendly and accommodating", "author": "Matt W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-14", "description": "Boring and overpriced, and the pizza was meh. The Montague St. curse continues.", "author": "Alec M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-06", "description": "The food is good.   Nothing better, nothing worse.  I've had a couple instances where the service is exceptional, there have been times when the staff has been aggravatingly unresponsive.   The pizza is good, bathrooms are clean.  That's really all that matters in the long run.", "author": "Arthur S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-25", "description": "Let me start with the good. Its a beautiful room; light filled, airy, austere but not cold. The waiter was excellent; quick and accommodating. I had to send my montepulciano back; it tasted like it had been open for a few days. Now for the pizza - For the neighborhood, its relatively inexpensive and OK, but its definitely no great shakes. I don't expect everything to be Grimaldi's or DiFara's, but the arrival a new pizza place brings with it a hope for something authentic, tasty, and expertly executed. Pizza places in this town (and the foodies that sample them) are as pervasive as banks and drug stores. If you're going to open one, then please be sure to knock my socks off or at least serve something solid. The crust was limp and doughy; Neapolitan pizza should be thin crusted and crisp. The toppings were pleasantly simple (I had the STG), but it would be nice to have the choice of adding some toppings. So, was it terrible? Definitely not. But I wouldn't rush back either.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "Hot pizza+ceramic plate = soggy crust. Every time. Too bad, because the pizza itself is decent, especially the simple margherita. (not great, but pretty good) There's a reason every decent pizzeria uses metal platters - they keep the crust crispy. These folks apparently don't understand physics, so the effort spent in putting in a wood burning oven is undercut by the moronic plating. The skill level of the cooking staff is uneven, sometimes resulting in very good pizza, sometimes in a sloppy mess. But they are still new. They also don't understand wine, but happily there's a decent beer selection. They do understand salads-they're all very good, if rather overpriced. Overall, this is a pleasant place that could be much, much better if they paid more attention to the details.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-11", "description": "This place was a total let down. We sat at the bar last Friday night and ordered a salad to share (spinach, goat cheese mango)- it was delicious, so we were excited for the pizzas... They were awful. I had the Margherita STG, and my husband had the Arrabbiata. \"Soggy\" doesn't quite explain it- it was almost soaking wet. We both ate half because we were starving, and let the bartender know that we didn't like our meals. The owners had been standing next to us and could clearly see that we were unhappy and then we watched the bartender explain the situation to them. They offered us dessert, but we honestly just wanted to get out of there. It was a little unsettling that at a new place the owners wouldn't want to address the problem. The salad and the bartender were both lovely, but that pizza was terrible.", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "Dellarocco's is a great addition to the neighborhood. It offers the pizza lover another variety of pizza that previously wasn't here. Although pricier than other pizza places in the area, it is way more than a pizzeria. It offers a great mix of appetizers, wood oven pizzas, desserts and a variety of beers.", "author": "Michael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-23", "description": "Great addition to the hood.  Not a slice joint. More of a casual date kind of place. Their oven isn't very impressive to look at but they turn out good pizza.", "author": "Tom P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Pizza's tasted just as I remembered in Italy.   A little pricy for the size though.", "author": "Jim H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-17", "description": "We LOVE this place.  Fantastic pizza.  Best crust we've had--a little crispy, a little chewy.  The sauce is totally amazing.  GREAT salads and roasted vegetable plate.  And the people working there are really lovely.  We desperately needed a place like this in the neighborhood and we are thrilled!", "author": "Trena K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "A nice cozy place in Brooklyn Heights. I had an excellent pizza from a wood burning oven and a great argula salad which included shaved Parmigiano Reggiano cheese. Friendly staff! Enjoy it after a walk on the Promenade!", "author": "Charles P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "Great addition to the neighborhood. Thin crust, fresh ingredients, friendly vibe. The crust may be the best in Brooklyn. Dellarocco's is as good as Grimaldi's.", "author": "Rick T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "Delicious pizza with robust flavor and thin, chewy crust. It arrived within minutes - literally- of my order. The toppings are delicious, like broccoli rabe and porcini mushrooms. My favorite beer, Magic Hat #9 was on tap. I've tried a lot of the well-know, acclaimed New York pizza places. Dellarocco is my favorite.", "author": "S G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-02", "description": "only one experience, delivery.  it showed up on time, but it was gross and soggy.  taste was fine, texture was not.", "author": "Chris J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}