{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "The arrabbiata pizza is our spicy favorite.  The meatball appetizer is in a tasty marinara sauce and comes with a slice of cheese in the sauce and a grilled slice of bread lightly drizzled in olive oil.  You can count on the draft beers to be cold.  The tiramisu encourages us to visit often.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-23", "description": "Delarocco's made a good, easy night of casual dining. The space is beautiful and the atmosphere is relaxing. The arugula shaved parmigiano reggiano salad was light and lemony, with ample parmigiano and I thought it was perfect. We did specifically ask for the salad to come out before the pizza, but they were brought at the same time. A minor point, but service seemed a little off. Maybe we came in too close to closing time? \n\nWe had the Dellarocco pizza (smoked buffalo mozzarella, broccoli di rabe, italian sweet sausage, red pepper, garlic). The pizza is very tasty, but it is definitely not your traditional pizza. The crust is very doughy. I liked it, but personally I prefer a thin, crispy crust. Toppings were...unmemorable. I'm eager to try another pie.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "The pizzas are exquisite and the ambience is wonderful. It's exactly what you want and expect from a small pizza shop - great food all around. Also, had a very friendly bartender who gave great recommendations and she clearly knew her stuff!", "author": "Dan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "I am picky about pizza quality and this was A+ pizza! Thank you! \nI love the atmosphere too. Friendly. Just great. \n(Much better than Grimaldi's)", "author": "Evan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "My wife and I visit Delarocco's on what turned out to be their opening night. We had long patronized the card shop that was in this space previously and, although we were sad that the card store left after nearly 30 years in business we were excited when we saw the location was turning into a new eatery.\n\nWe shared a pizza - the Arrabbiat which we had with basil added to it and it was delicious. The pie was cut into four pieces so we each had two and the meal was very satisfying. The pizza was of course hot from their wood fired brick oven and the ingredients were fresh and tasty. We also each enjoyed a glass of red wine.\n\nThe only down side was there was only one white and one red wine offered by the glass. I found this surprising as they have a bar and I would expect people want a variety of wines available at the bar. The service was also a little slow when I first arrived but I'm guessing it was growing pains being that it was their first night of operation.\n\nDelarocco's is a short walk from where my wife and i live and we will definitely return. Assuming the service gets a little better I will come back and update my rating to five stars.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-15", "description": "From the street, the place looks like a clean and nice place to get pizza. However, our experience was a disaster: the wine was awful, the pizza was made with the same cheap ingredients (i.e. nothing fresh) than your average pizza joint. If you care about service, the waitress we had to deal with was awful and vulgar.\n\nThey have fresh mozarella for only one kind of pizza, for which they charge a sizable premium. The idea of pizzas with fresh ham or mushrooms did not cross their mind.", "author": "Joe D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "Perfectly lovely spot no matter the occasion.\n\nVery  impressive in all respects, from service to food to atmosphere. Pizza is delicious, and each time we've visited we've had to order an additional pie because we can't get enough. Despite the close proximity of the tables there have never been any claustrophobia or intrusions.\n\nService is efficient and friendly.\n\nQuickly becoming a favorite.", "author": "Deleted A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "3.5 Stars.\n\nCame here for a late lunch/early dinner so it wasn't busy, but I have been by here and seen its quite hopping at times.\n\nI ordered the pizza capricciosa which was quite tasty, my one complaint being that the dough in the center of the pizza was soggy from grease require a fork and knife as folding didn't cut it.  Towards the crust, it became crisp with a few burnt spots from the brick oven.", "author": "Todd A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "We had an errand to run in DUMBO and decided to Yelp some nearby restos for a quick, casual bite around 5:30pm on a Saturday. Lo and behold, Brooklyn Heights had the answer. In a neighborhood that's a wasteland for good restaurants, this place especially stands out. Nice, simple decor with giant street windows, plenty of tables and a bar with an open kitchen (but no heavy smells, aside from the alluring baking pizzas).\n\nI am gluten free by necessity, and am always game to try a new place that offers gluten free pizza. This place is HANDS-DOWN the best gluten free crust I've had in the city by far. Chewy, slightly singed, and a surprising lack of sogginess after a few minutes, which is the sad downfall of most gf pizza. I kept it basic with a margherita - the sauce was tangy, just right. Mozzarella was fine, nothing special but not a hindrance. $4 extra for the gf crust that tastes almost like a real Neapolitan pizza is a small price to pay.\n\nWe started with the woodfired veggies - zucchini, garlic, Italian eggplant, and peppers roasted to a slightly charred perfection, with flavorful EVOO. My husband got the Capricciosa regular crust pizza and an Ommegang, both he gave a resounding two thumbs up for the combo of toppings and the appropriately chewy crust.\n\nWait staff was friendly and efficient. As I'm super pregnant, I was thrilled to see the restaurant is really kid-friendly in the late afternoon - this will make returning many, many times much easier for us!", "author": "Cara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "Love this wood fired pizza joint.........amazing apps and love the meat \u0026 cheese plate. The calzones and pizza are to die for and they have a wonderful beer and wine list. The manager, Elise is always working the rom and taking care of all the guests. The decor and service team are warm and friendly. Will always continue to go back with friends, family \u0026 clients!", "author": "Philip H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "Was initially planning on eating at Fornino close by on Pier 6 because their Yelp page said they were open.. They were not. Grr..Their website says each locations specific hours but they should clear that up on Yelp too, right? Luckily it was a nice day by the water. :D Well, to our rescue, Dellaroccos was a nice alternative. Bright, clean, \u0026 friendly. Great pizza (every option sounded amazing) \u0026 loved the refreshing Avocado salad. It was a nice lunch alternative to our main plan of sitting outside on Fornino rooftop because really our main focus was just eating good PIZZUHH!", "author": "Kelsey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "After a very long but beautiful day in the Hamptons/Montauk, we ended our day in Brooklyn to catch the sunset and have some pizza. Goodness gracious, parking is overwhelmingly annoying; best of luck trying to get a spot in this neighborhood; took us about 45 minutes, but we did grab a spot less than a block away. It was about 8pm on a Saturday night and we were seated immediately. Dellarocco's is very small, trendy but cozy and romantic at the same time. Good menu, good prices; we settled on the arugula salad, margarita red pizza and four cheese white pizza which we added prosciutto to. Wow! Pizza was great. We liked and polished off both pizzas entirely but our favorite of the night was the margarita. It was fabulous. A very very cute spot in Brooklyn Heights, friendly service and good pizza with fresh ingredients. This was my first time in Brooklyn and I highly doubt I'll be back, but if I should ever head back to this area, I would definitely come back here for pizza.", "author": "Amy U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "I went to Dellarocco's tonight with my boyfriend for dinner - it was a complete a 5-star experience.  We sat at the bar, where the bartender was warm and friendly (and energetic!) without making herself too much a part of our meal.  She was also our server, so the 5-star rating goes for service, as well.  \n\nWe ordered the Spinaci salad to start, which was perfectly dressed and delicious.  We each ordered a pizza - the Margherita STG and the Dellarocco - and both were phenomenal.  Yes, they are not 100% crispy in the center, but the crust is thin, yet pillowy, and perfectly charred.  Just what they're meant to be.  The combination of delicious and light pizza along with the wine (I had the Bello Rosso) was perfect.\n\nDellarocco's is a wonderful date-night or night-out-with-friends spot...the ambiance is very lively and the interior is perfectly decorated.  We'll definitely be back.", "author": "Lily E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-24", "description": "I love that this place is right around the corner.  It's a simple date/friend night in the area with a full bar that serves pizza and italian food.  So, if you're not picky and you're just looking for an upscaled Monty's Pizza, this is a great bet.  \n\nI took a date here on a wednesday night at around 8pm.  There were a few tables open, a couple of families and other party of twos filled the rest.  The interior is really cool-- very spacious with the high ceilings.  \n\nWe ordered a bottle of wine, the roasted veggie appetizer, and a margherita pizza.  All the food was great-- except if you're looking for that Romanian style pizza with a very thin crispy crust, this is not the place to look.  The pizza was limp and over saturated-- but definitely tasty in terms of flavor.  \n\nI should also throw out there that we waited a really long time for the pizza to come.  We didn't know if the waiter had forgot to put it in, or the ticket got lost, or something-- but we did wait for awhile.  And anyone that knows me knows I'm a very patient person.  I don't let things like this ruin my night.  We enjoyed each other and our conversation in the meantime.", "author": "Johnny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "This is by far my face local pizza joint (and I leave near GrImaldi's and Juliana's). Delishious pizzas! Really really good! And they do a gluten free crust for the glutards too, which I appreciated. I always get the porcini white pizza but love the buffalo marg too.", "author": "Esme B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "I've been here twice after night classes and I just love it!  Get the quattro whatever it's called if you can't decide on one pizza.  The prices were surprisingly decent considering it's in the beautiful neighborhood of Brooklyn Heights.  Pizzas are not humungous like Grimaldi's or Juliana's, but the quality does not disappoint.  The service here is also great.", "author": "Nisa N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-04", "description": "One the expensive side for Pizza and portions are small.  Food is overall good.  Fresh ingredients and nice selection.  Place is also pleasant.  Please note if you order a calzone or meatballs ask for sauce - and extra sauce.  They give the smallest amount - and if you order delivery ask for two or three containers of sauce  - they are very small.  Which doesn't make sense considering it cost very little to make a red sauce.", "author": "J.P. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "I walked in this place not expecting much, don't get me wrong it's pretty, nice decor, me and my friend ordered two separate pies that they have fancy names for, the pizza came and WOW!!!...awesome, five star pizza, love their toppings, sliced right at the moment, the pizza is super fresh, right out of the oven....\n\nLove the white pizza with speck and mine with olives....\n\n\nThis place has taken pizza to another level, ......Salads are great, ...\n\nPlace isn't cheap but believe me a good pie", "author": "bill l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-04", "description": "New place... Ordered a calzone and it was pretty good. Great beer and wine selection. Great waiters.", "author": "Armando Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-26", "description": "This is a nice addition to the neighborhood. i got the Capricciossa. The crust was very bubbly and a little too charred for my liking, however, it was nice and doughy. The meat itself was a little too heavy for my liking and I don't think I would order this pizza again (it was the server's suggestion). \n\nWhile the quality of the pizza is pretty good, there is something about the esthetic of the restaurant that is missing...it's like they haven't finished decorating. The walls are pretty barren and the decorations are very minimal to none. There was a decent crowd on a Wednesday night though. \n\nBefore I began my meal, I was wondering whether this place would be a serious challenger for my favorite pizza place (Sottocasa, which is 10 minutes away) but it's definitely not. Sottocasa is still #1 in my books, but Dellarocco' s will have to do for nights that I don't want to leave Montague St.", "author": "M L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}