{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "Sooooo I came here on a Thursday night with a good friend of mine and this place was packed! It was my first time visiting but definitely not my last. I loved the decor a bit of a rustic feel on the inside. There's a bar area with stools you can sit and grab a glass of wine and chill. \n\nThere's also two main rooms where they sit people with one of the rooms a bit tucked away to the side seemed more intimate to me.\n\nMy friend and I started off with an appetizer with different cheeses, grapes and slices of bread with jam. The sweet and salt taste was so amazing and the different type of cheese was a good starter. \n\nFor our pizza we had the Quattro Gusti (four selections) so we both had the opportunity to sample four different styles of pizza! Definitely didn't disappoint with their oven style!\n\nThe atmosphere is very relaxed even though they were packed and they had customers waiting we didn't feel rushed to leave.", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "Wow wow wow I'm so impressed. My SO and I came here for a Monday night date night - we typically never pick Italian because of the lack of vegan options. We decided to look at the menu any way because it is a long time neighborhood favorite and we love pizza. While I was just expecting a red pie with veggie toppings, Dellaroccos recently added a small vegan menu that has VEGAN CHEESE and carefully selected toppings. It would be an understatement to say I was excited \n\nWe ordered the grilled veggie appetizer that was so much more than slices of veggies, they made a beautiful presentation of eggplant, peppers, and zucchini. The flavor was unbelievable ! \n\n\nI had the Lei pizza which was a burst of flavor in every bite. I was beyond impressed with the flavor - it wasn't just an every day \"oh here are your toppings on dough\" they were tastefully pulled together. Definitely returning!", "author": "Christina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-29", "description": "I don't know what's going on here with this crust, maybe I am just not sophisticated enough to understand this pizza. I was on my way to Carroll Gardens when it started to rain, so I decided to look for \"best Bklyn pizza nearby\". This came up, and the pies looked promising, but...Listen I know everything is not L\u0026B, most of the pies in NYC are thin Neapolitan, but I just don't expect to fold my slice and pick it up and it flops down like I'm trying to hold melted cheese in my hand. I guess that's the reason for the knife and fork, but the paper thin slice didn't even seem done all the way through. I am not eating a crepe, I expect a little architecture to the crust, something to give it a base. Am I wrong here?\n\nAnd if we're being all sophisto and white napkin in this place, then shouldn't you be able to explain the food to me a little bit? Isn't that the characteristic of new foodie Bklyn restaurants, that they tell you every little thing about the food you're eating, both on the menu and in person? The sausage was so good, but the staff had no clue. You know, what kind, where's it from, is it local, made in house, is there someplace I can buy it, what! Pepperoni, same. Cannoli, same. Is it from a bakery around here, hello? They just seemed to be phoning it in, waiter-wise. And btw, the cannoli? Meh, too much sweet ratio, if I wanted to eat an entire bag of powdered sugar I would do so.\n\nI would say that I really don't care about waitstaff, the focus is the food, and the crust is not up to the standard of classic pizza in my humble view. I think maybe it was cooked wrong, the outer crust was perfect, chewy, little burnt spots, smoky taste, the cheese great and fresh, the porcini mushrooms, so good, the other slices of kale and sausage, how creative and a great mix, but...crust, the rebar of the pie, if you will, the inner part has got to be firm enough to at least carry a basil leaf without collapsing. But what do I know. Anyway, yeah, Carroll Gardens next time.", "author": "Michele D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "It's hard to find a restaurant that has as many white pizza options as red ones, but this place does -- and more. We had their very generous salad caprese with soft mozzarella and tomatoes that exuded summer and white pizza taleggio with caramelized onions and fennel sausage. The wood oven made the perfect thin and smokey crust. All around, this place is a real gem!", "author": "Anne K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-20", "description": "The photos of pizza were amazing... but I guess you can't eat the cover of a book. \n\nWe ordered delivery last night and ordered a specialty pizza with toppings and a meatball app. The meatballs and sauce tasted great. A little too bready though. \n\nOur $30 pizza was disappointing:(  \n\nDough was chewy and without substance. The pizza couldn't take the little toppings and cheese it came with\n- ordered extra toppings.  Maybe they added them, I couldn't tell.\nI am sure the ingredients are primo, are they worth $5 each for a small personal 12 inch? NOPE\n\n$45 total\n\nWe pass this place many times and think its a cute, family oriented restaurant. Overpriced, overrated and I am over them.", "author": "Evan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Excellent. Superb pizza, good atmosphere, friendly staff, good service. Would definitely recommend and re-visit.", "author": "Nick H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Wood Fired Brick Oven Pizza Restaurant in Brooklyn is such a great nook. I loved the Eggplant it was very tasty. After going to Italy 2 times a year for 7 years I'm picky about the way the sauce taste. Call me crazy but once you have pasta or any Italian food in Italy .these Italian restaurants in NY have a picky one on their hands... LOL. But this place gets it very close....\nWith my Eggplant plant dish I had a glass of Montepulciano which was at the right temperature to taste.. \n\nMontepulciano, one of Italy's most popular red wine grapes, has thrived in Abruzzo- region of east-central Italy, since the middle of the 18th century. A plump grape, which gives good yields of easy-drinking wine, it is popular with producers and consumers alike. The variety typically provides deeply colored juice ,which varies from ruby to purple depending on vintage and the particular winemaking techniques used, with low acidity and soft, unobtrusive tannins.\n\nYUMMMMY!!!", "author": "Irene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "True Neapolitan pizza. Our favorite pizza place in Brooklyn. Their Margherita and Capricciosa is a must have.", "author": "Vinícius V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-29", "description": "Very friendly service and amazing crust on the pizza. We had the Quattro gusti which was awesome. Loved that they gave four different types on the same pie. My favorite was the one with spicy soppressata which was super flavorful. Only wish there had been a little more crispness to the bottom crust because the sauce made it slightly soggy. Still worth a visit :)", "author": "Amy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "This pizza is incredible! We ordered the Monnalizza and it was SO GOOD. I could eat that pizza every day. It was so unique and the flavors were just the right combination of sweet, savory and spicy. And the crust was perfect (which is a huge plus). Highly recommend!", "author": "Julia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Went this past weekend. It was pretty crowded so we opted to be seated at the bar. We were served very quickly and food was great! Tomato and mozzarella was super fresh and good. Pizzas were also awesome - crust still soft on a brick oven pizza?! Yes please! Not giving 5 stars because it took forever for us to get the check. But would give 4.5 if I could. Will probably come back.", "author": "Sydne P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Such a great find in Brooklyn! There is tons of good pizza spots in bk but this one should be listed in tops pizza spots. It's delicious thin crusted pizza that makes you want more with every bite. \nMy brother and I took my cousin visiting from England (in the picture, lol) and they both went back again the next day. \nThe staff is also very friendly.\nThe ambiance is intimate.", "author": "Afi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-28", "description": "We were very glad when Dellarocco's opened because it meant that we didn't have to walk farther and endure the insane lines at Grimaldi's in Fulton Ferry. Dellarocco's is kind of expensive, though, and the toppings tend to be too wet for the thin crust, which gets floppy as a result. The wine selection has not impressed my wife.\n\nFavorite variety: capricciosa.", "author": "Rory C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-12", "description": "I finally found some wood-fired pizza in BK that is a good price and similar to one of my favorite pizza spot (from where I used to live in Minneapolis). I really enjoyed the capricciosa but it really needs more basil. I've noticed this at many pizza spots around nyc, the basil is utterly conservative, like 1-2 leaves for the entire pie! It seems to be a nyc phenomenon - very light basil application. But i love the fluffy but chewy crust, and I personally don't mind that the center of the pizza is not firm. This is very standard for wood-fired pizza and so it's what I'm used to! \nI also ordered the kale salad and I loved the dressing. Thank you for not doing an overly garlicky flavor and heavily creamy texture. The dressing was even a little runny but I like that, otherwise it just lumps. But please (this is going to sound so basic) - massage your kale, or \"marinate\" it in very light olive oil. Eating completely raw kale, in very large pieces, is not great. I'm not sure if this is what diners like, but my experience with kale salads is that the greens are tenderized before serving.\nI will add that I ordered through Caviar, perhaps if I dined in the salad would have been prepared differently? I'm not sure, but the pizza still was great after being delivered. And I will say the delivery time was before the promised time so I was happy about that!", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "Great spot, even if it's off of Montague st....\n\nAs is the case for many of the Brooklyn Heights Montague st. eateries, quality food and value are usually lacking. Fortunately for you, Dellarocco's does not fit into this group!\n\nThe pizza here is quite good, with quality ingredients always being a focal point. They have a great selection of white pizza's which is not the norm for most pizza joints. The pizza is chewy with just the right amount of crunch! \n\nIm a regular here and so should you! Take the plunge and enjoy a quality meal! They are kid friendly too!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Some of the best brick oven pizza that I have ever eaten. \n\nThe service is great, the food is amazing, and the ambiance is classy.  The restaurant is kept extremely tidy, with tons of natural light. \n\nEveryone should totally try the Buritina, one of best pizza's on the menu.", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "Pros: \nGreat pizza flavor\nSuper moist meatballs\nNice atmosphere \nClean\n\nCons:\nNo official bartender led to a bad cocktail and improperly poured wine spritzer \nCrust wasn't crispy so droopy pizza\nOne server meant needing to call him over for drinks more water and then the check \nAlso not the biggest thing but bread to start is nice in an Italian restaurant.", "author": "Maeve D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-05", "description": "Ordered the Arabiatta and the Tallegio. They were good in terms of flavor, nothing to rave home about though. The cheese and toppings slid off the dough when we picked up the slices.  Ambiance is romantic at night, little tea lights on wood tables.", "author": "Clare B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "as someone who follows a gluten free/dairy free diet, it can be challenging at time to find restaurants that can accommodate my needs (\u0026 have good food when doing so). ordered a gf/df margarita pie today \u0026 i was amazed! it was absolutely delicious. if i lived in the area, i would be here all of the time -- it was THAT good. may just have to stop into brooklyn more to get this pizza again!", "author": "Natalie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "I have been hearing about this place for quite some time and had never had the time to go there. I actually had to do a meet up here in December but it got cancelled. But soon opportunity arised my cousin was in town from Canada and I thought why not go somewhere with great reviews. Let's just say were both  speechless the service was great and they had a wide variety of pizzas to choose from you have a choice of red pizza or white pizza. We went with a Salsiccia pizza. Oh so light filling and delicious a must try is the kale Caesar salad no words can describe the party in you mouth after eating this salad. I must say my first visit was a hit I wi be back for more.", "author": "Almaria B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}