{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Crispiest crust, amazing truffle cream and shiitake mushrooms on top. In heaven!!!!!!", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "I've never actually eaten in Dellarocco's but have ordered delivery and take out from them many times. I currently work on a construction site down by the water and they've been very accomdating with regards to delivering. I just had to explain the situation to them once (\"Hey we're under the BQE in a trailer compound\") and have had no problem since. The food always comes at the perfect temperature. Now for the food:\n\nCrostini: I was quite disappointed. The crostini arrived all crushed together. No big deal, I can understand that things happen in transit. But the toppings on each I found to be saltier than I expected or enjoyed. This was the only thing I've ordered from them I wasn't satisfied with.\nWood Roasted Vegetables: This was delicious and a huge portion. The dish consisted of eggplant, peppers, onions and some squash or zucchini all lightly seasoned and a nice smokiness to it.\nAvocado Salad: So good! The salad is incredibly filling and fresh as a salad should be. The components are all balanced: avocado for creaminess, red onion for a fresh kick, orange and tomatoes for sweetness and the dressing for a tart note. The lemon vinaigrette just makes elevates it, one of my absolute favorite things to get.\nQuattro Gusti Pizza: I like how this is kind of a \"tasting\" of 4 of their pizzas: Margherita STG, Arrabbiata, Zucchini and Dellarocco. This has a bit of everything (tomato, cheese, veg, spice, smokiness) and my go to order.\n\nI've also tried their Siciliana, Tartufo and Bresaola pizzas and all were very good. My goal is basically to make it through them all!", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "I LOVE THIS PLACE! Every person I bring here absolutely loves it! Get the eggplant Parmesan as an appetizer. I dont even LIKE eggplant but I'll devour this! Pizzas are an A+! So delicious you'll want to eat even though your stuffed.\n\nIf you've got a sweet tooth, order the nutella pizza. Its not on the menu but they'll make it for you and you'll thank me after.\n\nWill be going back for sure! A gem in Brooklyn heights!", "author": "Elle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Great pizza! \nA small warm cozy-like atmosphere. In the back you could see the actual brick oven they use to make the pizzas. One of New York's best hole in the wall pizza spots. \nStopped here with the boyfriend craving for a taste of authentic Brooklyn New York pizza and they delivered. \nWish the tables could be larger though, we were struggling to keep two 12 inch pizzas on our table without them falling onto the ground.", "author": "Maria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "Love this place! The pizzas are absolutely delicious, best pizza in Brooklyn Heights. Great staff too!", "author": "Rose D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Now i am a pizza SNOB with a all caps- i critique everything about a pizza- that is because i believe there are very few things as delicious as the perfect pizza- this restaurant does not disappoint in any way\n\nI ordered the Siciliana pizza- at first i was disappointed because i did not realize it was a white pizza- but OMG was is amazing in every way- easily the best pizza i have had outside of Italy!!!! \n\nI have only been once but i am hoping the next time i go it will be just as memorable.", "author": "Rebekah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-02", "description": "They make their pizza in a bright red pizza oven located at the back of the restaurant. The pizza wasn't bad, but wasn't great either. As mentioned in some previous interviews, the tables are set up too close to one another. Wait staff was walking behind me and I found myself having to lean in too many times during the dinner. Also, it would have been nice if the contents of the salumni board were explained to us.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "Burnt pizza then uncooked! Can they get it right for a $15 pie?  \n\nAdditionally, it was really nothing to write home about!\n\nMom was supper hungry and wanted pizza so we just came in the closest pizzeria with good yelp reviews! I would not recommend this  place", "author": "Tina Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "I've been won over and plan to keep Dellarocco's in heavy rotation!\n\nOn my first trip to Dellarocco's my husband and I were in the mood for salad. I ordered the Spinaci and he ordered the Bresola. First impressions are important, and the plating of the salads did not disappoint. The balance of the ingredients in each salad, as well as the dressing distribution, was outstanding. We both cleaned our plates and couldn't decide who had the better salad. These are well thought out dishes and very well executed. \n\nWe returned and were temped to get salads again, but I was very much in the mood for pizza. I first discovered the restaurant because they serve gluten free pizzas. To me, someone who cannot eat gluten, good pizza is a dearly missed dish. I've been sampling various GF pizza options throughout this end of Brooklyn and I am convinced that Dellarocco's has the best GF crust! I was hesitant to order because of the $4 extra charge for GF dough, but i will pay it for pizza this good!\n\nAfter much deliberation, we ordered both the Capricciosa (a red sauce pizza) and the Dellorocco (a white pizza). Both pizzas were outstanding. The toppings were evenly distributed, the crust was crispy and crunchy without behind hard, and we were left pleasantly full with some leftovers to take home. My husband, who can eat gluten, agreed this GF dough was great. I can only assume that the traditional crust is delicious! 't had already decided to come back and try other options before we were done eating. \n\nLooking around the restaurant, we noticed how delicious the appetizers looked as well. Without a doubt we will be back and bring friends along. The only struggle will be to decide what to order next!", "author": "Cristin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "If you're looking for great pizza in Brooklyn Heights look no further than Dellarocco. The space is cool and comfortable, and the ambience is friendly and hip. We had the Capricciosa and the Tartufata which were both fabulous creations. Definitely going back.", "author": "Paul T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Nice pizzeria with great bar.  Although we were told they were individual, personal sized, the pizzas are large enough for 2 people to share.  The capricciosa pizza was our favorite.  We also ordered two salads to share-the avocado and spinach salads.  The dressing on the salad was too lemony which overwhelmed the greens and toppings.  The avocado was also under ripe.  Other than that, the ingredients were all fresh and the pizzas were very good.  Service was excellent with very attentive waiters who came around several times to refill our drinks.", "author": "Anda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "Gluten-Free Pizza? Great wine! I love this Place! I was looking for a place near my job that had gluten free pizza. Being gluten free makes you sometimes envy your co-workers that sometimes get company sponsored pizza. Well I am jealous no more. I found this place just down the street and I am ADDICTED. It no happens, I am not the only one, my boss is as well.\nI usually get the red pizza with prosciutto on it. I ask for arugula to be added because I like the flavor. AWESOME. The salami and cheese board is great as well. This place is a must when you want some pizza and wine.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "I think I saw this place on Unique Eats our something like that. Then I saw it on yelp and figured I would give it a try. Its in a great trendy neighborhood in Brooklyn Heights near the water so a nice long walk is recommended after eating here! The ambiance itself is a very laid back, small little spot with a trendy looking red brick oven behind the counter.\n\nMy friend and I split the salami and cheese plate (there was no actual cheese on the plate but still very good). It had three types of prosciutto, these delicious green olives and this awesome foccacia pizza bread...SO delicious! Simple olive oil, sprinkled with sesame seeds and baked to a crispy yet chewy goodness. That alone was good enough for me! Almost filled up on that alone. Finally our pizzas came out. I ordered the 4 cheese white pizza with fontina, mozzarella, gorgonzola and parmigiano. OMG!! It was good, but I'm obsessed with cheese so I could be slightly biased! Each slice had a basil leaf embedded in the gooey goodness which really stood out. My fined ordered the red pizza (can't pronounce actual name and neither could she) with prosciutto, olives, mushrooms, artichokes and mozzarella. Looked amazing but I couldn't taste it as I was focused on my own plate. It makes you realize that Dominos, Pizza Hut, Sbarros and Papa John's are not real pizzas! It's not anywhere as good as the pizza I had in Venice...but close enough from New York. Will go back for the red pizzas next time.", "author": "Monique M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "This is a great little pizzeria in downtown Brooklyn. I had the pie with prosciutto and arugula and you pretty much cant go wrong with that. I also started off with the meatballs. Great spot, great service and the pies came super fast.", "author": "Vincent C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Wandering the oh so lovely streets of Brooklyn Heights one easily becomes famished. With nothing particular in mind redefined to stop in here after seeing the favorable reviews.  Good choice us! The pizza here is good, tasty and definitely worth a return visit. We had a traditional Margherita and a cheese-less Marinara , mmm , mmm.. On par with Motorino and the like.\n\nThe space is pretty spacious and family friendly, what I expected from this neighborhood.\n\nThumbs up on the pizza for this hungry girl.", "author": "Kim L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-28", "description": "It's a nice pizza, but not a great value, clearly geared towards the tourist crowd. The pizzas are thin crust and relatively small. Over three visits, the pizzas have been generally good but a little uneven. A little burnt one time, a little undersauced another time. Nothing major, but the kind of little things that keep you from making it a regular spot, particularly for the price. The meatball appetizer is divine but again pricey for what you get.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "I was in town on business and I'm glad I decided to try it. Food was great, staff was friendly and the neighborhood was a great place for a walk before and after dinner. No regrets. Wish this place was in my neighborhood.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "Excellent and apparently not very known by tourists, or perhaps it gets much more full in the evenings (I went for lunch with some friends who were visiting the city).\n\nJust great pizza. Good service, beautiful establishment.\n\nI want to come back to try all the vegetarian options both in appetizers as in pizzas.\n\nIt's not inexpensive but very worth it.", "author": "Jorge O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "My boyfriend and I live just down the street from Dellarocco's, but hadn't given the place a try because I can't eat gluten -- so we typically assume that pizza is not an option for our dinners out (sad face). But after a long walk last weekend, we were famished, and did a quick online search for nearby restaurants where we could stuff our faces. And behold: that pizza joint around the corner has gluten-free crust! We knew we needed to check it out.\n\nAnd boy, are we glad we did. We dined at the bar on a Sunday night, and the place was bustling but not crazy busy. Wines were reasonably priced (we had a great bottle of Cabernet for $32), the appetizers (eggplant parmigiana and grilled veggies) were delicious -- eggplant especially was insanely good. And the pizza...oh my goodness...maybe it's because I rarely eat pizza or any bread-oriented food...but WOW. One week later, and I still think about it. Toppings? Fantastic, fresh, flavorful. Crust? Crispy, delicately flavorful with a nice char and soft chewiness. And, of course, sans gluten. Added bonus: when the bartender overheard that my birthday was the next day, she poured me a free glass of wine. Awwwww. \n\nIf I had to come up with one knock against 'em, it'd be the weird overhead lighting...once you get settled, it's okay, but this restaurant is just begging for some dim, romantic illumination. Still, we'll be back -- Dellarocco's is the new post-long-walk-face-stuffing joint, and I'm so glad I gave it a try.", "author": "Katie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "We stayed in NY for the first time with a goal to find the best pizza. And we found it! We came here for dinner and the service was fast and friendly and the pizza was seriously something to come back for! The margarita pizza was the best we tried. I will actually miss it when we return to CO.", "author": "Kelly B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}