{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Excellent pizza. \n\n I got the Salsiccia pizza (sausage and mushroom) as take out and imagine it would be even better fresh out of the oven. The crust had a nice crisp/Char to it and was still very light and chewy. Really awesome stuff. Definitely recommend.", "author": "Nick D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "We went in on a Saturday night at about 9:30. We were in and out pretty quickly. We got the meatball and vegetable pizzas. The meatball pizza was ok. It just needed a little more flavor. The eggplant pizza was delicious! We really liked the flavors on that one. The crust was thin and you didn't feel like you were eating all bread. I would definitely order that one again. We also ordered a side of marinara to dip our pizza crust in but instead of them dropping off some little side container they brought us a large dish.. practically a bowl. It was great.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-25", "description": "I tried the Margherita veganized and basically the whole bottom was burnt. All I can tase was the burnt. Looked really nice but basically a disappointment.", "author": "Alejandro A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "High quality pizza, in a cool setting, with great service, at a reasonable  price.\nYou can't ask for much more than that. \nYou really can't go wrong with this place.", "author": "Charles S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Review update. Absolutely love this place. It blows the pants off so many other pizza restaurants in the accompanying Brooklyn neighborhoods, in spite of their popularity or \"high ratings,\" this one has so far been the best of them all. Not going to name names, but there are a few that can be compared to criminal organizations with their policies, pricing and accepted forms of payment, and to top that off, those pizza's aren't even good or worth the aforementioned things.\n\nThis place on the other hand, simply incredible. Yes, I'm using an overly positive word, but it's good, and you will hopefully enjoy it as much as I do.\n\n-Service is super fast, pizza is done almost instantly.\n-It's not crowded, likely due to the overhyped nature of places nearby, but that's a good thing for us locals. If you happen to be a local, please check this place out if you haven't yet. If you're not, that's cool too. Also, it's small so plan ahead if you're going with a group.\n-Pizza's here are basically personal-sized 12 inch pies, the toppings are great, crust is just right (after being educated) with a bit of char. A little soft and a little crunchy around the edges. Recommend you use a knife and fork to eat it.\n\nOverall, I can't really say anything negative so I'll just leave it at that.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Very good pizza and salad. I enjoyed it. Place is very cozy and nice ambience. Very friendly staff.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "We stopped here after touring NYLS dorm because they had gluten free crust and vegan cheese.  One person in our party had the regular crust with meatballs.  Great service and the pies were fantastic.  Pizzas came piping hot and were flavored authentically- fresh basil, EVOO, and toppings were spot on.  Brick oven crust as it should be, crispy on the outside but still tender.  Only one minor comment, wish there was a bit less burnt spots on crust. I had black spots on my fingers.  Regardless, I could eat this everyday.", "author": "Donna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Wow is all I got if yelp would let me do 3 letters. The Tartufo pizza is the bomb digitty ---- so amazing!!!!", "author": "Rich R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "A surprise find in a residential Brookyln neighborhood. The place was packed at dinner time with young families and professionals. We stayed with the wood fired pizza and were not disappointed. We like the ultra thin crust nyc pizza; Dellarocco's was on the thin side with clumps of cheese a la Grimaldi's. The star ingredient was the porcini mushroom topping which took us back to Italy. Service was attentive; young vibe.", "author": "Neil R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "We ordered a pizza to go, waited 30 min, was told they had large orders before us, so was backed up. After 50 min we are stalling waiting, even though several people who ordered before us had gotten theirs long before. No apology, just a shrug. Worst take out experience!!", "author": "LW T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "BEST NEAPOLITAN PIZZA I HAVE HAD OUTSIDE OF NAPLES (ITALY), but most expensive beer I have seen in my life. I am torn on my rating for Dellarocco's because the pizza was wonderful with a thin, soft, yet firm dough, perfectly baked with just the right amount of burnt spots from the 800+ degree brick oven. \n\nThe service was excellent. Sabastion, our server, was attentive enough without hovering or interrupting our conversation and the pizzas arrived post haste as they should from an 800 degree oven. The decor is rather modern, sterile, and boring, not what I would expect in a Brooklyn pizzeria.\n\nI ordered a pint of IPA, but am glad I specified a pint because Sabastion, our server, was nice enough to tell me the $6 IPA was closer to a 1/2 pint than a pint. Where we come from a pint of craft draft ale runs $4-$6, so paying the equivalent of $12 a pint is a non-starter in my book. No beer is worth $12 a pint no matter how good it is or where you are ... \"We're not in Kansas anymore Dorothy!\" Wine is equally overpriced by the glass, although there were several bottles in the $30 range, a more reasonable investment.\n\nThe toppings on the \"Dellarocco\" ($16), smoked Buffalo mozzarella, broccoli rabe, sliced sweet Italian sausage, red pepper, garlic, and basil were reminiscent of pizza Napoletana, not too much, not too little. They even had olio picante (EVO infused with red pepper), the perfect accompaniment to my salsiccia e friarielli pizza ... buonissimo. This is my go-to pizza when in Naples, so my expectations were not high, however, the Dellarocco was THE BOMB folks! \n\nMy wife had the \"Zucchini\" (also $16) with the same superb dough topped with a wonderful zucchini cream, mozzarella, thinly sliced smoked prosciutto, and extra virgin olive oil. It was also delicious, light and flavorful with just the right amount of ingredients so you could taste each individually.\n\nThe pizzas are even the right size for pizza Napoletana (about 13 inches), unusual in the States where most places serve a 12 inch individual pie. An inch makes all the difference folks (I'll leave it at that). Their prices are nearly three times what you would pay for a similar pizza in Naples, but this is NYC (Brooklyn actually) and I have seen prices for an individual pizza ranging from $20 to almost $30, so I do not consider Dellarocco's pizza a bad value. The beer is a different story because I found another place in Brooklyn with several excellent craft draft \"pints\" in the $6 to $7 range, so stop gouging your customers and lower your beer and wine prices a little.\n\nCombatCritic Gives Dellarocco's Brick Oven Pizza 8 Bombs Out Of 10 With Deductions For Ridiculously High Beer And Wine Prices ... More Bombs Are Better!", "author": "Chris S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-03", "description": "The location, the service, and in terms of sanitary this place is great; however, the portion of foods like pizza or meetbals compared to the price is very small. You are goimg to pay 20$ but you may still get out of the restaurant hungry.", "author": "David Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "The restaurant is very simple, tables for 2 people are a little small so you can't put too much food on them.\n\nWe got quattro gusti and burrata parma to try. The crusts were perfect, thin, crispy, soft and chewy which didn't make me feel heavy after eating them.\n\nQuattro gusti: the best one for us would be arrabbiata because it's spicy. We also liked the margherita stq and zucchini but we didn't enjoy the dellarocco much. I think the broccoli in the dellarocco didn't go well with the cheese and sausage. We wouldn't get it again.\n\nBurrata parma: It was really delicious, cheese, prosciutto and arugula went well together.\n\nA lot of people complained about the midde of the crusts getting soggy, I actually like that because I can taste the topping better. Also this is italian style with forks, different with ny's folding the slices.\n\nWe also got tiramisu for dessert. It was different with the ones we tried from other places, it was sweeter, we loved that they put chocolate pieces inside.", "author": "Linh H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "So pleasantly surprised! My 3 hungry friends and I ordered Dellarocco's for the first time the other night and loved our pizzas. Since my NY pizza slice days come only once a month I take every advance to get my fill where and when I can. It's hard to make confident pizza decisions especially when you are willing to verge of gourmet prices. Aka do I order from Table 87 or a slightly cheaper option. Problem solved! Dellarocco's is that perfect balance of totally delicious and not overly expensive. Brick oven baked, super fresh ingredients and even tastier if you add your own drizzle of Mike's hot honey like we did on a few varieties. Speaking of varieties we ordered the best tasting combination for 4 people. Pizza #1: Quattro Gusti ($18) Came with 4 sections in one pie - Margherita STG, arrabbiata, porcini, and dellarocco. This combo was amazing - I would order this again on its own. Pizza #2: a Capricciosa and Pizza #3 a Brigante. Both delicious. If you like mushrooms get the porcini - holy cow it was really amazing and the slight truffle flavor just set it off - I can't wait to order it again.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "Love love and love this pizza.we found by accident bcoz the kids were pretty hungry and they wanted pizza.its different and so fresh!!very nice staff.i will def go back and eat a whole pie by myself .", "author": "Aaa123 K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Great small Pizza place in Brooklyn.\nThe place was empty when we entered, probably because it was during the afternoon (neither time for lunch, nor time for dinner), but didn't regret it.\nThe pizza is baked in a stone oven and you can taste the difference. I had Salsicca on mine and it tasted really great.\nI definitely recommend this place.", "author": "Christoph S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Yes there was a line to get in but it went by quickly and the pizza was fabulous! Worth the wait !", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "3.5 stars. A couple friends and I decided to have an early dinner here on a weeknight. The set up of the place is pretty cozy despite having more space on the other side. Service was good and the food came out quickly. There's a good amount of pizza options on the menu, but not too many options to make your head spin. We ordered 3 pizzas (Margherita, Dellarocco and Burrata Parma), cheese and salumi board and a Radicchio salad. The cheese and salumi board was pretty good, but nothing amazing. You can skip it if you want to save some stomach space for pizza. The Radicchio salad was good, everything that went into it was very fresh. \n\nThe pizza pies weren't cut all the way through and weren't cut evenly, odd. My favorite was the Burrata Parma and as one of my friend's pointed out, it's the Raddicchio salad in pizza form; the main difference was the cheese in the pizza really balanced out all the flavors. I'm usually not a big fan of margherita pizza, but they make it pretty well here, not too heavy. The Dellarocco was just ok, didn't really stand out to me despite being their signature (?) pizza. Overall, this place might not comparable to the more popular pizza joints in the area, but still a nice option to have if you just want some good pizza.", "author": "Geekar L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Went for dinner a few weeks ago with friends. The staff was friendly and attentive (the only thing I didn't like about the space was that our table got a blast of cold air whenever the door opened). We shared the avocado salad, which was very well made. The Pesto Pizza was excellent and I would also recommend the Margherita. This place isn't anywhere near where I live, unfortunately but I would definitely go back if I'm in the Heights area.", "author": "Shani F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "Got a gluten free and vegan pizza. I was initially not going to get vegan cheese on the pizza because I usually dislike the flavor but the lovely waitress let me taste their vegan cheese before putting it on the pizza and I was so happily surprised. Best vegan cheese I ever had. The pizza was delicious and the service was great as well.", "author": "Julia S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}