{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "Great pizza, fast and good service, nicely decorated place, but a bit expensive.", "author": "Ramon O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "A solid, no frills, brick oven, pizza bar.  Yes pizza BAR!  Don't expect a full menu outside of pizza, salad and a small dessert.  Do expect a fully- stocked bar, a few local beer taps and of course Italian wines.  That said, the pizza is great using fresh ingredients and a solid crust!", "author": "Jj L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-18", "description": "Pizza was good but not the best I've ever had - there are so many great places in the nabe, so have to say if it was somewhere else I'd be raving! I like Sottacasa and Sosta - both on Atlantic for gourmet pizza. Salad was good and fresh. Of course Grimaldi's down the hill and a few others as well.\n\nService - lousy. I've waitressed plenty in my life and have a lot of tolerance for meh service but I really CANNOT stand when a waitress come over and says \"Ready\"? (particularly when I was in the bathroom and was just sitting down, and hadn't had 10 secs to look at the menu) No hello, no what can I get you to drink, nothing. The place was quiet and it wasn't late,  so there was no excuse for crap service. Also it's kind of a lousy layout.", "author": "J L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Since Dellarocco's arrival to the Heights, we've wanted to check it out, and last weekend we finally did. I really enjoyed their arriabiatta pizza as well as their white pizza with fennel sausage. My only complaint is that I thought their Grecia salad could have had just a litttle bit more mozzarella.  Will be back.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Thank you dellaroccos for making one of the best gluten free pizzas I've had to date. My recent diagnosis was a sad sad event for me, but you guys have given me pizza back. I heart you.", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "best meatballs, great pizza, wonderful service!", "author": "Felipe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "New pizza place nearby!  Great slice - I had the Dellarocco and it was delicious.  Cozy atmosphere, friendly service - great go-to spot for after work dinner.  And they deliver if you're too lazy.  Handful of beers on tap is a great addition.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "Love this place! Great pizza, lovely little setting, and great for groups of friends or with the family. And they are as nice as could be, especially to our rambunctious little toddler when she's in there.", "author": "Elena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-05", "description": "I made a negative remark about automatically adding gratuity to the check of a 4 person table. The owner (mr Dellarocco) through Yelp reacted to me with apologies. A mistake had been made, under 6 persons gratuity should not be added automatically. Very attentive, apologies accepted. Mr Dellarocco offered next time free dessert when we are in again. Now that's taking customer feedback seriously. Thank you and well done.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-17", "description": "Very good.  The namesake pizza was awsome.  The margarita a bit underdone.  The meatballs were some of the best I ever had -- sauce is top notch.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-19", "description": "Love their pizza, but their Saturday night host is unaccommodating and rude.", "author": "Fern F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-07", "description": "The delivery business is in need of getting its act together. A total mess. Bad experience for a neighborhood like BK Heights.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-04", "description": "The crusts and the mozzarella are really good here and the wood oven is awesome. Staff very friendly and attentive. We would be real regulars if the choice was slightly bigger. Only ONE (non-white and non-Calzone) pizza with meat (cooked ham...) is really too limited. No salame, no tuna or any other fish, no artichoke nor capers. A second star is lost because they automatically add 18 percent gratuity to the bill, which I hate for a table of four.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-22", "description": "We decided to try Dellarocco's for dinner as it is a new addition to our neighborhood. How can you go wrong with pizza? We ordered a Margherita pizza with buffalo mozzarella and an avocado salad. \n\nThe order came in a timely manner (about 30 or so minutes) and, was correct (I had made a change to the salad). However, that's where the positive review stops. The salad, $9, consisted of a few pieces of spinach, hardly any avocado, and some onions and four orange slices. I know this is Brooklyn Heights and prices are high, but at least serve quality food and give us a salad, not just what looked like some leftover spinach. Such a disappointment. It looked like someone ate most of the salad and left what they didn't want. It wasn't even enough to split between two people. Then the pizza, $15, cold and a mess. Honestly, the pizza was nothing to write home about and certainly was not worth $15. No flavor and mushy. The cheese was falling off, the crust was burnt, it was gross. Unfortunately, we went to get a second dinner.\n\nAt least we tried it, but will we order again? Absolutely not.", "author": "Jana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "Delicious! Their red pies are pretty standard (good but nothing special) but I LOVE their white pies. The porcini one is to die for. I live a block away so do takeout a lot -- not sure I'd do it if I lived further away though, the centre of the pie gets soggy even after just those few minutes. The premises are nice -- clean and airy -- and the staff are always prompt and friendly.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Love the pizza, one of my staples when I'm at home! Such a cute place too, even though I tend to get delivery...", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "loved it! perfect pizza, great dough, not too think, not too thin. tasty sauce. and cooked just right. also, the restaurant actually gives you space to spread out a bit, not like other places that are too cramped. and the waiters do not push you out. I would return.", "author": "J P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-06", "description": "Best Choice!!! \n\nI have visited this restaurant several times, each experience has been better then the last and I just enjoy the luxury of having a delicious restaurant close to my house. \n\nWhen you visit don't be afraid, try a new type of pizza or dish, I have always been pleasantly surprised. Its not like anything else in the neighborhood. Finally, you can go to a place with a nice, clean, lively atmosphere where you can share a pizza and a  drink with some friends. \n\nOn those cold nights you can have it delivered and be sure that you will receive the best service as well. \n\nNote*****Most of the pizza sizes are meant to be for personal servings or shared max. by two ppl.", "author": "Nina M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-17", "description": "I really want to love this place. I really love The Heights and their owners. But, at least on day six, there is just too much oil on this pizza. I've had other Napolese pizza that is not as oily. Skip the drizzle and the sauce was good. The reviews, I think, are overrated but that may be due to the serious desire for this style of pizzeria in The Heights. It's like this: if you lined Dellaroccos up next to other similar joints I think the reviews would read this way: use less oil, don't overstate, let the ingredients stand alone, cook the crusts a minute longer, and add wines by the glass and then my friend, there could be no better.\n\nBut the cannolis! No, really. THEY are DIVINE. And I hear the meatballs are sublime.", "author": "Heather B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-19", "description": "$18 for a 4 slice pizza with sopressatta and mushrooms? And a bit soggy too. No thank you, I'll stick to Fascati and My Little Pizzeria", "author": "Cecilia R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Dellarocco’s Brick Oven Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "214 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/J89IACcXF-UkBJgEkx65UA/ls.jpg", "@type": "Restaurant", "telephone": "+17188581010"}