{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "My friends and I went to NYC to check out various bars for a week. Out of all the bars we checked out, this is the bar that we stayed the longest at and had the most fun at. \n\nEvery drink we tried was exactly what it needed to be...delicious, balanced, and fun. You won't find yourself looking at the menu perplexed by ingredients that you've never heard of, that's not what this bar is about. \n\nThe food was delicious! we ordered several items and even ordered the pork shoulder twice!\n\nWe were lucky enough to catch Ivy behind the bar. She was a wonderful host and along with the rest of her staff, absolutely made the experience for us. \n\nA common theme of our trip to NYC/BK was having to wait outside of bars, being told where to sit, being told we can't come in, being told that we'd be called back later...Leyenda was a breath of fresh air and hospitality that is missing at a lot of New York bars. Can't wait to come back! Thanks Ivy!", "author": "Miguel S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "Completely underwhelmed and not impressed with my recent trip here. Bartenders were aloof, slow and confused with orders and what were in the drinks. I watch one of them take 5 shots in the 30 minutes I was there. Very unfortunate since its also owned and ran by people at Clover Club, which is an excellent cocktail joint.", "author": "James H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Great place, great service, food and drinks! I like that is not your typical Mexican place but it has a variety of Latin cuisine dishes. I had the mofongo and was pretty good and juicy. The environment was pretty lively and fun. There is a good list of cocktails. The prices are pretty reasonable.", "author": "Elisa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "Amazing cocktails and pretty good food! Our waitress was attentive and very sweet. I'll definitely be back!", "author": "Lara C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-05", "description": "Its no surprise that I feel exactly the same way about this place as I do about Clover Club; they're owned by the same people.  Yes your staff knows everything there is to know about everything that has ever happened in the bar world, but you're just NOT friendly.  I don't want to be made to feel bad about not knowing what something is when I'm spending $15 a drink. Yes the cocktail was good, but it wasn't good enough to make up for the fact that I had to wait almost 25 minutes for it and was only given sporadic attention by my server who had a chip on her shoulder.  I hate leaving a place feeling like I've been scolded and ignored.....and then asked to pay for it. \n\nAlso, the food was HORRIBLE.  There's no flavor to what is supposed to be \"South American\" food.  Our rellenos were mushy and soggy (I'm used to rellnos having a crisp outter shell but once again maybe I just don't know anything).  I will say that the guac in 1/2 and avocado shell was a super cute presentation but spilled everywhere as soon as I tried to take a scoop with a chip.  \n\nI gave two stars because the decor is nice albeit very fresh looking with little character, but I assume that will ware in as the place gets older.", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Love this spot. Great drinks and small plates. We sat at the bar early on a Saturday and by 7pm the place was packed. Looking forward to the outdoor patio in the warmer months. A good spot for a date night, happy hour or whatever really! Friendly service and fun atmosphere.", "author": "Christine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Awesome food! Everything was delicious! Drinks are great as well. Overall another good place in the neighborhood.", "author": "Guzal R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Great spot with good decor, outdoor space and amazing food and drink. The cocktails are delicious and unique. Some a little more experimental then others but there are definite tried and true winners. Try the Shadow Boxer. Nice and boozy. The foods amazing but a little sparse so if you are really hungry oder a lot. I could probably eat 9 tacos.", "author": "Gaelen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "Last night I had the most beautiful cocktail -- mezcal, tequila, a cherry liqueur. I much prefer drinking something on the rocks, but I'd heard the drinks were excellent and didn't want to miss anything. HOO BOY. It was awesome. Sweet and flavorful, and I could still taste the booze. The food was good, the ambience is great, but I loved my drink.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "My fiancée and I stumbled upon this place while we were looking for a good place to end a night out in Cobble Hill. The cocktails were AMAZING! My fiancée and I loved the Latin themed drinks, especially La Sonambula, so spicy, but I couldn't stop drinking them. It was quite crowded and you have to wait a bit to get your drinks, but frankly it's NYC and any good establishment should be packed even on a Tuesday night, in the summer. The drinks were well worth the wait! We sat at the bar and the bartenders were courteous and attentive the whole time despite being seemingly slammed with orders. \n\nEven though we had already eaten, the menu enticed us to order a night cap, the Goat Picadillo Tacos. They were so delicious, my fiancée at two of the three tacos and she doesn't usually eat meat. They have a host of small plates that look very good as well, but we were already pretty full from dinner. I definitely want to come back and try a lot of the food options. \n\nI am not a fan of some of the overly pretentious cocktail establishments that have popped up around the City the past few years, but this combines the quality and inventiveness of those establishments with a laid back atmosphere and attentive staff. It's a great spot and next time we are in the area we will definitely be back.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-16", "description": "A bad attempt to open a Mexican restaurant. It seems like Dominican trying to be Mexican. The micheladas  were like nothing I've had before (terrible) and the food was drowned in some weird, salty sauce. This puts Mexican food to shame.", "author": "A M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Sat night, the place was full but the stuff was friendly \u0026 quick.\nWe enjoyed the Guacamole, House-made Chips \u0026 Salsa,Colombian Papas Rellenas ,Peruvian Ceviche \u0026Tinga tacos. Everything was fresh \u0026 delicious!", "author": "Dina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-20", "description": "We ordered the fish tacos, the tamal de maiz, and the guacamole. The food was good but the portions  were small and overall overpriced. The service definitely leaves something to be desired. With all the other places to go, I won't be coming back.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Great small plates to share so you get a taste of everything. Strong, nicely mixed cocktails. Happy hour from 5-7. Nicely finished space, it is very warm and inviting. Great for a date night, happy hour or a dinner with a small group.", "author": "Mia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "love this place!\ndelicious cocktails\nand small plates\nlet you taste a variety of dishes\nfocus is on latin america\nand food is top notch\ncozy intimate vibe\nI've been about 10 times\nand its becoming a regular go to\nfor fun lively food and drinks\nhighly recommended!!!", "author": "RICHARD R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-07", "description": "busy on a Saturday night but at least they serve food until late and that's what we were after, 5 places we tried first had already closed their kitchen by 11 pm, I thought this was nyc! diverse food/drinks, a little too expensive/trendy for my taste but it seemed like everyone else was loving it", "author": "Aubrey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Delicious cocktails, great, attentive service, compelling menu where I literally wanted to just tell her to bring me one of everything. Every dish was spot on, and I couldn't possibly pick a favorite, though the skirt steak, shrimp arepas, and goat tacos were a standout. Top that off with a warm and beautiful atmosphere. I'm a sucker for a tin ceiling and intricately carved wood. As far as neighborhood bars go, this is as good as it gets for me.", "author": "Renee I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "Drinks: Good to great. Whether you like what they serve really just depends on what you get. Drinks are all made very well; it's just whether you like that set of ingredients or not. And the bartenders are friendly, nice, and not snobby.\n\nFood: Legit. Get some.\n\nService: Ok when not busy. Understaffed and/or slow when busy. Been twice. The first time it was great but it wasn't busy. Also went last Thursday and it took the waitress 15 minutes before we even got  a hello. She didn't seem to know if we had just gotten there or were waiting awhile. Fix that. \n\nDecor / Ambience. Eh, ok-ish. Two issues that you can fix. FOR THE LOVE OF GOD, please refinish the surfaces on all of your counters or tables. EVERYTHING is sticky in here! I'd rather just get drinks to go, if that was possible. Also, installing another bathroom would help. \n\nYa got the makings of greatness but need to tune up some stuff.", "author": "S. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "This place is the shit, the staff are knowledgeable and look like goddamn movie stars.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "This place is excellent. Super cute space, really nice staff, and phenomenal food and cocktails. I can't speak for a huge range of their food, but everything I've had has been delicious (though small portions). The cocktails on the other hand -- they are all amazing. The best, by far, is the Cabezaso, I've honestly never had a better cocktail.", "author": "Olivia W."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}