{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "The Boo and I went here for cocktails and they were EVERYTHING!!!! The food, small portions (tapas) so go having had dinner and order up the drinks. The ambiance is beautiful and intimate. Great spot for a first date, or a 50th date!!! Just go!!!", "author": "Jeanene B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-09", "description": "Stopped by last month for \"Sleyenda\" which was touted as a Beyonce themed pop up for the holidays. Besides the menu card which had a picture of Santa that said \"I sleigh\" there wasn't one nod to the Queen Bey in the place...not even a Destiny's Child song from the Christmas album included in the soundtrack. Perhaps the theme was over hyped online, but I felt a bit fooled by the advertising. \n\nRegardless of the deceptive theme, I'd give three stars for the overall experience. It's a great little spot tucked away on a busy street. While some of the spots in the areas have lines for days to squeeze into brunch, there are plenty of tables and room to move around inside. \n\nThe cocktails are great. I had one of the holiday specials. You can tell there was time and effort put into creating these drinks and it pays off. The food on the other hand is just average. The guacamole and chips are quiet nice and the guac is served in the avocado - it's on the small side so order a couple if you're sharing with a big table. I also had the mole enchiladas in which the ingredients seemed rather simple.  \n\nMy recommendation would be to go for the cocktails. If you want order food, then grab a few plates and share as they're on the small side.", "author": "Jesse S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "This review is a drink review. After having brunch we wanted to grab a drink, I remember seeing this restaurant pop up on my Yelp suggestions. The drinks looked tempting so I ventured . I got the Horchata colada. The drink was tasty but somewhat on the sweet side. The staff was friendly. My friend got a drink that wasnt so good, however they exchanged it for a daquari and he was fine. I'd give them another try.", "author": "Liz D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-27", "description": "Just another cocktail bar in Brooklyn. Nothing so great about it but if you're just looking for someplace to sit down and have a drink, this place is fine. I actually came here the day before my birthday just because it was someplace nearby. I like that they have an extensive list of cocktails and the ingredients in the cocktails or you need. The food menu could be expanded a bit more.\nAt night, it's a dimly lit restaurant/bar with a chill atmosphere. It's a nice environment for a date or for a small group gathering. I went on a Monday night and it wasn't packed but it also wasn't empty. There are a decent amount of chairs at the bar but when me and my boyfriend came in, we took the last two chairs. \nThere was only one bartender on Tuesday which I could understand however, it took way too long to make one cocktail and one beer and when we asked for the check, but also took a long time. If the bar is going to only have one person, they should make sure that person is capable of moving quickly.\nI have this place on my list of places to try because their happy hour is pretty nice; seven dollars for cocktails. Maybe if I had come at that time, I would've thought the experience was worth the money.", "author": "Angela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-19", "description": "Excellent cocktails, great vibe. Everything is really well balanced and never overly sweet, which is a big pet peeve of mine. I got a cocktail with tequila, aloe liqueur, pineapple and sage. It was excellent.  It's definitely a little pricey. $14 cocktails means I often try 1-2 cocktails per visit. Go to Leyenda, you won't regret it.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-01", "description": "Things started great. Ice cold beer , frozen glasses and the food is actually quite tasty. The only hiccup was I was basically edged out of the seat I had been sitting in at the bar(I had food and drinks by the way and not overly long I might add. Side of quac $10 and Skirt steak, $17 comes with no sides ) by the very bartender that served me along with other co-workers as the shift ended. I had to make room for them to visit and settle their shifts payouts and get their paychecks, eventually relocating so they would have room.\nOther wise I would scale the food much higher. Since I just mentioned it was my first visit I was surprised to have been edged out to make room for the staff. Best part management watched and it didn't phase them. Disappointing:(\nGive the food a try might be a great to go order.", "author": "Phil W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "Stopped by for drinks after seeing Jimmy Kimmel Live. Very nice inside, warm and inviting, a little cozy. Unfortunately we weren't eating, the prices were a little high, but the menu looked good. I just had a beer and my girlfriend had a cocktail. The cocktail was a good mix and tasted very good. \nThe service here was eh. I can't really blame it on anyone since it looked like the bartender pretty much did everything.  She sat people who were waiting to eat, took their orders, bussed it to their table, and cleaned the tables. Needless to say, it took a little while to grab her attention when we were trying to get the check. The waitress herself was very kind, so again I have nothing against her, just poor management decisions. \nAs soon as we paid our bill and got ready to leave, there was another guy and girl that came out from some back room and finally started helping, but it was already too late.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Basing this review on service and ambiance...\n\nLeyenda was a good time after a night out on Smith Street. Stopped by because a friend know management, and I'd already gone to Clover Club a few times (it's right across the street). Britt was an awesome (and patient) server, and everything was great. For drinks, I defaulted to the El Diablo, a ginger/tequila mix that was pretty good. The spicy margarita was also done really well, with the right amount of kick.\n\nDefinitely want to come back here and try it again. I've been looking for a good Mexican place near me in BK and I think that I finally have one.", "author": "Karsten V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-02", "description": "I would give this place five stars if not for the treatment we received from the host. The drinks were great, the food was great and the bartenders were amazing!  When we arrived it was a crowded moment and the host basically told us to leave, there was nowhere we could wait. We asked to stand by empty bar table but told we could not. We stood by the bar and ordered a drink and we found a seat at the bar in less than five minutes. Everything was great but except for the negative attitude of the host.  We had been super excited to come try this place but were almost convinced to leave.", "author": "Josh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-10", "description": "This place has a nice weekend scene. The cocktail menu is extensive and good. The service was prompt and polite. The vegan offerings are few, but tasty. My companions thought the portion sizes were too small, I thought they were fine but could have been more flavorful.", "author": "Lindsey C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-09", "description": "Eh. The drink I had (Double Salute) was delicious but way over-priced for the size. Once you remove the huge whiskey ice cube, I probably had 4 oz of a drink for almost $20 after tax and tip. Whack. The soup i had was also very unremarkable. The service was good but I'd never come here again unless they chop their drink prices in half and use bigger cups without including mountains of ice.", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "Came here mainly for the food but ended up getting drinks also. Didn't really expect much from this spot but wow - it definitely did not disappoint. I got the \"Who Goes There\" cocktail which has blanco tequila, aloe liqueur, pineapple, sage, lime, celery bitters, and it was so light and refreshing. My friend got the Shotgun Wedding (Gunpowder tea infused singani, cachaça, palo cortado sherry, coconut, vanilla, lime, Mexican fernet, nutmeg), which was a touch too sweet for my tastes but still a great cocktail. The food at this joint is also spectacular - i went with the Churrasco skirt steak which had chimichurri served along with it and i also got the pollo tacos (grilled Jamaican jerk chicken breast with onions, cilantro, and jerk sauce). SO GOOD. If you have any gluten sensitivity this place also caters to your needs! The tacos served here are made from corn and not a corn/wheat blend as some spots serve. \nA Friday night wait around 8:30 was only like 5-10 minutes and the place remained full, but not packed. It's a cozy and intimate spot, if you are ever in the area, be sure to check it out! I don't think you could go wrong with either the food or cocktails.", "author": "Masha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "The most important thing about this place is it offers small plates. I'm not a big eater so I like the small portions.\n\n I was here with my son and husband they're bigger eaters then I so we ordered six small plates what a variety!\n\nI imagine this is a great after work stop as it offered  happy hour prices which were a bit pricier  then what I am used to coming from a small town but that's the way it is when the country mouse goes' to the big city!", "author": "Joan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "Came here for my birthday on a Saturday afternoon. We sat in the cozy area in the back, which was great for a group of friends mostly having drinks and not food. \n\nThe good: The drinks are incredible. The whole menu is so creative and has such a diverse range of bases and flavor profiles to choose from. We had a group of 12 having several drinks, so among all of us we tried basically every cocktail on the menu. The Chiller Instinct was a popular choice among the group (bourbon, sherry, passion fruit and vanilla liqueurs, cinnamon, lemon oil). My personal favorite was the Date Night -- the salted butter washed rye made it a dessert-like cocktail without being too thick or syrupy.\nWe didn't get dinner, but we ordered the guac and the chicharron and both were tasty complements to our cocktails.\n\nThe bad: Our server was frequently MIA and seemed irritated with us the entire afternoon. We were a sizable group but were only given one menu to share among us, and we frequently struggled to get the server's attention. The restaurant is not that big and there were several servers working, so I don't think being busy was the issue.\nAlso, a note to management: the pew benches in the back need to be sanded or re-finished. I was wearing a skirt so my legs were touching the wood seat and I got some small splinters in the backs of my legs.", "author": "Kristen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Fun place! I came here for drinks and they have a decent happy hour with good options. The food is a little on the pricy side but the food is good so worth it. I like the look of the place- has a rustic Mexican feel and the service is good. I had the hora drink- refreshing, with a kick of spice. Is a little more of a summer drink I would say cos of the fruitiness. \nCome here for a date, it is on the quieter side unless it fills up so is good for conversation.", "author": "Rits M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I visited this place recently with a friend and I loved it.  The food was great and the atmosphere was very laid back. I'm so sad that I didn't take a picture of the churros! They were amazing and definitely worth remembering. I'll be back though :)", "author": "Jeannette M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "The service is 5 stars.  The food is 3. I ordered Arepas and Civiche. The drinks are filled with ice. I ordered two shots of rum so I didnt feel like I was wasting money. Great environment.  Next time I know what to order.", "author": "Brooklyn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Decided to eat dinner last minute and lucky this place came up on my Yelp search. Easily accommodated but when we arrived the place was quite packed. It was a Saturday evening and it was raining, I would expect it to be empty but it sure wasn't. Host was very nice and helped us get situated quickly. \n\nFrom the menu, you can see that drinks are a-plenty. Most of the patrons were just drinking alone vs dining. But we came to eat, so eat we did.\n\nWe started with Guacamole- Even though 4 of us shared it (few weren't that hungry), it wasn't really a big portion. If you have a hungry group def get 2.\n\nFlamed Shrimp Arepas- This was surprisingly very tasty. I liked the corn cakes (arepas) a lot. The set up is not the traditional setup. It was like a sandwich- 2 corn cakes with the stuff in the center. \n\nSkirt Steak- Very delicious.\nTacos- Pulled Pork and the Roasted Chicken. Three per order (so we did pork and chicken). Both were tasty but I preferred the chicken.\n\nI had the Hasta Pronto Drink.\n\nOverall a very good meal. Would def come back.", "author": "Kemi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Wow! Five stars! The drinks were amazing and the food just as good. The place has this weird aura that makes you want to stay. We sat in the back patio which was surprisingly cool, even on a 90 degree day. Not much to say except TRY THIS PLACE. You'll love it!", "author": "Amber W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "I simply love this place. I first visited last year on a trip to NY. Now that I've moved back, I've come here alone at least 3 times this months. \n\nThe decor is gorgeous. It's a smaller place but they've made excellent use of it. I would definitely recommend Leyenda for a date night. It's a great looking place and the music isn't too loud that you can't have a conversation. It's a very romantic setting. But it's nice if you're alone too. \n\nThe bartenders are very nice. Attentive and knowledgeable about the drinks and menu. The drinks are an experience themselves. Worth every penny ($12 and up each). They're just strong enough and artfully made. The flavor profiles are complex and interesting. You'll definitely enjoy whatever you choose. \n\nI haven't had a chance to try any of the food besides the churros. But they were amazing. I can't wait to go back and try the food. Give Leyenda a try!", "author": "Ray A."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}