{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "This is one of my absolute favorite spots in the neighborhood. The owners, bartenders, and servers are all amazing, and have on multiple occasions introduced themselves for a chat. The food is impeccable (try the steak, and the chiccharones!) and the cocktails are unbeatable (somnambula is my favorite). Don't miss this place! Great atmosphere. 10 out of 10.", "author": "Kait W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "I really enjoyed this spot. My husband and I stopped in on a Friday night and sat at the bar. There was a great vibe and a lot of energy, it seemed everyone in the restaurant was enjoying themselves.  We ordered the skirt steak, beef rellenos, fish tacos and spinach empanadas and everything was delicious. My favorite were the fish tacos and the beef rellenos. Drinks were also very unique and delicious. I didn't know what to get drink wise and the bartenders let us sample some of the beers and mezcal (never had mezcal before) which was very helpful to us in deciding.  Definitely a fun date spot with great energy, food and drinks!", "author": "shana l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Cool new cocktail bar and restaurant from the Clover Club people. Had a great jalapeno tequila cocktail (Sonambula) very reasonably priced at $11. Also had dinner at the bar. Ordered the \"Grandma Toress' Pernil \u0026 Mofongo\". The pernil was excellent, but the mofongo wasn't very mofongo-like. Kind of just a small clump on the side rather than a mountain of meaty mash. It was still good though. It was pretty busy on a Saturday night, but I would gladly return for day cocktails!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "I most honestly say I love this place! Has great ambiance and music with low key romantic vibe. The best thing they have is the service!!  The food is great! We have tried the ceviche which is great and the Cochinita Pibil tacos are one of the best tacos I have ever had. The guacamole is also great but.... the \"sauce\" is so bland. They do not have a spicy sauce at all. The sauce they serve taste more like tomato sauce than spicy at all but the reason I adore this restaurant is because I always ask for them to make me a dipping sauce that is spicy as I looove spicy food and they are always super accommodating will retry until they make something spicy enough to my liking. I would recommend this restaurant without skipping a beat!! Best \"mexican\" in brooklyn!", "author": "Dharma B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "I feel like I'm always on the hunt for a new fun place to catch up with a friend and grab drinks and bites.  Leyenda came up on the map, and it was a perfect choice. Great craft cocktails- came for happy hour. Between us, we tried probably four different ones, all were really good! Da Hora was really nice though a little fruity for me.  They sweetened my mojito no sugar order with muddled strawberries, excellent addition!!! And the shadow boxer was a great close, which might have grown a hair on my chest! Awesome combination of flavors, all making for a very enjoyable experience and an even better time ;)\n\nFood- really fresh and tasty! Guacamole and salsa, could have been spicier, but still very good. Ceviche was really excellent and the highest quality of tuna! Really fresh!!! \nSkirt steak cooked perfectly with an excellent chimichurri sauce on top! \n\nDefinitely will be coming back to try the rest!", "author": "Yana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "This place is so good! We had a party of 3 and sat inside. The service was a little slow but very friendly and helpful. We ordered guac to share and entrees of the arepa with shrimp, chicken tacos and the steak. I tried everything and it was all delicious. The drinks are super yummy. I can't wait to come back. How did I not know of this place before? I feel like I've been missing out and it's very unsettling. Good thing I know about it now. You probably should too.", "author": "Leilani L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-26", "description": "Really enjoyed the drinks but sad to say was not impressed by the food.  The atmosphere is busy, quite loud, and a bit too cramped.  After giving it two tries, I'll say that I would surely stop by for a cocktail again but can't say I would be willing to give the food another chance.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-14", "description": "Please don't go here. It's highway robbery. \n\nIt's so overpriced and not authentic. Starters are amuse bouche sizes and entrees are appetizer sizes. It's so not worth it - I would understand if the food was excellent - it's just ok and again not the real deal by a long shot. The pupusas are a joke. Got swordfish skewers (\"deconstructed\" tacos) for $15 and it came with 3 thumb size chunks of swordfish, tortillas and veggies and guac - meh on the taste. Service is slow. Drinks take a little longer than expected (dinner time on a week night). It's not good, don't be fooled.\n\nThe place looks nice and is packed but it's got awful acoustics (super loud) and it's kinda tight inside.\n\nI don't mind spending on GOOD food but this is not right in so many levels. Skip this spot.\n\nConclusion: it's a hip spot waiting to rip you off with fancy cocktails and \"exotic\" latin food.\n\n1 star - Witching Hour cocktail (it was amazing) (and honestly cocktails are good - but that is expected)\n2 star - hip looking", "author": "David R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-10", "description": "Don't expect to bring a date in here and have any conversation it is so loud that you can't even hear yourself think.  The drinks are really good it's more of a drinking establishment and eating establishment we did order some food including the skirt steak which was delicious and the mofungo pork which was also excellent.  Service was present but I had to cut my visit short because it is so loud and the woman sitting next to me was wearing so much perfume that I couldn't breath.  Have an outdoor patio in the backyard, and when the doors open it tends to be very hot inside. \nBut it's a cute little place .", "author": "Susan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "Fun bar, they tables were a bit cramped, but all the food and drink were good.  We had taquitos and the relleno, both were good and flavorful.  The staff was great- I knocked a drink over bc 1) I'm a clutz 2) tight tables and they brought me a new one right away and didn't charge for it, so that was nice.  They had a great cocktail list, I would def go back.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Intimate lighting and sexy ambiance (check)\nHooks for my bag (check)\nDelicious drinks (check)\nExcellent service (check!)\n\nWhat's left? Just pick up that super cute hipster hanging out by the Deli and you are good to go! Minus one star because the drinks are expensive ($12-$16) and let's face it. Living in New York is expensive!! Stop pretending like it isn't. They do have a happy hour but sadly we showed up after 7pm. \n\nOverall: I would recommend this place to someone who wants to impress their date, but not look like they are trying to hard. And afterwards you can take your date to the Brooklyn Promenade. So cute!!", "author": "Alyssa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Selfishly I'd like to give this place a bad review just because IT'S SO GOOD and I want to keep it all to myself. However, since it was comfortably busy when I was there on a Thursday night I guess the secret is out and it wouldn't do any good any way. \n\nSo....in the interest of being honest and forthright let me tell you the following:\n\n1. Every dam thing is delicious\n2. It doesn't make a big deal of it but the menu has fantastic vegetarian options\n3. The drinks are ERRTHING (I'm personally a fan of the Feeling Catcher but you should do you, can't go wrong)\n4. I just left and I'm ready to turn this cab around and go back to lick my plate. \n\nMy sister and I had guacamole (delish), tamal (unctuously creamy and amazing), papusas (two words: pickled slaw. Also, whatever that tomato relish is underneath I'd like a jar), empanadas (more please) and  Bibb salad with cashews and hearts of palm (speaks for itself). \n\nBasically the environment is just right for friends or lovers; the menu offers truly well crafted and yummy food for carnivores and vegetarians; the cocktails are appropriately complex yet easy to enjoy; and finally, don't come here cause you'll tell your friends and they'll tell their friends and it will be ruined for us all. \n\nKidding. Slightly. \n\nIt's mine, all mine!", "author": "Susan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Oh my what a great little place! We came in for a bite and some drinks, and really enjoyed every min of it. Drinks here are over the top delicious! Small cute and quaint place, they even have outdoor seating in the back, but it was way too hot for us to be outside. Can't wait to go back and try more things on menu. We had mofongo with pernil. The mofongo was moist with the juice added from pork to dish. It was very tasty, not greasy or dry, and had to be my favorite dish along with the relleno de papa! Honestly I could just eat plates of that for days. Oh wait, let's not forget the guacamole! Everything was really good.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "I typically find most mixed drinks too sweet for my taste, and the bartenders at Leyenda managed to get me to order 3! Though I expected it, given the background and pedigree of Ivy Mix, the owner, I was still impressed. I started with La Sonambula, which is a spicy jalapeno-infused drink, and then switched to Lil Smokey, which was a delicious infusion of smoke and sweetness. My friend and I split an order of guacamole and I ordered the Fautas. The guac was fantastic (and a pretty generous portion) but unfortunately the Fautas were only average - they sort of reminded me of microwaved taquitos. My friend, however, got the Panuchos, which were incredible. All in all, 5 stars for the fantastic service and drinks.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "I recently hosted a baby shower for my good friends at Leyenda and could not be more pleased with the service, the food and the entire Leyenda team! The entire staff was nothing if not accommodating with my requests from start to finish, a true rarity when you are planning a Sunday brunch for 10 people. I pre -ordered some delicious chips and guacamole, and some pitchers of the Roshambo  (High proof blanco tequila, manzanilla \u0026 amontillado sherries, Basque cider, carrot-chili shrub, pineappple, grapefruit, lemon) which were a big hit!\n\nWe ordered off the brunch menu, which was DELICIOUS. A big standout was the sides of chorizo, which was some of the best I have had in a long time.\n\n\nAll in all, everything was perfect, from the service to the fantastic food and drinks! The parents to be could not be happier, and we truly had a fantastic time- can't wait to visit you all again!", "author": "Deborah E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-08", "description": "Slowest service on smith st. Only worth going for happy hour and sitting at the bar. Waiters are very slow in getting to you. Food isn't amazing just ok.", "author": "Yuca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "The food was AMAZING! For the most part the dishes are small servings but it was worth It! My boyfriend and I got 4 things and each was just as good as the next. The servers were very attentive but not overbearing. It is refreshing going to a place as a person of color and not have the waiters always looking at you as if you are going to walk out on the bill.", "author": "She S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "One of my favorite cocktail bar ever, the feelings catcher is probably the best cocktail i ever had its just an amazing place, i recommend if your in the area stop in if your not in the area find a way to get there.", "author": "Cesar G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "I've been to Leyenda for drinks, which are great....you would expect that as the owner also owns Clover Club across the street. Today I went for brunch. First warning bell was that the place was empty at about 12.15. Not one single person. I ordered the hangar steak with two eggs - mine were scrambled. My better half ordered the same with eggs over easy. \n\nThe waitress was very pleasant and the decor is cute. I wish I could say the same for the food. When our dishes arrived the steak (and my scrambled eggs) were swimming in a pool of oil.  The steak comes with a chimichurri sauce, most likely the source of the oil. My partners eggs were over done, the waitress was observant and proactive in re-doing them when she saw him separating the yolks from the whites in the oil slick. In a way the overdone eggs were a fluke for my partner as I'm not sure how he would have eaten his eggs if they hadn't been redone on a separate dish - the yolks would have broken right into the oil otherwise. \n\nI ate my meal as quickly as I could. Both the eggs and steak were very tasty, but if either had gotten cold in the oil bath I wouldn't have been able to go any further. To Leyenda's credit when the waitress checked in with us and we told her not all was right, she removed the charge off our bill. \n\nI'm writing this review with the hope that the owner or manager  sees it and reviews this menu item. I can see from previous reviews that they seem to be quite responsive. Leyenda has great potential and should be packed like many other brunch spots in this affluent area of Brooklyn.", "author": "Craig N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "I arrived with my boyfriend at 1:35am. They close at 2. So I figured it wouldn't be a problem. There was no costumers. But two people behind the bar. We really wanted Mexican so we decided to go in anyway because we were craving it. One foot in the door and they said they were closing. We said \"we just want some tacos to go, can you do that?\" And they said \"no we are closing\". So zero stars for closing 25 minutes early.", "author": "Ghevon S."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}