{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "Food was delicious, but portions were pretty small for the price. The drink menu was exciting, even more so during happy hour, which definitely made the experience better. I also realize this is primarily a bar, but it's advertised as a restaurant all over. I would go back for their drinks and snacks.", "author": "Natasha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "This is a welcome bar/restaurant in the neighborhood that is worth a trip from Manhattan. The food and drinks are fabulous. The staff is really nice. The atmosphere is hip and comfortable. I recommend the flautas as they are pretty and really good. But don't come too hungry as some of the portions are quite small.  The guacamole is very tasty but don't order it to share as it appears to be 1/2 an avocado.   I want to give this place five stars but I feel insulted by the size of the guacamole.  I mentioned it to staff when they opened hoping they would listen. But it's still the same so I'm sharing it here. If they fix the guacamole portion I'll raise to 5 stars.", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Best drinks ever!!! The drinks were very unique and delicious. I recommend the headless horseman. The food was also stellar. One of the best bars we have been to. Service was wonderful. The bartenders were very helpful, professional and skilled. I would recommend this place to everyone. In fact we will be bringing our friends here on our next trip to Nyc.", "author": "Francisco M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "The drinks are soooo awesome and had a few apps which were great as well. Place was packed but never felt rushed to leave. Can't wait to come back.", "author": "Maria V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Every cocktail is unique and expertly mixed and STRONG. They also are well priced and made quickly compared to other fancy cocktail joints. The appetizers are small so I wouldn't recommend it for a full dinner. Anything fried is delicous, esp the papas rellenas and the ham and cheese croquetas.", "author": "Debbie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "a welcome addition to the neighborhood! Clover Club has remained one of my favorite bars, and this is a great companion spot that i will undoubtedly add to my rotation.  for food i had the Colombian papas rellenas and Ham \u0026 Cheese Croquetas -- both quite tasty -- while my husband had the Goat Picadillo Tacos, which were very flavorful. i wouldn't say any of them were the best tapas we've ever had... but we were definitely content. we also had the churros for dessert, and those were excellent, i definitely recommend ordering them.\n\nfor cocktails, my husband ordered and loved the Cabezaso, and i had the Hey Suze and then the Brooklyn Burro (as the waitress explained it, their play on a Moscow Mule.) both were excellent -- creative, tasty, and not overly sweet -- i definitely want to go back and try more of their cocktail menu!\n\nservice was excellent -- i really, really liked our waitress -- and sitting outside in their backyard was absolutely lovely (the one thing Clover Club's been missing is outdoor seating.)  all around, very happy with our experience!", "author": "Lily T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Delicious cocktails and great atmosphere. Cute little fireplace in the back. Friendly staff that know what they are doing. \nDem Apples and The Headless Horseman = amazing.", "author": "Jen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Really cool little Latin cocktail spot. The drinks are excellent. They seem to be focused more on Mezcal, Tequila,Pisco,Cachaca and rum rather them whiskey, gin, vodka etc. Try a Shadow boxer. Especially if you like compari. The food menu looks really good, however I did not try any. The atmosphere is really nice to. Very laid back. The big windows in front open up which is perfect for the summer. I'm looking forward to visiting this new spot many times.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Busy night but got a seat at the bar with Sam as a bartender. Extremely knowledgeable about and cool to visit with. Food was outstanding. Wish we had been hungrier to try more things. The pork tacos were amazing.", "author": "Jamie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Great happy hour drink choices! Loved the outdoor patio. Plenty of vegetarian options which is a huge plus for me. Definitely would recommend and go back.", "author": "Shira O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "cocktails first, dining comes second.. which made for an unfortunate wednesday morning. \n\nthe cocktails are delicious - it's like prom for tequilas and everyone's happy. \nthe food was good, but definitely the wingman to this party. i've never had a taco i didn't like, but i did here. the goat taco was a favorite of the group as was the tamal. \n\nif you come early in the week, the wait isn't bad / none. but would limit your party size to less than 4 ppl as it does get crowded.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Delicious cocktails and yummy, interesting Mexican snacks. Up there price-wise for what you get but very, very tasty. The goat tacos are awesome. Great vibe and service.", "author": "Jem G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Delicious and creative drinks. A bit pricey but they offer happy hour deals. Beautiful space and usually a good crowd.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "This is the place to go to for a cocktails... if I am lying you can punch me in the face. Seasonal, perfectly executed, what else can you ask for?", "author": "TJ M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-20", "description": "Had drinks and dinner here on a Tuesday.  Very nice backyard, nice atmosphere inside the restaurant. However, the food was just \"meh.\"  The guacamole, chips and salsa was fine, nothing remarkable and I ordered the pork tacos on the recommendation of the waitress.  They were fairly tasteless, needed salt, and didn't come with any salsas (just three leaves of cilantro).  My fiance had the papusas which were pretty good if not seemingly authentic and the spinach and manchego empanadas.  The food wasn't bad, it was all just somewhat tasteless and disappointing given the good reviews of this restaurant.", "author": "Scarlett V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "I absolutely loved everything about this place. The food was delicious. The drink menu is large, so many delicious choices to choose. The mixologist really knows his stuff. So may beers to choose from. The staff was friendly and very attentive to our table. We got our food quickly. The atmosphere is relaxing  and rustic meets modern. Definitely a place you want to visit in Brooklyn. I've gone back twice since my first visit. \nSandera", "author": "Sandera B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-02", "description": "Conveniently located on Smith street. However I wasn't impressed by the food. The cocktails were great. And it's really loud, ppl need to realize they are at a restaurant. Def a place for a girls/buddy night, but not ideal for a date.", "author": "Nik R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "Such a great place! Cocktails are amazing, nice ambiance. Better to go earlier in the evening, because it starts to clear out after 10:30-11ish. Has a nice weekend crowd! Love this place!!", "author": "Milena A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "Love the drinks. Bartenders were horrible. I don't care this is NYC. Bartenders are there to serve you, not the other way around. I have no time for bartenders that think they're rockstars with egos to match. I had the best drink I've ever tasted here but I'm hesitant to come back.", "author": "Thugnificent M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "I am a huge fan of this place as I am a fan of good Mexican food. \nPlace is relatively new. Service very courteous \nPlace was packed when we went but the food still arrived quickly", "author": "Ana C."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}