{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "Drinks are good.. nod to clover club.. but food is way too expensive for portions ( tapas) style. Empanada size was a joke.\n\nThe space has a cool vibe. \n\nHope the owners improve upon the comments here which look consistent.", "author": "R L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Amazing atmosphere and cocktails. Food is great too for dinner or brunch. Delicious steak dishes. Their happy hour special is also great, micheladas, wines and other cocktails for less than $10 which you can't find many places. Highly recommend a stop here if you're in the area!", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "I go out to eat somewhere between quite a bit and way too much, and not many places/meals have inspired me to write a review, but this place absolutely compelled me to do so after my visit this weekend.\n\nWords can't describe how much I enjoyed my meal, and the overall ambiance of the place.\n\nChill crowd, laid back staff and an intriguing food and cocktail menu were just the tip of the iceberg.\n\nMy date and I ordered the Churrasco Skirt Steak, Ceviche, Grandma Torres's Pernil \u0026 Mofongo and some chips and guac and everything ranged from very good to downright amazing.\n\nChips and guac were good, nothing outrageous, although the salsa was excellent with a noticeable citrusy kick you don't find in most other salsas.\n\nThe Pernil and Mofogo was also very good, especially the Mofongo. I've never been the biggest fan of Mofongo, as it's typically too dry for my liking, but Leyenda's take on it was moist, flavorful, and the perfect accompaniment for the Pernil.\n\nThe two standouts were the Churrasco Skirt Steak and the Ceviche.\n\nEasily one of the best steaks I've ever eaten. Seasoned and cooked perfectly, it was melt in your mouth good, and still has me craving another piece two days later.\n\nThe Ceviche was a much different twist than I'm used to, what with apple, ginger and pomegranate added to the mix, but it surprisingly all worked together to create a fresh, vibrant and flavorful dish. \n\nGood stuff.\n\nMy only complaint was that I did not enjoy my drink (Shadow Boxer) all that much, but a minor complaint on an otherwise majorly good evening of food and drink.\n\nWill absolutely be back!", "author": "Jason H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "This review is based on their \"sleyanda\" aka Beyoncé-pop up. NO POP UP for starters. Basic Christmas lights. Bar is regular (super regular). They serve poor coquito for about $13. Pricey for bad service. Been here in the summer, nice patio- service still poor. Basic bar. Not much much else to say.", "author": "Aly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Came here for drinks after a massage. At arrival there was not a lot of people. We can sit anywhere we wanted wich was nice. \n\nOrdered some drinks and some food. Was looking forward to the regular menu but because it was sunday around 3ish the brunch menu was still up for service.\n\nThe food was great! The drinks were beautiful and the staff was friendly.", "author": "Shirly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Shannon's drinks were on point. Service was just as warming and inviting as the decor. 5 Stars!", "author": "Channing J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Took the train in from the city to check out this place. A friend said it was great.  Agreed .\nDelicious !  Great service and cocktails. \nI will return \nThanks for the good meal.", "author": "Frank F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Fantastic cocktails!\nPrincipo Fresco and Hasta Pronto\nCalypso Cobbler and South Fence\n\nFood was amazing as well!!!\n\nVery friendly staff", "author": "An B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "I would give this place 0 stars if I could. I did not have the best dining experience to say the least. I will say the drink I ordered, the Double Salute, was really good, that was the only plus to my visit. The food is over priced and bland. The icing on the cake (literally) was the cockroach that chose to join us after hiding in the stack plates brought out for desert. I only wish the cockroach had been brought out at the beginning of the night so we could have been spared from the nasty food we ate. BEWARE!", "author": "Kenneth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "I've been looking for some good Mexican restaurant reasonably close to us in BK, and finally Leyanda came on top! We came here on an early Sunday night after drinks at Clover Club across the street. It wasn't busy when we walked in, but filled up nicely when we left. \n\nExcuse my lack of use of Spanish words, we got guacamole, goat and chicken tacos, some appetizer that's fried potatoes filled with ground beef, and pulled pork shoulders as entree. \n- Guacamole was nicely flavored, and my husband cannot stopped raving about their chips, which were crispy and freshly fried. Definitely not stale like our past few Mexican restaurants. \n- Both goat and chicken tacos were great. Flavors were well balanced, meat were juicy and tender. Absolutely no complaints. \n- Colombian papas rellenas, aka fried potatoes filled with ground beef was my second favorite of the night. It was not heavy like normal fried potatoes, instead, it was airy but full of flavors. I think it's their play on coquette, only better. \n- My favorite of the night, pulled pork shoulders, were simple but AMAZING. There's nothing fancy to this plate, just some old fashioned pulled pork shoulders, filled with flavors. We licked every bit of it from the plate. \n\nOk, in addition to the food here, you have to try their drinks. The one drink I absolutely loved was Maiden Name, it literally tasted like a smoothie, with coconut, vanilla, cinnamon, and came with a flaming half lime on top that made the presentation on par with any other fancy speakeasy places I've been to.  \n\nNeedless to say, I will be back.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "The best experience I've had at a bar, period. I've been there several times and the food/drinks are always excellent. The staff teams up to wait on tables and you receive excellent service. \n\nI had the pumpkin skull drink and it was the most delicious, interesting tiki drink I've ever tasted. \n\nThe tamales are refreshing and guacamole comes with homemade chips. \n\nLOVE!!!", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "I would love to give this place 5 stars. The food is amazing. The drinks are excellent. The only thing keeping me from not giving it 5 is their uncanny ability to take my plate away without asking me if I'm finished. This has happened on more than one occasion. Please stop doing this. If you want an amazing fish taco this is the place, just remember to hold onto your plate if you're not quite done.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Returned to Leyenda this past weekend a  few weeks after stopping by there for the first time. Bartenders are always on point, great vibes and great drinks. Of note I have tried Brooklyn Burro, Ghost coast , all delicious. My friend ordered the Coquita ho ho drink which was holiday themed, and she loved it. Fish tacos and chicharrones here are great as well.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-31", "description": "We didn't love our first round of cocktails, but we altered our selections for the second round and they were both much better. I liked that there are tons of items to choose from on both the cocktail and food menus without it feeling all over the place. This is the type of place you need to visit a few times to find your favorites because there's a lot of tough decisions to make on both the cocktail and food menus.\n\nThe four food items my girlfriend and I chose to share were all amazing. Sorry for not listing specific items, my visit to Leyenda was about two months ago. I can recall the tequila-flamed shrimp arepa and tamal flaco though, because I took pictures. I think the shrimp arepa was my favorite dish of the night, but I could have predicted that based on my taste, just from reading the description on the menu.\n\n I know this is a cocktail bar first, and restaurant second, but we felt a little crammed eating a full dinner at the little high table with bar stools. We had to improvise a place to set aside our jackets and my girlfriends purse, which can be difficult since this place can get crowded. Overall though we loved our meal and had a nice buzz from our two cocktails. The service was good too, our waiter was helpful when we were deciding on our dinner order.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "After an inspiring meeting with our architect/designer in the neighborhood, we stopped by here per recommendation from the same architect.  The cocktails were as inspiring as the earlier meeting. How can you not visit here when you are told the bartender was named the best bartender in the nation... We had Tia Mia, Hasta Pronto, Truth Fiction and Brooklyn Burro.  My favorite was Truth Fiction followed by Hasta Pronto.  The drinks had many layers of complexity but they were extremely well balanced.  The food too was good and has Central American favorites like arepas, tacos, etc. but not as strong as the drinks.  I would not come here hungry, but to enjoy the cocktails.  It's instantly evident this is no ordinary bar, makes me wish I lived in Brooklyn.", "author": "Akira O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "We enjoyed the vibe in this place. The food we ordered is good but wouldn't say amazing. I had the mofongo dish and my hubby had the skirt steak. We also had the flan for dessert which was good. One thing I would add is that the mofongo was not what I was expecting. It's not in the spanish style (Dominican) that I'm accustomed to having at home for example. The guacamole and chips we had as an appetizer was pretty good.", "author": "Julie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Oh Leyenda how you have completely destroyed  my liver and wallet. Dammit, I thought I was completely happy with what I thought were stellar cocktails at Maison Premiere and June, yet somehow, after discovering you (and having to see you 5 times in one week) I figured I could still go back to my old standbys for impressive drinks and would still be satisfied.  Oh, hell no.  June seriously tasted like I had gone from Pliny the Younger to Keystone Light, and Maison Premiere was just plain terrible. I used to be fooled by Maison Premieres Disneyland theatrics but last week I went and after Leyenda and my wife and I both felt like we were drinking crappy liquor smothered with fancy flowers. \n\nLeyenda on otherhand just focuses on the craft of the cocktail and uses some crazy good ingredients. No attitude, no judgement, no fake theatrics....just insanely good cocktails.  Yes, I will admit being a 6'-5 guy it can feel a bit strange ordering a drink that is topped with flowers and other less than manly decorations, but dammit are these drinks strong,and unlike other places, all these toppings are just pretty decorations but play into the flavor of the drink. Everything is just perfectly balanced. \n\nYes, I realize this is a spinoff of Clover Club, but it is so many levels better than Clover.  I have lived in this hood for 14 years and while I love Clover club for the drinks (although sadly their best drink, the triboro, is long gone), the fake new Irish pub plasticy woodwork is just distracting. It just doesn't work and then pair with the weird fake handlebar mustached 1920s actor/bouncer at the door and I just gave up on them (despite greatly respecting their cocktails). \n\nLeyenda is different.  This spot had a series of failed restaurants and rather than gutting the place they kept the facade and then added in a few knickknacks to give character yet not feel pretentious. \n\nOkay so I realize I am not listing specific drinks, even though I have had them all, but I have to say you can't go wrong. Just talk to the bartender and go with what you like. Surprisingly, I found the rum based drinks my least favorite. The tequila ones really rock. Their signature Tia Mia is phenomenal. \n\nThe bartenders are really great. We have spent the most time with Amanda but Brian rocked it tonight. We finally made it to the happy hour and plowed through whole menu (hard to resist $6 cocktails of this caliber).  The Chilcano was my favorite although I never made it to the Michelado which looks insanely good. \n\nSo the food is really solid but it is mostly small plates. We enjoyed everything we have had, but it is not like we would plan for dinner here...it is more that the cocktails are so strong and delicious that you can't help but order the whole menu. \n\nSo yeh, this place is the bomb. And dare I say the best cocktails in NYC (which I guess isn't that daring since Ivy Mix won best bartender in America...of course in the dozen of times we have been here we have never seen her).", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "Came here for the second time tonight and yet again did not have to wait to be seated (always a plus). The service was quick and the cocktails were delicious. We made it just in time for happy hour, and I had a $7 spicy Paloma - tasty but fairly standard. Their regular cocktail menu has a vast assortment of treats ranging from unique Island-inspired rum cocktails to herbaceous tequila drinks. My favorite is the \"lil smokey\": a mezcal drink with lime, pineapple and sage. My friend and I both ordered their poblano relleno, a modern take on the chile relleno, with goat cheese and carrots, and were not disappointed. Excited to stop by again and try more from their menu!", "author": "Lydia H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "I read somewhere that in December for the holidays Leyenda turns into Sleyenda. Guess that's just for their drinks menu because 15 ft of garland hanging across the room isn't exactly a holiday spectacular. Read about their Mexican hot chocolate and that definitely packed a punch. Deliciously strong. Also tried the cider. Just as good. I planned on just having drinks and if i did i would of gave 5 stars but i got hungry and the menu sounded pretty damn good. I was willing to let that B grade in the window slide. Ya know maybe it's stood for Better. Well I shoulda known better. Had the ceviche which was ehhh. The flavors around it were good but the fish wasn't the freshest as you can tell with it's dull color and taste. Then tried the grandmas Puerto Rican pernil and mofongo. I don't whos grandma was cooking this but she wasnt boricua. Listen if you weren't raised with a Hispanic mom or grandma cooking for you then you'd probably like it. But if my grandma cooked pernil and mofongo like that we'd all have fake smiles around table Christmas Eve. I mean we usually do but it's not because of the food.", "author": "Peter R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Leyenda is the Devil... in the best possible way.\n\nMy wife and I always say we are just going to stop in at Leyenda for a pleasant Latin snack and \"just one drink, really, just ONE.\" Three hours later we stagger out of the arched, wooden doors happy as hell and gotta-focus-to-walk-straight tipsy. Opening their drink menu is the equivalent of cracking the lid on Pandora's box... way too many temptations are released and most of them are deadly. And while you may be hell-bound, you will enjoy every step.\n\nThe folks at Leyenda are constantly tinkering with their recipes and offerings. And their latest set of changes are worth a return visit, if you've been here previously. And if you haven't ever been to Leyenda... what is wrong with you?", "author": "Justin L."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}