{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Holy Moly. They have De***bes Potosi on the top shelf. What else do you need for 5-stars? Great food, the nicest staff, and a serious cocktail.", "author": "Roland H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "Been here once before for drinks, which were amazing and since we were in Carrol Gardens we decided to go in for dinner. The place were thick with late and loud brunchers, but we managed to get a table. They are tall and tiny, additionally the stools are really uncomfortable. We had Tequila-Flamed Shrimp Arepa, Tamal Flako, Panuchos and Tacos de Bacalao. The food is really bursting with flavor and fresh ingredients, still light and uncomplicated. It was absolutely as good as rumored. We tried a verdejo and an unforgettable red. Call me crazy, I just don't like mixed drinks with my food (which they are known for doing really well) I think the wine list could use a little boost. Would definitely some back for dining in the backyard, thereby circumvent the stool situation.", "author": "Hege M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-23", "description": "Leyenda def fell off from the last time I was there. The food was terrible! We ordered the spinach and manchego empanadas -felt like all I was eating was deep fried dough, hardly any filling. The Pablano relleno was just drenched in sauce and the other plates - don't remember the names...just as bad. \nAlso do not send a runner from the kitchen who just dumps the plates and runs off without explaining what each dish is! Very unprofessional. \n\nOnly come here for drinks, even though who wants to wait 40 min just for drinks.", "author": "Ilona P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Read about this spot and made the trek to Brooklyn.  It was worth the numerous trains and walk to get here on a Saturday.  Great place, mixologist and food.  Will definitely come back", "author": "Monica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "We were in Brooklyn for the day and this was the first stop after lunch. I fell in love with this place. It's very laid back and chill. They are heavy on the tequila and mezcal here, which has a special place in my heart. If you haven't had mezcal or are new to it, this place would be a great place to start. There is a great variety to try neat if that is your thing, or the waitresses will gladly guide you in the right direction toward a nice entry level mezcal drink. All we got to eat some some croquetas. They were yummy and help soak up some of the booze. This Is a place I'll be returning to for sure. I could see myself hanging here eating and drinking for hours. The staff was great, the ambiance and drinks to match. Highly recommend. On that note, go and ENJOY!!!", "author": "Sebastian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Wow! I am so proud of myself for finding THE BEST tasting Mexican food I've ever had. Facts. I live in Los Angeles, and all we have is Mexican food, and I've found some amazing Mexican in LA. My first introduction to Chef Jose's passion for flavor was when I rated the salsa. My wife is all about the sauce, and she felt the same way. We laughed when we realized we both felt the same way...that this was the best salsa ever! I ordered the vegan tacos...and that is what prompted me to write this review. That's when I asked to meet the chef. I was told his name was Chef Jose and was glad to know he was indeed of authentic Mexican decent...because it felt as if we had the honor of tasting the very best that Mexican flavor had to offer on this special night...which just happened to be cinco de Mayo! I found heaven. Oh...and what other Mexican restaurant makes Puerto Rican Mofungo and Pernil?!!! Brilliant! I can't wait to come back! .", "author": "Ray A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-15", "description": "Came here for happy hour and a quick bite to eat with my girl friends and we were definitely disappointed. I actually looked forward coming here because of all the high reviews so I was shocked by my experience.\nThe drinks were definitely strong I'll give them that! But a strong drink doesn't mean it tastes good. Maybe 10 years ago in my twenties, I would have loved getting such a strong ass drink so I can get a good buzz going without using up my paycheck. \nThe food reminds me of bar food, more for soaking up alcohol in your stomach and not so much for the food experience. We had the Guac with chips, Pupusas, Pescadilla, Pernil \u0026 Mofongo and chicken tinga tacos. The Guac was small and pretty tasteless, it needed more salt and cilantro. Not worth $10. The Pupusas was bland as well. I wasn't quite sure what I was eating. Pescadilla was okay. Mofongo was so dry and tough. I took 2 bites. The chicken tinga tacos were ok, needed more spice and why was it so wet?\n\nPRO:\nThe happy hour drinks are a good deal and very reasonably priced. Plus it's strong or maybe I'm a light weight.\nService is fast and staff is friendly. \nPlace is cute with a trendy hipster vibe, nice backyard for those not who are not mosquito magnet.\n\nCON:\nFood prices was high and portions are small. \nFood is just ok. Not worth the money.", "author": "Janet Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Excellent, excellent, excellent.\n\nEvery drink on their menu is better than the next. My favorite however, was the minor threat, which comes in an adorable tiki glass and the tiki man has a butt. It's too cute. And the drink itself is so yummy. It's got rum, coconut, peach, and absinthe. It really tastes like a peach yogurt smoothie with a lot of depth. \n\nWe skipped dinner and opted for dessert instead. The flan was good with a real interesting licorice flare. And the churros are great. Excellent dulce de leche sauce.\n\nCan't wait to come back and try the other cocktails and dinner. The menu looked wonderful.", "author": "Katie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "Was brought here for my birthday and thought the place was really cool. We sat in the backyard and the decor was really nice and cool. The dishes are tapas style and shareable. Ordered a couple of yummy drinks and three dishes including the chips and guacamole. Everything was really good. Luckily it wasn't too crowded for a Friday night. Tables in the backyard are pretty close together which is expected for a backyard space so it's not the place for telling secrets. We were able to be seated right away. I would come back here again.", "author": "Ayesha A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-13", "description": "Cool vibe here.  \nVery crowded on a Friday night but service was fast and friendly.\nFood: \nWe tried a few things to split because we were starving-pernil and mofongo, some tacos, guac and chips and a couple of other things I don't remember...I had consumed a few drinks by this time ;)   Honestly, I was not impressed by the food at all.  It was fine but the flavors were all kind of bland. Disappointing because I don't know how many times I've sat down and had pernil and mofongo on the same plate and not been in Puerto Rican fat girl heaven (which is kind of like regular fat girl heaven except with pernil).\nDrinks: Couldn't even finish my drink and didn't order another one because their cocktails are not cheap...should have stuck with beer or something.\n\nOverall, this place is a two star except the service and ambiance were great.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-24", "description": "Saturday night and this unassuming spot fills up fast with a young crowd craving flaming drinks/quick eats. Cool setup in the back with couches/small tables and long tables towards the middle.\n\nWaitress is quick with the orders as she got mine as soon as I sat down. Had to get the Headless Horseman ($12) - an alcoholic slushy served in a skull glass with a flaming hairdo. An interesting drink for a few pics with a decent amount of alcohol, okay taste.  For food, had the skirt steak ($15), a small portion of tender beef with chimichurri on top. Not bad, but for tapas style, a lot of the options on the menu are a bit expensive. \n\nCool spot and friendly service. On the pricey side for food/drinks, but in an area where you can easily bar hop.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Awesome drinks and delicious Spanish food. Stopped by last night and I was not disappointed. The chicharrones and the guacamole/salsa appetizers were great. The cactus cooler was out of this world for me. It was refreshing to have such a different drink. The patacones with ropa vieja were small but when you think about it, it was an appropriate serving.", "author": "Chanille C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-09", "description": "Ordered the skirt steak online. It was pretty tasty but was a super small portion. Definitely not worth the cost at all. And it was room temperature so I had to warm it up in the microwave. Will not be eating here again.", "author": "Bobby H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-16", "description": "This was my first time at Leyenda -- I was super excited to be visiting Brooklyn with my two best friends, and was even more excited about a Christmas theme. The decor was amazing and I was so happy to be there. However, as amazing as the decor was, the service I received from one of the waiters was not great. From forgetting our drink orders, to not putting in my food order, to arguing with my friends about what they had ordered and abrasively swearing at my friend, I wasn't thrilled. \n\nI will say that Alicia was great in listening to our concerns and frustrations, and was receptive and brought us some treats on the house. Appreciated and such a great gesture! \n\nI would be wary about coming back here, but the ambiance was amazing. Thank you, Alicia!", "author": "William E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "Excellent creative cocktails and food in a relaxed yet elegant atmosphere, located in the sophisticated stretch of Smith Street. The bartenders here really know what they are doing, and for $12-$13, you can enjoy a truly unique and perfectly crafted cocktail. Ivy and Shannon were both excellent bartenders and fun to talk with.\n\nI tried several of the Mezcal cocktails, including the Tia Mia and Lil Smokey, all of which were excellent. Perfect balance of smoke and sweet fruit. My favorite though, was the 'Witching Hour', which included Sotol and Tamarind Liquor-delicious flavors and extremely strong. I also tried the chips and guacamole which were very good. The place was quite crowded even on a Tuesday night, but not too loud to have a conversation.", "author": "Alyssa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Simply delicious! The food is to die for and the drinks are perfectly balanced. The bartenders are very knowledgeable and explain each drink. It is a little pricey but worth the cost for an amazing experience.", "author": "Trisha T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "Used to love this place. I went there late on Saturday when the bar was dying down, hostess sat us and server didn't come to us for 30 minutes. I notified the hostess and then she told the server to come. We ordered 2 drinks-one being nonalcoholic and 15 minutes later we still didn't have drinks. No server came back. Then I tell the hostess again and she got angry at me and yelled \"there coming, calm down!\" What? I was totally calm. I was so embarrassed when the drinks came 45 minutes later, we quickly drank them, paid, and left. No one ever apologized, not the server, not the hostess, and they didn't tell a manager. They lost a loyal customer last night.", "author": "Mary Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "8 months later, and Leyenda maintains a VERY STRONG 5 stars.  This place rocks! \n\nI've tried more of their food over time and my top favs are, the penil and mafongo and skirt steak.  The penil is Always cooked right; well, juicy, tender and flavorful.  Its 4th of July fireworks inside my mouth everytime I take a bite. \n\nTheir Churros are a good dessert snack as well.  The menu states crusted in almonds, but I asked the waitress if they could not crust mine, and they accommodated. \n\nThe weather was on our side, and they had the back patio opened, which I didnt even know they had.  And, it was open to small children.  I was so happy to know I could enjoy a cool, and refreshing Springtime libation after a day in the park around screaming running toddler and adolescents.  This mommy needed it.", "author": "Yasmin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "Very interesting cocktail. We'd really enjoyed their cocktails. Food are small potions. But taste is good. Very friendly staff. Def coming back.", "author": "Coco S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "Absolutely phenomenal!! Best steak I've ever had and Garrett was an amazing bartender. Super knowledgeable staff! Will be back and will definitely recommend to friends visiting the city!", "author": "Caitlin C."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}