{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-24", "description": "Left Leyenda tonight FUMING and let me tell you why. A beautiful sunny Thursday night. All we wanted was to sit outside and enjoy the evening. Let's hit up Leyenda, we thought, they've got that great backyard! We arrive and the hostess can't seem to get it together enough to give us a wait time for an outdoor table. She was super vague and unhelpful and said maybe an hour but who knows....as though it was possible that no table might open up at all for the entire night. Sketchy. We decide to wait anyway and she tells us we're on the list for an outdoor table. We grab a drink at the bar. Then a snack. Then another drink. An hour goes by. Nothing. Suddenly I witness with my own two eyes, two women walk into the restaurant and ask for a table outside. They are immediately taken outside and seated. UM what!?!?!?! It was unbelievable. A table had opened up and was given to people who happened to walk in rather than the couple who had been waiting patiently for over an hour. When I asked the hostess what the hell had just happened she couldn't have seemed to care less. She said it was a \"misunderstanding\" and comped two of our drinks and that was it. She acted as though we were ridiculous to be seriously bothered by the fact that she lied to our faces and wasted our time and money. Anyway, this place stinks and we will never return due to this horrendous service.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Once upon a time, my slightly drunken but always classy wife texted me, \"Come meet us! We're at Leyenday!\"\n\nWell, that was a somewhat prophetic typo because that evening, and all other subsequent Smith Street evenings at this fine establishment, have combined 'Leyenda' with 'Yay!' Because this joint kicks ass. \n\nTo elaborate on that, here is a short list of Things I've Never Had At Leyenda:\n\n1. A bad cocktail. From the nearly always appropriate Sonambula to the very boozy Cabezaso or the mezcal-based Lil' Smokey (perhaps my favorite so far), the cocteles are impeccable. The 'Dem Apples is a nice seasonal one, if you're into that. Try a mezcal flight if nothing appeals to you, and expand your mind, man.\n\n2. Bad service. The bartenders (including Ivy Mix, somewhat of a celebrity in the world of alcohol) don't just know their biz, they offer up genuinely friendly smiles that are only outdone by the adorable sweetheart who was running food this past Tuesday evening. She was more excited than I was about the tinga tacos I was getting, which is quite frankly, incredible.\n\n3. My appendix out. I don't think they offer that service here. \n\n4. Anything half-assed. Thought and care has gone into every aspect of this place, and I appreciate it. The effect of the candlelight reflecting off the gorgeous golden ceiling makes me want to sit in my seat and sip mezcal forever. Not even the garnishes are afterthoughts, but rather careful additions (candied ginger, dried apples, cooked pineapple) that add a little more complexity to already deliciously complex drinks.\n\n5. Bad food. The plates are beautiful and for the most part, very tasty, Pupusas, flautas, arepas, empanadas...all damn good accompaniment to the booze, which is the star of the show in this particular establishment. I imagine the croquetas are good as well, as it seems that I like anything that ends in \"as.\" I have yet to make a decision about the panuchos or the rellenos. \n\nIt's safe to say that I will be back, soon and often.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "Came here for a Girls nite hang out.\nLove the decor especially the back wall with the last supper painting all over it. \nDrinks were nice nothing special. \nThis place is small and cute \nThe guacamole and chips were not the best guac needs more seasoning and salt. \nStaff was cool and engaging which is always a plus. \nGood location and good prices.\nI would like to give it a second chance and have different dishes to see if they can redeem themselves.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "Cute place but very expensive for what it is. $10 for a few chips and 1/2 an avocado and tiny salsa. I had the fish tacos...OK at best. Service was not great. Not impressed.", "author": "Lynn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "I've been to Leyenda a few times in the past, primarily for cocktails in the evening. Today I stopped by with a couple friends for brunch. This review rates all my experiences.\n\nThey recently revamped their menu and it seems to be a lot better than it was. Their cocktails are very creative and aren't light on the alcohol. They have a decent selection of beers as well. For brunch we had a salad, a fried chicken sandwich and guacamole and chips. All of it was good. I'm generally not a fan of fried chicken and I wasn't today either, but that's more of a personal preference.\n\nThe place itself has a very cool ambience, especially if you sit by the bar you get to watch their awesome bartenders in action. They have a decent amount of seating. In the summer they have a garden area that they open up if the weather is good.\n\nI'll definitely be stopping by here again in the future.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-25", "description": "Reading the reviews of this place and wanting to complete my own very important goal of eating at every Mexican restaurant in brooklyn I was excited to try this \"new\" restaurant, to quickly cross it off my list. \nPerhaps my bias against \"fancy\" mercian kicked in but this place just left me wanting to go grab a taco from a truck a near by. The Papusas were inauthentic and tasteless. The mango empanada was ok, if I can say from the one bite sized serving I was given. \nMy fiancé got the pork tacos which looked delicious but were flavorless and we spent 15 minutes waiting for a waitress to come by to get some salt and salsa. \nThe restaurant has a lovely back yard and drink menu is impressive with a great happy hour. My suggestion is drinks with chips and guac as an appetizer before embarking on your dinner at another restaurant.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-12", "description": "Really liked the pork tacos. Very juicy and lots of flavor.\nI didn't get to try a mixed drink this time but they have decent red wine draft.\nLoved the ambiance. Large mezcal selection.\nReally looking forward to returning,", "author": "Leala V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Amazing amazing and have I mentioned amazing. \nThe food here is spectacular, full of flavor and really well presented \nThe drinks are well prepared and strong. \nIf you chat with the bartenders  they'll recommend personal favorite tequilas and give you a quick lesson on tequila", "author": "Margaret V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "This is one of my favorite restaurants in Brooklyn. The tamale is incredible, and the drinks are solid. However, the service is really, really bad. We had to ask for chips four times before we got any, and the rest of our food came at a similar pace. For instance, we were here almost an hour here before we got a new water pitcher. Without the slow service, this would be a four or five star review. But if you're going to come here, be prepared to have to remind your server several times to bring you your order.", "author": "Ari C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "First time visiting on recommendation of a friend. REALLY good (and pretty) cocktails, I'm Jamaican so I loved that they had such a wide variety of cocktails with Jamaican rum. The nacho chips with guacamole was fresh and pretty delicious too.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "VEGETARIAN, GLUTEN FREE REVIEW:\n\nVery accommodating for Gluten Free dietary restrictions, there is a TON on the menu that is gluten free.\n\nHands down one of my favorite restaurants and bars in Brooklyn. I've come here again and again with friends, family visiting from out of town, and date nights. Everything I've ever had was delicious.\n\nLove that they switch out their menus seasonally. My favorite fall drink was the Ghost Coast!", "author": "Liz W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "I am completely smitten with this place!\n\nI first became acquainted with Leyenda at Cocktail Magic (http://www.cocktailmagic.com/#/newyork) earlier this spring. My friends and I had the opportunity to sample a plethora of different cocktails from some of the biggest names around town, and one of Leyenda's drinks, La Sonámbula, was our hands down favorite of the night. After my experience there, I had it on my to-do list to visit the actual location.\n\nI've now been multiple times, and could not be more impressed. Absolutely love the space - the place is always abuzz, yet still feels intimate no matter whether you're seated at the bar, along the window, or at the tables. I could definitely see the place as a cute date spot. The cocktails here are all winners. My favorite as mentioned above, La Sonámbula, is excellent - comprised of \"Jalapeño infused blanco tequila, lemon, chamomile, mole \u0026 Peychaud's bitters.\" It is just the perfect amount of spicy and sweet, and I always get at least one each time I come. The Tia Mia is also another favorite of mine. Food is surprisingly good - I always get the chips, salsa, and guacamole. The chips are crisp and thick which I love, the salsa fresh, and I dig the guacamole that's served in an emptied out avocado shell. I usually get the pork tacos - each comes stuffed with meat, and are delicious. Service is attentive and prompt, which is impressive considering how busy the place gets. During my times there, have never felt rushed either.\n\nJulie Reiner and Ivy Mix have a real winner on their hands here, and I am so glad they've opened Leyenda in the neighborhood - if you love cocktails, you definitely need to check this place out; you won't be disappointed :)", "author": "Gene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Best cocktails and small bites in the area. Bartenders Shannon and Garrett are the best.", "author": "K B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-05", "description": "Came here for their \"Beyoncé\" themed pop up bar, and was nothing short of disappointed. Nothing at all had or resembled its theme. The music was indie, the food menu was limited and not appealing and the one dish I wanted to try they didn't serve anymore.... drinks were nothing special and the food below average. The 2 stars are only because the waiter was a nice guy, and attentive. But wait, my group were the only ones in he place!! Hum?", "author": "Ny's Finest .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "4 stars for the comida\n5 stars for the bebidas and cocteles \nMy friend and I came here on a Thursday night and had an awesome time. Happy hour until 7pm. And then grabbed a table at around 7pm. The food was good, but their drinks were awesome. I got a couple of their Manhattans and made my night even better. Every drink we order from their menu was on point and up to expectations; grow a pair and Brooklyn burro were the highlights.", "author": "Hugo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "Excellent, strong drinks that will set you back roughly $12. \n\nThe food was quite good but on roughly smaller plates/sizes. This has a really \"date night\" feel to it.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Came here for a summer party for with my co-workers.\nThe food was delicious I had the Puerto Rican dish and the drinks were good.\nThe place has a very laid back vibe, we sat on the patio on a very nice night.\nWe weren't rushed which I loved we we're probably there for about 4hrs.\nAnd the wait staff were ever attentive.\nI would come back for a nice dinner or happy hour any day of the week.", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Some of the best mezcal options in the city! During the summer they have a great patio open, the atmosphere is great and the staff is knowledgeable.", "author": "Gabi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Wow! We had a little bit of this and a little bit of that. It was all good. Every little bit of our plates were devoured within minutes. My boyfriend and brother went here so that we could hang out and talk and laugh. One has food allergies and the other is a picky eater so ordering can be a challenge. But not here! It was something that all of us could eat and enjoy as a group. Each small plate had enough for each of us to have a portion and enjoy the dish. Within minutes another dish was served! Highly recommend.", "author": "Kris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "From the moment we walked in the door we were greeted warmly and taken care of. The selection of food was great and included many options for my vegetarian girlfriend. The staff was very accommodating about keeping the crab out of her gazpacho. \nThe chef is an artist. All the plates were beautifully presented and delicious. The quality and taste of the food were consistent with the excellent service we received. It was an all around great experience.", "author": "Chris W."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}