{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "One of my favorite Brooklyn bars, located in Cobble Hill, Leyenda has an extensive cocktail menu ranging from strong spirit forward to fruity tiki drinks! \n\nIt can get packed during the weekend nights but it's never uncomfortably crowded inside. They have an extensive variety of mezcal lining the wall behind the bar and great options for a light dinner. \n\nMy favorites here: \n1) Shotgun Wedding, if you're looking for a strong sweet and creamy drink!\n2) Potato, Cheese and Chorizo Flautas, need I say anymore? Good to be shared if you want to get multiple dishes!\n3) Fish Tacos, I've had bad fish tacos before and let me just say this is far from bad! So good!", "author": "Celeste Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-09", "description": "Leyenda, a sister bar to Clover Club, delivers on all fronts. Super down-to-earth bartenders. Great happy hour.\n\nAmbiance is sort of Mexican saloon-like? Sort of worn, chipping wood, big wooden booths, almost picnic table-y. Oh, and there is a backyard.\n\nThe Paloma cocktail I had was very balanced and affordable (see happy hour above). I only had a quick drink when waiting for a friend, so I can't say much more. But I wish I could. Next time I'm in the neighborhood, this will be top of mind.", "author": "Fred A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "This Brooklyn gem is perfect for a date night! \nIt has such a great vibe from the waiters, the bartenders and music! The dim lights makes dinner so much more intimate. \n\nGreat selection of cocktails and their main dishes are all delicious.\nOverall it was a fun night!", "author": "Rosio B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-08", "description": "This is definitely one of my favorite cocktails bars in Brooklyn. The chiller instinct is one of the smoothest bourbon drinks I've ever had \u0026 the frozen horchata drink they offer in the summer is like candy.\n\nWith that being said, they tend to mix up the drinks by the season, but almost every cocktail that I've tried here, I've enjoyed. Drinks run in the standard range for cocktail bar $13-$15. The vibe is also inviting and warm here.\n\nI would have to dock a star for food, however. They have some small plates, including tacos that were all flavorful, but pale in comparison to the drinks.", "author": "Chris I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-07", "description": "Stumbled upon this restaurant in Boerum Hill on a Tuesday, it looked like a trendy, lively restaurant to have some food and a drinks. I ordered the Spicy Llama. I then ordered the spanish ceviche and pollo tacos. This is a great place for taco Tuesday with a lot of people coming after work. I'd say the drinks are better than the food, so definitely go if libations are the driving factor.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-06", "description": "I was so excited for Cinco de Mayo. I couldn't wait to sink my teeth into some tacos and work out my biceps dipping chips into some guacomole to elate my tastebuds and more hand to mouth action with a margarita. We were lucky to get a seat for 6. This place is more bar like so I wouldnt say it was kid friendly. There are high top tables surrounded by stools and in the back there are 3 tables with bench seats, no kiddie seats. We ordered a classic and spicy margarita along with a mojito.  I must say the drinks are 5 stars. Kudos to the bartenders. They did a great job. I just had a problem with the amount. It seemed more like a half glass then a full drink. The guacomole comes in a half hoss avocado skin. Cute presentation.  The guacomole and this type of salsa sauce were really good and very addicting. The chips were perfect with just the right amount of salt. After this things went downhill.  The tacos were \"meh.\" I've had way better tacos. We ordered the jerk chicken, pork, and fish tacos along with skirt steak and mofongo. The tacos come in 3's with the ability to add more on. I've been cutting pork out of my life. So I ordered 4 chicken and fish and 3 pork. We werent told which tacos were which and I had the pork and fish. The pork can be skipped as well as the fish battered taco. It was to thick and took away from the flavor. The tacos were dry and the soft shell taco flavor was lacking. My tastebuds were not doing the happy dance. I heard the chicken taco was better but I never got the chance to try it and i didnt know of the mistake until i checked the receipt. The skirt steak was melt in you mouth good and flavored well. You can skip the mofongo, it wasnt memorable. Our server was great and was very friendly. Overall, it was just ok. I would go back for the drinks and guacomole and maybe try the pulpo torta that I heard was good.", "author": "Nadia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "Fave place to go for cocktails, tbh. Everything is perfectly balanced, there's something for everyone, and it's super chill. I love the menu design (graphic designer \u0026 illustrator here hehe). And all the seating in the back is literally set up to look like the last supper, which games on me super slowly when I was last there with my family visiting from out of town. We loved it.\n\nThe flaming skull drink is just so delicious that I always get it even though I wanna try so many other drinks haha. It's fun and very 'grammable if that's your thing (also just fun to look at even if that's not your thing haha). But I always bring ppl here when they visit me in Brooklyn because the drinks are some of the most balanced and thoughtful that I've had. Get the guac if you just need something to snack on while having drinks. Other fave things to snack on: the croquettes were really good and the chicharron was my cousin's fave. But honestly everything in their menu sounds good (tamal? flautas? arepa?! yes, plz) and I can't wait to go and eat it all haha.", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-27", "description": "I am a superfan of this gem!\n\nThis is the perfect date night location because it has such good vibes. The waiter, at least the one I had, was so lovely and made my experience really fun. The bartenders are also great and very knowledgable about tequila if you're into that sort of thing (all hail vodka!). \n\nThe only cons are the portions of food, but it works if you are looking for something quick and not focused on having a hearty meal. I wasn't blown away by the food but I also didn't try everything. \n\nAdd this place to your list of datenight locations. \n\n#Datenightgem", "author": "Tash B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-26", "description": "Had been working with them via email for about 2 weeks to make this reservation which went flawless.  They were extremely accommodating.\n\nI had made reservations to celebrate two very important women in my life; my wife and my sister, both of whom recently got into a program they've been wanting to get into and have embarked on a road to change the world.  Something like this calls for a celebration.\n\nNever visited Brooklyn before (sis lives there) but I wanted to pick a place myself that would be nice and lively and boy did this place live up to its hype.\n\nWe all decided to have virgin drinks and the bartender didn't disappoint.\n\nFood was really good as was the service and vibe.\n\nOnly reason for ducking one star is they were aware I was celebrating and that's why I had been planning this for a few weeks.  A quick congratulations to the girls would have taken it up a notch but in no ways is that saying the service wasn't good.  The service was TOP NOTCH.  Thanks.", "author": "Raju L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Note: this review is more for the drinks than the food, although I have had the chance to sample some items from the menu.\n\nAll in all a cool, higher-end Mexican and tequila spot close to the Bergen stop with an awesome selection of cocktails with unexpected ingredients, a variety of tequila flights, and some pretty unbeatable happy hour deals (M-F, 5-7pm and 11pm-1am). \n\nDuring happy hour, you can choose between $4 estrellas, $5 wine, $5 micheladas, or some select $8 cocktails. The happy hour cocktails aren't the most exotic, but you get what you pay for. I've gotten the michelada a few times and wasn't blown away - I like mine a lot spicier usually (just because you're a fancy place doesn't mean you can get away without tajin!) but it's still tasty and refreshing. It's made with a papaya and carrot sangrita and adorned with a lime scored with diagonal lines and a metal straw. It's all in the details.\n\nThe cocktail menu is super cool - my favorite drink is the Horchata Colada ($13) which is a delicious, and I'm sure extremely caloric, frozen beverage with overproof rum, nutmeg, etc. It's served in the coolest skull mug. I recently tried the Life of Pablo ($13) with poblano-infused mezcal, pineapple rum, manzanilla sherry, dolin blanc, and Suze. While I was unimpressed by the drink itself, the presentation was something straight out of Achatz's The Aviary. The bartender had to run back to the garden to pick the garnish for my drink. The Daiquiri Al Pastor ($14) with pork fat-washed white rum, pineapple, achiote, agave, and lime was a disappointment. \n\nAll in all, pretty remarkable cocktail menu + great happy hour deals = I'll absolutely go back. Why just 4 stars, then? The few times that my boyfriend and I have gone and tried to sit out back, the service was just abysmal. There was a time we were seated, waited 45 minutes for someone to come over, and then eventually just gave up. Lesson learned; I just know to sit at the bar where I'm firmly planted in front of the bartenders.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "This place is AWESOME. I hosted a birthday party there and had such an incredible experience. The staff was so extremely accommodating from planning beforehand through to the end of the evening! I hosted about 20 people who were all so impressed with the service, food (slash drinks), and space! I cannot recommend this place enough!!", "author": "Jaimie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "Been dying to come check out Leyenda ever since it was recommended to me at Machete in Barcelona. And Leyendss did not disappoint the variety of cocktails were flavorful and had something for any mood you are in. The food was delicious and we cant wait to get back there.", "author": "Dev D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "What a fun night during the holiday season! Fantastic bar with festive cocktails that came in nostalgic inducing throw-back glasses.  I enjoyed the Chutzpah Spritzah, a nice take on an Aperol Sprtitz.  I won't ruin the surprise for the back in the garden but if you want to wear a Christmas sweater and take some shots next to the fireplace and Christmas tree with friends...Leyenda will not let you down.  Thank Leyenda! Here's my break down:\n\nDecor: 10/10 festive lights and decorations that were not just strung up like a lazy dad on December 18th before the in-laws fly in.  This was set up with thought, and Ruth Vader Ginsberg menus plus staffed dressed in Christmas sweaters. \n\nFood: 9/10. Loved the empanadas and steak. \n\nService: 9/10  ton of attention and quick service.", "author": "Eric F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Came here for \"Cinco de Derby\" as they put it because they're awesome and understand how unfair it is to have to choose between celebrating Cinco de Mayo or Kentucky Derby. Leyenda's all like, why not both?\n\nThey had 3 varieties of margarita and 1 julep on their special menu for the night. I stuck to the classic margarita and wow, it was excellent. Actually, maybe even perfect! They used a very fine grain salt to salt the rim which made it that much better. It was so good I had to have a second. I didn't get the chance to try their julep, but that's just my excuse to come back.\n\nOn top of amazing drinks, Leyenda has an insane food menu full of Latin American deliciousness: pupusas, flautas, empanadas, enchiladas, etc. All the good stuff. We had the patacones con ropa vieja, which is a fried green plantain topped with shredded beef, crema, and queso fresco. It was my first time trying it and it was to die for! My friend and I were fighting over the last bites. \n\nCan't wait to come back!", "author": "Jeannette N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "We were spsd to have a reservation across the street at Verde, but they messed up our reservation. Maybe it was a blessing in disguise. Leyenda was able to seat us right away (party of 8). The music was great, but not so loud that you couldn't hear each other. The food and drinks were delicious. I think the guacamole was one of the best I have EVER had! I will be coming back for sure! Thank you for accommodating us!", "author": "Claudia I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "A mixologist's dream\n\nThe extensive cocktail menu is one of Leyenda's claim to fame. I'm pretty simplistic when it come to my adult beverages (I do not need more than three ingredients in my drinks), but folks who are really in to crafty multi-layered adult beverages will enjoy this spot. Since most of the specialty cocktails have at least 5+ ingredients, it may take some time to receive your drinks if you are in a larger group or if the restaurant is busy. Fortunately for us, we came on a relatively slow night. \n\nFor food, I went the papusas. Although they were not mind blowing, as they are in some  places in deep in Queens, they did hit the spot.\n\nThe bartenders (um mixologists) are very relatable and chill; I chatted with a couple of them and a manager for a few minutes.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "I love coming to Leyenda the food is always scrumptious, the decor is amazing and the service always great ! We love it so much , my BF and I have made it \"Our\" restaurant. Flavor and the presentation are always on point.  The drinks are also super!  My favorite drink is The Headless Horseman. They offer outdoor seating in the summer, but sometimes there are a lot of mosquitos. So apply some OFF! before! Hehe", "author": "Erika G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Leyenda is one of my favorite spots in Brooklyn!  The cocktails are always creative and delicious, and the staff are so friendly.  I had heard about the bar program, and expected the drinks to be good, but the food was incredible!  We had the shrimp arepa, poblano relleno, and mole enchiladas, and were so impressed.  Very authentic and delicious.  Leyenda is the kind of place you can go to on a weekly basis!", "author": "Maya F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "I don't know what this bar is like on a regular basis but during Christmas season it is AMAZING. They really go all out. From the decor, to the ugly sweaters the staff wears, to the Christmas themed cocktails and adorable glasses, to even temporarily changing their name to \"Sleyenda\".  More importantly their cocktails were great. They had an extensive cocktail menu and the 2 I ended up ordering were fantastic. We did not have a chance to eat as we were here while waiting for a table at Lucali, but the next time I'm back in Brooklyn I would absolutely try it out.", "author": "Cassie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "Participating in an archery class really works up an appetite and boy did I find that out-lol. Before leaving Gotham Archery the other weekend, we felt hunger setting in....Deciding where to go took us several minutes. Kemi whipped out her phone and searched on Yelp for nearby eateries. We called Leyenda and they indicated that there currently was a table for party of 4. We walked there and the hostess seated us upon arrival. Leyenda had great energy with people socializing and having fun! You know that this kind of place has my name written all over it-lol.\n\nLeyenda is a Latin-American establishment that has a bar, cozy style table settings w/ stool type seating and a semi-private lounge area called \"The Pews\" located in the back where groups can hang out and enjoy themselves. I walked back there to get an idea and it is cozy. \n\nMany patrons seemed to be having cocktails. There was a couple at the bar and they had these beautiful drinks. The bartender politely informed me that they had the Tia Mia Cocktail. Well, I tried one of of course-lol. The Tia Mia has Mezcal espadin, Jamaican Rum, Orange Curcao, Lime and Orgeat. Beautiful presentation and it tasted nice and strong! \n\n We opened our menus and started ordering. Leyenda serves small plates so we tried a variety of items. Rich and creamy Guacamole was delightful w/ the chips. Good Skirt Steak. Flavorful Tinga de Puerco (pulled pork) and Pollo (chicken) Tacos....Such juicy, succulent meat in the tacos! Fantastic!\n\nLeyenda's staff are so warm and welcoming! Thanks!", "author": "Alexis M."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}