{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Very creative and thoughtful menu! My favorite dish is the ceviche and drink is the Tia Mia. Plates are smaller so you need 3-4 for two people. Mmm churros..", "author": "Bern G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "If you're in the mood for good Mexican food \u0026 drinks - this isn't the right place to go.\n- besides having to wait an hour for a table (I even called ahead of time to put my name down)- the food portions are small (had to order more food after my entree).\nThe worst part was my drink was tasty, but not strong at all- I had the Tia Mia - very pretty with all the ice, but unfortunately couldn't taste much alcohol.\nOverall- has to be another Mexican restaurant in the neighborhood to go to.", "author": "Lorraine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "The happy hour paloma was perfect. It was lovely sitting outdoors. It get's pretty crowded after 7:00.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-26", "description": "This place was very cute and the staff was very nice, great ambience and location! The food portion for the price was very small, however - definitely a tapas style and not $16 worth of food for what you get. With that being said the flavor was good and it was cooked well. Good drinks too!", "author": "Amy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "Food: come for the cocktails.. Great variety of mezcal and tequila drinks, food menu did not have as impressive of a scope although the pernil was excellent\n\nService: decent.. Waitress was attentive but she had many tables to service, also some food came before our drinks\n\nAmbience: way too loud, which is why I give it 3 instead of 4 stars.. Tables too close together.. Don't go if you want an intimate night", "author": "Kelsea Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "This place is grossly mismanaged. We called ahead of time and put our name on the list. Got there and told we were next.  The male host of the night then decided we had to wait for the only three person table to open up, which never did in the hour and a half we were there. He also said that he could not put two two-top tables together.  He seemed annoyed that we didn't want to eat at the bar. I have never experienced this at any establishment.  Plenty of other places to go, don't waste your money here.", "author": "J.S. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "I had bookmarked this place, recently opened on Smith St., to check out and see if I would be comfortable there when I'm out solo. Normally I might go to Bar Tabac or Los Lobos when I'm in Cobble Hill, but the other night it felt right to try Leyenda. Now it's potentially my new favorite spot.\n\nWalking into Leyenda, I knew I made the right choice in the moment. The place feels warm and inviting. A beautiful wooden bar on the left, complementary wood tables and benches on the right and in the back, overhead lighting mixed with votives on the tables and religious candles on an exposed brick wall...it all works together to say \"Welcome. Have a seat. You're going to like it here.\"\n\nSo I had a seat at the bar. The restaurant on a Thursday night was at the enjoyable equilibrium of being busy but not crowded. The bartender was the perfect mix of professional, friendly, and talented and made an excellent cocktail. (Rereading that last sentence, you'll have to forgive the \"perfect mix\" pun, because it turns out that the bartender was actually a co-owner and her name is Ivy Mix.) I sipped on my glass of deliciousness, relaxed, and waited for one of my best friends, who had decided to join me for a drink.\n\nI was hungry, so I ordered the Churrasco Skirt Steak. My friend showed up, sat down, was greeted by the bartender in that \"perfect mix\" kind of way, and then was served her own glass of deliciousness. (As an aside, if you sit at the bar, it becomes very clear very quickly why Ivy Mix is an award winning bartender.)  My steak came out fast, hot, and was presented simply. I'll admit my first thought was \"oh no, this is going to be the weak link\", but that thought was kicked to the curb because the steak was excellent, and a new thought entered my head: \"exactly what I wanted.\" I offered a piece to my friend (who had said she wasn't hungry); \"ooh that IS good\" was followed by \"another piece please\".\n\nWe stayed for a second drink and Ivy engaged us with fun and interesting conversation. My friend left before me, slightly and happily intoxicated. I lingered and chatted and finished my drink. I thanked Ivy and as I left I'm pretty sure I gave her and Leyenda one of my highest compliments: \"I'll be back\".", "author": "Michael K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "First off I am a regular since the opening. I would say I go at least once every 10 days if not more if I am in town (I travel a lot!).\n\nI love it here. I feel like it is a place I can stay all day. I never get sick of the atmosphere. The setting and staff make it a very welcoming place. It is good by myself, a date or a group of friends. I wouldn't trade it for the world and the neighborhood needs this place. \n\nI wanted to address some other reviews I have read. \n\nFirst let's address the noise: It is not a quiet cocktail bar and it isn't trying to be. It is lively and latin. That said it could be quieter and as a regular I have spoken to them about it. I think they are working on the sound issue!\n\nSecond, the food. First off this is a bar with great food, not a restaurant with great drinks. It is delicious and the quality is top notch, maybe that is why the price is a little high. It isn't ridiculous at all in my opinion and it is delicious. But if you are in the mood for $3 tacos from a truck this isn't your place. A lot more thought has been put in it that that.\n\nFor the drinks, They are some of the best in the country. No joke. Go ahead and look up the bar in any major publication! It is run by cocktail queens Ivy Mix and Julie Reiner. Truly, if you want an amazing drink it is here, no matter where you are from or where you usually drink.\n\nEnjoy it guys, it's a treat.", "author": "Tess M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "The place was nicely decorated and the food was delicious. We ordered the croquetas, pupusas, pork tacos, and the skirt steak. The croquetas were awesome - wish that there were a few more. The order of tacos came with 3 and had lots of meat in them ($13). Steak was also delicious. The pupusas were just alright.", "author": "Samantha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Come here for good cocktails and delicious Mexican tapas.\n\nVenue - Dimly lit wooden bar area in the front, garden patio in the back.\n\nFood - Everything I ordered was wonderfully flavorful and came out fast. For tapas, the portions are quite decent. \n\nThe dish that stood out to me most was the mofongo. All the ones I had before were dense and dry and needed gravy in every spoonful. The monfongo here was moist and flavorful - so good!\n\nDrinks - The cocktails are good and they also have wine and beer.\n\nService - Friendly", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "I wouldn't come here for the food, but the drinks are certainly top notch! That alone has me returning over and over. VERY loud on Sat night, so hard to carry a conversation.", "author": "Olga T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Really nice place and I thought it was reasonably priced! Went with my girlfriend on a Saturday night. It was busy, hostess said one hour wait. We waited since we heard good reviews. Ended up getting a call 20 minutes later. Food was really good. Try the columbian papas rellanas. They're awesome!  The staff was very attentive. There was a big party directly behind my girlfriend and she was getting bumped a lot. The hostess noticed and personally came over and told the other guest to give us so room. That was really nice of her. Will be coming back soon!", "author": "Joseph V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Awesome food and cocktails, but the portions are tiny for the price, so it ends up being pretty expensive. Nice decor and service.", "author": "Nadia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "I went to Leyenda yesterday to celebrate my birthday with a few friends.  We originally planned to go there after reading that they were having a Beyoncé-themed pop up bar, would be playing her tunes, and would have decor to honor the diva, as I am a huge Beyoncé fan.  When we arrived we quickly realized that there was no pop up bar, no Beyoncé decor, in fact the article we read on Time Out was completely off, but we stayed because the menu sound delicious and it was the food we were most interested in! Well the dishes are TINY and a bit expensive considering what you receive.  We ordered the empanadas which the waitress said were 2 cut in half, so would offer 4 pieces, and the guacamole and chips, while the 4 of us decided what to eat.  It was a joke! 10 dollars for 10 chips and a very small bowl of guacamole and the empanada(s)was really ONE small empanada cut into 4 BITE SIZE pieces for another 10 dollars.  All of their dishes are small and on average 14 dollars each, so this isn't a place you should go and you're hungry because it's expensive and you're basically eating street food.  There is nothing fancy.  In addition, the food was bland! It needed seasoning.  Now lets get to the service, while everyone was polite, the waitress would take so long to check on us which was a bit annoying as we had grown to a party of 6, and had orders to place.  The night only got WORSE when after we had eaten our subpar expensive food, and were about to eat the cupcakes we brought from Georgetown Cupcakes, the waitress brought plates and utensils for us and out from the plates and on to the table was a disgusting COCKROACH crawling on the table making us get up from the table and grab belongings and the cupcakes of course! We were disgusted and outraged.  The waitress came, killed the roach and asked if we needed anything else.  As if?! At this point I need to leave.  They didn't take care of the bill after the incident, but did take care of the 6 drinks we had ordered, and eventually when the manager saw how disgusted we were, she took off a few plates off the bill. We still paid over 100 dollars for roach infested food though.  I never write reviews, but I felt I needed to.   This was a horrible experience that I wouldn't wish on anyone.", "author": "Carmen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Amazing cocktails, great ambiance. We had the Giving Tree, Ghost Coast and loved them. Food looks great, looking forward to a second visit.", "author": "Vanessa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "Gracias Leyenda!\n\nThe cocktails are awesome. Some of the cocktails come with a \"dividend\", an extra small carafe with about a half a cocktail's worth of additional cocktail for your cocktail.\n\nThe owner got her training initially in an underground mezcal bar in Guatemala and then at Clover Club across he street.  She knows her stuff.\n\nThe food programma is also dope. Get the churros and the pupusas.\n\nIn a neighborhood with some great spots, but weirdly a lot of meh cocktails (except for a few very key places of course), I welcome Leyenda with open arms and have instantly become a regular.\n\nI should also add, everyone who works there is really, really nice.", "author": "Matt B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Stopped in here for NYE and didn't want to leave.  Great atmosphere.  Great food.  And the drinks (the cocktails) are ridiculous -as in great!  I will definitely be visiting Leyenda again.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Mediocre service, decent dranks. Not worth the hype. Glad I came, but wouldn't come twice. Take this with a grain of salt, because I loved the drinks. But they'll my need work on one major aspect.", "author": "Jim A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "Great little restaurant food and drinks are really good!  Pork tacos were delicious but mine was served warmish bordering cold- no plates were given to us so I got taco all over my lap bug luckily didn't ruin my new jeans because I used a napkin.  Guacamole is too small of a portion for me to order again but very delicious served with tasty salsa.  The salsa portion seems bigger than the guacamole though and not enough chips for sure lol.  Cocktails are very good.  Service is ok but the stars of this place are really the bartenders.  I like this place and would come back for sure.", "author": "Annie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-15", "description": "The food here is terrific, and got better as the night went on. The ceviche was only so-so, but the panuchos were solid and the red snapper (with plantains) was absolutely terrific. The guava and cream cheese empanadas were a nice touch (I didn't know dessert empanadas were a thing).\n\nSo why only three stars?\n\nPoor value. The portions are very small and quite pricy. The ceviche, which was mostly fruit with a dash of ahi, was $13. The two-bite panuchos were $16 (compare with tacos at OMG) and the wee bit o' snapper was $22 (compare with a whole fish at any Chinese restaurant).\n\nPoor service. They were pretty understaffed (there appeared to be one waitress on Friday at 9pm), and it took a long time to get her attention. And more time to get water and napkins. When we got the check, she had turned around and left before we could hand her our credit cards.\n\nThe place is also crazy loud. I had a hard time talking to my friend (seated adjacent to me at the communal table). Leyenda, you're running a dining establishment, not a nightclub. Turn that shit down and get some sound-absorbing gear in.", "author": "Paul S."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}