{"aggregateRating": {"reviewCount": 194, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-02", "description": "Nice place, good atmosphere. Drinks are great, food feels like a bit of a rip off. I had \"corn\" that cost $4, and I imagined it was cooked kernels of corn, but no, it was uncooked and cold... As if they'd given me yesterday's serving or something that had been sitting out for at least a day. The arepa with shrimp was OK, once again, very small. So, if you're looking for a place to have really good cocktails, this is it, but if you're looking for good drinks and decent food, move on. Maybe the food will get better with time and maybe they'll remove the corn from the menu, you guys, it's gross.", "author": "T P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Easily my favorite bar in Brooklyn, most likely all of New York. The Buena onda and pan-am sour cocktails are must-tries. Chimichurri skirt steak, papas rellenas are the best items on the food menu. Moderate prices, quality is awesome. Really doesn't disappoint :))))", "author": "Lucy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Feelings catcher is by far the best cocktail i ever had. I love guava. The place is so cool its like walking into a latin home with all the catholic candles. I will come again", "author": "Cesar G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Great neighborhood bar with absolutely fantastic and creative cocktails. Sam is our favorite bartender, I usually don't even pick a cocktail on the menu, I just leave it in his very capable hands.The atmosphere is lively without being too loud. Great vibe for a date or drinks with friends. The outdoor patio is a huge plus too.", "author": "Mara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "The whole place is perfection, from the wooden boxes that house a fine selection of rum, tequila, mezcal, etc. to the solid cocktails and the fresh ingredients used to prepare the spot on dishes. Mix in a cool track of Latin classics and an easy laid back atmosphere and you've got one of the best bars in NYC.", "author": "Yeni D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-19", "description": "I was disappointed in the the small portions for the price. I paid 20.00 for an entree the size of an appetizer. They don't have salsa that is actually spicy in the house, Which is a big disappointment for someone who appreciates Latin and Mexican Food. But I've had better coconut shrimp  from Red lobster which is kinda sad. I was inspired to write my first Yelp review on my girl friends page because this place was so bad.", "author": "Melissa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "The food is better than a lot of \"restaurants\" and the drinks are sublime (I want to know what it takes to get that extra carafe).", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "If you want great drinks go to Leyenda. It's a bit cramped but the drinks are outstanding. Very nice and courteous wait staff. Gets packed very quickly so try to get there a little bit on the earlier side to avoid a wait. Nice place for a date.", "author": "Tanya Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "Ordered ONE drink, and after 20 minutes, still had no drink. We went in for a very quick refreshment, but were very disappointed. I paid a bit ahead of time in order to bounce as soon as we finished the cocktails, but had to insist on a refund for the drinks that were STILL not even close to being made. The short manager with very short, possibly blond hair, was GREAT and I am thankful for her accommodation and sincerity.", "author": "Madeline M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "One of my favorite places for drinks in Nyc! :) must try the Tia Mia , la sonambula, and the lil smokey!", "author": "Foodie Sqirl O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-05", "description": "I like this spot... Mostly because I like the vibe, which is somewhat chill but also upbeat; it has a cool vibe without being trendy or pretentious. Walked in kind of late on a sunday 3-day weekend, and it had a good crowd. The drinks were strong- to the point where I didn't like the taste, but some people like that. The food was decent; I had the chicken tinga tacos and empanadas. The service was whatever. We had what we needed, but nothing more. Overall, I do like the spot and would go back. The food and the drinks were fine but not the draw for me at all.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "This is an excellent new bar from the team at Clover Club (across the street). The drinks are largely Latin-accented riffs on the classics, but all of the cocktails that I sampled on a recent visit were novel, complex and exceptionally well-balanced. The kitchen is not in the same league as the bar, but the food is still quite good. The menu features an array of popular Latin American dishes: papusas, arepas, tamales, tacos and the like. I look forward to returning soon.", "author": "Will D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Really good drinks. Show me a person with discerning taste in cocktails and I'll show you a bloviating dipshit.  But... um, yeah, these are really good drinks.", "author": "David Z."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Leyenda", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "221 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUQ2UGmiBD4Rh2H_6l-WLg/ls.jpg", "@type": "Restaurant", "telephone": "+13479873260"}