{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-04", "description": "Beer was pretty good but pricey, I recommend the any of their IPAs. Food was Ok, nothing worth noting. Happy hour ends at 6PM which kinda sucks. Would probably not return.", "author": "Jake C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-06", "description": "This was a place that my girlfriend and I were very excited to check out after our recent move to Downtown Brooklyn. Upon arrival, we immediately noticed what a cool space and lively atmosphere we had strolled into. However, not many more bright spots were to be found.\n\nWe decided to order the Clam Pizza based on the several positive reviews for the item. Unfortunately, my initial thought after it came out was \"I expected the clam pizza to be a little clammier than this!\" There were approximately five tiny pieces of clam on the entire pizza. We could barely taste them. Also, the crust was lacking in texture, and I felt like I had eaten a cheese pita for dinner when I was done. Most would understand a higher price point for a quality meal, but $21 for this bland, unsatisfying pizza is absurd. \n\nAdditionally, the beer selection is a bit lacking for a brewery, and the $28 wine carafe we were talked into tasted cheap and sugary. Lastly, the server appeared aloof and clumsy throughout the night, even breaking multiple dishes behind the bar while we ate. \n\nWe will probably give Circa Brewing a second shot, but the first go-round was quite disappointing.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "A super cool brewery/restaurant! I was so undecided on what beer to get but the bartender was super helpful with making suggestions and samples. I finally picked a Pilsner. \n\nWhen then got sat and shared this amazing pizza below, the Boys Got Heat! Not super spicy but very flavorful. We were surprised it filled us both up, but I guess the two beers helped . \n\nWill definitely be back again for HH soon!", "author": "Mia N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "Although the beer and food might be a bit underwhelming, the venue and ambience are fantastic. It's a huge venue with super-high ceilings, large sports screens everywhere, and a variety of seats, whether at the bar, at stand-up tables in the front, or more social and more private tables in the rear. \n\nYou can sample the house beers in flights of four. Beers like the hef, the pilsner, the altbier, and the Live and Let Hop IPA were smooth, drinkable, and decent. They weren't mindblowing, but maybe I picked poorly. Or maybe I was simply jaded after a day's worth of bar hopping and beer tasting.\n\nService was quite friendly and efficient for both the beer and the food, although after having ordered the calzone ($23??) only to find that it was little more than a piece of flatbread with an extremely slender amount of cheese and meat, I might stick to just drinks next time. Otherwise, the menu consists mostly of pizzas or apps that are similarly priced.\n\nNevertheless, the venue and ambience are beautiful. Perfect for after-work drinks or for groups.", "author": "Vincent L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "Food: 8/10\nService: 8/10\nAtmosphere: 6/10\n\nCirca Brewing is always great for good pizza and good beer.  They do some custom micro-brews in the massive tanks visible from the dining room (you can actually witness some of the mashing/brewing process if you show up right when they open), which are always great, and you can sample anything they have on tap to figure out what your taste is.\n\nMy favorite pizza is the Salumi which is finished with a touch of honey for a really interesting finish.  Any pizza is going to be a winner, but the real sleepers of the menu are the burger and rosemary fries.  The burger is made with bacon right in the ground beef mix and adds a really nice salty, umami note.  Everything I've tried is generally pretty well executed and has a nice flavor balance - definitely check it out for a quick bite and brew!", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "Very cute place, great ambiance. The staff was very knowledgeable and accommodating. I wasn't sure what to order since the menu was vast, so the server brought me a tasting, which I enjoyed. They make beer onsite, very crisp \u0026 refreshing. \nOktoberfest was my favorite of the tasting, 'tis the season!", "author": "Gee G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-31", "description": "Circa has a lot going for it. It's perfect for big groups, easy to get to, and a great place to watch sports. The beers are satisfying and the menu will appeal to everyone. Pretty unique for its surroundings, Circa can get busy, but the staff is quick and attentive.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-21", "description": "Place was nice and hipster-like with the brewing tanks in the background. Menu is pretty simple and offered more unique meats and also offered really expensive beer. We questioned the price (500 ml beer for $36), and they said it was from a specialized brewery.  For appetizers, we ordered the brussel sprouts, cheese board, wings and the fries.  All of the appetizers were great. My fave was the brussel sprouts and the wings. We also ordered several different pizzas, the only one pictures is \"The Choke\" which is a vegetarian pesto pizza. Enjoyed this pizza. I also tried the \"Shroom\" pizza which had mushrooms and that was good too. The other ones ordered at the table was the \"boy got heat\" and margherita. Those were enjoyed by the people who ordered them. The only thing disappointing with the whole meal was that the one of the wing order was burned and the same guy ordered calzone and both were burned.  I attached a pic of it here. The guy was just too nice to complain but this was ridiculously burned and should've been sent back. Service was great. Food came out fast and Kinsey our hostess did a great job. They were able to let us have separate checks but added automatic 20% to our bill because there were nine of us. All in all we had a good dinner.", "author": "Abegaile S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Tuesday evening and somehow was able to get two seats at the bar despite the after-work crowd. Large setup with table/bench/stool seating, good music, and an overall chill vibe.\n\nObviously a solid amount of beers to choose from (as well as wine and spirits). Decided on the Double IPA ($9) and to split the Circa Fries ($9) and the Meat \u0026 Cheese Board ($18). IPA comes out first, high bitter that's rich enough to sip on. The board comes with four types of cheese, pepperoni, beef, toasted bread slices, spicy pickle, and sauerkraut. Variance in cheese is excellent; my personal preference being the softer types. Favorite part of the meal were the pickles, providing a welcome kick to balance out the flavor. Fries are thin-cut style and served with a delicious Chipotle mayo.\n\nDespite the amount of people, never felt too crowded and the bartenders all helped out to fill our order. Hopefully get to try their other beers soon.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "Great beer - tasting a flight is fun. Lots of space for groups of friends. Great flatbreads (the Margherita was okay but the more creative ones are delicious. The dough is great).", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "I used to live in Brooklyn, and remember hanging out in this area a few times, but could never a large or relatively quiet bar to hang out with friends. Circa Brewing fills a huge void\n\nWe came here for my girlfriend's birthday and emailed Sarah the manager in advance. She was very pleasant over email and set us up with a table for 14. We were seated in a nook right by the kitchen, which was perfect for our group. We were relatively isolated in a quieter area but since it was not a closed room in a corner, flagging down waitstaff was not an issue. Alex was our waitress for the night and she was awesome. My girlfriend loves sour beers, but unfortunately they didn't have any on the menu. Alex was knowledgeable and genuinely helpful in navigating the other options to find something we liked. There are more beer options than most places in Brooklyn - props. In addition, the pizza was delicious and the crust was on point. I'd recommend the Hawaiian, Salumi, and Boys Got Heat. If you like scotch, the Scotch ale that they brew is really good. The blood orange IPA is also really good - classic IPA, though not too hoppy, with a hint of bitter orange rind. \n\nThey were also nice enough to bring us a few pizzas/appetizers free of charge that the kitchen had made and had gone unclaimed. Not sure how they went unclaimed, but I'm not complaining.\n\nThe best part was that they let us bring in Doughnut Plant as the \"birthday cake.\" Can't say enough good things about this place. Definitely coming back", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "I don't have too much to say about Circa. I came here as the last stop on a brewery crawl. We were really excited for the pizza after a full day of drinking. But when we showed up at 8pm on a Saturday night they informed us they were out of pizza dough!! I was super disappointed and have no idea how this happened. I tried the Dark Lager ($7.50, 5.6% ABV) which is outside of my usual picks. I wasn't really a fan, but like I said, it was a step outside my comfort zone.\n\nWhat I can say about Circa is that its atmosphere is a 10/10. The space is very large with different seating areas so you can kinda pick your vibe. My friends and I stayed towards the front which was more casual with smaller tables we could crowd around. But in the back they had lots of dinner seating if you're there to eat", "author": "Jordana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "I visit Circa pretty often and have never had a bad experience. Their brews are tasty and so are their ciders, sours and cocktails. In addition to their signature pizza, they have amazing brunch options such as chicken and waffles, and a melt-in-your-mouth quiche! My favorite pizza is the Lox and the Salumi. Go early for happy hour 3pm-6pm where they serve $5 drafts, $6 wells and $7 glass wines. Kudos to the team for running this place so well! It's a fun spot for groups or if you just want to kick back solo with great beer -- Circa has something for everyone. :)", "author": "Joanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "I tried this drink two weeks ago with friend when the weather was still warm. It's called the last summer vacation. Super tasty.", "author": "Xingyao Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Stopped here with coworkers on Monday night. The place is very \"Brooklyn\" in case you had any doubt. That's a good thing in this case. More on that in a second. We were greeted by Rachel (I think) who was exceptionally helpful. We informed her that it was just the two of us but the rest of the party was arriving in 20-30 minutes. We figured that they might not seat us, but Rachel said: \"No problem, make yourself comfortable and grab any table you like\". Both her and our waitress kept checking on us every 5 minutes after that - incredible attentiveness if you ask me. \n\nSpace. Huge seating area, a few of them to be exact. They have booths, tall tables with bar stools, and intimate lighting style seating in the back. Pick your poison. Showcasing right in the front are the shinier than thou beer tanks right behind the bar. If any of your friends are addicted to alcoholic-style Instagram selfies - they can feed that addiction here all right. Also, umm shuffle board, need I say more ? :) We settled on the long tall table in front of the bar. \n\nBeer. We asked Rachel for beer recommendations and she helpfully described every item on draft and in great detail. We settled on \"Octohoppy\" and \"Dark Lager\". The former Bondvillainesque brew is as you would expect, umm hoppy, perhaps too much so for my taste. If you are a hop hound I am sure you will love it though. My Dark Lager was of very standard variety. Good, but not exciting, as it's supposed to be. After that I switched to \"Altbier\" - now that is a good brew. Not too crazy on ABV, very balanced palette, neutral aftertaste, beautiful amber color. \n\nFood.  We ordered Iberico ham appetizer, and the presentation on that was amazing. Inasmuch as I like cured meats, the pickled tomatoes from that dish were my favorite part. Speaking of Iberico - their leg is on a very prominent display in the kitchen area. I digress. Goat milk ricotta puffy bread appetizer is fantastic, be sure to order that. Pizza. They seem to have some crazy ingredient ones and I was a bit squeamish so we stuck to more traditional looking ones, \"Salumi\" and \"Lardo Bianco\". Both were a huge hit with our party.  If you are into traditional puffy thin crust (I am) this place is for you.  \n\nAtmosphere.  To wrap up this review I just want to say that this place is great in a \"good hipster\" kind of way. The staff are genuinely happy to see you and helpful. The music is loud enough to figure the song but not loud enough to stop the conversation. I came here again with my kid for Friday brunch and it was just as good and welcoming as when I was with a bunch of semi-rowdy colleagues.  \n\nTLDR: Excellent food, good beer, phenomenal staff.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Was finally able to check this place out on a recent Friday evening, post- theater. I was happy to discover that their kitchen stays open on the later side, and that they have a whole variety of proprietary beers on tap.  Bf  and I sat ourselves at the bar and tried two of their Stouts (mine, an Irish Red, and his an Irish Stout).  Both were very good, though not as full bodied as I would have expected.  We sampled their crispy brussels sprouts with lemon aioli and peanuts (very good) and then decided to share a Hawaiian Pizza, because, we weren't going to turn down an opportunity sample some pizza from a wood fired oven.  The pizza was a bit doughier than I liked but appropriately blistered and tasty.  Bartenders were attentive and nice. \n\nThe modern lofty space suits the new Downtown Brooklyn, and is a welcome addition to the dining scene here.  Definitely will plan a return visit soon.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "I went to this place with a bunch of friends from work as a group bonding event. They gave us several long bar stool tables. It was a fun place with nice casual brewery decor. Clean.  We had pizza and beer...the beer I thought was just ok. I tried the cream ale which was a nitro and the coconut porter. I was excited about both but in the end both were simply avg in my opinion. I would give the cream ale 3/5 and the porter 3.5/5...the pizza was good. It was served hot and had creative menu options. Less good when it got cold but that was our fault lol. Overall I would return but not a must go out of my way....therefore I thought 4 stars was appropriate.", "author": "Jon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "I started frequenting here during January and I still do. They change their menu fairly often and I've seen pizza and beer selections come and go. Happy hour is a good deal so definitely come by during it when you can (I believe its either 3-6 or 4-6, weekdays). \n\nI've had a fair share of pizzas here and if you enjoy interesting topping combos, pizza dough a little chewy, and don't consider charred pizza (see pics) atrocious, then you're in for a treat. One of my favorite pizzas from here had wild mushrooms, truffle oil, over easy egg, and cheese- unfortunately they got rid of this but I still enjoy all the interesting pizza combos they come up with. The varieties of beer here is awesome! and they change it very often. Getting a flight might be a great idea if you enjoy a variety of beers and cannot decide. I always opt for any Nitro beers they have, but I was never disappointed when I couldn't decide and asked for bartender's/waiter's choice. I'm not too big of a fan of their wine selection but they do have great ciders on rotation as well. And don't worry cocktail fans... they have that as well and they're very tasty. I must say the food is a bit pricey, but being in Downtown Brooklyn, this is the new standard.\n\nThey have live music sometimes on the weekends for brunch, and sometimes it gets really lively on weekdays because a lot of offices/schools are nearby and people enjoy after work gatherings. With that being said, it is veryyy spacious inside, two TVs (I always only see 1 on unfortunately), a deck shuffleboard, outdoor seating when weather allows, and huge bathrooms! Waiters/waitresses and bartenders are very attentive and friendly. As a local, I love seeing familiar faces in establishments I go to and the staff here never disappoints. \n\nI highly recommend this spot to anyone looking for a quick drink or a quick bite in Downtown Brooklyn.\n\nP.S. They have a loyalty program that links to your credit card. I believe you have to put your email address onto the bottom of your receipt or just let them know you want to join it.", "author": "Jodie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Much like my Yelp friend Matteo, I love pizza and I love beer, so I was very happy to find out about this place.   \n\nThe space is really large and laid out nicely so there are different little areas that give you different vibes from big and spacious to cozy and intimate.  The bar is well designed and the staff are friendly and fairly efficient.\n\nI had a Hawaiian pizza and it was delicious.   The only beer I tasted was the pilsner but it was a great example of one.   We had a beer club meetup here and everyone was very satisfied with their beers, food and service.  \n\nGreat addition to the neighborhood and close to the Jay St subway station so it was a quick trip to get home.  I'll be back.", "author": "Bill T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Yelping for brunch spots lead me here.  When we walked in we were really surprised by the space, It was unassuming from the outside, but spacious and open inside.  Loved that there were ample TVs for game watching.\n\nI was super hungover, so I did not try any of the beers.  A friend got a flight and said they were not amazing but pretty good, they were out of IPA.\n\nI got the mushroom hash which honestly cured my hangover.  It was delicious, and the bread! So good! Friends got the ham, egg and cheese sandwich and the chicken sandwich and both were very good as well.  The buns the sandwiches were on were also delicious.\n\nDocking a star because the service was off. The waitress and staff kept trying to take our places when we clearly were not done eating, It was just odd.", "author": "Danielle L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}