{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Staying in Downtown Brooklyn for a quick visit to New York, we had beer and snacks at Circa.  Great spot!  Server was extremely knowledgeable about beer generally and their product specifically.  She set up everyone in our group (whose tastes range from lagers to double IPA's) with the perfect selection.  Great beer, terrific pizza, great atmosphere, great service in an easy to reach spot in Downtown Brooklyn.  What else can you want???", "author": "Steve B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "Came here for the New Year party with a group of four people and we had so much fun! The music was great, unlimited pizza and drinks. We couldn't ask for anything more for a new year celebration. The food tasted great- I especially liked the \"Choke\" pizza, Brussels sprouts, and agnolotti. The figanacci sequence drink was our favorite. The wait staff were very overwhelmed with the amount of people so it took a while to get our orders but all in all it was a great event. I'd love to come back!", "author": "Fallon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Perfect place for a date or hanging out with friends.  Interior looks amazing and the beer and food options are delicious. Staff was all super nice as well.  We sat at the bar and loved our time here on a Saturday night.\n\nDefinitely recommend getting the \"boys got heat\" pizza.  Absolutely delicious - Italian sausage with roasted peppers, what could go wrong!  This place is legit too, having a couple of real brick ovens where they cook all their pizzas.  They have a couple of great and strong beer options that we tried out as well.  Will definitely be back!", "author": "Stephanie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "Great place, definitely coming back and bringing a crew next time. \n\nThey have Wi-Fi and will share the password if you ask for it.  Its not so loud you can't have a conversation, there aren't lots of group seat but there plenty of room for small groups or a large group in small clusters and it's not too far from Marriott Brooklyn Bridge if your staying there. \n\nStaff is friendly, food comes out fast and is as good as it looks in pictures (unless someone took a crappy picture ) I know it's a sin in some pizza worlds but it would be cool if they could have a dessert type pizza. Maybe something weird like peach cobbler and ice cream or maple bourbon bacon with ice cream. I'm sure there is something sweet and salty that would go well with beer and that awesome nana type pizza dough.", "author": "Allison E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "I've been to Circa Brewing twice now. Once with colleagues for happy hour and once with my boyfriend to delve into some food. On my most recent visit we arrived at about 4pm and sat in the back dining area. Our initial server wasn't the friendliest but it was apparently near the end of her shift and the girl that replaced her was much nicer. Nonetheless we ordered a pizza. One important thing to note is that their dinner menu doesn't start until 5pm so while we wanted to try some of the dinner options we ordered the pizza and then the pâté and some French fries after 5. My boyfriend loved the pâté and we both love the rosemary (I believe) French fries. \n\nThe pizza was just okay. We've both have simply had much better. It had spicy Italian sausage on it. Initially it was too spicy for me but my taste buds got used to it. \n\nOur drinks were pretty good. We started off with some beers and then once I realized that they also had liquor and wine I had a vodka soda which is discounted during happy our. \n\nOverall, I like circa brewing for the drinks and after work crowd atmosphere. I'd definitely recommend this place to others to have drinks with a large group of friends because this place is very spacious. The jury is still out on the food. I will return again after 5 to explore more options from the dinner menu.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "What a great spot by the Jay St subway station! One of the nice things about this place is that they make their own beer so everything tastes a little unique. The Pilsner (which is what I had) tastes like a Stella draft and it's a pretty tall glass they bring it out in, so the prices are super reasonable. The other beers they have are also really good. I had a variety of their pizzas and my favorite had to be the choke- the artichoke pizza. It was really good! I think one person would be able to finish a whole pie and be really full off of it! Other great pies are their margherita and the salumi. \n\nThe atmosphere of the place is very casual and it's really a large space so it's great for groups. There are two bar areas (one on the left and another on the right) and when you walk towards the back there is much more seating for really large groups. The service is great and the staff really knows their way around the menu.", "author": "Elizabeth D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-14", "description": "I just don't get it. Service shockingly wasn't an issue. It was the food. The food was absolutely horrendous. I came for brunch with a friend and we both had fried chicken and waffles. Somehow I thought I saw a peach waffle situation on the menu online but I guess I was looking at another spot. I'm more into sweet breakfast. If ever I order chicken and waffles I eat them separately. Unfortunately, their spicy syrup requires it to be eaten together. Well, the meal was so unappetizing I ate it all together. The waffles tasted like hopes, dreams and aspirations. Like no cinnamon, nutmeg not even salt went into the batter. The chicken tasted like flour. Just like crispy fried flour. Come on guys, you can't be that hard up about salt that you're not even putting it in homemade waffles. Not a beer or cider person so I can't give my opinion on that although I did try a few. This place is not my cup of wine. I used to want to try the pizza when I used to walk past. I'm nervous about that. Sorry, I was not a fan. The space is beautiful though.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "So this trip we skipped the apps and just got drinks and pizza. Both of my parents got house brews and really enjoyed them. I got a seasonal unfiltered winter cider from downeast cider and found it quite good as well. We each got a pizza and split them- salumi, the choke, and the Hawaiian 67. We all agreed that we didn't have one favorite pizza per se. Three pizzas for three people ended up being about the right amount of food- we had about 4 slices left over. A good stop for beer and pizza, and I'm sure we'll return for more!", "author": "April H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-08", "description": "I really want to love this place but, it gets worse every time​ I go.\n\n​I had tried the Steamed Clams the time before last and I believe​ there were 6 littleneck​ clams for $14 dollars and didn't even come with bread to soak up the broth they were served in.\n\nThe latest version of their menu is pretty lacking with anything other than pizza. The starters include 2 different sliced meat plates and 2 that are just vegetables (just pickles and brussel sprouts). The entrees other than pizza included a $30+ steak, a hamburger (which is pretty good by the way), and a salad (in addition to the salads section). Great if you're not looking for a protein and trying to spend $16+ to do it.\n\nThe pizzas usually are a bit soggy in the middle so I ordered them well done and got one of them burnt. The issue is that on the clam pizza there aren't many wet toppings to keep it from burning. The breadcrumbs on top which burned probably immediately. I get that I said well done but, as a server, you should see that it's burnt and have them get another one going. As a cook don't put the breadcrumbs on, in the beginning, knowing they're just going to burn​.\n\nService has gone downhill each time as well with this last time feeling rushed in an empty restaurant.\n\nI feel like if they expanded their beers to a few other local options or had better beer deals and expanded the menu with a couple more staples besides the pizza and cheeseburger this place could be pretty popular. It has had less and less people in it each time and it's a beautiful space. Right next to me so I would love it to be great.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "I like this place. I've yet to have a sit-down dinner here, but it's a great spot for an after work happy hour.\n\nThere's a lot of different seating arrangements, from a selection of outdoor tables to these high-tops by the bar, which are perfect for groups who are drinking and snacking.\n\nThere are (of course) plenty of beers on tap to choose from, but also a wide selection of ciders, wines and cocktails for non-beer drinkers like me. Drinks are in the $7 to $12 range, which is really reasonable.\n\nAnd the FOOD. I've had their thin crust pizzas, their meat \u0026 cheese platter, and their ricotta - everything has been super fresh and delicious. One of these days I need to sit down for a proper meal. The pizzas and mains do get pricey, so I would recommend sharing if you can.\n\nIt gets very loud and busy very quickly, but it's generally easy to get a drink from the bartenders while you wait for a table.", "author": "Marina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Wow! I love this place! The pizza was amazing and the place is super fun. They have games and the beer is delicious. I had the clam pizza, I would definitely order it again. Overall a fun place for a group or even a date. I'll be back soon!", "author": "Carly G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-21", "description": "This brewery is HUUGE! So much space in a great location in downtown Brooklyn. It was pretty crowded on a Saturday night around 7:30pm\n\nThey have a variety of beers to choose from on tap, as well as canned ones. All the ones I tasted though were not that great OR just meh... they had a weird aftertaste, so I'm not sure if it was just the tap or what.\nIt didn't seem like anyone really enjoyed their beer at our table. \n\nWe also ordered some pizzas for the 6 of us. \nWe got the margherita and the clam pizza\nThe margherita pizza was pretty good - your standard with tomatoes, cheese, basil. \nThe clam pizza was not that great.. wayyyy too much MINT. Yes, minty pizza.. it was very odd. If it didn't have that much mint, I think it would've been an ok pizza.. but that's all you could taste.\n\nOverall, it's a good place to hang out with large tables and such. But food and beer could be better", "author": "Kimmy U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "I definitely think of Circa as a neighborhood place. I mean, yea because it's in the neighborhood, but it's got a welcoming vibe, doesn't take itself too seriously, and it's so large that it feels like you can always get a seat/table whenever you stop by.\n\nThe ONLY thing that keeps it from a 5 star from me is, like others have mentioned, the prices can be a little...high. I mean, I totally understand the area, but look...a $21 burger. I've not had it, but a friend has, and yes, I've heard it's incredibly filling. But seriously. It's a burger. And I can't get over it. The food is good - not knock your socks off, but I think the menu has something for you whatever you're craving, but the price is always just slightly higher than what you'd imagine paying.\n\nBut I would tell people to travel here because I think it's worth the experience, especially if you're a lover of beer. I'm not by any means, and don't normally drink beer, but I've had a few here and even I can say it's super impressive.\n\nThe decor is amazing. Industrial, but it doesn't try too hard. And the people who work here, I've found, have all been incredibly nice as well.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "This place is pretty impressive. Their brewing process is visible to the public, with these stunning stainless steel vats brewing all different types of flavorful beers. The staff is super friendly and attentive. My friends and I had the Margarita Pizza, it was amazing. They also play all major sporting events including the world cup. I highly recommend this", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Every time I'm in New York I want pizza. So I go to Prince Street, Joe's or Marta, which are all 100! But this time I was in Brooklyn and stumbled upon Circa Brewing, for a drink. The brewery is great. Open, lots of TVs, fun/chill atmosphere. The beers here are great too. Top notch! Then I got hungry. So I ordered a Margherita pizza. It may be the best pizza I've ever had. The crust was blistered. The tomato sauce was robust and soupy and it was amazing. The service was great too. Such a great experience and I'll def be back when I'm in Brooklyn!", "author": "Shawn A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "Found a deal on Pulsd, couldn't resist a bottomless beer/cider brunch deal. First off, great space, I love breweries and the brewing process as a whole. You can see that it's an active brewing space and they show it. \nNow we have Alex, our server...polite, funny, complimented me on my glasses(the way to my 4 eyed heart), she had suggestions and advice...this girl knows her shit. \nFood time!, I got the steak and eggs, my bf got chicken and waffles w/ a side of the gruyere onion hash. My dish was great, my steak could've used a touch of salt. Now for the meh part, I tried my partner's fried chicken and while the chef's did a great job at dredging and frying...the meat was a tad under cooked(there was pink and a dash of red present in a thigh)as well as it lacking flavor. I come from a long line of fried chickenologists and my osuggestion is brining the chicken overnight. It absolutely needs that treatment, the chicken deserves it. \n\nOther than that, great brews, great space and good eats. I'll try the pizza next time.", "author": "Perrier R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "First and foremost love the Kilner spice shakers on the table. Made in the U.K.  They are fantastic for cooks and customers alike with varied size openings. \n\nGina was our server. She was lovely, friendly and so helpful with beer selection. \n\nThe winter green salad was very good. Interesting mixture of greens, delicious parmigiana cheese. Tasty toasted slivers of focaccia. \n\nSalumi pizza isn't Pauline Gee's but tastes close. Nice chewy crust too. \n\nCheeseburger was delicious. Too well done on the patties, but the pickles and cheese and tomato made the sandwich. \n\nDefinitely check this place out if you're in downtown Brooklyn cool setting and vibe.", "author": "Jan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Me and a friend came for the 2 hour bottomless cider/beer. We got a deal from Pulsd which included bottomless and food for $49 for the two of us. Definitely will come back. We got pizza and stake and eggs every was good. Industrial look, cute setting", "author": "Diana P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-03", "description": "Go for the atmosphere and beer taps otherwise food and service need much to be desired!   Brunch crowd can get packed not sure why", "author": "Jj L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "I came here for an event and was thoroughly entertained and satisfied.  They have a nice variety of brews and the eats where great!!!  The provided seasons brewski for you true fans.  They also have eats from the pizza to the tappas like plates.  Very nice and the location is nice to.  If you have a group event and want to do something fun and interesting this is the spot.  They give tours!!!:-)", "author": "Nicole B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}