{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Fun brew pub with great service, excellent beer, and delicious treats. Get a flight (4)  and then order your favorite brew. The lighting design is excellent with great decor.", "author": "Marti H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Needed to kill some time before checking into my hotel and I always try to find a local brewery when I travel so this was the spot for me! I was able to get a seat at the bar. I ordered a flight and they were tapped out of one of the beers so Shawn gave me an extra while we waited for the keg to be changed. I ordered the goat's milk ricotta puff and that was the perfect snack (probably intended to share but I made it my main meal). Would definitely go back to try out other food from their menu. One of the better local breweries I've been to.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Just went there with my son (who is now old enough to drink) and sampled the beers. All of them were solid, well crafted brews. The ones that really caught my eye (tongue), were the Octoberfest and Pilsner beers. Delicious and well lagered. The attention to craft shows on these more challenging styles. I like that the beers are rotated, so there is always something new to try. The staff were excellent and attentive.", "author": "Oscar S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "The beers are great, lots of complex flavor and great size pours for the flights. The food is also super delicious. GET THE PICKLE JAR! So good! Also the staff is super nice and the ambiance is great. Close to a bunch of subway lines so easy to get to.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "Fun night celebrating a friend's birthday dinner. The food was solid...probably some of the best French fries I've had in years. Nice beer selection and great pizzas. My favorite was the clam pizza, definitely worth a try if you like spicy. Hawaiian pizza was also a nice treat.\n\nI would give this place 5 stars but the service could have been better. The waitress took forever to check in with us and even bring water. Also...no dessert? Really? A pizza place should at least do a Nutella pizza for dessert. Overall, a great experience, worth checking out if you are in the area.", "author": "Veronika L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "My friends invited me to a happy hour and dinner at this new brewery in Brooklyn after work. I had never heard of it before since it just opened a few weeks ago so I was very excited to check it out! Please see below for the pros and cons of my visit:\n\nPros: The space is large and the ambiance is very chill! I really loved the old-world feel and décor inside. \n\nThe happy hour special is a great deal! You get two free beers (don't get to choose them from the menu though) and a delicious margherita pizza for only $20! If you're not picky about your beers and pizza, this is a steal!\n\nI was happy to see there was a shuffleboard and played a few rounds with my friends! We had a great time!\n\nCons: When I requested a table for 5 people, they gave us a tiny booth in the back that is really meant for 4 people. It was really uncomfortable to be squished so close to each other so we requested another table.\n\nWe were not given a menu with the happy hour specials and our waitress never mentioned them to us. We only found out about the specials through my friend who had been there before. My other friend was a bit peeved that she had already ordered some drinks before she knew about the specials.\n\nThey seemed to be understaffed for a busy Friday night and our waitress was understandably flustered and short with us whenever she stopped by our table. \n\nOverall, this brewery is a great addition to the downtown Brooklyn scene and I am definitely adding it to my list of happy hour favorites!", "author": "Sarita B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "A fun time!  Great beer selection and good food. Fun vibe.  Nice decor. We enjoyed the beer flights.", "author": "D M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I had such an incredible experience at Circa! I hosted a birthday party here for 50-75 people. We were able to reserve the Biergarten area. I coordinated with Sarah, who was extremely helpful and accommodating. The day of the party, Sydney and Jessy ran the show and made sure all of my guests were attended to. I work in the hospitality business, and this was hospitality at its finest! The drinks were great and the pizza is delicious. I will definitely be returning, and I highly recommend this venue for small or large gatherings.", "author": "Allie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "This is a modern and fun brewery I went to on a Saturday with friends. Not only was their Oktoberfest one of the best I've had, my friends enjoyed their flights of beers.\n\nI was hungry and had to try their pizza. I shared their lox pizza with one of my friends. It was smoky and tastey! I love lox so I wish there was a bit more of that on each slice.\n\nThe staff was great and they keep the place clean! Our bartender explained their special events to us and was funny. \n\nI'd recommend this place to anyone. I'll even travel from uptpwn Manhattan to go again.", "author": "Ross R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "First time New Yorkers, we have been running around eating and Drinking our way through this fascinating state. Tonight we took the subway from Manhattan to visit Circa Brewery. \nNo disappointment here!\nBEX was our pourer and amazing conversationalist! She directed us to a few local \"need to do\".\n\nBrooklyn has been amazing. We won't forget!\nThank you BEX \u0026 Circa for a great time.", "author": "Jordan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "I came here with two other people and we each had a beer, a pizza and split some sides. We sample the margherita, above average but not amazing, the white pizza, quite nice, and the sausage pizza, my favorite of the bunch. The menu said the sausage was supposed to pack heat, but there was not a lot of spice involved. Overall the pizza was more than satisfactory. The appetizers were on the small side with the highlight being the wings marinated in sweet tea which came with a nice dipping sauce. Overall a nice place to grab a pizza and beer.", "author": "Wyman K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "This is a really cook looking place but I cannot comprehend the good reviews for the pizza. Maybe they had an off day but that is not real pizza. The dough was much too thin so both pizzas we had were extremely soggy. A slice of pizza should not collapse when you pick it up. The flavors were okay but I would not come back here for food. For beer and atmosphere certainly. But there are much better places for food in the area.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Honestly this place is the coolest place in downtown Brooklyn. It was just what I was looking for! It is huge, and has great beers on tap and really delicious food. Iv came a couple times now and its been nothing but a great time! Even with a bunch of friends it's great, nothing like Alittle shuffle board competition. All the staff are good people and make you feel like they know you. Can't wait to come back! Good drinks, good food. See you soon circa!!", "author": "Sean I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "If you haven't visited and you enjoy good craft beer I highly recommend CIRCA.  I ordered a rotator IPA 7%, great customer service .  Happy hour is from 3-6 and the beer cost only $5, come on now how can you not resist.  I'm a hop head and this is easily one of the BEST IPA's I've ever had.  Cheers", "author": "S.E B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Other local craft breweries best take note, Circa hasn't missed a step. Beers ( shared 6 in total ) all crisp, clean, and true to style. Nitro stout was my personal favorite. Beyond the beer .... the space is massive. Well laid out with ample bar seating, small tables, booths, large tables, outside tables, and stool seating along every edge for whatever your party size or preference may be.  And then there's the BAR .... the most beautiful craftsmanship!! Adequate food menu to accompany your beverage. I'm not a cocktail girl but I'm sure they are equally well thought out. Staff were all friendly (Angela at the bar) and well prepared for a real opening.  No doubt in my mind they're here to stay.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-06", "description": "Miserable service. It took 15 mins for a waitress to come over to our table, and after we ordered beers and an appetizer, I had to wave her down 15 minutes later for our dinner order. The restaurant is set up for bad service: The main dining area is slightly secluded from the rest of the restaurant/bar, and the waitstaff just walk right past it. The pizza was pretty good.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "I wanted to like this place more, but I just left thinking... \"meh, glad I checked it out but I don't think I'll be back.\" It was tough. Really. Pizza and beer is usually my kryptonite, especially when the menu (and interior) look as cool as they do at Circa, toss in the in-house brews and this shoulda been a surefire win for me.\n\nIt started to go downhill when our waitress asked for our order almost immediately upon sitting down (still wrestling with our jackets at this point). I wish I knew exactly what I wanted before arriving because we didn't end up seeing a server again for about 20 minutes, at which point we grabbed whoever we could (a manager) and promptly placed our drink and food orders. Thankfully, food and beverages came out quick because we were pretty hungry by that point.\n\nOur party ordered the choke, salumi, and 2 cows pizzas along with the big chopped salad. Overall, everything was good, but not great. I liked the choke, but the other two were just okay (salumi was a little lacking in the salumi department, and 2 cows just didn't stand out). Crusts also weren't as crisp as I'd hoped. \n\nIn the beers department, it was fun trying their assortment of homebrewed suds. I did the four beer sampler, and the Rotator IPA and Gose were definitely best of the bunch.", "author": "Harry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Where to start! First off I would like to thank Yelp for even allowing me to find this place. Otherwise, don't think I would've ever found it. This place has been open for about a month now and it's on the rise! \n\nAfter being graciously welcomed by the host, we were seated at the bar (incredible comfy leather bar seat). We took in the elegant aesthetic of the place: brewer drums , massive storage kegs, taps, and growlers galore... wood grain finishes on the bar. Overall a really unique place. \n\nAs we browsed the menu we were greeted by our lovely bartender and ordered 2 unique flights of Circa-brewed beer. We tried them all. \n\nAfter the flights arrived, Danny, the head brewmaster popped out from behind the countless barrels, drums, and whirlpools to come introduce himself. This man was beyond friendly. He was informative, passionate, humble, and downright funny. Yo say we enjoyed learning from him is an understatement. He learned about the delicacy of his craft, the importance of freshness, and the joy that Circa gives him.\n\nAt the end of the experience: 1) I love supporting local places with passionate staff and founders 2) I'll pay up for an experience 3) I will come back again, very very thirsty for more. \n\nGood on you guys. CHEERS!", "author": "Parker R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "Always like the beers and food but terrible recent experience. The server forgot an order. We asked about the order after waiting a while, he won't admit the the order was forgotten and says it is coming.\n\nWe then wait an hour for the order and it never comes. Asks again and the server gave some excuse about the size of their oven. Well sure, maybe the oven has a size limit, but you should always expedite an order you forgot instead of keep serving the tables around us who came much later than we did. \n\nI don't want to come back again. Absolutely terrible experience.", "author": "David Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Great brews and atmosphere, but 2 pizza pies and french fries took over an hour to arrive. I'm sorry but that's not acceptable for Pizza to be made. I'm a life long New Yorker and the pizza left some more to be desired for the heafty prize tag and small serving. Ive had better brick oven pizzas from small mom and pop shops. Pizza was good but not great. 2 pies, fries, 2 beers and a cocktail $90. I'm giving 4 stars for the great brew and atmosphere and exceptional service. Minus 1 star for wait time.", "author": "Ritchie C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}