{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "I just love circa brewing. Came on a Tuesday after work with a friend that hasn't been there before. She was impressed with the place and I was happy because I kept bragging about it. \n\nDecor and ambience\nThose big barrels of beer never stop to impressing me. Love the booths, high stools and the long tables. The open kitchen give that level of transparency where you just know the food must be good. \n\nDrinks\nLast time I was here my friend ordered a flight of beer and I always wanted to do that. This was the grand opportunity. I got the Keller Kolsch, Pilsner, Blueberry and the lovelythebeer. They were all good but  the Kolsch was my ultimate favorite. It was soo good. Refreshing and crisp. The blueberry was my least favorite. \n\nFood\nLove that they update their menu once in a while so there are new things to try everytime. This time we got the Boy's got heat and Shroom Pizzas and they didn't disappoint. They were fresh and delicious. The boy's got heat has a really nice kick without being overly spicy. I really loved it. The shroom had different kind of mushrooms. It was earthy and and the egg added creaminess. \nBrick oven chichen wings were really good but the sauce it came with was finger licking good. \nI don't have words to describe how good the burrata and prosciutto was. It was so good I had to order seconds. \n\nService was amazing as always. Our waitress was so sweet and attentive. She suggested we saved some of the burrata for our pizza. To eat it with the crush and she was abosultely correct. Thanks for the tip! Now I have to do that every time. \n\nI can't  wait to come back on a weekend for brunch.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "Industrial and rustic... yet polished? Circa Brewing is the hipster manifestation of everything the media ever promised you about Brooklyn, with a little 9-5 nod to all of its clean cut customers who work in downtown Brooklyn and indulge in pizza and maybe a little too much alcohol after work...\n\nConveniently located near Jay St - Metrotech, Circa Brewing truly offers the best of what Brooklyn has to offer when it comes to pizza and drinks of a boozy nature, whether you're craving a beer brewed in-house (decor +1, drafts +1) or a cocktail. Bear in mind that this is a pretty hip place in Brooklyn, so cocktails will be $12-14 a pop, and yes, if it's Friday night and you've had an especially stressful week at work, they WILL add up. (For those gin fans out there, opt for the Spiced Pear Fizz and not the Root of the Problem. The latter was far too earthy-tasting for me.) \n\nWith gargantuan pizzas hovering around the $20 pricepoint, Circa Brewing is truly the place to treat yourself. To avoid too much sticker shock, talk yourself out of eating the entire pizza and save some slices for lunch the next day, though I'll admit that this plan quickly fell apart as soon as I realized how delicious The Choke was. I was slightly forced into ordering it as it's one of the few veggie pizzas on the menu (even as a staunch blue cheese naysayer), but excuse me if part of me will always demand that my pizzas come with sweet drop peppers from now on.\n\nAnd even though you'll dread looking at the bill at the end of your meal, take the extra minute to carefully review the items on your receipt. For some reason, they were unable to make the original pizza I ordered and the server forgot to remove it from my bill after I changed my pizza order. Had I not realized, I would have been out an extra $20 for a pizza I didn't even eat.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-22", "description": "Katie the bartender was fire. However one bartender with gages in her ears looked at me and my Hispanic friend and completely decided to not deliver on my order! She proceeded to give \"white people shots (for free)\" and me and my friend got nothing. Our tab was 160 and we tipped 40 percent and no return. \n\nNot a place to go if you're of any ethnic background. Gentrification on 100 here for sure", "author": "Davey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-13", "description": "Came here for brunch on a sunny Sunday around noon.  When we initially walked in the place was on the quiet side but filled up as the afternoon progressed.  We are not beer connoisseurs but the waitress kindly made recommendations based on our taste for other drinks and she was spot on!  We started out with the Shaksbury Rose which was really great and something I look forward to buying as well as the Lovelythebeer Strawberry Sour which was also awesome!  To eat we had the gem lettuce salad, quiche, and burger.  The salad was very fresh and had a great dressing! The quiche was surprisingly light, which I appreciated since I usually steer clear of quiches because they tend to be heavy.  We topped off the meal with the flourless chocolate cake a la mode.  \n\nOverall, customer service was great and the space is really nice!  I also really appreciated how knowledgeable the staff was about their beverage offerings.", "author": "Yesenia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "I was so impressed with Circa\n\nThere was an elite event here, which I sadly missed (damn grad school, you'd better be worth it). Needless to say, when my friends suggested grabbing brunch here, I was all in, as I had heard great things. It did NOT disappoint. First of all, the feel this place puts out is fantastic. I love all the wood, the size, and location of the bar, the open-ish kitchen, and that huge fan. It only got better when our amazingly cool server came by. She explained all the beers they had running, and what the boozy brunch includes (two hours aycd tap beer, and a few canned ciders). Then she left us to it, not bugging for time or orders, just asking if we wanted more beer. Pretty much a dream brunch if you ask me, laid back, friendly, and no huge rush to get in and get out. \n\nWhen we did put in food, I was told to get a pizza, as they are amazing, but didn't listen and went for the burger instead. Rookie move. It's not that the burger is bad (not mind-blowing, but not bad), its that the pizza is that good. Seriously, the breakfast pie was awesome, thankfully my fiancee (who is much smarter than I) got it, so I could try it. \n\nCome here for brunch, bring your friends who have babies, and just chill for a few hours with the cool folks who run this place - you won't be disappointed.", "author": "Chuck C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-25", "description": "Never before have I started drinking a beer or tasted a first fry and said \"I don't think I want any more of this\" -- yet here I am. My peach IPA tasted neither like peach nor an IPA. Rosemary fries were overdone, thin, under-seasoned, and overpriced. The front (hipster brewery) and back (diner meets hardware store?) seem mismatched. The place is huge, which is a pro, and overall decorated nicely. Thought I'd like this a lot better as I walked in, but between 2 and 3 stars for this place and confused by the positive reviews.", "author": "Rianna R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Love Circa Brewery and have been here a couple of times so far. This is probably one of the fanciest set ups I've ever seen for a brewery space. You have some kind of urban industrial chandelier, steampunk fancy shine going on with huge ceilings and just an enormous open space. The service I've had every time has also been super attentive. \n\nI'm going to jump to the chase. Drinks: I haven't explored much on their cocktails but can say I've tried several of their drafts at various points in different seasons. Right now they have both a Cadbury's Porter and a Pina Colada Porter that speak to my heart. Sweet, but not insanely so, with a slight bitterness. Belgian beers, Irish stout, their berry berliner weisse, goses, saisons, kolsch's. They've mixed up the menu here and there over time and there are now so many new brews being made it's hard to keep track of but I'm usually fairly impressed. You can do individual tasting pours or full pours or opt for a flight which I like because then you get a nice variety of everything. Most of everything is accurately priced. Drafts are $7-8 and tastings are $4. \n\nI've tried some of their food at both a Yelp event and on my own for their brunch. They do a bottomless deal for $25 as well! Their pizzas are pretty great but I think I'm more of a fan of their dinner time pizzas. I still really enjoyed the Lox pizza (super fresh salmon) and the eggs benedict pizzas but I'm going to say this lovingly - more cheese is always a good thing. Also thought the benedict pizza had a whole poached egg on it or whole eggs and it was just hollandaise and maybe scrambled egg cooked into the pizza. Pro tip that I should have gone with my gut and done this: Order an additional burrata cheese ball thrown onto said pizza. \n\nDo order their steak and eggs. The steak is insanely good quality and cooked perfectly and comes with a decadent cheesy gruyere hash brown thing. Do order their burger - made with quality ground chuck meat. This sucker was dripping and definitely my favorite thing I've tried food wise here. Their dinner pizzas are impossible to mess up. The boys got heat, salumi, and hawaiian pizzas I remember being really really good. They're shareable and decently sized but I would say if you are starving you may want to order two pizzas between two people. Also, the flourless chocolate cake is sinful. Everyone is pretty chill here. Not too many hipsters. More like middle aged hipsters and some families with babies. I definitely look forward to more Circa brewery time as its in a convenient location half-way between my work and getting home.", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "Pizza, beer brewed in house, a spacious aesthetic with lots of tables (endless, honestly), and nice staff. This place has it all.\n\nI've been here on a few occasions and have gotten pizza every time, along with a variety of beers that they've brewed right in the restaurant. My latest favorite was a matcha IPA. Not too matcha flavored and not bitter, both surprising in the best way.\n\nThe service has been good every time, and the waiters check on you often to make sure you don't need anything else. Plus, they don't rush you out, which I appreciate.\n\nThis is a very laid back spot to hang out with a couple friends or a large group, and even a date night (especially if you sit by the entrance -- it's cozy and a bit quieter!).\n\nGreat addition to downtown Brooklyn.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Pretty surprised with the size of Circa. The super cute entry way has covered outdoor seating, not something you see much in the Fulton, BK area.  First things I noticed were the spaciousness, high ceilings and literal brewery behind the bar. It was beautiful. There's a sense of minimalistic and functional use of furniture and decor. There were barrels with table tops as a seating option up front by the bar, I'll sit there next time, for sure. \n\nReviewing the menu took some time because really everything on the menu sounded like it deserved to be picked! Luckily Alex (waitress) was ever so kind and helpful to recommend her topic picks, which by the way I ordered exactly what she suggested and I was stoked it was just as good as she described. She gave us a couple option and flavor descriptions along with great drink pairings. She was awesome, honestly. We ordered the Burrata \u0026 Prosciutto, 62' Hawaii (black forest ham, charred pineapple, mozzarella, aged provolone, black salt) and Aubergine (roasted eggplant, confit tomato \u0026 garlic, green onion, fresno pepper, shaved root veggies) along with cranberry margheritas. I've never had a cran margherita before, it was as refreshing the sun shining after a light spring rain shower. Kudos to the bartender (whom I didn't catch his name). \n\nThe 62' Hawaii pizza didn't have sauce, that's a first for me. Great choice! The melted cheese was creamy, soft and oozing with flavor from the charred pineapples and prosciutto. Talk about finger licking good. I could have kept eating BUT I thought why not have this flavor explosion again for lunch the next day and saved some. LOL! The staff was super attentive, but not overbearing, fun friendly, and helpful.\n\nOh for the trivia lovers out there, this is the place.  The have trivia on Mondays, I think (don't quote me, call and ask). I'll definitely be back to try more of their pizzas and you should too!", "author": "Yani O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-13", "description": "Very spacey modern-looking brewery with plenty of choices that should satisfy even the pickiest beer critic. \n\nTry to sit at the bar, which has super comfortable seats. \n\nBeer flights (4 beers) go for $16 ave are well worth the price. \n\nWe also got their flourless chocolate cake, but were turned off by its microscopic size: for $8 you'd expect something bigger than a dessert of the size of a small plum... it felt like a scam. \n\nOverall, go for the beer, but forget about the food.", "author": "Giacomo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "If you're craving beer and pizza, Circa Brewing is the place to go. It is located in downtown Brooklyn near Brooklyn bridge, dumbo, and Brooklyn bridge park, great neighborhood. I got the Hawaiian pizza, to my surprise, it did not have tomato sauce but was still amazing. \nSince Circa brews their own beers, we had to try it. We got the Match T-IPA and the Belgium Dubbel. Both were refreshing and goes really well with the pizza. If you go early (3PM-6PM) you can catch their Happy Hour deal: $5 drafts, $6 wells and $7 glass wines. \n\nThe interior of the restaurant is also top-notch. You can tell they pay close attention to detail. From the wooden barrels outside to the large brewery machines to the large body mirrors in the bathroom, Circa Brewing did not disappoint.", "author": "Ying L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "********UPDATE*********\n\nI came back here with a friend to sit down for a proper dinner, and they definitely redeemed themselves.  \n\nTo start, our server was fantastic and helped us make a choice from the wide range of beer selections.  \n\nI love that they put a bottle of olive oil with a hot pepper in it on each table!  For starters, we ordered the burrata and prosciutto, which was delish.  And the little gem salad, some greens to make us feel better about ourselves - delicious.\n\nThen, we ordered two pizzas: \n- The Velvet Underground, more burrata, loved it\n- The Shroom - My favorite - could eat this every day.\n\nDefinitely a great experience this time.  Will be back for sure.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-13", "description": "We all know how much I love brunch and how much I love pizza so when boozy brunch was proposed at Circa brewing with the group, I was pretty much sold. You don't hear about many boozy brunches with beer and cider so it made the experience all the more unique. We sat down at a nice round table and were introduced to the menu. We had the whole beer list to pick from and the top three cider choices (all from Ninepin, a cider place in albany that I recently had visited!). I got the rose to start then followed it up with the original (which I stuck with for a while). I was able to sip on all the different beers that Chuck ordered and I loved them all too. \n\nFrom the second I walked in, all I could smell was delicious pizza carbs. I knew that I wanted, nay--needed, a pizza for my meal. It is what they do! I was torn between the bacon and eggs pizza and the boys got heat. I went for the breakfast pie and really enjoyed it! They even have a little bottle of infused chili oil on the table and I dumped some of that on to add heat. My friends got a few other pizzas and all of them were delicious (slice swap ftw). \n\nI definitely plan on coming back here. The food was great and the beers were all so flavorful. It was such a relaxing brunch that we got out and decided to just take a nice long walk (to go drink a bit more).", "author": "Erin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-26", "description": "Drinks: Large selection of beers on draft and made in-house! I tried a few including the Matcha TIPA and a blueberry flavored beer, though the Matcha was my favorite which was refreshing and smooth. They definitely have very unique and creative flavors for those beer fanatics! There are other drinks options including wines and cocktails, but the beer is so good why choose otherwise? They also have weekday happy hour $5 draft specials (M-F 3-6pm) and brunch specials including a bottomless drinks option for $25 weekends from 11am-4pm.\n\nFood: I only tried a few items including their pizza and fries! They have a bomb burrata pizza available for brunch, but all their pizza are coal oven cooked and personal sized, why only order one? If pizza is not your thing, they have several other options including chicken and waffles and tons more!\n\nVibe: Large and spacious with a brewery feel to it. Very casual spot which is perfect to hang out with friends after work or during weekend brunch. Plenty of different seating arrangement available including bar side or spacious booths. It can also be a great date spot if you are in the Downtown Brooklyn area!\n\nService: Great attentive waitstaff who were always available whenever we needed anything!", "author": "Leng Leng Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "My boyfriend and I were searching for a cool spot to visit as we were in Brooklyn for the night. Thankfully, Circa brewing popped up and noticed that they were highly rated so we chose to visit there. We were impressed when we first walked in and loved their decor. We didn't make a reservation and was seated pretty quickly as it wasn't overly busy. We sat down and was greeted by our sweet waitress Rachel. She gave us a few minutes to look over the menu and returned to get our orders. \n\nWe started the evening with two drinks which were, \"Doctor's orders\", and their signature Rotator IPA. My boyfriend loved the doctor's orders which had glenlivert founders, lemon, ginger honey syrup, and kings ginger. I had a sip of his cocktail and enjoyed it too especially since I'm a huge ginger lover. As far as for me, I had their rotators ipa  which was a hazy New England IPA that was dry hopped with centennial. I love IPA's and found this beer to be perfect. \n\nFor our appetizers, we had the burrata and prosciutto dish as well as brick oven wings. The burrata was rich and creamy; the prosciutto had a nice saltiness to it, the fresh fig was enjoyable, and the balsamic reduction added a nice touch. The brick oven wings had a nice charred appearance and was tender too. The piri piri sauce was delicious and we even found ourselves ordering more as it was so tasty. \n\nWe ordered three entrees which were the boys got heat pie, Yukon gold potato gnocchi, and wild boar bucatini. The boys got heat pie had spicy Italian sausage, tomato, roasted pepper, fontina, mozzarella, and parmigiana. This pie had a nice balanced with sweet, savory, and even fatty notes to it. The gnocchi was my favorite dish for the night and highly recommend you all to try it! It has this tasty sage and brown butter sauce that I couldn't stop eating. It was honestly too perfect to dish and the presentation was impressive too. The last dish we had was the wild boar bucatini which we liked as well. It was a long hollow pasta topped with bolognese sauce, fresh ricotta, and shaved parmigiana. \n\nAlong with our meals, we ordered a few more cocktails which were the jalapeño hearts and figonacci sequence. The jalapeño hearts had Rangel jalapeño tequila, mango fruit purée (as they ran out of the passion fruit), and fresh lime. If you like spicy cocktails, this is the perfect drink for you and y boyfriend enjoyed it. I had the figonacci sequence that had snow leopard vodka, fresh fig, lemon, and vanilla thyme syrup. This drink was a little sweet and complex which I loved. After our cocktails, we ordered more beers and we couldn't decide so our waitress Rachel chose it for us. She had us try their Hefeweizen beer and the profile was fruity eaters with a pepper/banana nuance. It had a nice body and a nice little kick as we drank it. The second beer was the Helles lager (we both loved it) and that profile was more malt forward as well as refreshing. The last beer was Keller Kölsch which was clean, refreshing with biscuit malt notes, smooth, and perfect for our taste buds. \n\nEnough about the food, I need to express how great my waitress was! Rachel was so attentive, sweet, enthusiastic, and she had us cracking up. She offered us too notch customer service and if you ever dine at Circa, ask to have her as your waitress.", "author": "Vanessa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "We ventured out to Brooklyn for a brunch. I was excited about this spot, as it is a fully functioning brewery. We don't drink often, but we certainly enjoy drinking quality beer, wine, cocktail and everything else tasty! \n\nThe first glance at the entry way had that \"wow\" factor, with large, simple yet modern and cool light fixture with a fan, greeting the customers. From the entry way, you can see the big \u0026 shiny beer brewing equipment to the right.  \n\nThey brew all the draft beers here, so we wanted to try them instead of cocktails. They had an option for a flight of beers, so we decided to do that. We chose Pilsner, Belgian Golden Strong, APA, and Porter. They were all very tasty, high quality and flavorful. We enjoyed all of these beers. Great job!\n\nFor food, we got Boys Got Heat Pizza, Chicken \u0026 Waffle, and Rosemary Fries. I must say, the pizza was much bigger than I expected, which was great. I don't always eat pizza crust, but their crust was tasty! It was charred just a little to add the great smoky flavor. It was not so spicy, but had a nice kick to it. Chicken \u0026 Waffle was huge too, and the chicken was super crispy on the outside, which gave that great \"crunch!\" noise. And the fries...oh the fries...it was freakin' amazing! We were completely full and happy, we took some food home with us. \n\nWe had a really pleasant brunch here, everything was delicious, and I thought it was all very affordable too, considering the portion and quality. Our server was lovely and friendly, polite and helpful with recommendation. What a great spot to get some food and booze! And it is not a typical restaurant, but a brewery! I love to go back to try more of their delicious food and beer offerings!", "author": "June S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "Stopped in for a beer while exploring Brooklyn. This place is huge! Great interior design with lots of seating options. The bar has comfy barstools and hooks to hang bags, coats, etc (always a nice touch). Restrooms are spacious with full length mirrors. We came in right at opening on a Friday, so employees were preoccupied getting the place set up for the lunch crowd. Beer was pretty good, and clean (had the Matcha T-IPA and the Barleywine). Didn't try their food, but the food on the menu sounded great. Vegetarian options were available. If we're ever back in the area, I would definitely come back.", "author": "Laura S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-03", "description": "Circa Brewing is rally great place for huge selection of beers. My friends and I are had a great time at Circa brewing. I didn't taste different kind of beers but it was really good the beer that I had. \n\nThe environment of the place was great very big and the staffs are so kind enough. If you are looking for a chill this is the perfect place. I had really great Margarita pizzas. It was so good. It should be the first thing you should order because this place looks very busy and takes time to get some food. The pizzas which they makes it's brick oven cooked pizza \n\nComing to this place is so easy. Subway stop just a block away I cant wait tog back there and have mire pizza and beers.\n\nThank you Circa.", "author": "Alp O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-18", "description": "Let's just sit at the bar for two either for first date or hanging out. That should be enough. \n\nThis place has an extended list of beer include some german and local brewery. I normally stay with German or belgium. Price is pretty standard $7 to $8 per glass and I suggest pilsner since it comes in a tall glass. Beside that, they have cocktail to wine therefore you are good for everyone. \n\nFood needs a bit improvement in many side. Let start with the fries. They are super tiny and eating from the cup is super annoying. Just lay it all out on the plate and use bigger fries or sweet potatoes. I was a bit disappointed. Going on to their burger, this is just a mess. How did a burger turn into a burger salad. It's impossible to take a bite and have your burger still looks like burger. The burger isn't that great either as the bread they use end up bring saggy on arrival. Pizza is so so for the price. Beside being fresh and warm, I prefer it to be a bit bigger and crunchier base. \n\nService is on point for the bar. It wasn't super busy thou.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-15", "description": "As deceiving as the name of this place sounds, it is more than just a place to have drinks. I came here for lunch to check out what they had to offer besides drinks. Up until 3PM they serve lunch. 3-5PM they serve only pizza and 5PM and on it's the dinner menu.\n\nI got their bolognese calzone and I'm pretty satisfy with it. It's not worth the price that they're asking for in my opinion, but still was good. I also got a Chai Stout from their beer menu and it taste like what you would imagine, a rich dark beer flavor with a hint of chai. This is definitely known for their beer on draft and I bet happy hour is popping.", "author": "Jacky C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}