{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "I came into Circa coincidentally on their second day of being open and first lunch service. We spotted the space after enjoying some soup dumplings across the street which I also highly recommend. Our visit was based on coming to Brooklyn for beer mainly to visit Other Half and Interboro so it was pure luck to also try something so new. I sat at the bar and enjoyed a NE IPA while chatting with new employees and the owner. It appears they do not plan to offer bottling or canning anytime soon. The most striking feature is how beautiful the space is. The entrance is expansive and wide open. Near the back they have some tables, a shuffleboard and open kitchen with wood burning grill. Similar to most breweries these days they are continuing in my opinion the \"warehouse feel\" but it's done here a little more refined and hopefully trending in a more comfortable atmosphere vs the stark, cold and minimalist fashion that is common. The bar is long, winding and encompasses the brewing area complete with fermentation and bright tanks. It was exciting to try a beer straight from the bright tank and the ipa was on par with some of the better ones I have enjoyed. In a time where breweries are a dime a dozen it's nice to see a spot that can stand out and is a blast to hang out in while also taking pride in their craft.", "author": "Ben T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-12", "description": "Awesome location that I assume had just opened. Tons of staff members who all looked very confused and frazzled. Ordered a pizza - it never came within an hour time span and I had to leave for the airport. The manager did come out and apologize and told me to ask for her next time I was in town so she could comp my meal. I cannot rate the food or drink because I didn't have either...", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Excellent design--open and airy and outfitted with a very cool bar in the center of the room that almost mimics a bowling alley lane. Great selection of beers, a dozen or so on tap, and nice diversity (i.e. not all IPAs and super hoppy beers). My husband and I had two rounds--the gose, Berliner weisse, nitro stout and saison--and I would order of those any a second time. Best of all, the service was friendly, something you don't find everywhere in New York unfortunately. All in all, I would highly recommend Circa to tourists and beer lovers alike!", "author": "Kristin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Hosted my husband's birthday here and it could not have been better. The food is excellent here. The salads are so fresh and the pizza has become one of our top favorites here in the city (which says a lot as NYC has numerous famous pizza places). The space is great for large groups and is child friendly- such a plus for the neighborhood.", "author": "Traci O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Tasty beers. Friendly staff. Sleek atmosphere. Best bar stools ever. Drink the Berliner Weisse.", "author": "Monica B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "Atmosphere was  cozy and inviting. Bar stools are like chairs in your living room, \nvery comfortable.  Margarita pizza was \nabove average for a gastro pub.\nMac and cheese was served all dente, baby shells with a hint of truffle oil then baked with breadcrumbs. Steamed clams were average. I thought portion size of about 10 little necks was kind \nof small for 14 dollars.  I did like the place.  I would return , service was great.", "author": "Kenny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "This place was very good! Make a reservation however since it was pretty packed!! My husband and I got the ricotta and dough app- amazing! I wish they gave you more dough however. We also shared the Hawaiian pizza. On the beer end I had the amber- very good and my husband also had the amber and the dipa. Def coming back when they will get in their flight glasses!!", "author": "Tory K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Went to Circa Saturday night with the girlfriend. This place is the bomb.  Although only open 3 weeks, Circa has everything up and running to perfection.  We shared the crispy grains, outstanding, and a excellent steak tartare.  For mains we split a margarita pie \u0026 the pappardelle with peas, both rocked.  They also brew their own beer. I had a saison \u0026 a double ipa.  I enjoyed both.  Very good service and a cool vibe.  We can't wait to  come back and try more of the menu.", "author": "Lou P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "From the same owners of Putnam's over on Myrtle Ave in Clinton Hill/ Fort Greene, this place has a bit of a different vibe to it though. Hipper. Brighter. It's a \"new Brooklyn\" kind of establishment and definitely draws the kind of crowd one would expect for an ever-changing Downtown Brooklyn area. That information can be good or bad (take the good with the bad?) depending on your viewpoint but hopefully informative. The Boy's Got Heat pizza is pretty good and apparently a customer favorite according to an extremely nice and attentive manager. The big chopped salad was enough to split between two people and still have some left over. Decent selection of beer so far which I'm guessing will expand (and/ or revolve) over time. Rotator IPA is very hoppy \u0026 very fresh by the way. Good stuff. Overall Circa is a new, trendy spot that fits well into the new narrative that's being constructed for BK.", "author": "Tony B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Absolutely loved this place. The brewery itself is beautifully designed. Had the Margherita pizza, Spanish Red wine, and Amber Lager. Everything tasted great. Looking forward to trying their cocktails.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Very cool place. A great late night option in the downtown area. The open kitchen is super cool and the wood fired pizza was delicious. The mac and cheese was light and satisfying with a crunchy top that reminded me of my mom's home cooking.  The atmosphere is warm and chill. Log cabin meets spaceship vibe.", "author": "Caitlyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "Stopped in for a quick solo bite after a work conference at a nearby hotel and sat at the bar. Ordered a '62 Hawaii pizza, which had a very pleasing amount of saltiness and an enjoyably chewy crust. Partook of two of the IPAs available on tap. Staff was very friendly and attentive. Great music, from XTC to Talking Heads.", "author": "Joseph R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "This place only opened a few days ago, and I've already come twice! The beer selection is great, and the mixed drinks are wonderful. We have eaten three of the pizzas, the chicken, the steak tartare, two different salads, the ricotta dough puff, and the clams. EVERYTHING was delicious. The service is also fast, friendly and efficient. I couldn't be more pleased.", "author": "Susan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-20", "description": "I visited this place yesterday, the cocktail was good. The pizza was too salty​!!!!!!!! The atmosphere​ is great.I would visit again for the cocktail​ but not the foods", "author": "Kimoko S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "This place was terrible. Way overpriced! Beer served in champagne flutes and pizza was undercooked. Never again!", "author": "Christopher K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "This was such a fun spot! We had a flight and all of the beers were excellent. The atmosphere was lively and fun and the bartender was friendly and helpful! We would definitely go back!", "author": "Carli B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-04", "description": "Don't go if you're looking for good beer.  Very disappointed in their selection - the menu seems to always list beers that aren't available. We tried 6 of their beers and they were all disappointing. Go to Threes Brewing or Other Half instead if you want good beer.", "author": "Kathryn M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-30", "description": "Sort of a weird place.  (Disclaimer: I'm still recovering from the loss of Bierkraft two years ago).  The bartender was unfriendly, and quick to point out that they were out of three of the most popular beer styles.  Odd, at best.  The carbonation system for the taps was pretty bad (too much foam, resulting in very messy pours) -- which is inexcusable for a brewery.  The sizing of the glasses was totally arbitrary and not communicated beforehand.  All in all, better than nothing, but I can't say I will be going back any time soon.", "author": "Evo T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "Went and had dinner at the bar by myself on a business trip. One of the beers on tap was pouring poorly so I ordered a different one. Asked the bartender if I could add something to one of their pizzas and was told the kitchen gets \"testy\" when people ask for substitutions, but he would ask. I said that was alright I would order one straight off the menu. Pizza was decent, but the crust at the center of the pizza wasn't fully cooked so it was floppy, and not in a good way. Pilsner I had was good. Giardinara app was okay.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Yum!  Yum! We are pizza lovers and had the '62 Hawaii and the Boy's Got Heat and Big Chopped Salad were fantastic!  Just the right sweet and heat.   Couldn't believe all the beers they make in house,  we tried the Belgian Wit looking forward to working our way thru the list.   Great addition to the neighborhood, a must try!!!", "author": "Allyson K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}