{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Circa Brewing is a beer garden and pizza restaurant wrapped all into one, and it's conveniently located in downtown Brooklyn. So, if you live in the BK, you have plenty of train options for getting to this charm of a spot. Read below for some of the highlights.\n\nThe Drinks: Circa brews some of their own beers, and all we tried were spot on. You can't really go wrong with any of them. If beer is not your thing, they feature a full bar with just about anything you would like. \n\nThe Food: We tried several of the pizzas and the calzone, and they were all pretty good. The \"Boys Got Heat\" pizza was spicy and delicious (it contains spicy Italian sausage, which helps make it spicy). The The Big Calzone features wild boar, pizza sauce, and ricotta cheese (be sure to ask for a side of pizza sauce or marinara for dipping). The calzone was tasty but ended up being a bit small for sharing. My dining party also tried the wings before we got there and said they were tasty but small quantity-wise.\n\nService-wise, all Circa staff seemed to be fast on their feet and were quick to respond as needed (e.g., the bartender made her way quickly over to us when we first arrived and were ordering drinks at the bar; the waiter came quickly to our table and came by often). Note that, even though the waiter was fast, he could have used just a burst of personality.\n\nThe interior of Circa is what you expect--more industrial with some regular tables and some larger picnic-style tables... and there is large beer brewing machinery all around. One thing that I thought was awesome was that each table had a vial of spiced olive oil for dousing on top of pizzas and other food. It was super tasty, and I splashed it on everything!", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Have been here twice since moving to the neighborhood a few weeks ago and have been impressed with the food, drinks, and service. The pizzas are really, really good, and you can build your own and/or make modifications to existing pizzas on the menu. They're big enough to share but you won't want to. \n\nThere is a big screen that is viewable from quite a wide range of spots in the venue, so you don't have to sit at the bar to watch the game.", "author": "Maureen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-12", "description": "I've been here about 3 or 4 times now and always had a great time. I'm not sure what Circa is like if you go with like 1 or 2 people though as each time that I've been here has been with a group of friends - this is definitely a spot that knows how to cater to groups though. Service has always been quick, friendly and efficient.\n\nThe food here is pretty solid. Their mac \u0026 cheese is really more like pasta in a light cheese sauce, it's delish though and still hits the spot. The pizzas here are solid and their rosemary fries are pretty spectacular.\n\nThe beer selection here is really great for a craft beer novice or someone like me who is more of a beer aficionado. I love that they usually have a wide range of beers at one given time, no matter the season. Last time I went I enjoyed their Coconut Porter the most but they also had a fantastic Scotch Ale and a Hibiscus beer that was really nice.\n\nThe location here is also really great because it's right by the trains, lol. If you haven't been here yet definitely check it out, they're a gem.", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Here's a list of things that I really like:\n\nExcellent pizza.\nFantastic beer (freshly brewed in house). \nQuality cocktails.\nPlenty of seating.\nBeautiful rooms.\nCool, competent staff.\nClose proximity to my home.\n\nGenerally speaking, I'm lucky to get one or two of these things in the same establishment. Three if it's a serious gem. Circa has them ALL.\n\nSeriously, I love that I can come in on a weeknight and get a great cocktail and the salumi pie (my favorite). And I can ALSO come in with five friends and a stupid baby* on the weekend and actually get a table for brunch where I can down a burger and avocado toast and fried chicken and waffles and chase all that with oatmeal stouts until I really shouldn't be holding a baby any more. Thanks, Circa. \n\nIf there are any downsides, it's that it can get a little pricier than I necessarily want a meal to be (I suppose I could drink less, but mind your own business). For example, the burger's great (as are the fries that come with it), but $21 is a little steep. \n\nThat said, good things are worth paying for. If you haven't been to Circa, it's worth it. \n_____________\n\n*We don't know that she's stupid yet, but the fact that I sometimes need to stand up and rock her during a whole meal is stupid. I do love how big Circa is, and how accommodating the staff is with the stupidity though.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-09", "description": "A fun place to meet for drinks! With so many beers it's a beer drinkers haven. And for the non-Beer drinkers there is a full bar with lots of bourbon, rye , whiskey \u0026tequila. My one complaint is the amount of ice vs actual cocktail in the glass. Sadly there was more ice than actual drink. That is something the bartender needs to work on! Wine was also a little chincy on the\nPour! I was just a little annoyed when you pay for a drink and it's most ice. \nThere are some great pizzas and cheese and meat boards. The food is good! Service is also very friendly and fun.", "author": "Neil G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-24", "description": "I've been wanting to try this place for a while now.  Since I don't drink beer as much any more, it was somewhat of a let down and a schlep to get to and find.  It's probably closer to Boro Hall and the courthouses than  it is to DeKalb market, so if you're over that way, it's worth a pop in.  I didn't try any food.  The stout was nice and fresh.  They also offer mixed drinks.  I'll head back sometime to try the pizza.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-22", "description": "Really cool spot right by the Jay St-Metro Tech train station. We were looking for a place with drinks as well as food around 4pm on a Saturday, so decided to check it out. They have a full alcohol list but we wanted to try their draft beers since they brew their own. I got the oatmeal stout and fiance got the coconut porter; both tasted very fresh and rich in flavor. We tried the shroom pizza which was delicious and smelled amazing imo, though he wasn't too impressed with it as he didn't really take to the egg on the pizza, but I thought that was fine. The crust is on the thin side. I thought the portion was just enough for two people to share. FYI from 4-5pm only pizza is available; before that you'd get the lunch menu and after the dinner menu, which have more food options.\nWould definitely come back for some pizza and beer!", "author": "Grace Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Came here for brunch and it was pretty darn amazing. Lit vibe and open space and high ceiling. A large selection of beer and cider. \n\nTried their Lox Pizza, Eggs Benedict Pizza, Chicken and Waffles and their Quiche.\n\nLOVE LOVE LOVED all the dishes but my favorites were Chicken and Waffles of course cause I LOVE FRIED CHICKEN! I was surprised at the Lox Pizza and wanted LOX more! haha get it?!", "author": "Linda C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "Would've sat outside but had to catch the cowboys game. A lot of seating inside with nice large TVs. Had the salumi pizza and it was amazing. I could've easily ate the pie myself. They were out of the appetizers i wanted which were the pretzels, wings and ribs so I'll definitely have to stop by for that and the burger. \n\nOverall cool place with good music.", "author": "Sheila R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "I am designating myself a sour beer connoisseur and I am declaring Circa to have the best sour beer selection in all of New York. You might think this is an exaggeration but I've come across my fair share of misses...until now. Their saisons are legit, not to mention I LOVE that they're served in tall wine glasses! The Coconut Porter tastes like a freaking coffee almond joy blend but stripped of all that candy goodness. The love of my life? The Berry Berry Sour. Gose brewed, pomegranate and blueberry notes, and just the perfect, tasteful level of sourness. \n\nAnother plus is their abundant food menu because I am not a bar beer drinker but a beer at home/beer with food drinker. Lots of breweries lack in the food department so to be able to quench my fried chicken thirst and thin crust pizza needs deserves some sort of recognition. The buttermilk fried chicken is juicy on the inside and crunchy on the outside. That spicy maple syrup drizzle? DROOLS. The Margherita pizza was bland but I thoroughly enjoyed the Salumi pizza because that mohawk honey is bomb.\n\nP.S. Someone told me the pizza man learned all the goodies from his time at Lucali's. Yep, Jay-Z \u0026 Beyonce's favorite pizza place. You can avoid the crowd AND the wait because you don't need to go to Lucali's in Carroll Garden anymore to get the same, highly demanded pizza! You're welcome.", "author": "Lisa Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "In a sea of niche breweries here in New York City Circa stands out among the towering buildings of downtown Brooklyn. I've been to Circa a few times and have always loved this brewery. Tonight was no exception. This brewery is well known for crafting beers outside of the norm, imperial stouts? Yes. IPA's? yes. Saison's? Yes! They make it all and depending on what's available and what they're in the mood for you will find a vast range of close to a dozen beers on tap. They also have a whiskey selection and cocktail list to rival most bars. \nWhen you first enter you see a sidewalk café (enclosed during the winter) so you can unwind with a drink in hand staring out into the urban jungle. Inside you are greeted with a  long winding bar to your right, some table tops for drinking and noshing on their delights, and further in a shuffleboard table to hone your craft with. They have a dining room for those looking to make it an official date, and a private event space towards the back open air kitchen.  The lighting and atmosphere is very chic and upscale, its easily a place you can hang with friends or bring a first date to. \nWe ordered a few items, fresh burrata with smoked prosciutto, delicious with a side of arugula. A delicious order of wings served with a spicy  dipping sauce. The calzone with mushrooms, a mushroom tagliatelle, and a fried chicken sandwich with fries. Everything was absolutely amazing, served fresh and hot. The chicken sandwich had an amazing crunch and was a new addition to the menu. Crisp pickles inside made it savory yet gave it that kick of acidity needed to cut the richness. The Mushroom Tagliatelle was another home run, such depth of flavors it had earthy notes and was complemented well with the Hallo Ich Bin Berliner Weisse beer. \nStaff was fantastic, accommodating and really looked after us despite it being extremely busy. The busboy came by multiple times, restocking silverware, removing finished dishes and replacing water. Our waitress was fantastic and made great suggestions. \nBeers were amazing and the drafts were some of the best I've had, saisons, stouts, and other varieties in between.  Their whiskey selection is even better. They make craft cocktails and I can attest to them being absolutely amazing. \nIf you're looking for a great place to have drinks and a good meal you've got to try this brewery. Seasonal changes in beers, varieties and the different menu options make this a place to constantly try.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Circa Brewing is Downtown Brooklyn's hidden gem, and thanks to Yelp I've found it! I don't even know where to begin because everything about this place is just fantastic.\n\nThey have a variety of beers on tap that are seasonal. So you may like a beer and come back a few weeks later for it, and it'll be gone. This happened to me! I started off with the blood orange gose on tap, since the berry berry sour was no longer offered. Then decided to do a flight to try some of the other options. I'd pass on the fruit wheat tap...not the best tasting, but everything else was delicious! \n\nFor food, we decided to go with two pizza options -- the Salumi and the Aubergine. The Salumi is more of a pepperoni pizza, whereas the Aubergine is a vegetarian pie, no cheese! This is great for vegetarian, lactose free, and vegan eaters. My friend couldn't eat cheese, so he very much enjoyed the Aubergine pie. For sides we opted for the onion rings and fries. The onion rings are literally out of this world, and it comes with a really nice dipping sauce too! \n\nOverall we had such a wonderful time here. The customer service was great -- a tad slow, but I think there was only one bartender manning the bar.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-16", "description": "Came back to Circa Brewing for lunch the second visit as a group...We ordered the shroom pizza and margherita pizza to share. Everyone loved the shroom pizza with the wild mushrooms - very tasty. This is the first time I have seen an egg on the pizza - interesting...\n\nFor sides: onion rings and french fries. both were good as well. \nService was good as well! Will have to come back again to try other items on the menu.. maybe for dinner...I'm still curious about that steak I saw on the grill the first time I was there.", "author": "Winny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "If you're looking for a chill place to hang, get a first class pizza, and drink some locally (in-house) brewed beer, this is your spot! For me that's one of the things that sets this place apart for its location, a legit brewery with both bar and restaurant in-house. The pizza is reallly good and on par with places that I consider the best in New York.\n\nWe came in on a busy Friday night, and the cool, collected staff were every bit of accommodating. We got a couple house-brewed pints of Pilsner. Crisp, refreshing, and the perfect drink for our pizzas. We also tasted a strong Belgian brew that kicked our socks off and would've been great if we weren't having such a heavy meal. Ordered the beet and sunchoke salad, with some incredible red mustards, tardivo (kinda similar to radicchio or endive but less bitter), puntarelle (big leafy greens kinda like bok choy but tastier), potatoes, and yellow beets. It was a hearty salad with a side of the most delectable crémeux (can it get any better than this cream sauce!?). \n\nPizzas - we had the margherita and velvet underground (without meat). They greatly complemented each other, the former being simple/juicy tomato sauce with basil; and the latter a bit more about the crisp and pesto flavor, offset by the burrata mozzarella (imagine a big ball of juicy mozzarella in the middle of the pizza). \n\nOur table was in view of the kitchen and you could tell the fine attention to detail that was going down. The staff was very attentive and easy to talk to, and I could recommend this spot for almost any time or occasion. It can be a little on the pricey side but find me a pizza spot like this that's not! Hope to come back sometime to see them brew in action on Saturday afternoons.", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "Huge space! I will need to keep this place in mind for the future for large parties. There is a side part of the restaurant where it would be easy to section off and have a party. It wouldn't be private but it's off to the side from the rest of the restaurant. They have a lot of draft beers which they brew in house. I was sad that it was winter but they only have one porter and one stout. The stout had star anise in it and I was worried it would taste too much like licorice. It didn't taste like licorice at all and was great. They have many brunch options but their pizzas were the best. I got the arugula and egg pizza which was absolutely delicious. It usually has ham in it but I don't like ham. I asked and they agreed to swap out the ham for another meat.", "author": "Cathy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Second time in here because I happen to be killing time in the neighborhood.  They have a spacious space (how you like them apples?), clean dining area and lavatories (always a plus).  Wonderful and attentive service by the likes of K.C. this afternoon.\n\nHave not had the \"luxury\" of trying their brick oven pizza-centric menu, hopefully soon though!  I absolutely love the comfortable bar seats, it is a rarity, my friend.  You'll see ;)  With such limited commercial space in NYC, being taken for granted, this place is a refreshing reminder that along with a great idea and considerable customer service...this is a run-on sentence.  My proud, college English professor, would be thoroughly shaking her finger at me.  Ahh memories.\n\nAnyway, what was I saying...\n\nSooooo, I was just kindly greeted by the owner, Gerri, who tells me, this space was empty before he acquired it.  They recently celebrated their one year anniversary a week ago!  He also owns Putnam's Pub and Cooker in Clinton Hill for seven years now.  \n\nI like it!  Must say, I like it!", "author": "Beenish H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "What's better than beer and pizza? Probably lots of things, but there's definitely something freeing about just saying f*** it, let's eat pizza and drink beer. Enter Circa. Decent beers, all made on premises as this is also a brewery, and tasty flavor combos in the pizza selection. Is it the best beer and pizza? No, but it's good, prices are reasonable and service is fast.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "This place is amazing! Sarah the manager taught us the process of making beer. We were served so many pizzas that my taste buds were drooling! \nThis little hideaway needs to be found.\nIt's huge with a shuffle board game, seats and counter space. Spacious space for gatherings, work meet ups and the bathrooms have 4 clean stalls! No need to wait on lines in there.\n\nWonderful friendly  staff that really serves with a smile. Thank you for the opportunity to dine on fresh oven baked pizza. Pesto with veggies to sausage. Something for everyone. I even ate yellow tomatoes that were delightful (i dislike tomatoes!) but these are delicious. HIGHLY RECOMMENDED", "author": "Correy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-18", "description": "4.5 stars\n\nPizza is delish!! We were gonna go to Juliana's but why bother waiting in a line? We made it to happy hour (M-F 3-6) and all drafts were only $5. \n\nWe ordered the Boys Got Heat and it was very yummy. The Salumi also looked amazing. \n\nOf all the beers, I loved the Saison. Probably one of the most balanced beers I've had in a while - flavorful but still light and approachable. We also tried the Matcha T-IPA (OK), Thyme Wheat (meh), Blueberry Berliner Weisse (eh), and Brut IPA (try it!!).\n\nFills up around 6 but definitely try to make happy hour. \n\nIn a city where waiting for pizza/good food is everyone's jam, maybe try finding your own version of the next big thing. There are no lines that way!", "author": "Annie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "I've been here a couple of times now. Ever since my best friend showed me and my friends this place, I fell in love. The first time I came here were for drinks--strictly just drinks. They had a good selection of beer and the waiter also informed me that they usually change their selection from time to time. I thought that was a super cool concept!\n\nOn my third time, I had dinner there--finally. I always saw people ordering food there and their pizza looked so amazing.. it was about time I tried it and oh man. I was so in love. I had the clam pizza and it was not super rich, it was at the right amount of creaminess that it didn't make me hate myself after eating it. I also really liked their fries.. their fries are so yummy mmm.\n\nAnother time that I came, was recently with some friends. We ordered a veggie pizza (I think), salumi (so so good), grilled broccoli and the fries again. We also got an extra dish that was also very yummy--can't exactly recall but I'll be sure to check and come back to update this. Everything was super enjoyable and it was such a great vibe for us to just chat. I had such a great night that night and I would highly recommend anyone to come here -- whether it is for dates, dinner with friends, or even dinner with family; very awesome place.\n\nLooking forward to come back very soon!", "author": "Suki W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}