{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "Great place for happy hour. They have a large selection of beers and the other spirits. I have also come here for brunch and the food is very good considering this is a brewery. The decor is very cool which makes for a great ambiance.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "The GM has priced this place completely wrong.  It comes off incredibly cheap and has all the markings of price gouging.  I'm using the $15 chopped salad as an example.  See the picture.  That salad has 3 bites taken out of it with barely a few pieces of chicken.  That's a joke.  I'm happy to pay for a $15 salad in a large bowl with multiple toppings .  You should be ashamed of yourselves.", "author": "Zibbie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Just eat there. I started with the dopplesticke beer...so good. Then I switch to a red with the clam down pie...holy shit this is hands down top three pizzas I've had, and I really love pizza.", "author": "Melissa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Great beer. Stopped in for the porter. Malty with some sweetness on the finish. It was perfect for a cold-ish day. Will definitely be back.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-13", "description": "With its warm lighting, high ceilings, and gleaming tanks of beer up front, Circa Brewing looked like it had the potential to be a promising addition to Downtown Brooklyn's nascent dining scene. We sincerely wanted to like it. Unfortunately, over the course of two visits, Circa managed to disappoint in almost every way. \n\nTo begin with, as a brew pub, you would expect a wide selection of fresh, creative and tasty beers. Instead, they offer only a modest rotation of insipid brews that cannot compete with widely available beers from national brewers such as Boston Brewery or Sierra Nevada, let alone the many excellent offerings from local brewers like Six Point, Kelso and Brooklyn Brewery. The drinks are also quite expensive, particularly considering the small pours. \n\nAs for the food, the two-patty cheeseburger ($21) was a greasy, gristly, unwieldy--yet surprisingly tasteless--mess, while the margherita pizza ($16) was soggy in the middle and charred at the edges, with a meager amount of sauce and supermarket-grade mozzarella on top. Only the crispy and salty fries provided any relief. \n\nThe service was friendly and well-meaning but incompetent, keeping us waiting an unreasonably long time for our drinks and messing up our few simple requests (such as no mayonnaise on the burger). On our most recent visit, entrees came out of the kitchen at random times, which meant that some members of our party were practically finished with their dishes while others were still waiting.\n\nThe next time we're in Downtown Brooklyn and looking for burgers and beer, we'll go down the street to Shake Shack and enjoy better beer, food, and service for a fraction of the price.", "author": "Mark V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "Hate to update to less stars but this place has gone significantly downhill each time i've come back. The service has totally tanked. We waited over 45 minutes tonight for entrees and didn't even get an apology things took so long. The food quality for the half chicken and clam pizza/fries was for sure not worth the wait. I wouldn't be back after our last experience unless I was sitting at the bar and just drinking with no food service.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "I'm not a beer drinker but I am a notorious bar patron. I was pleased with this bar experience which was once a baron location for socializing with spirits. The establishment is large with lots of space to either walk in and find a spot at the bar or grabbing a table. The pizza is made with fresh ingredients and the environment is relaxed. Nice place to kick back.", "author": "Mia K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "The service was HORRIBLE. I stopped by to drink a couple of ciders. After sitting at the bar for 8 mins I had to ASK for a menu, then I had to ASK for a cider. I then was not approached again for 25 minutes. WTH!?!?!  The place is less than half full. Not a good way to get first time customer to return. Sad. I was looking forward to a place with a large cider menu.", "author": "charlie z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "This place needs some time -- \n\nBeing new, I will echo other reviews and suggest that they perfect a few beers before being ambitions and offering 10+ beers. That being said, I did find the Amber Lager delicious, without feeling heavy. \n\nI also indulged and had a flight to check out the quality of their other beers. The pilzner was also tasty but a few others are missing the mark. They also offered some local wines which weren't too bad. \n\nAll in all -- I will definitely give them another shot as I am pleased to see this type of operation open in downtown Brooklyn. The crowd size was pretty decent especially considering labor day weekend.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "3.5 would be my actual rating, but I'll tarry on the lower end this time. Not the sort of place I would expect in this part of Brooklyn, so for a girl from Carolina where there's a new brewery popping up each month, it's a great addition not far from where I call my BK home. My partner made reservations for 8, and we almost didn't mention them but when we entered it was crowded around the bar so we were glad we had them. We landed a sweet booth by the TV so again, reservations were worth it. My favorite thing about trying a new brewery is getting a flight to see what they're about. And since I saw previous Yelp reviews of flights was super excited. \n\nBuuuut quickly was this killed when I asked our server and his reply was \"oh we usually do flights but not tonight.\" And that was it. No explanation... so I just chose the spiced Belgian ale. Server comes back with drinks 15 min later and I was bummed again because my beer wasn't in a pint glass but a muse red wine glass. Which is a damn bummer and doesn't make any sense for a damn $8 beer that's only 6.7% ABV. Overall, the taste was alright. Nothing out of this world amazing but pretty middle of the road. Server disappeared after setting down our drinks so another 15 min pass before we can put in our order for fries.\n\nI will say the fries were bomb as f. Super delicious and redeeming. But the server never returned after we got those. Asked someone different for our check, paid and left.\n\nI'd come back in the daytime if the weather was nice and they decided to offer flights...", "author": "Krista C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Great service, tasty beer, and they throw out panhandlers pretty quickly. (I guess that happens in open-air places. I won't hold it against them.)", "author": "Colin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-22", "description": "It's new.  Put it on you watch list.  It may have potential.\n\nStill some startup pains, e.g.:\n\n- the bus boys are more personable than the bartenders;\n\n - staff can be a little lazy about keeping the place clean and customer ready;\n\n - some dishes totally miss the mark - such as the pizza with a salad piled on it or the weird, Trumpian goop on the hamburgers.  Hopefully Circa works through those menu issues fast.\n\nIt garners an after-work crowd which could keep Circa afloat for a long time.  If that's the best they can realize then an opportunity will be missed.\n\nStay tuned...", "author": "PJ S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "Everything was good, the beer was tasty. But if you are very hungry they have very small pizza and another appetizer are very tiny . And we also didn't like the dish with chips and  raw meat. It was disgusting ( \nBut all vibe was great and we would like to come back", "author": "Irene S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "I really enjoyed my dinner out at Circa Brewing.\n\nMy partner and I met at 7:00 PM on a Saturday night and they still had plenty of tables available (when we left at 8:30 PM there was a wait). We ordered two beers, two pizzas, and the Circa burger. This was a lot of food but no regrets.\n\nThere was a bit of a wait to get the food. We sipped our drinks and talked but I did notice that the wait seemed a little longer than I would have liked. We enjoyed the Belgian Wit ($7) and the Berliner Weisse ($7), both very light beers with great flavor. Neither of us were particularly in a strong mood to drink so both beers fit the bill for us.\n\nThe pizza came out first. We had ordered the Salumi ($18) and the '62 Hawaii ($18). The Salumi was delicious but I will admit that it lacked cheese. The dollops of mozz were sparse and while the meat was plentiful, I did wish there was a bit more cheese on the pizza. However, I LOVED the added Mohawk honey. Everything tastes amazing with hot honey. The '62 was delicious. The ham was *extremely* salty but paired beautifully with the grilled pineapple. I was pleasantly surprised at the quality of the flavors. The dough was soft and not-too-thin. My partner was slightly annoyed that some parts of the bottom were charred but i actually thought it added to the flavor.\n\nThe cheeseburger was delightful. Expensive, I believe it was $22 but cooked to perfection and teeming with juicy flavor. Also the rosemary fries were delicious! I was a little sad we had binged so much on pizza so I didn't have the stomach to fully enjoy the fries.\n\nI think there are some small kinks to be worked out at Circa but overall it's a beautiful, big space with great food and drink. I would definitely recommend it as a nice spot for a group or a date!", "author": "Maria W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Excellence is always key. They did a great job with place. I will definitely come back here. Service is awesome sauce. Much appreciated.", "author": "Chef Simone R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "I'm only going with two stars because the staff was super nice when they told us that any food or beer option on the menu that was in anyway palatable to normal human beings was not available.  Don't go here. Really. Don't let the extra star fool you, there are only four or five things that might not be terrible on the menu. But I wouldn't know.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Circa is a great change of scenery for Downtown Brooklyn, and a great addition to the revival of the area. It was pretty smart to pair a brew master and a pizza connoisseur, I mean pizza and beer, I can't think of a more delicious combo. I loved everything I tried, The Choke pizza was my favorite, the combo of marinated artichoke hearts, hazelnut pesto, sweet peppers and gooey mozzarella went so well together. I paired it with the beer flight which seemed to be various IPAs, the New England IPA stood out, I could definitely taste the citrusy toffee. Their open kitchen is eye catching, it was pretty cool to see flames from the brick ovens and open grills flaring up as the chefs did their thing. I will definitely drop by when I am in the area to try the rest of their menu.", "author": "Maris F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "I don't drink beer, but my friend was very pleased with Circa's beer selection. Nothing on the cocktail menu tickled my fancy, so I opted for a cider. They have two dry craft ciders on the menu (Downeast and Nine Pin), which I was happy about. It's always nice to go somewhere that has something on the board other than Angry Orchard. \n\nWe snacked on fries, which were topped with parmesan cheese and fresh garlic. Some of the menu items seem overpriced ($9 fries, $15 mac and cheese) but the pizza looks and smells amazing. I definitely want to come back for dinner. \n\nLove the decor of this place! It's rustic, open and warm, spacious, yet intimate. Circa has a huge wrap-around bar and lots of indoor seating otherwise. They also have a small outside patio. The shuffle board table was a fun surprise. Staff is accommodating and friendly.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Very nice vibe and really enjoyed the decor. They were out of burgers for the food but got pizza and the Mac and cheese instead. Both were really good. Nice wait staff. Overall a good experience and would return.", "author": "Channelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Great vibe, beer selection (especially if you like ciders and sours) and food/service.  Will be back!", "author": "Eric S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}