{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "I love pizza and I love beer. Unfortunately it's hard to find a place that serves great pizza and also has great beer: great pizzerie tend to have a mediocre beer menu, while breweries tend to serve small bites (if they serve any food at all).\n\nEnter Circa, a new brewery that also serves fantastic pizza, alongside a rather tantalizing food menu. The first impression when entering Circa is that this space is huuuge! 6,000 sq. foot of space with a long, curvaceous bar in front of the massive stainless steel tanks and fermenters, lots of seating space, an open kitchen with two wood-burning pizza oven and two open fire grills, AND a shuffleboard. The overall feel is \"fun industrial\".\n\nThe brewmaster is Danny Bruckert formerly of Sixpoint Brewery. The current beer selection has 12 tasty brews on the menu, ranging from pilsner and lager, to several IPAs, to Belgian ale, to gose. I tried the saison, gose, Belgian wit, and IPA. My favorite were the IPA (bitter and aromatic) and the saison (complex and acidic).\n\nOur dinner started with the goat's milk ricotta ($13), which is served with fennel pollen and saba, and dough puff straight from the pizza oven. The ricotta is wonderfully light and creamy, and the saba[1] adds a sweet tone to it that I loved. the dough puff is nice and fluffy and quite addictive.\n\nFor pizza, we tried the Big Dipper and the Salumi. The Big Dipper (truffle bechamel, melted leeks, wild mushrooms, pork shank, gruyere, side of pork jus; $21) is a serious contender for pie of the year: I loved the combination of truffle oil, wild mushrooms, and pork shank, and the pork jus adds even more flavor to this fantastic pizza. Of the Salumi (hot soppresatta, tomato, smoked scarmoza, mozzarella, garlic, mohawk honey, oregano; $18) I loved how aromatic the fresh oregano smells, and the sweetness of the honey pairs wonderfully with the hot soppressata.\n\nIn short, a wonderful place: great to relax after work, for your next office party, or even for a casual date. It's also great to see new places with exciting food options opening up in Downtown Brooklyn.\n---------------------\n[1] Grape must reduction. Here's what Wikipedia says: \"Saba is an ancient condiment, known since the time of the Romans, and is the result of cooking selected grape musts, especially of Lambrusco or Trebbiano grapes, over fire. Saba is the main ingredient in the production of Traditional Balsamic Vinegar of Modena.\"", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Today was my second time at Circa, and like the first visit, I really enjoyed it. This time, beside the tasty beers, I also tried their food and it was delicious! Specifically, I was really impressed by the pizza Margherita as I am a pretty picky Italian, lover of high quality classic pizza. The dough was perfect, fresh and crisp. The tomatoes sauce was sweet and delicious. The small circle pie was just perfect. \nThe place is not huge, but really well planned with various seating areas, between high tables, shared tables and couches. \nBehind the bar you can see some brewery making.\nThe service was perfect and the cherry on top my experience was the live jazz music that was played while I was there.", "author": "Martina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-16", "description": "I am giving 3 stars because they offer a nice, large clean space in an area that doesn't have a lot of them. The service has always been great, but the problem is they're a micro/craft brewery with beer that just doesn't taste very good! Seriously, I've tried them all and am now on the second rotation. I understand the drive to create something \"unique\" in the crowded craft beer field, but at the end of the day regardless of the quality of the ingredients, the \"small-batchness\"... the beer has t ok taste good. Maybe try brewing some tasteful, basic beers (ie... a Hefe, a pilsner and an IPA) and then supplement the menu with some different unique takes?\nThe ambience and quality servers earn the stars here, the brewing needs some work.", "author": "Brian P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "I really wanted to like Circa Brewing, I did. But they have a few problems they need to sort out.\n\nLet's start with the good:\n-The space is beautiful. High ceilings. Big booths. Lots of tables, including sidewalk seating. They have a few projectors, but no screens (yet), so I imagine they'll start using those at a later date.\n-The Big Dipper pizza was unique and great. Imagine a French dip, but instead of a steak sandwich, you get a pork pizza with pork jus on the side. Oh, and truffle sauce on top.\n-The handicap stall in the men's room has its own sink and mirror, which is kinda cool, I guess.\n\nThe mediocre:\n-There weren't any real stand outs with the beers. They may have had a problem with their carbonation system because the gose was flat and dull. Their IPA was also nothing special. They opened the place with 10 different styles of beer available, which is ambitious even for an established brewpub. Should've scaled it back and perfected a handful instead.\n-Their beer menu lists the SRM color of the beer (which, really, who cares?), but doesn't list more basic/important things like IBU, or even quantity. For some reason, they serve their IPA in a 10 oz tulip glass.\n-There's a really out of place shuffleboard table in the middle of the bar. Not sure who's supposed to be playing it, but it ended up being these kids at the table next to us while the rest of their family was done eating and not leaving (all the while, other people were clearly waiting for a table).\n\nThe meh:\n-The Clam Down pie was incredibly salty. Almost unbearably so. And if you're expecting New Haven style pizza, don't be. Crust was just normal and a bit too doughy.\n-Pizza prices go up to $22 on the high end, which is more than what you'd spend at a place that actually specializes in pizza, like Emily or Pizza Moto. Granted, the Big Dipper was good, but more of a gimmick than a staple. Also, adding truffles is basically cheating.\n-It took forever to get our check, and then our waitress just kinda disappeared after handing us the bill. The waitstaff have tablets with card readers, so it should really be a much smoother process.\n-The tables also had bottles of oil with whole red peppers floating in them, but it wasn't even a little spicy. Not sure what the point was.\n\nI'd probably return to give them another shot, but maybe not so soon. I've heard good things about their tomahawk steak (which is listed at market price, but our waitress told us MP is always $90, which is very curious).", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "This huge new spot just opened in Downtown Brooklyn, with a big focus obviously on drinks, but the food is also excellent.\n\nI just tried some of the pizzas and they were excellent. Both the simple Margherita ($16) and the Bitter End ($20) were delicious. I'll definitely be back for more food and the unique brunch pies on the weekend.\n\nAlready open for lunch, brunch and dinner, this is another great option in this area that is rapidly becoming a destination for food.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Stoped by for the last day of October fest, which was an amazing deal of you really love beer, hard ciders, and sours! There were so many options for each category to pick from and it's AYCD for $25!! The brunch menu here was notably amazing as well!! My top favorite dishes had to of been the quiche (which was one of the smoothest and creamiest ones I've ever had!) and their new eggs Modena dish!", "author": "Brandon L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "After hearing a lot of hype about this place I finally decided to check it out with my girlfriend for dinner.  The interior is very well done and the brewing equipment gives the place a cool industrial feel. They nailed the aesthetics, it's refined without looking too upscale for a bar.\n\nThe food is a different story. I wasn't impressed with the cheese tray or the pizza. The crust was way too soggy and they basically dumped a pile of salad in the middle. It wasn't the worst pizza I've had, but this is Brooklyn and when you're charging $18 a pie you'd better be serving up some great, not good, pizza. Paulie Gee's puts this pizza in the ground and they're around the same price. Service is outstanding though and extremely friendly.\n\nThe beer is the main attraction though and it's pretty solid. We did a flight and every brew we tried was on point. I'd take any one of Circa's beers over a Brooklyn Brewery beer. This is a great hang out spot and I'd come back in a heartbeat to drink, but I probably won't be back to eat.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "This placed has received a lot of hype and I didn't really expect Circa to live up to it. But boy did it! The Hawaiian pizza was excellent and that dough, I could just chew on it all day. Although on the smaller side, the pizza was deceptively filling. I thought we'd each need one, but we started off w/one and realized that we had room for a little more, but not another whole pizza. Maybe a pizza and an app is the way to go for two? Enjoyed the beers too. Really friendly service and a huge space for dwtn Brooklyn.", "author": "Randy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "I'm soooooooo happy! I live in the building that Circa has recently opened in. This neighborhood has been lacking in food and drink options for years and within the last month suddenly numerous spots have popped up. Circa is a gorgeous restaurant and brewery that seats approx 250 people. We went on a Saturday night at 9:30 pm and the wait for a table was 30 minutes! So clearly they are doing well!\n\nTheir beer is awesome and the food even better. We started with the black rice grain bowl and then shared the Hawaiian pizza. This is some seriously good thin crust pizza. The items on the menu are unique and span from salads, cheese plates, etc to pizza and large entrees like chicken or fish. Everyone will find something they like on this menu. They play great music and the atmosphere is fun. Good service too. I can't wait for this to be my new weekly spot!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-13", "description": "My husband and I live in the neighborhood and have been coming here once a month or so since they opened.  \n\nThey have the best bar stools in NY (seriously swoon-worthy), delicious pizza (they're all good but the '62 Hawaii is the best, in our opinion), Chopped Salad is nearly perfect, decent brews and wines on tap, and our favorite bartender Nikki is at the bar on Sunday nights.  \n\nNot so great are the prices.  Definitely on the verge of \"really...that's what I get for $__?\"  The few times we strayed from the pizza and salads, it's been disappointing.  The calzone was just lame, the rosemary fries were tasty but it was basically a tin cup of potato crumbs, and when I finally broke down and ordered the $9 Ember Baked Sweet Potato it was like some kind of cruel joke (I was expecting heaven and I got a 3\" potato that tasted like foil).\n\nIt's definitely worth a visit if you live close by, but it's certainly not a destination.", "author": "Naomi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "Food is really good and the service is good as well, recommend trying all the beers as they are all good and also stay during happy hour as they have fun trivia games.", "author": "Frank P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Variety of super good beer and pizzas! Great chill vibes with a relaxing atmosphere. The staff is super friendly and willing to answer any questions you have. They brew beer right in front of you at the bar, which makes for a great scene.", "author": "Kris G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "My recent lunch visit across the street reminded me of my three visits to this place, which I first learned about through AM New York. \n\nMy initial visit was with my nephew from Florida. As a beer connoisseur, we wanted to give him a tour of the many breweries available in the five boroughs. Circa was our first stop, and we agreeably stopped at the finest, most professional operation in Brooklyn. My wife struck up a conversation with a guy working behind the bar, where the equipment was located. We had no idea at the time, but he was one of the owners! The next thing we know, we're getting a tour of the operation. My nephew was impressed, to say the least. \n\nAfter such first class service, I couldn't hold back from sampling a few of their finest house brews. All good, of course. \n\nMy second visit was when we sampled the menu... a few friends dropped by for a bite as well. Some of us had pizza, my wife tried one of their vegan options - cauliflower steak. She had no complaints, enjoyed the hell out of that vegetable! The pizzas were all cooked to order, and the way a brick oven pizza should be made - crisp crust, not too much sauce, a good balance of toppings with none of them overpowering the others. The kitchen changes the pizza varieties often, so there's no point in telling you what I got. It was good, good enough to go back.\n\nMy nephew is coming back to NY next month, and we plan to take him back to Circa, despite our plans to explore strange, new breweries. Make the trip to try them out... Jay Street/MetroTech station on the A/C/F/R. Just go! Don't question me.", "author": "Richie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Came here with a group of 15 for my birthday (with no reservation) it was a last min thing. And we got a table in the back area right away. Our serever was VERY PATIENT. God bless her--some of the people we were with showed up late but she always had a smile on her face and was on top of everything. The lox pizza was SO GOOD!! and for dessert i was sang happy birthday with a delicious dutch baby with a candle on it. Thanks for a good time circa! \n\nAlso... bathrooms!! I went to the women's my fiance went to the mens. We both left saying omg those bathroom sinks were \"house goals\"...haha I loved the decor and look of it.", "author": "Rebeca V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Had a great time here. Came on Sunday evening place was pretty empty. Service was attentive and solid Pilsner. They also have a full bar. Food I'd say was 4 star but close to 5.", "author": "Boris S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "This place was pretty neat find in Brooklyn. I give it a five solely because of the great bartender. There was a green looking beer ordered so I asked the bartender what it was. It was a mixture of their Berliner weisse with woodruff mix. She was explaining to me about. Next thing I know she gave me a pint of it too try. I love how she was always willing to answer my questions about beer. The salumi pizza was pretty good as well. I was expecting a bit more but other wise I enjoyed the beer. Highly recommend the pilsner because it's nice crisp and chill beer.", "author": "Midori T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "Crafty venue with a LOT of space!\n\nNothing too pretentious about this place (good thing).\n\nThey offer flights of beer (and wine) which is one of my fav things!\n\nAlso have a relatively small menu of slightly ecclectic food items.  I ordered the equivalent of a \"fancy\" Hawaiian pizza.  The price was a bit much I thought for just decent \"pizza\".\n\nThe environment and drinks make it worthy of a revisit  :)", "author": "Joey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Solid pizza and beer list. There's a good crowd for post work happy hour as there aren't too many other places in the area. The lamb gyro pizza we ordered was good. Beers list is nice and i think there's a happy hour that we just missed. There's also outdoor seating which will be nice in summer.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-27", "description": "I stopped by in Circa after having had a bad really bad experience ordering via caviar but I am a sucker for suffering so I certainly didn't let that stop me from looking for lunch there the other day.  Anyways it started out nicely enough, I ordered a salad and pizza. I was basically abandoned by the server who made me wait a ridiculous interval of time before finally bringing my pizza which wait for it was cold. Like it had been sitting out there in the kitchen waiting for the server to just pick it up and bring it to your girl. Smh. On top of that, circa what's up with calculating your tips on the total amount on the check including the tax. That's very sheisty practices. Stop.", "author": "Jill A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Thrilled to see another brewery open in Brooklyn, and I immediately put it on my to-do list.\n\nThe happy deal is a steal--$20 for 2 beers and a pizza. We tried a few beers, and I was mainly interested in the New England IPA, since it's the must-have style everyone wants.\n\nFirst, the good: pizza was excellent. Like, absolutely delicious. It came super fast and was well made.\n\nThe bad: The beer. The NEIPA was mediocre, and at $8 for 12oz, it had to be somewhat close to Other Half...or Three's...or Greenpoint Beer \u0026 Ales...or Singlecut...well, you get the point. The pils and gose were both fine, but again, nothing to write home about.\n\nI get that with Circa's location, they are catering to the after work corporate crowd, and that's fine. But at these prices, you sure as hell better be brewing an excellent, outstanding beer, especially considering the incredible quality of brews around you.\n\nI would absolutely, 100% go to Circa for the happy hour deal--it's fantastic. But if you're planning on just going there to knock back some brews, take the F a few more stops and get some of the best beer in the country.", "author": "Dylan K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}