{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Wonderful food, great brews and very good service. Was quite surprised at the quality of everything. And they had shuffleboard! Will visit again!", "author": "Mike D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Great new brewery in Brooklyn and AMAZING pizza! Locally brewed beer selection is also great and a nice variety.", "author": "Ian B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Great new spot, nice and open and perfect for a lazy day drinking some beers and grabbing some food. The pizza was really good too. They're new and working out the kinks but it's definitely worth going to, oh and they have shuffleboard!!", "author": "Matt A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-04", "description": "I really liked the ambiance of this place, the beer, fries and bartender, so for that reason I am giving them 1 star. The cook, however, is a much different issue. I ordered a burger cooked well done. It came out medium so I sent it back. From my seat at the bar I could watch the cook. Several times he took his hat off of his head and wiped his sweaty brow with his other hand. He then proceeded to use that sweaty hand to touch the center of my 2nd burger to see if it was done. I almost fell off the bar stool. He also pulled up his baggy pants several times too. He never one time washed his hands. I told the bartender and she immediately went to the kitchen to inform the cook of what I witnessed. In no way was this her fault and my tip reflected that. Just be warned that if you order food from here that it may not be handled in the most sanitary method. It makes me wonder about how everything else is cleaned (beer lines, mugs, etc.).", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-22", "description": "I've been there a few times and it is pretty hit or miss; usually miss. The food is adequate, although there are places in the area that serve considerably better pizza. The biggest issue is the extraordinarily poor service. Generally, the service has been abysmal: rude, disinterested, and inattentive. Here's a concrete example: I ordered something. Two people that the bartender apparently knew came in, and she proceeded to speak with them for about 10-15 minutes. After a while, I was finally able to get her attention by making eye contact. She finally took my order. About 10 minutes after my order, it wasn't pleasant to hear the bartender speak with a customer making racist comments and AGREE with him, that a black man, who looked at the menu and didn't order, only left because a \"Big Mac,\" and other fast food items, weren't on the menu. I don't enjoy watching a bartender agreeing with an asshole who openly disparages  potential customers. Very disappointing. I will never set foot in here again and give these folks my hard-earned money. Pure garbage.", "author": "Arthur P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "This place was cool.   Great vibe friendly service and the food was enjoyable for the price.", "author": "Bill W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Many good beers and delicious pizzas, what else do you need to know? It also has a great vibe, it's a large space and all I've the servers I've encountered have been very friendly and knowledgeable. Oh and there's live music on Saturdays and some other days but I've forgotten which already. The salumi pizza was so good I lost all focus afterwards.", "author": "Anon P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-27", "description": "After what seems like a decade of waiting, Circa finally opened. We were invited to the Community Night/Soft Opening on Monday but were unable to make it. Last night, Le boo and I instead went to their Grand Opening for dinner and drinks. Overall, our experience was just meh.\n\nThe pros:\n-The giardiniera was good. I'd be interested to try it on a hot beef sandwich.\n-The beef tartare was tasty. I didn't understand why it was served with potato chips, but the contrast in textures worked well.\n-It's located around the corner, so we don't have to go far for a drink.\n\nThe meh:\n-I'm relatively ambivalent on the pizza. There's literally 5 or 6 different \"individual style wood fired\" pizza options within a 15 minute walk, so the pizza better be good. We had the margherita and the 62 Hawaii. Neither were anything better than edible. This is New York. Your pizza needs to be good.\n-The bar selection looked limited. I would love to see that expanded, especially the rum (Purchase Ron Zacapa, Wray \u0026 Nephew, Hamiltons, etc) and amaro selection.\n-Service was weird - we walked in, were sat, Brandy introduces herself to us and asks if we wanted sparkling or flat water, cool. Another server walks by and drops a bottle of water on the table and asks if we are ready to order. It seemed like they had servers on top of each other all night - at times having as many as 4 people walking by asking if everything is okay. At other times, it was like all of the servers disappeared and you couldn't find them when you needed to get the check.\n\nThe cons:\n-While there has been an influx of new residents with expendable income in Downtown Brooklyn, the price points are extremely ambitious to create clientele that keeps coming back on a daily or weekly basis. \n-The beer. I understand the whole shtick behind Circa is that it's an in-house brewery. However, if you're going into the beer business, your beer needs to be an improvement on the market. Otherwise, why would you do it if you have nothing new to offer? The Pilsner that I had last night was awful. I had just a few sips and that was enough. Please expand the bottle selection as well. \n-The music was a bland 80's soundtrack. Maybe they should have someone curate playlists for the restaurant - especially music that's not as date.\n\nOverall, we might be back due to its proximity, but nothing really stood out as great upon the initial visit. I hope that they can work the kinks out because we would love to be daily customers.", "author": "Latoya D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-10", "description": "Two stars is generous and only for the decent beer.  Service abysmal.  Slow and confused, dishes coming out at different times for the same table, dry, tasteless burgers ($21!!!), and noxious fumes wafting out of the open kitchen from the charcoal they use to prepare the mediocre food.   Go to Shake Shake instead.  Eat better and save some shekels.", "author": "Robert E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-04", "description": "Went here for dinner tonight. Way too loud. The noise level was ridiculous. Felt like I was in a club. The people next to us were obnoxious and the seating was cramped. Nice decor and decent food but overall I wouldn't go back.", "author": "Farrah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "Couple months after opening and they're still working out the service thing. Came in around 5pm for one beer and despite no crowd, sat around for five minutes while bartenders ignored me. Note that their menu does not tell you that the pours of their beers are not a pint. 12 oz of IPA for $8.50 is a high, especially if you're thinking it's a pint. Beer is good!", "author": "Wade B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Happy hour is amazing. Pizza tastes delicious and they accommodate for vegans! Wait staff is super friendly and helpful. The place is huge but not crowded or too loud. This is the perfect spot for grabbing a happy hour drink and snacks!", "author": "Vicky J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "As beer geeks, we take any opportunity to check out an NYC brewing operation, and Circa Brewing was worth the trip from upper Manhattan. I ordered a flight with the New England IPA, Saison, Amber Lager, and Nitro Stout. I'm normally an IPA devotee but the lager won me over so thoroughly I ordered another pint. Argh, why didn't I get a growler to go?! We ordered the margherita, fancy bacon and eggs, and salumi pizzas. Don't be afraid of the potato on the bacon and egg pizza - it's so thinly sliced you hardly notice it, and the rosemary is such a fragrant and elevated addition. I LOVE pizza with sopressata and honey, and CBC's version did not disappoint. Just enough honey where it's not too sweet, but noticeable enough. Couldn't leave without something sweet, so we went for the donut holes - more like beignet sized, and the lemon glaze is just enough if you don't like things too sweet, but I could have used another coat!\nIf you're in the neighborhood (I think everyone is these days, it being just around the corner from Dekalb Market), make this spacious, stylish, relaxed new spot a regular in your rotation. And if you're not - make it a destination. They're in great shape for having just opened and are sure to keep it up.", "author": "Cydnee R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Delicious  NY style pizza and a good selection of beers. The ambiance was inviting with a relaxing and chill seating setup. There was a shuffle board table free to use. Nice place to kick back and relax while having a drink. Also have liquor and ciders to choose from.", "author": "Jacquelyn H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Clam pizza was the worst pizza we had ever had - terrible dough. Like paying $20 for some crappy bread. Steak tartare was a strange mix of large cubes of meat with a rice cracker and was missing pickled sweet onion - when asked for it received a small container of little chopped onion. Had to ask for water multiple times. Drinks ok. Sad because the space is very nice. Maybe with different management the kitchen wouldn't be such a mess and this place could turn it around.", "author": "Anna h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Friendly service and great beer. Happy hour beer special was a good deal! Would love to see some happy hour food specials too. Pizza looked amazing but was very large. I would love to see some small munchies offered between 3-5pm. Taproom was well decorated. Wouldn't recommend sitting on the patio though unless you enjoy crazy street people yelling at you.", "author": "D D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "This is what Downtown Brooklyn has been waiting for.  Expertly brewed beer, delicious and creative food, great atmosphere.  Can't wait to come back.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "Incredibly friendly staff! The beer and cider were good. Limited menu for the opening. Hopefully they will add some other good picky foods and desserts!", "author": "Erin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "This place just opened near us, and we're excited for a place close by to grab a beer.  It looks line they brew their beer right on the premises.  They ran at least 2 wood burning grills, had amazing cocktails, and a tabletop shuffleboard.  Great service, this is going to be our new local joint.", "author": "Sulma V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Had split multiple pizza's and the chopped salad, the salad was amazing and let me tell you I don't eat vegetables for shit, the pizza was great as well, I have a thing for gourmet pizzas, they're around 6 slices a pizza will be coming back", "author": "Steve K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}