{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "Lovely new place. The beer is great with a good selection. The bartenders were super friendly too! I most recommend this place! The only reason its only 4 stars is because the menu isn't fully available all day. 3-5 is only pizza.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-17", "description": "Highly recommend the  cauliflower eggplant cashew spread spinach wrap and yes order the rosemary french fries wait wait....dip the wrap in the special sauce yummy..my husband got the chopped salad with chicken and that looked really good.", "author": "Grace m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "This pizza brewery is two streets down from our hotel so it's a convenient get together place during our visit. The ambience is modern, welcoming and jolly. There's a room for a large party in the back. The consensus of our group of 10 after multiple visits was that both the beers (Amber Lager and IPA) and pizzas (Salumi with sopptessatta, Big Dipper with truffle, leeks wild mushroom, pork shank and Choke with artichoke, pesto) were all amazingly good. The cocktails (Americano Perfecto with sweet vermouth and Nova with bourbon etc ) were excellent as well. The thin crusted pizza dough was light, not overwhelmingly cheesy, with flavorful toppings; quite unlike the ones served at most other joints. The Bitter Greens salad was a bit spicy. We noticed it's pet friendly at the front.", "author": "Geri C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "I don't give reviews (actually never to this date), but when I do...I prefer awesome local joints. And I hope this place is here for the long haul. \n\nNormally, I would've discredited the overly positive press received by this place on all the email newsletters that everyone is subscribed to. But I was encouraged by further encouraging reviews from early visitors. And let me tell you...the pizza here genuinely occupies that storied space between Neapolitan and NY style pizza. This is instantly one of my preferred pies in NYC. So much so that it absolutely deserves top billing here over the eponymous beer, which is no slouch by any means either. The New England IPA was excellent, and I will absolutely be coming back for their other IPA, which they were out of when I was there.", "author": "Dane B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Stumbled upon this place. Everyone was super friendly. The beer was amazing ,the atmosphere is beautiful. Interesting watching the whole brewing process .Will defiantly return .", "author": "Ebony S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Wow wow this bar is awesome if you pass by here sometime you have to stop on. Wow the beers made on location at the bar. It my first time here I love. This going to be my spot for the weekend from now on. Please check it out.", "author": "lloyd g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "I used to come here on my breaks in between classes. Now that i have graduated from college I been here about 2 times since. Graduating with a Hospitality Management degree, service is very important to me. That is the reason i come back. I can say that I always get good service here! The Staff is always friendly and nice no matter what. I recently brought my friends to this place and they loved it. Im not a big food person but the food is pretty good. However I have noticed that the menu does change from time to time. Since they brew the beer on the premisses you already know it is quality beer and some of the IPAs the have are super strong. This will always be my go to spot in Brooklyn! One thing i do have to say is that no one is ever at the front door so when i walk in i am hoping to see someone to seat me. Other then that this place is great.", "author": "Gadeer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "This place was BEAUTIFUL. My boyfriend and two of my friends went on Saturday night. It was not packed, but the tables are pretty spaced out so you do not feel like you are on top of your neighbor. We were seated in the back area near the grills. I could smell all the goodness! I was super excited to try a new restaurant in Brooklyn and they did not disappoint. \n\nDrinks:\n\nI had a cocktail and a beer. The cocktails were beautifully made. It took a little bit to get them, but it was worth the wait. I got the Tropicale. It was a lot more sour than I expected, but still delicious. \n\nFood:\n\nWe ordered fries, mac \u0026 cheese, and the Salumi pizza. The fries were amazing. I probably wouldn't order them again unless I was hungry, but they were a nice snack if you just wanted to sit at the bar. The mac and cheese I wanted it to be more creamy. Also the plate they displayed it on made it feel like I got less mac and cheese. I would probably get the mac and cheese again as it was tasty. The Salumi pizza for me was a lot more spicy than I imagined, but it was DELICIOUS and the cheese fell right off the pizza. \n\nExperience: \n\nOverall I would LOVE to come back to this restaurant mostly for its atmosphere and to try out different drinks and pizza options.", "author": "Kara E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "This is a cool hidden spot I was not expecting when I walked in.  I have been here twice now and have enjoyed it both times.  The first time was a quiet Sunday afternoon and I just had a drink, the second time was for dinner and it was rocking.  Friendly service good food and beers!", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "We live in Downtown Brooklyn and were delighted when Circa opened up. There is no other place like it in the immediate neighborhood and it filled a need for a great place for dinner and/or drinks just down the block. We have become absolute converts to Circa and come once a week; at this point we've nearly sampled the entire menu! In short: we love it here.\n\nSPACE: The space is really big, however doesn't feel overwhelming. We have gone as a couple and brought a group as big as 8, and have always been able to sit within 20 minutes, even on busy nights. The decor is thoughtful (check the custom, nearly-seamless curving wood bar top) and it's clear they prioritized quality; the chairs are fantastic leather with armrests at the bar and the back seating section. They have a table shuffleboard which adds a bit of fun into the space, and well incorporated TVs that don't look awkward or blare too much light.\n\nSTAFF: Everyone on staff has always been friendly and professional. In a new restaurant that sees as much traffic as Circa does, we were pleasantly surprised when staff would recognize us from a visit the week before. Sarah, the manager, is absolutely delightful. We've also had a number of great servers, Keith is a standout. Staff won't hover, but are easy enough to flag down if needed. We notice the owners are often in the restaurant to see how things are running, which I appreciate.\n\nFOOD: First, let's talk about that fact that the oven and grill are wood-fired. That in itself is a beautiful thing. The menu, from the beginning, was impressive, and they have only fine-tuned it more since opening. Our favorite items: Goat's milk ricotta (dinner version over brunch version, although both are delish), crispy grains, '62 Hawaiian pizza, 2 Cows A Sheep and A Goat pizza, smoked orata rillette (a recent addition), the Circa burger + fries, and the chicken salad sandwich (lunch only). These are the highlights, but honestly, we've found there are rarely any misses. Our least favorite items have already been rolled off the menu; Circa has done a great job of honing in on what works for the clientele.\n\nDRINKS: There are constantly new beers on the menu, and we've had a good experience with most of them. I'm not an avid beer drinker, and I still manage to enjoy a glass when we're there. The real stand out for me is the cocktails - both the Nova and Come All Ye Faithful (hello, charred grapefruit) are absolutely divine.\n\nVALUE: A lot of people have noted the prices in their reviews, so I wanted to give my take on that. The prices aren't cheap, but the quality is above average, so frankly, I think you're getting the right value for the price. Beers run high single digits, cocktails low teens, apps/sides low to high teens, pizzas high teens to low twenties, mains range from the burger at $18 to a Tomahawk steak for 2 people $88 ($44pp).", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "it was delicious. really good beer, had the IPA, New England IPA and the Nitro Stout. Had the salumi and Hawaiian pizzas. Will be back soon!!", "author": "Tyler C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Fantastic hidden gem on an off street in Brooklyn. Really deceptive from the street, once you get inside there's a fantastic vibe. Excellent beer and great wood fired pizza. Will definitely be back when I'm in the area.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-05", "description": "Place can't get it right. Went a couple months ago for dinner, and one pizza came out, the other not for another 20+ minutes. Went for lunch today, and a hamburger came out, while the next two took 15 minutes. Just no excuse. Both times, apologies \"there was a mixup in the kitchen.\"\n\nFix the kitchen. \n\nAnd learn to make a muffuletta. Far and away the worst one I've ever had, with stale pre-sliced cheese, poor meat, an improper and inadequate olive spread (it's the defining factor for chrissakes), and on stale bread to boot. \n\nI'm done.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Circa Brewing has a great selection of whiskey and tasty beer. They have really good pizza too.", "author": "Gabi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "When to an office Christmas Party . Had a really good time. The appetizerss where  delicious. The drinks where on point! I also recommend the straeberry cheese cake ice cream! We had like 3 rounds of it lol.The staff was really welcoming and the service was great. Red nees to go back to try the beers", "author": "Redgem M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "So, I was down in Brooklyn for a live fantasy football draft (yeah, I'm that guy, I get it) and staying at the Marriott near the bridge. My buddies who lived in Brooklyn mentioned this brewery had opened not too long ago, and is a two minute walk from the hotel. Let's go!\n\nIt's a large space, bar, several tables when you walk in. In the back you'll find more tables, booths, and the kitchen. They serve pizza and various appetizers, as well as beer. We were there with six people at 4PM on a Sunday. It was busy, but not overcrowded and we sat right away.\n\nThe beer is solid. We all drank/tried IPAs, Gose, Saison, Pale Ale, and Porter. They were all great, although I think their Gose is above average for the style. If you're an IPA person, you won't get disappointed. I wasn't a porter fan, but it was a bit warm out and maybe I just wasn't in the mood for dark beer.\n\nI enjoyed the pizza, and would give it 7/10 in an area with great pizza in general. Salumi was a hit with us.\n\nThe service was super friendly and attentive. Our two waitresses were twins, and we're amazingly nice. They worked hard and we were never without a drink.\n\nOverall, great place to stop for some food and beer. I probably wouldn't stay there all night, but that's only because there's a ton to do in the area. You won't be disappointed", "author": "Josh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Kate was very helpful with accommodating my vegan friend. She provided great service to us and was very helpful in making sure that nothing was not vegan for him. Great place, super nice outdoor seating, good vibes. I'd highly recommend this place if you want to taste a little \"local flavor\".", "author": "Bart S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "What an awesome brewery! The best chairs. Unreal beer. Fantastic service, cool vibes and great beer. The brewmaster Mark is the man. Super knowledge and makes a MEAN product. Loved the new coconut beer. Perfectly balanced and refreshing, yet still finishes like a great beer should. Talked to him for hours and felt like a regular within minutes. What a great experience!", "author": "Sam P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Nice fun place. Food selection isn't great but beers are good. If going on a weekend go early, crazy waits but it seems like it's because everyone stays and socializes for a while. Outside seating even in winter is nice too. Overall a fun different place in downtown Brooklyn", "author": "Jessi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Great atmosphere.  Great food.  Even more outstanding wait staff. They were so accommodating.   I really enjoyed the variety of pizza available, all quality.  And the smell of the wood stove made for a cozy ambiance.  Beer was delicious, good variety. Nothing too extreme all standard fair.  Wasn't a huge fan of the pumpkin stout but other options like the tripel made up for it.   Biggest downside was that the bar seats in the front...with the hanging lights...made it very difficult to see the projector tv above the bar.", "author": "Dan L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}