{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-14", "description": "My boyfriend and I went this past Friday night around 9:30. I think the hostess was clueless as to what tables she had available because after about 15 minutes, we get seated at one of the two tables outside that had been empty the whole time we were waiting. There were also 10+ tables in the back of the restaurant that were empty which we saw when we went to the bathroom.\n\nThe space itself was BEAUTIFUL but the beer we had was terrible. Tried to order a flight but they weren't doing flights because they were waiting for their new glasses to arrive. So we ordered a gose and a berliner weisse but both tasted watery and only had a hint of sour. It was almost as though the brewer skimped on malt and yeast. I get that these are two difficult styles to brew, but I would imagine you would want to spend time perfecting your recipe before releasing it out into the public. Also, what kind of brewery sells Budweiser? Wouldn't you want to sell your Pilsner or \"Amber Lager\" instead?\n\nAlso someone else mentioned this, but I don't understand the point of putting SRM on the menu. IBU would be much more useful as I seriously doubt anyone cares what color their beer is/would even know what \"SRM 7\" means.\n\nIt's a new brewery so it's going through some growing pains so I would wait a few months before visiting until all of the kinks are sorted out.", "author": "Kim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "Came here for brunch on Sunday and had the eggs benefit pizza.  Yes, that's a thing.  It was delicious!  My friend had the ham and eggs pizza this time, which she liked, but she preferred the lox pizza she had had the last time she was there.  \n\nThe atmosphere is very hip, with huge vats (apparently brewing beer) up front.\n\nI would definitely come back.\n\nWheelchair accessibility notes:  There is no barrier at the entry, and there is ample space inside to accommodate a wheelchair.  The ladies room had a very large wheelchair stall, with more grab bars than average and a private sink.", "author": "Meg S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "Thronged on a Friday night; not sure about Saturday. Downtown Brooklyn is a govt/commercial hub; can be dead on weekends. My point is: I wouldn't make a special trip for this unless I was already in the area. \n\nOh well. Once inside, it is pleasant enough. Clean, sparkling, spacious, well-lit. Vaguely Norwegian in theme; lots of blonde wood. Reminiscent of an IKEA. Unusual arrangement of tables into rectangular 'nooks' best suited for groups of co-workers enjoying their staff happy-hour. Much noise, hubbub, and chatter. Music: can't recall details but surely something bland, some kind of watered-down alt-rock off Pandora. Made no impression on me.\n\nThe brewing apparatus is quite a sight. Beers are the main focus, naturally enough. Emphasis on IPA, unfortunately. Service: enthusiastic if not all that seasoned / experienced. On the other hand, how much skill does it take to draw a beer and place it in front of a customer? They handle this fine and they don't forget to smile. That's the most important thing. I detected no snootiness or attitude. Staff were cheerful.\n\nProbably more problems--more 'tood'--among the slouchy, snide, conformist, corporate-kid clientele. Zero personality in this crowd. The usual aimless, drifting, urban plankton were present. Predictable; half-hearted, exhausted fashion statements like bushy lumberjack beards on the scruffy man-children and ubiquitous tattoos and nose-rings on the pasty-pale baby-fat daddy's girls. Seen it all so many times before.\n\nDidn't try either the house beer or house food. A big reason why? Price. Much too elevated. Beers for $8-$9-$10-$11 dollars. It's understandable --property tax for restaurants is outrageous, and that means high drink prices. But this translates into a 'short stay' for drinkers like myself who swill down booze for hour after hour after hour. I can't do that here; there's simply not enough magnetism, enough ambience or enough draw. \n\nThat's my overall impression: this place is not going to last all that long in my memory. It's just too forgettable. Nothing particularly wrong with it; but nothing really unique. Feels like it's 'cut from a template'. \n\nI applaud the owners for this start-up; (it makes financial sense with 4,000 new rental units springing up nearby) but I can't find too much more to praise. I wish them well and hope they stick around! Nice place to drop in for a few moments.", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-28", "description": "The sour beer was good, but my clam pie was extremely gritty which was a bummer! Pizza should never be that crunchy. The vibe seems great for after work drinks, but I really wish the food was better. The ricotta was passable but definitely not creamy enough, and the fettuccine was good, but the portion was tiny for the price ($17!). \n\nWill give it another shot, but will probably stick to apps, or just do drinks and get food at Dekalb Market which is close by!", "author": "Sabeena T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-01", "description": "I really tried to like this place, but the food is just god awful. \n\nI have been coming here for trivia on Monday's, the bartenders are great and they have great beer. However, every time I have ordered food it has resulted in overpriced charred garbage. One time we ordered Brussels sprouts and they were so burnt it was literally just burnt black leaves. I felt like I was eating the remnants of a fire pit. decided to give it one last shot last night and ordered a margarita pizza. After waiting 45 minutes for the pizza it came out essentially as sauced bread with small globs of cheese. I asked my server if they ran out of cheese in the back and they just laughed. This small pizza costs $16, and there was literally no cheese. \n\nTelling them doesn't do much, if they even take it back they still charge you and it takes forever to get a replacement meal.", "author": "Danielle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Hidden gem in one of the weirdest locations. This new brewery just opened in downtown Brooklyn and sticks out like a sore eye. If you want a trendy vibe that isn't pretentious, come grab a beer here!\n\nA few friends and I just dropped by for drinks. It wasn't crowded on a Friday night which is great to catch up with friends or bring a cozy date. The beers were reasonably priced at $7-$8/each. My only quip is the waitresses were a bit negligent at service but I don't expect much from a bar.\n\nI'll definitely come again!", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "What a treat this place is. Great vibe, music, food and choices of beer. So excited to have this awesome spot in our neighborhood. We had the pilsner which has the perfect qualities: Crisp, light yet flavorful. We started with the Boys Got Heat and beets.", "author": "Sara I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Planned a trip to NYC midweek (also during the bomb cyclone) and didn't realize Brooklyn Brewery would be closed. Ending up being a blessing because we found Circa. Went twice during our stay. The staff was awesome, especially Nikki! The beer is great and they have a really good cocktail program as well. We did not try any of the food unfortunately because it looked awesome, but got some killer dinner recommendations from some of the regulars that were there when we were. Highly recommend if you are in the area!", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-31", "description": "Best dish: Mac and cheese was to die for, but at $15.00 WAY too expensive for the very small portion. Add another portion, you are golden!\n\nWe tried a couple pizzas and they were pretty tasty. Again, far too expensive, but I would get them again, so I guess it's all relative. Props on having super fresh crushed red pepper at the table, AND a chili infused olive oil handy.\n\nThe interior is beautiful! Love the decor. I live nearby, so this will be a good place for a beer............when they actually have a full list. IDK, call yourself a Brewing Co., and I think you should have more than 4 beers on tap. Subpar. \n\nOK, so I have to cut them slack as this is their first week open...BUT, the service * currently* sucks. Big time. No plates? wait 20 min. for them. No silverware? Another 20 min. One pizza? ok, we ordered 2 and I would hate to wait another hour for the second ( did not happen, but it was another 10 min. wait). They will get better, I can feel it, but they need to train their staff. Our waiter was fairly clueless....so much so that he charged my debit card $104.00 for our meal when it was ctuially only $60. It got fixed, but really, ya need to be on your game when swipping people's cards. Not cool. \n\nHaving said all that, I'll be back in a couple months to see if they have worked out their food timing and staff issues.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Awesome pizza! Love the sauce. \nGreat happy hour deal!  Sweet attentive bar staff, will def be back.", "author": "Emmakate G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-04", "description": "Decided to try a new place - cool atmosphere though a tad bit loud; huge place - they even have a game table (shuffle board I think). Staff - super friendly and nice! Drinks are good, good beer. Now the food on the other hand  sad to say - disappointing. Steak tartar was completely overwhelmed by the mustardy caper sauce (super salty), clams were nothing special, as was the sausage (had an odd flavor from one of the herbs), burger was ok - loved the fries (really the only thing); and the pizza ... I think it'd be ok if it wasn't so burned, that just kinda overwhelmed and overpowered the rest of the flavors. Oh and all of that - not that's cheap  Otherwise - great place to chill and have a few beers!", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-01", "description": "So i've been to this spot a few times and I've had the same overall experience which is good and bad.  The beer is excellent. Great selection, good value.  Can't say enough good things about the beer.  I also got a flight this time and it was good value and glass size even for \na sampler. On the other hand, I have felt the pizza was underwhelming.  The first time I got the margherita pizza and felt it was average and overpriced.  The second time I got the clam pizza and it was honestly one of the worst pizzas I've ever had.  This is because it was not really pizza.  It was more like toasted flatbread with no cheese, no sauce and a small amount of clams on top.  And this was the most expensive pizza on the menu at $22. We said this to the waitress who to her and the the restaurant's credit immediately took it back (i felt so guilty about sending something back--i have rarely done that in my life) with no charge.  So, i'd say go for the beer, enjoy the pizza but do not expect it to be on the same level as the beer.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "well it's me \u0026 my daughter's first time here we order a drink we know so cool ummm. atmosphere is cool and we are enjoying our experience!!!", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Have been here twice. Each time: solid beer, delicious food and genuinely friendly service. Hawaiian pizza was a stand out. The fries are wonderful too. We'll be back.", "author": "Corinna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Was looking for some pizza and craft beer, and this place had both. The IPA was nicely balanced, and my spicy sausage and pepper pizza was perfect. The size was right, the crust was both thin and tasty, and the toppings were well balanced. If you want pizza and beer, you'd be hard pressed to do better.", "author": "Clark Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "We had a great dinner here. My husband had beer brewed at this restaurant and said it was very good . We shared the meat /cheese appetizer. Also very very good. My husband had the pizza that he enjoyed and I had steak. It was cooked perfectly, and had \"jane sauce\" that was a little spicy and sweet . Perfect addition to the steak. The rosemary fries had great flavor. \nOur waitress was so nice.Very welcoming...gave us plenty of time to make out choices.She came by the table often throughout the meal to make sure we had everything we needed. She was pleasant and relaxed.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "I would definitely NOT recommend this restaurant. The environment was nice and clean. However the prices are insane. I spent $78 for 2 people to get a 4 beers(2 each) and 2 pizzas to share. We got the clam down and the salumi. Both pizzas were essential tortillas with a VERY small amount of cheese and toppings. The clam down literally had 4 clam on the entire pizza and the Salumi had 2 pieces of sopressata. This place is a joke and idk who in there right mind would go back a second time. I can see a lot of people being fooled by the appealing look of the pizza but please try and realize your paying $19 for tortillas(very thin crust) small sprinkling of cheese and essentially no toppings. Smarten up people. \n\n*3 stars only bc of the environment", "author": "Ken N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "We had no idea they had just opened Wednesday! \nWe loved the pizza!!! Matterial gor choke (?)- artichoke pizza was over by 10:30. We got the salumi and Boys got heat... \nI loved the decor and drinks were good as well :D", "author": "Bahar P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "It's perfect place for lazy breakfast with extra glass of fresh brewery. Roomy outdoor space and great wife doors in main room. Recommend for slow afternoon.", "author": "Artem E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "LOVE THIS PLACE! \n\nAmazing beer selection and knowledge. Food is ON POINT. Kid friendly, fun \u0026 spacious. \n\nGreat for groups.\n\nIts in a bit of an odd area but don't let that turn you off.", "author": "Dee L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}