{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Kate's service was awesome, very accommodating and friendly. A great spot for some local beer, decent eats, etc.", "author": "Kyle A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "I am from Hawaii and was excited to try out a new pizza spot. Had the Hawaiian pizza which was burnt on the bottom and probably the worst I ever had. Why waste edible flowers on something that really doesn't add much to the dish? We had a glass of wine and beer, the wine pour was laughable as well as it wasn't a full glass (am I missing something here?) perhaps it was an off day, but will be back when kinks are in order.", "author": "C K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "If you like (or like me love) craft beer this is the place to go. Coming from San Diego this place was just as good if not better than San Diego beer. They're a full service bar and restaurant. Food was bomb. Had the shroom pizza. If toppings look good to you recommend it.\n\nMain brewer makes great beer of every style and is very friendly and knowledgeable.\n\nWould definitely come back here anytime I'm in Brooklyn.", "author": "David S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Circa is a fun place for a night out, however I was disappointed they didn't have any happy hour specials when we went at 5:30. It's a cool industrial atmosphere where you can see the brewing vats. They only have house beers, but they were good about making recommendations when my friend was looking for something close to a blue moon. The beer I had was good, honestly nothing that special, but good. The beer was pretty expensive, but that's probably because it's local and small batch. The pizza was also expensive--$19 for a 12\" pie. I got the sweet potato pizza and it was good, but it should have been called the pesto pizza as that was the overwhelming flavor and there was very little sweet potato actually on there. There was also strangely a lot of greens on top, but it was pretty tasty. My friend got the margarita pizza and complained that there wasn't much cheese on there. The thin crust of the pizza was very light and airy so the pizza wasn't very filling, which was a little disappointing for the price as I did leave still semi hungry.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "If my review was based just off of the servers It would truly be a 2.5. They are the worst and today the server with the blue hair actually ruined our meal. She was unfriendly, uninterested and said maybe 4 words the entire time. (bussers and hostess were great)\nOkay, so on to the food: finally came back for a second time after first coming during the soft opening. Similar to other reviewers, many of the beers that we wanted to try were grayed out and not available the first time. The IPA we had was fine. The food was phenomenal, we had the clam pizza, the salami pizza, the ricotta app and It was all so good. The service was meh. \nSecond visit was for brunch, the pizza once again was so yum. We ordered the lox pizza and bacon\u0026egg pizza, so filling.\nIt's really awesome having Circa in the neighborhood and will return in hopes that the service gets better.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "What could possibly be a better combo than beer and pizza?  \n\nHow about fancy beer and gourmet pizza?! Add to that a clean, modern look that incorporates the industrial beauty of the brewing equipment with the quaint charm of a backyard patio* (with the comfort of air conditioning) and you have a recipe for a good, effing time!\n\nI found this location when looking for a location to host a company event.  Working with Sarah and Audrey was a pleasure - they were both very helpful, polite and quick to respond.  The restaurant is new so there were some small snares but nothing that they weren't willing to talk through!\n\nWe ended up getting a reserved space under the string lights which was nice and tucked away, allowing us to chat and enjoy our beer and pizza in relative privacy in the midst of a crowded restaurant.  The service was fantastic!  Our server Rachel was definitely overwhelmed by 30 thirsty people all showing up ordering drinks and food but she and her team quickly and calmly took care of all of us.  I know there was some confusion with drink delivery when everyone is mingling but nothing she couldn't fix!  (thanks everyone!)\n\nEveryone was really happy with both food, beer, cocktails, service, and the location!  Thanks, Circa for making me look like a hero!\n\nOther great things about Circa:\n\n- Shuffleboard table.  Perfect for those that want to do something active while holding a drink.\n- Ventilation system.  You would never guess they had 2 raging wood-burning ovens and an open grill to make the delicious food with.  No lingering restaurant smell!\n- On-premise brewing. You actually see where your beer is made!  The casks in the upper rafters of the brewing are an indication of the coming cask-aged beers in the future. Yippee!\n- Location.  Close to trains but in an area that was in real need of some fun locations.  Glad to have this addition to the hood!\n\n--------\n* There's also a gorgeous bar.  The blue bar seats are both comfortable and remind me of the interior of a restored classic car.  Good job, designer!", "author": "Margaret T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Stopped in on a quiet Monday night and the vibe was relaxed and friendly. The bartender was super nice. the 4 cheese pizza was really delicious and cocktails were quite good. Lots of people playing bar trivia in groups. Will be back!", "author": "D K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Very good beer. The pizza looks delicious but I didn't order any since they only serve a whole pie. I plan to come back and try with a larger appetite. There was space at the bar during the World Cup games and they have lots of big screens. Definitely a nice place if you're into sports.", "author": "Frank K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "First, Circa apparently had divine inspiration when designing the interior because I didn't even know bar seats could be this comfortable. I will forever think of these seats as I sit at every other bar for the rest of my life.\n\nTucked away on a block you probably wouldn't expect, Circa opens up into a high-ceiling, industrial-chic brewery/bar/restaurant that instantly makes you feel at home and relaxed. I am a huge fan of their super-simple beer listing - the type/flavor in huge letters on the wall and the price. All too often breweries have a habit of writing their fun, but uninformative, beer names in tiny handwriting on chalkboards that you have to be standing against the bar to read.\n\nWhile we didn't eat, we had the stout, the peach, and the Belgian tripel, which were all pretty solid and priced (I think $6-8). These weren't anything super unique or off-the-wall, but the stout was one of the better I've had in a while (and it had a perfect pour!)\n\nThe table shuffleboard is also a fun addition and the TVs playing sports surprisingly did not detract from the atmosphere at all. Couple this with the nice, attentive staff, and it was a really nice afternoon at Circa. I'm interested to come back and try their pizza as it smelled pretty great.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Came for lunch, owner and brewmaster explained all the brews and the pizza was as great!", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "Love this brewery. Great beers with a fantastic variety. But if that's not what you're goin for that night, very good wine and spirits menu. Pizza is V Good (get the Clam Down). Ask for Kate!! Awesome server, fr!", "author": "Greg H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "I was the first person to review Circa but apparently the bots over at Yelp headquarters believe that I was invited to a special event and therefore my review is not valid. I'm not sure why Yelp hasn't figured out that restaurants often have soft-openings before their grand openings and that these are valid dining experiences. It wasn't free. It wasn't comped and it wasn't by invite only.\n\n----------------------------------------\n\nMY ORIGINAL REVIEW:\n\nWas eagerly awaiting the opening of this new brewery. I managed to make their community night soft-opening and couldn't be more excited to welcome them to the neighborhood. \n\nThe staff is incredibly friendly, personable and organized. The decor is gorgeous, that industrial modern look that makes you wonder where the brewery ends and the bar begins. I was so impressed with how well they use the space, which is massive, to say the least. Circa manages to feel like a bar, first and foremost, but also has incredible assortment of seating, including a back long table that looks to seat 20 or so. There are booths, 2-tops and everything in between yet it doesn't feel overwhelming and still feels like a brewery/bar.\n\nOn top of all of that, the food is wonderful, the drinks are wonderful, the beer (at least the IPA I tried), wonderful. I was expecting primarily a pizza-focused menu but boy was I wrong, Circa offers a full menu of small plates, pizza and entrees. I tried the salumi pizza, steak tartare and little gems salad, all were light, perfectly cooked/prepared and nicely seasoned. Really lovely food here. \n\nWelcome to the neighborhood, Circa! Keep up the great start!", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "Friendly staff, good beer, tempting casks ready to be tapped.  Mushroom pizza was tasty.  Lots of room for big groups, yet cozy bar environment.", "author": "Denver N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-08", "description": "I was really looking forward to checking out Circa - but I was totally disappointed by my experience there. The beers (I got a flight of four) were all solidly mediocre, none of them better than what you could get for much less from Sierra Nevada or a similar nationality distributed brewery. The nitro pale ale was particularly weak, with a decent creamy head but absolutely no flavor in the beer itself. Well, at least it didn't taste bad. The nitro stout was similarly lackluster; a canned Guinness is better. The two IPAs I tried were also very average. Also, the beers in the $16 flight were 8 oz each, which is awfully large for a flight. On to the pizza. There were only 5 options, one of which was a margherita and one of which was vegan. There's no option to add toppings. I got the vegan one and asked the kitchen to add whatever cheese they thought would be best....which apparently translated to an imperceptible amount of manchego cheese on a pie with roasted sweet potatoes, pesto, baby radicchio leaves (which were supposed to be adult grilled leaves), and sweet drop peppers. The pizza was actually good, but it wasn't really what was listed on the menu and the kitchen was awfully stingy with the cheese I had asked for. But probably the worst part of this meal was the abysmally slow service. The room was nearly full but it seemed like only two people were working. It took forever to get my beer, food, and check. And one of the servers treated me like I had never eaten in a restaurant before. \n\nThis place could be great but it needs way more work!", "author": "Roopa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "Umm...many reviews say something like \"pizza and beer\" is a no-brainer pairing...but honestly, there are exactly zero places like this in the rest of the borough. A brewpub with fresh, excellent brick oven pizzas? It's a great idea, and one that seems Circa has nailed. It's a bit strange to be in this huge a space in NYC, and the overall decor has a bit of a manufactured, mainstream-ized hipster vibe I would expect in some place like Hoboken, but I thought the execution was pretty good. The only problem I had is the prices, which seem 20% higher than they should be.", "author": "Judd S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-29", "description": "Circa Brewing is fairly new so there are some things they are still figuring out, but if/when they do you can expect this place to be packed to the gills and a go-to spot.  The biggest improvement here IMHO would be able to be made in their hospitality program.  One thing they 100% already have figured out is the beer - I had 2 beers that were very refreshing and that alone is enough to keep me coming back.  If you see me there feel free to send over a Saison!", "author": "Joe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Good food, attentive service, and nice collection of craft Belgian ales (would've loved the inclusion of a Tripel) all in an aesthetically pleasing and bustling environment. A nice addition to the neighborhood!", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Man, this place is awesome. It's not often that you find a place that brews great beer and doesn't sacrifice the quality of the food. I've never had a bad beer here, and I've tried a bunch. Great IPAs, but I LOVE that they usually have at least one ale on nitro in addition to a nitro stout. They rotate new beers in all the time, so it's worth a regular visit.\n\nAs for the food, it's all good. The salumi pizza might be my favorite, but everyone seem to love the burger too. Even the salad is tasty.\n\nThe space is really stunning and unlike most restaurants and bars in Brooklyn/NYC it's really spacious.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Came here for drinks and a quick bite. Place is really big with a nice casual ambiance. There's a shuffle board table. Our group of 4 ordered the pizza with sopresseta, bowl of grains, and fries to split. Everything was delicious. Service was friendly. Would definitely recommend.", "author": "Mary K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Came here Thursday night for a nice dinner and was not disappointed. The place was busy but we were seated and served quickly.\nThe waitress was attentive and very pleasant.\nWe shared puffed bread with a ricotta spread, a carafe of Cabernet, pizza and a cheese burger. \nEverything was delicious.", "author": "Nikki H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}