{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "Stopped in this new place in Downtown Brooklyn for a tasty pilsner. The menu isn't long, but it has some really intereting items. I enjoyed the radish and romaine salad. It was like a Ceasar salad with a twist. Nice staff and comfortable environment.", "author": "J. C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "Okay but kinda expensive. At least all of the alcohol is freshly brewed. The place is too big. The bartenders are not satisfied with tips and will demand more. It's kinda annoying.", "author": "James D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-12", "description": "Feel bad writing a negative review for a new restaurant, but hopefully they will take note and improve. I ordered an IPA and the head of the beer was half of the tulip glass. Seriously? We all know that is not cool; just pour a decent drink. Pizza was good but not much to it at all. Right after we finished waitress asked if we want another pizza. Again, seriously? Hopefully they don't continue to cut corners to shave a few bucks...", "author": "Todd N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "The beer here is excellent and the food is even better. The salad was next level and the pizza was one of the best I've had. Hannah, our server, was very nice and did a great job. We loved her! This place is up and coming - visit it now!", "author": "Ben C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Circa Brewing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJsXH1gQeIYfG2j7W8FYg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580055"}