{"aggregateRating": {"reviewCount": 88, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Great place!! Concise menu with many options and spot on flavors. Oven baked Salmon tikka and the Lamb Madras stand out as great signature dishes. Attentive and friendly service add another dimension to this casual but cozy place.Would like to see a bigger local beer selection though..Overall decent and superb dining experience. Welcome addition to the neighborhood..", "author": "Queens B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "I placed an order online for Chicken Tikka Masala.  When I arrived to pick up they had no idea the order had been placed.  They found the paperwork for the order and I received my food about five minutes later.  I have a feeling they gave me leftovers or food that had been sitting in the kitchen for hours because it's unlikely they could have prepared the food that quickly.  The chicken was dry and the sauce was watered down.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "I brought my sister and friends here who were visiting from out of town. We could not have enjoyed our experience more! The staff was friendly and attentive, and the food was wonderful. Loved the garlic naan! Everything we ordered was delicious. I look forward to my next visit!", "author": "Katie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "This place had great service and even better food they had great drinks and I liked that the servers were really nice and quick I would come here evory day if I could", "author": "Scott M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "So. Good. Highly recommended and will be back for that Baigan Bhurta and yellow Dal Tadka. Seriously, I could eat that dal forever. Also the Saag Paneer was very solid and the spinach tasted nice and fresh. The garlic naan was ridiculously flavorful (but not too much garlic - if there is such a thing). \n\nStaff was super sweet. Food was prompt. BYOB with no corkage fee, and full bar is in the works.", "author": "Marian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "AMAZING food. I am super, super picky when it comes to indian food (most places are too sweet), and this place is my new fav. My boyfriend has claimed to not like indian food (madness) and he loved his meal, the Kerala Shrimp. I had the Lamb Dhaniwal. Our server asked if we wanted our meals mild, medium, or hot, we both chose medium. This area is a bit underserved when it comes to indian food, so happy to have Indian Table in the neighborhood!!\n\nP.S. - Serving portions were perfect, we both left very full after each having 1 entree each and splitting a naan.", "author": "Valerie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Probably some of the best Indian food in NYC. Chicken Malai tasted fresh and was cooked perfectly. Dal and Chicken Tikka masala were flavorful, as was the saag paneer. Naan was outstanding. \n\nDefinitely visiting again.", "author": "Aatish P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Definitely some of the best Indian I've had in Brooklyn. A very needed addition to the neighborhood. We had the yellow Dal Tadka, Saag Paneer, and Baigan Bhurta (smokey eggplant dish). All were very flavorful and tasty. Definitely recommend checking it out.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "This is the first time I've eaten here and the food is great the atmosphere is clean and modern. It is a great restaurant and I will definitely add this to my regular repertoire.", "author": "Rich Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Finally, finally!!!!  Last Sunday, my friend's and I were bemoaning the dearth of good Indian restaurants in Bklyn and Manhattan.  Serendipity...Indian Table opened that evening. It's fabulous--authentic and subtle. The owner is very kind. Try the tandoori lamb chops.  Tony from Windsor Terrace.", "author": "Tony F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "This was our first time here! The service was excellent and the food was great.  We highly recommend the lamb vindaloo , the eggplant appetizer, and the garlicky spinach. We will definitely come back with friends.", "author": "Catherine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Awesome, flavorful food. Excellent customer sevice. The staff remember you and caters to you. Has great vegetarian options, as well as non-vegetarian choices. We truly love this place!", "author": "Sheila R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Really great food - fresh and well prepared. Usually on the quieter side when we go (between 5pm and 6pm), but they are super accommodating to our 2yo son, bringing him straws and mango lassi, and just generally being really nice to him. Definitely one of the easier places to eat with a small child in the neighborhood, and delicious food as well.", "author": "Christopher F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Mystifyingly, in a neighborhood with virtually every type of cuisine offered, Cobble Hill was sorely lacking a quality Indian establishment. Indian Table appears to fill the void. Friendly professional service, handsome interior and solid food hit the spot nicely. No wine available for now, but there is a wine shop directly across the street and byob is allowed.", "author": "Barry P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "I think this might be the best Indian in the neighborhood. The Chana masala was delicious, we also tried the baingan bhurta, which was very flavorful.  No complaints, probably will become our new go-to for Indian.", "author": "Scott E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Lamb vindaloo is excellent. Decent prices and good sized portions. An interesting addition to the neighborhood.", "author": "Q C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Not an expert on Indian cuisine by any means, but the lack of a decent Indian restaurant in the neighborhood has been disappointing. Our experience with Indian Table has been nothing but positive in the several times we've been there. The food has always been excellent as well as the service. The Tandori Cornish Hen was simply delightful - perfectly seasoned and mouth-wateringly delicious. The Sag Paneer and Chicken Tikka Masala also count as favorites here. I would also recommend the garlic Naan. I'm not sure why others had less pleasant experiences, but as another Yelper indicated, perhaps growing pains as the restaurant learns the patterns of the neighborhood. From my view, it's a welcome addition to Cobble Hill and Court Street, and I definitely look forward to going back again.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Finally, delicious authentic Indian food comes to Cobble Hill! I had paneer stir fry, vegetable pilau, mango lassi, and vegetable korma. Everything tasted fresh and delicious. We will be back.", "author": "Aqua W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Indian table is a great dine-in Indian restaurant (which is hard to find). Nice appetizers and classic Indian dishes. The lamb dishes are exceptional. Nicely decorated restaurant with friendly staff. My family is always given the private back room which is nice.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Good food! The eggplant, veg korma and beet croquettes were delicious! Loved the light, flavorful mango mousse. Lots of vegetarian options. BYO and no corkage fee. Pleasant service. Will go back.", "author": "Christine C."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Indian Table", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "234 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/t37InPJ-RY1y6oum2YFzMA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893882"}