{"aggregateRating": {"reviewCount": 88, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "Torn with the rating but would like to see some changes. This place is cute and convenient with a party room that looks like it seats about 14-15 guests. We had the beet croquette which was surprisingly delicious and the garlic naan which is probably one of the best I've ever had. Mango lassi on point too. Now for the main courses (most important) we were a bit disappointed. Chicken tikka masala should be top notch at 'indian table' BUT the chicken cubes are dumped in the sauce per order so the chicken was not as tender and moist as it could be and didn't come with full flavor (so I was told because I'm a vegetarian). I ordered the vegetable Korma and the sauce was delicious but still couldn't mask the bland taste of the FROZEN VEGETABLES!!!! Frozen green beans, frozen carrots, frozen zucchini and frozen cauliflower :( I think from Trader Joes, haha! For an Indian restaurant they should pay a lot more attention to their vegetable dishes I would say (thinking emoji). Vegetables were bland and not marinated, grilled or sauteed before added to the 'stew'. Very lazy approach to indian cuisine in a restaurant setting. Which brings me to: what exactly took so long to get our order? Would love to see some changes made and wow I feel sorry for those that think this was authentic.", "author": "A E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "This was our second visit. Cobble Hill had lost a couple of decent Indian restaurants on Smith Street over the past few years, so we were eagerly awaiting the opening of Indian Table. So far, we are very pleased. I would say this is the best Indian restaurant in bococa or in all of brownstone Brooklyn. We really hope it succeeds. My husband is Bengali and I consider myself to have a pretty discriminating palate, having visited Indian many times over nearly forty years. We have tried several chicken dishes, a sag paneer, and a biryani and liked them all.", "author": "Rajat M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "Very Disappointing food. Kerala shrimp consisted of exactly five medium size shrimp in a watery sauce. Similarly chicken zoffrani was composed of tasteless chunks of chicken in an anemic broth. The chicken biryani however was very tasty: nicely seasoned and generous serving size. Perhaps just poor choices on our part, but I am unlikely to try it again. A shame; the neighborhood could use a good Indian restaurant.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Really enjoyed this upscale \"northern Indian\" restaurant. Excellent ambiance and incredibly delicious dishes created a really enjoyable meal. BYOB makes it even more fun and leaves room for more food vs bar bill.", "author": "David K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "I'm by no means an Indian food snob, but I'd been consistently very disappointed by the Indian food options in this neighborhood until I ordered Indian Table tonight! I got the chicken tikka masala, sag paneer, dal, fried okra (really good), and naan - all were great. Very excited to have a good Indian place in the hood!!", "author": "Tara R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "I have been there twice now and it is delicious! I would highly recommend the tandoori salmon( so moist) and the small whole eggplant dish. I was recently in India and this food is far better than anything we ate there!  Also.. love the byob- not sure if it will last but always nice to save money on drinks", "author": "Shelley K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Finally, an awesome Indian place in the 'hood. Some of the other reviews are dinging the place for the service - and I get it, if you make a ressie and end up waiting, that could be super annoying. When we came here, the service was a bit rough, but in an endearing, real-person, non-heirarchical sort of way. Honestly, I think it's a testament to how TASTY their food is, and how confident they are about it. When we asked for recommendations and suggested something, the waiter actually said, well if you like vegetarian stuff that tastes like nothing (!), sure. And then pointed us to some other things... I appreciated this honesty, and we had an amazing meal (and are super picky eaters). But I have a feeling even the dish that didn't pass his test would have been good. Can't wait to go back, and will become regulars ordering in for this fresh, healthy-tasting, non-greasy, flavorful food that makes you feel like you are eating a home-cooked meal by someone who cares.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "Mediocre Indian food at best.  Very stereo typical NYC Indian menu, nothing new.  Preparation was  equally pedestrian.  Prices seemed high for what they offer.   Why can't we get a good Indian restaurant in our neighborhood?", "author": "John S."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Indian Table", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "234 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/t37InPJ-RY1y6oum2YFzMA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893882"}