{"aggregateRating": {"reviewCount": 88, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "Some of the best Indian food not just in the neighborhood, but the whole city!\n\nI have long contested that Indian food is my favorite, but the truth is, it's been a long, long time since I've had the sort of spectacular Indian meal that made me love it in the first place.\n\nToo often, I'm faced with a bowl of overly sweet, watered down Chicken Tikka Masala that's got more sauce than meat...fatty, gristly lamb...under-spiced vegetables...\n\nHere, you'll find big, clean chunks of meat, deeply flavorful vegetables and black dal that will change everything you thought you knew about lentils.\n\nLook no further, this is your new go-to Indian spot.", "author": "Ash A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-15", "description": "I came here with my boyfriend as we were both in the mood for Indian food and this was the closest restaurant from his house.\n\nWe were greeted warmly and seated quickly inside.\nThe interior of the restaurant was clean and modern with soft instrumental background music that was never overpowering.\n\nWhat we ordered:\n- Nalli rogan josh (3.5/5): This was a large lamb shank that was blanketed in a spiced tomato and caramelized onion curry. The lamb was super tender and not game-y, but was a bit too salty (didn't stop us from polishing it off).\n- Saag paneer (5/5): This was a surprisingly vibrant shade of green which made me think they pureed fresh spinach and mixed it in with the finished dish. I'm used to seeing saag paneer that's more of a watery green/brown color, but this tasted really fresh, healthy, and almost fluffy. \n- Side of spicy okra (3/5): I was never a huge okra fan so I can't judge this fairly. My boyfriend loves okra and was pleased with this dish.\n- Rosemary naan (4/5): Naan is delicious, but the rosemary flavor in this wasn't as pronounced as I had hoped. I feel like kneading in pieces of rosemary into the dough would add more flavor.\n- Garlic naan (5/5): Garlic is king. Would be delicious to combine rosemary and naan together.\n\nOverall, I really enjoyed having dinner here! Having two entrees, one side, and two naans (each order comes with four pieces) was perfect for two people and I would definitely come back for the saag paneer and garlic naan.", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-14", "description": "Homey neighborhood Indian place, on par with Curry Hill in Manhattan but miles from the best I've ever had.  Decor is cute (the muzak is ridiculously bad but kind of fun and soothing) and the staff are friendly. It almost feels like going to your friends' house and getting a home-cooked meal from their parents.\n\nThat said, the food is good but not great. The menu is unfocused with a lot of options, but most are standard Indian fare and not any different from any other decent Indian place in the city. The server recommended Rogan Josh, which featured a nicely braised goat shank in a cardamom-spiced tomato curry, which would have been lovely except that it was oversalted. Palak paneer was a pleasingly bright green with flavorful cheese chunks and was probably my favorite dish, and seemed to be pretty healthy as it was not overpowered with cream.  The okra side was also in a tomato-based curry and also nice, if you enjoy okra.  \n\nGarlic naan came out hot and soft with plenty of garlic; I also ordered the rosemary roti which was much less flavorful.  \n\nIt's the best choice for Indian food in this neck of the woods by a long shot and it's reasonably priced, so I'll likely be back for more.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "I never write reviews but after eating here I felt compelled ! I had heard great things about Indian Table so we decided to give it a try .\nI am happy to report that it was an A-plus experience. I wanted an ice tea and although it was on the menu the owner made it for me specially and added fine fabulous Indian spices.\nWe ordered the Tandoori chicken and I have to say it was the juiciest most flavorful I had ever had.\nThe mushroom rice and rosemary naan were just so yummy. I have family coming in June and I can't wait to come here again. The bill for 3 of us was $61.00 and we had plenty of food to go around", "author": "sharon b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "My friends and I dined in at Indian Table a few weeks ago. It's situated in the very trendy area of Cobble Hill and can be a nightmare for parking if you're not lucky, but is worth the struggle. We had been wanting to try this place for a while and we were not disappointed!\n\nThe inside is cozy, not tiny, but not very large. The decor is nice, the space is clean, and the service is friendly. The whole inside smells of amazing spices, it's great. We ordered a bottle of wine, two starters, and four entrees. Everything was tasty! Very flavorful and filling. We left very satisfied and will definitely be back at some point. \n\nHead's up: the only alcohol they serve is wine...and it ain't cheap, folks. Personal tip? Eat in, drink out.", "author": "Jordan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "On a recent visit to Brooklyn in late October, my brother \u0026 sister and my wife were wandering down Court Street looking for a place to dine. Luckily enough we were right next to Indian Table so we wandered in - boy was that a good decision.\nAs other reviewers noted, the restaurant décor is not exactly a standout - I would say it's pretty spartan. The wait staff was good though, attentive and polite. The outstanding element was the food. We did some plate sharing so we had the Cauliflower Pea Subzi, Tandoori Chicken, Lamb Vindaloo, a variety of Naan and one other plate that escapes my memory doh!) and all were really good - excellent flavors, not too spicy and enough food to keep us very satisfied. On top of that, the meal cost wasn't too bad, even with a couple of drinks.\n\nAll in all, it was a really nice meal - definitely on the list to head back to on a future return to Brooklyn!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Great neighborhood find. From the food to staff! Truly authentic Indian food. Will definitely become our regular spot.", "author": "Luisa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-04", "description": "Indian Table had a nice atmosphere (a nice mix of modern, historic and Indian decor). Food was also on point. We had the garlic naan bread, a side of yellow daal, and a vegeterian dish of mixed vegetables that came with Jasmine rice- I can't remember the exact name of it. It turned out to be plenty of food for two girls (we even got a lunch out of the leftovers). They had a nice selection of wines- didn't see a cocktail menu. Service was a mixed bag; one server was very polite, but then forgot to bring the check when asked, others were all business (no pleasantries) but got the job done.", "author": "Aly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-07", "description": "I had dinner here Saturday night, my first time eating at an Indian restaurant. We ordered chicken zaffrani and Chana masala. Both were out of this world good, like I want to come back and have this exact dinner every week. Came with a good size side of rice and we ordered rosemary naan. The inside of the restaurant was lovely. We left feeling happy and full!", "author": "Samantha W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "The food here is AMAZING! While a little more pricey then other Indian places, it's definitely worth it! The place is very cute and welcoming, but I usually get take out (which is super fast and easy.) I will always recommend this place.", "author": "Carly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "My husband and I go here every Friday.  This is not your typical neighborhood Indian/Pakistani restaurant. The food is creative and well crafted and really works hard to make sure you have a good meal.\nI love this restaurant. I wasn't an Indian Food person until I came here.\n\nIt can also be a very healthy option. We don't eat rice or nan and the chef always recommends ways to make this more filing--usually by adding veggies to meat dishes.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Indian Table is located in a very trendy part of Brooklyn with lots of restaurant options around, but I am very happy that we stumbled upon it after exploring the area. The interior is not very large, but is welcoming and cozy. \n\nFood: Large selection of entrees, decently priced drinks and friendly staff that's happy to make suggestions. Spicy calamari appetizer (waiter's suggestion), lamb curry, saffron rice and garlic naan with a bottle of red wine were all great and more than enough food for two people to share. \n\nService: Our waiter was very attentive and even told us about a way of getting a discount with our next order. Indian Table also offers free delivery, which must be really great on a cold winter night in New York.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-18", "description": "This is perfectly solid Indian food but I confess that I am a bit puzzled at the standout ratings. I think the place is very good but it's a neighborhood joint at best and by no means worth a trip, as the 4.5 might indicate.\n\nSpecifically, the food is only slightly above average (and the menu can be a chore to navigate as it is not always entirely up to date in terms of availability). It is competently made, fresh, tasty without being too heavy. In these respects, true, it is a notch above the many dime-a-dozen Indian takeout options in Brooklyn, and in this respect is worth the dine-in journey. Space could use some work to be more efficiently set up, service is ok, wine is very very reasonably priced which is a nice touch. \n\nOverall, a very solid Indian sit-down meal.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "This place completely caught me off guard! At first my family and I thought that it would be average food because no one was sitting down for lunch except for us. I was impressed with the interior and how clean everything was. All of the tables looked squeaky clean which was a plus for me. Our server had personality, and explained what we didn't know on the menu which was helpful! We didn't feel rushed and once we ordered our food was hot and FRESH without a long wait. Highly impressed with the taste as well and the over all experience!", "author": "Marisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "The restaurant was fantastic with great ambiance. Perfect spot for date night. Soft/elegant jazz was playing the whole time with candles on the table and it seems that they have a good selection of wine. It was my first time - I did not come for a date but just randomly walked in with a group of friends. All the dishes we ordered were very good, with great service and welcomes from both the manager and the waitress. The lamb meat was especially fresh and tasty! Prices were very reasonable compared to the quality of food and service we were receiving. One of our friends did not order anything and the restaurant manager later came out to offer her a samosa appertizer dish on the house - he was super sweet. I would highly recommend this place and would definitely visit again, not only because it deserves 5 stars in every attribute but also because the manager obviously care about his business and the customers! Wish I have taken some pictures - the place looks sparkly clean elegant and cozy", "author": "Phoebe P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "Food was great! Came here for dinner last week and was impressed. We asked the waiter to bring out his favorite dishes, one chicken, one lamb and one vegetarian. Everything came out delicious. Service was fast and the total bill was not too pricey (even with a bottle of wine). Only downside was We did ask for everything spicy and unfortunately it was not. Aside from that, I will definitely be back. Especially for the garlic bread. Yum!", "author": "Marina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "Accidentally found this place and my friends and I loved it. Great tasting food, nice portions, and very friendly service. I will be back soon. If you're looking for an excellent Indian food experience, go here! Thanks Indian Table.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-13", "description": "We were the only customers at the restaurant. The waiter was in the street and took 25 minutes to arrive, so the cook took our order. My dish took more than one hour to arrive. I had to ask for the check without it as I had to go. I suggest arriving 4 hours before the time you want to eat, or to bring a sandwich and camping gear so that you can handle the many hours of wait that will ensue.", "author": "Pablo H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-28", "description": "The food was very good. Above just your average Indian food, including the appetizer and reasonably priced. We had to go find our waiter for anything we wanted. This would be an ideal spot if you want to have a long intimate conversation with someone because it was not very crowded and I felt like we could have stayed there all day and the waiter wouldn't have cared.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Best Indian food in the neighborhood! The lamb vindaloo and saag paneer are incredible, and I've never had better yellow dal!", "author": "Karli S."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Indian Table", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "234 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/t37InPJ-RY1y6oum2YFzMA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893882"}