{"aggregateRating": {"reviewCount": 88, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "Best Indian in the neighborhood BY FAR! Also a lovely place to go and sit. Highly recommmend!!", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-22", "description": "Acceptable food, but this place is in need of some improvements. Hopefully they do, because having good Indian cuisine is a must in every neighborhood.\n\nTo my experience: Stopped in for a late lunch and the place was empty, which is a good thing and a bad thing. Good because it was quiet, bad because that meant they were about to close the kitchen for a break before dinner, so things were rushed and the food was probably prepared and sitting around all day.\n\nPrices here are on the high side for Indian cuisine, which would be fine if the portions were bigger, but to be honest it's not worth paying a premium for. Rice, overcooked vegetables, and chicken are not exactly expensive foods, no matter where you go. The pricing vs portions could definitely use some work.\n\nAnyway, looking beyond the prices, the food was spiced reasonably well for the typical American palate that doesn't understand spicy, which was a downside for me, but probably a positive for the locals, so at least it was flavorful. Having ordered the Chicken Tikka Masala, I guess I should have expected mild. Though the bigger issue I had, is that the chicken was dry and hard, probably relating to my first point about it being the end of service before their break. Old microwaved food is never a good thing.\n\nService wasn't great either, unfortunately. Being so empty one would assume more attention would be provided to the only table in there, though waiting for water was torture. Managed to get glasses filled while receiving the check... a subtle hint?\n\nAfter all this, I left with a stomach ache and felt crappy for the rest of the day. I'm going to point out that they opened with 110 points in rating violations and were left ungraded, according to the NYC Health website, so it's a bit troubling. At least they've got an A as of 5/03/17, though.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "I loved it. First time in a LOONG time I can say that I loved (!) everything that I ate at one of our neighborhood restaurants. Dal was spicy and nice. Roti great. Tandoori nice. Add some rice, beet croquetes and a cab wine and I was very happy. Pretty excited to write this.", "author": "Danny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Love the inventive Indian cuisine! They have an fried eggplant appetizer dish that is only available on takeout and is to die for! The service isn't amazing, but the food makes up for it. I ate okra on recommendation of the sever and it was the first time I liked it! I'd recommend Indian Table highly for anyone looking for more than the standard Indian fare.", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Easily the best Indian restaurant in the neighborhood. Indian food is my absolute favorite thing to eat and I'm pretty good at cooking it too, so I like to think I know what I'm talking about!\n\nOn many levels this place is on a par with Brick Lane Curry House. The only thing that lets it down is that its menu is somewhat limited and many of the dishes are very similar to each other. If ordering for a group my favorite option is to pair a Lamb Daniwal (or one of the Korma type dishes) with a Chicken Tikka and one of the spicier dishes (Vindaloo or Madras). Dishes come with rice and I generally order a garlic naan.\n\nThe in-restaurant dining experience is ok. No-thrills, but you're going there for the food! Pick-up is a good option and they're always quick at putting the order together within 20-30 minutes. \n\nOne of my favorite spots nearby, especially for a comfort food on a cold or hot day!", "author": "Stephen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Great space and friendly staff. The garlic naan was crispy and light. We enjoyed the vegetable korma, chicken tikka masala, and our hands down favorite, the lamb dhinawal. Definitely more than enough for two meals at the restaurant and leftovers. Very affordable as well.  We will be back.", "author": "Nancy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-24", "description": "Credit card fraud. Wow. I am so disappointed. I loved this restaurant. There was a middle-aged man who waited tables at lunch. He always greeted me so warmly. He remembered I loved the Kerala Shrimp. I wanted to support them and came as often as  I could. Then I returned Monday, and there was a different waiter. Long story short, I had the $12 lunch special. But they charged my credit card $39.05. I called yesterday and talked to that waiter. He said, Yes, I was there, I'm the spiky-haired guy. I told him about the overcharge and he said if I wanted to find my receipt and come in, he would be willing to fix it. Like he was doing me a favor! I told him I didn't have the receipt anymore. I told him I thought he was being rude. He hung up on me. So sad. Never again.", "author": "Erin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "I am proud to announce a good, authentic Indian restaurant is in the area. It seems to be very difficult to find an Indian restaurant that's delicious, kind staff, and offering some ambiance in this part of Brooklyn. The owner was personable, and kind. \n\nBe sure to check the times for when lunch hour ends. We made it there just in time but weren't rushed out. \n\nThe lamb saag was very tender. Chicken tikka masala had the right kick. Paratha was my absolute favorite. It was prepared very well. \n\nI will most definitely be back - making this my go to Indian restaurant in the area. The only set back is the price point. I suppose prices are higher due to location.", "author": "Alexia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "On a Wednesday nite in August we walked in with no reservation with ten people. We have eaten here many times. They accommodated us, didn't charge a corkage fee and we had a delightful and tasty meal. \n\nKevin, Vipan and Daniel are all about explaining the dishes, accommodating customers' food issues, and ensuring a lovely meal. \n\nMy only negative comment is that I think they need to lighten up the interior. I think they would get more foot traffic. \n\nBut go, you won't be disappointed.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "Let me start this review by saying generally, this food is delicious. This neighborhood has generally sub-par Indian food (not spicy, overpriced, catering to people who don't know Indian food) and this was a welcome change. I've ordered take out from here before and was very satisfied. I recently took friends to eat in the restaurant and was pleasantly surprised by the decor and ambiance. Our service started out well, the proprietor brought our fussy toddler a small mango lassi which he loved. The food we ordered was all quite tasty, and while still not as spicy as one would expect from truly authentic Indian food, it was satisfying and good portion size. As the evening went on however, the service slowed. It was VERY cold outside and being inside did not seem to protect us from the external temperature unfortunately. We asked for some warm water to drink and apparently that takes a long time to make. In the end, what was a strange and unfortunate end to an otherwise nice meal was the lack of dessert offerings and no chai or coffee. Have you ever heard of an Indian restaurant that doesn't have chai!? They had a spiced black tea, without milk, but seriously, I was baffled by the lack of chai. I won't say I wouldn't go back there, but I might wait for their menu to round out a little bit more", "author": "Nada H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "I like almost zero Indian dishes so if chicken vindayouknowwhattimeitis isn't on the menu I'm in trouble. The missus was in the market for some malai so we rolled dice. \n\nI asked our waiter if we could swap the sheep for the chickens and he basically threatened me with how spicy it would be.  I thought I was up for the challenge but I couldn't take the heat of that white meat.  I tapped out, but it was incredibly tasty.  \n\nThe other not so vindaloo dishes seemed acceptable so it was a solid experience.  I can basically toss paper planes at this place from mine so the convenience is genius.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Went when this place first opened and was a little disappointed in the lack of my vegetarian favorites. Decided to give it another chance last night and was BLOWN AWAY. Love their updated menu, and we were THRILLED with our meal. \n\nStarted with some eggplant chaat which was fried, but delightfully light and crispy. Not overly saturated with tamarind and yogurt, just the right amount to avoid being soggy. \n\nHusband got his fave vindaloo, which only came in lamb and they so graciously switched to Chicken at his request. I got my fave indian dish Malai Kofta- which was one of the best I have ever had. Amazing flavor, hearty and delicious veggie balls, rich chunky aromatic sauce, phenomenal. \n\nGreat naans, fluffy and chewy, garlic especially delicious without being too overpoweringly garlic-y. Lots of rice flavor options outside of just basmati. \n\nService was attentive and warm. \n\nGreat ambiance, cozy and romantic. Definitely a step above your average casual indian place, great for a little date night and makes the slightly higher price point worth it. Can't wait to go back!", "author": "Angelique L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "So happy to have discovered Indian Table! This neighborhood was sorely missing a good Indian spot and I'm hoping this one sticks around for awhile. I found all of our dishes to be well spiced and the rice and naan perfect. Good old chicken tikka was probably my favorite. The restaurant was busy on a Friday night with all the tables filled up and a small line of people waiting to sit (always a promising sign). We did have slight problem with the service. They brought us the incorrect dishes a few times but then let us keep the extra un-ordered appetizer without charging for it so all was good. Will definitely return to try more menu options.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Ordered Chicken Baryani (medium heat) \n\nThe rice was well cooked and well seasoned garnished with slivered almonds and chopped cilantro stems, the aromatics were not over powering, I could taste cardamoms, cloves and cinnamon however I missed black pepper and black cardamom flavoring which although not a big deal but if added in sufficient quantity would bring about a smoky flavor to the dish.\n\nThe chicken was dry for my taste and also was breast meat which is usually flavorless , I am sure if I would have asked they would have replaced it with dark meat.\n\nServings were decent but a bit small for the price and the rice being the star of the dish was over shadowed by too much meat content that I had to push aside to eat the rice.\n\nService was cordial and the restaurant is very clean and nicely lit.\n\nSome suggestions for next time are to order mild with no chopped green chilies which were too hot and made eating the rice difficult.\n\nI will definitely visit this place again. These guys have the right mix of flavors and I am sure there are some nice surprises awaiting my next meal at this restaurant.", "author": "Umer A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "A friend of ours recommended this restaurant. We weren't sure how good it could be when we arrived. However, the food was really good. Every dish we ordered was  fresh and very tasty. Our daughter, who had no interested in Indian food, love them too!  We will definitely go back soon!", "author": "Linda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Delicious, authentic Indian cuisine. Relaxed,intimate environment. Great for date night or family outing. Perfect place to eat before or after a movie at Cobble Hill Cinemas.", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "This is the BEST indian in the neighborhood - Cobble Hill/Boerum/Carrol/Park Slope. Hands down! Over the course of 1 year.. we ordered from various Indian restaurants and we ALWAYS went back to Indian Table. You can't beat the flavor, portion size, speedy-delivery and there has NEVER been an issue with our order (touch wood, lol). My ONLY complaint and it's not warranted to reduce the rating from 5 to 4 stars. BUT I order the 'saag paneer' every time and I ask for SPICY but they never do it.. why Indian Table?", "author": "Zoe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Some of the greatest hospitality I've ever received was at this restaurant. Huge selection of Indian dishes. Don't be afraid to ask if you're not familiar with certain entrees they will be more than happy to go over anything. It's get a little busy in the evening time but if you don't feel like dining in you can always order out. Huge plus.", "author": "King N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I only ever get the yellow dal tadka and it's always on point. It's so flavorful and delicious -\n it doesn't feel like \"restaurant food\" but just delicious, clean lentils. Don't mess with the spice levels beyond \"medium\" because they're serious about their green chilies.", "author": "Neha S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-22", "description": "Where to start... We were really excited for this place. There isn't exactly a good selection of Indian food in the neighborhood - but this place is not what it pretend to be.\n\nFrom what I understand it's actually owned by the same people who run Om in the upper East side - which was awesome! But the food and host were respectively overcooked and inept.\n\nSkimming to bullet points:\nChicken Tika masala was point on\nLamb was over cooked\nWe waited over 45 min to sit (with a reservation)\nWe waited 30 min for food (again, overcooked food at that)\nWe saw 5 couples sit at two seats at the window-counter and none of them were served/provided water and ALL left. The host really was inept to the point of being rude.\nThe waiter was really nice though!\n\nReally wanted to like this place, but we won't be going back :(", "author": "TJ L."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Indian Table", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "234 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/t37InPJ-RY1y6oum2YFzMA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893882"}