{"aggregateRating": {"reviewCount": 88, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "Flawless service, amazing food and great wine. HIGHLY recommend!!!  Everyone who works here is so friendly and accommodating , and everything I've had on the menu has been delicious. So excited they now have wine (and great wine at that)!", "author": "Haley W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-24", "description": "If you made a reservation and are excited to have a fabulous Indian meal at Indian Table, here are a few things you should expect and some useful translations:\n\n- you may be ignored when you mention you have a reservation, ignored for a looong, long time\n\n- when you ask to sit at a table that has been empty since you walked in, you will get a look from the host that could be interpreted as 'how dare you speak to me' or 'hunh!?!?!'\n\n- \"Table ready in just a few minutes.\" Means a minimum of 30 mins\n\n- \"Your food is almost ready.\" Means it might take 45 minutes\n\n- \"We'll bring you water.\" means we won't get you water\n\nIn summary, no matter how much other reviewers are raving about the food, the Debbie Downer pre-game experience makes it well worth finding somewhere else to eat.", "author": "erika s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "Still some growing pains, but the potential to be a really great neighborhood Indian restaurant. \n\nPros: \n-the decor is lovely, very cosy and intimate for a date night or dinner with friends\n-waitstaff is friendly and helpful\n-eggplant chaat was delicious and unusual, veg korma was also very good\n-menu items like beet croquettes that you don't see at your typical cheap Indian place\n\nCons:\n-the price is a little expensive for what you get. for example, the eggplant chaat, while super tasty, you only get 8 small bites of eggplant for $8. Paneer Stir Fry had maybe 6 cubes of paneer in it. \n-menu still has some kinks to be worked out - only two vegetarian appetisers on offer, not really any salads/soups, etc.\n\nI could see a fully stocked bar but they didn't have a liquor licence yet - seems they are working on it. Also no drinks (other than water or mango lassi) and no desserts yet. \n\nIt would be great if they could provide some pickle or raita to go with the food. \n\nStill too early to tell, but I am hopeful about this place.", "author": "Alisha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Amazing food. \nFlavors on point\nClean and relaxing/fine ambience\nCourteous staff and service. \nDefinitely recommend the dal \u0026 rice, Fish curry and awesome mango lassi. \nA 10/10 experience! \nWill post pictures on my second visit. Most Def.", "author": "Leumas S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "My boyfriend and I enjoyed our meals at this local Indian restaurant last night. We ordered Lamb Vindaloo (very spicy), Salmon Tikka, Chana Saag and garlic naan.  Everything was well prepared - especially salmon was excellent. It was presented nicely and cooked perfect.  I rarely eat Indian food but I would definitely come back for another meal soon.  They don't have a liquor license yet so it's byob for now (liquor store across the street).", "author": "Yuko A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Best Indian in Brooklyn! My girlfriend and I love food. Indian food is always a win. This place has AMAZING authenticate Indian food. The Chana Masala is the best I've ever eaten. Naan is plentiful and delicious and lentils are ooohhhh so buttery. The staff was welcoming, humorous and attentive without being invasive. Highly recommend.", "author": "Devin O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "I was excited to try this restaurant and I have to say one of the worst experiences ever!! They gave our apitizer to the table next to us...they took it after a few minutes..rearranged it and served it to us. The second apitizer they brought was wrong so they took it back and never brought the correct one. \nThe meal I got was tasty but cold! My friends meal was ok. If u have no experience with Indian food,  it will be ok. If you know Indian food ...it's terrible!", "author": "Dimi V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Food its delicious very authentic and most of all I enjoy the good service here, they are super fast.\nI usually come here once per week and I've never been disappointed.\nThank you specially to Daniel for his service and smile while working.", "author": "Marissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I never, ever right reviews, even for places that I love and frequent regularly, yet after multiple flawless meals from Indian Table I just had to share. Its a full sensory experience - the warm smells, the complex flavors that hit perfectly on so many levels, the beautiful colors of the food - I must say \"mmmm\" 25 times every time I have their food and I just can't get enough of it all. My fiancé, who has traveled to India for work multiple times, says this food is on par with, if not better, than dishes she had in high end places throughout the country. I can't recommend Indian Table enough and am so thankful that they are in my neighborhood!", "author": "Tyler H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "I'm not Indian but I've eaten my share of dosas and curries.  This place surprised me with how the flavors in everything I tried were so well balanced and often subtle.  We were both very hungry which I'm sure made it better.  Even so this is not just the neighborhood Indian place, they clearly aspire to be much better.  Kevin, the owner, waited on us and after twisting his arm heavily guided our menu choices.  Even the rice pudding which he admitted was nothing fancy had just the right sweetness and was perfect.  I was told they only use fresh ingredients, not frozen or canned.  The food tastes as if a great deal of care is taken to make it unusually good.  My wife and I both feel it's the best Indian we've ever had.  Just get advice from the staff first since I was told they only reluctantly prepare the more pedestrian items (ie. chicken Tikka).", "author": "Joshua Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Don't know what it is about indian food below street level, but really enjoyed the Table!! Eggplant chaat was an excellent starter. Chicken tikka masala was excellent!! Chicken cooked just right then added to the delicious sauce. Saag and bhaingan were both delicious. Spicy okra on point. Highly recommend!!", "author": "Chan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Loved this place. I've walked by this place a ton of times, but never stopped in. I was craving Indian one night and I remembered that they delivered. Their menu is not on yelp, which was not convenient but I called and asked for a lamb entree which I paid $18 for. I thought it was a little steep for Indian. The portion was huge and it came with a large amount of rice and two vegetable samosas and a plethora of dipping sauces. I love sauces!! It was delicious and made 3 meals. Not too shabby. I would order from here again and now that I know how good it is I can't wait to dine in!! :)", "author": "Maria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "This place has really excellent food. It is one of my favorites in our neighborhood, which is full of good restaurant options. The offerings are a little bit more varied than what you get at your standard Indian restaurant, and the quality is definitely high. I'm always really happy to eat there.", "author": "Talia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "The best Indian restaurant in Brooklyn and great staff. We've eaten in and had delivery from Indian Table. The dishes are excellent, good flavors and spice. Highly recommend.", "author": "Sara E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Very nice ambiance, attentive service, delicious, authentic food. Good veggie and vegan options.", "author": "Zuzana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-16", "description": "Food tastes good. However, portion is not big so my friends and I were still hungry afterwards. The thing I didn't like was that the waiter was trying to up sell us- kept asking us if we wanted wine all night long. You also have to pay for rice (In our experience you get rice along with your entree). Also, naan order is only One piece so you'll have to order a few. They also charge you for papidon (I thought they come for free?)", "author": "Rosanna L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "This place is bit of a mix bag. I honestly think the waiter stuff think they are too good for the job/the customer and was also very condescending. \n\nPRO: \nthe food is amazing!!! The only way I'm ever coming back is if I get take out.\n\nCON: \n-The service is terrible. Really terrible. They should change staff.\n-My friend asked for yogurt to offset her dish, our waiter felt the need to tell her it's her fault that she wanted a spicy dish, even though she wasn't even complaining.\n-We asked for wine recommendations. He pointed out every wine on the list.\n-Came over to cut me and my friend off while we were having a intense conversation several times.\n-When we asked for 2 different nun bread to start, our waiter told us that that's not an appetizer. We went on to order an actual appetizer and 2 mains after but that's what we wanted while we were deciding. \n-When I asked for my dish to be packed up, they put the bone in a bag. Like I'm a dog or something without the rice or any of the curry that came with my dish. \n-When we asked for the check, the waiter had time to stand around with his back to us, talk to his fellow wait staff, go outside and just stand for 5 minutes before giving us the check.", "author": "Lulin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "The Indian food here is as good as it gets. No oil. Fresh ingredients. Perfect. Don't even bother trying anywhere else. These guys are friendly, courteous and the food is consistently the best I've ever tasted, and I'm a brit, and we have some of the best indian restaurants in the world in London. Serious. Get stuck in. Top work guys.", "author": "Simon M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "Think of this as \"small plates\" Indian. The theme is very small portions awash in great quantities of sauce. We had the konkoni fish and the whole baby eggplant in sesame peanut sauce. They both came in bowls that consisted mostly of sauce. \n\nThe food tastes good, significantly better than your basic paint-by-numbers Indian place in the neighborhood. The sauces are flavorful and you can taste the quality of the spices and the other raw ingredients. \n\nBut you have to consider that an entree costs a couple bucks more than you'd normally pay for the same dish in this neighborhood and the portions are about a quarter the size. \n\nTwo entrees, which came with rice, plus an order of naan, wasn't quite enough food for two light-eating adults.", "author": "Lindsay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "My favorite Indian place in Brooklyn! Excellent food, good service and a charming, very simple atmosphere. The people who work there really care about the customer experience. Also, it's BYOB which is pretty cool. I would recommend it to anyone who wants a simple evening eating delicious Indian food.", "author": "Tim S."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Indian Table", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "234 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/t37InPJ-RY1y6oum2YFzMA/ls.jpg", "@type": "Restaurant", "telephone": "+13476893882"}