{"aggregateRating": {"reviewCount": 63, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "I'll keep it simple (haha, I'm funny): this restaurant makes great poke bowls. I've had poke from several places and I find this one makes the most creative bowls. We had the poached shrimp and the octopus and they were both very good. The staff is also super friendly. Check them out next time you are in the mood for poke!", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Huge quality poké, great customer service, there's no option to build your own but the premade spicy tuna and salmon are both wonderful options. Definitely recommend stopping by for some great poké.", "author": "Ayaz K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "The best ! The food is fresh,  delicious  and healthy.  Do yourself a favor and order much and often!", "author": "Robert L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "i love having this for dinner and lunch! food is quick and delicious. spicy salmon poke is my favorite. the people there are very nice and the decor is very quaint.", "author": "Augustine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "I ordered salmon poke,  the salmon was fresh and the toppings were plenty.  The service was excellent and the staff was very friendly. Definitely will come back again.", "author": "Jiang C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "This place is adorable! I stopped by on my walk home from work and ordered the spicy tuna poke bowl. Definitely the best I've ever had. The staff is super friendly too! I will be back :)", "author": "Aly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "I have not been to the one in Manhattan.   I have spent a lot of time in Hawaii.  Every time I come back to New York, I get homesick for some Poke.  And I've tried a bunch of Poke places in the city.  This is the best.  I ordered the spicy tuna over salad.  The tuna was not overly mayo'd and the flavor was spot on.   Their fish is super fresh.  I want to try everything on their menu!", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "A cute little place to curb some poké cravings! The portions are also very, very generous compared to other places I've been to. The octopus poké is really good, as is the ahi tuna.", "author": "Megan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Decently priced poke bowls with fresh ingredients and toppings.  Spicy salmon was tasty.  There were also spicy tuna, ahi tuna options as well.  The bentos the neighbors had next to us looked delicious.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Ooooooo delicious! I had the Ahi Tuna Poke bowl with brown rice, and it was absolutely delicious. The staff brought us water as they made the food fresh, took them maybe 5 minutes to bring it over, and we dined. Two poke bowl meals came to around $25. I'd definitely go back for more!", "author": "Torrey J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "I tried this place for the first time today when I had a hankering for a guiltless quick lunch. I ordered the  raw spicy salmon bowl with white rice and sunflower seeds. It was AMAZING! The serving was very generous (It filled me and my wife couldn't finish hers). It came loaded with vegetables and salmon and was ready very quickly. For the price I don't know how you can beat this poke bowl.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Always thought Poke was a bland gimmick before this place.  Definitely the best Poke I've had in New York.  Instead of just \"fish and rice,\" Simple has big bowls with 8-10 (ish) well balanced ingredients and complex flavors that make even finishing the rice a pleasure.  The bowls are also unusually large which is great. Staff are super friendly too.\n\nStrongly recommend!", "author": "Colin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Unexpected and delicious spot on Atlantic Ave! The salmon in the bento box was cooked perfectly, which is hard to find in a nice restaurant, much less in a casual lunch spot. Not the cheapest, but delicious and healthy food I highly recommend.", "author": "John K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "The selection and quality of the ingredients are excellent! The tuna in the tuna bowl was so fresh and paired perfectly with the other ingredients. There are also vegetarian options and salad base options. It's a great place for people looking for a real, quality  meal on the go and also people looking to be healthy- 2 things that can be hard to find in this area. The service was so warm and friendly! They bring the food to you if you're eating in and the space is very hip. This will definitely be a go-to lunch and dinner spot for us :)", "author": "Tara R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Had the best poke bowl ever here! I got the tofu bowl and I'm not even a huge fan of tofu (trying to go veg.) Anyway, I am now craving the tofu poke. It was like heaven so silky! Sooooooo good! With the sauce, and the everything! LOVED IT. Get all those crunchies.", "author": "Tammy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "A small little spot that is a must try!! I order the Spicy Tuna Raw Poke Bowl at LEAST once a week- it's so delicious and the staff is extremely hospitable! I never have to wait for my order, it's made quickly and the place is very clean with cute little tables/decor. Highly recommend for fellow Brooklyn dwellers in the Boerum Hill area!", "author": "D S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Just got the salmon poke...fresh and flavorful. They have an option of quinoa, which I cant find where I live in DC. Will be visiting again soon!", "author": "S F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Soooo much good stuff in one bowl of food. Ahi Tuna and Spicy Salmon were both delishiousness!!", "author": "Aaron P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Amazing!!! Definitely the best food choice in Downtown Brooklyn. Had an octopus bowl and it came with all kinds of goodies. No more struggles for picking a lunch spot.", "author": "Wei S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Hands down the best poke out there! I've been a regular at their LES location for years and so glad they've opened closer to me in Brooklyn! The food is fresh and delicious but even better the family who owns it couldn't be kinder people!! We love going to simple!!", "author": "Jay N."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Simple NYC-Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "311 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nGC3-XJ2PyH6el32ssu7zA/ls.jpg", "@type": "Restaurant", "telephone": "+17187971088"}