{"aggregateRating": {"reviewCount": 63, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Wow! \n\nI've been coming here for a month or two now, and have not had a poke experience quite like this anything else. Of course five stars for the food, the freshly cut fish is unlike any other poke spot, and the menu items are not the crazy all you can do toppings that we see as of late in the poke trend world,  but more importantly the attention to detail and comfort you feel the second you walk in and are taken care of is more valuable than the quality of the food itself! Thanks you guys are great!", "author": "Vincent R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "When I lived in Manhattan, I would walk a mile to Simple and back to earn their poke. It truly is that good. I've been a fan for years, so when I found out Simple was opening in Downtown BK I knew it was fate. \n\nI'm a big fan of their spicy tuna poke bowl. The fish is always tender, super fresh, and I love the toppings they put on the bowls (always say ALL of the crunchies). I usually do half greens and half quinoa. I also luvv their Hamburg teriyaki when I'm feeling a little more naughty - there's something really satisfying about it.\n\nSo why the 4 stars instead of 5, you ask?\n1. Pretty much every time I order, something is incorrect or missing. They pack these bowls super tight, so if they forget the quinoa or add a topping you didn't want... you're stuck with it. And I'm not going to ask they recreate the entire bowl for a small error. \n2. The bowls are SO jam packed it makes it really difficult to eat. It's nearly impossible to mix anything around or enjoy a bite with a little of everything because you have to go digging into the depths of the bowl. \n\nBesides those small things, the ingredients / freshness / taste is a 5 star experience. I'm lucky Simple NYC opened in my hood.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Generous portions, friendly staff, and bursting flavors, what's not to love! I like this location better than the NYC one as it has better seating and service. I've stopped in here a few times and have experienced consistent quality. \n\nMy favorite is the hamburg curry bento, which I usually get brown rice. The size is probably hungry man portions, which makes it easy to share with someone who orders a poke. +$1 for extra base. The salmon and tuna poke come with a full bowl with plenty of garnishes like edamame, ginger, pickled lotus root. You can also choose the crunchies.\n\nThe curry is so flavorful and comes with sauce on the side so that you can adjust based on taste. The poached egg is perfectly tender on the inside. \n\nThe yuzu soda is a great add to cut the saltiness if the curry. They usually give us a bottle of water when we pour water from the station by the cashier.", "author": "Jess J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Delicious poke and great portions. We tried the ahi tuna bowl and the spicy tuna bowl. Both bowls came with a lot of warm rice, and plenty of delicious toppings. Overall one of the best poke I've ever had. Will definitely be back when I'm around", "author": "Matteo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "Compared to Manhattan, Downtown Brooklyn is seriously lacking in poke options. Simple NYC definitely fills that void and gets right what a lot of poke places don't:\n\n1. The ingredients are fresh and the toppings are great. They don't really have a build your own option, but their combinations are spot-on. Plenty of different proteins, carbs, and crunchies for all tastes.\n\n2. They're delicious. Maybe this should have been #1, but w/e. The poke tastes great and that's all you need to know.\n\n3. The price is right. None of this \"$20 for a bowl of mostly rice\" that seems to be the norm elsewhere. Most of their poke bowls are in the $12 - $15 range.\n\n4. Portions are generous. My number one pet peeve with poke places is that they usually give you like 5 tiny pieces of fish. Not here. If you eat like a horse, you will be full. If you eat like a bird (like me), you will have lunch and dinner.\n\nThey also have plenty of cooked things (poke and otherwise), if that's to your liking.\n\nIs there anything I don't like about Simple NYC? The only thing I can think of is that the space is SMOL (though no fault of their own), which means that it can be hard to eat in when it gets busy.", "author": "Marina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-08", "description": "Solid neighborhood poke spot. The fish is always fresh, the service is quick and friendly, and the poke bowls are loaded with quality ingredients. \n\nMy go-to order has been the spicy tuna poke over white rice, which has always been satisfying, and the spice level is not overwhelming. I'm a big fan of the edamame and fresh ripe mango in my poke. Also, the iced tea selection here is extensive and fun to browse through. \n\nOnce the restaurant was out of both brown and white rice so I had to get quinoa, and I happen to be in the rare 5% of the world that doesn't understand what all the quinoa obsession is about. \n\nOverall, Simple NYC has consistently been a reliable meal option for me. I will definitely be returning in the future.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "53 five star reviews- I had to know what all the fuss is about even though it required a 10 block trek in gaad-awful footwear. \n\nIt was worth every painful step. \n\nAdorable little nook with the friendliest proprietor happily explaining to me I can add on anything I want for extra- ;).\n\nThey had my raw salmon bowl ready in 3 minutes as I was just enjoying the comfy corner bench. \n\nLet me just say-\n\nRed quinoa everywhere. Simple does Not skimp. And I love that. Clearly, 54 ppl in a row does. \n\nAnd I love the fact they put just enough dressing that the bowl looked dry. Fear not, I assure you it's well flavored but not a hair soggy so that everything is al dente and basically perfect. I realize the best ingredients does not have anything to do with green leaves. \n\nBut Simple already knew that. And they knew the right combo of Extra Extra quinoa (calling all carb protein lovers), seaweed, fresh chunks of fish, lotus wheels, edamame, avocado, tobiko, ginger and pickled julienned bell peppers is all a poke bowl requires.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Poke is pretty good. \nPoke from Simple NYC? The best. \n\nIn some ways, the name is quite apt. It's a small space (the old Boomwich), and they simply put out great food. Fresh, tasty, well-prepared ingredients, artfully layered atop whichever base you choose (quinoa, rice, greens, or a mix). All their food looks good, and tastes good.\n\nIt seems like a simple formula, but so few restaurants do it this well. \n\nI feel pretty lucky that they moved in around the corner from me; it's become a lunchtime staple and I see myself working my way through the whole menu in the next couple of months. As of right now, I've yet to find something I don't like.\n\nOn the raw side, I've enjoyed both the spicy salmon and the spicy tuna bowls (I prefer the tuna). If you're a little wary of raw, you can go halfway and get the seared ahi tuna bowl (avocado aioli FTW), or go with one of the fully cooked selections.\n\nThe poached shrimp bowl is excellent, but I was most pleasantly surprised by the braised beef shortrib bento box. It's a seriously substantial portion for the price, and the meat is fall-apart tender with a delicious sauce. I can't decide if I like the Japanese egg salad it comes with (along with carrots, seaweed salad, and a regular salad), but I still ate it all.\n\nI think my only complaint is that there's a delivery fee, but even though that means I order from them less, it makes me walk more...which is probably a good thing.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "Simple, I apologize in advance for giving you a good Yelp review. Because it seems like every business I like at this location disappears. This space was previously Boomwich, and Nicky's Vietnamese Sandwiches before that.\n\nAnd like those two, Simple is very good. Their poke bowl portions are huge. A more strong-willed person would probably split their bowl into two meals. That said, I ate all of my spicy salmon bowl in one sitting. And WAS SO FULL. I also got quinoa as a base, so it was super filling. A little too mayo-heavy for my tastes, but the fish was fresh and the toppings were plentiful. Not sure how I feel about a single orange slice though. I guess it gave it some color. You also get your choice of a crunchy (I went with sunflower seeds), so that's nice.\n\nAnyway, go eat here.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Ooh.. I likey. I thought I was giving Poke a break, since I've been eating a whole lot of poke lately. But as I was walking down Atlantic Avenue, I chanced upon Simple, - checked yelp reviews and decided \"one more poke bowl\". \n\nWhile this isn't the type of place that you can create your own bowl, the bowls they have on menu, all sound great. i chose a spicy tuna bowl. that came with all sorts of amazingness. The place is unassuming, down a few stairs, and clean and colorful vibe. It was nice and quiet, but it was in between lunch and dinner. I'm sure they get busy during lunch. \n\nLooking forward to trying out some more dishes, and if i'm giving raw fish a break, they have some cooked fish poke, and bento boxes I'd love to try.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Like their namesake Simple NYC really keeps their bowls simple, fresh and delicious. \n\nI chanced upon them while strolling downtown and looking for healthy options to eat. Poke is a mad fad these days, so if you're doing it well you know you'll be turning a profit real soon. \n\nI ordered the Ahi Tuna bowl where the tuna is not raw but lightly seared to absolute perfection. See picture for insanely beautiful colour. I ordered it with a base of quinoa (not a fan of rice) and for crunch those chow mein noods. The bowl was absolutely delicious and I realized why mid eating. They use a sauce that they make in house and it really is like no other I've tasted. If I'm not mistaken it was an avocado aoili. \n\nWhile eating I took a look around and was impressed with the simplicity of the decor and how clean they kept the space, behind the counter too. The price was pretty reasonable too and parking was an absolute breeze.\n\nSo excited to head back again and try one of their other options. If you're not a fan of raw, they do have cooked options too.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "My wife and I decided to come here during lunch. \nThe shrimp and salmon bowl were a great choice. The food was good for a lunch. The portions were a good size too.", "author": "Julius S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "First time having poke. Was excellent. Had the spicy salmon poke, it had plenty of fun toppings and great flavor. People were very nice as well. \n\nIf you like sushi I would definitely recommend it.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Nice poke! Got spicy salmon with wonton strips and brown rice. \n\nAnd they played Jay Chou!!!", "author": "Clio W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Salmon poke and bento box is a must try! Great coffee! Comfy seats and music! \nSalad with sesame sauce is so good\nSlow cooked short rib is great", "author": "Theodore H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Walking along Atlantic Ave we came across this newly opened spot. They are sooo nice and friendly here and helpful in suggesting what to order. The place is small maybe 5 tables or so. But you can always order to take out. Their menu is detailed enough so its easy to order. Poke is good...kinda like clean eating. You get what you ask for. We got a raw spicy tuna bowl and an octopus bowl. The raw spicy tuna bowl was delicious. Very fresh tasting and filing. The octopus is steamed and it's good. Again fresh ingredients so you get what you pay for. The plates look pretty as well(check out the pictures).  Everything in the dishes compliment one another. No complaints and definitely will be returning. If in the mood for great tasting POKE, pay them a visit.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "This was a great random find for my work friends!  Simple NYC is a small, cute poke place that has a welcoming ambience.  They provide locked guest WiFi with posted password, free fortune cookies at the counter, great music soundtrack, and friendly staff familiar enough with the menu to make recommendarions.  \n\nThis was my first time trying poke and I was generally impressed.  I got the Butter Poached Shrimp cooked poke bowl with brown rice.  It's a flavorful blend of avocado, cucumber, died mango and so much more.  The food did take longer than expected to come out but worth the wait.  They also appeared to be getting a large amount of to go orders.  My friends agreed this is one of the better meals we've had since we started working in the area.\n\nPoke was never something I considered until trying Simply NYC and was beyond pleased with my meal.", "author": "Joe G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "New place just opened in the end of March. They have poke bowl and Bento box. Love their spicy tuna and salmon poke bowls. Very fresh !\nAlso tried their steak bento bowl, love it very much. Will go back to try their pan seared salmon bento. Heard that they will have delivery soon.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "Food tastes great, but found a piece of hair in the salmon poke I ordered for takeout... hope the restaurant can be more careful in the future.", "author": "Rachel X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Come. Taste it - understand it. Wow. Really enjoyed the food, the servant the vibe. Had Salmon Raw Bowl - 5/5. Will definitely recommend and come again taste other food.", "author": "Rokas Š."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Simple NYC-Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "311 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nGC3-XJ2PyH6el32ssu7zA/ls.jpg", "@type": "Restaurant", "telephone": "+17187971088"}