{"aggregateRating": {"reviewCount": 63, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "Just tried the short ribs bento and salmon poke, and was very pleasantly surprised by the taste and quality at this price point. The place was neat and cozy and we felt great after eating as it's relatively healthy and have that home cooking feel. The service was also surprisingly noteworthy esp for a Cantonese establishment (disclaimer: I'm Cantonese). This place has ascended to one of my favorite spots in my neighborhood as the value it delivers exceeded the price so I'll definitely be back!", "author": "Kobe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Really happy that I stopped here for a casual dinner! The service is fantastic and answered all of the questions I had about the food. I ended up getting a raw salmon bowl \u0026 all the individual ingredients were delicious in their own way whether it's the fish (v fresh) or seaweed (so savoury). The decor itself is incredibly fancy and they have a great rewards program (buy 8 get 1 free). Really happy with the price too. Definitely stop by if you're craving some poke!!!", "author": "Rose L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "I recently tasted Poke at work, and decided I wanted to eat it tonight for dinner. I looked and saw this was the closest place to me and decided to stop by. \n\nOne thing I noticed immediately was how clean the place was and the colorful aesthetic. The cashier gave me his personal favs and I took him up on his offer and got the cooked salmon! IT WAS AMAZING!!! Everything was so fresh and flavorful. \n\nAll the staff was super nice and helpful! I'll definitely be going back again!", "author": "Krystal B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "We had the best poke of my life. Tasty and amazing. Fresh flavors and creative plating. What a fabulous find. The bowls are healthy but oh so good. Super friendly staff and a nice bench area to munch and people watch, make this a must-go-to spot for poke.", "author": "Ann P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Finally a well priced and delicious neighborhood poke place!!!! I live in the area and used to get wikiwiki but it's a bit overpriced and it's small. Simple is so good!! Got the ahi tuna and salmon poke. Both were delicious and was about $2-3 cheaper than wikiwiki and more delicious. I'm interested in trying the cooked ones as well...octopus??!!! Can't wait to come back!", "author": "Anne K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Super delicious fresh poke, and great service every single time! Portions are generous and the owner is incredibly friendly.", "author": "Tina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I love coming to this place. The owners are super friendly, courteous, and helpful. The poke bowls are probably the best I've had in the city. The portions are massive, you have a choice of rice/quinoa/salad bases, and each bowl is a treasure trove of ingredients. Hubby and I have tried the octopus, spicy salmon, spicy tuna, and ahi tuna and none have disappointed. They are also the most affordable poke bowls I've come across. Keep up the good work!", "author": "Deb C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Delicious fresh poke bowls, lots of options for the base-white or brown rice, quinoa or salad (I opted for the salad) and chose the spicy salmon. Service was fast and they are so nice!", "author": "Kim E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "As the poke trend exploded throughout the city I was surprised at how long it took to spread to Brooklyn. Well the wait is over because Simple NYC is exactly what we've been waiting for. It's good fresh ingredients in a well portioned bowl. They even have cooked salmon bowls for those not ready to plunge into the raw fish food world. The owners were lovely and I hope the business sticks around.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "First time getting Poke Bowl. Wow. This was so good. Definitely will come again. I had the Spivey Tuna poke. 5+ Stars!", "author": "Sveta R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Feeling grateful for this new addition to the neighborhood! We had the Organic Tofu bowl and the Jumbo Lump Crabmeat bowl and both were super tasty with fresh ingredients and flavorful toppings. Prices for the bowls are mostly in the $11-14 range, and the portions are generous (we both left full AND had leftovers). Staff is friendly and the atmosphere is bright and cheery. Will be back often.", "author": "Cat D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "First time ever trying out Poke Bowl and I have to said Simple NYC Brooklyn made it a great experience for me. The bowl is tasty and full of ingredients, while most restaurant these days try to be stingy on their ingredients, this place sure not", "author": "Nancy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "If you want takeout that tastes clean and delicious, definitely recommend this spot! In addition to their poke bowls, I love their short rib bento box. My fiancé and I flew back from a red eye flight and picked up some poke bowls which met our need for some comfort food. Worth giving this place a shot!", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Butter poached shrimp was different, but great. I haven't tried any of the traditional poke, but have heard it is more on the average side from friends", "author": "Amit P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "We walked in hungry and far from home. With 10 minutes till closing time the clerk in the Nirvana shirt handed us our food in a to-go bag and asked us to leave. On our way out she asked if we had a long way to, smiled, and said \"sorry bye!\"", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Though I've been overwhelmed with the amount of poke that has popped up in NY, this place is legitimately delicious! All the ingredients are fresh and the veggies are nice and crunchy. There's also really good flavor and texture variation (I got the salmon poke bowl). The place is clean and conveniently located. Good lunch spot!", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "This very simple poke and bento box restaurant serves delicious fresh food with a smile. I've had the ahi tuna poke bowl twice and my daughter had the teriyaki tofu bento box. They were so big and delish that we took leftovers home for the next day.", "author": "Alice G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "Hands down the best poke bowl spot!! Found this place on yelp after the gym searching for lunch / post workout. Salmon \u0026 tuna is fresh and delicious (i get spicy)  with salad \u0026 quinoa and all the crunchies. Its worth the money, so many ingredients and full of flavor, unlike the other poke spots!!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Excellent poke with very fresh ingredients. Ahi tuna poke was the best! Staff is friendly and helpful.", "author": "Rodney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Súper friendly staff and high quality food. Hamburg curry was yum and the spicy tuna was classic. Generous portions too!", "author": "Gayle G."}], "servesCuisine": "Asian Fusion", "priceRange": "$11-30", "name": "Simple NYC-Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "311 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nGC3-XJ2PyH6el32ssu7zA/ls.jpg", "@type": "Restaurant", "telephone": "+17187971088"}