{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-19", "description": "Average food and awful service at brunch. Close to an hour waiting for our food (restaurant only 1/4 full) which arrived lukewarm and a server who seemed to forget we existed .", "author": "Bill R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "This is probably my favorite restaurant in Brooklyn. The food is absolutely delicious--homemade soups, vegetarian stuffed peppers that are sublime, sweet and sour stuffed cabbage, pierogi, and Brooklyn's best ice cream.  The space itself reminds me of a country store, with one long farm table and comfortably spaced tables for two and four. The owners and servers are so warm and friendly that I feel as if I am dining with great friends even if I stop in by myself for a bowl of soup.", "author": "jill b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "I love these guys!!  Sometimes I want to sit in a place where the music isn't too loud and I can have a drink and good food that's not loaded with a ton of oil and cheese.  Living in cobble hill offers amazing choices for restaurants but at times the food is just too heavy!  Anyhow, I love the belnd of flavors and the yet the simplicity of the food they offer.  Their staf is absolutely friendly and helpful and teh ambiance is very snug, charming and relaxing.", "author": "Cindy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-06", "description": "This place sounded good and from other reviews, I went to check it out.  I was utterly disappointed with just about everything from service to food.  After serving our drinks, the waiter asked 'how everything was'....?  I love borscht, ordered one, and it came to the table luke warm.  Luke warm borscht?  For the main course, i ordered a pretty difficult to mess up gulash.  This one had no taste or character.  Also, no server there seemed to have ever worked in a restaurant before.  Overall, pretty terrifying restaurant experience.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "I've eaten here five or six times. However, the only thing I can comment on is the cabbage Varenikis.  Get them.  Really.  They're so good,  I've considered making the trip from Manhattan specifically to get them.   I do want to explore more of the menu, especially since they are thoughtful enough to offer so many vegetarian options.  But the verenikis are so good that I can't bring myself to get anything else.", "author": "Elissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "We had our rehearsal dinner here a few weeks ago - it was absolutely wonderful!  Olga and Artur were extremely accommodating and pleasant to work with.  We had the whole restaurant from 6-9pm with 45 guests.  We had a cocktail hour with drinks and appetizers followed by a family style dinner.  Afterwards, dessert and coffee were served.  The service was exceptional throughout the evening.  Such unique dishes and all very tasty!  We dropped off bunches of flowers earlier in the day and Olga arranged them in vases for our dinner.  Olga and Artur put in extra time and personalized care to ensure that the event was perfect.  This was one of the best decisions we made for our wedding.  If you're looking for a great place for a private event (or a dinner whenever), we highly recommend Karloff!", "author": "mike m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Food was great! Service was good! Location and decor is nice.. are orders got messed up, However it was both partys fault.. Over still worth your time.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-05", "description": "The food is okay. Service is nice. It is Amex and cash only which is not clearly disclosed upfront. I would add a star if I could swipe my debit card.", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-25", "description": "I've heard great things about Karloff but I really wasn't impressed. I  wanted something light so I ordered the tomato, cucumber, and onion salad, which was definitely light and refreshing but nothing remarkable- the tomatoes were pretty bland, and the cucumbers weren't very ripe. I did enjoy the fresh carrot juice, though, which was the highlight of my meal. I would've considered going back to try the lox sandwich or dumplings, but as I sampled those from my friends' plates I'm not sure I have a desire to.", "author": "Bekah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-04", "description": "Only went once.  Man.  Sad limp food.  Nonexistent service.  No beer in an eastern european joint.  Felt too close to being in an institutional cafeteria.", "author": "saffronnsomag L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-20", "description": "Good food...bad service. \n\nI really enjoy the homey feel and the food is what I like...comfort food but the service...is terrible. Every time I've gone, I've asked for something to be brought with the meal, ketchup etc.  it has NEVER come. Actually it did once, at the end of my meal when I had 2 bites of potatoes left...literally.\n\nThe last time I went, a friend of mine and I were enjoying a conversation and coffee and the waiter kept coming over and asking if we were done as if trying to get rid of us. The food may bring people in but service will keep most from returning. It's a shame...a real shame.", "author": "Michele P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "Just in time for the cold weather! Russian food without the commute to Brighton beach. Karloff succeeds in walking the line between coffee shop and restaurant--where several others in the neighborhood have failed.   \n\nI wandered into Karloff last week when it was soft open--was happy enough with the experience to make a return trip. The staff is very friendly and the warm decor is welcoming.\n\n* Food: I had a shredded chicken and cabbage dish which was quite tasty. I look forward to trying the soups and stews. They also offer a nice selection of pastries. The dulce de leche filled cookies are a revelation...\n\n* Coffee: The house blend is well brewed and not bad (not particularly exciting though). They offer a couple of other beans that can be brewed in a pour over, french press, or siphon. I haven't tried the other methods yet--as a coffee geek I'm excited for the options.\n\nI'm not sure if they have wi-fi, but the large communal table is a good place to set up with a laptop. The ice cream bar will definitely attract young families. I'm hoping this place will maintain a balance between the stroller gangs, MacBook Pro brigades, and people who just want eat or enjoy some coffee!", "author": "Sunil M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-10", "description": "Coffee- WEAK, Weak, weak!! No flavor.\nSmoothies- Watered down and flavorless.\nPastries- Bland\n\nI don't know how this place could possibly have gotten 5 star reviews. The atmosphere is cute, but the service is BAD just like the food and coffee. I would suggest finding another place in the area-- there are so many!!", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-09", "description": "Will never go back! Food is bland, not even close to resemble anything authentic. If anyone wants to try real Eastern European food I suggest spending a little bit more time on the train and going to Brighton Beach! Also, I had a Groupon for this place and after notifying the waiter I still received a wrong check. Then i was notified that they only accepted Amex and Cash and that this was a recent change. I have never been more dissatisfied with a restaurant in my life!", "author": "Viktoriya K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "We randomly were walking through the neighborhood and had a craving for ice cream, walked in and had what was the most delicious ice cream I've had in a long, long time. Better than Blue Marble. And much, much friendlier service. I'd love to come back for the food.", "author": "Jacob R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-08", "description": "Great restaurant. Very laid back, and unique decor. But the real star is the food. Who knew Russian comfort food could be so good? It doesn't hurt that they put their own unique twist on it? And, of course, any review of this place would be remiss without mentioning the amazing ice cream. My new favorite in Brooklyn (Blue Marble is a distant second). Anyway, great addition to the neighborhood, and my new go-to hangout.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "This place is great. I've been going fairly regularly for a few years. The food, atmosphere, and service are generally top-notch. It's often a little empty, though having a little space and quiet are a welcome change in the neighborhood.", "author": "Tucker P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-15", "description": "food was good. service was bad. portions were small.", "author": "Max H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-16", "description": "A good, different place to try with some dishes you probably haven't had before.  Ice cream and some interesting nonalcoholic drinks.", "author": "Daniel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-22", "description": "Had lunch on a cold afternoon, excellent comfort food.  super friendly waitstaff.  Really good ice cream and tasty coffee too.  I had beef stroganoff served over kasha and was licking the bowl.  Seemed fun for the kids with the bakery and ice cream, but thank the lord the stroller traffic jam of the Tea Lounge is gone.  The space seems much more open.  It seemed like people would get one drink at the Tea Lounge and then hang for 3 hours, and even though the lap tops are in attendance it doesn't seem folks are just camping out.  Haven't been in for dinner, but had an overall great experience.", "author": "Jay S."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}