{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "My fiance and I went to Karloff for a NYE dinner. Sadly we were incredibly disappointed. They $25 for small plate of beef stroganoff (normally $19 on their regular menu). This traditionally creamy dish was almost soupy and tasted more like tomato juice than anything else. We had several different people to our table to get our order, bring our drinks, then bring our food. Not sure who the tip went to. Paying for an expensive meal in New York is always expected, but it's unfortunate when the food doesn't match the price. Lastly, they only accept Amex, not Visa. Weird choice. I do not recommend.", "author": "Suzanne P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-04", "description": "Disappointed with the food (bland, teeny-tiny crepes) and the minimal, totally unsolicitous service.  Once the order is given and once the food is brought to the table, no one knows you are there.  My husband and I felt like invisible strangers. The young, attractive waitstaff is too busy talking and socializing with each other.  \n\nNeedless to say, we will not be going back to Karloff", "author": "Verena O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-08", "description": "Dined there yesterday evening with my lady friend. It was early on a Tuesday and we were virtually the only ones there, so our service was particularly attentive. \n\nThe house salad was fresh and tangy with a nice complex   mustard emulsion. I was served the seared scottish salmon as an entree and will say, as someone whose spent a great deal of time in the pacific north west and a salmon lover from way back, this was one of *the* best prepared versions I have ever had in my many years.  My partner had  the same salad as I and a bowl of broccoli soup which was almost perfectly cooked. \n\nThe presentation was clean, focused and not fussy;  it was a very satisfying.experience", "author": "Tom B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "Something for everyone. Nice selection outside of the typical salad for vegetarians, as well as gluten free options.\n\nThe Vegetarian Black Bean Burger was freshly made and delicious over Kasha instead of on a bun. Loved the extra grilled vegetables on top!\n\nI'll be back again for lunch.", "author": "Meagan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-10", "description": "It's a Russian kitchen masquerading for American comfort food. The salmon appetizer we ordered was pre-made and refrigerated probably from the morning of or a day before. Needless to say it did not taste fresh or appetizing. Next, the burgers were heavily dozed with chipotle mayo making them excessively greasy and overwhelming any beef taste what so ever. In addition they offer only one cheese topping and unbeknownst to us it was extra charge. This was not apparent from the menu nor was it volunteered by the waiter. Their wines are overpriced and the two different kinds that we tried both tasted uncharacteristically bitter. Overall, the decor is clean and trendy but somewhat cold. The service was decent but nothing more. We also did not like that the management conducted their business in the dinning area. Phone, papers and laptop did not inspire cozy and relaxing ambient one would seek for an after work dinner option. In short, there are plenty of better options in Cobble Hill.", "author": "Aleksandr B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-01", "description": "Very noisy but very delicious! \n\nMy latkes and scrambled eggs with roasted vegetables (zucchini, onion, winter squash), and enough apple sauce and sour cream to dip were absolutely divine perfection. My friend was also so happy with her egg in a hole brioche and chicken sausage.\n\nOur waiter was so gracious and personable despite being overwhelmed with the crowd, I can't blame him for forgetting to bring my companion and me our broiled grapefruit until the end of the meal. It was a nice way to end the meal. Will definitely come back for more eats! (Or ice-cream which they also serve.)\n\nVery please that the bill came in under $35.00 too!", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "The restaurant is currently closed for renovations, and it will reopen with a different name... I'm so sad to see the old Karloff go! Please keep your great recipes and the quality ingredients we've always come back for.", "author": "Branfa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "I had a birthday party for my girlfriend at Karloff and we had the best time ever. \nEverything from service to the food was outstanding. \n\nThey really care about their guests. Everyone at the restaurant sang when the cake came out.  It had to be perfect and it was.\n\nThanks so much - everyone !!!", "author": "Chance S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "One of my favorite places in Cobble Hill. I started going soon after they opened in 2010 and it quickly became my go-to place. Great coffee options, they know how to make tea (lemon-ginger is just like I make it at home), yummy breakfasts, comforting soups and vegetable dishes. I've tried a little bit of everything and can say that I didn't dislike anything. I highly recommend their latkes, fresh juices, lox sandwich, pancakes and their lavender ice cream (when they have it) is AMAZING.\n\nWhen they first opened they were definitely a bit overwhelmed but the owners were very sweet and attentive. It means a lot as a repeat customer to be recognized and greeted, which we got each time. There were a few times service was slow, when they were overwhelmed, but it never bothered me because it was a rare occasion and the food, ambiance and owners always made up for it. Only thing I wish they had was wifi (which they may have now) but then again I see their dilemna about it cutting off business. \n\nSadly I can't visit as often since I'm in a different neighborhood but go if you are there!!", "author": "Filiz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "Karloff is possibly the most genuine restaurant slash cafe i have bumped into in the Cobble Hill area and beyond. Not pretentious, yet cool and stylish. Very kind and joyful staff. \nA great good menu for all meals and in between, with comfort items like their sandwiches and burgers and more adventurous options (Cherry- filled Dumplings - wow). The syphon coffee is a magic show, and they have the BEST ICE CREAM on the north american continent. Try them all!\nInsider's scoop: I think they will also be serving wine and beer (and vodka!)", "author": "Alessandro d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "What's not to love about Karloff?\n\nWent there to grab a coffee and study.  Ended up having a bowl of hot borscht, potato latkas and peanut butter ice cream.  Everything was absolutely delicious. Service was great. Atmosphere was very pleasant. \n\nGiven the context of cafe, that serves food and dessert -- I was very pleased.", "author": "Richard G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-24", "description": "Tried this place for a casual dinner with my wife. Except for the vareniki, which were quite good, the food was so-so (I had the burger, it was decent), but there were a few kind of irksome things that ruined the whole experience for me.\n\nFirst, my wife ordered the mussels, and was then informed that they no longer offer them (not that they were out of them). She's mostly vegetarian, except for a few seafood items, so she got the vegetarian stir fry. It looked really nice, had good ingredients, but was super bland and instead of sauce came with a side of kale soup as the \"sauce\". She asked if they had any kind of salty or savory sauce, and the waitress said no. She asked if she could have some of the cream sauce that comes with the vareniki and she was told it was $2 extra because \"mushrooms are really expensive.\" I'm sorry, but if you remove a dish without updating the menu and then someone is unhappy with the bland substitute item you recommend, you don't charge them $2 for a 2 ounce side of sauce that is literally poured all over a $10 appetizer.\n\nService was very slow, considering it wasn't very busy. One of the waiters was doing things like resetting tables right next to us in a half empty restaurant while our water glasses sat empty.\n\nI also thought that it was not nice that they don't offer bread and that they had flimsy paper napkins. I think if you sell $12 cocktails, you should use cloth napkins.\n\nSpeaking of cocktails, when the bill came, they charged us $1 more each for our drinks than the listed price on the menu. The principle of this bothers me a lot more than the actual dollar. I realized after they had already run my card and at this point I just wanted to leave so I didn't say anything.\n\nIt's too bad management doesn't take things a little more seriously and train their staff better. I think this place actually has some potential, but their execution was rather poor.", "author": "Adam V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Overall, a great experience! Upon arriving, we were warmly welcomed and quickly seated. The wait staff was very pleasant and the food was even better. The potato dumplings with mushroom sauce were amazing- will definitely return for those!", "author": "Antoinette D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "The food is great although the staff was a little disorganized, but still friendly. I haven't been in much since they have renovated. I can't bring myself to go in due to the gloomy new wood paneled walls and dark decor.  I was so sad to see the creative light and airy original decor be revamped! Now it feels very serious and sort of vampirey.  But the kielbasa and latkes are so good.  I will go back, but not as much as I used to.", "author": "Tia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-11", "description": "Walked in off the street for brunch because the decor looked like my kind of place. Staff was friendly at first, but then was very difficult to get a hold of. The food was very bland, something I could have made at home without any effort and the coffee was pretty sloppily crafted.\n\nIce Cream seems to be their forte, so I would absolutely not recommend this place for much else.", "author": "Jen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "I'm a regular there - and as a got couple of minutes of free time decided to say couple of compliments to a really great place.  After renovation,redesigning,remastering and rethinking - everything became even better - food is creative and properly presented. Wines selection very interesting  -  they've got some wines from Croatia which are tasty,inexpensive though hard to find in NYC.\nOnly thing didn't changed - great service and atmosphere.", "author": "Sergio M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "Pretty much amazing.\nNot only can I get Russian food, but I can ALSO get grass-fed beef and cage free eggs!\n\nIt's super clean. Relaxed environment. Wooden tables. Lots of space. Friendly staff. Fresh-squeezed juices.\nDelicious vareniki (Russian dumplings) with the real Russian sour cream (which is pretty different from the American variety), good borscht, wash it down with some kvas. Ice creams, floats, and shakes from upstate ny dairies. \n\nYowza!", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "Recently went in for the first time for a late Sunday lunch.  The place is adorable and has a great sandwich menu.  It is so much more than just a \"coffee place,\" which is what I expected.  \n\nI thought our waitress was just darling.  So friendly and likeable and very honest on her recommendations.\n\nOh, and they have ice cream.  This may just be one of my new favorite local places.", "author": "Angel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "We only meant to use their bathroom...but ended up running into a friend who happened to work there. He gave us free ice cream! I got the green tea ice cream on a cone, and boy it was delicious. I'm sick and tired of having the same old shitty green tea ice cream at restaurants, but this was homemade and it actually tasted glorious. AND, if you were to pay for it, it would only be $2.95! Most other homemade ice cream places (Pagoto, Van Leeuwen) charge about $4.50 for one scoop!\n\nI hope to return someday and try something off their food menu. The place is cute and has character.", "author": "Kassy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-04", "description": "This place is ok. Ordered mussels which weren't cooked that well unfortunately. Didn't have much seasoning or salt in the broth which made the meal pretty bland. Good Rosemary fries. My boyfriend had the salmon burger which was ok too. Was pretty fishy (I know it's a fish) but I think that might be how it was cooked and it wasn't that seasoned. The potato latkes which are my fave were too fried. Kind of like when you put something in oil that's too hot. The apple dipping sauce was really good though. \n\nI've ordered takeout from here and it was great, but my last visit was an expensive blah to be honest.", "author": "A U."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}