{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-04", "description": "I always loved the food here, but the service used to stink. In April, they renovated and switched out servers. The new atmosphere is much warmer, more inviting and a bit more formal. It's much improved! The food is still delicious, prices still reasonable, and now the service is excellent. Great renovation!", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "There was a huge sign that said this has the best ice cream in Brooklyn.  So of course I gave it a shot. \n\nOur party of five each sampled different flavors-I tried a couple of interesting flavors but I thought they were just ok (such as the peanut butter fudge).  We shared a pint of strawberry and killer chocolate-it was about 4-5 scoops worth.\n\nI will say that the customer service was great-the guy gave us tons of suggestions on what to check out next (in Brooklyn), he encouraged us to try the Russian food next time, and was just overall really friendly.", "author": "Lili K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-29", "description": "This was the perfect place on a cold Brooklyn night. The place was packed with people contentedly eating wonderfully updated Russian comfort food. \n\nWe had the potato dumplings and the grilled vegetable blintzes. They were fantastic. We finished up with an ice cream sundae made with handmade ice cream and topped with hot fudge. \n\nWe will definitely eat there again. This place has become a new favorite.", "author": "Justina N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "I had a great time at Karlofff for diner for diner last night; the stuffs there is amazing - very positive energy and excellent service.  The food is very suitable for summer - we had mussels and salmon salad.  The portion was big and the meal is delicious...  The desert is awesome.  I highly recommand for try.", "author": "Pearl C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Incredible Service and Yummy chicken soup! Dumplings are also a MUST-TRY!", "author": "Vicky Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "They have amazing ice cream and food the way grandmother used to make it. I've never been there during rush hour so not sure how efficient the wait staff gets when it's packed, but they seemed really nice and competent to me. They always let you sample ice cream flavours before you pick one. Delicious blinchiki, really good borsch, good vareniki. Kvas was a little unimpressive, but Russian pear soda was really good. \nThe decor and the ambiance are low key but warm and inviting. Good location too.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "I came after a huge downpour of rain on Easter, and I must say that I definitely enjoyed this nook.  I had the whortleberry juice, something similar to a sweet fruit berry blend.  It seemed as it were an extension of my living room.  It is adorable!  I had the varenicki, basically Russian dumplings, made of potato and meat, which was topped off sour cream and dill.  Following the dumplings, I had the lavender ice cream and it was creamy, smooth, and just melted in your mouth.  I would say that one must try their ice cream, for it is divine!  It says on their chalkboard menu that it is homemade artisan ice cream from Hudson Valley.  I want to come back and try at least 2 more flavors.  A bit of warning would be that there is a bit of wait for the food and the check, if you're in a rush or having major hunger pangs.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Had a delicious ribeye steak for 2 with a pear and goat cheese salad.  Food was really good.  So was the wine by the glass and the service.  This is the third visit but the 1st since they renovated.  i would highly recommend.", "author": "PJ L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Amazing trout with kasha n a killer ice cream, this place always makes me soo happy n makes me wanna live just to eat! Thank you, Karloff!!", "author": "Marina F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-03", "description": "I really want to like this place. But having been here twice, once before the renovation and again tonight, they still don't have their act together. It's a shame, because some of the food is really good. But the service is out of control, and the items described on the menu are not what actually appear on your plate. Not going to go back.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-29", "description": "Only been here once.  Will definitely go back.  \n\nWent in for lunch.  The menu is simple.  We tried an order of latkes (potato pancakes) -- it was a bit overcooked, but still good.  We also tried the Hungarian goulash and chicken rice meat balls.  Both were very flavorful.  In addition to the smaller tables, they have a huge solid wood table in the front.  So, it would be a fun hangout spot for a group.  \n\nMy favorite part of the dining experience was the desert!  Ice cream, oh heavenly ice cream.  They have some interesting flavors, which I find appealing.  Sometimes, I'm in the mood for something different, not the standard vanilla, chocolate, etc.  When I went, they had a \"beet and dill\" ice cream.  Sound weird, right!  But, it was interesting.  I liked it.  \n\nOh, and the service ... very nice  ;)", "author": "Mimi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "Salted pretzel ice cream cones and the chocolate chip cookie cones are awesome! Top it off with the stellar Hudson Valley Ice Creams--this joint's ice cream bar might be giving Blue Marble a run for its money.\n\nPlease note, I'm only rating this place five stars because I think any ice cream connoisseur should DEFINITELY try this stuff. As for the dinner food, it's only so-so. (The owner makes the food from his own homemade recipes. A bit risky, maybe they should get a real chef.)\n\nBut the ice cream flavors are so lovely, fragrant, and tasty. My favorite is the cappuccino-kahlua. The lavender is awesome. I've been here five times for scoops and every time has been amazing. \n\nBest spot for ice cream in Caroll Gardens, hands down.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "This is my new favorite restaurant. When I first discovered it, I went three times in a two-day period: dinner, brunch, and just to hang out and drink coffee. I can't think of any other place with this versatility. They have a large community table in the middle where you can just get coffee and snacks, which is great for a lazy weekend afternoon. Their brunch is fabulous, and their dinner is great too.\n\nAnd, of course, the amazing ice cream. The beets and dill flavor is shockingly amazing, and they get new flavors almost daily.\n\nFinally, their staff is consistently friendly. Whenever I ask for a taste of a flavor of ice cream, I notice they always grab a couple extra tasting spoons because they know that I'm going to want to try more. Very nice.\n\nMy only complaint, if you can even call it that, is that their signage doesn't seem on par with the type of restaurant they are. I walked by it countless times thinking that it was just another diner, without really checking it out. They need some cool looking old Russian sign or something out front. But whatever, now that I know about it, I go several times a week. Love it!", "author": "David A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-05", "description": "(2 guests on 11/1/12)\nService...... totally non-existent.\nGlass of wine took forever to receive.\nWe specifically asked our waiter to bring our soup before the meal..\nHe brought the main course having completely forgotten the soup, and our request.\nThen made up some lame excuse about the kitchen not used to doing it that way.\nPortion was small. Ordered the salmon. Just average.\n\nThis place has gone down hill since the renovation.\nI will  not be going back.", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-14", "description": "If you are looking for healthy, homestyle food with a friendly waitstaff this is your spot. If you are looking for BK chic super salty trendy food, there are a bunch of restaurants that fit that description in the area~ but Karloff is not that. This is wonderfully crafted food that my husband and I enjoy once a week when don't feel like cooking at home. Wine and beer selection is good and the stuffed cabbage is to die for. The ambiance is relaxed and the decor is very pretty. Good, clean, delicious food!", "author": "Rox F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "The love comes through at this place.  I never knew blintzes could taste this good! Or a thousand other things on their menu. Dumplings. The soups.  All awesome.\n\nThe kaiser roll deli sandwiches are probably the only thing that doesn't excite me here.  A little disappointing and overrepresented on the menu. Go for the real dishes.", "author": "Jordan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-20", "description": "Pros: good, creative food!\n\nCons: bad milkshakes- over priced and more milk than ice cream.\n            slow service. they need more help in there.", "author": "j U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-08", "description": "Had a $100 gift certificate for Karloff, so came with my family on a snowy Sunday evening. When we went to pay and use our gift card, they explained that it was 7 months from when the gift card was purchased, and that they are only valid for 6 months. They refused to accept our gift card (mind you, the place was empty on a Sun night, and we nicely tried explaining that we live around the corner etc.). After much arguing and explaining that their gift certificate policy is ILLEGAL (see link below) they finally agreed to let us use it. \n\nOverall - food is mediocre, service is pretty awful (the one other table that was there came 30 min after us and got their food before us), staff is extremely rude, and their gift card policy is illegal. Will not be returning to this restaurant. \n\nThe Federal law says that gift cards purchased from a store can't expire before 5 years.  New York had no laws when they passed Federal legislation covering gift cards in 2009 so the Federal law overrides the lack of NY state restrictions.\n\nhttp://www.scripsmart.com/federal_gift_card_law", "author": "Alison L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-13", "description": "Mediocre at best.  Came in here on a quiet Saturday around 4:30 needing a late/light lunch.  Wait staff was pretty rude and didnt know what was on their own menu (we asked for farmers bowls, they brought us soup bowls and when we were like we asked for the farmers bowl, the guy looked at us like we were crazy and that doesnt exist--we actually had to point it out on the menu).  \n\nIts so cute and looked like it had a lot of potential, but it would take a lot to actually make me come back here... maybe starvation, or if their entire wait staff was abducted by aliens, then replaced with nicer more polite cylons.", "author": "Mother H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "I know of no better Eastern European food in NY, and it's one of the absolute best places in Cobble Hill. Olga is a dream, the varenikis are better than anything you can get in Brighton Beach, and the specials are always intoxicatingly good. We even had them cater our wedding, at which the food was the highlight. Such a special place; don't miss it.", "author": "Greg A."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}