{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "It's been a while since I've come here but Kitchen definitely feels like an improvement from the Karloff days. The space just looks so much brighter and more inviting. As a Russian, I rarely go out for Russian food. What Russian restaurant can make a better Russian dish than my mother? (none!) But Kitchen at Cobble Hill is pretty conveniently located and has some of the home staples I might occasionally crave when my mom isn't around. It was also the perfect place to break our Yom Kippur fast. They even had a post yom kippur special menu! My favorites from last night were the deviled eggs, latkes (which were awesomely crispy) and avocado toast (you can never go wrong with avocado toast even if it isn't exactly a Russian staple). The matzoh balls in the soup were a little too hard for my liking but it's not part of their every day menu so I'll let it go. Excellent service. I'll be back!", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "I really enjoyed my dinner here last night. The restaurant is beautiful inside and the service was highly attentive (the server even brought us fancy shots on the house) and they could not have been sweeter to us. I ordered the burger and it was honestly one of the best burgers I've had in the neighborhood if not the best. My friend had the roasted chicken and loved it. \n\n(Also, the bathroom is very clean, there was a scented candle burning in there, and they use hand soap and lotion from Rituals!)", "author": "Cesca B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "We were looking for somewhere to eat the other night.  We happened to come upon this specific restaurant.  Passed it at first, in trying to make a decision and then ended up dinning here.  Everything was exceptional.  From the decor (simple yet effective), the hostess (warm), food (fab), drinks (on-point), and service.  No complaints!  I will be seeing them soon.", "author": "Josephina H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-26", "description": "This place has a great menu and everything looks like it would be really yummy. I came here with a friend who was visiting from out of town, and she has an egg allergy so it's nice to find a place that has other options like pancakes (which is what she wanted). \n\nWe came here on a Sunday expecting it to be busy, but it wasn't. We were happy to be seated right away but it took way too long for anyone to acknowledge us afterwards. Finally we ordered, and the service was just unacceptably slow. There were probably about 2 other tables who already had their food, and we were stuck waiting for 30 mins on a simple order. \n\nThe food was mediocre at best, and way over priced for the taste. I could have made everything at home, it would have been cheaper, and tasted better. \n\nPros: cute atmosphere, good menu in theory, and cute decor. \n\nCons: poor service, mediocre food, unreasonably long waits.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "This place was absolutely awful. We showed up and they were \"all out of everything\" including 2 of the 5 choices for wine. Instead they brought be the worst wine I have ever had, it was in a weird bottle with a \"Kitchen\" label as if it were homemade wine. It was awful...and still $11. The staff was so terrible and inattentive. They also messed with the music and it made the speakers make a deafening screech and pop three times. I will never go back.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "We were in the neighborhood and folks who'd just left the restaurant said it was good. We were excited -- peoples' plates looked good and the menu seemed interesting. I ordered an egg salad sandwich and the side of brussels. My cousin got the \"perfect chicken sandwich\" -- what a misnomer. There was barely any chicken on it. We both were really underwhelmed by our sandwiches. My egg salad left A LOT to be desired. The tomato in it was literally FROZEN. And the egg salad claimed to have lemon zest in it which I couldn't even taste. The brussel sprouts were delicious and the french fries that came with the sandwich were super taste -- that's why I'm giving 3 stars. But otherwise this place was inconsistent and it was an overall lackluster food experience.", "author": "Erin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-26", "description": "The food was good but the portions were ridiculously  small. When they brought our check they told us they only take American Express or cash. You have to tell people that upfront. Post it on your door. And stop being cheap by not paying to accept Visa. I would not go back. Sad!", "author": "Julie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Lots of mixed reviews but chose it anyway because I needed a quiet restaurant to take my parents with healthy options. The service was very nice attentive, the ambience was lovely. It was half empty at dinner time and I'm not sure why because we enjoyed it greatly. Food was very clean and lots of vegetarian options. Would return again especially with parents.", "author": "Em L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-28", "description": "Pricey lunch options. Got the chicken avocado kale salad and the chicken soup with meat dumplings. The food was good, but NOT worth the price. Also, because of a seamless mix-up, my order didn't get submitted for an hour later, after it was submitted. So the food took FOREVER to show up. Won't be ordering from here again.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Kitchen is our go-to restaurant in the neighborhood. They have a great and cheap lunch menu as well as wonderful brunch and dinner menu. The place works for a business meeting as well as meeting with friends or date-night. We love the atmosphere and food and always try out their new desserts which they put on display regularly. Heavenly!", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Went to a movie at the cobble hill cinemas and stumbled upon this restaurant. Not only was the food delicious (highly recommend the beef and pork dumpling appetizer, NY strip steak, and butternut squash ravioli), the atmosphere is great for a relaxed Friday night dinner. They also had a really cute game of bingo going and had one of the kids at a nearby table participate. Quiet enough to still have your conversations at your table but engaging enough to be endearing and if you won, you got a free dessert or drink! Doesn't hurt that the cocktails are also really great (blushing rose and the strawberry mojito were so good it was hard to just have one). Would definitely recommend.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Update: we went for dinner and although the service was slow, dinner was fantastic!!\n\nWent here for brunch. It was quite good. The eggs Benedict with chicken sausage was perfectly cooked and the spinach underneath was a nice touch. The waitstaff was very attentive - and very kid friendly. The waiters were smiling at my 8 month old, whereas other waiters at other restaurants have looked down upon families with babies. My husband got the cheeseburger, and it was very good as well. It was a tiny bit greasy and had to be eaten with a knife and fork- but the taste was quite good. The French fries and the mustard dipping sauce did not disappoint. Will return for dinner", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Stopped in for lunch.  Place was empty.  Got the salmon burger and salad.  Salmon burger was huge and fresh, as was the side salad that came with it.  Both were extremely tasty.  NOTE: they only take Amex and cash.  So come prepared.", "author": "Lou B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-29", "description": "Had a bad experience, food was fine.\n\nOrdered the Benedict with chicken sausage, waitress asks how I want my eggs (eggs Benedict get poached), I told her poached.  No big deal. \n\n20 minutes later (yes it felt too long, plus the restaurant was 25% full or 75% empty depending on how you look at it :) they tell me there is no more chicken sausage left.  Okay, not sure why that took so long to figure out, but I'll take the ham.  She comes back quickly this time and says they don't have that either.  Okay, I'll take the smoked salmon.  The Benedict was pretty good, unfortunately it only came with half a handful of home fries, kinda weak... \n\nMy wife orders the chicken sandwich.  So it is 30 minutes later since we originally ordered. The sandwich comes without fries, it comes with the salad.  It so happens that my wife on this rare occasion wanted fries.  The waitress says well you have the option.  Well we would like fries we tell the waitress.  She should have A) asked what we would like with the sandwich originally and B) the default should have been fries, everyone and their mother gets fries unless they make the decision to be healthy FACT.\n\nSo, we both have some food now and we are waiting for fries.  15-19 minutes go by and we have heard nothing on the fries.  I ask the waiter are we getting fries.  She says, oh well the fryer is out so we are making the fries on a pan.  THIS ALL MAKES SENSE NOW, the waitress never gave us the option for fries because she knew there was no fryer operational!  \n\nWife and I say sure please get us some fries (we've completed our meal practically).  Then we are waiting 10 more minutes and I say to my wife, there's zero chance these fries are going to be good from the pan, because that's not how they normally serve them here.  I ask for the check and the waitress offers the fries to go.  I say no we have been here for an hour and all we have been told is that you don't have 20% of the menu and you are going to bring us terrible fries AFTER we are done with the meal. \n\nWhile wearing a big smile, the server was simply awful.  This menu is super tight, which is fine, but at least carry the menu items or inform us right away.  They were out of chicken sausage, NO FRYER and Ham.  \n\nOne meal my wife and I can never have back.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "Great food but horrible service. Waited 1 HOUR for the food. The only compensation they offered was a coffee and an ice tea.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Stopped here on a Sunday night and what a delightful surprise. My party started off with the latkes and actually the dumpling and Brussels sprouts bowl - amazing! For entrees we each enjoyed the chicken, salmon dish and veggie burger - all very delicious. And what a treat - restaurant was pretty quiet so we were able to have an enjoyable evening. Would recommend for a hearty, comfort-filled meal.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Went back here for dinner, service was a bit worse, they seemed a bit overwhelmed. Otherwise, the food was mostly quite good.\n\nDrink: Baltika 6, I think it was 7 bucks. It's an honestly good Baltic Porter (as in a sweet Eastern European style Porter.)\n\nIf I had to add this as part of the review, it's a 3.5/4 star beer (for it being a good Russian beer) at a 4 star price\n\nAppetizers:\n\nHad:  Varenikis: Smashed Potato Dumplings | creamy mushroom sauce | 10\n\nOK Varenikis, reminded me of some smaller places with similar texture/flavor. Mushroom sauce was a step up from the normal though. 3.5 Varenikis, 4.0 sauce, 3.75 dish. There were 6 of them for the price which is reasonable (for Cobble Hill.)\n\nTried: \nVegan Borscht | 6 \n\nOddly did not come with any dollop of sour cream. OK flavor. I've had better Borscht before but I have definitely had worse. Refreshing.\n3.7\n\nDinner/Side:\n\nHad: \nChicken Liver Sandwich | creamy chicken liver pate, shaved egg whites on toasted dark rye \u0026 pickle | 11 Same as before just 2 bucks more\n\nNo real difference in terms of size. If anything, I don't mind it being 2 bucks more as it was still definitely worth it. I think they should add a mini-pickle or something on the side to cut the richness but it is so good.\n\n4.7\n\nCrispy Brussels Sprouts: 7\n\nExcellent, super crispy, good portion. 4.3\n\nTried:\n\nPan Seared Idaho Trout: lake trout, caramelized cauliflower \u0026 buckwheat kasha risotto | 19\n\nI don't like trout much but the fish here was cooked really well. Didn't try the cauliflower but the kasha is delicious, super nutty.\n\n4.0\n\nGrilled Vegetables \u0026 Goat Cheese Sandwich | grilled zucchini, portabello mushrooms, yellow squash, \ncarrots \u0026 goat cheese on toasted dark rye | 10\n\nTried it, was pretty good. Bread as before worked well for the sandwich contents. Good vegetables.\n\nDid not try: Chicken and Avocado Sandwich, I didn't try it as I don't like avocado. He enjoyed it.\n\nDessert:\nWell, I kinda got dessert\n\nI ordered the \"Russian Honey Cake,\" aka Medovic. it came with poached pears and was 7 bucks.\nInstead, I got a cake for 9 bucks with a berry sauce, which was listed as Smetmanik (which is a sour cream cake.) I love the former dessert while the later was OK. They also said it was honey cake which is weird since I know exactly what honey cake is, as there is an amazing Russian bakery near me called Taste of Home (http://www.yelp.com/biz/taste-of-home-llc-fair-lawn,) which has 2 different types of honey cake.\n\nI'd probably give the Smetmanik a 3.0, though this is probably more the situation rather than what happened. I mean, if it wasn't that it was clearly posted that it came with poached pears, I would have assumed it was the secondary type of Honey Cake sold at the other place.\n\nThe place is still around a 4 for dinner, maybe a bit less than 4. I'd say to stick with lunch/brunch though.", "author": "Glenn C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-19", "description": "I see why the reviews here are what they are - nothing spectacular yet a decent experience. One of the few places open for a weekday breakfast in a sit down restaurant. Coffee was good but the omelette was bland. The service was friendly and quick. If I'm around and need breakfast I'll stop by.", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Excellent! Great food and atmosphere! My favorite restaurant in the neighborhood! I recommend the farm bowl!", "author": "Kali M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Cozy and attractive spot for delicious comfort food - especially on a weeknight instead of cooking! Enjoyed the lemon chicken and beef stew and friendly service.", "author": "Tracy U."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}