{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "Perfect meal would remind me of home if I were from Eastern Europe.  I had chicken soup with something like kreplach floating in it.  Reminded me of great homemade matzoh ball soup base.  Fantastic pirogies, borscht, and chicken liver sandwich with salad.  Small portions make this place affordable for trying lots of things.  Recommended highly. Olga will make sure you have all you need.  My vegetarian fiancee loved the vegan borscht.  We were visiting NYC for 5 days and this was our favorite meal among many fabulous dining experiences.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-18", "description": "Hit this place up for Valentine's Day this past February as they were the only place that would take reservations same day. We had a four or five (I can't remember) course meal that included an appetizer, dinner, and dessert. Solid food, just nothing really worth remembering (probably why I can't remember what I ate there).", "author": "Dan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-17", "description": "One of my favorite lunch spots in the neighborhood. Soups are all pretty great and I love the reuben, unconventional though it is.\n\nLemon ginger tea is also an excellent hangover remedy.", "author": "Riot D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-22", "description": "The restaurant's space was beautiful and the food was decent, which is what merits the 3 stars. The service, as others have commented, was horrendous. Went here on not a busy day, at an off-time and waited 20 minutes before one of multiple waiters took our order. Also had to take the initiative asking for the check.\n\nThe menu itself presents a nice range of options but the food falls a bit flat, especially the kale and grilled chicken salad. I guess if you have over an hour to burn waiting for your lunch i'd go here. It's lovely scenery.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "This place is great from the moment you walk in. Beautiful but casual ambiance. Always playing great music.\n The food, home made soups, Russian comfort food, long list of teas/ coffees. Ice cream! \n The staff are so nice without pretending.\n Great for quick bite or a full meal.", "author": "Kelvin J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-19", "description": "Went the other night with a groupon.\n\nI'm just gonna cut to the chase.\n\nService-GREAT\nPotato latkes-Undercooked\nBeef shortribs with sweet potato mash-Yummo\nAmbience- cute and romantic\n\nWill I be back...prob not....\nat least not without a groupon.", "author": "Juliana S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-11", "description": "Food was pretty good and reasonably priced but the service was poor and VERY SLOW. Also they only accept cash and Amex. The bar was out of hard cider and the bar tender didn't really speak English so he brought us hot apple cider instead. Then he had a snotty attitude.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "One of my favorite places! They recently redid the menu - half the new menu is VEGETARIAN friendly, taste good too - vegan brat is what my friend had and it was yummy.\n\nFrom the appetizers, I can recommend the mango latkes, as well as the Vareniki. Great twists on eastern european classics. \n\nMake sure to ask about their specials! They are quite good.", "author": "Robert M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Four stars might be a bit generous for Karloff, but the staff were friendly and the service was timely and polite, so I bumped them up to four.  The mushroom vareniki my wife had were great - rich flavor, cooked well, done just about right. I had a salmon tartare burger that was on special and my only criticism would be the name since it was cooked, so not really tartare in the traditional sense.  That said, it was delicious and cooked well, not overdone, the bun was soft and fresh too and the side salad was simple and had a great flavor, light dressing, solid.\n\nI think we'll be back.", "author": "Lucas C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-08", "description": "Food was decent but cold, and the service was terrible. They got my order wrong not once, but twice. Went there for brunch and the restaurant wasn't that crowded. Coffee just ok and not hot. And even though not crowded the place was very noisy.", "author": "Hugo L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "We were walking along Court St when I spotted Karloff and decided to venture in. That turned out to be a smart move, because the food was a bunch of awesomeness. Olga was fantastic and friendly. She made our dining experience exceptional. She knew the wines, and her suggestions were right on point. We started with the Russian meat dumplings, it was amazingly yummy. The Kielbasa and red cabbage dish fantastic, simply fantastic. The braised oxtail dish is to die for, the meat fell off the bone, it melts in your mouth. What rendered me speechless was the lavender ice-cream, the scent, the flavor, texture\nand consistency was on point ... creamy, velvety, and smooth!! I will be back again!!!", "author": "Roberta R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "The Fish Soup was great. Service was a bit weird seemed short staffed when we were there. Infused vodka was good also.", "author": "Efrain R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-30", "description": "After reading other reviews it appears that the owners did a renovation to give the place a face lift in order to charge more for their food and wine.  My boyfriend and I were lured in by a host outside the restaurant who mentioned a $5 special wine tasting.  My boyfriend immediately commented upon the fact that the main design decision had been made was to drop all the money on the top of the bar which was made of marble.  In general the redesign feels a bit uncertain and self-concious.  \n\nThe service was relatively attentive although a bit insecure.  Our waiter didn't know how to  pronounce the names of the wines he was serving.  The food was pretty fresh and tasty but nothing unique or inventive about any of the preparations or flavors.  \n\nThey did send out desert which was thoughtful, although the fried cheesecake seemed to be a bit stale.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "Not good for parties with multiple people; great for intimate dates and quiet dining.\n\nI was looking for an easily accessible place in Brooklyn with an Eastern European flare to celebrate my birthday with a small group of people. Karloff had excellent availability for making reservations over the holiday season, so I ended up giving it a shot. Based on my experience, Karloff doesn't lend itself well as a venue for celebrating with multiple people. Even on a Saturday night it was pretty subdued and didn't quite fill up. An older couple near my party's table kept looking over at us disapprovingly as we drank, conversed and said toasts (as you'd think would be proper given the Russian-themed menu), as though our celebration was causing them discomfort. It's not that we were that loud--it's that by contrast there was more of us than anyone else and the space was filled sparsely. There was also no music. In retrospect, I think the presence of music would have helped each party focus on their own conversation and not have to hear one another, and would've created more of an atmosphere. One other annoyance--the waiter who brought us our orders had no idea which person ordered what dish and asked us each time a dish was brought out whose it was, which I found a bit odd. \n\nNo complaints about the food. It was quite tasty.", "author": "Ina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Came here on a Saturday afternoon. Brunch was served until 4pm which was nice.  The food was delicious ordered eggs benedict, came out quickly.  Would come again.", "author": "John K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "We love Karloff! They really care, which you can taste in the delicious food and tasty drinks. It took us a while to try the place, and now we go back almost every week for brunch. (The bloody mary is divine.) Surprisingly huge variety of gluten free options too-with a very chill vibe. Go!", "author": "Liza K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "What can I say:  we have been here several times and we were never disappointed.\nThey have one of the best Kale salad, French Fries and Virinaki with Brussels sprouts.  We will be back again!!", "author": "Ellen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-16", "description": "Went here after dinner with my boyfriend and his mother for dessert and coffee. This place had a weird vibe. \n\nIt's way cute on the outside, but the service was pretty crummy. They each ordered a dessert, my boyfriend also got an ice cream cone, and I just stuck with a glass of wine. 30 minutes later, they each had all of their desserts, and I was still waiting on the glass off wine. After asking for it a second time, they brought it over; not a generous pour. My boyfriend ordered a latte; they served him a foamy latte mess, with scorched milk. His mother ordered a cappuccino, and while her drink did have /some/ passable cappuccino microfoam, it was mostly a milky espresso with a dollop of the 'right' kind of foam on top. \n\nI don't recc this place for coffee, especially if you're a coffee snob... you'll just cringe as you watch them steam your milk, with no fingers on the tin... thus, burning it. The 2 stars they are getting is for the how quickly my boo devoured his ice cream cone; I'm assuming he enjoyed it.", "author": "Kathleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "My husband and I go to Karloff frequently and we also order from them delivery. I must give them a well deserved 5 stars since over the years it has been really good food, consistent, good friendly service and never too slow.\n\nThe roast chicken is my husband's favorite - it is reallllly good, takes longer to make so expect to wait a little longer, you will not be disappointed. Crispy skin, tender meat, rich gravy, smooth buttery mashed potatoes.. Awesome dish anytime, but specifically on cold wintery days. I think they even won a (local?) food award for it, but don't quote me..\n\nMy favorites are too many to mention:\n\n1. Meat Vareniki. SO good, I am of Polish background so grew up eating Perogis, these Vareniki rule over Perogies, less doughy and the caramelized onions are made perfectly. Some reviewers have not given them such high marks related to other Russian restaurants-- I cannot say as we don't go to many Russian places. They are, simply put , GREAT and I always order them.\n2. Trout and bacon burger. At first I thought odd combo, but it's a great sandwich, besides bacon makes everything better! BUT, more importantly, the burger comes with the rosemary fries, which are excellent.\n3. Deviled Eggs! I LOVE deviled eggs and no one serves them.\n4. Salmon Nicoise Salad is great. I have asked for low salt though as on occasion I thought it a touch salty, but that seems to be an issue everywhere we eat out now (perhaps it's me!).\n5. Trout over Kasha (forget the name) is amazing, some kind of horseradish coating? Served on Kasha with roasted cauliflower - really good.\n6. Burger is a grass-fed beef, short rib meat, also delish and again those fries! So much crispy rosemary, love them.\n\nWe have had their brunch, equally good menu.\nThe owners also really seem to care about their bar having nice selection and the cocktails are good. They also offer a good selection of wine, I like dry white wine and they always have something nice. They will offer a taste of wine, beer or even the vodka if you seem unsure. We rarely order dessert so cannot say, though we have heard positive comments about the ice cream.\n\nTheir location is on a kind of weird commercial block without too many other restaurants right next door, so I do think that has the negative affect of people not noticing them. Selfishly we do like that it's sometimes emptier so we can hear ourselves talk, but of course it's not good for any restaurant to be empty. They have a big screen with Russian old movies often playing which is quite fun. The owners are very sweet and friendly as well. If you have yet to try this place, PLEASE do! We want them to stay in business especially since I need to get my \"Vareniki fix\" every once in a while!", "author": "YouGoGir L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "Everything was excellent. Service is A+\n\nFood was amazing. We shared the potato latkes which were perfect. I got the salmon and my husband got the burger-both were amazing. The ice cream tastes like a babushka made it from scratch in the back. The waitress was so pleasant and attentive. Cant wait to go back", "author": "Rina T."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}