{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "Solid choice when you're looking for a place with room for your last minute brunching whim. Friendly staff, likable decor and a solid menu. Nothing too out of the ordinary offered, so it should please the picky eater.\n\nI got the potato latkes, good for gluten free diners like me. I thought they were quite good, though a bit over fried. I enjoyed the apple sauce on the side very much. In the end, I do wish I tasted more potato less crisp.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "First time in Brooklyn and a friend took me here on a Sunday night for dinner. He loves that place and he just miss the food here so much. We both had Bolognese and it was really good. \nI was surprised that the place look dead since their foods and drinks are good. The waiter was so nice. \nI think this place deserves more recognition.", "author": "Jane L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-12", "description": "On busy Court Street street parking is limited ($2 per hour).\nThis cozy space is near the corner on Court Street and is ADA accessible.\nAll on street level.\n\nNot a huge selection on menu although it was sufficient.\nService was excellent.\nWait for food to come out was average.\n\nQuality of food was great for one (Eggs Benedict with housemade chicken sausage on a bed of spinach). The taste was different with the chicken instead of ham but it worked. The Hollandaise sauce was what made it really tasty. The other dish was slightly better than average (Quiche with salad and bread on same plate).\n\nI was happy the eggs benedict came with home fries and small salad (on same plate) as I would have still been hungry without these extras. The other dish came with the same.\n\nThere is a full bar there so if you need spirits while there, no worries.\nWe don't drink alcohol typically when we go out so I can't comment on their spirits.\nIt seemed like a family and community friendly location.\n\nFood prices were moderate high.\nWorth the visit for brunch (didn't have dinner there).\n\nBon Appetite!\nCarson", "author": "Carson T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-19", "description": "My fiance and I brought my father and his girlfriend here for a pre holiday dinner and I thought it went very successfully.\n\nWe started with an order of latkes for the table which comes with caramelized onions and homemade apple sauce. My dad loved this dish, but for me it was ok. (I make better latkes, hehe.) However, the apple sauce was out of this world. I wish they had given us a larger portion of it. It was enough for the two latkes, but barely enough for me to bathe myself in, like I would've wanted.\n\nI ordered one of their specials, the shepherd's pie with mushroom gravy. It was delicious. Heavy with thyme. I added a little bit of salt though to enhance the flavors.\n\nMy fiance ordered the chicken marsala and he enjoyed it immensely! I didn't even know he ate chicken marsala!\n\nMy dad ordered the spaghetti bolognese and his girlfriend the chicken soup. Both of them were members of the clean plate club.\n\nWe would've ordered dessert here as well, but they only had one option, bread pudding, which we weren't really feeling.\n\nDo note, that when I tried to make a reservation via Open Table, it showed that it was unavailable. However, my fiance called directly and was able to make a reservation, no problem. And the restaurant was fairly empty for a Friday night. (Though it was rainy.)", "author": "Katie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-03", "description": "3.5 stars.\n1. Service - wonderful, very attentive. (Oddly enough, we were also the only ones there at noon on a weekday.)\n2. Food - we ordered a couple of dishes, including the farm bowl which comes with two eggs over easy, brussels sprouts, and cabbage dumplings. The brussels sprouts were perfectly cooked and seasoned, and the dumplings were delicious. We also ordered the pancakes, which were flavorless and rubbery (which is particularly sad if you love pancakes). The organic syrup was a really nice touch and the only thing that made the pancakes edible. \n3. Ambience - The ambience is beautiful, elegant, and peaceful. Think shabby sheik without the shabby! The floral centerpieces are gorgeous and the whole place looks like it's ready for a photo shoot.\n\nWeird factor: at the end of our meal the waiter (owner?) asked if we would write a yelp review in exchange for free dessert. What made it even more uncomfortable was that he asked if he could read the review after it was written. \"I want to see what you write,\" he said. This makes it impossible to be honest if you have something negative to say (I assume he knows this, which is why he asked to read it). Also, restaurants are not supposed to bribe their customers. I've been yelping for a long time, and this is the first time something like this has happened. It was so awkward.\n\nOverall, The Kitchen is a good restaurant with lovely ambience and wonderful service. Skip the pancakes and skip the bribery, and you're golden.", "author": "Ray J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Fabulous food at reasonable prices, cute place and very attentive, friendly and thoughtful service. We'll definitely go back!", "author": "Miriam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "This cute little spot in cobble hill is full of wonders. Soothing ambiance and beautiful decor, simple and tasty menu, and delicious expertly crafted cocktails. We were warmly welcomed by happy and professional staff memebers. They went out of their way to accommodate us with a special dinner item we requested. Highly recommend, will come again.", "author": "Fabian L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-02", "description": "The most horrible restaurant I've eaten at in NYC. 3/5 meals had issues: Legit hair ball in the salad, raw burger (ordered well done), and entirely incorrect meal (ordered capris sandwich on a baguette - was served unmelted cheddar on burnt multigrain bread. Waitress was sweet and clearly overwhelmed.. only server for the whole dining room. We ended up leaving.. 3 strikes and we're out. Needless to say I will never be going back.", "author": "Kenzie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Stopped here for a quick afternoon lunch. I like to come by sometimes. ( food always served so fast to the table) My friend and I ordered farm bowl and borscht soup this time. Both were pretty good! The place is intimate, casual, well lite, clean. The stuff is really friendly and attentive. I love it.\n\nWill have to stop by again to try their  vodka-infused cocktails :)", "author": "Bibi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Came here with a friend for a brunch and it was very quiet and we were seated instantly. Food was reasonably priced, and I got my eggs benedict for $12. Came with salad and potatoes. It was a good, better than what I was expecting after reading the reviews for this place! And then I used the Yelp check-in deal for a free slice of carrot cake that we split. So we had a pretty solid brunch for an incredibly affordable price and I can't complain about that. Give it a chance.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "I have been here on two occasions and on both of those occasions, I ran into problems. I was there last night and it was significantly worse than the already challenged first time. The only reason I would suggest you come to this restaurant is if it is at a convenient time and place. It is almost directly across from the Cobble Hill movie theater and that is what brought me there for these two visits. How to quickly summarize this restaurant, I would say that the quality of the food is mediocre and the service is beyond subpar. \nYESTERDAY:  entered at 6.32,\u0026 didnt receive entrees before 7.35. there were 2 servers and 2 bussers, for the entire establishment, and this understaffing was beyond obvious. I barely even knew who our server was  bc  we mostly interacted with a busser who then apparently carried the message to the server, like a game of telephone. on this occasion I happened to be quite hungry so I was naturally annoyed that I was not even able to order a drink, let alone any food, for over 20 minutes. We finally ordered one cocktail each as well as 3 crostinis as an appetizer-the appetizer arrived at the table over 20mins later \u0026we still hadnt received our drinks which I then pointed out. In another 5+minutes, our drinks arrived. I got the Hemingway daiquiri($14) and was disappointed taste-wise and presentation wise. Knowing how slow everything there went, we also ordered our entrees at the same time that we ordered our appetizer. We got two entrees and shared them both. (worth noting that the last time I was there I ordered a burger(about $15) \u0026asked that the aoili be put on the side but when it arrived, the aioli was on the burger but my partner knew complaining would cause another great delay so she had to wipe all the aioli off the burger.) Yesterday's Burger I ordered with cheese and when it finally came out, there was no cheese but as during our last visit, we didn't bother mentioning it, fearing how much time that could've taken. Our second entree was Pasta Bolognese(about $12) and it was tasty enough but not at all memorable. I also found it interesting that they did not offer any parmesan cheese and\u0026upon asking for it, a small side was brought to the table. This might sound a little nitpicky but since I ordered a burger on both visits, with fries on the side, the tiny amount of ketchup brought with the dish was something I again, \u0026on both occasions, had to ask for more of. On the plus side, the crostinis ($4 each) we ordered were very good - tried a spinach based one \u0026 a hummus based one.\nWe had one dessert on our first visit and it definitely didn't taste like it was homemade and once again I would have to say it was just mediocre. \nDecor, underwhelmed - tiny vase w cheap half-dead flowers that reminded me of a funeral.\nImpatient and annoyed,  I  was very assertive in asking for the check  on my own  as opposed to waiting for someone  to come to our table and ask if we were ready for it. Overall, my visit yesterday was almost stressful and anxiety provoking because so many things were done so inadequately... and I was definitely not prepared for or anticipating the whole experience to be over an hour and a half. If I hadn't pursued having the check brought to us, I'm guessing the experience would have been at least 10 minutes longer.", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-01", "description": "CASH + AMEX only. When has anyone ever heard this????????\n\n1. The food was fine, but they were missing some menu items and failed to inform that they substituted ingredients before serving us! Then asked us if it was okay after they set the food down on the table? What kind of restaurant etiquette is that?!\n2. The menus posted outside were not accurate to the menu being served on the inside of the restaurant. They told us the \"menus changed recently,\" but why is it still being advertised in the window? Take it down, you made new menus so don't tell people you're serving food you don't have.\n3. This would be a 3 star review if they accepted major credit cards. They don't. They also don't tell you that anywhere outside the building or on the entrance, so they get you at the end by saying \"it's cash or AMEX only and there's a $1 ATM in the back.\" I'm sorry, excuse me, you don't take credit cards but you take AMEX? What kind of shady business dealing is this? Also the ATM in the back is not like one I've ever seen before.\n\nOverall majorly dissatisfied, had high hopes for this place, but will not be returning. I hope whatever replaces this restaurant gets its act together better than this place.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "We went here for a private dinner party and took up a good portion of the restaurant (15 of us!)  With large groups, small restuarants can have a hard time, but the Kitchen did an amazing job with us!   Our glasses never went empty, the food was delicious and fresh.  Here's what we had with my personal/preferance ratings: \nCrispy Potato Latkes - 5 \nPear and Goat Cheese salad - 5\nPotato dumplings with musroom sauce- 5 (One of my favs!) \nMains: Salmon - 5 (so fresh!!) \nBeef Stoganoff - 5 (delish comfort food!) \nQuinoa Bowl - 5 really refreshing\nBeef Boulainesse w/Spaghetti  - 3.5 (we weren't great fans of this one - but that may be because all the rest filled up everyone and I don't really eat much meat.) \nThere were a few other things, that I just forgot cause I took to long to write this review, lol. \n\nService- 5\nAmbiance - 5\n\nWe all had an amazing time and can't wait to go back!", "author": "Sha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "We totally love this wonderful restaurant!  We've been for brunch, lunch, dinner, and even ordered in. Everything is delicious, service is great, and Olga, is the perfect owner and host. BTW there are no better potato pancakes anywhere.", "author": "Beth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "I hosted my girlfriend's birthday party here. It was smooth sailing from the moment I first messaged Olga about the event. I had actually come in here once beforehand just to try their food and I loved the vibe. \n\nOlga invited my girlfriend and I to have a drink with her and talk details. She answered every question we could throw at her and then some. I had a party of 29 people and we all had an amazing evening. Olga let us put up decorations for the party and we even had a little photo area. \n\nThe staff were all very courteous and even shut the lights off and played Happy Birthday for my girlfriend when we took out the cake. the drinks were also just the right amount since this restaurant and Cobble Hill as a whole is not really a \"drink until you throw up\" kind of place. All in all I have no complaints and I'm already recommending Kitchen at Cobble Hill to all my friends.", "author": "Benjamin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "There isn't a cuter or more pleasant restaurant in the neighborhood! Olga and her staff were so friendly and inviting! The food is delicious, and the menu will entice everyone from the most difficult toddler to the most difficult foodie.\n\nBroad range of cuisine, with something for everyone -- including the best Tirami Sù in brooklyn, and thats saying something!", "author": "Nick N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "I would have to say this is one of the most amazing experiences I've had with a food and drink/rental space business! The host that I worked with was extremely accommodating and did everything she could to make sure the surprise party I was planning went off without a hitch! The waitstaff was incredibly helpful and attentive and the restaurant itself is absolutely gorgeous!!! The food was very tasty and all of my friends/guests agreed and everyone was very nice! I couldn't thank them enough times for their hospitality! I would most certainly recommend if you are having an event or just going out for a nice dinner, lunch, or brunch to highly consider Kitchen at Cobble Hill!", "author": "Shinnell B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "The ambience of this restaurant is wonderful. Very pretty and well lit- our server was very kind and helpful. I was there around 6pm on Saturday and it was not very crowded. Not sure why though because it was amazing!\nWe all had delicious watermelon margaritas and shared the beef dumplings appetizer. You will lick the plate! I had the \"artichoke fondue\" which was TOTALLY AMAZING! More plate licking.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "Food was a bummer. Latkes were way over cooked touch with a fork and shatter. Ordered Marsala Chicken with mashed potatoes. Chicken was smothered in a soup of sauce and soupy mashed potatoes. What Kitchen is great at is cocktails! Hot toddy and Old fashioned were both excellent. Food 2 stars and drinks 4-5.", "author": "Samantha P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-11", "description": "Service was atrocious, food not much better. Took TWO HOURS to get our food which included a kale salad, chicken marsala and a pasta dish. No apologies, although someone from the kitchen brought out tiny cups of what seemed to be red pasta sauce and said they were 'trying new things' in the kitchen. It was gross. I also can't stand when nobody refills your water glass and completely ignores you. The place looks adorable, but spend your money elsewhere.", "author": "Lori R."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}