{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "We enjoyed post-renovation Karloff's.  The dishes were a nice size (on the small side, but you can eat yourself obese in Carroll Gardens, so this is a welcome change).  Everything tasted good, but nothing completely blew us away.  The latkes were probably the highlight of the meal for me.  My only complaint would be the prices.  $23 for four slices of seared tuna on rice?  Two of their beers are $10!!  The customers are definitely paying the price for their cute new interior and the four months they were closed.  Dinner for two with one appetizer and one drink person ran us $85, which is on the high side for what we got.", "author": "Kelly F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-10", "description": "Having this food on a freezing day like today is exactly what doctor ordered. Soup, soup, soup! I needed it so badly, and it was great...along with the meat dumplings - yum! Can't wait for them to DELIVER, it's really annoying to schlep even a few blocks in this ungodly weather!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-13", "description": "I went for dinner for the first time since they renovated and changed the menu. Everything was good. They also have unique draft beers that were delicious.", "author": "Yad J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "I've now been here about a half dozen times, and each time has been a great experience. The staff is very friendly, especially the owner, and the food has been top notch and comforting. So far I've tried their lamb katleva, both over mashed potatoes and as a burger, and their cod which was amazing. Very homey, a nice stop at any time of the day.", "author": "s. b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "When it comes to Eastern European cuisine in the city, you basically have a choice between Brighton Beach, that is let's face it, kinda weird, dirty and for most of us far away and Lower East Side that has couple of places like Veselka and Kyiv, that are however had lost their roots and are as far away from authentic as they can get. There is a new kid on the block, however and me and my friends had stubled upon it yesterday in Cobble Hill. The place is great! Interior is simple yet very warm, food is delicious, prices are what they suppose to be and overall experience is great! Food actually tastes like it used to back home! Add to that mind-blowing flavors of icecream, great tea and coffee selection and you got yourself Eastern European restaurant to which you actually want to return! Highly recommended!", "author": "Anton F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "The service here is unbeatable.  My fiance and I visited and were attended by at least 4 different people whenever we needed anything.  Our waters were refilled without needing to flag down anyone.  Our waitress made excellent recommendations for the menu and even the hostess stopped by to ask how our meal was going.  Food was great as well, atmosphere was romantic and very interesting.  Loved it.  Would definitely recommend it.  AND, it's literally across the street from the Cobble Hill Cinema, we decided to make it a dinner and movie.", "author": "Kelly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-03", "description": "this place might do lunch/dinner well, but brunch needs a lot of work!\n\nStaff was mostly nice although very laissez-faire and our interaction with each staff member was laced with youthful attitude and pretension. Forgivable in nyc to a point, but then came the food. It was as though someone had given an 8 year old a few beers, and then set them loose in the kitchen to make our brunch! \n\nThe food was cold, poorly prepared, poorly presented, and poorly served. And overpriced... two greasy pancake-pucks, undercooked, flabby bacon, and eggs served without asking how i wanted them prepared. The server actually said \"Oh, i forgot to ask how you wanted your eggs, but this is how i usually have them\" and then curtly dropped the eggs off, turned and walked away from the table! Amazing. \n\nOn the bright side, the coffee is good, the juices are tasty, and the ice cream looked great, so hopefully brunch will catch up with their other offerings.", "author": "adrian c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "For what it is, Karloff is fantastic.  Casual urban coffee shop, neighborhood meeting spot, this is a fantastic addition to the neighborhood.  The inventive drip coffee processes are neat and tasty.  The menu - including an assortment of latkes, stuffed croissants, crepes and spit in the eyes - is fun and satisfying.  The big communal table up front is the perfect place to rock up and read the paper, enjoying your cup of Sunday morning joe.  Really psyched this place is in the 'hood.  Huge improvement over the tea lounge, it's predecessor in the space.", "author": "Josh G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "Fantastic and authentic food and setting. A medieval Slavic castle sort of dining experience, without being hokey. Portions are enormous.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "We needed to find a place a for our rehearsal dinner in a pinch for approx. 20 people, on a Friday night(!).  The owners and staff at the Karloff were so accommodating and attentive (before, during, and after the event). We ordered off the dinner menu and specials menu--and everything was really light and fresh tasting. They managed to serve our large group efficiently and really helped make the evening feel special. We found the whole evening to be an excellent value: we got a wonderful \"private party\" kind of experience with just a short notice dinner reservation. Thank you for a helping us celebrate!", "author": "L S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-08", "description": "Whenever I pass by, this place is always packed... After trying their brunch today, I see why.    Love their french toast w/ fresh fruit !", "author": "Honest R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-31", "description": "This place is really a subpar Veselka.  It has the same basic aesthetic as so many of the new places in the neighborhood, which is nice enough but pretty standard in Cobble Hill.  The food is fairly indifferent--it's very greasy and not very flavorful.  I shiver to think what previous posters who mention how cheap it is usually pay for mediocre food--definitely overpriced.  It is a weird mixture of a coffeeshop vibe, but seems more restaurant--they don't have wifi nor do they seem to encourage people hanging out with coffee, but the food is expensive and not very good, so I couldn't really figure out its raison d'être.", "author": "Adria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "Unique menu...good service....pleasant ambiance....infused water is a nice touch...", "author": "Jo M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "After having a great drink there last week, went for brunch on a monday. We ordered latkes and dumplings as well as some coffee. After 20 minutes of waiting, without coffee or water refills we asked another waiter what was going on. She returned with the coffee, but waited another 10 minutes, so now we have been waiting for a half an hour, to tell us they were out of dumplings. Terrible terrible service. We walked out. Very disappointed, especially since the the place seemed so great.", "author": "H L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-04", "description": "This is a nice little cafe and I'll be back. I had the chicken balls and mashed potatos which comes in a tomato sauce. It was pretty good, not great. My friend had the potato latke which was good but a little greasy. Service was very nice but a little spacey/forgetful. Tab before tax/tip (with a lemonade) was $22", "author": "Will S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-21", "description": "Tried this place last night with friends. Unfortunately nothing was good. Latkes were way too greasy. Our main dishes came at different times so by the time my husbands dish arrived, my friend and I had finished ours. Beyond the bland food..stay away from the stroganoff, the dumplings and the \"chicken meatballs\", the waiter spilled water all over my friend. In such a situation, you would think they would offer something comped. His comment was \"if you order dessert, we will give you a free scoop of ice cream on it\". Needless to say, we didn't stick around for the desserts. We left, $100 poorer and VERY disappointed. Do yourself a favor and stay away.", "author": "J M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-15", "description": "I wanted to like Karloff. It's neighborhoody, friendly, and the menu is straight out of my grandmothers kitchen. I've given it 3 chances now and the result is always the same. The food sucks. It's bland and just not made well. Here's some examples: the Tsar salad is grilled romaine. Sounds easy enough. But they don't put any olive oil on the lettuce before grilling so it's just burned leaves. The soups have no flavor. Borscht, carrot ginger, chicken, and mushroom barley are all basically flavored water. Everything needs salt. The stroganoff looks and tastes like dog food. About the only good thing on the menu is the latkes and the ice cream. Yet the former comes with just a tiny dollop of apple sauce and the latter's scoops are embarrassingly small. I really wanted to like Karloff but sadly I just don't.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-15", "description": "The ice cream is good and the pretzel cone is good but the guy at the front counter the night I got ice cream (he's also been there other times that I've been there) is really not very nice. I have to agree with many reviewers that the services is really terrible and just kind of awkward. it's a total turn off. also, i'm underwhelmed by the food.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "This place is great--the pancakes are unique and interesting, kasha and eggs is an awesome combination, the place is clean and bright, and the service is terrific.  An enormous improvement on Tea Lounge, which used to be in this space.", "author": "Edward S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-29", "description": "Moms beware...Not stroller friendly! Owner rude to neighborhood moms!\n\nIt sounds crazy that this place is not stroller friendly since it is so large and spacious. Karloff became my new favorite place, especially for this reason, until the owner one day told myself and other moms that were in the restaurant during the day not to bring strollers. Does she have any idea what neighborhood she as opened her business in??? Even though  there were not many people in the place she insisted that she needed the room for other customers although the very next 3 customers that came in were moms with strollers. She really does not know the neighborhood and that a large part of her daytime business is going to be neighborhood moms meeting other moms with strollers. And it was not as if we were just taking up room and squatting. The place was fairly empty and myself and my friend ordered full meals (decent) with drinks and even got ice cream (disappointing) and coffee. She was downright rude - not a good way to start a new business!\n\nAlso, they have a sign up about limited hours for laptop usage and they designate areas in which laptops cannot be used...this place is full of rules and wanting to limit their customers. How sad for a new place to shut out so many people!", "author": "Rosa R."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}