{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "I love this place the food was great and there chocolate cake was amazing I would definitely recommend you to try this place for brunch", "author": "Abrahim M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-21", "description": "This place is a bit of an enigma to me.  First it always seems to be almost empty.  But, i suppose they stay in business from take out.  I order out from there from time to time and if you get it delivered, it takes forever. I live 7 min away so i tried picking up. If you pick it up, it takes forever.  Recently i picked up, Seamless said 20-30 min pickup. I showed up after 30 min, there was NOBODY in the restaurant other than a couple planning a birthday party there (so not ordering food), and yet I still had to wait another 15 min....for a pickup.  This used to be called something else (Karlov i think) but had a nearly identical menu and the food was much better. It was always on the pricey side but the quality made it worth it.  Now its touch and go quality-wise.   But the service (at least on delivery and pickup end) is horrendous.  Can't speak to eating in--who knows, maybe its better that way.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Great service... Great food... Great cocktails... Great date night! \n\nJust the right size - not too loud but nice energy. Simple farm to table menu. \n\nWe will be back!", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-25", "description": "This was my first time dining at Karloff. My boyfriend and I ended up going here on Christmas Day. Yes they were open!\nThe menu looked super appealing for a cold day so we walked right in. The staff was super friendly. \nEven though the place was packed, we got seated right away. \nI ordered the Russian Cola along with the famous Potato Latkes and borscht. My boyfriend ordered the latkes with eggs and a side of bacon along with the pork dumplings.\nEverything was Divine! The Latkes came along with the traditional sour cream and this amazing homemade apple sauce. I could eat the apple sauce on its own!\nWe ended our lunch with sharing the Cheese Blintz. Delish!\nThank you Karloff for being open on Christmas and that we got to enjoy such delicious food.", "author": "Jeny W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "I really wanted to like this place, but it is not worth the time or money. We were seated immediately on a Saturday for brunch around 11:30. We waited over an hour for our food without any communication from a server or manager. It wasn't until the table next to us LEFT because their food had taken so long did we receive our food. When it arrived it was oily and lukewarm. No apologies from anyone. When we received our bill we attempted to speak to the server and manager. The manager was apologetic and claimed \"it was the end of a busy push.\" That's not my problem! The manager then offered us shots? No, thank you. Didn't offer to cover our watery Bloody Mary or terrible cocktails. We spent $120 on a shitty 3 hour brunch. Never again. Don't come here.", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "The good was a good smattering of modern European dishes. It seemed slightly overpriced for the serving sizes. Wine list was mediocre with fair prices. The cocktails looked nice, but didn't try one on this visit. No need to make a reservation on a Tuesday night -- there was no one there when we walked in. By the time we left, maybe 5 tables were filled. The latkas were really good, wish there had been three instead of two for $9! The chicken soup was decent, but the dumplings were not that great. The modified strog was good, small portion though. We had a question about the AMAZING brussel sprout side and how it was prepared, and the owner came out and answered us and thanked us for our patronage.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "Kinda sucks cause this place has dope food but I haven't had such terrible service in a while...or ever. I felt badly for the wait staff but the food took probably an hour and a half and the waiters were clueless and seemed perplexed when we asked standard questions (eg asking for the check) Not sure I'd come back solely bc of the service.", "author": "Daphne F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "This place is great! Delicious food and very nice staff. I recently came here with family in from out of town and everyone loved it. They even gave us free dessert (homemade ice cream!) since we were celebrating.", "author": "Beth L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-26", "description": "I used to really like this place so it's a shame what happened tonight. FYI I've eaten at the restaurant and ordered delivery from then many times before. I had surgery today so as a gift my brother ordered dinner for my wife and me because he knows I like it. He put in the order this morning through Seamless for a 7pm delivery. 7 came and went. My wife finally called at 7:30 and was told the order is on its way. I live 5 blocks from the restaurant so we were frustrated for it to be so late. Another 15 minutes passed and my wife called again. This time we were told the food was never made. They confirmed they received the order this morning but forgot about it...or something. They apologized and offered to \"rush\" it, but we cancelled and ordered from another place. Why didn't they admit they lost the order the first time we called? And once they were told they'd messed up, why didn't they make the food? At least try to cover up the mistake...Of course the proper thing to do would be to admit a mistake was made and make an effort to rectify it. I understand errors happen occasionally, but I can't forgive being lied to and zero attempt to fix it. Bad service is a deal breaker. We have a ton of great options to choose from in our neighborhood, so no need to continue our business here.", "author": "David R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Was walking around the neighborhood looking for a dinner option and stumbled upon Kitchen.  I was extremely surprised by the items on menu and the taste exceeding all expectations. We started with the Farmers bowl which was incredible and a must order.  Their Brussels sprouts are some of the best I've ever had.  For the main course, I had an amazing wild salmon dish.  I was so happy to find wild salmon in the neighborhood and have since made Kitchen my go to spot for fish. The only request I have is that the other day I saw the word \"wild\" was removed from the name of the salmon dish on their menu.  While the newly named \"Scottish Salmon\" still tastes amazing,  I hope they resume serving the wild salmon.  The \"wild\" salmon was probably the best in the area and even in all of Brooklyn!", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "Ordered the \"salmon roll\" which turned out to be about a teaspoon of lox in raw crepe dough. They charged us for sparkling water even though it was offered alongside tap which was misguiding and a waste of 3 dollars. And to top it all of, they \"only accept\" American Express or cash. Their ATM didn't work for any of the members of our party so we ended up paying with visa which apparently wasn't a problem... the manager also came by at one point to ask why we were looking at her in a very combative manner. They also played dumb when we asked to get the sparkling water charge removed from the bill saying their is nothing we can do. They did take the salmon rolls off the bill because we didn't really touch them after the first bite. All in all it took about 2 hours and was a lot of stress. There are better places next door.", "author": "Emma W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "Thought we would give this place a try - after searching best places for breakfast in cobble hill. Five stars no way.  Ordered eggs over easy over potato latkas and well done bacon. 5 tables taken in restaurants and took over 30 minutes and eggs where way over done, hard as a rock and  rubbery. Bacon was not well done ether.  God news is the waitress was real nice and professional. I would go next store to the place on the corner - it was packed!!!!", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-22", "description": "My girlfriend and I used to come here all the time for breakfast, brunch, lunch and dinner. The food was always fantastic and the service was great as well. Since the renovation, things have gone down hill. Although the quality is still pretty good, the portions are noticeably much smaller and the prices are higher.  While this may be typical of some higher-end Brooklyn establishments, paying 6-8 dollars for a side of veggies and receiving 3 slivers of roasted pepper and a piece of eggplant, and paying $10.00 for a tiny half container serving of soup is beyond ridiculous.  I shouldn't be hungry after eating an entree. I understand that the renovation was meant to elevate the ambience of the restaurant  but we preferred the old decor, the old menu, and the experience we used to have.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-12", "description": "(3.5 stars)\n\nI'm going to be honest. When a friend said \"Let's meet for Russian food,\" I wasn't thrilled. I was expecting something very, very heavy - maybe borscht, and maybe  meatballs.  Nothing at Karloff screams Russian - in fact, much of the menu consists of sandwiches and salads, which made me think that it might serve them well to call this \"neo-Russian\" or \"modern Russian,\" or \"Russian inflected,\" because I suspect part of why their restaurant is not as full as I would expect is because others have the same image of Russian cuisine.  \n\nAs for the food, definitely start with the latkes ($8). They are the star of the show, and they come in an order of two.  We ordered the basic potato latkes which are like a slice of heaven, served with sour cream, apple sauce, and a pile of caramelized onions.  The sandwiches are very reasonably priced, and tasty enough (the veggie sandwich with goat cheese in particular is good -- the burger wasn't memorable, but was certainly tasty) and the salads are particularly fresh.  And points for incredibly friendly, attentive-but-not-intrusive service.  Additional points for what must be one of the most reasonably priced menus on Court Street.\n\nThe one comical thing that happened at Karloff - apparently they have a small screen at the back of the restaurant and they were projecting what seemed to be Fellini movies (oddly, with Spanish subtitles). Halfway through the meal, the diners all looked up to see an amply-breasted woman taking her top off and sticking her breasts in a man's mouth. This odd scene lasted at least a minute or two, and seemed like awkward dining room viewing material.\n\nCash \u0026 Amex only.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-23", "description": "Kitchen's delivery is an insult to its customers.\n\nToday we ordered a Quinoa bowl, Latkas, and a Chicken sandwich with a salad.  Upon arrival we came to find that the Latkas were without apple sauce, the chicken sandwich was with fries, and the Quinoa bowl could only be described as dry arugula, with soggy carrots, and barely any quinoa -- no avocado, no dressing, and no orange. But for good measure, they threw a ball of mozzarella. \n\nNeedless to say we were extremely disappointed that every item we ordered was either incomplete or wrong (or both). While we did enjoy a meal we had (previously) at the restaurant, we'd have to say that we will avoid delivery in the future. \n\nWhile the food is not bad, they will give you the wrong food.\n\n\nAddendum:\n\nWe called the restaurant and told them of the problem. They were very apologetic and quickly sent for the salad, the apple sauce, and the Quinoa bowl.  While the apple sauce was missing, we received the Quinoa bowl, which was very enjoyable.\n\nStill, this level of service would not be found at restaurants with a lower price point, and should not be acceptable for one such as Kitchen.", "author": "Benjamin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "Warning: portions are tiny! As in, very, very small.\n\nOrdered the fried pickles \"small plate/appetizer\" expecting, well, just that. The problem is, the plate was huge, the food was so unbelievably small. I uploaded a picture of it. It was literally one pickle, sliced as thinly as possible to take up more room on a bed of lettuce for $7 or $9, can't remember. It's something I cannot stand behind. Don't order it.\n\nThe ice cream is one scoop in a small coffee mug. It's almost a joke, honestly.\n\nNothing was served family style. it was a clean, well presented meal. All the dishes were tasty, well thought out and arranged in an attractive fashion, but you really need to order 2 main courses per person.\n\nService was friendly and somewhat fast, then again there were only two other tables at the time.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "We came for brunch on New Years' Day. It was really busy but we were seated almost right away. I ordered Bloody Mary(which was amazing btw), and my parents had coffee (they serve Stumptown yay). We had an omelette, eggs Benedict and a French toast, and it was delicious!! The staff is very attentive even though they were sooooo busy. I will definitely come back!! This place is a gem!!!", "author": "Liza G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Stopped in for lunch for the first time.  Brisket sandwich was on point and the staff.. McKenzie was super nice and attentive .. nice west elm look in the remodel..", "author": "vincent s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-03", "description": "I live almost right next to this place, so I want to like it. This evening was the third time visiting: the previous two were for brunch, today was dinner. The place has great potential because the decor is fab and the service has never let us down, but we have experienced the following same five flaws all three times: (1) Like many others have complained, I don't know of anywhere that accepts only Amex and cash (let alone doesn't make that fact obvious); (2) The portions are tiny. Two guys in our party had the artichoke fondue ($15) and were so hungry afterwards that we got ourselves a burger. And no, we're not enormous fatties. Previous experiences with sandwiches were the same. (3) The food is bland. One person had the butternut squash ravioli, another the farm bowl: we were all unanimous that there was nothing special about any of the dishes. (4) Style. The menu is so heterogenous that the place clearly cannot decide what it is: I didn't know it was Russian-inspired until I read a review here (and I lived in Russia for 5 years!). The menu has some Russian things, some organic veggie things, some standard American fare; it's part diner-food and part fancy restaurants. In short, the place just can't decide what it is. (5) The place is quite often empty. I know this doesn't prove anything, but if they took account of the four issues above, then maybe they'd start pulling in the punters. As I said at the start, I want to like this place, so I hope they take this management decisions soon.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Omg ! The chicken soup is amazing ! The dumplings are so tasty and the avocado toast was to die for x", "author": "Michelle B."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}