{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Hands down best brunch in the area. Always meet friend there to impress and spend time!!  Offering are many, food is fresh and coffee and bloody Mary's are great. I will continue to visit kitchen !!", "author": "David K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Wow! A great meal and excellent service. I regret not coming in before because Ive been missing out on some wonderfully executed food. Our table had the chicken soup which was super flavorful, a grilled calamari special which was outstanding, and a lamb special which was tremendous. The waitstaff presented the wine we ordered and offered tastes, which is an extra touch I don't often see anymore. I'm looking forward to my next visit.", "author": "Cristin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I had an amazing experience at Kitchen at Cobble Hill! My fellow bridesmaids and I decided to use this restaurant as a bridal shower venue and the owner was more than willing to accommodate our plans. We planned it back in February and had the bridal shower this past weekend. The food was absolutely delicious! My favorites were the Eggs Benedict, French toast, Crispy Brussels Sprouts, and Potato Dumplings! The guests raved at how beautiful the interior is and how scrumptious the food and service is. The waiters were there to make all the guests feel comfortable and attended to as we bridesmaids focused on hosting and playing games with the guests. Kitchen at Cobble Hill was a great choice and I look forward to going back again for brunch sometime soon!", "author": "Iris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Best Salmon Burger I've ever had. Great avocado toast. Fluffiest pancakes ever eaten. Definitely coming back.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "5 stars for the food. 5 stars for Olga, who is the friendliest and most accommodating manager I have ever encountered...I have dined at Karloff three times (so far), including once for my wedding rehearsal dinner.\n\nFor the non-rehearsal dinners, the meals were great. Lots of vegetarian options, a few gluten-free options, affordable and unique wines, and a decent price. The latkas are great, but extra crispy. The varenikis are great (I prefer the cabbage, my wife prefers the mushroom). The fish is always cooked perfectly. And nothing beats the blintzes. Always get the blitz!\n\nFor our wedding rehearsal dinner, we had originally asked for a reservation on a Friday night, but eventually opted for a buy-out for our 33 guests. The restaurant's decor was recently improved and the space offered a warm and inviting atmosphere. Olga worked with us to create our ideal menu at a reasonable price, something that was hard to come by at many other restaurants we considered. The whole staff at Karloff made everything happen seamlessly, setting up the space so we could have a quick rehearsal (our wedding was the next day at The Green Building in Carroll Gardens) and then enjoy a lively and delicious meal over the course of the evening with our group - we dined family style with a plethora of choices, which everyone loved. In the end, everything was perfect. \n\nMy only head-up is that they are cash and AMEX only. Otherwise, AMAZING for the area and price. Go to there.", "author": "Christian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "Our favorite neighborhood haunt. The food is divine. Everything is seasoned to perfection every time. So lucky to live near this treasure. Get the latkas, salmon nicoise, chicken dumpling soup, burger or BLT - you won't regret it.", "author": "Joshua R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "We came here on. Sunday afternoon for a drink. There was a good mix of people and the staff was very attentive. We settled on a bottle of Rosé which was quite good. Although we weren't here for food, the menu looks good and the space is small but inviting so we will be back soon to eat!", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "Love this place - great Russian food and a laid-back atmosphere. Celebrated my birthday here with a large group of ~15 people; service was very accommodating and catered to us individually, even though there was another large party going on at the same time. \n\nAuthentic Russian food and great service are a rare combination, plus it's much closer than Brighton Beach.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "My wife and I are there very often we are always surprised by how fresh and well prepared the food is! We've tried pretty much everything and could not suggest anything in particular, it really depends on what you're looking for. The menu is very rich going from classic Russian dishes to a fantastic American burger, lots of fish dishes. Money wise if you are on a budget or want to have a quick meal they have a special lunch menu for only $8!!! Cmon what do you buy with 8$ even a sandwich in a deli costs more!", "author": "Davide S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "i wanted to like this place as the decorations and vibes were all pleasant, but i have never...ever...had such horrible service as i did on a sunday night at Kitchen at Cobble Hill.  \n\nour appetizers took a reEEEaAAlly looonnnnggg time to come out, but nothing to fear since AS Soon As they got to our table our entrees magically appeared as well.  we juggled between trying the apps and eating our meals...it was lame at best.  the pierogis were good (could have just ordered those), but everything else i had including the deviled eggs and salmon salad were so overly salted that i couldn't taste anything else.\n\nour waitress was just not experienced.  her timing was horrible...embarrassing even.  we wanted to try some dessert, but again had to wait an insane amount of time just to have our order taken.  when it FINALLY came out...guess what?!?...it was wrong.  we ordered banana and chocolate chip ice cream but instead were served a lavender ice cream so soapy and floral that the only thing going for it was its capability to mask the salt taste leftover from the meal.  we sent it back and waited another 10 minutes to get the right ice cream.  at that point we were done...didn't eat the ice cream and didn't even receive an apology from the waitress!!    \n\ni wanted to like this place.  it was a fail on multiple levels.\n\nnever again.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "The atmosphere, food, and wine at this restaurant make it a solid neighborhood option. It is reliable, with a good selection, etc. A pleasant space and experience.\n\nAfter two visits, I remain frustrated by the service. Employees are kind, but the slowness, forgotten requests (to exclude peppers from a salad, or bring bread and butter to the table_) and a general lack of efficiency do affect the diner's experience. \n\nI hope the restaurant can find its footing service-wise, it will make this a more appealing option in the future!", "author": "Lily G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Sometimes the true measure of a great restaurant is not the place you are dying to go to on a Friday night, but the place you find yourself back at again and again and again...\n\nI would strongly encourage anybody who loves a warm atmosphere to try Karloff.  On Thursday nights, they have the most beautiful live jazz music.  Their hostess/bartender Olga make me feel more welcome than I do in my own apartment!  And I can think of no better way to spend a Thursday night with a friend than sitting at Karloff's bar with a glass of Malbec and their varenikes, which are T.D.F.  Their cheese blintz are also mind blowing.\n\nTry it, it will be worth your while!", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "I love this place, it is bright, beautiful and comfy. The food is great, I like especially salmon burger, which is very juicy, potato varenikis and latkis. They have a good wine selection with a very decent price for a bottle of wine. I definitely recommend this to my friends!", "author": "Liza M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "Maiden voyage was definitely better than expected. My girlfriend had the kale/chicken/avocado salad which she said was \"amazing\" though remarked that it could have included less chicken. I had the burger which was fairly strong but the bun was not my favorite. While it was grilled, just too dense for my liking. We shared the beef and pork dumplings to start. They were very good, and could have been enhanced by some sort of dipping sauce.\n\nAll in all, while not feeling like we were transported to Moscow, it was a pretty good meal and we will be back.", "author": "Adam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "This is my second time at Karloff.  And there are tons of cool changes.  First - the decor. Completely renovated and very stylish. They use a lot of natural wood and that gives the place a warm feeling.\nSecond - the menu and drinks. More food choices, sophisticated, tasty. I was lucky to sample a cheese cake that just came out of the oven. Served with blackberries it was so tender and fresh - I could consume a few more portions easily.\nBeer choices are unique. Now they have beer on tap too.  I like Karloff's wine selection.\nShould i mention that they bring ice cream directly from an all natural producer in NY upstate?\nThe place is very clean and it smells good inside. Being a clean freak I see this as a big plus!\nService is friendly and quick.\nI will be back soon!", "author": "Alex R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "I love everything about this place - the atmosphere, the friendly service, and the amazing food.  Also, the prices are very reasonable, and since I'm vegetarian, I was overjoyed to see how many choices I had.  Potato pancakes are the best I've ever eaten, crispy Brussels sprouts were out of this world, and the varenniki (dumplings), were heavenly!", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-22", "description": "Came here on a Valentine's date. It was only prefixed meals that night. Place is cute, far from the main subway lines though. Even though I had just recently recovered from a bad fever, and the food tasted decent, even with my stuffed nose. However, my bf who had full use of his smell said the food was very good.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "We have been going to Kitchen since it was originally Karloff, and decided to ring in the New Year there with a group of  20  (10 adults and 10 kids!).  Olga and the staff were incredibly accommodating and friendly.  The food was delicious, the atmosphere was upbeat/fun, and we could not have been happier.  Highly, highly recommend dining there!", "author": "Wendy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "LOVE Karloff. I have eaten here about 10 times. It's one of my favorite places in the neighborhood. Just really delicious Eastern European food with an American flare (or maybe it's the other way around either way it works). Everything I've eaten here has been excellent. And between my husband and I we've probably tried most of the menu. They just did a renovation and I went in for lunch and it seemed to be the same food -- only got a chance to see their lunch menu which was the usual so don't think the menu changed. I really highly recommend this restaurant. I kind of liked the look and feel of the place before it got renovated-- it feels a little less warm and rustic to me now but I'm still gonna eat here, of course. I hope Karloff sticks around for a long time.", "author": "D M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-29", "description": "Karloff is a strange fusion of Russian and New American.  Quite frankly, it doesn't really work.\n\nThe cold fish platter is a trio of whitefish salad, pickled herring which has been minced almost to a paste, and smoked salmon which is listed on the menu as baked.  It's served with a couple small piece of bread, some baby greens, and a cherry tomato.\n\nThe beef stroganoff is incredibly dry.  There is none of the creamy sauce the dish is known for to be found in the small bowl.  The braised oxtail over potato and parsnip mash would be bland except for an almost cloying sweetness of the red wine glace poured over it.  \n\nEverything is excessively salty.\n\nThe wines are limited, and the first one we tried was corked.  The others had little to recommend them.\n\nOne half of the wait staff, a young woman with a keen eye for her diners' needs, was pleasant, attentive, and very fast.  The other half, a friendly young man, was slower and less attentive and had a less than impressive command of the menu and wine list.\n\nNot a bad experience, but not someplace I will probably frequent.", "author": "Adam G."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}