{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "My husband and I came here before seeing a movie at the Cobble Hill Cinema. It's proximity to the theater is the main reason we chose it. The menu looked okay so we went in. This was around 11AM on a Saturday and there were many tables open. We started with avocado toast to split and I ordered the eggs benedict with spinach. My husband ordered the chicken sandwich. I asked if the spinach could be substituted with avocado but the server told me that wasn't possible. \n\nOur food came out fast! The avocado toast was good but very salty. When they brought out the entree, surprise! My eggs benny had avocado instead of spinach! It was very much appreciated. The eggs were poached perfectly, but the hollandaise wasn't super flavorful. My husband said his chicken sandwich was super flavorful either.\n\nThe meal was fine but nothing all that special.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Great spot in Brooklyn for brunch and hosting a party. I cohosted a Saturday brunch party for about 30 guests at the restaurant and the service and food were amazing. \n\nVenue (5/5): simple, beautiful, and elegantly designed. Tables along the walls and high top tables in the middle as dividers, with an open bar in the back. With the wide doors opened and two ceiling fans breezing through the restaurant, it reminded me of sitting on top of a cliff restaurant in the Greek isles. Our party took half of the restaurant and was comfortably able to seat our 30 guests.  The decor of the restaurant worked perfectly with our decorations. \n\nFood (5/5): 12 course brunch! For a brunch party, the owner, Olga, was very accommodating with our food selection. We selected 12 items from their party menu and all were delicious (we had 6 elderly, traditional Chinese ladies, and they all loved the food)!! The French toast was hands down the best I've had. It tasted like the bread was soaked in the cinnamon, milk, and egg bath for hours! The meat dumplings were so good when we tried out the food, we ended up doubling the order! Must try!! Eggs Benedict (guests were asking for seconds!) crispy Brussels sprouts, cheese blintzes were all perfectly made. If you like a little citrusy, the kale salad with avocado, Brussels sprouts and lemon dressing was a winner! \n\nService (5/5): service was amazing!! We couldn't have asked for more. With close to 30 guests, the servers managed to make sure the tables were never without food or drinks. Every attentive and accommodating. \n\nWill definitely go back!!!", "author": "May May K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-19", "description": "Not a good experience at all - the service was good and the decor is nice but that's about it. The menu sounds really good with a lot of good options however, my husband had the salmon burger ( which was a little tasteless ) and his fries were really soggy. My kale salad was very sad - a scattering of dried out grilled chicken, awful marinated carrots, a sprinkling of brussel sprout shreds. The kale was still tough as it was cleaned or treated properly. All that for an 18 dollar salad! I could do better at JFK airport. Definitely not returning.", "author": "Vanessa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Love love love that place! Service is flawless and the food guys... OMG,  hard to describe! You have to come over and try whatever you feel like or the helpful waiter suggests you. Might be hard not to like anything! Definitely will come again", "author": "Jeantoir J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Ambiance, food, wine and service-all deserve 5 stars when you come to this gem downtown Brooklyn.", "author": "Yelena K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-11", "description": "The service here was rather slow, and when the waiter finally came, he took our order before giving us water.  Food was alright, nothing to write home about. Restaurants was downright freezing. Overall experience very disappointing for this neighborhood.", "author": "Brenda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "My family loves coming to this restaurant for brunch. My 5 years old daughter loves their brunch pancake (kids meal). It come with fruits and veggie!\nKids friendly restaurant. My husband and I both had the egg Benedict. Very friendly staff and service is fast. Would recommend.", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Love this place. Super cute bar and restaurant. I've only been for lunch, but everything I've tried has been delicious.", "author": "Amanda W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-06", "description": "I was in the neighborhood yesterday, so popped in for a bite with my boyfriend. The interior is cute. I have to say, the service wasn't that great. There was something floating in my boyfriend's water, so we had to request a new water glass, my cocktail came to the table well after the starter plate was served/after my boyfriend got his beer, and we mostly had to flag our waiter down versus him stopping by to check in on the table. With that said, the waiter was totally pleasant and nice. \n\nThe food: we started with the beef dumplings. This was the best thing we ate- I could have eaten another plate of them. They are almost like miniature perogies in a delicious light green sauce. For our entrees, I got the BLT and my boyfriend got the smoked salmon sandwich. The BLT wasn't bad,  but the bread completely overwhelmed the sandwich. A delicious sliced bread would have been so much better. As for the smoked salmon sandwich, my boyfriend said it was more of an arugula sandwich with one very thinly sliced piece of smoked salmon. \n\nOverall, I thought the dumplings were a home run, but everything else lacked.", "author": "Kyle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "The elements of the Salmon Nicoise Salad are perfect! Loved the meal with an equally fine glass of white wine.", "author": "Mort B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "What an AWESOME find. Brunch was so delicious (do not miss the brussel sprouts or the french toast)! I love the decor and the service was great. Another bonus, the epic dessert including the ice cream selection -- lavender and ginger are my favorites! Oh, and they are cash and Amex only (the only downside).", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "Came here with my boyfriend the other night after seeing a movie at Cobble Hill Cinemas. Looked really great from the outside and decided to try it. It wasn't too busy (almost closing time but we didn't realize) and we were seated immediately at a table of our choosing. \n\nWe ordered the small plate of octopus to start, which was pretty tasty. We started with glasses of wine and I ended up moving to a cocktail suggested by the owner (who we only realized was the owner as we were leaving), who was incredibly helpful and kind the entire time, and it was delicious. For the meal I ordered the marsala chicken and my bf ordered the lemon chicken. I thought the food was a bit oversalted for my specific taste but my bf loved his dish. \n\nFor dessert, the owner once again suggested something-- this time, the tiramisu. I have a hard time choosing things, so I always ask for input, and Olga was so kind, courteous, and genuinely helpful with suggestions that she made the dinner just that much more special. The tiramisu was really large (more than enough for 2 people) and absolutely phenomenal. \n\nThe service throughout the night was awesome, from our normal server to Olga popping in often to provide anything else we needed. When I looked at the time when we were about to leave, I realized the restaurant had been closed for quite some time for the night, but they never once rushed us out and treated us with complete attentiveness.\n\nEven though the actual entree wasn't my absolute favorite, the cocktails, dessert and above all the service is why we plan to go back sooner rather than later. Awesome date night spot.", "author": "Aaron K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "Worst brunch ever! Came here with my two children at 10:15 for an early brunch hoping to have some breakfast before starting our busy Saturday. Well unfortunately we didn't leave until 11:45 due to the unbelievably slow service. The service wasn't just slow it was bad. Our server seated us and didn't ask us if we'd like something to drink. We literally chased him to let him know we'd like coffee with our brunch. After 30 minutes of waiting, they offered us a plate of fruit while we wait. I asked if there was something wrong and why it was taking so long. The response was nothing and our food would be out in 5 minutes. 15 minutes later we received our food. The food was ok but by that time my children and I were starving we'd eat just about anything. Finally after we ate most of our food, someone other than our server asked us if everything was ok, at which point we complained about the wait. She offered us dessert as a consolation. No thank you, I'd just prefer not to wait an hour to eat brunch. There were only 3 tables in the restaurant. One of which also complained about the slow service. Please don't open for service if the kitchen is not prepared to serve! Never returning here.", "author": "Cecille S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "We stepped into this place, that looked clean and fresh, hoping for a quick late lunch.\nThe place was empty except for one table with two people seating, so it looked like our hopes would be fulfilled quickly. \nA polite waitress immediately took our very simple order (1 chicken burger and 1 beef/pork dumplings in herb butter), and the drinks indeed came to the table quickly. \nThat was the end of our pleasant experience.  \n\nWe waited for the food for about 20 minutes, signaling the waitress to check with the kitchen what was going on. Then another waiter came to the table with an unappetizing open sandwich we didn't order (again - with TWO tables only at the empty restaurant, and with about 5 staff people going around!) and was quite confused and surprised when we said so. After checking with the kitchen(!) he ended up giving it to the other table (duh, who else can it be for??)...\n\nAt this point the original waitress disappeared altogether. \n\nWe waited for another 10 minutes, and were practically considering leaving the place, when the food arrived. When we tasted it, we deeply regretted not leaving before it arrived. \nThe plate of $10(!) dumplings consisted of nothing but 7 or 8 dumplings, covered by lots of melted tasteless butter with 2 small pieces of some unidentified herb. Despite that, we tasted one dumpling, only to find out it was so dry, tasteless and lukewarm, that we decided not to continue to eat the rest of the dish. \nThe chicken burger was not much better. Though the bun was reasonable, the vegetables that set on the lukewarm patty were ice cold. One bite from the burger itself was enough to understand that this too was dry and tasteless. As hungry as we were, we didn't bother to finish it. \n\nThe plates were still full of food when we asked for the check. No one asked how come we didn't eat any of the food that we waited for for so long. Yet another waiter asked if we wanted to take the food with us, and even after saying no, none of the staff people bothered to come over to our table to see what was wrong. \n\nWe decided it wasn't worth our while to talk to anyone about the food. We paid the bill and left, knowing we'll never be back. This was totally waste of time and money. \nCourt street has enough restaurants that offer good food and attentive service. Choose wisely and skip this place.", "author": "Rene P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Three food lovers who were not too hungry had 5 appetizers- watermelon salad, deviled eggs, potato latkes, Brussels sprouts, potato dumplings + nut chocolate cake- we absolutely loved everything!!!\nHighly recommend", "author": "Wendy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "We recently celebrated my 8 year old daughter's Birthday at Kitchen and being a large party (15 of us), we always tend to have challenges with service at most local restaurants. This was certainly not the case at Kitchen. We were so impressed with the staff and their attentiveness to our needs and several dietary restrictions.  The owner, Olga, checked in with me multiple times throughout the night to make sure everything was going well and I especially really appreciated the way they manage family style events.  We had a prefix menu that was completely customizable and shortly after we sat down, the wide array of apps was served --all delicious but my favorite were the beef and pork dumplings (out of this world!).  Once we devoured the apps, there was a nice break where everyone got to chat and mingle before the main courses were served.  We chose a mix of vegeterian, meat and fish dishes.  My favorites were the farm bowl, the risotto and the beef stroganoff.  Lots of folks at the party also really enjoyed the branzino.  For dessert my 8 year old got the craziest milk shake I have ever seen - topped with a whole slide of cake, macaroons, cotton candy, etc.  It looked like something out of a Willy Wonka movie.  It's not on the menu but if you're celebrating a kids event, this is a MUST have.  Overall, I can't say enough great things about this local place, their delicious food and how they really go above and beyond for their customers.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "I love and adore this restaurant. It's small but  clean, beautiful, and inviting. The staff is friendly and professional. You don't need to worry if you're unsure on what to order because the staff will recommend some of the best plates based on what you like normally. The owner, Olga, is a wonderful and sweet woman. She knows how to make a customer feel welcomed. \nThe drinks are amazing. I always have they're infused drinks. My favorite is the rose-strawberry vodka but I highly recommend to try all of them, if you can. The food is perfectly made. I never had a issue. \nI even brought my friends one night and they truly enjoyed the restaurant.\nI will always recommend stopping in Kitchen to anyone.", "author": "Caryn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Cutest place with great staff, and Olga, the owner, is too cute! So is Edgar! Good comfort food, and also has breakfast!", "author": "Meri K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "Karloff is one of those places that you always pass by, but never notice. I've actually had it on my to-do list for years but couldn't even picture what it looked like.\n\nLuckily, I was able to finally make my way here for dinner on a Saturday night. It wasn't full, but it was still lively inside. A lot of the other patrons were definitely Russian or Eastern European, which is a good sign.\n\nFor a starter, I shared the vareniki platter, which was a sample of all three types - cabbage, beef/pork, and potato. It's a little up there at $24, but you get a ton. If every person gets an entree, it could easily be an appetizer for 3-4. If I had to complain about something, it's that they were all on the same plate jumbled together and not organized, so it was a surprise figuring out what was what. I had like 4 cabbage ones and just 1 meat dumpling. Oh well, they were good anyway.\n\nFor a main, I had the lake trout, which came over cauliflower and kasha risotto. The cauliflower was delicious. Never had kasha before, but it looked like quinoa, and tasted like quinoa with less flavor. But the fish was seared nicely.\n\nThey also have some interesting cocktails, mostly made with vodka (duh). I went with the Fall Fashioned,m which was a rye cocktail with pears and walnut syrup. It was entirely too sweet, but it was pretty strong. They also have one of my favorite beers from my teenage years, Baltika #9.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "It might be categorized as 'Modern Russian' cuisine, but as far as I can tell, the only thing about Karloff that seems modern is the prices.* Otherwise, the beef stroganoff and chicken soup with meat varenikis seems exactly like what someone's babushka would've made centuries ago. In the best way. \n\nThis is hearty food that could sustain you through a bleak, seemingly endless Russian (or Brooklyn, this year) winter. It is perfect for cold nights when you'd rather throw on a huge sable** hat and swill vodka than leave your apartment. \n\nLuckily, Karloff delivers.\n_____________\n\n*Admittedly a bit too high, but the portions are large enough to share.\n**More likely, nutria.", "author": "Peter D."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}