{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "The croissants here are really delicious, and the coffee is good too. Still think the service can be a little weird.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "My daughter and I went here for lunch and in spite of the fact that she was slurping hot chocolate all over the table (and there was another table of toddlers who were not the neatest bunch either), they were so friendly, warm, and helpful (my daughter went crazy for the marshmallows AND sprinkles). The yellow split pea and bacon soup was outstanding. The latkes also delish...just wish they would let some of the oil drain out before they serve them...dripping with grease (but still good). A lovely, warm, unique addition to the neighborhood.", "author": "S. H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-17", "description": "Service was extremely slow.  The food was kind of bland and oddly priced ($8 for latkas but only $5 for a large egg sandwich).  The coffee was good though.  It also gets really loud in there.  I miss the Tea Lounge.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-19", "description": "had great bacon and eggs here this morning, the service was extremely friendly, the kind that is hard to find. the atmosphere is really comfortable, the ice cream that i tasted seems very worth going back for. will def visit again.", "author": "Kelly W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-02", "description": "Won't go back. There are so many other great places in the neighborhood to choose from...why pay high prices for extremely rude service.", "author": "Monica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "This is a great place--friendly owners and staff, terrific food, and very accommodating of gluten-free requests. The food is delicious, I only wish the menu were more extensive. We order delivery from here often and it's quick and the quality of the food is preserved despite traveling to us (this may be because we live very close by). I especially love the Idaho Lake Trout entree, which like the other options I favor is hearty and satisfying.", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-14", "description": "This is the best value ever considering that I ate half my plate and was gloriously stuffed!  The portion was indeed generous but it's more that the food is rich and hearty.  On top of that, the owners and staff Olga, Arturo, Dan and others were wonderfully kind and inspired.  Karloff's is also an ice cream parlor... I love ice cream... and they serve a variety of nifty  flavors i.e. salty pretzel, lavender.  They have a beautiful espresso machine and have elected to use locally roasted high quality coffee which gives them a leg up in that arena.  Go try it.  You've never had this type of food.  For dessert, let Olga smile at you.", "author": "Laura V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-16", "description": "Karloff is my new favorite place to eat in my neighborhood, where I am already spoiled by a crazy surplus of awesome places to eat. It's a very peculiar thing the way they have carried out to perfection a vision for a cafe-restaurant where the food is rooted in Russian comfort-food traditions but simultaneously rises to the best of organic, locavore Brooklynite food fantasies. It's ideal for brunch or lunch-- with sit-down service that leans more toward lingering-coffee-house vibe than full-on restaurant vibe-- but the food is unmistakably restaurant food, not mere snacks. The various breakfasts involving kasha, vegetables, and scrambled eggs are AWESOME and incredibly healthy, and the potato vareniki (dumplings) are carb nirvana. The servers are sweet as pie, a youthful troupe of emigres floating to and fro with a shy blush here and a bit of a lilting Russian accent there. They have silky, delicious homemade organic ice-cream in crazy flavors like beet and lavender. I love Karloff. Having said all of this, ahem, MR. KARLOFF, I HOPE YOU ARE READING: the chef for the past two weeks has been somebody different. You cannot fool me; I know my Karloff kasha like I know my own reflection, and something has changed, and not for the better. Your waitress said it was only for a week, but I went back ten days after that and am not convinced. Please bring him/her/them back. All I want for Christmas is the Karloff cooking I knew and loved.", "author": "M T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-07", "description": "My friend recommended this place and I ordered some take out...terrible. The soup tasted like dirty dish water with some dill. The latkes were the WORST I have ever had- greasy and burnt. Hey, if you burn something, why serve it? Also why charge way too much for it? I will never go back.", "author": "N N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-25", "description": "Went in for lunch today.  I was always a big fan of Veselka in the East Village and this place has a similar feeling.  They are just getting started but the food is already really good.  We had the pancakes -- which are different than diner pancakes.  Karloff's are lightly fried and served with both sour cream and maple syrup.  YUM!  We also had the borsht and latkes which both were excellent.  A excellent addition to the neighborhood!", "author": "Carolyn P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-11", "description": "We live right near by, so were excited to see a new place open where the old tea lounge had been. I don't think we'll be going back though. Here were the issues - you decide if they're deal-breakers. For some, probably not. \nCONS:\n1. Weird lighting: Too bright, at least for dinner. The tables end up being illuminated by the ice-cream display...glowing flourescent, not a great ambiance.\n2. We walk in, we are seated. The waitress comes by about 10 minutes later, although there is one other table there - it's pretty quiet in there. She's cute. \"Do you guys know what you want?\" But we hadn't been given menus... She points us to the wall, by the door, where the menu is painted. I know, it's big, we should have seen it, but we didn't...so we walk over, accompanied by the waitress, and make a hurried decision. \n3. Food is not great. Overwhelmingly buttery-flavored. What's up with that? Beef stew that tastes just like butter? Stroganoff, again, just like butter. I like butter, probably more than the next person, but really? Dumplings were fine I guess. \n4. It took us forever to get our food, although there were two other tables seated. \n5. What's up with the layout? I know this seems picky, but it is STRANGE when two new Court St. restaurants (Brucie and Karloff) open up a few weeks apart, a few doors down from eachother, and both have the same layout!! ...Which happens to look suspiciously like Ted and Honey... It works when you are a breakfast-and-lunch place, like T+H, but not really when you're doing dinner I think.\n\nPROS:\n1.The staff is really cute.\n2. Prices aren't bad.\n3. I hear the ice-cream is good.", "author": "b c."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}