{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-18", "description": "Cuuuuu-uuute!\n\nGreat coffees and caps, incredible ice cream and other dreamy creations (vanilla halvah and root beer ice-cream float? hello molly!).\n\nWasn't impressed with lunch. Lamb burger was crisped out with a boring bun. Side of veggies were drowned and disguised in a mucky gravy.\n\nWaitstaff was a bit of a turnoff, for the attention we could get of theirs.", "author": "Emily F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "This restaurant is amazing, great food, great atmosphere, very pleasant service! great wine and beer collection. Lots of healthy options, great for vegetarians. i will definitely come again. Also the prices are very reasonable. i am very picky with restaurants, but this place is very high on my list of my favorite dining places.", "author": "Tatiana S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-15", "description": "Where one scoop of ice cream really means only one scoop.  And the scoop they use happens to be about the size of a teaspoon. And then they charge 3.25 for it. A complete disappointment. \n\nBeen there for lunch too, it was ok, but at this point I will never return.", "author": "Tom G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "Taking over the intimate and beloved coffee shop that once was here by the corner of Court and Kane is Karloff. Karloff takes elements of a coffee shop, bakery, ice cream shop, restaurant, and your grandmothers dining room and puts them all together. The service here is very slow but also very friendly. Though they have a handful of smaller tables it's their large vintage wooden table taking up most of the dining area which makes it feel like you're in someone's dining room. I've never seen this place packed but if they get filled to capacity it might be awkward eating by strangers at such a family styled table.\n \nThe bakery section is limited but definitely worth considering. The coffee shop aspect of the place seems to bring in a good portion of their customers though their offerings seem to be far less then if they were exclusively a coffee shop. Their ice cream really shines in my opinion. Their ice cream comes from a small farm upstate and the flavors vary from the typical to the unexpected (like banana and cookies). The quality of the ice cream is as good as it gets though the prices and portions could use some work. The ice cream prices are a little less than Blue Marble down the street but still dishing out $3 or so for a tiny single scoop isn't going to earn them a 5 star review from me. Also running out of spoons and giving me a nearly unusably small sampling spoon to eat it with isn't going to do them any good. Luckily the ice cream was good enough for me to overlook this unfortunate incident. Their menu is on the smaller side but includes a lot of eastern European type of dishes at very reasonable prices.\n \nKarloff is my new favorite local ice cream parlor despite the price/portion size and I'm definitely going to come back to try one of their meals in the near future.\n\nUpdate: I've gone back and finally tried something off their regular savory menu. I got the dark chicken soup with meat vareniki (Russian dumpling) for $8. The prices here aren't a rip off but they're certainly not as low as I'd like them to be. Given the neighborhood and the quality of the food the prices are pretty typical. The soup was rustic and had shredded dark meat chicken, lots of herbs, and 6 dumplings with a small amount of salty beef in each. I was a little turned off that I had to pick out 2 bay leaves, a small chicken bone, and a non-edible chicken part of some sort, other than that it was a good soup.  Of course I got some of their amazing ice cream after (turns out you get a decent portion if you get it in a to-go container), I don't remember the name of the flavor but it looked like chocolate with chocolate chips but it was actually mint, it was delicious (though the mint overpowered any sort of chocolate flavor that might have been going on).", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-09", "description": "The food rocks. I have been here a whole lot of time, and sure, on occasion, something comes out a little off, but overall - it's always a good experience. You can sit there all day after brunch and never feel hurried.\n\nYes, they charge for coffee refills. Normally I would object, but their coffee is amazing and obviously costs them a few bucks. So I don't mind.\n\nThe Big Breakfast is enough to get you through to dinner. \nI'm Russian, so I enjoy the awesome \"americanized\" takes on the food. Deserts are great (and authentic.) And, if you go for ice cream, I advise the \"beet and dill\" - no joke.\n\nThe owner is very sweet, she is usually there, at least on the weekends. Most, of not all of the staff is Russian too, which just makes it feel even more of a neighborhood, family place. A great way to start your Sunday. I just can't wait until they get their wine license so I can go for dinner.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "Walking in this place looked like a regular coffee house, but it turned out to have a huge variety of food- both traditional, Eastern European, and Jewish fare. I can't wait to visit again to try more of the more exotic dishes. \n\nThere is a long communal tree trunk of a table that is great for studying and creates a fun atmosphere. The staff was very friendly. My only gripe is that there was a $20 minimum (not including tip) for using a credit card so I had to order an extra coffee to go when the bill was only $18.", "author": "Jillian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-03", "description": "Everything I've had so far be it the ice cream the hunters stew to lamb burger has been solid.\n\nI knew his place was legit when I saw an old eastern european lady carrying a bag of pots and pans back to the kitchen on one of the first days it opened.\n\nWhere else can I listen to Little Richard and scarf down some delicious meat dumplings. Karloff is a welcome edition to the neighborhood.", "author": "Sheanon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "Delicious, all natural ice cream from upstate NY, coffee and friendly service make Karloff a delicious place for a sweet treat or quick pick-me-up", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-26", "description": "The food was pretty good, try their crispy potato latkes. We had 4 people in the party an everyone liked the food they ordered! The portions are small but not tiny as other reviewers noted. We went on a slow night and the service wasn't bad at all. The only reason they didn't get 5 stars from me is because they don't take American Express.", "author": "Andrey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-11", "description": "We had a great dinner. Good comfort food and yummy icecream for desert.", "author": "Ed S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-07", "description": "I hope the owners investment for renovating Karloff will be paid off and not close the restaurant. Been here several times pre renovation and twice post renovation.  The new decor and set up is nice. Food is fair, similar level as Brucie and Van Horn which is Karloff's neighbor restaurants. But for some reason Karloff is not as packed as those places. Karloff's russian influenced dishes would taste better in cozier smaller place. As they say, food tastes better in smaller space. The service is good but doesn't feel well coordinated. Having a front desk in a neighborhood restaurant can give not a welcoming presence, in my opinion. Their music selection can be improved. They play some strange German techno music.. whatever the music is, it does not mix with the decor or the food.. Need to hire a good restaurant manager.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-05", "description": "Overall: 2.5-3 Star\nFood: 3.5 Star\nService: 2 Stars\n\nNot sure how to rate. The food is great but service a little off. Went this evening with family on a Gilt City promo. 3 of us had wine/soda and my mother who wasn't feeling great waited awhile before ordering anything. Eventually ordered a hot green tea, fine, so apparently we fulfilled the \"4 Beverage Quota\" from the Gilt special because when we ordered one more glass of wine, they said the tea counted...not worth an argument but whether we ordered one or the other first, what's the difference? Place was empty yet they were constantly wanting to clear our plates when still finishing. Maybe it's better at lunch or takeout but the backwards thinking and hovering waitstaff at the wrong times was annoying.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-02", "description": "I wish there were more stars to give, because I would give more.\nKarloff hosted a very special family dinner for us, and not a thing could have gone any better. The food was amazing. The delicious food even impressed my Russian family, which no Eastern European restaurant has ever done before. Now I finally have a place I can recommend when people ask me where they can go for Russian food!\nThe vibe is just plain cool. I would come again for food, as well as for a glass of wine at the bar. They play good music, not too loud and not too quiet. You can enjoy your conversation, but you still hear the music and the atmosphere is lounge-y.\nThe service is flawless, and the owners are right there making sure everything is going smoothly.\nI really cannot say enough. I can't wait to come back for more Latkas, Vareniki, and Watermelon salad. Yum!!", "author": "Z G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "The brunch at Karloff is always enjoyable. Get a strawberry fizz.", "author": "Alexandra W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-03", "description": "This place is the absolute best. I love them. My friend and I go for brunch every Saturday because:\n\n- Their food is AWESOME. Is healthy comfort food an oxymoron? Maybe. NOT at Karloff, though! It's like someone's mom or grandmother who only cooks from scratch (with cage-free eggs and grass-feed meat from local farms) is cooking personally for you. \n\n- Their prices are awesome. I'm shocked that they can offer what they do, given that their ingredients are organic/free-range/etc. for their prices. Most entrees are between $10 and $15. Not sure how they do it, but I really appreciate it.\n\n- They have really, really nice servers. I do agree with what some others have said that service is not lightning-quick, but they more than make up for it by being genuinely sweet and welcoming...not something you find at any old Brooklyn restaurant. And you have the added benefit of being able to stay as long as you want at a table.\n\nAn earlier review said their \"lemon\" water was rotten. I agree that it doesn't taste like regular lemon water...because it's not lemon water. It's cucumber water! Delicious and a really nice touch.", "author": "A M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-16", "description": "The food gets four starts but the service is lacking. My only comparison is to Veselka on the LES, which I haven't been to recently, but I think is less expensive than Karloff. Nevertheless, I had chicken meatballs. It came with stew and kasha. All were very delicious. The vareniki reminded me of my childhood. The table ordered latkes, which were quite large so I took them home. Even when I reheated them in the microwave the next day, they were delicious.\nThe only negative is the service. The food came out disjointed; starters after main and I had to ask where my drink was twice, after the food came out.", "author": "Ariana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Came here for lunch with the fam.  We were walking down Court Street and saw the sign for latkes and beer and were sold.  I did not have the latkes personally but did try a bite and they were very tasty. \n\nI got the Cod Fish Sandwich with Grilled Onions, House Fish Sauce \u0026 Pickles and a German beer.  I love a good fish sandwich and trust me, I will remember this one.  First off, it was HUGE and had lots of sides, including sprouts, to fill it up. Second, the sauce was amazing, they put just enough on.  \n\nWe also got a side of home fries which were seasoned to perfection and cooked very well with just a little bite to them.  I really wanted dessert and tried a sample of the lavender ice cream but was WAY TOOO FULL to order any.  That sandwich was fillllinggg.  \n\nThe waitress was so nice, friendly, and knowledgable.  Around, but not nosey - just perfect! \n\nThanks Karloff for a delicious lunch, I will be back!", "author": "Athena W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "The food was Great! Service wasn't what was expected. Although they were very polite, my water was never refilled, I needed to continue flagging the server over for straightforward things like additional napkins and ketchup. Would recommend for a take out order.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "Perfect laid-back, quiet, and quaint ambiance - and relatively free of crying babies, too! They serve a great breakfast on weekdays. I had the latkes which were delicious, unfortunately when I went they weren't making the stuffed croissants but those sound great too. This will definitely become my secret go-to spot on those random Wednesdays when I have off and the rest of the neighborhood is quiet. Bacon and egg stuffed croissant, I will be back for you!!", "author": "Casey M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-28", "description": "Bland latke, lots of grease, over cooked 'over easy' eggs, onions that were cooked to within an inch of there lives and called caramelized, though they weren't. Too expensive. Can you tell I wasn't impressed? At all?", "author": "Melly T."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}