{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-18", "description": "Food was decent but we were informed at the end of meal we could only pay by AMEX or cash and were invited to use their fee-based ATM in back of the restaurant. They don't state this policy anywhere and it's clear they don't want new diners to know this. It also seems highly suspicious that they don't process credit cards - just AMEX charge cards (which typically charge vendors HIGHER fees than other credit). This suggests to me something's up at this restaurant.", "author": "William C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-11", "description": "One of the worst meals I have had in a long time. Service was pretty bad as well. it took 40 minutes to get an order of soggy fries and dumplings that were basically devoid of any filling. The pasta we ordered as our entree was meant to have shrimp and mussels and came out only with over-cooked shrimp. The salad to accompany the tiny salmon burger came without dressing. The whole experience was worse than mediocre. Other diners leaving at the same time as us echoed our sentiments and were equally upset about their experience. \n\nNever going back!", "author": "Gitu R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "I was trying to rate our combined experience with 2.5 stars, but somehow it wouldn't allow 1/2 star.  \nWe decided to check out the place yesterday after a dental visit.  The decor is very nice.  I ordered the salmon burger w/fries and a mimosa.  My partner, who is KNOWN by his family members to make great latkes, ordered the potato latkes.  \nFirst of all, most importantly, if you only accept cash or American Express, that should be kindly announced immediately, before asking to take anyone's order.  Waiting until after the customer has eaten and ready to pay can be a surprising and a very inconvenient awkward moment for the customer. IF this info is posted on a sign somewhere, you should not rely on your customers to see it.  The simplest solution is to simply announce it right up-front.  Luckily, we had more than enough cash on us. That was a critique made by another customer months ago that you apparently have not found necessary to correct.\nNow...My meal was great!  Mimosa presented with a lime zest twist was a great balance (for me) of champagne to orange juice, heavier on the champagne, just the way I expect them!.  The fries were very tasty, just enough salt, chrispy outside, tender inside. The salmon burger was nicely presented, cooked perfectly w/the herbed mayo on a brioche, red onion, fresh tomato and romaine w/a lot of fries on the side.  An ample meal to say the least.  Delicious! On the other hand, my partner's latkes...OVER COOKED!  No flavor/seasonings and deep CRISPY dark golden brown all the way to the middle, no soft potato...like two thick \"potato Crisps.\" Every time he cut into it, it kept breaking apart and crumbling away.  Crunchy all the way through.  NOT the way they should have been served at all.  My partner had to ask for applesauce and was promptly brought a \"1 tablespoon quantity\" in a teeny little saucer.  He should have been offered the options of applesauce or sour cream.  I was voluntarily presented with the same 1 tbsp sized saucer of ketchup for half a platter full of fries.  That's not being \"chic.\" Ketchup and apple sauce are inexpensive.  They should have been brought to the table in an attractive, but ample container.  \nOur waiter was pleasant and service was good, but appeared nervous. There was a slender gentleman w/a close-cropped beard and mustache who I assumed was the owner who appeared preoccupied in thought.  My smile wasn't returned.  Just a suggestion: its always a nice \"friendly\" gesture to return the smile, come over, say hello and ask about our experience.  It lets your customers feel like they're important enough to be there and that you genuinely appreciate that they've chosen your establishment.  We were one of only two tables occupied in the place on a Tues. afternoon. You may want to pay attention to customer suggestions as there are far too many other restaurants to experience.  Your goal should be to keep as many as you can...coming back.\nWe'll give this restaurant a chance to do a little \"damage control\" before returning to The Kitchen.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Was hoping this place would be good...but it was hugely disappointing. The service was mediocre plus they only take Amex or cash and failed to tell us this until the very end of our meal. \nAs for the food...the menu was appealing but everything we ordered was bland and tasted like it had been previously frozen and reheated. This restaurant doesn't know what it wants to be- comfort food, modern American ..but sadly the food isn't good enough to even decide.", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "I had the pleasure of hosting a baby shower at Kitchen. The owner was so kind, worked with me to offer a generous brunch menu served family style for a group of 25, at a price within my modest budget. All of my guests were pleased with the offering - particularly the pear arugula salad, potato, and meat dumplings. The French toast also got rave reviews. I was allowed to get in early enough to decorate, and was granted creative authority to execute my vision. Due to the family style serving, the tables had to be pushed together. I was very worried, as I learned this detail only after I'd decorated the tables! I was assured that the team would take care of it- and they did, seamlessly. The team was attentive, and flexible, they allowed me to play the guest of honor's favorite artist on their Spotify, which made the experience even more special. The Kitchen team made me feel that my event was priority, even while taking good care of their regular brunch crowd. Kudos to them, and I'd recommend them to anyone!", "author": "Khadeidra C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-03", "description": "Pretty good food, but SO ANNOYED THEY ONLY TAKE AMEX OR CASH! It's basically like they don't take credit cards since they don't accept most credit cards. But of course you can't tell because, unlike actual cash-only places, they don't tell you that they're basically cash only until you're handing them your Visa at the end of the night. Absolute garbage policy. I won't go here again because of this.", "author": "Samuel D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "The place is cute and appealing, and I wanted to like it, but we had a ridiculously bad meal. There were 3 of us. One person ordered the salmon burger and said it was okay, although the salad that came with it had a weird dressing. Another person ordered spaghetti al limon. It was basically a plate of undercooked pasta with not much taste, and not even a sprinkling of parsley to make it at least look appealing. Much of it was stuck together and inedible. I ordered the quinoa, which the menu said had spinach, Brussels sprouts, feta, carrots and cranberries. When asked how it was, I replied \"It's kind of like something they would serve in a monastery.\" There was no feta, no carrots, no cranberries. The waitress came by and we told her about the problems, she said \"I'm sorry.\"\nWe were ready to get our check and leave, and she asked if we'd like a piece of cheeesecake, on the house. Sure, that sounded good. So we waited. And waited. And waited at least 10 minutes for our free cheesecake, and when it arrived, I'm not sure what it was but it sure wasn't cheesecake. Tasted more like a quiche without much taste, I don't think there was any cheese in it. The ice cream that accompanied it was good.", "author": "Gail V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "I haven't written a review in a while, but felt compelled to tonight. This place is conveniently located near the movie theater, but now I know why it's empty on a Saturday night. The food is less than average. The latkes were ok, over cooked, and the roasted chicken was really dry and overcooked. Also the side of Brussel sprouts were cold and over cooked. The music was pretty bad, too. I don't recommend the food here. The service was the best part.", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "Really liked this little place. We came in for a late lunch before going to a movie nearby.\n\nMy bf and I both got iced coffee. It was soooooooo good. I love the way it was served. He had a burger and i had the chicken sandwich. Chicken sandwiches are hard to do well, they tend to be dry and flavorless. This one was delicious. Perfect amount of seasoning, and the aioli I thought was a nice touch. \n\nService was friendly and the space I thought was really cute. The right amount of trendy. I'd definitely go there again when I'm the area.", "author": "Roxane F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-22", "description": "Two other tables of diners on a weds night for dinner.  With seating were asked if we want flat or seltzer water so we opt for seltzer. What the waiter doesn't tell us tho is its $3/glass, we found out with the bill. \n\nNow on to the food.  Started with the soup of the day (roasted red pepper and cauliflower vegan purée). Texture was nice, lots of red pepper flavor. Latkes were pretty delicious, I'd describe them like thin cut hash browns loosely shaped into pancakes.  They were crispy and went well with caramelized onions and thick sour cream.\nWatermelon salad was small cubes with too much feta and a good amount of arugula. Mint flavor and dressing were good, just didn't impress me and wasn't as refreshing as I imagined. Beef stew was comforting like Babushka would do. \n\nService and food came out slow but overall I'd try again with a new menu.", "author": "Thy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-31", "description": "I do not usually do this but.....   I travel alot for work and I was in downtown Brooklyn approximately a year ago. I stumbled upon this cute little place (Kitchen at Cobble Hill). The meal I had was exceptional!  So much so that I brought my family for brunch and it was amazing!   Fast forward to the past weekend..  I was in the neighborhood with family and I said I know a great little place here to grab dinner.  All I can say is MOST HORRIBLE EXPERIENCE HANDS DOWN!!!!  From the moment I walked in the waitress/hostess was almost annoyed from our presence. We ordered some drinks and to my suprise it took almost 45 minutes... Serious!  Then we ordered appetizers to be told that 2 out of 4 things they did not have. They do not offer any bread and the apps took about 30 minutes to come out.  I could have felt with the bad service but after we got our appetizers I should have called it quits there!  The food was horrible.  The entrees were worse than the apps.   The pasta had no flavor and was so undercooked. The meat was overcooked and for sure was not fresh. You could just tell it was old frozen food.  I never complain at a restaurant because you never mess with anyone handling your food but I can surly say this place has done a 360 degree flop since last year. Along with this review I should also apologize to the people I told it was a great place to eat.  Please!! Save your money and go some place other than kitchen at cobble hill!   Trust!", "author": "John H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Celebrated my Valentine's dinner at the Kitchen. A quaint little restaurant in Cobble Hill that serves modern European cuisine. We ordered from the pre-fix menu, which had limited options, but was delicious. As expected, Valentine's night was pretty busy, but we were seated right away and received outstanding customer service. Our cocktails took about thirty minutes to come out, but we were given an additional complimentary appetizer along with complimentary champagne. The food itself was flavorful and tasty! And the quality of customer service was an extra bonus!", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "This place is cute, and definitely tastes fresh. We ordered the beef burger and beet and feta sandwich. Both were delicious and satisfying. The mustard that was served with the burger was the most amazingly tangy and perfect mustard I've ever had.", "author": "Marisa R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-24", "description": "I recently attended a private event thrown at this establishment for brunch. All of the food options here were extremely dry and flavorless except for the microwaveable bacon that sat on a bed of iceberg lettuce for style and the surprisingly good, but cold, mushroom dumplings. The drinks were weak and the bartenders were very easily overwhelmed and needed a lot more training. The venue is also very small so if you like to eat your brunch squeezed like a sardine, this is the place for you! Given that the party consisted majority black individuals in a very gentrified neighborhood, naturally management and onlookers were petrified to see us enjoying ourselves without violence! So they had to find something to complain about - now our dancing was seen as \"rowdy\" and the party was forced to end early. If only our dancing consisted of the Cotton Eyed Joe... maybe then we would have been seen as civil. The waitresses also got attitudes with us.... If only they had taken some of spice from their attitudes and put it into their food! Overall a shitty establishment. Buyer beware.", "author": "Symone T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "Food was very unsatisfying. I see why this place carries mixed reviews. Haven't eaten here until now despite living right next to it--something about it seemed unappealing. That was borne out from our experience today! Don't see a reason to go back.", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Went to Kitchen and Cobble Hill for a bachelorette Party last weekend.  Our experience was amazing!! \nFrom planning with Olga up until the day of the dinner- everything was so easy and smooth.  We had a prefix menu for the group of 12 of us- that was fantastic! \nEveryone loved the food and the variety.  The staff was friendly and tentative, everyone had a such an amazing time.  I would go back to this restaurant in a heartbeat! \nAlso- Olga is the best!!  Couldn't recommend this restaurant enough!", "author": "MIchelle F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-24", "description": "The lunch special was just okay  i expected to be wowed. I can make the no flavored soup at home. The sandwich was nothing to write about. The End *", "author": "Petrina R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "We have eaten here twice, and both times it's the same thing. The food is actually pretty good, definitely worth the price. The drinks are great as well. The service though is bad, idk what it is but maybe hire one or two more people? I don't blame it on the servers at all, management should see that it's a busy restaurant and they need to staff up, if not people get overworked, tickets start lining up, and customers are left waiting for a long time.", "author": "Luis G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "Not sure how long this has been Kitchen but this is no longer Karloff and it's been redecorated. What remains though is a similar menu and WiFi access that contains its name (and that's the only clue you'll get).\n\nThe stroganoff was a little bland and dry but the meat was tender.  Not sure if it was the absence of sour cream, mushrooms, noodles or what but something seemed to be lacking.\n\nThey were out of the beef and pork dumplings for my chicken soup so I agreed to substitute the cabbage dumplings which were actually a good choice and complemented the excellent soup.  I am not a big fan of white meat chicken as it tends to be drier than dark meat but it was not the case in this perfectly balanced classic.  One thing that I have to note is that I expected an eastern European dumpling meaning some kind of dropped leavened flour/bread ball in the soup but there were dumplings like the Chinese kind with a filling.  Wonder why it wasn't described on the menu as pelmeni or kreplach which would have been more accurate given the Russian/eastern European theme to the menu.  Think Cobble Hill can handle Russian and Yiddish terminology.\n\nThe deviled eggs were good and satisfying.  Hard to have fresh eggs handy for an appetizer that tastes like they were just boiled but these were.  The filling was creamy and appealing.   \n\nOur dessert was Steve's key lime pie, a good Brooklyn standby.  The dollop of whipped cream was how I like it, unsweetened and plentiful. I would be curious to try their chocolate tart or honey layer cake next time though.\n\nThe service was good and not horrendous as reviewed by others but this was a slow Tuesday night and not a Sunday brunch.  I was not disappointed at all with the service which was attentive and engaging.\n\nFor a local restaurant it is adequate and certainly can satisfy different cravings with other choices like a $22 steak frites, salmon and roast chicken.  I would be willing to come back or order delivery on another night when I am too tired to cook.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "We came into the restaurant at around 2:30 on a Saturday. We got seated very quickly as there was no wait. Ordered the food shortly after and waited. We ordered the smoked whitefish sandwich and eggs Benedict with chicken sausage. \n\nBoy we waited. We waited and waited patiently. The server seemed to avoid us (server was extremely pleasant and nice when we interacted) and told us 45 minutes into waiting that the food was on the way after we glanced at the food window every 5 minutes or so.  The food finally came after at least an hour of waiting. \n\nWhitefish sandwich was mediocre. Think tuna salad on rye. Salad was okay (arugula and onions). Eggs Benedict was mediocre. The hollandaise was mayo with yellow color. The chicken sausage was a chicken patty which tasted bland.  The fries were good, but its fried potatoes. \n\nThe servers were not rude at all. But the wait was abysmal and food was not up to par to what we expected when paying ($12-$14 a plate). Sorry, but I won't be back.", "author": "Raymond L."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}