{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "I had great dinner . Nice and quite , very relaxing . I will be back for half chicken. I recommend to try this place .", "author": "Chasey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "February with it's cold and rainy days makes me crazy nostalgic for the comfort food of my childhood and gets me dreaming of my grandma's beef stroganoff and potato latkes!  \n\nLucky for me I discovered this gem of a restaurant about 3 years ago and have been here for solo lunches of juicy, grilled to perfection burgers. Date nights with my man, where we move through decadent cocktails and onto the crispy Latkes,  Brussel Sprouts that are just out-of-this world, and too-many-to-count bunches.  \n\nNow that the revamped decor is all grown up and glows with soft sophistication, the Kitchen is my first choice for drunken late night dinners with friends and out-of-towners who want a taste of the \"real\" Brooklyn they read about.  Basically, this place delivers a sexy and warm atmosphere and consistently achieves great  stuff food-wise, right here in Cobble Hill.  So I no longer need to sit in traffic, cross the Bridge and back again to get my weekend Soho Tribeca fix.\n\nIf you are new to this place try any of the Specials, you will not be disappointed!  Their signature Crispy Potato Latkes are amazing.  The portion is huge with two pieces to an order (more than enough to share)  Also the Kale soup is silky, creamy, nourishing perfection, I love this for lunch.  \n\nThere are so many attractive vodka and gin cocktails as well as infused vodka.  If you are feeling bold, go for the garlic and dill infusion or the ginger.  If you are the \"delicate wallflower\" type they also have a girl-friendly raspberry :) \n\nOlga and her team are always a pleasure and super helpful.  I'm a real fan of this restaurant, from the thoughtful and inspired menu, to the warmth of the service staff, down to the elegant marbled tables and sprinkle of Russian clientele to add to the authenticity.", "author": "Regina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-06", "description": "Amex or cash online, better to be aware of that before get in; there's no sing to inform about that...", "author": "Cecilia F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-21", "description": "Great staff and service! Food was very fresh, but pretty standard. I ordered the omelette with feta, roasted tomato, and garlic, which was good (although not super exciting). The standout of the meal was definitely the side of fries... Super delicious! Overall, a solid option for a quick brunch in the area. There seemed to be lots of healthy options on the menu, and I'd definitely be interested in coming back for dinner and a cocktail.", "author": "Emily O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "A very nice little place. It's seemed that there was no hostess and the waiters take you to the table. Which I don't mind. Great bar menu with excellent drinks. I had a Bloody Mary being that it was brunch. Was very good. I had eggs Benedict with chicken sausage. Came out hot and delicious. Waiters where very attentive and always ready to fill you cup with water or coffee. Would recommend this place to friends.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "While walking in the neighborhood looking for somewhere to grab a bite to eat i noticed this place,  when i stepped inside i immediately liked the ambiance.   i sat in a cozy spot and was greeted by a nice waitress,  after reviewing the menu i decided to order some comfort food. i am glad i did the food was perfect.  next time i am in the area i will be visiting this place again.", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "I try to give my neighborhood spots a couple of try's before leaving a review. Kitchen is one of those places that just needs to be given a couple of visits. The food is good not great but really good. The staff can be aloof at times but still attentive. I love the vegetarian options and hearty entrees. Please do me a favor and change your payment options to include Visa and MC. It will increase your business.", "author": "Erica A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Pleasant service and nice atmosphere, but overall the food is very good, but nothing particularly special. My girlfriend and I had the Latkes, Meat Dumplings, and Roast Chicken. Even though everything was tasty, nothing blew us away. The best of the three were probably the dumplings, which I'd highly recommend.\n\nA solid choice to go to if you're in the area and need a nice quiet place for a bite, but not a place for a special occasion.", "author": "Kuba K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Great atmosphere, excellent service and the food was delicious. Salmon with buckweed was amazing. \nHighly recommend.", "author": "Stanislav G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Been here for Valentine's Day dinner pre-renovation and ordered delivery from them post-renovation. I can't speak to the new changes in the location, but it does seem like the prices are slightly higher than they used to be.\n\nHowever, the food is still very fresh and tasty and it makes for great delivery when you don't want pizza or Thai. I ordered the chicken soup with meat dumplings, the latkes, and deviled eggs. Delivery came quickly and everything was very securely wrapped.\n\nThe soup was deliciously fresh and heavily spiced with dill. You can tell that it's homemade by the chunks of vegetables, which are still slightly crisp. The dumplings are okay, but I think the chicken soup could stand on its own. The latkes are crunchy and filling and great with the sour cream and spiced applesauce (yum!). The onions didn't hold up so well from the delivery though. Deviled eggs were good although a little heavy on the mustard. \n\nPortion sizes are little disproportionate. At $8, the soup is an extremely generous portion, crammed with chicken and huge dumplings. On the other hand, it's $7 for four egg halves, so two eggs. Yikes. Latkes aren't huge, but they are kind of greasy so you probably don't want too many of those.\n\nA bit pricey, but I really like the food so I'm willing to overlook it for this place.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "Thank you Raymond L. Your review was identical to our experience. At first, I thought that we were imagining things. My good friend and I came in with our three kids for dinner. It was 6:30.  We were greeted and told to wait a few moments until they could organize a table. This was while another party of 3 were seated immediately. We assumed it was because we had kids so they wanted to give us a different section. After saying that our table would be ready after the customer paid, we didn't even end up getting seated there. We were asked to go to a high top table with wheels that rolled. That wasn't a great seating option because the table was constantly moving. We ordered the simplest things on the menu: chicken nuggets, Mac and cheese and sliders for the kids. The adults ordered salad, soup, and a roasted chicken. And then the waiting game began. After 20 minutes, we figured it was just getting 5 plates ready at the same time. By 45 minutes, we expected at least a \"Hey! Sorry for the wait. Your food will be ready soon.\" An hour later, that's when we got the \"food will be ready\" line. Then, 15 minutes after that, and noticing that not only the people who came in at the same time had finished their meal but everyone else in the restaurant had been served, we decided enough was enough and left. They didn't seem bothered by the fact we were annoyed and just said would you like this dessert to go! Hahahha! I've never witnessed such tragic customer service. Not only we will not be back, if any of the other families in the neighborhood plan to go, I'll make sure that they see this review and save them time and money. Very disappointing because it was the first time we came and we had high hopes for this place with its kid-friendly reviews. Huge letdown!! Do not recommend!!", "author": "T. I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Latkes are so good!! Love if you like eastern European food! Only have done take out.", "author": "victoria h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-22", "description": "Came here today for brunch and I wasn't quite as wowed as some of the other reviewers here. We ordered the potato and meat varenikis (dumplings) and the latke and egg breakfasts. The latkes were very good, but the eggs were dry. And the varenikis were just OK- I've had better at other Russian restaurants. \n\nI know Karloff does dinner very well, so I'll be back and hope to update this review with one more star- stay tuned...", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-30", "description": "Two great things about this place: the service and the decor. \n\nAs soon as you walk inside, it has open space instead of being corraled like cattle which is never fun or comfortable, and the wooden walls, dim lighting, natural light, and open kitchen/bar, it definitely presents a welcoming, relaxed vibe, rather than overly trendy and intimidating or pretentious. \n\nIt was pretty quiet inside on a Saturday afternoon (lunch time), but to be fair it was a gorgeous day and maybe people were out and about at the parks or something- so we were seated right away, offered water, and any other drink requests. Literally a few minutes later our orders were taken, and about five minutes thereafter our meals came out. \n\nNow- this was just the Brunch menu, so I can't speak for the ENTIRE menu, but what we ordered definitely fell flat. \n\nWe got two Eggs Benedict meals: one was Lobster and the other Smoked kelbasa. \n\nNow, I'm a huge fan of Kelbasa, but for some reason, the skin of the sausage was extremely tough and rubbery, almost to the point where it couldn't be chewed and swallowed. The poached eggs, spinach, and English muffin were delicious, as was the side salad with a very light dressing, PLUS a cute thin slice of canteloupe which was sweet. \n\nMy boyfriend got the Lobster version, and while it was OK, he didn't think there was anything overly special about it, or perhaps the Lobster didn't stand out and it got lost in the dish/flavors. Let's just say it's a dish that could be fairly simple to make at home, once we've mastered the poached egg business- when he cuts into it and the yolk oozes out is his favorite part of the meal. \n\nThe hash browns/potatoes weren't entirely cooked, so it had the chalky consistency to it. \n\nThe prices were reasonable, the sausage was $11, and the Lobster was $16, so it's not going to break your wallet, and the portions don't make you extremely full or headed for a food coma- just enough food to satisfy you to help you continue on your day. \n\nHowever, perhaps I have low class/simple (LOL) taste, and hearty fatty portions, but I could easily hit the dinner not too far down and get three poached eggs, with a huge piece of strip steak, with toast and fruit and OJ on the side, all cooked perfectly. So I can't say for sure that I would come back here for another meal, whether lunch or dinner -definitely not for brunch- when the diner is calling my name instead.", "author": "Tiff C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-29", "description": "The carrot soup was sugary and watery.\n\nThe latkes were uncooked and oily in the middle.\n\nThe burger was--fancy meat as advertised? Doubtful.\n\nAll in all, bad bad bad. \n\nIt's just like Karloff.", "author": "Osh P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "I had a great experience here. I went on a Thursday evening, was surprised it wasn't busier. I decided to walk in because the menu in the window looked good, and I liked the decor. \n\nI ordered a Manhattan to drink. Thought it was weird that an olive was in it, but it was very good. Ordered the grass fed burger which was great. I'm normally not impressed with burgers at nicer restaurants, but it was solid. The side salad was also incredible. \n\nI'm honestly not sure why people gave it fewer stars. My server Sergey was great. The only downside about this place is they only take Cash and American Express, which is why I gave 4 instead of 5 stars. Customers want convenience.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Went here for a quick lunch and got the grass fed burger. Delicious! You could tell it was made fresh, and had a nice mayo sauce and plentiful amounts of red onion and pickles on brioche. It was also huge! \n\nGreat happy hour prices ($4 Russian beers and wines). Definitely coming back to try the Russian food!\n\nKind, attentive service as well!", "author": "Lin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "The food at Karloff is really, REALLY good, including the smoked salmon sandwich, the latkes, so much more. It doesn't get 5 stars for 2 reasons:\n\n1) I asked the owner, who was our waiter for dinner one day, If I could have fries instead of a side salad with my sandwich, since we were ordering a salad to share already. He said no, that it \"automatically\" comes with a salad. I told him I was shocked that before they even start making the sandwich, it \"automatically\" has a salad with it, and asked him to reconsider, and he simply refused. One of the most bizarre reactions I've ever seen at a restaurant to such a simple request.\n\n2)Smaller issue: They take only cash or American Express.", "author": "David P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "We recently held a private event here, mid-week.  Overall, the experience was a positive one, but a few issues we experienced keep me from giving them more than three stars. \n\nFirst, the good: The staff were phenomenal.  Olga, the manager at Karloff, was a complete joy to work with.  She and her staff are very accommodating and very customer service oriented.  The appetizers we ordered were good, plus the drinks at the bar were well made and their service was fast.  \n\nA few hiccups: the day we were there, it was the first, true hot day of the month (mid-90s and incredibly humid) and their AC wasn't working very well.  It was warm inside but (barely) manageable.  Most guests didn't let it dampen their celebratory spirit, but from the hosts' perspective, this was disappointing.  \n\nAlso, their sound system is built for dinner-level music at best.  It appears they have several studio monitors (4?) throughout the space, which works for dining, but when you have 60+ people talking all at the same time, the music is barely audible.  \n\nI would definitely return here for dinner.  But if you're thinking of holding an upbeat, private event here, I would ask about these two issues before booking.", "author": "Brian U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "A very pleasant spot for brunch.  Very friendly and attentive service and a lovely ambience.  Good coffee and the Brussel sprout side is really, really yummy.  Only issue was that my poached eggs were a bit overcooked.  I love me some benedicts, and they have some good options (including chicken sausage and smoked salmon bennies) but that egg needs to be perfection for 5 full stars.", "author": "KB S."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}