{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "Karloff is a great place for any meal, and it is also lovely for a private event! We recently held our post-wedding brunch at Karloff, and the place and its owner - Olga - are just phenomenal. Plus the food is DELICIOUS - we had a huge selection including herring and liver sandwiches, vareniki, blintzes, pancakes, and all sorts of eggs. Our guests cannot stop talking about it!", "author": "Ruti W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "I had never been to a russian restaurant before going to Karloff's. My cousin, who lives in Brookly and frequents this place brought us here for breakfast. It was quite a schlep from the Bronx but was sooo worth it (we came back the next morning too!) The first trip I had potato latke's with sausage, the latke's were perfectly crispy on the outside and topped with sauteed onions. We also got a side of Kasha which I had never had before, now I will be trying to make some at home! My husband had the lox on rye, we are a big fan of lox and these were the best we had ever had, like butter with no fishy tast to it.\n\nThe second visit, I again had the Latke's, this time with lox. The husband got lox on a croissant. We also tried the meat dumplings, very similar to pierogi and absolutley delicious!\n\nI hope this place is still open when we make it back to NY, if you are in Brooklyn this place is worth the visit and if you are in any other part of NYC, MAKE THE TRIP! The meal was worth every minute of the hour and a half trek.", "author": "Gabrielle K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-16", "description": "I placed an order over seamless and waited over two hours only to not receive my order despite receiving an order confirmation. The food has been good in the past but I wouldn't order again.", "author": "michaela s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-17", "description": "I wish I could of tasted the contents of the sandwich without having my mouth lacerated by the hard bread. Weird service too, Really weird. I don't like to be weirded out by weird people (with bandanas on their heads) while my mouth is destroyed by bread.\n\nalso, the \"lemon water\" was disgusting. I'll tell you why, the lemons were rotten.", "author": "Gordon A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-11", "description": "Airy and spacious restaurant that specializes in Eastern European food. The furniture reminds me of deor in a Russian farmhouse. I unfortunately didn't know about the rave reviews on the ice cream but I will definitely try it next time. I did however, have a the tuna melt, which was smallish in size for the price, tasty but not spectacular. I loved the carrot slaw that came with it. This is apparently a place for desserts.\n\nThe waitresses were lovely but service was laid back and unorganized. Three different people asked me if I had ordered and the place was not busy. This is a place to hang out on a lazy Sunday afternoon if you are not too rushed. The atmosphere is gentle and the waiters don't rush you.", "author": "Helen Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-29", "description": "I am sure there are nice people working in this place but last Sunday at Karloff I encountered the rudest waiter I have ever met.\n\nWe went in around 430pm for ice cream. We proceeded to the counter where a very nice guy asked us what flavors we wanted to try. A lady was before us so he went ahead and helped her. Another male staff member, he had an accent, approached us and asked what we wanted. I said I would have liked to try X and he did not even let me enunciate the second word that he abruptly cut me short and said \"hurry up because I have tables to look after.\" I proceeded to list the 3 (not 10!) flavors I was eager to try, at that point he said \"you want to try 3 flavors?!\" rolled his eyes, shook his head and sighed. \n\nI have a very bad  temper and I do not take BS like that but for some reason I really did not want to make a scene; it was Sunday, I was in a great mood, I just put down the spoons and left.\n\nThe ice cream tasted divine but I will never set foot again in this place. Ever. I worked in restaurants a long time. Waiters and waitresses are human and can have bad days. I did.  But that type of aggressive and disrespectful behavior is completely unacceptable when you are running a business.", "author": "mina l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "I love their vegetable stir fry, but get it with chicken, not tofu - delish! The chicken soup with meat dumplings is divine, and cheese blintzes are a must!!! This place is great for fish and innovative vegetarian options", "author": "Nikolay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "This was a great place for brunch and the menu offers up something a little different to the typical fare served up in the neighborhood.  I had the breakfast with european style pork sausage, eggs as well as toast and buckwheat.  It was all delicious.  I also had some east european style pancakes which, eventhough they were deep fried, were light and tasty.\n\nThe staff were very friendly and the decor makes for a comfy east european kitchen/cafe feel. I'll be back to try the blinitzes (crepes) that looked really good.", "author": "Tim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "I can only speak for their brunch menu, but it was delicious.  My friend and I split two items off the menu, and the portions were large and well prepared.  I am not usually a bloody mary fan, but we each got their tequila bloody maria's, and they were awesome.  I highly recommend the ricotta cheese pancakes.  The staff was very nice, if not a little awkward.  When I visited they only accepted cash or american express, which was not apparent when we sat down, so slightly annoying and inconvenient.  Overall, it was a delicious brunch experience.", "author": "Megan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "I've read a few reviews that spoke of bad service, but I didn't experience it at all. We had polite, friendly, and prompt service with just one person on the waitstaff with a 3/4ths full cafe.\n\nWe had the tomato soup, which had lots of chopped veggies in it. Also the latkes, which were nice and crispy. Finally the whitefish salad, which had great fresh veggies and the whitefish was great.\n\nTheir bread is good , too.\n\nI should come back for the other, more-russian fare and the ice cream!", "author": "Ben M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Wow, this restaurant is amazing! The brunch is delicious, with the best latkes, and what a treat to have them at dinner too! Olga, and the rest of the staff, are so friendly and kind which was very much appreciated when we dined here on NYE with ten kids! I have lived in Cobble Hill for 17 years and consider Kitchen one of the the best restaurants, and I am so glad it is here to stay.", "author": "Allison L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-11", "description": "I've only been here for Sunday brunch but it was one of the best brunch experiences of my life.  \n\nThe food is delicious; I had the vareniki with blueberry filling and a spinach soup -- and it was rich tasting and filling.  Even the table water is soaked in cucumbers and it had a fresh zest to it.  \n\nThe staff is really nice and helpful, especially considering how swamped they all are.  It's in a great neighborhood.  Your seating is a little snug, but what can you do?  \n\nWarning, if you're planning on just walking in without a reservation: it will be packed and you will have to wait.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "For the past year living nearby, we have neglected to come here, mostly because of the 3.5 rating on Yelp. I'm so glad we finally went! This place is really great. The house infused vodka selection is top notch, excellent Russian beer, and the dumplings and beef stroganoff were so delicious! I can't comment on the authenticity as I'm not super familiar with Russian cuisine, but everything we had was excellent.\n\nAnother thing I appreciated was the space: the layout is conducive for quiet conversation even when it's almost completely full (given the table placement and high ceilings). Not something I always consider but noticed as it was so ideal, especially given most restaurants in NYC cram their tables close together. The decor also really did it for me. Staff is super friendly too! Highly recommend this place!", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "I can really only speak to the ice cream and service, but based on those two alone, I'm a fan!\n\nThe ice cream is very light and fluffy..... not as dense or rich as I usually like my ice cream, but it was a nice way to top off a large dinner. The flavors are unique-- I got one scoop of chai tea latter and one scoop of lavender, which were perfect together! The cashier remembered us from the night before, and after we ordered, he said we could just have a seat and he would serve the ice cream to us. Fancy! They also have cookie waffle cones, which looked tasty, but I didn't try them.\n\nOpen late, large, airy space, and friendly service. I will be back!", "author": "Jan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-11", "description": "Scrambled eggs, kielbasa, latkes, and sour cream for breakfast.  Yes.\n\nGreat food, great coffee, great ice cream, and an awesome staff.  What more do you need?", "author": "Ben S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-03", "description": "The space is great with a country home feel and large windows. Karloff is a nice place to meet a friend for a long chat on a weekday morning!\n\nBut the food is only okay, the boy didn't love his potato pancakes and the oatmeal is not the best around!\n\nAlthough the servers have been extremely friendly I don't think they have worked out the best way to serve yet...eating at karloff is a slow process.", "author": "Becca C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-01", "description": "I'm going to preface this review by saying that I've been to Karloff quite a few times and LOVED it. \n\nNow to tell you what went wrong...\n\nStrolled in with 2 friends on a Sunday. We and two other tables were the only ones in the place. We ordered beers that took 15-20 minutes to come to us. We ordered food that took 35-45 minutes to come to us. Our 3rd didn't get his meal until AFTER we finished eating. I ordered the Veg Black Bean Burger.... it was lukewarm at best. Also, it was bland and nearly tasteless, the salad barely even had a hint of dressing. The burger was unappetizing.\n\nWe asked for check and it took 10 minutes to get it. They charged us full price for our beers during Happy Hour, they refused to acknowledge it and insisted that it is a bar price (I know for fact that it is not and their Happy Hour special is furthermore listed on the menu). Overcharged on the meal as well. \n\nEven so, we offer our credit cards to pay. Another 15-20 minutes go by. Waiter is seen struggling with the register... DOES NOTHING. Eventually comes to us and tells us the system is down. I will acknowledge the fact that they offered us dessert. Frankly, they should have comped my friend's meal. We then walked 6 blocks to the bank to get their money. \n\nGranted, past experiences were pleasant. But this was literally the perfect storm of terrible service at a restaurant. I have never experienced such rookie mistakes in a wait staff. The staff stood around confused and lethargic, barely completing any task at hand. I left the restaurant angry and utterly dissatisfied with the food and service. We were overcharged, disrespected and forgotten in a restaurant with 3 occupied tables. \n\nFor shame, this ruined my opinion of a once great restaurant and utterly ruined my day.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-04", "description": "Walked by Karloff and decided to stay for lunch. Excellent grass fed burger, lovely red borscht (please stop with the Vegan B.S.) and side salad perfectly dressed. Will come back again, and will eat any Vegans I find!!", "author": "Lance R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "Amazing drinks. Super friendly staff. Came ther for mother's day. Food was good. Service fast\n\nThanks", "author": "Julie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "Came here for dinner and got mussels, friend got short ribs. They served complimentary sauerkraut. Got ice cream with pretzel cone as recommended by other Yelpers. Overall, entrees themselves were good. Ice cream was not bad, with just the right amount of sweetness and I liked the consistency. The pretzel cone gave it a sweet and salty mix. I was hesitant about it, but it surprisingly added to it.", "author": "Katrina L."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}