{"aggregateRating": {"reviewCount": 311, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-01", "description": "We were just here for a semi-impulsive brunch...inspired by their chalkboard sign outside for latkes. We sat down and ordered. And waited. And waited. After 15 minutes, we hadn't even gotten our coffees. When we finally did, one of the waiters (not the one who originally served us) asked us if we'd placed an order at all....presuming that it had not gotten put in.\n\nI completely understand that restaurants are busy (especially for brunch) but there was no concession or apology for this. Then, we waited even longer. We waited until after the people who sat down next to us ORDER AND FINISHED THEIR MEAL. Still no acknowledgment of our patience. \n\nWhen I finally got my meal, it was sloppily put together and sub par. The latkes were okay, but we should've gotten comped for at least SOMEthing. The waitress gave us a cookie but at that point it was too little too late.\n\nAgain, we are not the type to nitpick about this stuff, but I was miffed that there was no inkling of remorse after paying customers waited more than an hour. \n\nLatkes weren't worth it.", "author": "EA B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "I have been to Karloff quite a few times, pre-renovation and after, and have always had a pleasant experience. The owners are so sweet, and Olga gives terrific service and recommendations with a smile. They have a small but unique draft beer selection to complement the Eastern European-with-a-twist cuisine. The soups are fantastic, especially the kale and collard green puree. The ambiance is great. I loved going there for tea and ice cream when it was more of a cafe, and now it is my go-to spot for a beer and snack, especially if I have some time to kill before a movie at the theater across the street!", "author": "Remmos F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "I'm happy to say that Karloff has definitely improved lately. My beloved latkes are back to their original quality, and the vibe is a lot more casual than before. Really friendly staff too.", "author": "Caitlin F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-14", "description": "It's obvious that they recently open (waitress told me less than a year) so I'll give them credit and hope that it gets better.\n\nThe waitress was very sweet but they clearly need more staff because we waited forever to pay. The food was good: I had the salmon with mashed potatoes and veggies.\n\nWe then tried to get ice that looked very good, but again not enough people working there so we left 'cause it was taking too long.\n\nOh and what annoyed me the most? No alcohol!!!! How can you have brunch with out a drink?! Well they don't have their permit yet... and maybe am just a little too drink-happy:)", "author": "C J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "We stopped in here for a late lunch on a Friday afternoon, as we were strolling down Court Street looking for a place to eat.\n\nWhat a treat. The food was terrific, and the owner had plenty of time to chat. He designed the restaurant himself, and built much of it himself (as he said, \"When you only have dimes in your pocket, you have to do it yourself.\")\n\nThe kasha (buckwheat) was excellent. They had a small but thoughtful collection of beers on tap.\n\nWe were pleasantly surprised, and highly recommend Karloff.", "author": "Jeremy E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-11", "description": "Karloff is perfect for this neighborhood, the only Russian restaurant around that serves up all the classic Russian dishes and also grass fed organic burgers! The service is good as well! Give this place a shot....", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-02", "description": "I know that Russian food doesn't always have the best reputation, but I've lived in Russia and know that it can be wonderful, exotic comfort food. So I had high hopes for Karloff. But it was a disappointment. They have a few Russian standards, but otherwise you could barely tell it apart from the slew of boring \"new American\" restaurants in Boerum/Cobble Hill. And the service was pretty bad. But the worst was that they take ONLY American Express, which they don't tell you until the very end when you try to pay. If you don't want to take credit cards, fine, hold yourself out as a cash only business. But who takes only one credit card that almost nobody has? So annoying. Won't be coming back.", "author": "Logan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "Cute spot with a nice atmosphere and open space. I came here for lunch on a weekday and there were only a few other patrons other than myself. I decided to try two types of varenekis, meat and potato filled. They were good, but nothing amazing. I am not sure if it is the type of food and this is how it is supposed to be prepared, but it seemed a bit bland. The caramelized onions did help in adding flavor to the dish though. Overall, I am glad I tried this little Russian spot, but it was pretty pricey and I don't think I would return again.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-31", "description": "The potato latkes were delicious..crispy on the outside, creamy on the inside.  They were served with sweet, carmelized onions and the obligatory sour cream and applesause.", "author": "Barbara F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "I love Karloff! The food is really, really tasty and fresh. I have never tried a dish I didn't like. I've had dinner here a few times after the movies, very conveniently located across the street from the Cobble Hill theater. Have tried the salmon burger, dumplings, latkes, the borscht, and vegetable dumpling soup. I enjoyed them all. Karloff saved the day after a frustrating search for a lunch spot with some out of town visitors on a weekday - turns out it's not so easy to find a spot for just lunch on a weekday in the hood. We were so happy to find Karloff open and serving a full menu. My guests loved the food! Consistently fresh and flavorful. Unique in that it does have a Russian flare, but nothing too crazy. And the space is inviting and clean and not too loud. Thanks for being a great neighborhood spot!", "author": "Sarah Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "Karloff is an understated and underappreciated little pseudo-Russian-oriented restaurant in the heart of Cobble Hill. Doesn't really cater to the stroller crowd that habituates many of the other places locally. Nothing but positive experiences in terms of food and service. In terms of price - not inexpensive, but not particularly exorbitant either. Love the salmon burger, and the stroganoff. The latkes are especially a favorite. One of my faves in the neighborhood.", "author": "James W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-29", "description": "When I go to a Russian restaurant, I expect Russian-sized portions. I know we're in Brooklyn and everything, but the Russian part should trump that. Especially given the prices and general blah-ness. The decor is really pretty, though.", "author": "Yana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "I love Karloff. It's homey, warm, welcoming, and the food, while simple, is good. It's exactly what I want in a casual neighborhood spot; it's like a rustic, more authentic Veselka. \nI went with a friend for brunch, we had latkes with scrambled eggs, lox, and roasted veggies, and it was great. I really appreciated the variety of foods they offer for brunch, instead of the typical eggs/bacon/pancakes. (Sometimes having some veggies makes all the difference!) I love that the food is comforting and satisfying but also fairly healthy, offering a great alternative to boring salads in cold weather... there's something for everyone.\nAnd the ice cream here is INCREDIBLE. I know Blue Marble is just up the block, but this place gives them a run for their money, PLUS they offer way more flavors that are often more creative and interesting. Limoncello and eggnog are two standouts for me. \nIn addition to being able to sit down for a homey meal, Karloff offers coffee/tea (and ice cream of course!) to go, and from the look of it, they have their coffee game down, offering several brewing methods and specialty drinks. Basically they've got it all.\nThe ONLY reason I didn't give this place 5 stars is that when busy, sometimes service can slow down a bit. BUT the staff is super friendly and nice; perhaps they just need to hire a few extra people for the rush hours.", "author": "Alison G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "Took some visiting friends in Brooklyn here. Wanted some soulfood - kasha and latkes. Great neighborhood vibe. Kasha and latkes were fantastic. Everyone had ice cream for dessert and the sign outside is really true: Best Ice Cream in Brooklyn! And the funniest thing of all is that my friends swear they recognize the ice cream. Its Janes Ice Cream from their hometown - Kingston, NY! They recognized the Salty Caramel Pretzel and Chocolate Halvah. Here I was thinking I was going to show them Brooklyn and they showed me Kingston!", "author": "Molly B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-26", "description": "This place has gone downhill! I came with a Travelzoo voucher special, which indicated that you could pick any dessert of up to $9 as part of the special.  I was really craving cheese blintzes for dessert and waiting the whole meal for them. Well, just as we are about to order dessert, the waiter tells us that the special only lets us have ice cream. This was not at all indicated in the voucher we purchased, which touted itself as being a $73 value (although this also relied on false entree prices). The place was completely empty except for us and one other couple, and it seemed like they just didn't feel like making the blintzes, or else they were trying to save $2 (the ice cream is $7)? Either way, they've lost a repeat customer.", "author": "Kim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-08", "description": "From the first night I visited Karloff, the staff was incredibly warm and lovely (I now have 2 Karloff friends!), and the borscht quickly became a winter staple. I bring new friends here all of the time - the ice cream is the BEST, the dumplings are to die for, and I am so excited for their stews \u0026 kasha once winter comes back around. I love love this place. It's a refreshing step away from the hustle and bustle of the city, where you can sit, enjoy a delicious russian meal (or beverage) and just relax.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "i LOVE karloff! \n\nsome of the best ice cream i've ever had - red beets \u0026 dill (yeah it sounds gross but is absurdly tasty) and ginger snap molasses. the staff is incredibly friendly, and will let you try literally ALL the flavors in the case without even rolling their eyes or copping an attitude. i also came for brunch once with some friends and ordered the potato pancakes with gravlax. overall, it was good, could have used some more salt, but it was satisfying. but the dumplings they have were really delicious. the decor is charming and unique without being hipster/pretentious.\n\nreally, you should go here. it's a very unique spot and very laid back. even if you end up hating it, the worst case scenario is you walk away with a delicious scoop of ice cream. definitely worth the risk.", "author": "Alison C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "Such a sweet place with some really great food.  Each visit to this restaurant continues to surprise me.  You walk in and you're not sure what kind of experience you might have.  They have an ice cream counter and large wooden tables.  But coming here for dinner is wonderful.  The stuffed cabbage is delicious as are their chicken meatballs with mash.  They also have a great selection of beers by the bottle.  And their potato pancakes are wonderful!  Also, they have some of the friendliest waiters I've ever encountered.  They're always so happy to see you.  Definitely a recommendation.", "author": "Gina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-20", "description": "Now I've also tried the Siberian dumplings and the warm wine. Both were delightful! And the ice cream: its STILL delish!", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-09", "description": "Great Russian style food! Olga, the owner is very nice.  Everything is reasonably priced.  The ice cream, drinks, and dumplings were yummy!", "author": "Natasha W."}], "servesCuisine": "Comfort Food", "priceRange": "$11-30", "name": "Kitchen At Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "254 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Uwyn6tWW6aE5hPSCHAQa8A/ls.jpg", "@type": "Restaurant", "telephone": "+13476894279"}