{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "Came here on a casual date nice the ambience is nice, the burgers are delish I highly recommend the hangover. The customer service tops it all they were super friendly and went the extra mile to make the customer feel appreciated.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "I am from Cobble Hill neighborhood, so I often go to Moo Burger. I can bring my son or my boyfriend or my mom or anyone and it never disappoints. The staff is very friendly and the owner makes sure everything runs smoothly. \n\ntip: cobble Hill/Carroll Garden area is a heavy family oriented neighborhood, so do expect for majority of restaurants to have kids. Especially moo burger noon to 3pm off school days and from 3pm to about 6pm school days. If you want to eat out with no kids in the establishment, do not come to this neighborhood.", "author": "Naddy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "Walked by this place for months until it finally opened yesterday so decided to give it a try . Burgers were on the money and went well with a nice  Beer  . I seen they  serve wine to but Wine with a Burger is just unAmerican to me :) . \n\nI also heard that the head Meat flipper LOL or chef if you want to call him that was a 2 time chopped winner on the food network but i never watch the show . \n\nI will be back , especially since there are a few hotties working and i am single . ;) \n\nHint to ownership (Add some salt to the sweet potato fries)", "author": "paul m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Hands down the best burger in Brooklyn. Super friendly and attentive service, and amazing and creative menu choices. Puts Bareburger and Shake Shack to shame. Go go go.", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "Hands down the best burger joint in NYC! Great food, great atmosphere, unpretentious, friendly staff. My mouth is watering :p", "author": "Cara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-05", "description": "Best burgers in NYC! Gotta try the bison burger and their peanut butter shakes!", "author": "Petros H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "Try the bison Burger with caramelized onions", "author": "MJ A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-24", "description": "Meh...tasteless burger...blend salad..slow staff. Overall a non memorable experience. The place is decorated as a trendy burger place but it does not really deliver. I would have expected the burger to be seasoned or have more flavor but...", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "First time here and it was all really good. Burger was juicy (pretty basic, just meat, cheese, bacon and the standard others) without being overcooked or too greasy. Service was well timed and professional, though not stuffy. Will be coming back.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Amazing burgers, friendly service. Food is consistent, perfect everytime.", "author": "Pierre J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "They have really good burgers and shakes. The zucchini fries were really good too.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "Great food.  Decor was really nice for a burger joint.  I had the Greek burger made with lamb and my husband and I shared the zucchini fries.", "author": "Sundi P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "Interesting name for an interesting joint... they have a good selection of stuff to try out here the prices are just a little high but the food is very good come and give tand give their burgest the food is very good come and give their burgest the food is very good come and give their burgers a try", "author": "Fred H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "Cool, kid friendly place. Bring your kids, your wife, your gal, your friend and njoy a smooth Sunday meal at a lovely neighborhood. Would definitely go again!", "author": "Kon A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Great food, friendly staff. Best fried pickles I've had. Always crowded with families which I don't mind, but can get loud.", "author": "Tia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "I have tried several burgers in the Brooklyn area, and the one from Moo Burger was the best by far. They serve it very cute on a tray, and their milkshakes are also something I could drink every day.", "author": "Paulien S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "Overrated and overpriced. A chicken Sandwich and fries for $20 better be damn good. Fell flat all around.", "author": "Bubba J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "Another Yelp win. We wanted a low key 4th of July so we went to the movies and then got dinner. Since it was the 4th I had to have something \"Americana\" so burgers it was. We originally were going to go to Bareburger but the wait was a bit too long for us. I yelped around for burgers and this place came up. We walked about 3 blocks down from Bareburger. It was a little crowded but we were seated right away. The man at the front (I'm assuming the owner) was very friendly and welcomed us very warmly. They had special that if you order the all American burger any drink was free (score!). So of course we ordered 2 well done all Americans (lettuce, tomato, red onion, and moo sauce-we added American Cheese for an extra $1 each), a side of fries to share, and 2 Ommegang Witte beers (my new fav btw). I have to say that this burger goes into my Top 5.  It was super juicy, the flavors went perfectly ,and the bun was sturdy enough to hold it all together and not get soggy. The fries were nice and crispy and just salty enough. As other Yelpers have stated this place is kind of expensive but since we got free beers our meal was just about the same price as Bobby's burgers or Five Guys. Sevice was good and quick. Just friendly enough which is all I need.  I would definitely come back to try their turkey burger and other burger combinations.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-23", "description": "Great Milkshake but the staff is sub-par. Not sure if the girl with the nose ring was having a bad day or what but she was rude and not accommodating at all. Sad one person is the reason well never go back. The burgers are okay but I think you can find a better burger at half the price around brooklyn heights.", "author": "Cali S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "I would say their burger out me in a good MOOD but that'd be a hacky joke so instead I'll just say the sauce and the burger we're great.", "author": "Jon M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}