{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "Been here 3 times now so I felt like I had enough experience to write a review:\nI love the organic burgers, the fact that the chicken burger is a ground chicken burger and not a chicken breast on bread (take note other people!) and the plethora of burger choices. Different meats, toppings, sauces, breads, etc. And the zucchini fires! ohhhh how i love thee...\nI don't like the prices (they really nickel and dime you on the burgers and the everything is a la carte which means its fancy and pricey) nor am I a fan of the lack of bottled beer. I love a cold bottle with my burger, sorry if I am crass.\nTruthfully they would have had 4 stars even with those 2 issues, but last night I got the chili and onion rings and both were sub par. The chili isn't flavored well, its very sweet actually. The onion rings were too high in the batter over onion ratio.  I ate less then 4 bites total and the waitress never asked what was wrong, just removed my tray at the end and returned with my check... \nThey have a great ambiance there though!", "author": "Melody G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-04", "description": "Great food and flexible enough for various diets (taking out the buns and putting the burger on a large lettuce leaf at request). The atmosphere is great for any social gathering or date or what have you. Easily recommendable.", "author": "Janine V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "My husband and I stumbled upon this cute little place by accident.  Glad we did.  It had a very rustic interior, love the cozy set up.  Extremely clean!  We had the burger and hot dogs.  I love the fact that the fried pickles and fries, come served in these teeny weeny metal fryeresque baskets.  Absolutely adorable!  The pickles were super spicy, so watch out.  The portions are plentiful, so one meal would have sufficed.  The sides are extra, but the pricing was very reasonable.", "author": "Christina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "I enjoyed our first trip to Moo Burger and expect to give it another go as they get more settled in to the neighborhood.\n\nThe atmosphere is lovely, the staff was very friendly and the menu is extensive and creative. I liked the salmon burger more than I expected to and the fried pickles were excellent. Hubby liked his bacon burger and his sweet potato fries were very good.\n\nA couple of small complaints:\n-- I don't like having to ask for salt and pepper, and it's becoming too common at restaurants. If you're a burger joint, chances are I'm going to want salt and ketchup for my fries. Neither are on the table.\n-- We went to Moo in part because they'd been promoting on a sidewalk sign that they now have veggie burgers. Once we sat down and settled in, we were told they'd done a test batch of veggie burgers and tofu burgers that sold out, so they didn't have more. I was disappointed but glad that the neighborhood supported a burger joint's veggie experimentation.\n-- We also went because the Yelp profile says they have free wi-fi, but when we got there, there was a lot of reluctance about letting us use it because they're a small place and don't want people tying up a table for four hours. I completely understand the concern, and think Moo would be wise to establish a clear, consistent wi-fi policy. For example, you can only use laptops at certain tables, and if there's a wait for tables there's a time limit and/or you have to spend a minimum to use it. If the place is nearly empty and I'd like to eat and work, staffers should know how to clearly answer that question.\n\nAll of these are minor, though, especially for a place that's still pretty new.\n\nOverall, I think it's a good spot now and we'll be back to see how it evolves. After how good our first trip was, I'm even more curious to try the veggie burger.", "author": "Colleen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-16", "description": "The food is very good, the staff is friendly but it is a bit pricey. I do like the fact that they have alternative choices if you prefer not to eat red meat or any meat for that matter and the choices are very tasty, like the grilled vegetable burger, YUM!", "author": "Christine C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-02", "description": "We live upstairs from Moo Burger and have been eagerly anticipating the grand opening for many many months now, and we are so happy they are finally up and running and doing well. We wish them much success here at 240 Court Street. Welcome to the 'hood yo.", "author": "Mark R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "Great selection of meat to choose from such as lamb, bison turkey and salmon. Staff is quick and friendly and attentive to parties with children. Amazing milk shakes, peanut butter and vanilla is to die for. Big plus on using local products for the establishment.", "author": "Athanasios K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "Had the bacon classic which was very good. Meat patty grilled nicely, smoked apple wood bacon was crisp which was awesome but it didn't stand out as much as i thought it would. First time eating a burger that required a knife and fork which was a bit strange but overall very tasty and worth trying and coming back for more!", "author": "Ray Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-27", "description": "Love the food here, everything is always great! Great staff, too. Salad add turkey patty it's delicious and filling. Steal bites of fries \u0026 beef burger from the beau!", "author": "Lucia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "5 stars for the a great burger. I had the smoke house And my boyfriend had the regular they were high delicious but i found mine to he better. I also had the fries MAC And cheese omg also to die for. The moo fries also. Out of this world all the food ordered was extremly amazing. Now the staff is young which i guess is cool but i could read all over there face that they werent to Happy to have us walk in as they were closing at 10. But either way omfg the Best fucking burger ive had so far. And ita pricey but worth everypenny....", "author": "Jason S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "great place with an interesting name good menu nice friendly staff with decent prices", "author": "Trey F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "I came here on the first day it opened. SO of course the service was excellent. I a proud that the owner did such a wonderful job in the organization of the staff and service. I had a regular burger and fries. The fries was soooooooooo good. BUt the ordinary burger that i had was well....a little too ordinary. I mean iam used to those real nyc hood style greasy and creamy burgers with all the fat and all packed with unhealthy heart attack flavors:). so when i turned over to the green side and had what i had at mooburger....welll, i was just like...mmmeehhh its good. But to be honest id be more enthusiastic to go to a deli and order me a half pd burger with fries, can of coke and bag of chips for 6.50 at Smith finest Deli.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "Fan' Freak'n Tastic!!!\n\nMy aunt and I stumbled upon Moo Burger by mistake. We were driving  around hungry, which you should never do because all the fast food crappy restaurants start looking  really, really good.  We found some parking one block away from Moo Burger, lucky us! We took a look at the menu then decided to give it a try.  The place is industrial cool while still being Eco friendly, I was definitely  digg'n it. The server that took our order was helpful and pleasant. My aunt had their pulled pork sandwich and I indulged in the Nova Scotia, which is there salmon patty sandwich. \nThe reason why I gave Moo Burger four stars instead of five is because....Well,  I wanted to freshen up before I ate. So I  proceeded to walk towards the restroom in the back; I knocked on the big wooden sliding door no one responded so I opened it.  To my surprise there was I guy on the toilet and his head was down. I guess he was in deep thought...? Shocked and wide eyed I shut the door and forgot why I opened it in the first place. My aunt and I kept looking for that guy to come out the bathroom. We were hoping that he wasn't going into the kitchen to cook our food. Well we didn't see him come out and the meal was Awesome! If you dig sweet potatoes fries I highly recommend them! The server suggested that I dipped them in maple syrup And I DID! Freak' Fantastic!\n\nWell that's my story,  I hope it helps.", "author": "Kim A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-20", "description": "Bacon burger was good and well-cooked, with the bacon also at the exactly correct level of done-ness.\n\nOnion rings terrible. Like most people, I find onion rings so delicious I will eat pretty much any version; these were bad enough that I had one and left the rest on the table. The dude asked me if I'd like them \"wrapped to take with me.\"\n\nUm, no.\n\nBurger pricing was not on par with the ingredients, portion size or prep. In a word, too dear for what they put on your plate.\n\nCompared to Bare Burger, this place is not worth visiting. I live nearby, but won't be back. On the other hand, I go out of my way to trek to Bare Burger about once a week.", "author": "mig k."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "I went to Mooburger over the weekend with my family. It was our first time there and we heard such great things about it we couldn't wait to try it. I was pretty disappointed. I got a Classic Bacon Cheeseburger and my husband got the burger with the pulled pork on it. The burger was pretty thick but didn't really have any taste and the bun was overpowering. There was barely any sauce on the burger or the roll may have soaked it up. Also if you do not order sides all you get is a burger which is a big turn off to me. If I am paying that much for a burger I should have the choice of 1 side or just throw some french fries on the tray. We decided to order some sides to try; fried pickles, macaroni and cheese balls and fried zucchini. The macaroni and cheese balls were the tastiest and the zucchini fries came with a tasty dill sauce. The friend pickles were not pickle chips as I expected, but gherkins. I wanted to like them but I just couldn't. Was Mooburger terrible? No, but I expected more and I don't think we will go back.", "author": "Angela O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-12", "description": "I had a hard time getting over the really thick, dry, crumbly, whole wheat buns.  I mean, the burger tasted good, but the buns!!!  Damn it, it ruin my experience!  You'd think for ~13$ a burger they could've gotten the buns right.  They spent all that effort making different, exotic burgers with great ingredients... then use a horrible medium for it???  Makes no sense.  Did I mention that the buns were horrible?\nBut other than that it was alright.", "author": "sejin k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-09", "description": "I'm kind of obsessed with this place.\nZucchini fries? Check\nBison? Check\nCider? Check\nFast service? Check\nThis place is a great spot to grab a burger pre-movie or pre-bar crawl. Other food looks pretty good too!", "author": "Alex Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-27", "description": "Really really enjoy the burgers. I've been here twice and I'd love to go again but there's a problem with the service. They're so curt and standoffish which ruins the happy mood the place sets. I like the burgers and the setup but the service I received was terrible.", "author": "Lubna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-23", "description": "Fantastic burgers, sweet potato fries with maple syrup (holy crap--awesome!),  Blue marble shakes, fried pickles.  Everything tasted delicious.  Burgers were cooked perfectly.  Staff were super friendly.  Perfect portion sizes.  Better all around than Burger on Smith, and cheaper ($55 including tip for my wife and I).  Will definitely be my go-to burger joint.", "author": "Jon O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "One of the best burger spots I've been to in NY. Owner is very friendly, and always stops by to check up on you. Try the Smokehouse, its amazing!", "author": "Seth L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}