{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "Great decor, interesting menu and we were treated well. I got the chicken dogs, which were only ok, but the zucchini fries were RIDICULOUSLY good! My husband got a burger and loved it.\n\nCan't wait to go back and try something else on the menu!", "author": "Jen E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "Amazing menu offering strictly organic and small farm ingredients leave you feeling (mostly) guilt-free, with carnivorous burger offerings ranging from beef to lamb to bison and other items like hot dogs and amazing specials from the mind of the ever-friendly Chef Mark.  The best fried pickles this side of the Ohio River, amazing sauces for whatever burger you decide on, an INCREDIBLE Ceasar dressing and, for those like me minding their figure but loving the occasional salty treat, sweet potato fries.  Courteous service and hospitality reigns supreme, even if things are chaotic: As a new business, these folks are open to suggestions as to how to keep customers happy and coming back.  And they serve a generous and delicious glass of Malbec!  Save room for the Blue Marble milkshakes that include flavors like PB\u0026J (kid favorite), bananas foster and the delicious classic Black \u0026 White.  \nI love that I can come here and order the same thing every time, or mix it up with a special and leave completely satisfied.  I can't recommend Moo Burger enough if you're in Cobble Hill or the vicinity.  I'm so glad we don't have to leave the borough for a good burger or compromise our consumer ethics, wallets or discerning burger palate anymore!", "author": "Kiki V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Nice family place with lots of kids. Great hostess. Good service, tasty food, good non-mainstreem beer. My only complaint is burger patty was kind if small. Will come back.", "author": "Andy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-31", "description": "The\nBurgers\nAre very\nGood but over\nPriced. Meh fries. Fine service. Nice aesthetic.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "I'm working here in Brooklyn for a couple weeks and the Moo Burger is the best place I've eaten at thus far. I had the hangover bison burger and it was amazing. There was a nice atmosphere in the restaurant and the waiter was on point with service. Very impressed", "author": "George V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-07", "description": "I needed meat. I envisioned a juicy, perfectly grilled, plump, handmade patty with lots and lots of mustard and dill pickles, please. I saw Moo burgers and thought I'd give it a try. It advertised organic meat, and I like my food without antibiotics and other trash. I asked the waitperson what their Moo sauce was and upon learning it contained mayonnaise I requested mustard instead. And oh my gosh, when it arrived, it was FANTASTIC! It was so good I can't wait to go back! The only reason I didn't give a 5 star review was because I also ordered a basic green salad and it was extremely boring, dressed with an uninspired house vinaigrette. The fries looked sensational and I'll try those next time. Wait staff was very attentive and friendly. Really good burgers!", "author": "Karin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "After walking by the signage for the last couple months, we heard about Mooburger opening yesterday from the BococaLand blog. \n\nWalking in, I had no idea what to expect. Was pleasantly surprised to find a sit-down casual restaurant atmosphere rather than a high brow fast-food joint (as I was sorta expecting from the name).\n\nWe had the Greek burger and the Court St. The Greek was a lamb burger with olive tapenade, cucumbers, eggplant and feta, and the Court St was Elk with mushrooms and brie. Both were tasty, despite them working out some \"open for only 2 days\" kinks, and would get them again.\n\nThe burger list looked pretty awesome, and there's a peace of mind in knowing the meat is quality stuff (all their ground beef is organic).\n\nDrinks-wise, pretty standard craft beer list on tap/bottle/can, and a couple seasonal brews. \n\nStandout of the night: Fried Pickles with a side of Horseradish Mayo. I'll go back for this alone. \n\nOverall, jazzed to see this joint open in the neighborhood, and will definitely return.", "author": "Matt T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "I love Mooburger! The food and the service are both great! Prices are pretty good too. The staff is prompt, friendly, and tries to give you everything that you need and want.\n\nMy boyfriend and I went there a lot. We came back because the salad, the burger, the salmon burger, all were wonderful. The other  times we went back the place was crowded with families enjoying themselves tremendously. There was a great vibe!\n\nThey aim to please, and gladly  fulfilled my request to have plain ketchup on my burger. \n\nMy boyfriend is into organic and natural foods. He Is very happy that the restaurant's menu states that the food  adheres to these standards.", "author": "Lucille S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "As always this place rocks I even come to Brooklyn for it and I'm from queens!( right next to the original bare burger- don't tell them :-/) love the hangover ,the beer , the staff , the onion rings ,,,,,,, and the shakes .......", "author": "Peter R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-18", "description": "DELIGHTED to learn Mooburger will indeed cook doneness to order! \n\nNot bad, this rare All-American burger, not bad at all. \n\nVery impressive that on this first day, when the place is getting slammed like never before, they still manage to stay afloat and crank my order out. The super hearty Cobb salad I ordered was missing ranch and avocado: went back and they were still getting slammed, and the manager refunded me after replacing the missing parts. Nice customer service. \n\nThe rare All-American burger is pretty good; not life-changing or exciting, but correct. \n\nThe fries are natural cut with skin and aren't too thick (as is often the downfall of many a crappy, mealy fry); I think mine were perhaps accidentally double salted, so: some lip burning, but still... proper weight, thickness, and consistency, if not my favorite crispier thinner style. \n\nChatted with one of the owners; nice guy, glad to see this addition to the neighborhood. \n\nIf they can keep their freshness, service, and quality up, they'll make gobs of money, as they're a welcome solace to the neighborhood's mediocre burger pantheon, their interior is lovely, and organic and locally-sourced will always prove potent selling points around here. \n\nDIE FIVE GUYS, DIE! I actively want them out of my neighborhood. I really don't understand what compelled someone to open a chain burger restaurant smack dab in the middle of this Cobble Hill culinary renaissance; very incoherent with the neighborhood's character. Looks like they're heading downhill anyhow, as I rarely see the place full.  \n\nCan't wait to try Mooburger's Court Street burger: elk, mushrooms, caramelized onion, brie: dammmn.", "author": "Fuzzy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-07", "description": "This is THE PLACE where you won't be disappointed: Fantastic Burgers, fairly priced, great service and super accommodating manager.\n\nI tried almost every burger and dogs, these people know what they're doing for real!\nYou must try their zucchini fries, unbelievable! \nI have my favorite burger which is the classic american with bacon, but with a bigger patty: it's just poor love!\n\nThe place is also very clean and you wouldn't imagine that they cook in the same area where people eat, there is no smoke, no grease, nor stink.\nI would recommend this place to anyone in the neighborhood seeking for great burgers/dogs with a fantastic wait staff that treat you right and nicely EVERY time you go. \n\nKeep it up!!!", "author": "Davide S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "The only reason this place isn't 5 stars is the service was a tad slow for a Wednesday afternoon. But the food was amazing my burger was cooked just right, the bun soft and the fries and onion rings were very tasty. The decor was pretty cool too.", "author": "Isaiah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "After unsuccessful attempts to get a table at 9 pm on a Saturday night at both the new beer hall and Strong Place, Moo Burger came through with a seat right away, some yummy fries, and a solid turkey burger. The beer selection was also pretty good, though $6 for a Narragansett is pretty ridiculous. \n\nThe wait staff was friendly and accommodating, letting my fiance and I relocate to another table when friends joined us, and not rushing us when we very nearly closed the place down. I would definitely go back!", "author": "Jill D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Mooburger makes the best burgers in Brooklyn and their PB\u0026J milkshake is amazing. The staff are friendly and helpful, and the restaurant has a warm and welcoming atmosphere.", "author": "Keri H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-28", "description": "good burgers (not the best i ever had but good) and great service.\nI had the bison burger with chili and fried egg -good-\nno frills presentation \n\noverall good place", "author": "curtis s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "The food was good.  I had a bison burger with caramelized onions, blue cheese, and arugula.  It came just as ordered, medium rare.  The bananas foster shake was very good too. \nI know quality is more important than quantity, but a $16 burger should be a little more substantial IMHO.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "My first time going to Moo Burger but certainly not my last! Everything I ordered was delicious. The Mac-n-cheese balls were sinfully delicious as were the zucchini fries which I dipped in tzatziki. Yummy! The French fries loaded with chili \u0026 cheese were so good we cleaned out that tray real fast. Yes I mean tray not plate. Your food comes on trays where you eat out of. I thought that was a different \u0026 cool idea. All our food came out real fast which was great because we were starving. I had the American burger and have to say it was the most juiciest, moist, flavorful burger I ever ate. There's something very pleasing about eating a burger with fries and washing it all down with a milk shake. Even for the healthy conscious ppl you have to try and enjoy. It's not all the time I eat like this but when I do it has to be worth it. After eating here my palette was left over the top happy. I along with my husband and kids will definitely visit Brooklyn \u0026 feast at Moo Burger again.\nWhat I wanted to mention was also how comforting and cozy this establishment is inside. Their industrial style restaurant has a warm and inviting feel to it. It is also an extremely kid friendly place. That's a plus for me. The staff is super nice and welcoming and I love the open kitchen. If you are in the Cobble Hill area of Brooklyn you must try Moo Burger. You won't be disappointed.", "author": "Rania C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-31", "description": "The burger is not much to go crazy about. Sure its huge \u0026 has bacon, and we all know bacon makes everything taste better. But in terms of the patty itself....it was just that, a beef patty. It was a bit dense and bland. Cooked perfectly though. \n\nHowever, the fried pickles.....my goodness, it was a whole different level. They didnt use your normal sliced pickles......It was this tiny baby miniature bite sized pickles that they fried in this light batter. It came drizzled in aeoli sauce (which tastes a lot like spicy mayo) and it was divine. It wasnt too oily, greasy, or thick in batter. Salty, sweet, fried goodness.\n\n\nThe chili fries was a bit too heavy for me, but I can tell you the fries \u0026 chili was nothing spectacular. \n\nTheir coffee was amazing though for a burgerhouse.", "author": "Edna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Moo Burger is my family's favorite place.   It is absolutely a joy to visit every week.  The burgers are the best in NYC! The staff and owner cherish your patronage. It is certainly their objective to make you feel welcomed. They are wonderful. 1st class.\n\nThe menu is outstanding. The food delicious. After you go once you will return over and over again. Try the bacon cheese classic with bison!!!!\n\nIf you haven't visited Moo Burger - you haven't tasted a great burger. Moreover, if you just want to be welcomed with open arms - stop by and have a delicious goat cheese salad, which of course has to be complemented with one of their delicious malts.\n\nThis is a 5/5. It gets the Silver Spoon Award. \n\nI must highlight again - the food is great but the owner and his team are even better. Always a pleasure to stop by (did I mention every week) \n\nVisit once and you will become a regular.", "author": "Wink M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "For vegetarians- their moo-less burger is delicious!  Their veggie burger is decent.  \nLove this place, but I'm lazy so I can't WAIT until they deliver!", "author": "Lauren M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}