{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "My girlfriend and I have been to moo burger a few times now and it's pretty consistently just okay. They do a good job with the presentation of the food, with the fries coming out in a nice little basket, the menus on clipboards, and a nice almost 50s kinda atmosphere. The service is also pretty good. The reason I'm giving this place 3 stars is because I just really don't like their burgers and fries, and given that they're a specialty burger place they should have great burgers and fries. The main problem with the burger is that the meat itself does taste high quality. The bun and fixings are good, but without a high quality juicy and tasty patty, then there's nothing you can do to make up for that. I've definitely had better burgers in NYC. However, this place does seem very family oriented and a cool place to bring your little kids - they'd probably really enjoy it.", "author": "Jason E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Had the Chicken Banh Mi sandwich. Very tasty. Excellent french fries. will go again and try the other burgers!", "author": "Colette B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "Freshest best burger you will ever eat. \n\nVery cute place with a great atmosphere and amazing burgers. My favs are the hangover and sweet potatoes fries with the syrup dipping sauce :)\n\nAmazing!!!!!", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-02", "description": "Nice atmosphere, nice staff. Burgers are very good (if small) - we had a Court St and a Bacon Classic. Fries were perfect although also a small portion. We shared a hotdog which was good but their dogs have a distinct spice blend added so not what was expected. I'd go back but stick to burgers and fries.", "author": "Josephine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-26", "description": "The inside is pretty cute with a large visible kitchen portion and the owner is always there insuring orders go out in a timely manner. On to the food:\n\n-The Hangover (bison burger with a fried egg, lettuce, tomato, smoked apple wood bacon \u0026 onions): so surprisingly bison doesn't taste much different from a beef burger. In fact it has somewhat the same taste but is a bit more wild and gamey--only slightly though. I substituted caramelized onions for the apple wood bacon and the caramelized onions were delicious. The fried egg was fried perfectly. The bread was perfectly cooked and mushy. But overall, I couldn't pick out any individual taste. It was like everything had too much or too little taste that they just meshed together. In addition everything was gushing out and barely stayed on the bun. So even though I was just eating cheese or onions, I couldn't pick out distinguishable tastes. A bit disappointing. \n\n-Zucchini fries: highly breaded so they are nice and crispy but you don't taste much of the zucchini. The breading doesn't have much flavoring either so it's like you are paying $4 for a measly portion of fried flavorless dough. \n\nFINAL VERDICT: the burger was good but nothing incredible or worth coming back for. Skip the zucchini fries.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "I think the Kool Aid man said it best.  FROM DOWNTOWN...what?  He didn't say that?  Then why do I yell that whenever I knock down a wall?  \n\nI digress.  This is one tasty burger.  No Big Kahuna, but then again, what is?  I had a little bit of the hangover, a bison burger with chee, bacon and your choice of egg.  I decided to go with goose, but apparently that's not what they meant.  Really REALLY good.  Also had the salmon burger, but this one seemed to be more bread than substance, but compared to the hangover, most burgers look slim.  Still really good, but I like-ah the beef.\n\nThey have a decent selection of beers you don't find just anywhere, so if you're looking for a C - (Coors Light), mosey on over to another altering hole.  Also, while I didn't get to try it, you can also order jugs of juice.  That Palmer is enough reason to give this place another shot.", "author": "Rommel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "Tried this place for the first time yesterday, and for the most part, I enjoyed it.\n\nI think that the Moo Mystery (strawberry lemonade) pitcher for 5$ is a great deal for two people. I chose to go with the All-American burger, with avocado and sweet potato fries. I really enjoyed the Moo sauce and the fact that the sweet potato fries came with maple syrup on the side. My boyfriend had the Bacon Classic with French fries, he seemed to really enjoy it. We decided to share an order of onion rings, but we were not crazy about them - No real flavor/breading and too greasy. \n\nI understand that this is a burger joint, but this place was SWARMING with kids who were literally SWARMING all over the establishment. The prices are to be expected for the area and quality/presentation of the food. The fact that the restaurant and kitchen share the same space, on top of all the screaming babies and children, this place is loud. Almost to the point that it was disturbingly loud, but like I said, it's a burger place, so not surprised. The food came quickly after we placed the order, but the waiter wasn't especially nice or anything. Aside from simply bringing the order to the table, he didn't really do or offer much. \n\nI'll probably return because the food was pretty tasty, we both enjoyed it. Looking forward to trying the fried pickles and the Greek burger, as well as one of their milkshakes, which I hear are delicious.", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-21", "description": "Totally fine, but seems overpriced. Nothing struck me as so outstanding about what I ate as to make the post-tax+tip price of a burger (no fries, etc.) come out to $16 or more - not particularly finicky ingredients, not mind-blowing flavor combinations, not absurdly generous portions, etc. - just really a pretty standard burger. \n\nThe Greek with a veggie patty is tasty if a little bland, the Court also got good reviews. The fried pickles were too oily/not fried crisply and a bit thick cut. The best part was the spicy aioli.\n\nMy main thought is that this place is just $3-5pp too expensive for this neighborhood and for what you get. With the prices at, say, Bareburger located up the street in a slightly pricier area, still being a few dollars lower, that difference is important, in terms of whether I would come back. I can't confidently say I will.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "Bison burger was UHH-MAY-ZINGGG!! Service was excellent, nice ambiance, good pricing. Cannot complain about a thing!", "author": "Jed M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "Let me start of by saying the the service is in need of a serious overhaul, the girl who sat us seem bothered to be there which seems strange since you are the host at the door doing the seating. Then with no hi or hello a bottle of water was put on our table and then the girl just walked away, nothing. When our order was taken, once again it seemed liked the staff could not be bothered. My burger was not good at all, and if management was on hand the day i was there and did nothing to correct the energy of the staff, them new management might be needed. Skip Moo Burger, there are other burger places on Court Street that are of better quality, and friendlier staff.", "author": "Nubia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "Gave it 4 stars b/c of the service - the ONE waitress working had to tend to multiple tables at a time so I'd understand if she couldn't get to us. But I saw 4 guys just hanging around the register and fooling around. They definitely could have helped the poor girl. She had a great smile and personality. \n\nI would give the food 5 stars though. Crispy and flavorful fries, great VEGGIE patty - yes, a successful veggie burger finally! Toppings were fresh and perfect for flavor and texture. I ordered a pitcher of the Moo Mystery drink (just pink lemonade haha) and it was awesome. Don't order just one glass if you're gonna drink more. It's definitely worth it. You save a few bucks by ordering the pitcher (it fills 2.5 glasses). \n\nIn the end, I would definitely go again. I probably won't go frequently b/c I don't live in the neighborhood.", "author": "Jackie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-05", "description": "Would i go back? yes. Excitedly, no.\n\nWith high praise, we were suggested to go. Famished, and ready to get our grub on, we were greeted rather pleasantly by a server, \"Sit wherever you would like!\" \n\"We'd like a booth.\" \n\"Sorry they are all taken.\"\n\"What about that one right there?\"\n\"oh. yeah. Go ahead and sit there i guess.\"\n\nFrom that point forward, I should have lowered my expectations, being a bit of a service snob coming from fine dining management. I couldn't let the service go, despite how incredibly awesome the burgers were. \n\nI asked for a dark beer, server offered an IPA. I found a stout on the menu.  \n\nWe ordered 2 sides, only one showed. \n\nThere was no up-sell for a second beer, with the empty pint glass on table throughout the meal (tsk tsk). We had to ask for share \"trays\" (shouldn't they have been provided with the onion rings we ordered as an app? what were we to put our ketchup on to dip the rings in?).\n\nWe were extremely pleased with the food, and if you can get over bad service, this place will win you over. The higher priced burgers and sides would be greatly justified if the service was better. And we know it wasn't just us. We watched another table have to get up and ask the waitress for things as well.\n\nAnd the real rub . . . as were were leaving, we think we heard our waiter reading off \"specials\". THERE ARE SPECIALS???", "author": "Kiley T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "I'm writing again to report on the gracious behavior of the owner.  We visited Moo Burger last night, at the end of a long-hot and sweaty 4th.  Apparently, Moo Burger's day had been equally long, because they were out of buns.  I told them not to worry about it, since we could manage without.  At the end of the meal, I noticed that our fries and $7 pint of beer had been comped.\n\nWell done.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "We often try different burger places and are tough critics. So this was a pleasant surprise.\nBurgers were awesome, hands down some of the best we've tried.\nDecor \u0026 service were decent, simple menu = concentration on making awesome awesomeness!\nWill try again, to be sure.", "author": "Juliet F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "Burgers are okay, tasty enough.  They need to work on their fries, reminds me of  the ones they used to have at Ranch 1, only greasier.  Nice decor and needed in the neighborhood.  A little pricey for what you get.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-12", "description": "Good burgers. Okay fries. Fantastic mac and cheese, onion rings, and zucchini fries. Service is friendly and not lacking for a burger place.\n\nWhy three stars? Because the price to size/quality ratio is off. The patties are fairly small. But I'm actually not advocating for bigger patties, since they're the perfect size for finishing the whole burger while not feeling gross afterwards. I'm advocating for slightly lower prices to match the size of what you get. As far as quality, the food is good but not mindblowing. Both burgers I've had there have been on the dry side, and yes, I ordered it medium, but there was no juice to be had at all. \n\nBlue Marble chocolate milkshake was good, but nothing so special that it should cost $7 (Blue Marble, you're another story.... another over-priced, over-hyped story, but I'll get to you in a separate review.)\n\nYou might be getting the impression that I'm a cheapskate, but au contraire, I am totally willing to pay good money for good food. Dubuque was that, and perhaps that's why they are no longer. Because Brooklyn loves paying too much for too little. A fair value in this neighborhood is as suspicious as skidmarked underwear on the baggage claim conveyer belt at LaGuardia.", "author": "Graceann D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "I remember there being lots of wood in this place. Wood floors, tables, booths...walls I think? \n\nBut what really is memorable is the Greek burger. Juicy lamb topped with feta, arugula, some pickles and a divine sauce had me wanting more. The side of fries were well done as well. Not too thick and mushy, and had just the right amount of crispness. \n\nWill be back here again!", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "The hamburgers were perfectly cooked and were made with very lean meat. The onion rings were delicious with a nice crispy beer batter. I liked the idea of serving the fries in a mini deep fry basket which very very good as well. I would have appreciated the fried pickles more if they didn't have the spicy sauce on them, which was not stated on the menu.\nThe hamburgers we ordered was the moo less, all American, and regular with pepper jack cheese and avacado. All of our hamburgers were delicious. The service was friendly and the resturaunt was clean. The only thing that I didn't appreciate were the uncomfortable wood chairs. The idea of this resturant is very clever by the way they have the menus on a clipboard. The only reason that i didnt give it 5 stars was because the wait was very long for the burgers but it was weel worth the wait! I highly recommend this place if you are near caroll gardens!", "author": "Angela R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-05", "description": "Chili cheese fries - great\nBacon cheese burger - decent\nMilkshake - maybe the worst I've ever had", "author": "Stuart M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-03", "description": "I stopped by with four other friends on a Saturday afternoon, but we were held up because of a children's party. We were eventually seated at one of the large picnic tables in the center of the restaurant, which is a pretty convenient spot for larger groups. We split a few Arnold Palmers and an order of moo fries (fries with cheese and chili), the latter of which was large enough to split for 5 people and was pretty tasty. I ordered the Court Street burger, which was on the greasier end but was delicious and well-made. The ingredients were all tasty and worked well with each other, particularly the bleu cheese, but it was definitely on the pricier end given its size. Definitely a place I would come back to for a solid burger, but it's not the cheapest meal.", "author": "Dennis J."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}