{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-11", "description": "it was just average, not what i was looking for. reasonable prices. prob wouldnt go back", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "I crave their court street burger, and love their chopped salad. The staff at Moo Burger is always super nice, and they are beyond accommodating to kids. This has become one of our go to places with our toddler as both parents and baby love it. The restaurant is well designed, and the beer good. The only thing I would flag is that the burgers come alone - no sides so adding things can get pricy. Fries are a good portion, but the zucchini fries (which are yummy) are a bit small for sharing.", "author": "M J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "If there was a 10-star rating system I'd give this place 10 stars! Super duper yummy burgers. Maybe the best I've ever had. Try the lamb burger or bison (court st) burger.", "author": "joe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-24", "description": "Fantastic food and service. Get there before 7pm on an average night to avoid the wait. Overall great food and reasonable prices.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-22", "description": "Amazing. Each burger better than the last.  Loved the bison, the salmon, the Italian. The white cheddar cheese is incredible. Great all around! Terrific addition to the neighborhood.", "author": "Anna Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "After going back there a few more times, I think they deserve a 4 stars. Great solid burgers and delicious shakes. The only thing that they still need to improve on is their service.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-01", "description": "Chef Marc really knows what he's doing. He has created a comfortable and beautiful environment to enjoy his delicious creations. I have tried about half the menu and have no disappointments. Excellent!", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-28", "description": "AWESOME....as good as shake shack if not better. plus you don't have to wait too long.the menu is great  and full of organic choices...the place rocks", "author": "Paul R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "This is one of my favorite burger spots in the neighborhood. My boyfriend and I often catch a movie at Cobble Hill Cinema and then head here after for dinner. The burgers are really good. I have tried the bacon classic, the buffalo chicken, the Brooklyn Chili, and the Hangover. The bacon classic and buffalo chicken were probably my favorites. Don't get me wrong, the Brooklyn Chili and Hangover were both awesome, but both were really messy and incredibly filling-I could only finish about half of my burger (if that) when I got these. We have also tried the mac and cheese side dish as well we various fries here. Their fries are good and they come with Moo sauce and Chipotle ketchup if you ask for them. As others have mentioned, the prices are a little steep-we are always surprised by how much we spent when we get our bill (especially if you have a drink or two), but the food is really good and the service is friendly and in our experience very fast.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "Awesome! I loved the burger and ate it all. The milkshake was also nice.", "author": "Ewan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "great place and popular for a reason.  i've had the lamb and bison burgers, zucchini and sweet potato fries, and all were wonderful!  the service is also exemplary - i would never expect a place like this to have courteous, smart servers but they do.  no attitude here.  i only give four stars because i wish they'd bring back that delicious ciabatta bun from when they first opened.  now they've switched to brioche, and while it's good, it's too buttery and there's little textural difference between the meat and the bun.  perhaps they'll offer a range of buns one day...\n\noh, i should also mention that even the ingredients that are often overlooked but can ruin a burger, like mealy tomatoes or too-thickly-cut red onions, are also perfect here.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "A friendly and knowledgeable staff.  AMAZING food.  Great atmosphere.  I've gone several times I now and have had the mac \u0026 chesse, the milkshakes, the onion rings, the burgers, the sweet potato fries and I never get the bloated or that gross feeling after you eat this kind of 'comfort food' Their ingredients are obviously top notch.  GO.  You'll be happy you did!", "author": "Carmen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "Welcome to the neighborhood Moo Burger!  All in all we had a great visit. There's a lot of variety on the menu - burgers, exotic meats, turkey burgers and chicken burgers. (Maybe veggie I forgot to look). Yummy dipping sauces, salads, and the shakes are on my list to try.  The hostess seemed a little slow but hopefully that will get better with time. Unsure why we were waiting when at one point I counted 7 free tables for a party of 2. Word to the wise, medium = quite pink, what I would normally consider a medium rare. Order accordingly!", "author": "Emily M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-03", "description": "If it weren't for the staff, I would give this place a 5-star rating. The burgers and fries we ordered were absolutely delicious. I love the interior of the place and its selection of beers. But really, I could have done without the clueless and obnoxious staff.", "author": "Andrea Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-10", "description": "Yum, yum.  We've been here twice.  Delicious burgers, nice beer selection, great sweet potato fries that come with maple syrup (sounds strange, but delicious).  Still working out service kinks.  We think this restaurant will make it in the neighborhood.  We're fans.", "author": "Cobble G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "Finally a really great burger comes to Court Street in Cobble Hill. The burgers are delicious and the sides are amazing they even have milk shakes. The owner is very personable and cares about your experience!  It's a MUST GO TO!!!", "author": "Angela B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "After months of resistance, I've finally given in to my foodie friends and joined yelp (you win John.)  Now that I've arrived, what better maiden voyage than the eagerly anticipated Mooburger that just opened 2 blocks from my house.  Great food!  I went with the All American which is their most traditional option.  The organic beef was great and the house \"moo sauce\" was a delight.  The food came fast and my waiter was polite and personable.  The only thing that kept me from giving 5 stars was the manager's incessant need to talk to me and my daughter.  Don't get me wrong, I was happy to meet him and it's great to know that the manager cares.  But after he stayed there for 20 minutes, it got tedious.  I was there to enjoy a meal and talk to my daugher and I found myself talking about the ins and outs of this restaurant almost the entire time.  Great food and service though!", "author": "Steven G."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}