{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Amazing burger and sweet juicy onion rings! Blue Marble milkshakes are on the menu and is just as good as at the shop, also great root beer. It's a bit more expensive  than other burger joints, but all in all great place!!", "author": "Liv R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-20", "description": "Very impressed.  A much better, much nicer, and much more interesting version of Fort Greene's Burger 67.  \n\nBeautiful interior, attentive staff, strong service (even on Day #3), and very good food.  Kid menu is compact but totally appropriate, and the entire crew was eager to make sure we had a terrific meal.  Hope they can maintain this great start.  With Brucie and Van Horn, another fantastic addition to Court Street's food row.", "author": "Sparkle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-15", "description": "I mean, their burgers are good. So are their sweet potato and zucchini fries. Not sure why their burgers had to be so expensive, considering the fries cost extra and there are just as tasty burgers for less down the street. The place has cozy, diner vibes, which aren't exactly my thing but it might be your preferred burger-consumption environment. I'll probably come back next time I'm craving a burger.", "author": "Cole P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "I mainly come here for the Hangover Burger (which I LOVE), but just had the Old Fashioned Hot Dogs...(that's TWO hotdogs).....Boy oh boy was that worth every penny I paid for!!", "author": "Brooke M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-01", "description": "Mooooo!  That's the sound my burger made when it arrived in front of me.  Yes, it was that fresh and delicious!  Perfectly cooked to medium (just like I asked) and with just the right amount of toppings.  I ordered a side of onion rings (which weren't the best I've ever had but they were good) as well as a side of deep fried pickles.  Gross you say? Noooo, it was delicious.  They had a spicy chipotle type mayo on it which perfectly offset the sourness of the pickles.   I will warn others that we paid $40 bucks for two burgers, two sides and two drinks, so it's not a cheap place, but well worth it!", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-11", "description": "Attentive staff, great tasting burger with a plethora of meat and toppings options. Nice selection of craft brews as well. I will be back.", "author": "Matt B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "My girlfriend doesn't eat meat as a general rule but was craving a burger. One court street burger and an order of chili cheese fries later made her a carnivore. Think this is the best burger in the neighborhood. The food was extremely fresh and we didn't feel disgusting after the meal. Agree that the fries were a small portion but seriously, do you really need to eat that many fries?", "author": "Bkduc D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "Great food, my wife and I had the Mooless sandwich and it was fantastic. The onion rings and zucchini fries were awesome. I would have given them 5 stars, but they forgot to put in the order for my daughter's meal and it ended up being a stressful lunch.", "author": "Joe A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Hands down the best burger in all of NYC, and I'm not exaggerating. I've had several different types of burgers here and everyone of them has been delicious. My favorite? The lamb, yummy! Also, good beer selection as well.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-14", "description": "I am giving it 5 stars because the food and decor/atmosphere were AMAZING!  We ate here last night and I have to say that every plate that hit our table was better than the last.  We were a party of 4 and we all agreed to order 4 different burgers \u0026 sides and share, it was all so good, that I almost started mooing!  I may have to slightly agree with some previous posters about the staff, but after speaking to the very accommodating manager, we did learn that they have not even been open an entire month.  I can see past a few small errors and mix ups until they find their \"groove\".  I really loved the overall vibe of this place and we will definitely be back.  I think that they are a great addition to the neighborhood.", "author": "Gigi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-08", "description": "ORGANIC beef burger cooked to perfection, deliciously dressed with fresh lettuce, tomato, white cheddar and applewood bacon and all for a cost that is less than what you'll pay for the crappy chopped meat burger you'll get down the block! Add to this the extraordinary welcome of Micky, the owner and host and God I wish I lived close enough to make thismy 'local'. I envy those of you who can! And anyone going to the Cobble Hill Cinema in the next block should stop here before or after! That's what we did.", "author": "B B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-15", "description": "My husband and I went last Thursday and loved it.  We both got the hangover burger - he got his with lamb.  They were cooked perfectly (they asked for temps: his rare and mind medium) and it was a perfect amount.  We also shared a pumpkin shake and sweet potato fries.  We thought the portions were great - it was nice not having too much food and then overeating.  \n\nSure there are some kids there but it's BoCoCa so it's expected.\n\nDefinitely a place to check out and one that we'll visit again!", "author": "Claire M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "We have eaten there twice and both times have been great.  I am kind of obsessed with the salmon burger...it is moist, not too fishy, and delicious!  I ordered it without the smoked salmon on top and preferred it that way.  Also, the zucchini fries are amazing!  (If only the portion size wasn't so small.)  The fried mac and cheese is also delicious.  The lamb burgers and hamburgers that my husband got were great, he said.  The milkshakes for dessert are also delicious.  We had a pumpkin one and a bananas foster one.  They were both amazing!  \n\nThe service was fine...no complaints there. \n\nMy only complaints (and why they didn't get 5 stars) are the portion size of the fries and the fact that they don't have a real veggie burger.", "author": "L K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "moooo sauce mooo burger with some bacon and cheddar! i really love this place and love the service. The atmosphere is great and the price are decent for organic meat!", "author": "Justin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "I have been passing this place the last few weekends but it has been way too crowded to go in. So, passing again on a Tuesday I noticed it was pretty empty and gave it a shot. The seating is way too close together for my liking, but the atmosphere is comfortable and the staff is friendly. The burger was unbelievable!! I had the bacon cheeseburger and it was juicy, tasty and the bun was incredible. The fries and onion rings were nothing special and a bit too greasy, but the burger alone is worth the trip!! Also note - they do not have diet soda, only specialty colas.", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-04", "description": "The entirety of Moo Burger's business is, in a fiercely competitive restaurant neighborhood, burgers, yet the food and service were unremarkable and, in the end, disappointing.  While it's better than the takeout Chinese place that occupied the space, Watty and Meg down the street, and Dubuque and Prime Meats in Carroll Gardens all offer far better burgers and an overall better experience.\n\nI ordered the standard American burger medium; it arrived overcooked.  Judging from other reviews here, getting it done to order is a problem (to be fair, the place is only a few weeks old).  The burger should be properly sized for the bun, but the one here is too small; I ended up with a quarter of the bun uneaten.  My expectation of the veggie burger was that it would contain a variety of vegetables; this one was piled high with, and tasted exclusively of, eggplant.  The fried pickles were giant whole cold pickles in a loose, mushy fried exterior.  The serving of french fries is too small to share.  The fries are served in a clever little fryer basket, but because the basket holds more fries than they wanted to serve, it was filled with crumpled up wax paper.  I'm not a fan of large servings, but there were disappointingly too few here, like when you open a new box of cookies and find that it's only a third filled.\n\nAll the food arrived warm, not hot.  We had the sense that the fries, for instance, had not been made to order but had been sitting for a while.  The decor was nice but the room is large, noisy and impersonal.  After our plates were cleared, our waiter never came by to ask if we wanted something else.  We waited 15 minutes until we flagged down a bus boy.  Given that every table is filled and people were waiting, you'd think they would want us out of there or buying more stuff.\n\nWhat do I like about Moo Burger?  They say that the use organically raised meat and locally-sourced produce; it's thrilling that a place that sells an $8 burger can do so with organic ingredients.  Although I prefer my burgers unadorned, there are tons of extras and options on the menu.  We didn't try the milkshakes, but they're made using ice cream from Blue Marble, also on Court Street.  Besides beef and veggie, you can upgrade your burger to chicken, bison, turkey, elk or ostrich for a couple of bucks.", "author": "Timothy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-27", "description": "Just a quick update: The chicken hot dog was deeeelicious! The toppings were especially tasty (arugula, onion jam).  And you get two with the order. I would really recommend this dish.\n\nThe fried mac-n-cheese (which is usually one of my favorite foods, and I thought was impossible to disappoint) was almost gross. They don't use enough cheese in their sauce, so it tasted just like a bechamel sauce. Also, the breading is very thick and not particularly tasty. Everyone at the table tried them and agreed.\n\nMy friends all ordered burgers and were happy, though nobody thought it was anything to write home about. Come with low-ish/moderate expectations and you won't be disappointed.", "author": "M M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Favorite restaurant in NYC. By far the best burger we've ever had. The milkshakes are yummy too.", "author": "Meirav W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "First off, this place has the best sweet potato fries I've ever tasted. \n\nOther than that everything we had was great. Nice decor, attentive staff. Was especially pleased by someone who seemed to be the manager. \n\nHad the Court Street burger and the Buffalo Chicken. The chicken was better but almost too spicy for me (I'm a spice lightweight though). The blue cheese on it was pleasant without being overpowering. I ordered the  bison (Court St) medium well which was probably a mistake, since bison is not a super juicy meat to begin with. But the taste was excellent and it WAS made to order.\n\nEverything organic. They don't offer anything from a soda fountain. Great addition to Cobble Hill.", "author": "ET B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-03", "description": "I go to a burger spot expecting the one thing they do well is make a burger. Mooburger left me disappointed. The burger was cooked well but had NO flavor. No seasoning. Just bland. I had the Hangover my girl the Chiliburger. Both were bland. The chili also had no flavor on the Chiliburger. The fries were okay. Frozen Mac and cheese was probably bought at Trader Joes next door. Ours came out cold in the center. All and all, food was not satisfying. Service was good. Food came fast. Place looks nice. But me, I come for good food. I will look elsewhere for my next burger.", "author": "Curtis B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}