{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "Moo Burger provides a quality product. The burgers are satisfying, albeit a little small especially since sides are extra.  Staff is attentive, quick, and friendly. If you are seeking an alternative to bare burger, this is the place for you. I would return.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-17", "description": "Really good, but like others are saying portions are small.very small burger, almost thought they forgot to add it! The onion rings are perfectly cooked, and def a fun chill atmosphere.", "author": "greg j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "My bf really liked his mac n' cheese burger, but my turkey burger was just ok -- it was not served well by the dry, crumbly wheat bun on which it was served. I liked my zucchini fries, which came with a tasty tzatziki sauce. Friendly service.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "This place is so homey! The atmosphere is soothing and the service was great. The burgers and food is also really great! I got a Mac n cheese burger and it was one of the best burgers I've ever had! I loved this place.", "author": "Sylvia K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "The burger was about a 2 out of 10. Horrible bread. To top it off we asked for diet coke and got Boyland diet cola. No one wants Boyland diet cola. Tastes like battery acid. For $3.50 per soda. The waitress could have mentioned that she was bringing us that garbage. What a joke. Do not recommend. \n\nMinimum of $11 for an atrocious burger.", "author": "John A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "Moo Burger is amazing! Our burgers were cooked to perfection and their customer service was spot on. It's kid friendly and they have vegetarian options. I 100% recommend.", "author": "Jessica J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Wonderful service, food, and vibes! It wasn't as busy as I thought it would be for a Sunday afternoon but I'm not complaining! I'll definitely be back!", "author": "Chalcedony W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Two words.. sooo good. \nEverything in this place was great. The food is fresh and delicious, the stuff is so nice and helpful. \nGreat place for kids. \n5  for this amazing restaurant...", "author": "Eli A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Definitely my favorite place in Brooklyn to get a burger. My girlfriend and I just really love the area and typically come in after a movie across the street. Burgers are always great and the apps are phenomenal.", "author": "Cody H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "I have been to Moo Burger quite a few times, what seems to draw me back every time other than the burgers are the super delicious sweet potatoes fries (with a side of maple syrup)\n\nThe burgers here are always great and I love the topping offers and the specific bun that they use.  \n\nI would say the hangover, smokehouse and bacon classic burgers are my top picks! Especially the smokehouse burger, nothing beats a burger topped with pork and an onion ring :)\n\nFor drinks I highly reccomend the lemonade! \n\nNow for sides, I've only tried the sweet potatoes fries and I refuse to abandon them and try something else because they are too good! They are served in a cute metal basket and they put the perfect amount of salt on them.\n\nThe atmosphere here and the decor is nice, lots of wood makes you feel like you're in another town. I also like the cute touch of the employees wearing plaid shirts. \n\nThe only thing I dislike about this spot are the prices. I feel they are a little steep for a burger place. I still come here because the food is worth it but wish they were a little cheaper. I also don't like the new trend of burgers and fries being separate in price, but that seems to be everywhere now. \n\nOh....i almost forgot!\n\nGET A MILKSHAKE \nI'll leave it at that\nYou will not be disappointed", "author": "AMANDA R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "This place was delicious, a small exclusive atmosphere but so fun and a great place to enjoy some casual quality food.  The service was wonderful as well and the manger checked in with us a few times, smiling and happy.\n\nWe got the street corn as an appetizer and it was wonderful.\n\nThey have the greatest sides, the Mac and cheese balls come in a set of 3 and are so yummy. Fries are done to perfection as well.\n\nFor alcohol they have either beer or wine as options, no liquor. (Not a problem here)\n\nThe burgers were all incredible, you really couldn't go wrong with any of them. I added avocado to mine. Everyone in our party left happy.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "Leave it to gentrified Brooklyn to have you paying $18 for a burger and beer. To be fair, the food was good and the servers were super helpful.\n\nBut be warned! They are terrible at card mix-ups with large groups. I was overcharged $20 extra for my fee. But hey, accidents happen right? I called the restaurant about it which they said they would check out and fix. Only they didn't. So I called again, and still they didn't. \n\nWhat is the lesson here? Well first, I only ate here with hipster colleagues to be \"social.\" That's where I fucked up, overpaying for simple American food out of pressure to have friends. Second, check your bank statement when you eat here! Third, the bank has your back when Moo Burger doesn't.", "author": "Brian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "everything was so good!! I had the hangover burger which was cooked perfectly, i ordered it with a gluten free bun which tasted great too. on the side i had fries and a chocolate milkshake. the service was great as well, our meals came quickly \u0026 the staff was friendly. would definitely come back!!", "author": "Chloe P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "Stopped by for lunch with a colleague on a Tues right around noon.  The special salted caramel pumpkin shake drew my colleague right in.  I had the short rib sandwich and my colleague had the all american burger.  My short rib sandwich was AWESOME.  It came with some dipping sauce but I enjoyed it just as it was.  The fries were really good as well.  My colleague truly enjoyed his burg as well.\n\nI liked the warm feel of the place. Nice wood flooring, lighting, good music and the service was great as well.  Felt very comfortable and will definitely return.  Thanks for a real nice lunch guys!", "author": "Robert R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Went here with my friend recently. Ordered the pulled pork burger and a side of fried pickles. Fried pickles were tasty. Burger was good but a bit dry towards the end. Arrived hungry and left still a bit hungry. Probably because the bread buns were so light, not filling.\n\nStaff was nice and efficient, though they seem quite rushed. Family friendly place.", "author": "Kali N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "This is my favorite burger place ever. Ive never had such tatsy and delicious burgers.I've been twice here and every time i try something new andi've had an amazing experiance so far.I highly recommand this place, if you are a burger person, this is the place you should go to.10 stars from me", "author": "Nina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-11", "description": "Normally a fan of Moo Burger. Leaving this 2 star review as my family recently ordered delivery - 2 burgers \u0026 fries and a salad - requested additional ketchup \u0026 dressing and received 1 dressing and 1 tiny ketchup packet. It wasn't enough ketchup for one burger, let alone 2 and fries. We called and they mentioned there was a ketchup packet shortage? The girl was nice and offered to send more, but c'mon fam, the foods already there. Be better Moo Burger! You guys have a great spot but those little details matter.", "author": "Brendan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "Another burger joint in Brooklyn, nothing unique or that stands out. Way better than any of the chain restaurants.", "author": "Ralph L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "I love the decor here. Very modern. I had the All American burger with a side of fries. Burger was delicious, cooked to the right temperature and full of flavor. I really liked the bun as well, very fluffy. However price is a little expensive for the portion size. The burger was pretty small! Sad to say I was a little hungry afterwards.", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "We are from out of town and found this place on Yelp. The service AND food were amazing!!!!! I would return and often!!!!!!! The sweet potato fries were the best I've had!!!!!", "author": "Crystal D."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}