{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "Just finished eating the BEST chili burger and sweet potato fries. Will be coming back soon. Everyone was super helpful and nice and the food was even better! \n\nThumbs up!", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Pro:\n-family oriented\n-fun, lively, casual\n-great music\n-excellent burger- bison burger was top notch and the best sweet potato fries I've ever had\n\nIt's lit up very bright, many kids around, and casual. I went on a date and while it was very fun, it wasn't exactly the dark, classy, and romantic environment I'd hoped for. I will be returning with friends!!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "First the positives.  Cool place with good beers.  Negatives: Got greek lamb burger and wife got short rib and with both the meat content was small.  I would say I had about 3 Oz of meat.  Ended up leaving hungry despite 2 beers.  Hate that.  $65 for burgers and left hungry.", "author": "Marc O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "This place is literally right across the street from the school I teach at. A group of us loud people (we're too used to being in front of kids) walked over before parent-teacher conferences to grab some food. We were loud, I won't lie. But the service was great, food was very similar to bareburger, which I also really like. Perhaps because we had a big group, the food took a while to come out, but they served us all at the same time.\n\nWill definitely be back!", "author": "Grace W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-01", "description": "Moo Burger is just a straight-forward good burger.  \n\nThe burgers are well cooked, juicy but not greasy and well seasoned.  The fries and very well done.  The onion rings taste like a beer batter - a pleasant surprise, though they could use a dash of salt coming out of the fryer. \n\nThe wait staff is friendly and efficient.\n\nThe only reason Moo does't get a fourth star is for the speed (or lack there of) of food coming out of the kitchen.  On average it takes upwards of 25 minutes to get a pair of burgers out, regardless of how full the dining room is.\n\nOverall, this is a good place for a relaxed meal, uncomplicated and tasty.  From the times I've been there, it appears a good family place, as there are always tables with kids of all ages.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "I often have visitors from abroad visiting and Mooburger has become one of my 'must visit' restaurants. Burgers / America / New York kind of has to happen! After the experience the common consensus is best burger ever.  \n\nSmokehouse for my cousins partner . Top pick, the most amazing burger ever\nTurkey Cranberry for my cousin, she said it was moist and yummy\nFor a change I had the Thai Chicken special and it was great, sweet and fresh. \nAlso pulled pork on the side because it's just soooooo good (they pull it themselves) I get jealous otherwise of anyone having the smokehouse and it's not good form to steal your guests food.  Onion rings, light and fluffy and fries. Yumyumyumyumyumyumyumyum!\n\nOur waitress was lovely and smiling as always, and for the second time I met one of the owners, a great host and rightfully proud. Loves that it has become a true family, local atmosphere and it shines through the experience loud and clear that they are encouraging it. Enjoy!", "author": "Kate D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Great burgers! We have been to this place a few times and always had a great experience. The staff is very friendly and accommodating. The owner is around most of the time and always stops by our table to say hi and to ask how things are. The all American burger is amazing. And we are a big fan of the \"moo\" sauce. Zucchini fries is really good but with french fries it's hit and miss. Sometimes it is overly dry and in small pieces. The mixed greens salad and the Caesar salad are always delicious.\nOne thing I am not a fan of is their water. They do not have bottled water, and the tap water that they serve out of the wine bottles sometimes has unidentified particles swimming in it. I imagine it's not easy to get these bottles properly cleaned.", "author": "Lana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Great burger and appetizers. Id definitely recommend it to anyone in the area. Best corn on the cob of my life. I'll return repeatedly just for that.", "author": "Brian B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "We walked in and were greeted by warmth and the smell of burgers. Moo Burger was saying \"Welcome\" as it embraced us with its goodness.\n\nThey have a great assortment of burgers, but we decided to go for the Bacon Classic ($12), which includes a beef patty, white cheddar, applewood smoked bacon, chipotle ketchup, tomato, lettuce and onion; I added sauteed mushrooms to mine for $2 more. The bun was glistening, brown and soft.\n\nHands down, one of the best burgers I have ever had in my life, even cooked well done! They aren't cheap and after trying their sweet potato fries, I suspect that their sides are probably more standard than their burgers. But I feel confident in trying their other options (salmon burger, chicken burger, mushroom burger, etc.) because they at least nailed the classic burger.\n\nThe beef patty wasn't huge. And I'm going to be honest, Five Guys makes a comparable burger, although flatter, and it's slightly cheaper. But if you feel like sitting down some place and having alcohol, splurge the few extra bucks.\n\nDespite being crawling with kids--totally expected in this area--it's still a fine spot for a casual date. The decor is warm and the staff is beyond friendly.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "I was bummed that I didn't know about this place when it first opened! Their burgers and food are made of quality ingredients and are delicious!\n\nTry the sweet potato fries and beef burger with mushrooms.\n\nThe staff and the owner are very friendly and make you feel at home and special.  I love this place and so glad we have it in Brooklyn!", "author": "Karuna S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-21", "description": "Came here on a rainy Sunday evening.  This place was packed! All other local restaurants that I walked by were emptied... So I had to check this place out.\n\nI wasn't craving for burgers but my tummy growled as I read through the menu lol.  Hmm should I get the Moo Less or the Brooklyn Chili or the Bahn Mi or Turkey Club or the Veggie one... Ugh so hard to choose!!!  \n\nAfter an indecisive moment, my friend and I finally ordered:\n\nTurkey Club (turkey patty, applewood smoked bacon, lettuce, tomato, cranberry mayo) $11\n+ fried egg $1.25\n~ because of the cranberry mayo I ordered this.  Sadly, I didn't taste any cranberry mayo.... I still enjoyed the burger but it wasn't mind blowing omg I want another one type of deal.  I don't eat bacon, so I gave that to my friend.  I should have gotten the Veggie one =\\.  Anyhow, the patty was cooked perfectly.  It did taste turkey.  Again, I expected a wow flavor with the combinaton of cranberry mayo.\n\nFried Mac \u0026 Cheese $6 (as my side)\n~ 4 giant balls served with spicy mayo.  First time having fried mac \u0026 cheese and I wasn't diappointed.  If I were they, I would choose a different type of sauce.  The mac \u0026 cheese was already heavy and with the mayo it was too much.  Perhaps they should just serve them without the mayo.  \n\nSweet Potato Fries $3 (served ine a tiny frying basket with maple syrup on the side)\n~ typical sweet potato fries, nice presentation, first time having it with syrup something different.  good amount.  not too much not too litte.\n\nCole Slaw $3\n~ pretty delicious but a little too watery for me\n\nHangover Burger $14 (bison patty, applewood smoked bacon, white cheddar, lettuce, tomato, red onion, fried egg, chipotle ketchup)\n~ my friend devoured this with nothing left on the tray, he said it was one of the best burgers he ever had.  \n\nThis is a cute place for families with kids, casual dates, small group hang outs.  Very spacious.  Very cleaned.  I constantly see someone sweeping the floor whenever people leave.  The bathroom has a sliding door, pretty cool lol. \n\nI wasn't all that satisfied with the turkey burger but I would like to come back to try other burgers.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "3.5 stars... but 4 because of the decor!\nHad the All American, with sauteed onions instead of red onions. Perfectly cooked Medium as requested. The burger is kind of small, I could have easily had another one. The meat is gooooood, but I really didn't like their Moo Sauce, that's it. I'll have it with a much more regular sauce next time. The Decor deserves 10 stars, awesome!", "author": "Luca A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "In comparison to the more popular competitor chain down the street we really enjoyed our meal. Moo Burger has fewer options and offers more of a cute and laid back atmosphere, it is absolutely no frills. The vegetarian burger was not the best I have had but it hit the spot, enough for me to consider going back. The fried pickles.... those fried pickles were....omg! Great food, great staff, lovely ambiance...test it out.", "author": "E A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-08", "description": "Slow service- charge you for everything extra \u0026 sit you next to the kitchen so you smell like a slab o' meat.\n\n\nSo, I come here and was like, cool let me grab a veggie burger, my boyfriend can get his meat fix and i'll get some zucchini fries. \n\nUgh, so the veggie burger was bad, I was charged to put extras on it when it was already 12 or 13 bucks without any extras*(lettuce tomato and onion are included). \n\nCut to- a few hours later both of our stomaches hurt and so do our bank accounts because everything is severely overpriced and apparently fuck your insides up. \n\nDo what we didn't and don't go here.", "author": "Stay S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-11", "description": "The second most expensive burger I've had in years. Wasn't impressed. I would try another burger from their eclectic menu but I don't think the outcome will be any different. With so many restaurants in the immediate area it'll be a while before I try one again.\n\nOnion rings came out great though. \n\nAnd beware of their horrible bottled sodas. Overpriced, watered down and nasty - I say. A light and refreshing beverage with less sugar and calories - they say.  I would only drink another if it was the last beverage on earth. Stick with water... you'll thank me.\n\nService was alright. My waitress did come and check on me.", "author": "Joshua G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "My husband and I loved this place! I'm 8 months pregnant and had a craving for a good hamburger. I'm so glad we found this place! I had an All American and my husband had the Hangover (bison meat). They were both delicious!! Nice and clean tasting, not greasy at all! Very flavorful!! We will definitely be back!", "author": "Cortnie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "This place has excellent burgers--probably the best in the city!! Service is fast and quick. Highly recommended if you want your burgers juicy!", "author": "Shas S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "Great burgers and pretty solid service. I like the Classic but the next time I go, they have a Bison burger with bacon and egg. It looked awesome and from the sounds of my dining mate, worth the dough.\n\nThe beer selection here is pretty solid and they have Abita root beer. The one downfall to me is that fries don't come with the burger. It's worth shelling the three bucks for fries though as they come in a cool deep fryer basket.\n\nA solid, solid Cobble Hill establishment. Best burgers in the immediate area, as far as I know.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Best burger spot in the neighborhood.  While many other places have opened over the last few years, none of them is capable of putting out consistently good food.  And I stress consistent, as the others might put out a good product sometimes....\n\nAbsolutely love the \"Court Street\" as it blends the perfect flavors together with the burger.  They actually have a GOOD veggie burger which is generally not the case.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Yummy and fresh! I really appreciate the fact that the meat is organic/all natural \u0026 that they have such scrumptious combinations. Friendly service is an added bonus!!!", "author": "Olga T."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}