{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "I don't Yelp enough, but after eating at Moo I had to log on and review this place immediately.\n\nThis is the best burger place I've been to in NYC. My boyfriend and I get burgers a few times a month and always try new places, we went to Moo for the first time tonight and LOVED it. \n\nI had the classic burger with mushrooms and bacon and it was spectacular, the fries and onion rings were amazing, the unique tasty Moo Dog is a must have, and the Moo sauce was perfect for dipping. And it's all organic, how great is that?\n\nThe restaurant is cozy, clean, and sleek and the staff was beyond nice. Our waiter Jason rocked. We also talked to one of the owners, Nicholas, when we told him how great we thought Moo was, he was so appreciative and sweet.\n\nI highly recommend this place and plan to come back often!", "author": "Izzy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "I came here last night and it was packed to the brim with people. The line was practically out the door. Despite that fact however, we were still seated and waited on rather quickly.\nI ordered the smokehouse burger. The wait time for it was a bit long, but considering they were packed, I didn't mind.\nThe food was great; my burger was cooked perfectly, and the fries tasted pretty good. My only complaint was that the lemonade tasted awful.\nI'll make sure to come back again next time I visit New York!", "author": "Nick I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "I'm wavering between 3 and 4 stars--but I'm going to go with 4 stars until we eat here a few more times. \n\nOther people have pretty clearly outlined the pros and cons. Small space, gets crowded, and inconsistent cooking. Meat quality seems good, and the burgers are mostly enjoyable. Not much in the way of healthy sides, but the fried options are tasty enough. I mean, fried zucchini isn't going to be the next big thing, but I guess it's fun to try something new every once in a while?\n\nWe'll be back, and I'll happily end my meal by ordering a shake to go. Great way to enjoy the walk home!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-21", "description": "This review is solely for the sweet potato fries.\n\n1) They were hot! Not just warm, but straight out of the fryer to the table, no wait. And the burger was hot, too. Impressive timing.\n\n2) Maple syrup to dip them in! Genius! \n\n3) Take away (1) and (2) and they were still the best sweet potato fries I've ever had.", "author": "Peter N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-17", "description": "Walked right in and waited about 7 minutes for a table on a Friday night before going to see Hunger Games at Cobble Hill Cinema.  Seriously, I was so hell bent on getting to the theater early that I would only eat at a restaurant where I could monitor the line situation!  But I digress...\n\nI thoroughly enjoyed my chicken burger and sweet potato fries.  They know how to do it.  I also was feeling crazy that night and got roasted red peppers on top.  I love that roasted red peppers are an offered topping.  \n\nWhile I ate here about a month ago, I can't really remember anything else.  Not sure what that means.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "Before I departed on a trip to Spain, I knew I had to have a good American meal before taking off and I decided to give Mooburger a shot. The decor is clean and simple with a few large communal tables and a number of smaller tables providing ample seating. I was greeted warmly by the hostess and took a seat near the window. Nothing screamed American meal more so than the Cowboy Burger which I ordered rare with a side of sweet potato fries. The burger came out in a prompt manner and the fries were piping hot. With one bite, I knew I had found a solid burger joint in my neighborhood. The burger came out juicy, rare, and very flavorful. The sweet potato fries were lightly salted and with an excellent crispy texture.\n\nUpon my return from my trip, I was starved for some red meat to compensate from the constant seafood diet I had been eating and wanted to see if lightning could strike twice. This time I ordered the Hangover, a bison burger complete with fried egg on top, with a side of coleslaw. The burger again came out promptly and cooked to perfection. The burger was well made and the egg yolk ran throughout the burger after the first bite. It was a hangover that I was glad to have (sorry...couldn't resist making that terrible comment). The coleslaw was alright but nothing too special though. \n\nThere is a nice selection of beers on tap (as well as some bottles/cans) in addition to several wines. Also, there is the option of building your own burger with various meats (chicken, bison, turkey), toppings and unique sauces to choose from. I haven't had the milkshakes but I do know they are made with Blue Marble ice cream so take that for what it's worth. \n\nOverall, Mooburger has been very good so far and I look forward to trying more of their dishes, perhaps trying their hot dogs and fried macaroni and cheese (which looked delicious being served to the table next to me). The service has been outstanding on both of my visits and, for those with a Food Network checklist, you'll be glad to know that Marc Anthony Bynum (who appeared on 'Chopped') is the brains behind the menu.", "author": "Troy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "The Court Street burger was very good and served on a brioche roll.  Nice fried pickles, cut lengthwise and the onion rings were great too.  Pretty good beer selection as well.", "author": "Jerome T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "We were strolling by Court St after watching a movie at Cobble theater. The restaurant was pretty empty on a late afternoon/ early evening. But that didn't discourage us from going in after reviewing the menu. The restaurant was incredibly spacious, with booths on one side and tables on another. It also had a warm, American rustic feel to it. \n\nI ordered the classic burger, along with sweet potato fries. The gourmet burgers were very succulent, and all the toppings synchronized well. The owner was extremely enthusiastic about the restaurant since it recently opened. Even the staff seemed pretty amped-up about the place. To top it off, there was a lot of boasting about the main chef: he's an acclaimed winner on Chopped.", "author": "Leese H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-22", "description": "Good burger. Great sweet potato fries. Waiter service and kind of pricey. Shake Shack's smokehouse burger is still king.", "author": "Danny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "While visiting friends they took me to this nice place promising a surprising burger, and boy they were right.\nJuicy organic burger, great bun, fresh fries, you can't ask for more.\n\nKeep it up.", "author": "James Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-08", "description": "Trendy moo burger where you have to be hipster in training to work here. The bison court burger was actually very good not too salty and cooked perfectly(med rare). The caramelized onions and blue cheese complimented the bison nicely.  The fries were nice and crisp. The portion size is actually perfect. After eating the burger and fries I did feel that I over ate.  They also had GUS soda which was surprisingly good. With all the good choices in the neighborhood this is still an excellent choice.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "Okay first of all...I have one friend in particular that loves to tease me how but I don't care! She says I'm the only one she knows that goes to a burger joint and orders fish. Yep, you heard it right. I am such a huge fan of their NOVIA SCOTIA BURGER that I'm habitual and order it every single time I'm there...and I've been there at least 5 times already for the year. I'm spacing myself and I've given the owner strict orders NOT to remove it from the menu EVER! LOL! And their sweet potato fries are DELISH! I've been with others who can totally gush over their burgers so there you have it...an utterly (no pun intended) complete review! Enjoy!", "author": "Debbie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "I'm not a huge burger lover, but this place has some amazing food. There's such a difference between moo burger's organic and fresh ingredients and all the other burger places I've been to. I usually stick to the classic all-American burger which is delicious (they also have gluten free buns!). Moo fries are amazing! And the shakes are also really good. They're kind of pricey for a burger place, but you get the quality you're paying for. Service is pretty good and the atmosphere is really casual. I definitely recommend it, especially if you're a burger lover.", "author": "Kristina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Great burger, Louie next door In  sams pizza said this was a good place, he wasn't kidding.... \n\nGreat fries , the special corn on the Cobb was amazing,", "author": "bill l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-14", "description": "Decent. \nNot the best... but definitely satisfied my craving.\n\nWe were seated immediately, so that was a huge plus. \nThe restaurant was a little dark for my liking, it was hard to read the menu's- the font was really small also.\n\nI had the chili dog, the flavors were there, but it was missing something. The chili was a little too dry for my taste, but again I was satisfied. \n\nMy boyfriend had the San Gennaro burger. I personally didn't love it, but he did. \nWe had milkshakes, which were great!! ( I think w. Blue Marble Ice Cream).\n\nI'm not sure how long Moo Burger has been open, but some of the minor details/comforts were overlooked. It took 3 glasses before I was given a clean glass. Not enough napkins, water not refilled. \n\nWould I go back,  but only if I had absolutely no other choice.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "AWESOME!!!!!!!!!!!\n\nTheir burgers are awesome ... especially the lamb.\n\nApps are great!!!!\n\nGreat beer list.\n\nI would sooo eat there again and again.", "author": "Jerr W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Everything is so fresh \u0026 tasty!! Staff is wonderful ... Did I mention how AMAZING it tastes? The pitcher of lemonade is enough for 3-4 ppl. The moo fries(Chili cheese fries) will make any mouth happy. Skip ordering a regular \"hamburger\" order the bison instead!!!!!  You'll never want another hamburger again", "author": "Tiffinee T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "I had the classic and it was delicious! Staff was friendly and the decor is cool.", "author": "Giselle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Phenomenal burgers and onion rings to die for! Great friendly staff as well. For a clean burger joint in Cobble Hill, this is definitely the only spot to go to.", "author": "Bethany S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-14", "description": "Little bit pricey, but worth it!\nMy favorite is Mac Ball(?) it's delicious.\nI'd love to visit here more often if my place is close to them.\nI love this place!", "author": "Jason H."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}