{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Moo burger is a pretty solid place if you're looking for a variety of bread-burger-bread places. They got all the right things down pat. The fries? Good. The burger? Good. The milkshakes? AWESOME. Feast on the peanut butter and jelly with no remorse--though opt to share with one or two people, because it is HEAVY. I had the all-American because I wasn't feeling very adventurous tonight, but I assure you all the other variations are delicious. Would I go here every night? Maybe not, but I'm sure to return again!", "author": "Josephine Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "I love this place always come in with my family and treated a very warm friendly welcome. The food is on par if not better then your favorite burger place.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-21", "description": "Went here on a Friday night with my buddies after an awesome day of biking. We wanted something heavy, fatty and juicy to fill us up so what better way to do so than with a fat burger. Loved the ambience and interior design and who I'm guessing was the manager, was ridiculously friendly. Service was pretty okay until the very end where we found our server eating instead of taking our check. That's not why this got 3 stars though. The burger was honestly mediocre at best. I loved the sauces, the fries, the drinks but the one thing that was attached to the name of the restaurant, the burger, which should've been the highlight of my meal lacked flavor, freshness and uniqueness. Instead of beautiful green leaf, we were given cheap chopped lettuce and the patty itself was NOT EVEN seasoned. I was pretty upset coming out. I expected a lot out of this place and it just didn't deliver. \n\nIf you do go, definitely get their strawberry lemonade and fries. And when you get their fries make sure you get as much of their signature sauces as you can because they don't cost extra and they taste phenomenal. Other than that, maybe a salad would be better than a burger here.", "author": "George T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "First time at moo burger and I had the Smoke House I literally took two bites and it was so amazing!!  I had to check in and share! The pulled pork is fantastic I mean the whole thing really. I added double cheese on mine. My girlfriend and I were driving around looking for a good local burger spot and we hit the motherload. DEFINITELY coming back. Great service, the owner/manager I'm not sure which is very attentive. He even came over to ask how the food was. \n\nOverall great spot 5 stars all the way!", "author": "Marley D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-28", "description": "Too be honest this experience has been, meh. We had the Court and the all-American with vege patties substitutes and a side of fries. We all love crispy fries, but these were crispy to the point of burnt. The patties had limited flavor, so literally two slices of tomatoes were enough to mask the whole all-American flavor and arugula was enough to kill the court burger. Really not my Choice for a burger joint... \n\nIm giving it 2 stars because of the place is quite nice! Quaint and charming. I just wish the vege food was more delectable.", "author": "Veggie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-24", "description": "I so wanted to give this place 4 stars,  but.......We visit this restaurant each time we stay in Brooklyn and have generally liked each meal. This time it just didn't seem up to usual standard.. plus we made mistake of ordering Moo Fries!  Who thought up this monstrosity?  Mince, beans and melted cheese on fries!  We thought we were getting ' steak fries'  which means large cut fries/ chips in Australia.\nThe burgers seemed light on salad as well.\nWill probably go again if hungry", "author": "Susi R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "deff over-hyped hence over-priced. Love sweet potato fries but this place has soggy and real salty ones. They taste more like waffles than potato - explains why they recommend having it with their maple syrup! smh. Had the Moo-less and Court street burger, both a disappointment !", "author": "Kabir A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Walked in after watching Logan movie (Great movie) amazing spot, great food. Awesome service, Manager was nice kept checking on us making sure all is good.  Definitely will be back.", "author": "Xavier P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Other than the silly name, which makes it slightly  more difficult to take it as serious as it deserves, I very much love this place.  I never meant for it to happen but the years have made me something like a cheeseburger conniseure ( go ahead n laugh. I can't spell it!)! At moo, they know how to make a burger!  No grease pouring out n making the bun all mushy, wet, and well, disgusting.  The ordinary \"classic\" is only $9, which for this neighborhood is more than fair.  Whatever you do, don't leave without dessert! There are about 9 different shakes to choose from, all made with blue marble ice cream.  Personally, I think bananas foster is best.  Oh, and the signature \"moo sauce,\" I can't speak to cuz ive not Tried it.  From the looks of it, I'd guess it's their version of the big Mac's \"special sauce .\"\n\nYay to the moo!!! I've already been 3 times and I'm Already plotting number 4'", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "I'm going to do something I usually don't do, I'm gonna get the bad out of the way first. I just wanted MOOOOOORE Burger!  The place had tons of kids! I love kids! I really do! I was just shocked at the sheer number of rugrats eating at this place, but it really didn't matter to me, they were all pretty well behaved, and hey, whats wrong with a munchkin liking a quality gourmet burg?  So back off you cruel old grouch! ok, I'm sorry, I don't even know who or why I'm yelling at you. Now let me get to why they are VERY WELL deserving of 4 of ouf 5 stars.\n\nThe Court Street burger....my oh my.  It is bison meat, carmalized onions, WILD mushrooms, and blue cheese.  I almost didn't get it bc blue cheese can be so over powering, but not this time.  It melted into the onion oh so perfectly to become a creamy melt in yo face delish dish.  At $14 a pop, without any fries or onion rings(also delicious), and the smaller size, I didn't give MOOO 5 stars.  Really the only reason I gave them a 4.  I wanted to eat another one sooo bad!\n\nService was top notch. AND I believe the owner(or most devoted manager ever) came to make sure our meal was good and made the effort to say goodbye as we left. A+!! \n\nI'll be glad to come back, but if there is ANYTHING they could change would be to throw a handful of fries on the burger platter for those prices! Then it becomes my every week go to spot.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "\"Moooo\"...Burger....such a cute name, it already snagged my attention with that alone. Once walking in, I immediately loved the decor. It screamed trendy, open, inviting, family oriented, welcome., and it totally represents Brooklyn. I only got takeout, but I know for a fact that I am coming back here and bringing my boyfriend with me. I know he would enjoy it. I went during an in between lunch and dinner time on a Sunday, so it wasn't crowded. On weekends during those meal times, it might be rowdy and crowded, not with a drunk crowd, but with kids, so beware of that. Having said that, my order came out quickly. I got two burgers, a sandwich, a chili dog, fries, onion rings, and coleslaw, and it only took between 10 minutes, maybe 15, if I somehow zoned out and the time flew by. I was surprised really and awkwardly accepted the bag the girl gave me Lol. \n\nThe staff don't wear uniforms of any sort, not even matching black tee's, so you might not know who works there and who doesn't. But the staff appears friendly enough. Maybe not all smiles and giggles, like some weird Stepford Wives like establishments in other parts of the city, but personable, and most of all, they assist you. \n\nIt's very much like a large loft like space. Kitchen in the back, but it's open and not covered or hidden, so you can see the workers moving efficiently to make your meal. Shiny and buffed wooden furniture, whether regular tables for 2 or 4 people/families to the far left or small booths in the very back. My favorite were the large wooden picnic like tables, good for communal dining or large groups. It adds to that friendly, \"let's all enjoy your food together\" vibe. On the tables are large beer glass cups, used for water. And I spied glass wine like bottles on the table, so you can always refill your own glass more or less. Much appreciated, because I always guzzle water, and this salty, greasy, hearty food, you're going to need the hydration. \n\nHere's the rundown on the food itself:\n\nSouthern fried chicken sandwich with collard greens and Creole sausage gravy- A very, VERY deep fried breaded chicken patty, and I wasn't expecting that level of fried-ness. Collard greens didn't add any extra flavor, nor did the gravy, so it felt like a fried chicken sandwich on a bun/roll. \n\nAll-American burger- The burgers aren't diner sized huge, but they're hearty as hell. My boyfriend loved it and plans to come back and try more burgers. It's a classic and simple, and tasty, perfectly good (medium rare), and I enjoyed 100%. \n\nChili Dog- for nine bucks you get two regular sized hot dogs on a potato bun, which is so much better than a regular bun. I love the presentation and the amount of chili they give you. I had a chili dog in the city, and the chili was mushy watery slop and not only that, they were stingy with the amount. And a drizzle of sour cream gives it an elegant touch. The chili is salty by nature, as is the hot dog, but I don't like chili to have any spice or heat, and I don't know, it just didn't hit the spot for me personally, even though I was super excited to try this. I might be better off making it myself at home, and that's totally cool. The burgers are the main show here. \n\nFrench fries- Thin cut, with the skin still on it. Don't always see that and some pieces were crunchy, other pieces were soft with grease. To some, that might be bad and considered mushy, but I love the soft potato-y pieces. \n\nOnion rings- Large, but they don't give you a lot, like maybe 5 pieces. And heavily battered, with an excellent crunch, but the only bad thing is that the batter has ZERO flavor. If it had some hint of...anything, garlic or herbs or even beer batter, it would add the extra oomph that it needs. \n\nEnd note: I absolutely cannot wait to come back and try the Moo burger, maybe with an egg on top as an add on. And then the fried pickles, and a milkshake. \n\nDamn, I'm drooling already. Let me get a cloth to wipe my mouth.", "author": "Tiff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "Everything you will ever want out of the burger. Except for the just having the option of regular seamen seed bun. But I always have the hangover(not like I drink at all) it is amazing every time!! It's delicious and moist and the egg is cooked just right. Don't waist your time anywhere else. This is the place!!", "author": "Sadzia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "Cute little spot with incredible burgers. This place seems to be popular with families with small children, so if you're not into being surrounded by screaming toddlers..I'd suggest ordering to go. The pulled pork burger is a winner. The salads are even good. Great lunch spot.", "author": "Sintiea S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "I've been here a bunch of times now and am always happy with the food. The burgers are really juicy and I highly recommend the fried pickles! The wait staff is great and friendly and the service is on par. Definitely an awesome burger place.  Way better than Bareburger!", "author": "Moses G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "The service was good and so was the atmosphere. But it's pricey for what you get the price of the burger should've been the whole meal. Too much bun not enough burger. Sides were adequate for price but the burger is what I came for. You are better off going to a greasy diner or your local corner spot and save your self that $25!", "author": "Derrika C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "Get here now and try the cobble hill burger. And the fried Mac and cheese. Or just one of everything on the menu. \n\nService is fast even on their busiest day, great atmosphere. But the food! Oh my goodness the food!!!", "author": "Alyssa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Love this place! Super glad they finally started delivering their wonderful Moo burgers!!!!", "author": "Jody C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Delicious burger! The onion rings were fine but kind of bland. My husband really enjoyed the pulled pork burger and his fries were yummy but a little on the soft soft/squishy. Overall great service and ambiance!", "author": "Emma S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "3.5 stars. \nTo start, the place is laid back and usually requires a very short wait to get a table (Yay for not waiting with an empty stomach).  The beer choices and appetizers are decent. We got the Mexican style corn, onion rings, and fried pickles. I'll honestly tell you now, this is as the only reason I came here were for the fried pickles. The corn is delicious,  sweet,  and packed with everything you you want on Mexican corn. The onion rings are big and crunchy. The fried pickles were also great!  Exactly hit my craving. My issue with the fried goods though... They got really soggy part way through the meal. The heat and humidity being in a cup made the fried dough parts become loose and soggy and the dressing didn't help sog it up on top. Now the star of the place... The burgers!  Ours were overcooked, broke apart easily,  and under seasoned.  Oh Wells.  I was only there for my pickle craving anyways.", "author": "Ani Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "THE BEST BURGER I HAVE EVER HAD!!!!!!!! \nIts just soooooo juicy :) its just such a perfect cut of meat!!!!", "author": "Lana G."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}