{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-09", "description": "Good food and nice portions.   There is something for everyone . We are a family of carnivores, vegetarians and a vegan and there is always plenty on the menu.  A big negative is not taking reservations for larger parties so if you're more than 4 you might have to split up.  Also try to go a little later (after 7) and you won't have to endure other people's badly behaved children running around like it was a playground.", "author": "Debbie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "This is a great neighborhood place to grab a burger. \n\nWhat I get: Their classic burger is wonderfully juicy without being too messy - a key for me. I'd be happy with just lettuce and tomato, but their sauteed wild mushrooms are delicious, so I always get them - totally worth the extra dollar. I get the side of fries, just because a burger without fries wouldn't be complete, but I'm not a huge fan of them. The texture isn't great, and sometimes the fries are oversalted. I've also tried the sweet potato fries and zucchini fries and weren't crazy about either.\n\nPros: Clean feeling and a cozy atmosphere, friendly staff (in the first few months, always got a check in from the owner asking how things were), busy but usually no wait, and reasonably priced.\n\nCons: Their menu doesn't have a ton of diversity. There are different types of burgers (chicken, salmon, bison, etc.), a few salads and fries choices, but that's it. The only desserts on the menu are milk shakes. It's great if you're craving what they have, but maybe not for a big crowd with different tastes.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "Burgers are really good and the peanut butter and jelly milkshake is awesome!", "author": "M. G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-04", "description": "Place has really exceeded expectations.  When I first went, it was a disappointment.  It's absolutely great now - very high quality burgers and a great atmosphere.  I love the management and wait staff.  Very friendly and fun.  Moo Burger is a great addition to the burgeoning cullinary culture of Cobble Hill and Carroll Gardens.", "author": "Macy W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-25", "description": "Ok moo burger i know your catering to the kiddies and fams... Its not ok to serve Mac \u0026 Cheese balls from freezer section Trader Joe's down the st.! Everyone in this hood shops those isles! We were seriously grossed out by the baby pickles fried hardly edible. Flashing lights that your cutting corners. Keep the gluten free bread but i sug. the rolls only need to be half the thickness. Staff seamed overwhelmed. *Overall weird experience*", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "love this place! the burgers are perfect, sides are excellent (fried pickles - YUM!), they use organic ingredients, and the price to quality ratio seems about right to me.. what more could you want!?", "author": "Lu L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-28", "description": "I want to like this restaurant more than I do after eating here twice.  The food is good but overpriced.  The service is slow almost as if they are trying to be 'cool and relaxed' for effect.  And some of the menu items are just gross.\n\nThe baked beans are inedible.  The kiddie grilled cheese is too thick for little mouths.  And the service was just too slow!  \n\nMoo Burger has great potential, but I've now left here disappointed twice.  I hope they improve.", "author": "M F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-12", "description": "Moo Burger is wonderful.  They make great burgers and have a nice selection of reasonably priced beers and wines.  I eat about 2 burgers per year with my friend, and this place does not disappoint.  The staff is friendly and attentive as well.", "author": "Mary T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "Why isn't this place in every town in America. It is the BEST burger ever. They don't give you free peanuts or special sauce, but they do give you a great burger.  5 Guys couldn't make it on court street but Moo Burger will be here forever.  Worth the few extra cents.", "author": "August Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "2 words: TODDLER FRIENDLY!!!  Went with my friend and our 2 toddlers.  The staff never gave us the stink eye and gave us excellent service throughout our time there.  the hostess checked our strollers and immediately cleared the silverware and glasses from in front of the tots.  The waiter brought plastic cups with lids and was very knowledgeable about potential allergens in the food - plus was pleasant and attentive.   the simple kids menu was actually good quality food.  the food for adults was excellent as well.", "author": "Christine C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-04", "description": "I've been here three times and my burgers were undercooked every single time. This was really annoying, but it was on my third visit that I decided these people are total hacks. I was seated in the back, next to the open kitchen, where I saw one of the cooks making a \"Blue Marble\" milkshake with BREYERS ice cream. Watched the whole process from the Breyers ice cream box, to the blender, to the cup, to the table. So wrong.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "Been searching for a good, juicy burger joint with excellent fries. Found it! Found this place last week and been here twice already.", "author": "Tabatha T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "Burgers are amazing!! Staff is very attentive but not in an annoying way! The hangover burger is ridiculous!!! chili dogs were awesome. Decor is nice- great spot to go for lunch or a laid back dinner. Can't wait to go back!", "author": "Megan A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-14", "description": "Very disappointed with Moo Burger.  As other reviewers state burgers are over priced when you consider everything is ala carte  we chose moo burger over Five  Guys as it is more of a restaurant.   Very disappointed in menu selection.  They only have beer \u0026 wine some soft drinks but no sodas. Service was very slow; burger was over cooked. Bill without any drinks was $ 100 for five adults and one child.  Five guys would have been $50 tops.  Went early 6:00 which is I guess family time. Place full of kids. Very high noise level.   Won't be back.", "author": "Maureen O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-06", "description": "This may be the most profoundly annoying restaurant experience I've ever had. Screaming infants everywhere. I can handle babies. Heck, I even like some of them. I live in Boerum Hill. But there were as many of them at \"Mooburger\" (worst name ever obv) as there were adults. A toy loudly hit the Purgo floors every five to ten seconds.\n\nAnd the STAFF. They dropped as much shit as the babies. Knives. iPhones. A pile of menu clipboards. Speaking of the menu, it claims they use organic meat \"when available.\" Uh, this is New York. It's always available. That's retarded. Also, come on. Organic is so 2002. We're on grass fed now. Keep up. The guy next to me (who insisted on whistling along to Gnarls Barkley's \"Crazy\" and choose your own radio-friendly MGMT song) tried to order a burger with mushrooms, onions, and American cheese. The simpleton taking his order kept interrupting him: \"Which burger?\" \"I just want a burger with mushrooms, Amer ...\" \"Yes, but which burger?\" \"A ... a ... a ... HAMburger with mushrooms ....\" Apparently he couldn't handle it unless the guy chose one of the stupidly named burger combos listed on the menu, and elaborately subbing in and out toppings and what not. That whistle-happy moron just wanted his burger how he wanted it. Why the hassle?\n\nIf you really want a good burger in this neighborhood, roll over to Two 8 Two on Atlantic near Smith. Seriously. Or, if you want to try out the restaurant Mooburger (good lord what an abominable name) is badly attempting to rip off, venture over to Bareburger (a much better name, if a bit dirty sounding). They have a lot of strollers there at any one time, but the food is actually well made and delivered in a fairly efficient, professional manner.\n\nIf you have at least one baby in your stroller, sure, come to Mooburger (MOO BURGER wtf). They overcook your burger terribly, so you and your family probably won't get  a parasite. But if you don't have a fully loaded stroller, STAY AWAY.\n\nThe six onion rings I got were pretty good.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-24", "description": "this place is awesome,not only for there food but also their waitstaff. we had a wonderful waitress named Victoria who took care of our order.she was very helpful.   . i have a walker and an oxygen tank and i was made to feel very comfortable. i had the  hangover burger,which is to die for. we also had the mac and cheese balls,yummm. also the frys .just so crispy and not oily at all. the zucchini frys were good,but still a veg.i can not wait to go back as it was a fun experience. my daughter and i will be back .ps..the shakes are off the chart great.", "author": "pat g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "Smallish portions but sooo tasty. I'll be back.", "author": "S D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "This is our go-to for burgers in the neighborhood! I have never had a bad meal at Moo Burger. The zucchini sticks are awesome. The burgers are always perfectly cooked, the toppings delish and the brioche roll is the the best.", "author": "Cynthia H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-08", "description": "Oops -- just went back last week and things have changed. No longer organic, now it's \"organic or natural,\" and we all know what natural means: it came from an animal. Also the menu looked different and the waitress confirmed it -- different menu. Not sure whether ownership has changed or if they changed their standards because they weren't making ends meet. Anyway, the bison burger I had was still good, but because the place is no longer officially organic I no longer have a particular reason to go there. Oh well.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-23", "description": "I trotted in to the Moo Burger just a couple weeks after opening- to give them time to figure stuff out.  I did lunch there with my assistant and it was fine- but is \"just fine\" good enough when you are charging premium prices?  The burgers were certainly good- juicy and decently flavorful, but not any more special or amazing than many other burgers I have had around town.  The burgers are wee little guys on brioche buns that don't quite hold up to the burger. Same on the fries- absolutely fine, but really small portions for the amount of money they are charging.  I had good food- but it is awfully hard to go back when a person can get just as good of a product at several other locations nearby and for less cash...times are hard!", "author": "David B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}