{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Great service great food \nBurgers are delicious .  \nGreat cozy spot to have some lunch or dinner if you're craving burgers at night ! \nSome sweet fried pickles as a side would be better lol", "author": "Angelo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "There are so many burger options on or around Court street that it's ridiculous. I can say with some certainty that of them all, Moo Burger is... one of them.\n\nI had the Hangover burger - bison patty with bacon, cheddar and a fried egg. If there's one thing to know about me, it's that I can never resist egg on a burger.\n\nIt was a very solid burger, though not literally. Between the egg and the tomatoes, it barely held together. But no matter, burgers are meant to be eaten with the hands!\n\nFor sides, we went with fried mac and cheese balls, fried pickles, and zucchini fries. The fried pickles were actually spears instead of chips, which was an interesting change. I'm typically not a fan of frickles though. The mac and cheese balls were standard stuff. The zucchini fries were probably the best side. Everything came with different dipping sauces that I can't recall right now, but we also mixed and matched so I'm not sure what came with what.\n\nThey also have a good beer selection, which is always a plus.\n\nI had a good time.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "Moo Burger\nNY Brooklyn Cobble Hill\n1pm Thursday 15th January 2015\nFour Stars\n\nWooden floors and walls with industrial steel celing and lighting. There's an open kitchen. They serve beer and wine. They serve water in a wine bottle. I had The Hangover Burger. It was well composed. The burger and all of the toppings fit exactly on the circumstance of the bun. The Bison was cooked medium which was close to the requested medium rare. The patty could have used a bit more salt. The Bacon was salty, crispy, and broken up to fit into the melty Swiss cheese. Shredded lettuce and thinly sliced tomato are signs of gourmet burger. The lettuce was a bit tired and the tomato was a bit mealy. The fried egg was nice and runny. \n\nThe zucchini fries were thickly battered, well seasoned, and fairly good. \n\nThe service was spot on. The price was reasonable. I was in and out for lunch in 35 minutes.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "Solid organic burger in Brooklyn Heights area. Trendy interior. More high end then Shack Shake and not \"fast food\" (this is a sit down, expect to spend at least an hour). \nWe randomly stopped by when in the Heights a few months ago and the place was packed (granted it was the weekend). \nReally friendly service and family atmosphere. \n\nOverall great experience.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Tacos were delish. I'll def be back for a burger. Super friendly and clean establishment.", "author": "Marie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "What an incredible burger!! One of the best I had in a long time. Great experience for lunch with Wonderful friendly service. For a place that has been here for 5 years it's nice to see the personal touch they still have! \n\nCan't wait to come back for dinner and try another one of these awesome burgers!", "author": "Brian F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Incredible burgers!! If you are looking for a juicy, perfectly cooked burger, and you're in Brooklyn, this is the place to go. The 6 oz patties are all-natural, organic, and delicious. I had the All-American burger, which is the most \"basic\" choice, but is not basic at all! Piled high with the works (LTO) and served on a buttery, toasted bun, there is no way to go wrong with this choice. Add cheese to top it off the right way!\n\nThe onion rings are lightly breaded, making them crispier than your average o-ring! They are served with a southwestern spicy aioli and adds the perfect spice to it! The zucchini fries are also great, just a little salty. They are served with a yogurt sauce that helps tone down the saltiness l - a great pairing!\n\nI went with my father for lunch, and the place was packed with families and kids. Great spot to take the whole family for a causal bite. They also offer a kids menu. \n\nSo glad we tried this and hoping I make it back to BK to go again!", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "This place is great! The service was fast and the burgers were juicy and delicious! My boyfriend and I have found our new go to burger spot!", "author": "Vanessa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "I can't wait to go back. I went to Mooburger awhile ago and already am planning my next visit there. I went on a weeknight for dinner and the place was filled with people (that's a good sign). Even with the abundance of people, we were seated very quickly. I chose to have the greek burger with a side of zucchini fries while my friends all chose their own burger with a side of moo fries and fried mac and cheese.\n\nThe burgers were so good! It was cooked to perfection. The zucchini fries were also really good (kind of tasted like a fried pickle which I love!). The moo fries are regular french fries doused in meat, chili, and cheese which was very good as well. The fried mac and cheese was good but not great (I probably won't order it again).\n\nWould I come here again? Definitely. The service was attentive, the burgers came swiftly and was so delicious. I can't wait to come back.", "author": "Vivian Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Delicious!!!! Great dinner with a great friend. Heard great things about moo burger. I took the opportunity to check out the place and was not disappointed, not only was my burger cook to perfection but the zucchini fries were a pleasant surprise. Can't wait for my next burger or salad with a burger as my friend had. So good!", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-01", "description": "Food was cold, bun extremely stale, burger undercooked. Not even close to being worth the price", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "We had planned a completely different afternoon with the grandkids but forgot how frustrating downtown brooklyn can be. \nFinally found a parking spot in cobble hill and decided to have lunch at Moo buger, \nAnd it saved our day. Staff was friendly,  the food was good and served promptly.  Kids were happy. \nWill definitely come back when in the area.", "author": "CK- W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Hangover burger will  hit the spot. Add a side of some sweet potato fries with maple syzurp and you're in business. There are plenty of pretty good burger joints in Brooklyn and this is one of them. Great cobble Hill/Court Street option. I like the picnic table setup as well.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Onion rings are crisp with a touch salt. \nZucchini fries also crispy served with tzaziki sauce. \nFrench fries come out crisp and hot. \nPickle fries have just the right amount of sour and crisp!\n\nCourt street burger is bison patty with arugula mushrooms carmelized onions and blue cheese. \n\n2 hot dogs in an order and u mix and match. Devil dog is spicy with jalepeno onions egg and spicy aioli.", "author": "Thy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Court Street Burger was pretty good. Had a side of fries which wasn't bad either. \n\nHowever, my friend and I walked out still feeling hungry :(", "author": "Annette L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "HIDDEN GEM - BEST BURGER IN BK\nMy husband and I love this spot. You never have to wait for a table, service is excellent and the burgers/hot dogs/milk shakes are delicious. It's a very affordable spot by NYC standards. I can't say enough about this place. And, it's very family friendly. It's off the beaten path and just down the street from a burger chain, but worth the extra few blocks.", "author": "Kellie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-05", "description": "I'm not sure why people are so enamored with this restaurant. I decided to try this on a whim with a friend. She had the chicken sandwich while I decided to go straight for the burger. After a long wait to even place the order , we had an even longer wait for the service. I'll admit the restaurant was somewhat busy but it wasn't packed or unmanageable. When the food came it was just ok. The moo fries came with chili . That was pretty tasty . Another long wait to get the bill and we were out. There's a problem when the beer is the best part of the burger joint. Needless to say with so many options in New York City I will not be back.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Kinda solely reviewing the fried pickles but overall a great experience ...\n\nYou know how fried pickles are awesome?  Like there are no bad fried pickles.\n\nBut they're one of those things that are so awesome that it is hard to imagine fried pickles that are wayyyyyy better than any other fried pickles you've had right.\n\nThese fried pickles were wayyyyyy more awesome than any I've ever had before.", "author": "Rob Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "I love this spot \u0026 so does my boys. They're very clean \u0026 friendly. Nice quiet place for the family \u0026 nice music selection too. I've enjoyed a burger \u0026 I've enjoyed a salad. They have a pumpkin shake out right now, Ooowweeee it's amazing. Portion size is good too not too much \u0026 not too little. Must try if you're in the area.", "author": "Sylenya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "I ended up here thanks to the \"Mexican style corn\" sign on the sidewalk. Burgers \u0026 eloté!!! how could I pass that up...\nOrdered - corn \u0026 the Greek lamb burger. \nFood and service were just great !!!", "author": "Dina K."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}