{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "The burgers are some of THE BEST I ever had. Hot dogs where pretty good although I've had better. Onion rings and fried where both good as well as as milkshake were great. Fried pickles weren't so great however. Love the setup inside, think it's great.", "author": "Tony G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "This review is not just of the food, but the entire restaurant experience.\n\nMoo Burger is absolutely one of the BEST burger restaurants/joints I've ever been to period! The overall experience of the restaurant and food was excellent! First and foremost, the food. I ordered the Brooklyn Chili burger and it was absolutely on the spot. The chili in the burger was some of the best chili I've had in my life as it had the perfect amount of spice, beans and meat in it. It wasn't too overwhelming, but very satisfying. The beef patty was big, very juicy and it was cooked absolutely the way I wanted it, medium rare. \n\nI also added a fried egg in my burger order and it complimented the beef patty very well. Honestly, there were so many burgers I wanted to choose from as there is an AWESOME and diverse selection on the menu. In addition to the burger, I also ordered the Moo Fries (Chili Cheese Fries) and WOW the chili cheese was the best I've ever had. I've had some great chili cheese fries in the past, including Ben's Chili Bowl in D.C., so this is saying alot! They are very generous with the amount of fries in the bowl and also the amount of chili cheese plopped right on top of the fries.\n\nThe restaurant is also very nice, casual, clean and I love that they have benches in the middle of the restaurant for larger parties and 2 person booths (on the side) for the couples. The kitchen is right next to the booths so the booths were definitely my preferred seats of choice as I love watching the cooks prepare the food. The bathroom towards the back is unique too with the sliding door, which I found pretty cool. The bathroom is also very clean. The waiter we had was very attentive and I loved the plaid shirts worn by all of the staff. Overall, it was an AWESOME AWESOME burger joint that I will definitely come back!", "author": "Chris E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Ive been a customer since the first day they opened. I love all there food and there burgers are so juicy and yummy. The employees are so friendly and they have the best pb and j milk shake. I wont eat at any other burger place other then moo burger. The quality and ingredients are so fresh and amazing.. 5 stars all the way.", "author": "Valerie Marie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Shared the Moo Hot dogs and sweet potato fries. The hot dog was great! One is very filling for a lunch meal, especially when paired with a side! The fries were okay.\n\nThe restaurant decor was modern and had a nice aesthetic. Workers and managers(owner?) were all very friendly and attentive.", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "Made a reservation for 10 two weeks out for a child's birthday and called multiple times to confirm it. It wasn't kept and the manager was rude to boot - he never apologized and insisted on arguing. Deeply unpleasant experience. Stay away.", "author": "Jen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Warning: ALL other burger joints better moo-ve over! Moo Burger is THE joint to beat!\n\nThe only time I wish I was hungover 24/7 is when I'm at Moo Burger. The hangover burger? Hell yes. Bacon AND a fried egg?! It's melt-in-my-mouth deliciousness. Oh my! And however they make their burger meat, props to the chefs behind the scenes because they are so juicy \u0026 cooked perfectly to how they should be!\n\nThe burgers \u0026 shakes in this place are unbelievably fresh. The pumpkin pie shake I got around Thanksgiving time was unforgettable - it was so good \u0026 tasted like a true mimic of pumpkin pie.\n\nI also have to give the owner a lot of props. He hangs out at the restaurant and personally goes up to each table to make sure that every customer is enjoying his or her food. That ALONE deserves two extra stars - how many restaurant owners actually come up to you to see how you're enjoying your food?\n\nThe atmosphere at Moo Burger is always welcoming. Staff is extremely friendly and this is definitely a place you can bring kids or groups to come join you for a bite. Being at Moo Burger reminds me of going on a weekend trip with friends or family to a cabin to enjoy a warm meal. Delish!", "author": "Olivia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Awesome!!! Love this place! My brother just Randomly picked us a new burger joint last year and we've been here once a month since. The sides are delicious!!! Burger and Dogs are slammin! They really cook up a good burger and I'm not just saying that. You can tell it's a family owned restaurant made for families, super cool environment, definitely recommended checking it out if you haven't. Owner did a great job over all.", "author": "Martin P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "We've been customers for awhile. Sometimes the burgers are ok, other times so disappointing. The first burger I had there a few years ago was great but nothing has ever been as good on our repeat visits. Where is the love Moo Burger?? Unfortunately there is very little consistency in quality here. Wouldn't recommend for takeout. Burgers arrive a cold soggy wet mess. Sometimes appalling undercooked. Fries are consistently cold. With their prices as high as they are, we are sadly moving on.", "author": "S F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "One of my favorite places in Brooklyn. The staff is top\nNotch.. Attentive , friendly, etc. Amazing  burgers .. Cooked to perfection . The fried pickles are the best. Great turkey burgers, salmon patties, whatever is your pleasure.", "author": "Barbra B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-20", "description": "I can't say I love this place.  This place is okay.  I'll go ahead and list them out to make things easier:\n\nBurgers - burgers are decent.  Is it the best burger I've ever had?  Nope. There are some hit and misses though.  I've been here a few times and tried a few different ones - smokehouse, hangover, greek and court street.  The greek and court street were pretty good, but the patties here are small.  You won't get full off of a burger so I recommend ordering a side.  I don't mind paying for an expensive burger if I get my money's worth.  I don't feel this place is in that club.\n\nSides - I hate it when burger places charge an arm and leg for a burger and don't give sides.  This is a perfect example of a place that does that.  The burgers here are expensive for their size and it doesn't come with sides.  I don't think it costs too much to give a few fries or a few onion rings.  The sides here are pretty pricey and they are also hit and misses.  Zucchini fries - nothing special and you don't get a lot.  Mac n cheese balls - pretty good.  Fries pickles - these are good, but it's expensive for a few slices of fried pickles.  They also get super soggy so make sure you eat them first.  Onion rings - just okay.\n\nThe owner is here often and I think he's friendly.  He does a great job checking on the customers which is great customer service.  I hope he takes this review as constructive criticism and I think this place can do well.  It looks like it does well already albeit most of the customers that I've seen look like families that live in the neighborhood.  The rest of the servers here are just okay.  They take your order and that's about it.  Not too friendly, a little passive.\n\nSomething I have to mention.  If you use a gift certificate here, you won't be allowed to use it to cover the tip portion of your check.  That's the stupidest thing ever.  I don't know what type of policy that is, but that is what turned me off about this place.  The gift certificate should be treated as real money and should be allowed to be used as we want.  We shouldn't have to be forced to spend more money because we can't use the gift certificate to cover our entire bill.  The whole point of receiving or giving a gift certificate is to not have to pay anything out of pocket because it's a gift!  It's obviously a management/owner issue and something involved with their internal accounting if gift certificates can't be used to cover tips.  That's not the customers fault.  It's the owner's responsibility to figure out how their servers get their tips.  Don't force it on the customer to figure out how to tip the servers if we have a gift certificate that more than covers the meal + tip + tax.  You already have our money from whoever purchased the gift certificate so it's not like we are cheating you out of anything by using the gift certificate to cover the tip portion of our meal.  Plus tips are optional and not mandatory.", "author": "Angeline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "I ordered from the kids menu because I didn't want to be stuck with an oversized burger. It was OK. Not the best but still tender and fresh. I enjoyed it enough to give 3 stars but their service was really nice so I had to add another. Typical burger joint but I'd go somewhere else if I'm looking for a really gooood burger. \n\n\nThis is my update. I tried the salmon burger and gotta say it was good. My husband went crazy for it but I wasn't so impressed. It was...good. Maybe I'm just a tough cookie but I'll try the bison burger to see if I'm impressed.", "author": "Nathline C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "As I stated in other posts, I'm a burger lover and love trying new burger places. Moo burger certainly did not disappoint. I came here on a weekday in the afternoon with a friend. We were greeted right away and allowed to choose were we wanted to sit. \n\nThe menu was simple yet a lot to choose from. I ordered the bacon classic burger and my friend ordered the all American burger which were both phenomenal and cooked to our liking.  I ordered a side of the moo fries (chili and cheese along with bacon) and boooooy was the order BIG (the server did advise that it was huge). I wasn't able to finish it all but I loved every single bite. My friend ordered the zucchini fries and they were absolutely delicious! \n\nI also recommend trying their natural sodas and the \"moo mystery\". \n\nI can't wait to come back here and try their other burgers. Their pulled pork sandwich sounds like a great time ;-)", "author": "Monica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "Loved the Mexican styled corn. Mac and cheese balls. The burger was good, but great. Asked for medium rare and it was more of a medium. I think this spot is great for its sauces! They have quite a variety yet it's not on the menu.\n\nOverall i would say I'm pleased.", "author": "Mike F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Really good burgers and dogs; hearty portions without being too big.  This place even has a solid soft drink selection...well played.\n\nHonestly my only complaint about this place is the clientele.  Well, one specific kind of clientele, and to be honest, the staff does the best they can with this particular menace.  I am, of course, talking about unsupervised yuppie children.  Look, I get that being a parent is hard and is exhausting.  But, if you can't keep little Addison, Aiden, Brailynn, Caleb, or Sawyer from running up and down the aisles then perhaps your little bundles of trust fund joy aren't ready to mingle with the plebs just yet.   \n\nAgain, I can't blame the staff for this problem.  I have seen them handle this as tactfully as they can.  But just know that when you come here you will likely engage in a decent game of \"Dodge the Little One.\"", "author": "B W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-14", "description": "I've been here often with my family and it has been fine.  Tonight I had a bad experience.  I ordered online and went to pick up my order.  I got there about 15 minutes after my order was scheduled to be ready.  My order was ready but I was behind a customer who was ordering at the counter and this person was taking a long time to place an order.  I asked the server behind the counter if I could just pick up my online order which was sitting on the counter and he said \"wait\".  It would have taken all of 30 seconds for him to place my order in a bag and give it to me and it would not have affected the person ordering ahead of me as that customer did not seem to be in a hurry.  This is not a big issue but it would have made the experience better had I just been able to pick up my order and go.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-02", "description": "Horrible service....don't bother. Couldn't  even get someone to wait on us even after asking. Will never go back.", "author": "Caryl H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "Great place for a wide range of burgers. Everything is customizable, you choose the burger and then the type of meat/protein, cheese, bun etc. The only reason I took a star off is because the portion sizes of the fries and zucchini fries is smaller than expected for the price. But we love the food and the atmosphere.", "author": "S G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "This place is great!  Stumbled into this place with a friend after walking along Court St. for almost a half hour trying to find a good American (cuisine, not the people) place.\n\nI don't know why, but I some reservations about going in. I thought it was some reverse psychology hipster trick to lure me into a vegetarian burger joint (these are the kind of times we're living in people!).  That aside, the owner re-assured me that they were about that beef!  Except for some a few veggie options to pacify the I-wear-the-same-size-pants-as-my-lady dudes in the area.  Anywho... I had the hot dogs and the fried mac and cheese balls.  Thought the hot dogs wouldn't be that filling, but since I'm an old man now, I was struggling after the second one.\n\nOverall the food was good.  I'll definitely be swinging by to try the burger, which my friend had---she said was \"amazing!\"\n\nService was solid.  Fills up quickly--at least it did the night we were there, so go early.", "author": "Pablo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "We were on the hunt for a fine burger spot in Brooklyn that was not 5guys or Shake Shack. Definitely fresh, tasty, w/ a cool-hip ambience. Came here for dinner before our weekly grocery trip to TJ's. Everything is fresh, h\n\nAll burgers looked so appetizing on the menu, it took me so long to decide. I went w/ the Hangover which had a bison patty. Mind you I've never had bison before, and the waiter described that it tasted like beef but much leaner, he was right. If I didn't know it was bison, I wouldn't have known the difference. Anyway it was good burger all together w/ the fried egg, BLT, and man...I really liked the chipotle ketchup! (I love sauce!) Sweet potato fries seemed like it was freshly cut it prior to making it, it had a perfectly light crisp,  served w/ maple syrup! I cant believe I finished it all, I was hoping to take home leftover, but that was not the case here. \n\nMy love (also a 1st time bison eater) had the Court street which he devoured. Grilled mushrooms/onions w/ arugula. Very flavorful and juicy, just how a burger should be. Fried pickles were good, but I'd have the fries over that any day.", "author": "Janine D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "First of all, folks who work here are wonderful.  Very welcoming and friendly.  The setting is very causal, and  it's great for kids (meaning it could get loud and messy) and large group of people.  The food was average though.  I had a quick lunch there, and was quite disappointed.  Simple small plate of green salad with a veggie patty cost $14 plus tax.  Salad green was lumpy and not crisp, with too much dressing and somehow the whole thing was warm...  Veggie patty had nice mushroom flavor, but the texture was way too mushy.  It could have been great with some crunch, perhaps more vegetables.  Maybe the mixture was chopped/processed too fine.  I had been there a few times before, the meat burgers were always a bit dry, but the fries were good.  I would like to go back more often since the staff were nice and to support local business, but more often I end up going somewhere else thinking I prefer to spend the money where I know the food is always good.", "author": "Nyc F."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}