{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Burgers, burgers and more burgers!!! \nI had one of the most amazing veggie burgers I've had in my life.! Perfect substance and very well balanced flavor! \nCan't wait to try their Salmon Burger!!", "author": "Peer T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Had a Greek Salad and an American Burger and a pint: just perfect, tasty and nice attentive service. Will need to try the other Burgers on the menu!", "author": "Wassilios L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "Had a burger.  It was so awesome.  Place is great and cheap.  Love it.  I went with the hot dogs round one, because I can really be a sumbitch sometimes, and  from here on out I would do burgers if you're going to a place called Moo Burger.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "After years of walking by Moo Burger (and having received recommendations from friends to dine there!), I finally stopped in for a meal and was very satisfied with my meal.  I ordered their lamb burger with goat cheese, cooked medium rare, and it was delicious.  My fiancé ordered a burger with bacon and mentioned it was one of the best burgers he's had in a while.  I found their fries to be OK - maybe next time I'll ask them to make them extra crispy.  And the service was spot on - we were checked on by several people throughout our meal, which was a nice touch.  Next time I'm in the mood for a burger, we'll definitely be heading back to Moo Burger.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "I rate them five stars because I am not a burger fan at all. I eat them like once or twice a year and that's it but this burger was amazing! My friend got the one with a fried egg on top and I got a bison cheeseburger with bacon and sriracha sauce and we shared a order of fries. The burger was so tender and juicy. I would deff amity come back here again!", "author": "Susan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "I stopped by Moo Burger last weekend while in town for Governor's Ball. My boyfriend and I were staying with friends in Brooklyn and my bf did a quick Yelp search for a good burger spot close by. He led me to this cute burger place that had wooden benches and wooden walls. The place seemed very cozy. \n\nThe waitress sat us and handed us our menus. She wasn't mean but she wasn't the friendliest server either. She was just okay, did her job but gave no extra enthusiasm or energy. \n\nI ordered the Brooklyn Chili Burger with a side of fried mac and cheese. My bf ordered The Hangover burger with baked beans as his side. Both burgers were very tasty and cooked really well. We asked for medium and they were both spot on. The fried mac and cheese is yummy and it comes with a spicy sauce on the plate, but in all fairness the waitress did ask me if I wanted that sauce on the side. No surprises there. \n\nWe also tried their natural sodas from GUS. We tried the orange and the cola flavors. It's a nice way to satisfy that carbonated drink craving without having to actually drink a Coke and 30lbs of sugar along with it.\n\nI would recommend this place if you're in the mood for an interesting and delicious burger. They had several options with al different kinds of toppings and combinations. \n\nMy boyfriend said \"man, if I lived around here I'd come here all the time\".", "author": "Sandra N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "Good lamb burger. Good service. Most beer selection. Chili is ok. Sweet potato fries are great.", "author": "Andre F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "The service was good. We were seated within minutes. Received water as we were seated. \n\nWe ordered the all American, Greek, hangover burgers. On the side we ordered the fried pickles, sweet potato fries, fried mac and cheese and moo fries. We had also ordered a hot dog kids meal.\n\n\nAll the burgers were all exceptionally well. The fried pickles and sweet potato fries were crispy and great. The fried mac and cheese were bland and had no taste. All you can taste was the breading of the fried mac and cheese. The moo fries were basic. The beans tasted as if they came from the can, nothing special about it.\n\nThe hot dog kids meal was great, my daughter finished her whole hot dog and it was well worth the price. It came with fries and apple juice. \n\n\nDo not waste your money on the moo mystery. We ordered a pitcher and it was not worth $5. The moo mystery had tasted watered down. You are better off getting the strawberry lemonade at Wendy's.", "author": "Amelia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-04", "description": "I really like the atmosphere and decor. The service is friendly. The food is good. I always leave happy, well, except for the bill (at times).\n\nAnd to my only criticisms:\n\n-Menu needs some rotation\n-Burgers really need to come with a side for the price, considering how small the sides actually are", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Really great burger, great fries\u0026onions, great coke (they don't serve coca cola) and great service there is a man i guess he is the owner, he is fussy about every detail", "author": "Gul K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Went there for a late lunch early dinner with my best friend and what a delight! Service was amazing and super friendly! They were cool with us taking our time (we were the only patrons at the time) and were super efficient! \nAs for the food! The fried pickles are what seem to be the rave of this place and for sh*t sure they are!!!!! Delicious isn't even a good description! They were magnificent! What an awesome indulgence for me on my cheat day! I had the turkey club burger which I felt was a little dry but still a well thought out burger idea and my friend had the hangover which I tasted and was amazing!!! All in all it was a nice meal and a quiet space (families with youngings started to trickle in towards the end) but it was especially nice and cool on a hot summer day!!!! Worth checking out!", "author": "Tricia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-20", "description": "After all the great reviews, I was excited to try Moo Burger. Came on a weekend evening when it was fairly empty. We only ordered 2 burgers that took over 30 minutes to arrive after ordering...way too long. The service was mediocre, our waitress had a friend visiting and kept talking to her more than half the time we were there. I had to ask for the check twice because she forgot the first time. The burgers and fries were okay, nothing spectacular or memorable. \n\nThe space is lovely and very family friendly. Saw many families with children come in after us. For the price and service we received, I unfortunately wouldn't recommend this place or come back. Disappointed.", "author": "Ashley L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-24", "description": "So as a precaution, I ate here after a 7 mile run and eating Paleo for 6 days in a row. \n\nWith that being said, I got the Hangover burger or whatever it's called (the one with the bison) and I was disappointed. I mean it was a dry ass burger that lacked juice and appeal. I got it with the deep fried pickles that semi-saved the meal.\n\nI still find that two8two down the street satisfies my burger craving better than this place could.\n\nI will say this place is kid friendly if you've got kids, but mehh, it was just \"OK\".", "author": "Jeanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "I like this place. I ordered the Court Street burger because I've never tried bison before. It was good, but the taste of the bison was overpowered by the blue cheese. I had a side of sweet potato fries and the presentation was one of the best. It was served in a tiny deep fryer basket. Their unsweetened iced tea was perfect! The portions were perfect. I think the burgers are 6 ounces and I left feeling full, but not like having a brick in my stomach. My partner ordered the All-American and the Fried Pickles - also something I've never tried before. They were fantastic. I will have to come back to try other items on the menu - like their moo fries.", "author": "Vivian T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "I can't count how many times I have frequented Moo Burger and how many friends and family I have introduced to this wonderful place. No complaints so far.\n\nYou can't really go wrong with their burgers so I'm going to give tips on the sides. Get the freaking sweet potato fries, you won't regret it, I promise. Get it with spicy aioli sauce as it will add a tangy, creamy and sweet taste to your fries. As for drinks, the moo mystery is a strawberry sweet drink that will not disappoint. \n\nWe have successfully replicated their spicy aioli sauce at home but man, their burgers are one of the best in the area. Staff are friendly and service is efficient. Try to avoid rush hours such as weekend brunch 11-2pm. If you are brave enough to face the crowd, keep your eyes peeled for some cute and messy toddlers who can't seem to get the hang of ketchup.", "author": "Minh P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "Great service! Everyone here was beyond welcoming and nice. Had the pulled pork burger, excellent. Wife had the bacon cheese burger which she enjoyed. I have to take away a star because of the mac \u0026 cheese ball app. They serve you 3 very small balls in a huge bowl with an absurd amount of aioli. So much that one cannot taste the mac \u0026 cheese balls. The fried pickles were also drenched in aioli making them soggy. A better option may be putting it on the side. Overall, great food and excellent staff!", "author": "Nino B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Amazing food amazing staff. I try something new every time I stop by and I'm never disappointed. The ambiance Is calm and they can accommodate any size party. One of my favorite places on court street.", "author": "Cecelia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-21", "description": "When my boyfriend suggested we go to Moo Burger, I thought \"meh\" because it seemed a lot like Bare Burger, which I've never been a really big fan of.\n\nI wasn't looking to have a heavy meal so the 'nova scotia' burger was just right for me. I was expecting salmon bits reformed into a patty but it was an actual piece of salmon! The salmon burger was topped off with some smoked salmon (not enough...), arugula and a schmere of mustard creme fraische (didn't really taste the mustardy kick) - an innovative and delicious burger. The zucchini fries with tzatziki sauce were sooo addicting! I've never seen them on a menu elsewhere so you must get them.\n\nThe restaurant was half empty when we dined here so our food came out pretty quickly. And we were very hungry so we ate very quickly. So we were in and out in about 45 minutes. So I thought it was kind of expensive for a quick meal.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "Love this place. Great burgers, great fries (I like the sweet potato fries), excellent service. The owner usual check in on each table personally. Usually busy but rarely have to wait much. Great place to bring kids. Chocolate milkshake was mind blowing. This is definitely one of my neighborhood favorites, you can't wrong with anything on the menu.", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Is Carroll Hill/Cobble Gardens experiencing a burger renaissance?\nNice space and friendly staff and fine wine list and good burger (and hot dogs!) selection. Does anyone think that their buns could be fresher tasting?\n\nWhere do they fall into my burger go-to list?\nNot as good as the burger at Prime Meats nor as good as the Paisanos-sourced meat at 282 Burger on Atlantic - but for the location and decor and general vibe, it's pretty tasty.", "author": "Rich B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}