{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "I've been taking my family to Moo very regularly for 2 years and we absolutely love this burger place. It's extremely well run, the owner/manager is around most evenings checking on every patrons. The burgers are all absolutely delicious (we've tried them all!). The service is great and consistent. It's a lovely family restaurant and we would love for them to open other locations! Way to go, Moo!", "author": "M M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-15", "description": "Love their burgers! Combinations are very creative and if none of those spark an interest you can always create your own! Also burgers are just the right size, not too small to keep you hungry but not too big to make you feel bad for leaving it behind. Delicious shakes! We had the peanut butter and jelly shake = heaven!", "author": "Yana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "Perfect place for sophisticated, casual, family dining. Something on the menu for everyone. Excellent quality food... fast, reliable service... chic decor... vegetarian and gluten free items... craft beer... what is there not to love?  Oh, and the mac and cheese balls... *sigh* It was love at first bite.", "author": "Angela P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "They Updated their menu, it's a nice place for lunch or dinner.", "author": "Brooklyn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Unfortunately - I am lowering my review of this place from 5 stars to 4 stars. I have returned to Moo Burger about 5 times since my first review and seem to always a gripe.  I think it's because they have a bigger crowd now and therefore have less attention to detail. \n\nI have twice had my burger overcooked.  The last time, it even had a stick in it that said \"Medium Well\" when I'd asked for Medium.  It was definitely \"Well Done.\"    The wait staff seems to go by memory (no notes) and get things wrong.  Topping were wrong also.  Huge disappointment since I had literally begged my husband to go there since I had a massive burger craving.  Then it wasn't good... :(\n\nWhy didn't my husband want to go?  Because he didn't feel like having a 1000+ calorie meal. All the \"sides\" options are fried.   Would love if they had some healthy side options.  Steamed vegetables?  Please!  Since I don't like fried food, I can't get a side with my burger so I'm still hungry when I leave.  I can't rationalize going to dinner at place where I will still be hungry when I leave.  While I DO like Fried pickles (just cause I love pickles), the ones here are WAY too spicy.  I can't eat them.  But there are no regular pickles on the menu.  Can you please offer a side of regular pickles?   \n\nI still love the selection of burgers, the meat quality, the salad and the wine (though a wine glass would a nice).", "author": "Heather G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-01", "description": "I had the juicy bison burger and it tasted as good as a regular beef burger!  Service was great, loved the atmosphere!  Appreciated that the food was organic. Will go back again.", "author": "Candis G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-29", "description": "overpriced for mediocre quality\n\nthe burgers are teeny tiny for the price... nothing special about them, unfortunately.  you're better off walking down a block or two and ordering a burger at Lobo (better portion for the same price... AND you get a side with your burger at Lobo too!)  there's nothing really special about the fries either.  there are so many great burger options, this one let me and my boyfriend down. there's even a bareburger down the street from here now too... dont bother wasting your time at moo burger... just moooove on to the next burger joint! :/", "author": "Vicky P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "Definitely great but not the best burgers. But I love that its organic meat.  Good chocolate shake and fries. Zucchini fries could be any-vegetable fries-- totally forgettable. Onion rings were big but only got 5 and they were too oily.  Cute place. Next time I'll stick with a burger, fries n shake.", "author": "suzanne k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "This is my second time to Moo. I really think the food is great and love the decor but...\n\nThe hostess is obviously inexperienced and seems to be akward in her duties. Also I don't like waiting while tables are set just so the owner can make it seem like the place is packed. Please don't make customers wait at the expense of your marketing and ego.", "author": "Herm E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-30", "description": "To update my first review, the food again was great.  This time around I placed an order for pick-up and was impressed that the containers were not styrofoam.  Cardboard boxes are used and they kept the food warm for a walk back home of 2 blocks.  \n\nIf I could throw out one suggestion it would be to have the option of spicy sweet potato fries.  \n\nIf you want to enjoy a delicious burger then go to MooBurger.", "author": "Argante C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "I love Moo Burger! So far, everything that I've had there has been great and the customer service is awesome. I definitely recommend!", "author": "Ms N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "YES YES YES! Everything about this place is RIGHT! I've been here a handful of times and its perfect every time. I usually opt for the turkey burger hangover style. Their turkey burger is so well seasoned and prepared that you would hardly know its ground turkey. You need to try their hangover style burger...its messy, its topped with a serious slice of bacon and a fried egg! Yeah, their burger is a little pricey but worth it compared to some of the other places that have burgers and aren't nearly as good and really only like a couple of dollars less. Their sides are great as well. Whenever I am craving a burger, this is the place to go...one of the better places in the neighborhood in my opinion.", "author": "Shar Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "My cousin and I had a taste for a really  great burger. Found this place on Yelp search. Very cool, laid back atmosphere. Staff is welcoming and friendly. The burgers were awesome. I had the classic bacon (lamb); added goat cheese. AWESOME!!!", "author": "N R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "We just moved around here and are slowly making our way around the restaurants cobble hill has to offer. we ordered The hangover burger and the smoke house. I'm obsessed with pulled pork and also quite picky, the burger was tender and cooked to perfection and the pork was delicate and not fatty at all. The BBQ sauce had a little kick, slaw was also great, there could have been more though. The onion rings were awesome as was the chipotle aioli that can with it. my husbands burger \"the hangover\" was really good to, fried egg, perfect runny yolk. we will be back for sure... the service was very nice, gracious hosts. when i said its so good to the guy walking around he said thank you so much in such a grateful way. It was clear this guy knows good food and is very passionate about food. my husband spilled his wine by accident and the staff coildnt have reacted quicker in trying to get him more on the house. Very happy yet a little worried for my waist line to be living near this place.", "author": "Katie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "Updating my review. Had the hangover burger as usually buy I mean the past 2 times I have been there the service has kinda sucked. The waiter never really has anything to say and the lines have gotten longer. Hopefully it gets better but the hangover burgers is still the best. But I don't know if I can keep coming if the waiters and servers suck. I like my waiters to be happy friendly and welcoming these waiters aren't horrible but they are cold. Especially  the one with the tats. 4 stairs cause of  the servers.", "author": "Adam P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "It's exactly what you'll expect. Solid, typical burger joint.", "author": "Brittany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "Loved the court street burger but the greek burger was better. Zucchini fries were alright. Waiters were friendly and attentive.  Lunch was great.", "author": "Laura V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "walking the streets, i found this amazing place and the short rib sandwich was everything... service was excellent, another reason to be in NY!!! when in Brooklyn treat yourself to there options.", "author": "Andres C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "Excellent burger.  In NY, second best to Keen's.", "author": "Devin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "I always get the turkey burger and it never disappoints!  Most flavorful turkey patty in Brooklyn.  Also, the onion rings are heavenly!  Crispy breading, you need a knife and fork to eat them.  And the always make room for us with the stroller.  If we don't eat here once a week, it's a bad week.", "author": "Maggie L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}