{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Recently ordered from  here this weekend with my fiancé. My fiancé ordered the Mac n cheese burger with no bacon which was filled with tons of flavor, I ordered the American burger which lacked flavor and was topped with a lot of onions. We also ordered a side of fries and corn on the cob with cheese. The fries were hand cut and fresh, the corn was delicious would definitely recommend . They are a bit on the pricey side but it was definitely worth it.", "author": "Samantha T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "It is not unusual for a New Yorker to be craving a good burger occasionally.  That was me yesterday night, and a burger joint like Moo Burger is exactly what I needed.  We walked in to find ourselves in a rustic looking establishment, with distressed, wooden furniture and two long dining tables for bigger parties in the center of the room.  Great music was also playing - soft rock, 80s jams and artists like Depeche Mode for the elder and Hoobastank for the cool people.\n\nWe were handed with menus on clipping boards - very trendy, with a number of burger variations and sides.  My fiance went for the Court Street and I went for the All American, substituted with Bison meat, plus a side of sweet potato fries.  He also ordered a beer and myself a homemade lemonade, which wasn't too sweet - just the way I like it.  Now for the burgers - we absolutely loved them.  The Bison patties were cooked to our preferences and the pairings and sauces were on point.  My only complaint was the sweet potato fries were pretty soggy.  I would've liked them a bit crispier.\n\nThe service was also noteworthy, with the owner/manager checking in on us to ensure everything was a-okay.  I'd definitely pay another visit when I am craving a juicy fat burger again.", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "So good. The food was incredible, the owner was nice as can be and the place was clean. If youre in the area treat yourself to this place its worth it! I got the mac n cheese burger...cooked to perfection, my wife got the bacon cheese burger which was also delicious. I thouroughly enjoyed this place!!!", "author": "Josh R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Great, fresh tasting burger. Fast and friendly service. Prices seem reasonable if you're getting the basics. I recommend.", "author": "Attia T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "I ordered a veggie burger, which was a mostly a mushy spread on a roll. I asked my server if the veggie burgers were supposed to be served like that and was told yes. I wouldn't recommend if you want something like a burger. Didn't try to the real meat burgers - so hopefully those are better consistency.", "author": "R D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "For delivery: food delivered late, milkshake melt d, all the fried items (onion rings, fried pickles) were cold and the fried batter had fallen off the onions and pickles into a pile of wet starch.\n\nBurger was cold, chili dogs were room temperature and no ketchup was provided.\n\nAlso - did not answer their phones. When we were calling about our late order, it never answered until 6th call.\n\nIf the food was okay - this is forgivable - but it was gross. Bareburger arrives hot and crispy, and their shakes frozen. I'll go with them next time.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Awesome food, great service, wonderful atmosphere. My fiancé and I love coming here. We always get the same thing (Mac and cheese balls, pulled pork sandwich, sweet potato fries, and the short rib) phenomenal food. Great tasting and they have a good variety of sandwiches to choose from. To top off a perfect meal you must have one of the great milkshakes. I prefer the strawberry while she has the chocolate. If you come across moo burger do not hesitate to stop in you certainly won't regret it.", "author": "X W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "The best onion rings in NYC. Perfect batter,  correct level of doneness, and delicious flavor.  \n\nAlso, turkey club burger was v legit. \n\nService and price also good.", "author": "Kerrie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "A tiny burger for $18??. We went there on a Sunday - the place was practically empty and the servers were so slow. (Burger was good though). But I won't come back - gave it a try twice. It wasn't a pleasant experience each time.", "author": "Jemka T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Our family loves this spot. Great food, service is excellent and they are always accommodating.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Spacious seating, communal tables, open kitchen, and a great staff serving 17 varieties of burgers and 5 types of hot dogs.\n\nThe Moo mystery juice is a refreshingly sweet pink lemonade.\n\nThe Nova Scotia was salmon patty with a slice of smoked salmon. I wish it was pile of smoked salmon. Definitely should have read the menu more carefully.\n\nMexican grilled corn was a special, definitely worth ordering. Grilled corn, rolled in cheese and spices, its wonderful. Slight heat, a mild cheese, sweetness and char melds together in your mouth. Good combination. \n\nThe hangover was a great juicy burger, topped with bacon and sunny side egg. Even if you aren't hungover, you will love this. Applewood smoked bacon, runny egg yolk work great on burgers. Even though I wasn't craving a burger, I couldn't get enough of this combo. My husband had to ask a couple times to get his burger back. \n\nDefinitely a solid choice if in the neighborhood.", "author": "Doreen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Hands down the best burger spot in Brooklyn!!!We've waited a while for Moo to finally open back up and boy was it worth the wait. They added a few more things to the menu like chicken wings, tacos, nachos, and a new burger called mac+ cheese! Dangerously delicious!", "author": "Courtney M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "It's been a while since I have been back since yesterday - this used to be a regular dining spot for my husband and I.  The succulent burger with the beautiful bun that was both savory and buttery, the chili cheese hot dogs with flavor explosion in very bite!\n\n\"Would you like chili on your burger\" she asked\n\"Why yes I would!!!!!\" I exclaimed\n\nBoth the hubbie and I have changed our taste bugs have changed a lot since yonder days.  With him being a vegetarian and myself being a pescetarian our cuisine choices have been limited.  Knowing moo burger has many options for the meat challenged we decided to go back.\n\nIt was one of those instances where you decide to get back with your ex and you want it to work out so badly.... but alas it can't and won't bc things have changed.  \nI ordered the salmon burger, which was not very good bc of the varying degrees of temperature between the hot burger and cold lox.  As soon as I pulled the lox out the burger was much better but lacked the smokey element the lox offered.  Fries were not cooked well, they were oiled, with no crisp or texture.  The hubs ordered the veggie sandwich which was very good and onion rings- both well seasoned and very good.  I wish we can give half stars.. I would give a three and a half, service is great and overall good experience.  I would go back to try veggie options but no to the salmon burger.", "author": "linda y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-20", "description": "Greeting- yes\nParking- street meters\nBR- One for all! WTF\nPrice- average for area $10-15 burgers\nService- good\nFood\nBasic burger $10 was a juicy piece of meat but wholly cow a ton of salt shriveled your lips\n\nMoo fries $6 are a big bowl of chili fries. Presentation was not appetizing\n\nWIGB? No  \n\nAnother place that over salts its food and adds to the ever growing hypertension epidemic in this country", "author": "Hungry K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "3 stars is generous but I felt bad about leaving a 2. Moo Burger could be so much better...a great environment for dining with kids, solid beer list and comfortable seating.\n\nBut the actual burgers are so disappointing, no flavor and the buns are regularly stale. It doesn't seem like a tough thing to improve, so maybe there's hope for Moo Burger. It's so convenient.", "author": "Neil M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "It's too good not to eat. The sliders are out of this world! I wish my mom and dad would bring me here every day!", "author": "Constance E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Had a great experience here. The place has a rustic vibe to it. I've been in the area for a couple of weeks and have passed this place several times, so I finally decided to give it a try. I tried the fried mac and cheese for the app and the mac \u0026 cheese  burger for the entree. They're moo burger is a great burger for vegans. Overall good experience for a quick bite.", "author": "King N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "I was very disappointed after ordering $45 worth of delivery to find that all of the food arrived cold. The fries weren't even worth eating because they were cold and soggy. The nachos were a pile of slop, and the sandwich was just overall cold. Super high price to pay for cold food!", "author": "Rachael D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-17", "description": "I wish I could give 3.5 stars. The food is not bad but the place can be uncomfortable if they made you sit next to kitchen. All the cooked meat and burnt oil smell gave me huge headache. Waitresses and waiters were kind. The sauces and lemonade was bad.\n\nI got all American with white cheddar and it was not bad. I liked how the lettuce, tomato and onions were fresh and they felt like healthy haha. The patty was ok too, even though I wanted it medium well it was still juicy, I liked it. The buns, I liked the taste but they were very cold and sort of crumbling. I like some sweetness in my burger so I got the burger with extra cranberry mayo, which was a mistake because it tasted like very bad quality mayo with preservatives. Not sweet at all.\n\nThe regular fries were good, I liked them. They were like fresh cut and yummy. \n\nThe lemonade was like lemon water, no taste at all. \n\nI wish they served better quality sauces. The mayo, cranberry mayo and ketchup had a weird bad quality taste. \n\nSo overall, good fries, good burgers, bad lemonade, bad sauces, tricky seats.", "author": "Dilek T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "I've seen the crowds wait outside this place for years, so finally I put my name on the list and took a seat inside Moo Burger.\n\nTo be honest, I was underwhelmed. Service was slow, burgers were pricey ($13-16) and fries weren't included (an additional $5). I'd rather hit up Bareburger down the street! \n\nBut it's cute inside, so I guess it'd be a good place to chill if you're not in a rush.", "author": "Sarah G."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}