{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "Mooburger is adorable inside. The service was great, and the beers and cider that we drank were delicious and reasonably priced. \n\nMy friend and I shared the fried pickles and the sweet potato fries (which come with hot maple syrup! what?! yum!). The fried pickles are a little bit too heavily breaded, and they are literally whole cornichon pickles! The pieces are too large and the boiling-hot-pickle-juice-to-batter-ratio was way off. I think fried pickles work a lot better when they are sliced into chips, and fried with lighter, more tempura-like batter. Anyway, our hamburgers were fresh and delicious and it was nice to know we were eating heathier, pink-slime-free meat.", "author": "Emma G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "the service here is always outstanding. very family friendly which is big plus for when I am on auntie duties. The BEST fried pickles I've had in BK so far, and the spicy aioli that comes with it is just another great addition.", "author": "Tatiana S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-06", "description": "Decent atmosphere and service, but the food itself is below average. I had The Hangover burger, which was oddly flavorless and overly messy. Also tried the hot dogs, which were nothing special. On top of that, it felt fairly expensive for what you get.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-21", "description": "Oh I wanted to love this place and though the service was great and the space was lovely, I just did not love their burger. And based on the name, it should be all about the Moo right?\n\nSo I ordered a bison burger with moo sauce and a fried egg on top. Yeah I did it, I negated my \"healthy bison\" with some yummy egg yolk and creamy sauce. I would do it again and throw bacon into the mix with some extra cheese as well! #noshame\n\nOkay, so the bison was dry...but I haven't had bison before so maybe that's just how it is? But it was also bland and I don't care what kind of animal you think you are, but goshdarnit you have the capacity for flavor when seasoned right! The fried egg was cooked a tinge overdone as well (I always feel a bit jipped when not enough of the yellow yolk comes pouring out over everything.) The moo sauce was really stingy too. It sounded great...blue cheese and chipotle and other yummy stuff but I just couldn't taste enough of it to have it make an impact on this dish. Such potential for my burger, maybe my expectations were too high :(\n\nWhat they did get really right tho was the sweet potato fries! If this place was called Spud then it would have gotten an extra star just for these. They came with this maple syrup goodness and were salted just perfectly. Great sweet and savory treat in my book! I also had the chipotle ketchup on the side, but it had hardly any chipotle flavor so I don't want to discuss it further. lol. \n\nMoo maybe I will give you another chance. Maybe it was an off day. Maybe I will just be in the mood for your yummy fries dipped in syrup. So much potential, I think they might be worth another go around when I have a craving!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "I was currently in NY, just for a family pleasure trip! I yelped the best burger joints in the area and thankfully, I found this spot....I was interested as soon as I saw the yummy pictures of the buttery buns and juicy looking beef. As soon as we walked in, we were greeted by the owner and server. The establishment was very clean and the manager was constantly cleaning \u0026 making sure things were in order. Our food was very tasty and served hot \u0026 made to order! The manager kept stopping by to make sure we were pleased and even had conversation with me and my family. I will definitely spread the news about Moo Burger and be back to visit the next time I'm in Brooklyn. Hopefully the owners will bring a Moo Burger to Raleigh, NC very soon. :)", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "I typically eat burgers to nurse a hangover, but I was completely sober and hungry when I stopped by and was very pleased at the end of my meal!\n\nI ordered the hot dogs and my boyfriend got some sort of bison hamburger with delicious bleu cheese and mushrooms. Both were exceptional! Though, I definitely favor the burger over the hot dog. For some reason the hot dog had an ever so slight chewy consistency. We also ordered a side of sweet potato fries and a bottle of organic root beer soda and we were set! It's by far my favorite hamburger joint in Brooklyn.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "This place is excellent, moderately priced, immaculately clean and the food is delicious. Head to head it is better than Bare Burger, the best part is that you don't have to take out a personal loan to pay for your meal, the bacon classic is off the hook, the pulled pork was slamming.. Just ask for extra napkins because the burgers are so juicy that you will make a mess outta yourself. Lastly, the staff is very polite and on point, the scruffy looking manager or owner is an amazing host. Check this joint out.", "author": "Charles C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Best burgers my boyfriend and I have ever had!! The sweet potato fries come with maple syrup and it is genius!! Good place for a couple of beers with lunch!", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "You know a burger is good when you don't need ketchup! One of the best burgers I've had...and cooked exactly as requested. I especially love how quaint it is. The service was also amazing!", "author": "Mishal M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "Moo Burger was the BEST burger I've ever hard. Oh my gosh I couldn't stop eating it! I got a burger with provolone, mushrooms, caramelized onions and arugula. It was cooked perfectly and all the flavors blended together so well. I love that they have a large array of different meats--lamb, beef, salmon, bison, etc. etc. I know that when I go back, I won't be just trying the same old burger with different toppings.\n\nIn addition to the burger, I got zucchini fries, which came with a tzatziki dipping sauce. They were delicious as well. I had to battle my boyfriend for the last one :)\n\nWe also got a chocolate milkshake, which has ice cream from Blue Marble Creamery up the block. It was a solid milkshake, but not sure if it was worth the $7. For that, I could live without it.\n\nI recommend that EVERYONE goes here!! It has delicious food and a very down-to-earth causal atmosphere, perfect for any night.", "author": "Mariana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "As always great food and service. Manager on duty is always on point. I had the Hangover burger. So good!!!!", "author": "Fred F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "Delicious! Simply scrumptious! That is how I would describe my dining experience at Moo Burger!\n\nI ate dinner there today with a couple of friends and I must say that I was very pleased! I wasn't really in the mood to eat a burger today because I coincidentally happened to have eaten two burgers the day before. But I was hungry and the reviews were good, so I wasn't going to complain. Having said that, there wasn't any reason to complain. Far from it.\n\nI ordered the All American burger, and I added my own spin to it. I ordered the avocado and fried egg topping, along with American cheese. The burger looked amazing when it came out! It looked so good that even the manager/owner came up to me and told me that he would probably eat that same concoction later! And it was just as unbelievable as it looked! In addition, I ordered the fried mac and cheese balls, and they were also tasty.\n\nThe decor was very nice and woody, and the service was friendly. Even the neighborhood was awesome, and I enjoyed walking around the area afterwards. What a spectacular evening dining out! Can't wait for my next Moo Burger! Oh, and the lemonade too, that was good as well!", "author": "Ari G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "The menu has a nice variety of signature burger combinations, as well as salads. I'm a big fan of their turkey burger which isn't dry, unlike those at many other places, plus the sweet potato fries are a great addition to the burger. \n\nThe inside has a nice, comfortable design and spacious enough for when the dinner crowd comes in. It can get a little loud at times once the families come in, but it's not distracting.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Moo Burger is a very welcome addition to the neighborhood.\nGreat burger, not too fussy and cooked perfectly.\n\nThe fries need to be crispy and hot, not warm and chewy.  Maybe we just got the end of the batch, but they didn't match the quality of the burger.\n\nAnd should a pint of beer really cost $7?\n\nWe had great service, even if our kooky waitress described the portion of the fries as, \"They're not as big as a medium size at McDonald's, but bigger than a small, you know?\"  -A line I'm sure she learned during employee training.\n\nDefinitely a great space, effort, and the best burger in the hood!  I hope it helps dim the lights at 5 Guys down the block!\n\nPS:  We went at 9pm, so no kids, but dude's, do you expect a kid- free burger joint in this hood?  Just go after dark.", "author": "Kimi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "We took a trip to Moo Burger in Cobble Hill last night from Queens and we were not disappointed!! It was pretty busy for a Tuesday night and now I know why. The decor is gorgeous and upscale without being stuffy or snobby.  The food is outrageously fresh, well made and delicious.  \n\nI ordered the classic bacon burger with mushrooms and zucchini sticks.  The burger was the best I have had... probably ever! It was cooked perfectly and the chipotle ketchup was so good.  The zucchini sticks were awesome and served with a spicy tzatziki, I could not stop eating them!  \n\nMy husband ordered the smokehouse with pulled pork on top of the burger wich was again outrageous.  We were able to try the mac and cheese balls, onion rings, sweet potato fries and fried pickles and let me say that each one was better than the next! \nI was also able to try the surf and turf burger with lobster and pineapple on top.  It may sound strange but it was so ridiculously good that I could have eaten the whole thing after already finishing my burger.  \n\nEven after eating all of this food, I didn't feel bloated or disgusting.  The ingredients and food itself are very fresh.  \nThe service was great.  The waiters and waitresses were very attentive and accommodating.\n\nSome reviewers thought that the portions were small for the price.  Honestly, I feel that the portions were just right and I personally don't like having a ton of fries left at the end of the meal to continually pick on. \nI can't wait to go back to Moo Burger for more delicious burgers and you can be sure that I will order the surf and turf next time!!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "I use to be a fan of bear burger, but since Moo burger has opened up in the neighborhood I have been loyal to them.\n\nThe food is a little overpriced, but the quality of meat is great. I usually order the hangover.\n\nI would not order the milkshake again though, it tasted like a big chunk of milk ice cream.", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "Great burgers, great variety on beer including seasonal beer, and service has always been good. A bit pricey for a burger place, but very enjoyable.\n\nIt can get a bit loud during the afternoon hours when parents bring their kids there.", "author": "Matt K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-14", "description": "There are better burgers and burgers that aren't as good as this place.  I am gonna say this place is average at best but still tasty.  \n\nThe staff was friendly and attentive.  Very knowledgeable of the menu and very willing to offer good suggestions of their favorites.  \n\nI wandered in by myself last week for dinner.  I had grabbed one of the booths along the wall behind the host stand. \n\nI tried the Greek, the lamb burger with pickled cucumber and grilled eggplant (A nice touch) and tomato and olive tapenade all held together on a bun.  It was great with the tzatziki oozing all over the place.  The lamb needed to be seasoned a little better.\n\nI also got the sweet potato fries which were served in a little fryer basket (Kitch factor) and with a side of maple syrup.  The table lacked the standard condiments you would normally find at a burger joint or restaurant.  \n\nWould definitely like to try other burger offerings on the menu.", "author": "Caesar R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-06", "description": "3.5 stars...\n\nAfter months of anticipation Moo Burger is finally open, I pass this place on the way home everyday but waited until it had a dozen or so reviews before I decided to check them out. I should have waited for a couple dozen reviews. It's an upscale burger and hot dog restaurant (they also have salads) with lots of organic and local ingredients so I can definitely appreciate that. I can also appreciate that the somewhat well known and televised chef, Marc Anthony Robert Bynum (yes, that's one name) is behind the creations. I really enjoyed the rustic but classy interior. The problem with eating out anywhere in this neighborhood (especially here) is the sheer amount of kids, you seriously have a 50-60% chance of sitting next to one under the age of 8. \n\nThey have a great amount of burger options. No where else have I seen the option of getting pulled pork or brisket as a burger topping ($2/ea). In addition to the beef you can also other unusual meats like bison, elk, or ostridge. Most burgers run $9-14 depending on what creation you get. Hot dogs come in pairs and run mostly $8-12, sides (all fried) are $3-6, and shakes (made with blue marble ice cream) are $6-7.\n\nI ordered a bison burger with cheddar and fried onions with a side of sweet potato fries. You aren't asked what done-ness level you want your burger which bothers me but because I like my burger medium and that's pretty much what I got, I lucked out. The service was inexcusably slow from beginning to end and they also messed up my order. I asked for their chipotle ketchup on the side and it came on the burger, and the burger also didn't come with cheese on it. They have a few house made sauces and extra ones on the side are a whopping $2, the same price as pulled pork! It was a simple order and I was eating alone so I was a little surprised at the mistakes. The sweet potato fries were good but nothing outstanding. What was outstanding though was how small the portion of fries you get for your $3 is. They give you what looks like a mini fry basket that is seemingly piled high with fries but in reality they creatively crumple paper on the bottom so that a small amount of fries fills it up. Usually when I'm done with a burger I've got more fries left than I care to eat but in this case I was done with the fries half way through the burger. \n\nI'd say the atmosphere (minus the children), ingredients, menu offerings, and friendliness are great here but the value and service (especially if they're busy) is bad enough to keep me from coming back anytime soon. As a side note, Watty and Meg next door does an organic burger, fries, and beer on Mondays for $10.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "This is my favorite burger place in all of New York. I live in queens but I do not mind driving all the way down into Brooklyn to have a great meal. Everything is amazing beef, vegetarian burger, chili, fries, beers etc. EVERYTHING. Highly recommended. Only thing that sucks is the noise level.", "author": "Jake N."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}