{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "I ordered the Greek burger and fried pickles and it was awesome. I will be going back to this place.", "author": "Alex T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "The service is great. Very welcoming people. And the food, I'm dying.. It's sooo good. Had the classic bacon burger, it was the best I had.", "author": "Diki S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "Best pulled pork in BK. love this place. Good wine, good atmosphere and awesome awesome food. Love it here", "author": "Katie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-27", "description": "I'm knocking a whole start off of my review of Moo Burger because of the price. \n\nMoo Burger is bright and clean, a cozy neighborhood spot with a mixture of long shared tables and two-tops, a great place for a bite after a movie at the nearby Cobble Hill Cinemas. \n\nAt Cobble Hill Cinema a theater ticket is $11. At Moo Burger that won't get you many of the burgers, including the Chili Burger ($13) or even the vegetarian portobello patty ($12). This doesn't include any sides, which frequently push a basic meal over $20.\n\nI had a Nova Scotia, which was a pretty tasty salmon patty with a mustard creme fraiche on top. The sauce could have had a bit more of a kick -I couldn't taste the mustard -but it was solid. The burger also featured 'wilted spinach' which seemed like an unnecessary touch. \n\nThe onion rings were too salty,  but they came with a surprisingly and pleasingly tart side of barbecue sauce. \n\nWith a beer, this meal was north of $30, too much for an average meal after the cinema.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-17", "description": "I really really wanted to love this place... But unfortunately I was very underwhelmed!  I expected an amazing burger as per all these wonderful reviews.  Sorry but I don't see the allure!!! What did I miss??  It was not what I expected for a place that specializes in burgers.  It was above diner standard for sure but not what a I expected.  So word to the wise don't go there expecting the best burger in the world. \n\nSo for the food:\nThe burger was juicy but the flavor was off.  It tasted like it needed seasoning.  And I get it, before you guys freak out on me, I know meat is supposed to taste like meat BUT it just tasted meaty in a not so enticing way.  Not my thing.  Also, it was served on a huge tray which was very inconvenient as it left no room for everything else we ordered.  No points taken off for that of course.  I get it they are trying to be hip and different.  Next, The Mac n cheese balls... Seems to be a hit by many but not for me... They were pretty darn dry in the center.  Had the center been creamy then maybe just maybe I would have liked them because the flavor was definitely there! However, the chili fries were a joke. There were tons of fries and just about enough chili and cheese for a third of the fries. Not cool!  Burger places are meant to be greasy and comforting with tons of cheese and fries and flavorful burgers but Moo Burger just barely hit the mark.  What a disappointment. \n\nFor those of you that care about ambience... The place was cool and relaxed. The service was great and the manager was very attentive.  So definitely a plus there!!!", "author": "Angie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "My fiance and I were walking down Court Street looking for something yummy to eat.  He felt for breakfast food so we were looking for a brunch menu.  We stopped into Mooburger after seeing a sign about brunch outside.  Unfortunately they weren't serving brunch BUT the hostess recommended a burger for my fiance called 'the Hangover\" that had eggs and bacon so we decided to give it a try.  He got the Hangover and I got the Tukery Club..only, there were no more turkey patties, so I got it with a lamb pattie instead, and it was SOOOO good!!\n\nIn addition, he got zucchini fries and I got regular, both of which were pretty good.  We ordered a pitcher of the \"moo mystery\" which turned out to be a mix of cranberry juice and lemonade and boy oh boy was it delicious and they came in these really cool wine bottles, which I thought was a neat twist.  Then, my finace ordered a peanut butter and jelly milkshake and that was SUCH a hit that I ordered one for myself too! lol\n\nAll in all, it was a great spot.  I would definitely go there again.", "author": "Celeste R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "This place does everything right. Attentive friendly service. Love how everyone moves around with a purpose. It's obvious they work hard from the lack of wait time from seating to eating. Everything's pretty smooth.\n\nI'm not a burger girl, but I gotta admit, this food's really good. Got a Court burger and onion rings. Everything was spot on. Probably the best onion rings I've ever had.\n\nWe need more places like this in the neighborhood. Hey Moo Burger, thanks for taking over the long vacant space and bringing your deliciousness and unpretentious service!", "author": "flyinglimegreen T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "There's no question that the burgers at Moo Burger are excellent. The basic burger is great, but the salmon burger and others are also really good. That being said, Moo Burger servings are SMALL and slightly overpriced. With Bareburger nearby (larger burgers) and 2-8-2 Burger just around the corner (also smaller burgers, but much cheaper) you really need to think of Moo Burger as the place to go if you want the specific items they have on the menu. That being said, the burgers and sides are all really great. Hard to find something to dislike here.", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "Great burgers here - a nice variety of proteins and the other burger components were all solid. A natural comparison is Bareburger, as the pricepoint is similar and both offer unusual proteins like bison. My girlfriend and I both preferred our burgers here to ones we've had at Bareburger, but felt that the onion rings here were not as good as there.\n\nThe staff was very accommodating of additions and special requests we made (changing or adding certain ingredients on our burger), and my burger patty was cooked exactly as I had ordered it. It was buzzing and busy with parents and kids, as one might expect for a weekend lunch, but there wasn't a wait.\n\nMy girlfriend's dad always wants to go to Bareburger when he visits us in Brooklyn - next time, we'll have to take him here.", "author": "Sean M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "We run a lot. This burns a lot of calories. Where do we go to replenish those lost calories? That's right. Mooburger. Every time.\n\nThis is a brooklynized version of Bareburger. Quality has always been top notch. They grind their own meat so I always go medium-rare. The bacon classic, delicatessen, lamb, and the banh mi were all superb. The sweet potato fries with chipotle ketchup were killer. Fried pickles, onion rings and fried zucchini were solid as well.\n\nAnd something about having Firestone Walker IPA on tap...the citrus...the pine. Crisp. Something special about those California hop bombs. Mmm.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "Hangover burger -- let's see there's bison meat (surprisingly good), fried egg, cheese, best burger ever! also very memorable are their sweet potato fries with maple dipping sauce\n\nMy hubby swears by their chili burger \n\nnot a fan of burgers? their salads are just as good! nice, freshly chopped greens\n\ndon't bother with the wine i've tried and have failed, just get the beer\n\natmosphere is also great -- really nice, attentive, patient servers -- always lots of kids at this place", "author": "Hyun L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-27", "description": "Please note that this review is for take out service.\n\nI came here last night with my boyfriend and friends to pick up food to take out. We were near by at a bar and figured it would be nice to grab a bite to eat.\n\nThe place looks adorably cute, even though it is tiny. It was too cold to stand outside to wait for our food (it was around 10pm or a bit after 10pm) so we stood inside and I felt bad because we were in the way of the waiters filling up drinks. The lady at the register taking out order seemed a bit... indifferent. She didn't smile and she wasn't that friendly either but then again, it was busy. \n\n(Side note: if you are going to use the bathroom... have a friend wait outside of the sliding door... which doesn't really lock... at all.)\n\nOnce we got out food and we parted ways to go home, I couldn't wait to scarf down my food. I was STARVING. \n\nI ordered a bacon classic for $12 and not only was the burger small for that price but it lacked taste (aside from the bacon). As a side, I ordered fried pickles. Now, the fried pickles that I am used to is SLICED pickles.... not small baby pickles. They weren't anything special and the portion was okay for the price I paid. Then again, I didn't finish of the batch of fried pickles because they didn't taste all too good. I had a bite of my boyfriends mac and cheese and it was also tasteless. The only thing that was VERY yummy was the side sauce they had given me... which I put on my burger to make it tasty. The bun was good and they put a good amount of lettuce, tomato, and onions on the burger but that still didn't help the burger patty itself.\n\nMaybe it was an off night for take out or maybe it wasn't meant to be with Moo Burger. Would I give it a try again? Most likely not, especially since there are other places to try in the area. \n\nAlso 2 of my friends didn't feel that great after consuming their burger\n\nVery nice place, very packed, some staff was friendly (even though we were hovering over the area where they refilled drinks), and the food really wasn't all that great. Oh and the bathroom door was obnoxious.", "author": "Georgia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-17", "description": "I've never been one to like burgers or fries but thanks to Moo Burger I've been converted! All organic ingredients, a brioche bun and the juiciest burgers around. I never feel guilty after eating here, even after inhaling a basket of crispy zucchini or sweet potato fries along with my meal. (Bonus: the zucchini fries come with a creamy yogurt cucumber sauce and the sweet potato ones hot maple syrup!!)\nAlso, kudos to the super chill interior and friendly waitstaff. It's an absolute pleasure dining here, even if it is a tad bit pricey.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "According to the reviews, I had to try the hangover burger.  It certainly did not disappoint.  I never had a bison patty but it did taste like beef.  Crispy bacon and a fried egg to compliment the burger.  I also had an order of moo fries aka chili cheese fries.  I didn't realize it would be such a large portion but it was worth it with the little kick of spice from the chili.  Service is great and attentive.  The only negative is the price.  I didn't realize how expensive a burger and fries could be nowadays.  $14 for a burger, $6 for moo fries and a $7 beer.", "author": "gary m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "One interesting place they have a good menu selection and the prices are decent too the only negitive I can say is that the meat can be a little dry sometimes but mostly it has been exellent", "author": "Clarence M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "Good food, but OH MY GOD, HOW DO THEY NOT HAVE A MENU ONLINE YET!?? How can a restaurant not be on menupages and not have a menu posted on their (pretty nice) website!? They seem perfectly smart and savvy, but I just want to order take out and there's no menu anywhere? \n\nI'm more frustrated just writing this.", "author": "chris r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Lovely establishment.  The people that work there are very friendly and accommodating.  They made space for my friend and me, along with our two young children in strollers.  The food is fresh, ranges from healthy to fantastically unhealthy (fried pickles-yum!).  I will definitely be back.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "My boyfriend and I decided to try MooBurger as we are fans (like anyone else) of awesome burgers.  The decor of the place is really nice and ties in the name of the restaurant.  \nAs for the food - the burgers are a great size...not too big, not too small.  I thought the Turkey patty though was a tad overseasoned but his Beef Burger was just on point and very delicious.  I also had their fries which I loved.  We tried the fried mac and cheese balls and those were great as well.  \nAwesome beer selection and some yummy iced tea and lemonades as well.  I would go back just I need them to lighten up on the seasoning for my Turkey burger (and BTW large selection of different meats to choose from for your burger - beef, turkey, chicken, bison, etc...)", "author": "Tanisha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-04", "description": "Zucchini fries, zucchini fries, zucchini fries. Need I say more? I suppose I should.\n\nBeau and I sat down at Mooburger and pored over the menu. I wasn't going to be ordering any burgers that had previously moo-ed, so I appreciated that the menu had more than just a veggie burger for me. Grilled vegetables, veggie burgers, grilled cheese, I love having options at a burger place! I got the grilled vegetable sandwich (piled high with veggies, pesto, and some swiss), and he got the buffalo chicken sandwich.\n\nOh, and we split zucchini fries, duh.\n\nTo those reviews speaking about the presentation of the food, the big trays are a little silly when one orders a burger alone, but the food more than made up for it. Cooked to perfection, and the buns were great (not too big, not too small). And those dang zucchini fries, so. freaking. good. A little generous on the breading, but oh so crispy on the outside and nicely cooked on the inside. I'm considering just getting a triple order of those next time.\n\nThis would be a five star review but for two things: one, it was a bit pricey for two burgers and a side of fries. I understand the fresh/local/organic ingredient price hike, but that doesn't mean I have to like shelling out $30 for lunch. Also, service was a bit slow. They had just opened so I'm sure they had to heat up the grill and whatnot, but on a hot, sticky day, I need my water refills more often than they came. I do appreciate when a manager comes around to ask how things are going though, so good on you for that, Mooburger.\n\nI'll end with: zucchini fries.", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Great new place. Wow, whats with all the good new burger joints? \nThe menu is very similar to Bare burger... which opened a new place just a few blocks down.\nWe had a chicken breast sandwich, Bacon cheese burger and chili cheese fries . \nBoth were VERY good- not greasy or gross. Will definitely return.\n(Stomach was fine after.)\nA bit pricy but worth it. Came to $40 for 2...  Sandwiches/Fries and drinks.\nOh... the service and staff were spot on! I think the owner guy even stopped by to make sure everything was good.\nReally sincerely nice folks!", "author": "Steve H."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}