{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "This place is so consistently good. Like scarily consistently good.\n\nI came here with a buddy and we shared the Moo Fries (essentially the best chili cheese fries I've had in recent memory, because the beef was so! well! seasoned!) and then I had the All-American burger. The burger is the perfect size for a hungry adult and delicious. No complaints about oversalting, undersalting, or even the type of salting. \n\nService is quite quick, the bathroom is very clean, and there's lots of space for small groups if you so choose.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-30", "description": "Didn't love it.\n\n- EXPENSIVE (regular burgers \u0026 fries but the cost surpasses any other burger place I've been too)\n- Staff is friendly\n- Always crowded, the times I've been here with families coming in with kids so if your trying to have a quiet dinner don't come here \n- overall if I'd say definitely give them a try but by no means is it a WOW kinda place", "author": "Jacob P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-16", "description": "This place is great for people who have too much money and need to feed kids who are too picky for normal food but will eat burgers \u0026 fries without thinking about whether they are good. For anyone else, there are so many better options.  Is it as good as Shake Shack? Not even close. Tastes more like TGI Fridays or Applebee's. There is too much bun and not enough burger.  \n\nPrices are set as if it's a sit-down restaurant with a full menu instead of a burger joint, with basic burgers ranging from $12 - 18. Then you'll have to tack on another $5-7 for fries or other sides, and then another $3-7 for a drink. All in, expect to spend $30 a person.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "After just a couple of visits, Moo Burger is quickly fulfilling the undeniably important role of go-to neighborhood burger joint. \n\nBoth times, our burgers were cooked just how we asked, with the ground beef proving to be tender and juicy. The Mac and Cheese burger is mouth-watering, because who doesn't love a glob of fried Mac and Cheese on top of anything? The Bacon Classic is also a solid option for those looking for something a bit more traditional. \n\nWhile I have not yet indulged, there are several menu options that steer from your ordinary beef patty, such as pulled pork, lamb, etc. I must also give props to the cole slaw, reminiscent of how I enjoyed it at barbecue joints down in the south.\n\nIt's bit on the pricey side, but with attentive service and good food, plus various beers and wines to choose from, Moo Burger is a reliable spot to satisfy those powerful burger cravings.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "I'm always up for trying new burger joints so was intrigued by reading the Yelp review and gave Moo Burger a shot. My son \u0026 I definitely enjoyed our visit for lunch on a random Thursday. Place was relatively quiet but I'd assume it's packed around dinner time and especially on the weekends. Back in the day, you'd say this place has a Bohemian feel but I guess today you'd say it's more of a Brooklyn hipster vibe. The restaurant space itself is ample - perfectly sized in fact where you don't feel claustrophobic nor that it's too big and impersonal. Also very clean! The one knock on the infrastructure is that it has only one bathroom - could see this being an issue when the restaurant gets busy.\n\nI had the lamb burger (pictured) with a side of the fried pickles. My son had a regular burger with sweet potato fries. Everything was great.  I am a fan of lamb burgers and really enjoyed  Moo Burger's take with the olive remoulade - it really took the taste up a notch. To close we had small (kids) shakes - the value isn't great at $5 a pop for something in a small water cup but after indulging on the burgers, portion control probably isn't a bad thing! My Bananas Foster shake was incredible.\n\nCan't wait to return!", "author": "Joe M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "Really more of a three and a half, want to start off by saying I will probably order from here again at some point. Had the all American burger and the old fashioned hot dogs. I threw some jalapeños onto the burger cuz I like a little spice in my life. The burger was really good! Not stupendous but super solid and didn't fall apart, managed to hold all the ingredients actually in the burger. The dogs were pretty good but I was not a huge fan of their choice of wiener. It had a more sausage than hot dog feel to it. When you're having a dog with sauerkraut and mustard it's better to have a hot dog that has some snap to it like a Nathan's. These were less snappy and more squishy. But the sauerkraut was great! Again, would come back, would like to try more.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "The burgers are very delicious, I ordered a hangover burger, it was a bison patty with a sub for goat cheese and roasted red peppers with red onions and lettuce applewood bacon and a friend egg. Also to compliment the meal along with a side of chili cheese fries  it was very filling and not greasy at all. Service was good and food was excellent.", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Really loved this place. First time trying bison burger and wasn't disappointed. Restaurant was really nice inside and out. The fries were super small but not gonna lie was right on with the burger. Their hot dogs were really good would def go back and try some more.", "author": "Ivan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "We love this place!! When we lived in Cobble Hill Moo burger would always be a staple for us to go for shakes and burgers. It's tough to find quality food of this caliber without being full of artificial junk. We have always felt that Moo Burger always took pride in everything they made and it certainly didn't sacrifice flavor. \n\nThe more impressive story is even after we have moved to Austin Texas, my wife and family make it a point to visit. Not just for the food but the friendly and welcoming staff. Today was no different. Been close to 2 years since our last visit and we still felt like part of the family. Thank you for building a solid community.", "author": "Oliver D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-08", "description": "So, I hate to give these guys such low reviews, but, again, same thing.  The burger was delicious, but for $5 for fries, they just don't give you enough.  Part of it is the packaging, right? And that's definitely a management decision.  Put the burger and fries or the burger and onion rings in one small box so, this way, you are limited on how much of the side you get because it's in the same small container as the burger.  \n\nCut me some slack, here; I don't run a restaurant, but I do have a sense for business.  Potatoes are cheap.  To double the quantity of the order of fries or to increase it by 1.75x would cost you, literally, pennies.  Don't be a penny-pincher -- your burgers are GOOD, that is why it is exceptionally disappointing to notice that you are pinching pennies on fries and onion rings.", "author": "Valentino G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-19", "description": "Came here because we were in the mood for burgers and the place we wanted to go to was closed. \n\nThis is a cute place, and I definitely want to go back to try another item. I had their Bahn Minh burger, and I was very disappointed. They added cilantro and some pickled veggies, but it was not close enough to bring the flavors together. The bun was also extremely soft, which made it fall apart. \n\nThe rest of the group was very happy with their choices. They ordered the following:\n1). Bison Burger\n2). All-American Burger\n3). Salmon Burger\n\nWe also had their fried pickles, which were very oily and soft, and their fries.", "author": "Tahima B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "After we found out that Bareburger had a wait on Sunday afternoon, we walked further down Court Street to Moo Burger. And let me tell you--it's definitely worth it. \n\nWith ample tables and less crowds, Moo Burger has an inviting atmosphere, quick service, and delightfully delicious food. The menu is intensive, with many many burger options (bison, turkey, chicken, veggie, and beef) plus shortrib and pulled pork sandwiches. They have hot dogs, salads, and specials daily.\n\nMy partner ordered a beef burger with fries and I ordered the pulled pork sandwich with onion rings. The onion rings are thick, fluffy and arrive with a side of smoky chipotle mayo. The pulled pork sandwich was EXTREMELY flavorful with nice, juicy pulled pork and spicy coleslaw with pickles. I was impressed by the quality of all the items I tried.\n\nDefinitely worth a visit if you want to enjoy some solid greasy food.", "author": "Maria W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-14", "description": "Good family friendly restaurant, food is typical burgers and fries, owner is super friendly and always talks to the kids, we've been a couple Birthday parties here, great place to bring to the kids.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "This review is for takeout:\n\nMy friend and I stopped in after someone told us this place was AMAZING. Naturally I was excited to dine at a new place in a spot I don't normally trek to. We ordered wings, fries and a turkey burger to go.\n\nMy friend said the turkey burger was not good; it was soggy and we ate it IMMEDIATELY after it was prepared and bagged. The fries were decent but not as crispy as I thought they would be. And the wings.....I love steak tartare and I love buffalo wings but these wings were meh. They weren't your regular bar buffalo wings. They were breaded like fried chicken and not enough sauce which made it bland.\n\nThe best part about this meal was the extra ketchup they gave me to wash all this food down.", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "I have ordered delivery from here a few times and randomly had the chance to dine in. I was with my husband and our two kids (4.5, 15 month old). I very much enjoyed the feeling of this place, it was a lot of darker wood but it felt bright and overall good. Our waitress (Justine) was very attentive and good at catching cue without us having to say anything, so 5 stars for service! There were 4 other \"customers\" this was a weekday early afternoon so pretty mellow. \n\nFood is good, haven't had anything yet that really impressed me, it comes out quick (delivery also) and is delicious and consistent. Milkshakes  are awesome! Will come back for sure.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "I came here with a group on a Monday afternoon and it was pretty empty. We were seated immediately and our waiter was really attentive. The decor is rustic/slight farm house. Casual ambiance. I got the veggie burger and my friend got another (cant remember the name). The veggie burger was good, a little bit spicy. I just wish the patty was firmer. The sandwich kind of fell apart towards the end...didn't stop me from eating it though. Overall a good experience, I'll be back.", "author": "Tamira G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Food was great but wish the mac n cheese burger could be less messy! But ascetically is amazing!!", "author": "Mike P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-27", "description": "My fiancee and I decided to try this place instead of the other burger spot near by. Although the service was very good, the \" burger\" was less than what I was expecting. For $14.00,  the \"small\" patty should come with fries(sides are a separate price) and a better bun. In hindsight, we should have gone to either Bareburger or Nature's Grill.", "author": "M C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "Decent food, a bit pricey -- and skimpy portions on the sides.\n\nDocking a star for bench seats only. Not a comfortable place to sit.\n\nExtra star for bringing out the kids' meal early, for the very hungry kid at our table.", "author": "Carl B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-03", "description": "Will never waste money hear again. The customer service is really subpar. I am a local who has dined at moo burger many times since it opened. Today we placed an order for delivery and the order came surprisingly fast--soon we realized why. We ordered sliders cooked to medium and these were basically raw in the center. There was blood all over the bun. They were barely medium rare. I called and asked for assistance and they argued with me about what medium should like and then told they would send a delivery person to pick up the food because apparently a lot of people are trying to get refunds. Sorry Moo Burger not my problem.  Please take away your food and we won't be back.", "author": "Shannon L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}