{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Yummy yummy yummy!!! Hangover burger was excellent!!! And not only that!! Service and owner was very nice! Went for lunch durning the week. Nice ambiance.", "author": "Nene G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "First off the manager came to my table twice to make sure I was doing well. Got the steakhouse burger with fries (in the pic I included)... It. Was. Perfect! Duvel in the bottle to compliment my burger. I'm happy.", "author": "Dr. Jason T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-28", "description": "After reading all the good reviews I was excited to try this place. Unfortunately I was disappointed in the food. I had a bison burger that I asked for medium. It came out well done and didn't look like a fresh patty at all. It was dripping grease but dry in the middle. I ordered onion rings that were full of grease. I bit Into one and could feel the oil pouring out. Everything lacked flavor/ seasoning.", "author": "Judy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "Good customer service. Chicken burger is tasty and the wait wasn't long at all. Atmosphere is chill and very causal overall a good experience :)", "author": "Jaleesa B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "The corn on cob  is a seasonal  dish. The burgers were good but the fries  we soggy. We had the sweet potatoes fries, zucchini  fries and their chili fries. We were expecting crispy fries but it  was not.  A little  disappointed with their fries.", "author": "Ariel E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "This place has to be the worst burger place I ever tried to eat at they are way overpriced you would swear they are making great burgers for the prices they charge went there today for the second time in a few years forgetting about the first time I was there they sucked then and they suck now ordered their famous moo- less burger which is organic the depiction of the burger sounded good but when it got to the table it smelled like vomit it was drowning in balsamic the most disgusting thing i ever tasted. And to boot my wife ordered the same thing she managed to get two bites in that's it thank God I ordered 2 pieces of corn before those nasty burgers total damage for 2 puces of corn and 2 disgusting burgers no soda just water 40.00 dollars no tip as you can imagine. This place truly sucks I could have had a real burger at Jackson's hole or burger Fi for alot less and really enjoy it", "author": "Oscar R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "Best. Burgers. Ever. Hands down.\n\nThe service was amazing; right when we sat down, we were given a whole bottle filled w/ water so that we can pour it to our own liking. When the water ran out, we got a new bottle without even having to ask. A man--I believe he's the owner--even walked by our table a few times asking how the food was. I'm impressed by their attentiveness. \n\nCourt Street burger - The description reads \"bison patty, wild mushrooms, caramelized onion, baby arugula, and bleu cheese.\" Never tried bison before, so of course I would try a burger w/ bison patty. Normally, you'd taste all the ingredients mixed together, but I got a distinct taste of all the ingredients, from the wild mushrooms to the bleu cheese. It was so soft, juicy, and delicious. Probably the best burger I've ever tried (and I'm a huge fan of burgers).\n\nBrooklyn Chili burger - I didn't try it personally, but my friend looked like he fell in love after taking the first bite, LOL. Said it was the best burger he's ever tasted.\n\nThe onion rings were nice and crispy. The onion slices were also thick, compared to some restaurants that give you little strands of onion.\n\nMost definitely will be back!", "author": "Kim D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-23", "description": "I regularly eat very spicy food, I pour sriracha on everything, and I'm not sure if the chef didn't like the way I looked or if someone I pissed off in middle school got a job there, but the Devil Dog was man vs. food challenge-level spicy. To the point where I couldn't finish it, had to gulp down several glasses of water, got a huge headache that lasted me the night, and felt duped by the lack of red font on the menu or warning from the server. My eyes were pouring tears and the expression on my face was pure panic by the time I was halfway through with that thing. It was not a fun way to spend my time or money when I was trying to have a nice low-key dinner before a movie.\n\nIf you want to have something stupid-spicy on your menu, go for it. Just make it clear to the diner what they're getting into. Never in my life have I had something that unbearable.", "author": "Trevor A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Yum. Great, no frills burgers when you catch a craving and don't want to bother with anything fancy. Very friendly and attentive service. Good space, though it would be nice if they dimmed the lights a bit for dinner. I know it's a burger joint. But still. It's dinner in winter. I'd like it to feel a little cozier. Will likely be back when my next burger craving strikes. \n\nOh, and fried pickles are beautiful and fried to perfection. A nice change of pace from the usual french fries/sweet potato fries. I *may* have warned the waitress not to touch my tray because there was a single pickle remaining, and I was not willing to let that sucker get away undevoured. So, yes, fried pickles.", "author": "Megan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-19", "description": "The place was nice and the service was great and friendly, but the food just didn't do it for me. Everything was just ok. The burger, the shake, the fries, it was just all alright, nothing great. The prices were a little too steep for everything to be just okay. The burgers were $12-14 not including friends and the shake was of a medium size but priced at 8 dollars. I just feel that if I'm going to spend 50 dollars for 2 people for burgers and fries I better enjoy the hell out of them.", "author": "Kayla S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "People keep asking me what's your favorite burger joint in NYC and lately all my usual and favorites have fell off. I am also over the Shake Shack hype. Happened to be in this neighborhood and yelped burger and recognized this name and popped in with no expectations. \n\nWell I was so pleasantly surprised! It was definitely one of the best burgers I've had in NYC in a while!  Loved everything about this place from atmosphere, service, presentation of burger on tray and fries in mini fryer.  Then there is the amazing quality of meat and rustic handcut style crispy fries. Also if you are debating if you should add anything to your burger....it must have to be the applewood smoked bacon!", "author": "Shefalee P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "So glad to hear that this place is opened up again after being closed down temporarily for renovations. The new Mac and cheese burger was amazing to! Definitely a classic burger spot. The environment is amazing and food is even better. I even had the pleasure to be served by the owner himself. A very great guy who runs an amazing business. This restaurant is 10x better then bare burger a few blocks up. HIGHLY RECOMMEND this place if your ever in the area!", "author": "Julian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Great spot! Ordered the moo mystery juice. It was lemonade with a strawberry compote inside. Amazing. Hangover burger was good as well. Got the moo fries. They were ok. Enjoyed the corn on the cob app special today", "author": "Erdal A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-25", "description": "Yelpers rarely steer me wrong, but in this case they did. The burger was small and overcooked. The portion of \"zucchini fries\" was literally nine little pieces of fried zucchini. (I took a photo and added it to the MooBurger photos, if you'd like to see). Grand total=$25.04. Ripoff. I don't mind paying a bit more for great food. This is not great food.\n\nHands down, the best burger in the neighborhood is Prime Meats. I order it to-go. Yes, it costs more. But it's literally 10 times better and it comes with fries.", "author": "Asparagus S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-28", "description": "I have been ordering turkey burger on wheat bun with zucchini fries since 2012. It's a whole experience!\n\nA turkey burger won't stuff you like a Thanksgiving turkey but this should leave you satisfied to some extent. Add mushrooms and you are good! I've got not much to say about zucchini fries other than they are just crunchy and not as greasy as Mcfries. Side of ranch is ok but I like them more with thousand Island.\n\nCustomer service matches burgers. It's not the greatest but you can expect it to be good. I was greeted upon entrance and thanked as I left.", "author": "Lindsay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "OMG... Five stars for the food! \n\nBest burgers in all of Brooklyn, yes that's what I just said. \n\nYou can order chili and cheese on their fries, though it's not on the menu, and they just melt in your mouth! i've tried the chicken gravy burger and their regular with Moo sauce. Doesn't matter what you order it's more than satisfying. \n\nFour stars for their beer selection being just okay and hate to be a snob, but they don't have wine glasses and I hate drinking wine out of a tumbler.. i know I hate me for it too, but trust this wino, it makes a difference. \n\nDespite the drink selection, I love eating here, the service is so nice and the food never fails!", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "I  this place! The mac and cheese balls are to die for.   My husband and daughter love the peanut butter and jelly milk shake. The burgers are outstanding!", "author": "Vanessa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "Love this place. It's great for families! Their Moo Burger with that special sauce tastes exactly like a big mac...except, it's a healthier, tastier version! \n\nThe salads are deelish too, as are the drinks. Just overall awesome burger joint.", "author": "Simona G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "This was an amazing restaurant with great service and food, which is very hard to find. I went with a party of three and none of us had any complaints. The staff was very helpful and friendly and suggested a pumpkin milkshake that was so delicious.", "author": "Nikki Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Seriously one of the BEST burger spots I've ever been to! The food, the ambiance, the service all incredible!!!", "author": "Joslynn E."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}