{"aggregateRating": {"reviewCount": 438, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-13", "description": "Sadly, was disappointed. The meat quality is definitely superior however we waited 45 min for a burger. They also got the order wrong and the fries were cold. Maybe they're still figuring things out...", "author": "j U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-12", "description": "Everyone run, don't walk (sorry, too many obnoxious brokers on this year's apt. hunt saying this) to Moo Burger!\n\nYet another reason to move to Brooklyn.  Manhattan is so over.  Moo Burger served us the BEST burger we have had in a long time.   Not only was the quality meat expertly cooked, but the bun was fresh and not stale.\n\nMost notably, the vegetables, which most establishments seem to overlook, were AMAZING.   \n\nThe red onion was thinly shaved in piled in several layers so you could enjoy their crisp flavor without being underwhelmed by one thin miserly slice, or an overly thick slice that leaves you with onion breath.    \n\nThe tomato: perfect thickness.  Not so thick that the whole thing comes out when you bite into the burger, but thick enough you taste it.  \n\nThe lettuce: we always ask for no lettuce not because we don't like it.  But because we get tired of slimy, wilted, not well washed lettuce, or those humongous gargantuan chunks of lettuce that the just give you that would be better used as plates for a tuna salad.  We took a chance with Moo and we were rewarded.  Thinly shredded lettuce, fresh and crisp, piled not too high as if they are trying to make up for a small patty.  \n\nWith each bite, you get the right amount of lettuce, onion and tomato and you are not struggling to keep onion and tomato in place.  This attention to detail is something that we don't take from granted, considering it's been so long since we've been to an establishment that gets it right.\n\nFood, ambience, service were all something we rarely experience in Manhattan.   \nI could go into the ambience and service, and take up another 2 pages, but suffice it to say everyone was super attentive and friendly.  Also, the decor and seating is spacious, interior sparkling clean, and extremely tasteful.   \n\nHopefully the next time we go in the near future, we will still be able to get seats.  Because this place deserves to be packed.", "author": "JK L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "My first bite into their burger actually tasted like heaven. I've taken guests there a number of times, the service is great and very friendly. Occasionally there are a lot of baby strollers and screaming kids.  The only thing i wouldn't eat again is the Bánh mì burger, but everything else is DELISH!", "author": "Edvin L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-27", "description": "Overprice yuppie burgers basically. Great for idiots with no concept of taste. Induces weird ass dreams. And priced at I-Have-a-Rich-Mommy levels. How do you serve burgers for 14 bucks with no side? Every diner in Brooklyn with a deluxe menu wants a word with you...I suspect you're paying extra for organic which I couldn't give a damn about.", "author": "Melanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "My family and I just visited Brooklyn and decided to try Moo Burger.  It was GREAT!  The burgers and fries were so tasty and cooked to perfection.  We will definitely visit again when we return to the Brooklyn area.  BTW, I ordered \"The Hangover\" burger and it was superb!", "author": "Gil H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "I was driving down court St looking for some place to eat and the Moo Burger\nAwning caught my eye.  I then looked them up on Yelp and read all of your glowing reviews.  Well they were worth it!\n\nI just had the Court St Burger and it was great.  1st time having a bison burger and definitely won't be my last.\n\nThe server and the owner were very friendly.\n\nDefinitely won't mind trekking from Jersey for a return trip\n  It is a little pricey, but o don't eat burgers often so that isn't an issue for me", "author": "P B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-20", "description": "I have been coming to this place since it opened.  I live in the area.  When this place first opened up, it was a gem: high quality burgers, fresh ingredients,  great service and nice atmosphere.\n\nUnfortunately, since this place has gotten very popular, management has gotten lazy, as all that is left is a nice atmosphere (except the screaming babies).\n\nLet me start with the food.  Except for the first two times I have been here, their buns were the first thing to degrade.  Stale, flavorless, and just overall not tasty.  Sadly, this trend has turned toward its central ingredient.  You would expect that a $14 burger would have the most juicy tasty patty.  Nope.  They are flat, dry and on the verge of flavorless.  So unless you like the feel of tough meat with little flavor in your mouth, skip out on the burgers....ohh wait their main dish is burgers.\n\nLets now talk about their service.  This place used to feel personal now it feels like Friendly's 2.0 (and this is in reference to the horrible food chain that we grew up with).  This place is a factory.  Now the servers run through the motions.  Rushing you as you eat.  PLacing down the check right after you finished your meal even though they have not asked you \"Ohh, would you care for another drink or maybe some dessert?\"  Nope, it is just menu, beer, food, check, rinse, repeat.  Worst of all, when you are drinking a beer and a waitress leans over to places the food of the table next to you down and her hair brushes all over your neck and face, you would at least expect a \"whoops, apologies\".  Instead, no recognition.  This is not a strip club people, it is a burger joint.\n\nLook I love the high end burger concept.  That a burger can be more than just a 1/4 lber, lettuce, ketchup and a bun.  But if Moo Burger does not pick up its act, people will begin to notice that the quality has decreased massively.  If you have ever eaten at a Unami Burger, you will be appalled at how badly this place NOW stacks up to this.\n\nMoo Burger, I miss what you used to be.  Please be tasty again.  Boo.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "This place simply gets it right, quality finger food in a great neighborhood and the prices are affordable , ambience is what you expect in a burger joint, the staff and service is prompt, just go ..", "author": "Arturo M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-18", "description": "HORRIBLE\n\nTHEY have no clue how to make a veggie burger.....\n\nTOTAL GARBAGE SPOT...\n\nExtremely overpriced....better off going down the street to ShakeShack.", "author": "Jigar S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-27", "description": "Went here with a friend for lunch and the service was great. I ordered the Nova Scotia (salmon burger) and sweet potato fries (my absolute favorite snack) the first time and was really pleased. The burger was really good but the fries were okay. Would definitely come back!", "author": "Mary S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-21", "description": "Children are all but encouraged to scream, misbehave and be rude. Mooburger is quite a frustrating place to spend any amount of time (even the time to eat a burger).\n\nWaiter service is average, or even slightly above.\n\nThe food is of quality, and unlike other reviewers, I appreciate that fries and other burger accessories are not mandatory.", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "I love Moo Burger! The inner decor is like a trendy dim-lit bar, great for dates(booths with personal dividers), and big groups of friends.  It has a classy feel to it even though you are actually even organic meats that can basically be labeled as comfort food. They have drinks in case you wanted some libations-beers, homemade lemonade, and cider.  If you are a carnivore, then you too might enjoy food here.  Their burgers are really good.  They are juicy and they come in big portion.  I think you can get one burger and call it a day.  I have to say that they have one of the best combinations of toppings on their hot dogs (and their burgers, too)!  If you get the hot dog option, then notice that it comes with two hot dogs.  That is a lot of food for what I once thought was a small belly that I once had.  I have to say that the service is excellent. I never really have to wait to get a table.  Maybe because I come after 8 pm?  I get out of work late.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-19", "description": "I've got a dairy allergy. Think cream, butter, cheese, milk, yogurt--for most people, delicious, but for me, extreme badness. \n\nWhen I eat out, restaurants usually understand what \"dairy allergy\" means and do a great job of working around it. They help me figure out/avoid problem ingredients, and I put in a healthy tip to say, \"I know my dietary issues can be a pain in the ass, and you did killer job of saving me from awfulness. Thanks.\"\n\nRemember how I said most restaurants are great about the allergy thing? Not so much with MooBurger.\n\nGirl on the phone taking my order: I get that you're way more interested in your August-appropriate knit cap than my possible anaphylaxis, but could you maybe pretend like you give the tiniest of shits? I'm wondering partly for your benefit, because at some point, you'll probably deal with a something-allergic customer who's not as used to asking questions as I am. And when you don't care about finding out whether or not the dish they want has gluten/shellfish/nuts/wheat/egg/milk/whatever in it, and the customer gets really sick, and you wind up with a major lawsuit on your hands? Your managers are probably going to be pretty pissed.\n\nThe fact that you didn't feel like helping me at all, that you were uninterested in asking the chef any questions on my behalf (\"I dunno...maybe our wheat buns have milk or butter in them, but if they do, I bet it's only a little\"), or that you didn't get why butter on the bun might be evil for me? I don't know. I'm going to give you the benefit of the doubt and assume you were having a bad day because your tall bike was in the shop. Still, you should probably be more invested in those things as both a law-suit-averse server and as a human.\n\nAdd in a wholly mediocre burger prepared at the wrong temp--I asked for medium rare, and got super rare instead--and crazy overpricing, and I think I'm done here. But good luck with your DJ career, phone order girl. I hope you're better at that job than this one.", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "Randomly came across this while visiting Brooklyn and fell in love with this place. Cute set up, and the two burgers we had were amazing. I had the turkey burger and i wish i could have had 5. My boyfriend said the pulled pork burger was the best he'd ever have. I would definitely make it a point to go again when i'm in the area.", "author": "Kristen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-12", "description": "Not ready for prime time.  Maybe it's because the restaurant is still relatively new or the expectations too high.  \n\nWent with a party of 5 on a Saturday and the restaurant was moderately busy, but somehow the kitchen still managed to mix up everyone's orders (not an exaggeration).  I appreciate the focus on organic (that and that the decor seem to distinguish the restaurant from 5 Guys up the block), but to be honest the burgers just weren't that good considering the price point.  Maybe $13 justifies organic ingredients (you'll have to be your own judge).  My wife also found 3 chunks of gristle in her burger.  Overall a bit disappointing.  For our group 4/5 probably won't be making the trip to Moo Burger again.", "author": "Chris O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "Happiness is a warm bun.  One of my new favorite burgers in NYC.  I last had their burger two weeks ago, and I have been craving another one every day since.  If you like a little spice, I recommend getting a side of jalapenos to put on top.  Moo pickles them in-house, and they are addictive all on their own.  Only reservation I have is the onion rings, which are bland and bready.  Get the delicious sweet potato fries instead!", "author": "Carter P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-03", "description": "Deliciously yummy and fresh salmon burger.\n\nSweet potato fries with HONEY sauce (talk about fattening but oh so good!). Wish they gave a bigger serving of fries...\n\nGood selection of beers.\n\nWas surprised that it's a full restaurant since I thought it was more of a burger joint (like Five Guys type). Good decor and set up.\n\nMy waitress was friendly and attentive and so was the manager who went to every table to say hello at some point.\n\nToo many little kids for my liking, but hey, it's Cobble Hill.\n\nDefinitely going here again, especially when going to the Cobble Hill theater.", "author": "C J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "With the recent trend of gourmet burgers these past few years, everyone has their own 'best burger' preference. Many myself included have ventured to these 'best burger' places to give our very own assessment. I'm sure the chefs/owners of Moo burger had the vision of making Moo burger the 'best burger' for many. They may have suceeded with a rather different approach and definitely suceeded in becoming a local staple for the neighborhood. \n\nI've been to Moo Burger twice now and both times I was welcomed with a friendly staff. I ordered the Hangover burger, fried mac \u0026 cheese, and a Moo Thunder beer on my first visit. Contradictory to many other gourmet burgers I've had where the main focal point was the taste of the patty, it appears that Moo burger's approach would be the complete taste of all the combined ingredients of the entire burger. All of the flavors and content in the Hangover burger tasted like a perfect complimentary where no item over powered the other. The fried mac \u0026 cheese was good but I did wish the mac \u0026 cheese was bit more gooey. \nOn my second vist I ordered the Moo hotdogs which is served with 2 hot dogs. Normally, I wouldn't be ordering a hotdog for a meal and when I do I'd expect the price to be comparable to Gray's Papaya. BUT I was drawn by the content of pulled bbq pork and cole slaw that was the topping on the hotdogs. This was one of the BEST hotdogs I've ever had! It was so complete and tasty that I didn't even bother with the french fries or onion rings that was ordered. I just sat there content and satisfied with my meal (picture Homer Simpson with eyes half open and mouth dropped jawed). But be warned, the hotdogs can get messy if you plan on eating it with your hands, let's just say it wasn't a pretty site until I came to the realization that my counterpart was staring at me in disgust! I managed to save my dignity by using the fork and knife (yes a fork and knife) to finish the rest of my meal, just make sure when you are using the utensils that you have some cole slaw, pulled pork, hot dog, and bun with every bite.\n\nEveryone will still have their opinion on which place has the 'best burger' but I highly recommend that you give this place a try without any expectations and from there you'll have that much better of an experience at this place.", "author": "Rich W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-09", "description": "I went here with a couple of friend when we were in the neighborhood.  I ordered the greek burger and we split a side of fried pickles and fried macaroni and cheese (called MC from here on out}.  The burger was good.  Juicy, flavorful and a decent size.  I do not eat fried pickles, but my friends seemed to love them.\n\nThe fried MC was a huge disappointment.  While the MC was perfectly fine, the sauce that was placed on the plate underneath the fried MC balls was absolutly disgusting.  I think that maybe they were trying to go for a ketchup and MC combination, but I don't know of anyone who actually thinks that's good.  I ended up scooping out the MC from the fried shell because the outside was covered with the sauce it and I could not eat it.  Maybe I'm just picky and people actually do like that combination of ketchup and MC, but to me, it was such a waste of $6.\n\nOther than that, the burgers were good.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "I had the turkey burger, and sweet potato fries.  It was decent, nothing special.", "author": "Natasha W."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Moo Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "240 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/MO9rBj2HScjITZhTaB13Qw/ls.jpg", "@type": "Restaurant", "telephone": "+17182468259"}