{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "the quality of the food is great - i love their calamari, fried dumplings, and curry dishes\nreasonably priced! the ambiance is very relaxing\nthe food always arrives on time\ni love their margaritas (2 for 1 during happy hour) especially the lychee flavor", "author": "Ayida V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "Ordered via delivery.com over an hour ago, so I tried to call Lemongrass. For 15 minutes, no one picked up. Now I am in delivery limbo! Do I cancel the order, or hope they will eventually come! Stay away from this place.", "author": "Alison B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "I tried their lunch special and it was a good amount of food. I was full after eating it. However the Pad See Ew was overly sauced. It may just be a preference of mine for there to be a great sauce to noodle ratio. But all in all it was good. The food was also delivered in a reasonable time.", "author": "Patrice G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-06", "description": "This place does not have wifi but they tell u that they use Starbucks wifi\nSo the closer u sit to the window the better. The mango shrimp ,pad Thai ,grilled wings are all good.", "author": "Marsha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "Came here on a whim before getting groceries at Trader Joe's down the street. \n\nFood was incredibly tasty; I had the vegetarian green curry and my boyfriend had the mango shrimp - total came to just over $30. It wasn't busy when we were eating, but the staff were efficient and pleasant and the portions very generous.\n\nI really liked the buddha decor and the pillows along the bench were nice touches - as a Canadian I could have done without the Celine Dion playlist though!!", "author": "Lindsey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "I love this place. For a lunch special they give you salad with a wonton, dumping and spring roll. Also a good portioned main dish with a free drink. ALL UNDER $10. The employees are fast and friendly. I love my server (her name begins with an M and she wears her hat backwards). She always greets me with a big smile and a cheerful attitude.?", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-07", "description": "We ordered in last night \u0026 we're totally disappointed. My husband and I both ordered Green Curry with chicken, which we've had many times before at other restaurants, but this was the worst! The worst smell you can imagine overcame us when we opened the bag and the taste wasn't much better. I would highly recommend NOT ordering green curry from here. Our friends ordered the red curry and some pad Thai, which was good but save yourself and don't get the green curry!", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Great, nice, decent, no nonsense spot. Love it! Great in particular for lunch and take out. Never had an issue.", "author": "Damiano D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "This is a great restaurant with fresh food and great flavor! It also has excellent service and I always promote a good business. Please feel free to check out Barnett Catering at In the Zone located in Ozone Park! For more info call us 347-425-0136", "author": "Barnett C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-13", "description": "On\nSeamless.\nJoya is\nBetter but when\nJoya lines are an hour then go here.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "Really enjoyed my meal here. The pork chop and pad Thai was delicious. It was somewhat busy so it wasn't the fastest service but the quality of food more than made up for it. The wine I ordered was also quite tasty. We will definitely be returning and ordering seamless from in the future.", "author": "Allison J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "The food was absolutely amazing! It had so much flavor and the service was pretty good. Not to mention the 2 for 1 drinks!!!!", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "I visited this restaurant yesterday with my family and it was ssoooo gooddd! Omg the leech mojito was everything! the food was also amazing. I had the calamari salad as an appetizer and my family and I shared as it was a large portion and it was great. I also had the shrimp woonsen and that was amazing too! It was 5 of us and the bill was not as crazy considering that most of us ordered drinks and multiple courses. I highly suggest this restaurant.", "author": "Sunny D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "I truly LOVE this place! I usually eat here at least once a week. To avoid the extra tip and the $10 minimum for delivery orders, just call the restaurant directly to place your order. \n\nThey always hook me up with free Edamame and water :) YUM!", "author": "Aja F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-20", "description": "AVOID LIKE THE PLAGUE: Ghastly take-out food if you can call the slop we had food.  Worse yet, the order taker understood English so poorly that three of the things we ordered were wrong.  Thai tea became fried ice-cream - an absolutely disgusting gelatinous mess  hidden within  a greasy package of overcooked batter. Ugggg!  Duck curry became deep fried bits of duck on top of a tasteless \"medley\" of large bits of over-cooked carrot, cabbage and onion with a side-order of tamarind sauce.  When we returned it we were told duck curry is fried duck with some curry sauce poured over it. They offered to substitute a side of this sauce for the tamarind one!!!  The green salad mysteriously never appeared - though they didn't charge for it to be fair.  The shrimp with lemongrass dish was basically tasteless horribly over-cooked shrimp (tail left on) in a gooey sauce with limp overcooked vegetables of some kind.  The chicken in orange sauce was.... Yes you guessed it... Bits of deep fried chicken with a bland vaguely orangey sauce poured over it. The Thai  oxtail dish was beyond revolting with large slices of the chopped up tail of an ox with a minuscule amount of meat on them - all swimming in grease, solid bits of fat and the familiar overcooked bits of vegetable matter.  All this for $104 of which maybe $10 was barely edible.  Walk down Court Street to Joya - it's 100 times better AND cheaper.", "author": "Dean K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-02", "description": "Good experience with delivery a couple weeks ago, but not a lot of value if you can put food away like a competitive eater.\n\nWe ordered a curry dish and a rice dish and a large soup to share.\n\nThings were well thought out with the curry and the noodles, etc arriving in separate containers. Everything travels better that way and you get to combine to your own liking.\n\nThe food was pretty typical Thai, nothing really extraordinary, and the portions were real small. \n\nGranted, I have a really big hand, but the entire curry dish could have fit in my palm.\n\nI have not tried all the Thai offerings in the nabe yet, but so far I like the food at Joya better.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "My favorite Thai place in Bk...they never fail to disappoint!", "author": "Jeanelle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "To be real it's a chain restaurant to asian cuisine and done well at a very handsome price not unlike what UNOs is to Italian American fare. It's always solid quality with  not much fanfare at a very reasonable price, to say it sucks is just plane snooty talk, and to refer to it has great Asian (not just Thai mind you) is a lil over stating it, well I'd say well over stating it lol. It fills the nook well and deserves a seriouse consideration for a decently pleasing if not surprisingly tasty experience. It doesn't have that fun feeling of finding a great dive in some secret onclave of china town nor that high end feel of transportation to busy bustling Hong Kong rooftop restaurants that rotate high atop high rises with encompassing fire work shows.\nIt is what it' is and I appreciate it for that.\nA nice lunch or dinner spot at any time it is, a date nite sexy spot it's not.\nPlain \u0026 Simple!", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "The ambiance is lovely...really intimate. The wait staff are superb. The food was great. I like that even though the venue is small you still feel secluded and in your own space. Conversations are easy to have, no screaming or yelling to hear the person across from you. Food is reasonably priced too! Will surely go back again! Love that it's kitchen is open later than a few other restaurants in the area!", "author": "Sherry S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "This is quickly becoming my new lunch spot! The lunch specials are very well priced and they all are really well made. The Hostess is always incredibly nice to me as well. I've never had a bad experience here at all and if you're in Brooklyn looking for a good Thai restaurant then please give it a try. The Panang Curry and The Pad Thai are perfect every time!", "author": "Chris E."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}