{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-07", "description": "Ordered Seamless from this establishment recently. Took almost 1 hour plus to arrive. When I called in around 1 hour to check in the lady did not seem to have much of an excuse asides from the delivery man is on the way.\n\nThe food was overall okay, I got drunken noodles. Compared to other places I've had it was not that good.\n\nThey did throw in a free Thai iced which tasted really good.\n\nWouldn't really recommend this spot to others. There are better Thai restaurants out there than this one.", "author": "Viren G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "This is the second time we went here and I truly like the place. What I love the most is their entree: they have a wide variety of options: curry, noodle, fried rice, and grilled meats. All the grilled meats served with rice that you can choose from jasmine rice, sticky rice, and brown rice. I strongly recommended the Thai Fried Rice!!!! Guys, it will not disappoint you because the rice itself is mixed with pineapple so while enjoying the rice, you get a sweet taste of pineapple along w/ the duck, which makes it a great blend. In addition, its appearance is great in detail in a huge pineapple boat, excellent for IG pictures.\n\nHowever, in terms of dessert, their menu lack of options. For a Thai restaurant, it needs to develop more Thai desserts but not stuck in the safe options like chocolate lava cake with ice cream, which we can get from any American restaurant.\n\nTIPS: Most of the appetizers are pre-made so you couldn't change what's inside. Don't order them if you don't eat any of the ingredients in them.", "author": "Bingdi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "The shrimp pad Thai is my favorite. I keep telling myself I'll try something different but find myself getting it again. It's just the thing to get when I go there .\nI've been to lemongrass grill a few times and have no complaints.\nStaff is polite and service was good . Not a long wait. Hassle getting parking but I'll visit again.", "author": "Demora F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "Best Thai restaurant in NY! The food is always well prepared and the flavors are amazinggg! Love that they have a lunch special and the staff are friendly. The food is always on point.", "author": "Lana H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "A friend of mine took me to this place and the food was delicious. Especially the fried calamari was great, it was soft and not greasy. And they have very reasonable prices.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-21", "description": "Food was heavy, salty, watery, over cooked, and bland. Not like anything I've had in Thailand. More like mediocre Chinese food in flavor and preparation. Not terrible but not worth ordering again.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "I was seated immediately upon my arrival but had to wait for my date no one came over to take or ask if i wanted to place a drink order while i waited other than that once my date arrived it was smooth sailing food orders came out fast drink was good and strong decor is regular super causal spot. Food was delish!", "author": "Oneka B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Really more of a 3.5. I ordered the grilled pork chops, Chinese broccoli and the chicken satay. What I didn't realize was that I'd also receive a free ice tea and a free beef pad Thai! The tea was great and the pad Thai I haven't gotten too. The pork chop was really good and had obviously been picked up and delivered in a timely manner as it was still crispy where it should be and juicy where it should be, rather than soggy which can happen. Overall it was better than average but didn't blow me away. Definitely give it a try, probably won't let you down!", "author": "Adam L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-09", "description": "I am absolutely disgusted right now. As I was just eating my drunken noodles I felt something hard in my mouth and when I spit it out because obviously there shouldn't be anything hard in drunken noodles, much to my disgust it was what appears to be a human nail. What's even more disturbing is that I was halfway done with my meal so God only knows what else was inside. I literally feel nauseous. Usually I go to Lantern on Montague but today I felt like trying Lemongrass which was clearly a HORRIBLE IDEA!", "author": "Makeda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "My friend and I went there for lunch today was recommended by friends. We tried to order take out but decide dine in cause seeing many people there during lunch time must be something good about this place.   Friendly staff and fast service.  It took them less than 10 min for our order to be served on the table.  Food was hot and fresh out of wok.  We ordered lunch which comes with appetizer and drink was really a good deal.  Pad Thai was good not as sour as other Thai place.  Kee Mao was hot and spicy but not too oily.  We will come back to try other dishes as well.  This restaurant is the best place to dine in instead of order out or delivery cause food maybe taste differently when take a while to delivery.", "author": "Vienna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "This place is amazing!!! I love the food, it was very delicious.our waiter was also very friendly. They have a drink special with that is buy one get one free and they are very strong .", "author": "Curetta R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "Loved my meal during the lunch special! Ordered chicken pad Thai with a free Thai tea. Definitely plan on revisiting during my next trip to Brooklyn.", "author": "Joshua W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "I've ordered takeout here many times. Their food is always fresh and delicious. I highly recommend this restaurant for great Thai food. I also love their Thai iced tea!", "author": "Sydney K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "I always have a good time when I come to Lemongrass Grill. It's the kind of place that you kind of just stumble upon and decide to try it because you are feeling adventurous. No worries you will leave feeling satisfied.\n\nEverything that I have tried has been delicious. I start off with an order of extra crispy fried calamari with spicy chili sauce instead of the sweet sauce that comes with it. I usually opt for rice over noodles when it comes to ordering my entree. \n\nThe drinks are always strong and the last time that I visited on a Friday they had a 2-for-1 offer on drinks. The service was attentive without being overbearing. I always leave room for dessert which hits the spot. \n\nI love this place which means a lot because Thai is never my first choice when choosing where to eat!", "author": "Cassie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "The food was good but my one complaint was the rude waitress that we had she was impatient, sucking her teeth, whispering under her breath, making rude facial expression. As well as slamming the checks on our table and crumpling them, and rushing us to leave. She was the one with the long pony tail.", "author": "Candy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "I've been here many times and the staff is Always polite ! Last night 3/5 around 6:30..7:00 pm I went and the waiter was very nice! My food was great ! I ordered Thai fried rice with shrimps and spring rolls . Overall I love lemongrass !", "author": "Nyasha S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-05", "description": "This was the worst restaurant they asked me for ID twice for my drinks and they made me feel uncomfortable especially that I'm 32 years old, old there was no A.C. and the lady lady was rude I felt rushed out and I didn't feel like a welcomed guest I will not be returning here ever again. And the lady slammed my check on the table", "author": "Keima B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-22", "description": "Really good food. Great lunch specials! My only complaint is this one nasty impatient waitress. Not the one with the short hair. She's great. But the one with the long hair, typically in a pony tail. She's very rude to the customers. I'm guessing she's overwhelmed by the volume of customers and they do get busy. She doesn't explain the menu well and seems aggravated when you ask about the dishes. On one of our visits she mistakenly gives us the wrong order. She proceeds to debate us on the food order unwilling to concede that she made a mistake. We finally just decided to stay with the wrong order and let it go. And after all that verbal chatter she says, it's ok I'll change the dish. We of course declined, because she was visibly annoyed about the whole incident. Sorry, honey you're not about to take this dish back and bring us an angry dish! Who knows what she'll do to it back in the kitchen. Just very rude. Management should really address her bedside manner.", "author": "Miguel Á."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "I've been coming to lemongrass for about 4 years now and each time it's been great service and even better food. I typically get the Thai fried rice which is served in a pineapple and is very filling and delicious. Some places are skimp with the amount of chicken or shrimp but lemongrass definitely gives you a good portion. I love getting the lemongrass wings and fries Calamari from the appetizer menu. Wings are juicy with a delicious glaze and the Calamari is fried to perfection! \n\nThey have a 2 for 1 happy hour for drinks which is awesome because drinks are cheap and strong!  The mango margarita and the mojito are my go to drinks, and honestly you can't go wrong with anything that's 2for1. I've been to lemongrass for lunch and for dinner and it has yet to disappoint.", "author": "Robin T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-22", "description": "Lemongrass disappointed me one too many times. It's just not on the same level as the other Thai places in the neighborhood. Last night I ordered a meal to go. They were busy when I came to pick it up and had to wait a few more minutes. When I opened it at home, half of the order was wrong. The fresh basil fried rice was with beef instead of chicken. (I don't eat beef). They also added a Thai coffee which I had not ordered. My husband and I didn't want to go back out to exchange the food for the correct order so he ate the fried rice dish with rice which was way too dry. My pad see ew was also sub-par. We ended up tossing the whole thing and cooking at home. I doubt I'll be ordering from there again.", "author": "Lana V."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}