{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Lunch!!!\nWhat a great deal!\nIncludes apps and a tai ice tea all for less than $10.\nAnd the fact it taste great!\nHighly recommend for lunch and will come back for dinner.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Their food is so amazing. Everytime I eat here I am always satisfied. It doesnt matter what I order off the menu it is always well made and presented properly. I was introduced to my plum wine addiction here. I love this place. Definitely great service. What I love about this place is the quality of flavors and the artistry they choose to put in their foods. You have to stop by if you are in the area. You won't be disappointed.", "author": "Monique G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-10", "description": "Tonight is the fourth time I have ordered from lemongrass and had a terrible delivery experience all four times.\n\nThe delivery always takes much longer than they say it will, and when I called they lied about when the delivery man left. I will never order from them again. There are plenty of more reliable thai restaurants on seamless. \n\nI would eat in the restaurant but I would never get takeout from there again.", "author": "V P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "Excellent! !!!!! Excellent! !!!!!! Excellent! My gurlz...took me here for my birthday the gurb..\nWas on point....fried calamari. .lemongrass grill chicken..pineapple fried rice...deep fried duck..happy hour 4-10pm buy 1 get 1 free on a Saturday nite.. I definitely will be back!!!!!", "author": "Cruummbs C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "I just became a total fan of this place! \n\nOrdered a veggie pad see ew and asked for only spring rolls as my complimentary appetizer. Opened my lunch bag and found a container of thai ice tea and a small salad. Thought I was mistakenly given someone else's lunch order, nope - the drink comes free! \n\nLunch was delicious and enough for almost 2 for only $8.75! Lemongrass Grill, you'll be seeing more of me and my screaming toddler at lunch =)", "author": "Ko L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Best Thai place in the area! The chicken pad thai is delicious as well as their lemongrass wings for an appetizer. Also, the service is great, the waiters and waitresses were so polite. Definitely give this spot a try!", "author": "Megan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Had lunch special here several times, all I can say is that the food is absolutely amazing!! Took my girl friend who is visiting from out of town and she loved the food as well. Lunch special consists of an entree, appetizer, salad and drink all for the amazing low price of $7.95. What more can I possibly ask for. In Brooklyn these days, food is so overrated and ridiculously priced. All the staff were very nice, I would highly recommend Lemongrass Grill. If you are down town Brooklyn next to Trader Joe's and hungry, hey stop by this spot!! You won't be disappointed.", "author": "Charmaine V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "The pineapple fried rice was ok, good customer service I didn't like the interior design way too dark.", "author": "MuMu M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "My boyfriend and I eat at this place more often than I like to admit, only because admitting it would make us sound really lazy.  We're not lazy, just busy.  Sware.  We have eaten in the restaurant and ordered take out.  The staff is incredibly nice.  The food is always fast and sometimes at the end of a really long day, that is really the most important thing.  My favorite is the panang curry with tofu and I appreciate that they make it not too spicy as per my request.  My boo likes the pork chop dinner.  When we feel like pigging out, we get the crab rangoon.  I don't know what that is, if it even has crab in it or if it's even a typical Thai dish but it definitely satisfies your inner fat kid.  We never order drinks because they look like they are blue and green and that scares me.  I do see lots of people drinking though, if that means anything.\n\nAll in all, a good, quick dinner spot for those lazy, non-cooking nights.", "author": "Kathleen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Great food can't complain. Service is wonderful, server very attentive and proper. Beautiful spices and nice setting. It's no high end but for the price it's diffidently a bargain.", "author": "John M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "Literally used to love this place last summer. Honestly it wasn't it's best, calamari was soggy literally felt steamed instead of fried and the sauce that I didn't want actually split on half of tray. Wings was bland and tasted brunt like was left on grill too long, so it was totally a waste of my 20$.", "author": "Shartell M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-10", "description": "First time visiting here since Joya was too crowded. The food was very good and on par with other Lemongrass Grill restaurants in Manhattan. The pad thai with duck was especially good -- the crispy duck was served breaded and re-deep fried, which I've never seen before but was so good!! Pad see ew that my girlfriend ordered was good too. We also got the duck roll as an appetizer. They also have a full bar and had wine/beer specials, but we didn't order anything that night.\n\nDecor was simple and restaurant was clean. Perfect for a casual meal! Will be back.", "author": "Spencer L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "Well I came to this Restaurant becsuse I treated my family to dinner, it was my sisters birthday and she loves Thai Food.. They catered to our party of 8 without much delay and the Staff was Fairly pleasent. My sisters Ordered Drinks, which they were unsatisfied with but the staff quickly replaced them with an appropriate substitute. .The food is what had me.. The food is Fresh,  comes out reasonably fast,  and absolutely delicious. . I told myself I would make a return trip soon..", "author": "Lorenzo J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "I lived in bangkok for 3 years and this the most authentic Thai restaurant I have been in NYC.", "author": "Simone D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Came here again on a Sunday evening and took advantage of the buy 1 get w free happy hour special and boy oh boy be careful with the drinks 2 is enough for a buzz they are super strong ! I recommend the apple martini! As for the food honestly everything I've eaten here was delicious we had short ribs, calamari, wontons, pineapple thai fried rice everything was tasty. Ive posted all I've had from here on my insta food page \"eatwithessy\"", "author": "Esther E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-17", "description": "Make sure your credit/debit card has a chip, or bring cash!!!! Food was good, but service was rushed!!", "author": "Ashana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "My 3rd  thai favorite food after pad thai, massaman curry. ..it's pineapples  fried rice. ..", "author": "Kia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "I've always had a good experience here. The veggies are good. Nice and fresh. \nThey bring out the fish on a mini boat, which is super cool. \nIts good for if you want to meet with a group of friends.\nThey are very attentive and the service is friendly. \nI cannot speak for their delivery, as I've never ordered.  \nYou can't beat the price and the area. You can walk over your meal while visiting all the boutiques.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "After all the search in the world for the best affordable thai restaurant .. Lemongrass Grill top my list. I was very disappointed when Lemongrass Grill lost business in the Lower East Manhattan, until I came across this one in Brooklyn! Great people and great atmosphere. Love the food! Definitely will be bringing more ppl at this location.", "author": "Norah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "I love the curry puffs and the chicken pad thai. The service, here, is great as well. I usually go here for lunch, and the pad thai (among other great selections) is a part of the lunch menu, which has a \"lunch special\" price. Definitely, this is one of my favorite lunch spot in the area.", "author": "Nadia C."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}