{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "Customer service here is awesome. Warm, welcoming staff when you walk in. The ambiance is clean and not overwhelming. \n\nCream cheese crab wontons are the best. EVER. Panang was delicious and spicy! The ribs and the chicken were also on point! \n\nService was quick, food was hot and tasty, and we were never left waiting! Definitely a great place to get your Thai fix!", "author": "Allison N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-23", "description": "I was pretty disapointed with my food yesterday..I ordered the chicken pad se eew an it was questionable..the sauce was bland and very thick and too brown... I might have to leave them alone...never had bad Thai food before ..until now...????", "author": "Kiesha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "I love ordering from them on Seamless. The food is pretty decent, the portions are great, the lunch specials are a good value, and best of all...you get little extra freebie surprises here and there! Thus an extra star!", "author": "My D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Gotta love a restaurant wiling to modify my order to make it vegetarian.\n\nI love Pad See Ew. But Pad See Ew contains fish sauce and bits of fried egg. Sad face. Not a problem here though, they don't get attitudey about skipping the fish sauce and egg in my Pad See Ew. Yay! And I know they really do it because I can see, smell, and taste the difference. \n\nI also order fried tofu from here. Its pure deep fried goodness! And I love their peanut sauce, I pour it on everything. I love it so much I actually order the sauce bottled up even though it's not a menu item.", "author": "Astra W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-14", "description": "I love the food at this place. It's amazing so I continue to order from here but I've pulled the last straw.  EVERY time I order delivery, it takes them 1.5hrs to deliver.  They are located in my neighborhood and only a 5 min bike ride away.  There's no excuse for it.  When I call to inquire about my order, I'm always told, \"It's on it's way now.\"  Once I called 1hr 20min after Eat24 confirmed they received the order and the girl told me they don't get the orders right away and it had only come in 15 min ago.  Tonight's order took 1hr 37min to arrive.  I'm done.  I love your food Lemongrass Grill but by the time it actually gets to me I'm HAngry!", "author": "JJ J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-07", "description": "I purchased food from this restaurant yesterday and experienced the most horrifying thing ever as I was eating my food..... A METAL OBJECT!!!!! Yes thats right a METAL OBJECT!!!! that appeared to be a mangled nail obout two inches long. About an hour later I became extremely ill with sharp stomach cramps and vomiting. Not to mentioned that I also suffered small lacerations in my mouth as well. They were contacted to be  informed of the METAL OBJECT being found in my food and their response was..... \"They were sorry\" . Thank you for this horrible experience LemonGrass as I will never consider eating at your place again and promise to discourage my co workers,  friends, and family, from eating at your restaurant!!!!!", "author": "Kemistry R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "Big portions, great service.\nI would recommend their grilled salmon in choo chee curry. Its not really a curry dish but the salmon was very well seasoned and taste was great!\nI also got their pad see ew, which was pretty good. Lots of flavor, the noodle was not too dry or soggy. \nPlace is also fairly large, plenty of space which is always refreshing. Great option for last minute meal plans.", "author": "Nancy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "Food is good but there is a language barrier which might cause so confusion when it comes to ordering. I would patronize this restaurant again. Oh, the drinks are very good also.", "author": "Annette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "Was a very satisfy customer, food was really good. Service was great. I had the pad thai shrimp, I stuffed my face'. But I will consider anyone to try this place. The men's restroom is pretty small so if you are a big dude then I think you are going to improvise.", "author": "Cristian P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-20", "description": "4 stars for the food maybe.\n\n2 stars for the customer service and i'm being generous.\n\nWent here with a friend and the table we were seating at already had a knife and fork place setting.  That is fine but myself and my friend preferred to enjoy our meal a la chopstick.  So after asking NUMEROUS times for chopsticks, the waitress only bring one set out for my friend.  We spent another 5 minutes flagging her down for another set.  Someone who I presume to be the owner comes over with another set finally and looks amused.  Then he goes on to say he didn't know black people eat knew how to eat with chopsticks.\n\nIt's one thing to think it, but I mean come on.  Have some sense, and a filter.  Doubt i'll be back.  I'll be taking my immaculate chopstick skills elsewhere.", "author": "Zakiya A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "I always go to this little spot with my boyfriend. It's really yummy \u0026 fast service. We tend to stick to our favs which are the curry puffs, papaya salad, and the pork chops. I always get a glass of plum wine it's so sweet \u0026 good. It's not fancy or anything but a good place to go when your out \u0026 about in the area", "author": "Karen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-06", "description": "Start off with a glass reiseling wine for starters or a mixed drink. Lemongrass Grill has extended their menu to include a array of meals from gourmet fish to just plain chicken and rice.  The prices very moderate and will not set you back. I usually order the Salmon with brown rice which they provide you with nice portions. The Catfish is quite tasty and the shrimp dishes are also great. I usually do take out from this place which is one of there highlights especially for those who just don't feel like cooking sometimes. I have become recently acquainted to other dishes such as the pineapple and chicken, and the Duck Sam Rod. The selection of spice seasonings always add a nice flavor to any fish and chicken meal. I especially like the Tamarind sauce on anything cooked steamed, fried or poached.  If you just plain like something simple just try the rice and chicken..... a good friend Of mine Nadia, says so!!", "author": "Robert J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "Lemongrass Grill has to be one of the best Thai restaurants in Brooklyn when it comes to food, cost and decor. Ive tried about 70% of their menu and its all great tasting. My only issue is parking near this spot in Cobble Hill requires some patience.\nThe price of their food is just right so parking a few blocks away and walking back is worth it. Plus you burn some calories before adding a lump sum. :)", "author": "Jase N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "This restaurant was great. Nice atmosphere not too crowded but could use a bigger space. The food was great. I deff recommend the Mango Shrimp.", "author": "J-Remy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "I ordered online and there was a cockroach in my red curry.  When I called the restaurant to complain, they expressed no concern that there were bugs in their food and barely offered me a refund.", "author": "R R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-08", "description": "The ambiance of this place is great, its small but it works! Food has never let me down.  Volume is at a level you can hear each other talk. They don't have a full on bar but they have a descent wine and beer. The staff is always nice and helpful.\n\nI personally love their Duck or the grilled Lemongrass pork chops. Yummmmm. This was the 1st Thai place that I ever visited and must say I've been a fan ever since..\n\nPlace is great for a date!! And its easy on your pocket!! \n\nAs a matter of fact its due time i go back.", "author": "Rob G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "I was starting to give up on finding good Thai food down by work. I happen to be checking seamless web for a some lunch options and Lemongrass Grill popped up. So I said sure why not. I ordered the Eggplant Basil Lunch Special ($7.95) and some curry puffs ($6). Yes yes my curry puffs were almost the same price as my lunch but i'm a sucker for them. The eggplant was pleasantly good a little on the greasy side but there was good flavors in the sauce. The curry puffs were pretty delicious good combination of sweet and savory. I will be ordering again from here!", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-09", "description": "This is solely based on delivery as I've never actually been inside the restaurant.\n\nThe food is mediocre at best. I got some fried duck dish and tom yam soup. First of all, I've had many a tom yam soup before so I know what it should look like. What I got didn't really look like tom yam soup. It was just so watery and bland. Then the duck dish. I paid maybe $15 or so on it? I really wanted to like it because of that but alas, I did not. I mean, I could eat it. But the duck was very tough and overall kinda unpleasant in texture. The taste was also average.\n\n\nI don't know if I would go try it at the restaurant to see if the food is better in house but overall, an average food experience.", "author": "Aya S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-07", "description": "Not sure if I was just unlucky, what I had turned out to be the worst meal I ever had, in all honesty. I order 2 dishes - 1) pad thai 2) whole grilled fish. The pad thai was so so, but the fish was utterly disgusting. For 24 dollars, I expected something at least somewhat decent. This fish tasted like it had been dead for weeks. I had a total of 3 bites just to make sure. I felt it was a huge waste of money but I really couldn't get myself to take another bite. I got the check and told the waitress the issue. Her response was \"sorry to hear that, I will let the kitchen know\". I thought they would re-do the dish or give me a discount - nothing. Overall - the food was bad but the staff was nice.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "This restaurant is a nice place to dine at night, has a cool vibe. I am a big fan of the Veggie Pad Thai and love that they give you a scale of spiciness when you ask for hot, all the best places do. You know you are getting something legit when you say \"hot please\" and they look at you and laugh like \"Ha. You think you know hot.\"", "author": "Brittan B."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}