{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-10", "description": "I stopped by here to get Thai food for my cousin's birthday. This Thai spot has good food. I ordered the curry puffs and pumpkin curry. When I say that pumpkin red curry was delicious it was heaven. You can taste the coconut and the spiciness. It was a tad bit spicy so this may not be for everyone. The curry had basil, ample amount of shrimp, and various bell peppers. My cousin was a little jealous of my food selections. She ordered from the special menu the Massaman oxtails but after tasting my dish then hers hers was pretty mediocre. The oxtails were nice and tender but it was missing some flavor or spice to it. If you ever had West Indian oxtails this may disappoint you. We also had drinks which were flavorful and strong. They do 2-4-1 happy hour from 4-7. \n\nOur waiter Neil was very friendly and had good suggestions. I'll definitely come back here this visit was long overdue. If you're in the downtown area of BK stop by here.", "author": "Geraldine E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "Once again, I can't find anything close to this place in Philadelphia. \n\nI hate public transportation... but I took the train from Queens to Brooklyn just so I could grab lunch and head back. \n\nI ordered my usual, Tom Kha soup and Panang curry. My daughter loves their pineapple fried rice.", "author": "Erica A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-01", "description": "This place was cute. My friends and I went in for lunch on a Saturday and were able to take advantage of their lunch special.  Less than $8 we got a tea drink, starter and main dish. I ordered the chicken pad Thai. It has good flavor. My friends also enjoyed their meals. Service was fast and the staff was friendly. I'll recommend trying this place.", "author": "Haja F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "They truly deserve 5 stars. Their lunch special is the bomb! Staff are really friendly and have a lot patience when dealing with kids. The bathroom and overall area is clean. Love the Buddhist ambience. \nThis is our to go place before shopping at nearby Trader Joe's.", "author": "Annei B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "I've been here numerous times for their lunch special, which is probably the best deal you'll find on Court Street besides pizza I guess.\nToday I stopped by for dinner, we had fried calamari and Pork Pad Thai. The food was sizzling hot and spicy, it was also very tasty. \nBeing that I'm almost a regular at this place, the service has always been great. \nThe only issue I can say is not about this really affordable spot it's about the street parking, if you're walking you'll be fine.\n\nI recommend you check out their lunch special.", "author": "Enrique O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Great lunch deal: $7.95 it comes with appetizer, entree and a drink. Not bad for this area.\n\nDinner can be pricey, but food is still good.\n\nDecor is very colorful and some artifacts from Thailand. They also have items for sale in the back.\n\nService is always very pleasant and prompt. You never wait too long and food comes out fairly quickly.\n\nParking can be challenging.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "Always a pleasure when I come here! Workers are more than polite with me and my child. Food prepared well. Comes in a timely manner and always tastes good. My favorite is a appetizer of spring rolls and an entree of Chicken Noodle Mao!", "author": "Kiara W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "I've been coming to Lemongrass Grill for over 8 years and try to make a stop here when ever I'm in the area. I see the same staff every time I come, which is refreshing. They are highly professional and courteous. I got the lunch special, which consisted of three mini appetizers, Udon Mao with chicken and Thai tea. The salad dressing on the appetizer salad was way too sweet, but I enjoyed the Thai tea. The service was speedy which was a plus.", "author": "Sassy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "After a movie last night, three of us went to Lemongrass for dinner. It is a comfortable restaurant with a friendly staff and pretty good food. \n\nWe began with vegetarian crispy rolls that were nothing special but plentiful and grilled chicken wings that were exceptionally delicious. \n\nFor our main courses we ordered Pad Thai that was tasty and plentiful and a beef with peanut dish. The beef was not as tender as we had expected but it was flavorful and the sauce was excellent.\n\nThe check with a 20% tip and tax came to $19 a person. I would definitely eat here again....3.5 rounded up for friendly service!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "I really like this place!\n\nThe staff is super friendly good at reading your needs before articulated. Ex: I like to dine here solo and they've always (twice now) put me in comfortable seating arrangements--next to the window or away from rowdier tables. They're also pretty accommodating in letting me sit and chill with a book after I've finished eating, before bringing out the check. I don't feel rushed here!\n\nI've ordered a vegetable curry and the oxtail dish. Both great. Not the most authentic... but tasty nonetheless.\n\nI'll most likely be back a couple more times this coming winter! :)", "author": "Bonnie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-12", "description": "This is my 4th time here in a few years now and man do I enjoy it. The service is always decent and the food is always GOOD! I ordered the salmon and my partner ordered the sweet and sour shrimp and we both destroyed our meal, we also at the Rangoon appetizer and two drinks and were absolutely amazing in flavor. Def a place to visit and eat at !", "author": "Jordain J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Came in for lunch on a Friday, super quick service, app and meal for $8. I got the green curry with tofu \u0026 veggies. The curry was good and so were the veggies, the tofu I can't recommend. Otherwise it checks all the boxes in terms of a quick work-day lunch spot.", "author": "Shelton H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-03", "description": "Came here ordered a fried rice and some seafood. Food was mediocre however service was disgusting.  \n\nWhen we came we were not greeted right away, moments later when someone did greet us he transferred us to a waiter that was waiting on another tables order.  I thought it was super awkward to stand next to someone that was busy with someone else table. \n\nThen when we we ordered our food- I appreciate that he gave us some recommendations but I felt super insulted that he reiterated the prices of each dish.  \n\nLast when we got our check, the waiter asked to verify our ID for our credit card which is fine.  The issue I have is that they did not ask other people to check their IDs.", "author": "Malinda V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Im not really big on Thai food but lemongrass was introduced to me by my beau. She took me there to eat one night for a date \u0026 she had order the Thai fried shrimp which looked delicious!  Upon dining there again I ordered it for myself and fell in love. The service is very welcoming and low-key. This resturant has a very intimate setting. Cute for dates or just a nice filling dinner for a night out. The waiters are nice and actually have gotten more attentive to the customers which I appreciate. \n\nYou'll love this resturant!!!! Go check it out!", "author": "Toshonie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-14", "description": "Wonderful service and wonderful food. Pork chops, orange chicken, fried cheesecake. Must try!", "author": "Monika L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-26", "description": "I ordered two lunch specials (1 red curry and 1 green curry for myself and my coworker) but they only gave me one drink. When I called them to ask about it, they said the drink is complimentary but I don't get two even though I ordered two lunch specials. This is very confusing when the sign outside clearly states that a lunch special includes an entree, an appetizer and a drink. My coworker always gets two drinks when she orders two lunch specials. The guy even hung up on me when I wanted to clarify further. I'm giving it two stars because the food is not bad, but I wish they're fairer towards their customers and would own up to their own mistake.", "author": "Karina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-12", "description": "Came here with a good friend and the food was Great Thai food. Got the Thai fried rice which was great. Staff always friendly and attentive. Not to mention a like liquor to wash it all down. Come here hungry because theres a lot to choose from.", "author": "Joseph K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "I've only ordered delivery via Yelp from Lemongrass, and both times it's been on-time and tasty.\n\nThey have a great lunch special for $9.95 that comes with an salad, app, and entree. It's an awesome deal and everything has always been solid. I've gotten the Pad Thai, and it's a large serving for just a \"lunch.\" Along with the other apps, definitely enough to send you into a small food coma.\n\nSolid for lunch and delivery, definitely recommended if you live in the hood!", "author": "Katey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Came here for lunch. They have a nice deal you even get Thai Ice Tea with the special. Appetizer was good. The spicy noodles were nice spice but a little too salty for my taste. The service was very good we kept getting water filled without asking.  Overall a pretty good place for Thai food", "author": "Margaret L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Food is great and I love the Atmosphere very nice and clam place for lunch with a friend. Happy hour is buy one get one free for drinks and drinks are fairly strong and good as well.", "author": "Tissy R."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}