{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "Not bad at all. Maybe I'm the kind of girl that is easy to please ::shrugs::\n\nMy friend and I came here tonight. Frankly, it was better than I had expected, after walking past this place on many occasions. I ordered a Thai Grilled Beef Salad. It was a little tangy and spicy but guess what? It worked for me. I also had a red wine and my friend had this rice meal with chicken. \n\nOverall, I don't have too much to say about this place. The staff was actually very friendly, attentive and when we asked for the check they got it for us pretty quickly. Gave a pretty nice tip and called it a day. Overall a good experience and truth be told, I will be coming back here. :-D", "author": "Emmy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "We come here frequently and are always greeted with great food and service. The presentation of meals is beautiful, and the quantity of food is the right amount. We usually take food home. We keep coming here because of the quality of food and the warm atmosphere, and the employees are always willing to see you have a great dining experience.", "author": "Sue R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "Let me start by saying, I will never order from here again.  The staff is rude and unprofessional.  This afternoon I placed an order on delivery.com for a Cashew King Lunch special.  While the cashew king was delivered, they forgot my rice.... a main component of the dish.  When I called back and told the person on the phone that they forgot my rice, she said a delivery guy would stop by and deliver the rice.  She then called back and told me the manager said they packed the rice, and since the manager said it, they wouldn't deliver anything additional to me.  We went back and forth and she made it seem as if I was lying.  It's rice.... did she really think I would go out of my way to call the restaurant if I received it???!?  When I asked to speak to the manager, she whispered to someone briefly and told me the manager (conveniently) left for the day.  Great, you just lost a customer over $1.00 rice...", "author": "Adora E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "We tried this place on the recommendation of my husband's co-worker.  We found the food to be pretty outstanding.  All of the dishes we tried were excellent.\n\nWe had the fried calamari, the panang curry, the chee choo curry, chicken with black bean sauce and an item off the specials menu - volcano chicken.\n\nThe calamari was perfectly fried - it was flaky and salty without being greasy or overly chewy.  The panang curry and the chee choo curry were pretty similar, but both were excellent - the panang was a little tangier \u0026 spicier, while the chee choo had a slightly thicker coconut milk base.  The chee choo was my favorite while other folks at the table preferred the panang.  The chicken with black bean sauce came over a bed of spinach and was garlic-y and super yummy.  The volcano chicken was essentially just BBQ chicken - they flambe it when it comes to the table (Hence the volcano) - it's not super spicy.  But it was very moist and tender.  It was delicious, but definitely the least exciting of the 4 entrees we ordered.\n\nThey lost a star for their terrible pop-y sound-track that was playing a little too loudly - if I could take off just a half a star for it, I would, but otherwise the ambiance was very nice, and the wait-staff was very attentive, and we will definitely be going back.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-05", "description": "Two stars for the pineapple fried rice it was so delicious. And the buy one get one maragarita were strong n sweet ! Now the service was horrendous !!! I wasn't sure if they remembered my party of 6 was even in the restaurant for as long as they kept us waiting . They forgot two of our drinks n gave it to us after we finished our meal . We called their attention numerous times n were either ignored or given eye contact n then they took another 14 mins to actually address our concern. Then my friends drink was horrible he took a sip n she charged us for it . We told her numerous times to return which she didn't .then the waitress says \" pay for half of the drink\" at this point I was pissed because he didn't even drink half of it he barely touched it it was disgusting!! Then the bill comes n we were charged for the drink. No one got their food on time and my Thai iced tea was taken to go because they forgot to bring it . The food was good n the margarita was ok the service was ridiculous!!", "author": "Zainab A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "This was the first Thai restaurant I have ever been to. 7 years later, it is still the best. Big portions for a reasonable price in a great location.", "author": "Ernest D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "Instead of waiting the 1 hour wait at Joya we came over to LemonGrass Gril.  Good move on our part as we were seated quickly and the server was giving us water. Menu has tons of choices and the vibe is cool enough to bring a date.  Curry Puffs is a must.", "author": "Victoria J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-20", "description": "This place is a total disaster. The two front hosts could not understand a word of english and the cook wasnt wearing a hair net. I am allergic to cabbage and requested 3 times to make sure there wasnt any cabbage in it and what do they do? Put cabbage. I went all the way back to my job and then had to go all the way back for that reason. When I brought it back they tried to make me pay again because they didnt even remember that I had ever ordered and that it was my fault that I picked up the wrong order. When I finally got to sit down to eat it the noodles were cold and the spring roll was soggy. The worst part of the whole thing was that the salad tasted like expired applesauce !! Save yourself the trip and the stomach bug!", "author": "Britknee A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-18", "description": "The people here are nice, and  the food comes out quickly.  That's about all the positive news I have about this spot.  The basil fried rice wasn't very flavorful, drenched in soy sauce.  The crispy wontons weren't good either.  Greasy and the chicken quality wasn't good.  The quest for the best local Thai spot continues...", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-15", "description": "I ordered from here once through Seamless and thought the food was actually tasty. Second time I ordered through seamless it took an hour and half for the food to get delivered and was quite angry. But the food was tasty. Tonight, I tried again. Seamless said 30-45 mins. An hour and a half later...nothing. I've called three times and each time the person on the phone said it would take just a few minutes. What's even more annoying is that seamless says the food left the restaurant an hour ago. So what is the delivery guy doing with my food?! Never again.", "author": "Shawn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Amazing lunch special. There are many lunch specials in the area but, by far this is the best one. You get so many things. Drink, salad, appetizers and large entree. The food is always good and never disappoints nice quick staff.", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "This was the first time I had Thai food. I had the noodle Mao. Food was good and the service also good.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "I can't believe I haven't written a review before. This is my go-to lunch spot that I can never get tired of. First of all for $8 dollars you get three appetizers, an entree and a Thai iced tea! The food comes out quickly, freshly prepared and is absolutely delicious. The wait staff are very friendly and accommodating. I love their chicken pad Thai and sweet and sour chicken. My colleagues have ordered some of the curry dishes and have rave reviews about them. Definitely recommend!", "author": "Aisha J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "I really enjoyed this place. The food was extremely good, arrived quickly, and the staff was courteous. Definitely worth checking out.", "author": "Julian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "This is my go-to Thai takeout place in the neighborhood.  Can't go wrong with their country-style dumplings, curries, or noodle dishes.  The only thing I haven't loved there is the papaya salad -- I like it spicy and have loved papaya salad everywhere else, but there's something about the way the chili is used in their salad that I find too overwhelming to enjoy.  They almost always give you something free, too -- I haven't hit the free entree jackpot yet (although my roommate once did), but they usually give you at least a can of soda, and sometimes something small like a few spring rolls.  Really friendly, fast, and an all-around solid Thai option.", "author": "Maggie E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-17", "description": "Pretty good at first but last few times the quality of the pork has been a bit weird.", "author": "Johan K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-26", "description": "The place is very loud. It's a small restaurant. The loud music doesn't help much. Food portions are ok. Menu doesn't have anything exciting. The waiters are very rude.", "author": "Salim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "I absolutely  love this place. !!!!!!!!!The food is awesome . I had the salmon with tamarind sauce mix veg and rice, and sampled several appetizers   thus far no complaints . The ambiance is nice ,servers are attentive  and I didn't think it was to pricey. Definitely will remain on my best places to eat in Brooklyn list .", "author": "Gem S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "All I can say is the food taste sweet literally. It's almost like there is a spoon of sugar in all the entrees, no complaints though it's tasty. I've been here twice and will go back again. Try the pork chops !! Tasty tasty tasty !!!", "author": "Nella B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-10", "description": "It was \"brick\" (as some New Yorkers would say) on a Saturday night a couple of weeks ago and my boyfriend and I just wanted to grab a bite to eat somewhere in the neighborhood. I'm usually not a fan of franchise restaurants, but I needed food in my belly.\n\nTo my surprise, the Lard Nar was on their menu. Now if you are just an ordinary run of the mill Thai restaurant, more than likely, this dish will not be on your menu because of the following reasons:\n\n1. The name sounds anything but aesthetically pleasing\n2. It's hard to make if you have no idea what you are doing\n\nI was pretty disappointed with this dish as it was massively overloaded with oyster sauce, which can be super-high in cholesterol and sodium. Imagine the flavor of MSG, but on an oyster sauce level. Lard Nar is supposed to be similar to Pad See Ewe, but have a nice consistent, thick gravy accompanying it. It was runny here. =( \n\nLemongrass grill is not an authentic Thai restaurant as I could tell in the flavoring of their dishes as well as their slightly rude wait staff. What's funny is that I ordered a lychee juice which consists of diluted lychee juice and a few lychees thrown in there. Since I'm Canto (Cantonese), you pronounce lychee as lie-chee, which in Mandarin, it would be lee-chee. I wanted to reverse the pronunciation just for fun and use the Mandarin pronunciation when I ordered, but to my dismay the waiter corrected me with his Canto way of pronouncing it. I thought it was rude and deceiving since I am not a huge fan of Chinese-owned Asian restaurants when they are NOT Chinese cuisine. The credibility of this restaurant lacks in my book. I would much rather go to a Thai-owned place!", "author": "clb k."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}