{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-22", "description": "Return? No, there are better Thai options (e.g., Pinto on Montague)\nAtmosphere (2) Might have been quaint 15 yrs ago but on the down side now\nFood (2-) - I ordered a chicken dish but don't remember which one. It was virtually inedible\nService (3-) Nice but one person for all the tables so tough to get her attention\nCost = Typical.Thai rates - $12-$16 for entrees", "author": "Will S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-12", "description": "Was off from work today, and stopped by the place for a quick lunch.  I actually went in because it look like a clean joint and was in the neighborhood. \n\nI ordered the Lunch Special Bangkok for $7.95 that came with the Pai Thai noodle, mixed salad and peanut dressing. \n\nIt was pretty good, tasty and fresh.  Maybe will come back for dinner sometime.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "I went here a while back but had a nice experience. The food was blah, you really can't mess up Thai food, but their are better places. Yet I had about 18 people with me. I had a small B-day dinner here with friends and they were very accommodating. they moved fast and everything was a breeze. the place isn't that big so we basically made it hard for other large parties to come in, yet, they didn't rush us. Which is always good.", "author": "Veronica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-28", "description": "So much love for this restaurant.  The food is never overcooked.  The lighting and decor have the thai restaurant quirk without being abrasive.  The servers are always kind.  I saw a customer complaining loudly about how they got a pot of tea instead of just a cup, and the server handled the bout of insanity with a calm I don't think I could have mustered.\n\nI love the Tofu Delight, but I've never had anything I didn't like.  I have to second another reviewer's appreciation for the spring rolls.  Try it all!", "author": "Kyli K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-09", "description": "So we once in a way from this place, but here is the thing they dont understand english very well so you need to repeat the order couple time unless its an online order. So i ordered for this this dish which is 8 dollars and asked him to add tofu which he said would be 9 dollars, 1 dollar extra but what he did was change the order to a dish that was 9 dollars and add a dollar for the original vegetables in my dish....just a quick buck rite!!! and when i call him back he says that what happens with other dishes you order too and was completely not apologetic for doing that and also missing a dish in the order and claims that I dint remember the correct order!!! can u imagine this kind of service, if u actually sit in!!! so, not happy what so ever!!!", "author": "An S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "i love this place and will continue to love it unless they some how screw up BIG TIME. my friends really don't like trying new foods like i do but whenever i bring them here they love it, so many choices of food to choose from, really nice atmosphere, wheather it's for a date night, hanging with the girls or with the family or even just dining alone. this place is just the best, keep up the good work!!!!", "author": "J R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-13", "description": "I'm really shocked by the reviews .... humm I went for a early dinner on a Saturday. I had the sweat and sour chicken and the spring rolls every thing I had was delicious . I didn't have to wait to long for the food and the service was great. My date loved every thing he had. I chose this place because, I used to go to the one in park slope which closed down. I think the food is actually better at this place.", "author": "Nathifa A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-24", "description": "Ordered spicy noodles with chicken, they delivered bland egg noodles with no sauce and nothing but those bean sprout things in it.  Disgusting, will never order from here again.", "author": "Jesse D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-10", "description": "On our first visit to Lemongrass, the staff caught a glass of water knocked over by our two year old in midair, smiled, and went on with their business. They were extremely nice about it. We've since forgone dining in for takeout or delivery until our kid gets a bit older.   \n\nWe love this restaurant -- they're our fave in the neighborhood, and we order from them at least once a week. The food is tasty, the portions are generous, the delivery is fast - we hang up the phone and the doorbell rings within 10 minutes every time. The staff are friendly and polite, and are open to customizing the order to our needs without giving us attitude. This place is great for vegetarians who don't want fish sauce or eggs in their food. \n\nAll in all, we highly recommend Lemongrass Grill.", "author": "widdy s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-29", "description": "Wow!  What an experience at Lemongrass Grill on Court St!  Went there for lunch and as I began eating my main meal of green curry I found a hair intertwined with the veggies.  Being 7 months pregnant i was immediately nauseated, but after being in the food industry as a chef for 12 years I understood how a mistake can happen.  I alerted the server and tried not to think about it while they remade it.  Before taking a bite I looked thru it just in case and guess what I found....yep you guessed it another hair intertwined in the veggies.  So my meal was over.  Basically the chef didn't care enough to check the mise en place prior to remaking the meal and most likely the prep chef does not practice safe food handling by wearing a hairnet or hat.  For sanitary reasons I will never visit this restaurant again.  And will alert the health department to take a closer look at lemongrass's food prep standards.  The 2x present hair is just one indicator of a bigger sanitation issue.", "author": "Debbie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-26", "description": "The ratings about this place are so generous. I've had a yelp account for years and must have posted maybe only 3 other reviews [which, is ridiculously few for a restaurant hopping foodie.] First of all, this place is empty all the time-- which, as a native new yorker, should ring as a bit suspicious. There are a million other Thai places in BKH that are awesome-- this place doesn't deserve your money. I got the calamari salad and my pal got the shrimp. The salads were ice cold, with HUGE chunks of raw ginger everywhere [ever eat raw ginger? bitter- city. inedible. disgusting.] There were barely any shrimp in her's and my calamari just weren't cooked well-- even if they were my appetite was so messed up from the ginger and other misplaced garbage in it that I wouldn't have enjoyed it. I took like 5 bites and had to let the manager know it was awful to which there was no reply but to take the dish away. I was starving so ordered some spring rolls which were [in this case] thankfully, mediocre [yup.] I actually had to leave and go somewhere else for dinner #2 afterward. I ordered a wine, which they were out of despite having just opened and then ordered a different one which quickly became a swimming pool for the hundreds of gnats that were attacking our table the whole time. Another chunk of $$ wasted... If seating us at a filthy window [inches of dust, tons of bug carcasses, etc.-- how did this place get an 'A'?] wasn't bad enough, when we asked for our check it took about.... 30 mins? for them to actually get it to us when the place really only had 2 other tables filled. I was so grossed out and so annoyed that a month later I remembered to come on Yelp and report back. Don't pick this place when you can go to Joya or the other great places you can choose from on Court or even Montague. Save your taste buds and wallet!", "author": "oneally g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-14", "description": "Its a nice place for lunch or dinner, although i am more comfortable reviewing out of my dinner experience at this place. The place has a good ambiance, is quiet with nice low lighting. The service staff was prompt and courteous. The food was good and was served within 10-15min of ordering! Between the pad thai and penang curry, we couldn't decide which one we liked more. I also enjoyed their iced tea ( can be with/out milk). The only downside was their price, it was on a higher side and plus they add 15% gratuity.", "author": "mail b."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}