{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "Oh yes, there is a good, affordable Thai restaurant in the charming Cobble Hill neighborhood!  Our food arrived incredibly quickly and the portions were generous.  It wasn't the best Thai I've ever had, but it was very good.  When the check arrived I thought there must be some mistake - $40 for two entrees and two appetizers!  At this poshly decorated place, I would have expected to pay much more.  \n\nI haven't tried the other Lemongrass Grill locations, but based on my first experience I look forward to checking them out.", "author": "Allison N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "My boyfriend and I came across this place one night while searching for good Thai food in Brooklyn and we ended up going two nights in a row! The space is nice, minimal design clean and inviting.\n\nThe service was ok, the first night (late on a Friday evening only two servers it seemed) the second night it was much better (very bust Saturday night during dinnertime, fully staffed). You don't really get one server here, it's more of a group effort but you don't mind. Everyone is nice and will get you whatever you may need. The wait for food was much longer on Saturday than Friday but they had a packed house so that's understandable. Although on Friday they brought my food and I had to wait a bit ( and remind them) to bring my rice. Not good,  need my food and rice together!! Saturday night they brought out my bf's food waaay before mine which I did not appreciate. \n\nThe food was delicious! My boyfriend and I frequent a Thai place in the city called Spice (not to be confused with Spice Market) and we were searching for a Brooklyn replacement and we were not disappointed. The first night as an appetizer we got the Shrimp on Crack..LOL actually it's Shrimp on Cracker but there was a typo (we noticed was fixed by the next night). It was delish! So good we didn't want to share. We also enjoyed the Coconut juice which was soo good and I usually despise coconut anything! At $3 you cannot beat it. For my entree I got the Massaman Curry which I love at Spice and this one was just as good. It's a subtle tasty curry that really hits the spot for me. Excellent dish full of flavor. My boyfriend got some dish full of several types of seafood everything from squid to shrimp he loved it! He was in search of a meal comparable to the Drunk Man Noodle and he found it. It was too spicy for my taste but undeniably full of flavor. \n\nDespite a few minor hiccups I highly recommend this place and we will be going back.", "author": "Denise S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "Delicious! My wife and I love coming here and we both agree this is our favorite restaurant. We've been going here since our college days. The food is still top notch and the staff is fantastic and friendly. The place is so calm and relaxing also, great for dates! I always and forever choose the classic chicken Pad Thai as my dish and it never gets old. Their peanut sauce is unbeatable! Price is also very reasonable and well worth it. I highly suggest this restaurant and trust me, you wont regret it.", "author": "Felix B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-08", "description": "I live in the area and would go here from time to time.  I didn't have a strong opinion about it either way, until I got FOOD POISONING from here.  I will NEVER eat here again!", "author": "Renee R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-21", "description": "The worst thai food Ive ever had. I had the chicken pad thai.. never again", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-10", "description": "Usually a reliable place for takeout Thai, but tonight's order has made me decide to never eat at Lemongrass Grill again. \nStrike 1: delivery took 90 minutes to arrive\nStrike 2: chicken satay appetizer was not just cold but was frozen and somewhat raw in the center. This I had to toss out immediately. \nStrike 3: sauteed broccoli was too salty to eat and the shallots were burned. I usually like a lot of salt on my food but the chef seemed to pay more attention to the salt and not enough attention to the chicken.\nBill came to $23- all of which went down the trash.", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-08", "description": "We were looking for a quiet place for dinner in this neighborhood and Lemongrass Grill delivered on that. Serviceable Thai at reasonable prices. Nothing fancy. Nothing exceptional, but sometimes that's nice too.", "author": "Maya C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "Great food and great service.  We were here with our young children and the staff was so good with them. We'll be back soon!", "author": "Elle H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-16", "description": "Why does it have an A rating?! That was my question when i found a piece of hair in my spring roll and in my salad! the food was not great i felt like it was poorly made and presented! I could of made something more gourmet at home that looked even better! Instead of not charging me for my food the owner i believe just didn't charge me for my thai iced tea. Never Again!", "author": "Victoria P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "Is it the McDonald's of Thai? Sort of.\n\nIs it good? Yeah.\n\nEverything I've ever had there was tasty as all get-out. It's a good way to bring a diverse group of people - all with their own annoying food quirks and dietary needs, myself included - to one spot without too much bitching.\n\nTheir over-sized spring rolls are a small meal in and of themselves, but i mostly love the string beans basil dish. With chicken or tofu, it's dry, spicy and only a little bit sweet. Red and green curries all get a thumbs up, as does the black bean chicken dish. Pad Thai is reportedly tasty as well.\n\nThey'll make your food pretty durn hot if you ask emphatically enough, and it was from one of the owners/managers there that we learned about Woodside's venerable Sripraphai.\n\nTheir thai iced teas are too sweet for my teeth, \n\nThe delivery is always excellent and always only 30 minutes, no matter what.", "author": "D. H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-17", "description": "Decent Thai restaurant in cobble hill.  I had the Massaman curry and some dish with vegetables and chicken and gravy with egg noodles.  Both reaklly hit the spot on a cold saturday afternoon.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "Beautiful place!!!!! The seafood plates are just delicious and the pork chops??? Must have!!!!!!!! The drinks are perfect. Would definitely be coming here more often.", "author": "Analiz Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "Five persons having different dishes. All of them were great - especially the Red Curry. Plenty of food in all the dishes :)", "author": "Kasper H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-22", "description": "I'm not a Thai food purist, so I liked this place well enough. Came here for a very late dinner date on a Saturday and we enjoyed the food. Although the kitchen was closing in 30 minutes, our server never made us feel rushed. He was attentive, made suggestions, and kept our water glasses full. We shared a red curry with duck and a spicy beef salad. My date had a shrimp lychee appetizer (can't remember the name) that he said was pretty tasty. The leftovers were also good the next day.", "author": "Au N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-21", "description": "So incredibly delicious!! The satay was superb. Came with a party of five and the service was excellent, friendly and attentive. I'll come back everytime I'm in New York!!", "author": "Chaughn G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-30", "description": "Decor is nice....but it belies the totally mediocre food. Maybe I just ordered the wrong things. I had the calamari salad. The salad part (greens) were the highlight of this salad as was the spicy fish sauce/lime dressing. The calamari were chewy and gross like stale gum.  \n\nFor my main I had the \"cheech and chong\" which was labeled as spicy. This was not spicy at all..not even close. It was actually sweet.  yuck. I just picked out some of the vegggies and shrimp and ate that plain.\n\nMy dining companion had the seafood casserole which he did not touch because of its blandness. I didnt think it was bland, just not what you'd expect. Not to say it was good, but just very ginger-y. If you love ginger, you may love this dish.\nI thought the ginger was overpowering. This dish could use some heat.\n\nI thought these dishes were also kind of pricey (like 15/18) for what we got. Yes, I know its seafood, but it seems a bit expensive compared to better restaurants in the area (ex. Ghang Thai and Em Thai).", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "i stopped by with my girlfriend after work and had a wonderful time. the grilled chicken as an appetizer was a great start followed by the sweet and sour grilled salmon that was fantastic. the aroma was lovely and i will definitely return many times.", "author": "Jalil R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "I thought it was really very good.  The decor is very nice and relaxing.  I thought the food was great and filling.  Also, they actually know what \"spicy\" means, which is a good thing.  My only complaint is that it is a bit pricey.  However, I really enjoyed my dinner. \n\nI will definitely be returning when I have the time.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-19", "description": "I was lucky enough to be passing the resturant when I saw a sign for an \"orange chicken\" special.   I have to say the food was off the rails, it was one of the best thai dishes I had in a long time. Service was fast and pleasent, I was also fortunate enough to have the window view of the beautiful Cobble Hill are of Brooklyn. If your in the area give this place a shot, and hope your expierence was as good as mine.", "author": "Mike O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "Three words:  Crispy Pepper Steak !  Best bargain in NYC, the dish also comes with has plenty of vegatables and sauce.  As previous reviews state, the portions are big!  You will need an extra bowl of rice to finish your meal.  My only qualm about the dish is you can't request the temperature of the steak.  It comes out medium well.\n\nUnlike the other Thai place nearby, this place takes plastic!", "author": "Jj L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}