{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "One of my favorite Thai places / their duck options are to die for and the fried rice in a pineapple is awesome\nStaff is pretty nice and attentive and they have $3 Thai beer days on the weekends sometimes for those who enjoy a brewski\nBeen coming here for years and I must say they survived a B rating with grace ..", "author": "Nonny B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-16", "description": "Bland and boring. Got the Noodle Mao with Tofu, which promised 'hot and spicy' but was slimy, bland and boring. Veg and tofu were in short supply and delivery came sans chop sticks. The vegetable dumplings were not much better - more deep fried than pan fried and again didn't deliver on flavor. Vegetarians won't have much to sing about here.. Perhaps the meat eaters will have more luck at Lemongrass.\n\nDelivery was fast but I won't be ordering again.", "author": "Dantelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-08", "description": "I had been craving Thai all day and was determined to get some before the night ended. My friends and I stopped here for dinner on a Friday night. \n\nThe place is nice. Kind of small and the lighting makes for an intimate setting. The service is great. I'm always down for 2 for 1 drinks. The food is delicious though. It's a good choice for a date night or group dinner before a movie or whatever. The speciality drinks were strong!! We tried them all but my favorite was the mojito and something with pomegranate in it lol.", "author": "Stanette D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "For take out this place isn't bad. I have no major complaints although they could put a little bit more meat in their dishes. Other than that great for a late night craving.  3.5 stars.", "author": "Kia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "The food was great !! I had the grilled wings w the thai fried rice with chicken \u0026 a Thai ice tea m...so good!!! Definitely will come back for take out next time", "author": "Rebecca J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "We had 30 min to get some food before a 2pm movie and this place was great. They have an amazing lunch special Monday through Sunday. 8-9 bucks for a salad, appetizers, entree, and drink. Food was delicious and I had leftovers for the next day. Beer and drink specials midday Saturday were great, 3 dollar beers. And the service was also great. They got us out in time to see some of the previews.", "author": "Helen P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-17", "description": "Lunch at Lemongrass Grill was not the most authentic Thai meal I've ever had... but it was satisfying and an excellent deal.\n\nFor $7.95 you get an appetizer (3 different types of dumplings and a garden salad), your choice of entree, and a complimentary Thai Iced Coffee or Thai Iced Tea.\n\nMy Chicken with Basil \u0026 String Beans was tasty and was a filling portion that didn't weigh me down during the rest of the work day. My coworker enjoyed her Pad See Ew as well.\n\nService was attentive, and we were in and out within our lunch hour. I wouldn't hesitate to come back when I'm in this part of Brooklyn again!", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Pork pad thai was delicious. Pork fried rice is amazing and comes in a pineapple with little pineapple pieces in the rice and it's just so good. Also the Bogo cocktails is fabulous.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "I came here with my friend and we both had the lunch special. I got the shrimp pad thai while she got the chicken pad thai and the food was delicious. For our appetizer we each got a salad with a spring roll, fried wonton and steamed dumpling. The dumpling was amazing and the fried wonton was delicious. Each our meals cost about $12.75 each and I would definitely go back. The service is great and so we're the wait staff.", "author": "Anne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "The BEST green curry. The restaurant itself isn't much to look at, service is sub par.\n\nSo order the curry on seamless--so worth it!!", "author": "Heather H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-04", "description": "I usually don't spend time writing reviews but read this before going there. I went with a co-worker to order take out. As soon as I placed my order I mentioned I was highly allergic to shrimp, however, when I opened my appetizers, I noticed there were shrimp dumpling included. I know this is a common mistake to make, but in my case it could be a deadly one. I proceeded to eat my beef stir-fry instead, I found a black long piece of hair in there. I am not usually one to get grossed out by that, so took it out and kept eating (I know-gross!) Two seconds later, 3 other pieces of hair appeared sauteed in the middle of my stir-fry. It is totally disgusting! Not only did I not eat my appetizers, but I had to throw away my hairy beef stir-fry as well. DONT GO THERE.", "author": "Eliane K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-01", "description": "If you feel like waiting for almost two hours for your food...this is your place.  It's really a shame how bad the service is since this has always been our go to place for thai food. It was supposed to be nice night in when we placed an order for delivery.  We had to call several times to find out what had happened to our order and when we brought up how long it was taking, they were rude and completely dismissed us.  Def not ordering from this place anymore.", "author": "Katherine A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "Failed to honour their deliver after taking the order and refused to call seamless to refund. Unacceptable.", "author": "Jason W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Best pad thai ive ever had in my life. Great service, relaxing environment, great food. The Thai iced tea was amazing too", "author": "Sam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "I've been coming to lemongrass for a few months now and I can honestly say it's the best Thai food I've eaten ! The portions are great and the service even better! When ever I'm in the area I must get the pineapple fried rice it's delicious their Thai tea is so refreshing", "author": "Teresa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Oh lawd, the food here is so good. I haven't had Thai in a while but I was craving it yesterday. Its a pretty low-key place with hefty portions of no-frills food which is great. I ordered the Noodle Mao with Tofu which I was iffy about because Tofu isn't my fav but it was delicious. Hell, it tasted like crispy Pork or something LOL. I also had Thai iced tea but there is nothing much to explain about it since its a basic drink that I am sure most of us on Yelp have already had. I have been to Lemongrass in Park Slope yearrrssss ago in the early 2000s so this was nostalgic for me and I am glad I stopped in. Good food, good prices, and good vibes.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "The service here is AMAZING! One of the servers greeted me in such a friendly way I had to stop and think if I knew him from somewhere (I didn't - they are just really nice!). Food came quickly and piping hot. Water was kept full constantly and I received complimentary hot tea. I came in on a Monday around 1:30 and it wasn't very busy, however their takeout/delivery business was bustling. I had the tom yum soup with shrimp and pad kee mao with chicken. The food was good, not the best Thai I've had but I would come back for the service alone!", "author": "M I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "I love love this place. Everything is so cheap \u0026 good. Friendly staff , nice setting the best Thai food I've ever had , they've got a customer for life", "author": "Ayanaa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "First things first, I really like the setup/atmosphere in here. It's very nice and quaint with light music in the background which allows you to have a normal conversation. Now on to the food..... IT WAS DELICIOUS! I had the Noodle Nana w/shrimp, now when I ordered I'd assumed it was your regular noodles mixed with veggies and shrimp. Wrong! I can't even describe the noodles, but it was served in a sauce and looked almost like a soup. I was very skeptical at first but after the waiter explained it I decided to try it and man was I happy! I would definitely go back and try some more interesting things on the menu.", "author": "Shurland C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "Seriously the best deal in town! Three appetizers (friend wonton, country style dumpling, and a spring roll), salad, an entree (got chicken pad Thai, comes with tofu as well!!!), and Thai iced tea option all for $7.95? Yes yes yes! The entree was pretty good portion size - my partner ate some of mine after he ate all of his and I still had some left over for a tiny to go box. I'm in love. \n\nThe service was great. The ladies taking orders were super nice and friendly, always smiling and very in tune with the customers. Love their vibe. The restaurant was really chill for this summer weather, especially the lighting and music. \n\nWould return again because the food was delicious and the service was great. I would totally recommend this place!", "author": "Lucero J."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}