{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Delicious Tai food.  Quick Service.  Plenty of seating. Nice Ambiance.", "author": "Laura R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "I've been here so many times. It's my go to Thai spot in downtown Brooklyn! The menu has variety, including a weekly lunch special and large entrees. My favorite appetizer is the curry puffs - amazing. And the must get entree is the Thai fried rice. It comes in a pineapple! Great decor and friendly staff.", "author": "Mel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "I never had a bad meal at lemongrass grill, this is my go to Thai take out. It's fast and the food is really delish, I haven't tried everything on the menu yet but  so far so good.", "author": "Tania B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "First time for myself and about the twelfth for my girlfriend. She recommended an excellent Thai restaurant in downtown Brooklyn. Lemongrass grill. Quaint, casual, and all around comfortable. Our server was quick to take our order was ease.  As soon as my order of sake hit the table our food was right behind it.  The ambiance and service was well worth the trip to buddy Brooklyn. Oh and the food is good to!", "author": "Matt N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Met a friend for dinner to catch up. I ordered the fried tofu and the string bean basil. It was a nice portion and super spicy which I like. They give you enough meat so you don't feel like you are being stiffed. My friend ordered thw choo che curry. She enjoyed it and always likes that they give you a big piece of salmon. You will definitely get your money's worth. The food is consistent and the service is good and pleasant.", "author": "Mel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "Kind of confused by all the negative reviews...I couldn't have asked for anything better during my first and only visit during their lunch hour special. \n\nBoth my boyfriend and I enjoyed everything thoroughly. Our dishes were delicious and generously portioned in their adorable Bento boxes, the music and sunny window-side tables provided the perfect afternoon ambiance and service was fantastic. The 2 people that helped us were highly attentive and courteous, even kindly obliging to turn down the music when I said I had a slight headache. \n\nPlus, how can you beat such a fantastic deal? I hope all the negative reviews don't discourage others to try this place - hopefully they were fluke experiences, since I definitely plan on coming back (for lunch at least).", "author": "Anna Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-19", "description": "Went her last saturday for my Birthday with a Group of about 10. 2 arrived late. The atmosphere was dim but not to dim and very quiet as we filled the room with out reunion chatter. All the food was very good and my friends were satisfied and as always the food comes a decent pace for how quick it comes. Decent portions filled me right up but their desserts in my opinion are lacking! Either way I would and will definitely come back!", "author": "Ryan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "I arrived at 4 pm on the dot! I know because I looked at my cell phone. I requested the lunch special and the gentleman behind the counter looked at his clock and said \"lunch is over\" then decided to give it to me anyway.\n\nI ordered the Lunch Special Bangkok Box for $7.95 inc. Pai Thai noodle, mixed salad with peanut dressing, and 3 appetizers (shu mai, fried wonton and spring roll). \n\nThe portions were plentiful and I love the plastic reusable container, It has s-e-c-t-i-o-n-s! I'm not a big fan of Miso soup so I got the salad instead. The salad was kept in another separate container. \n\nThe food was tasty and oh so good!\n\nUpon leaving I couldn't help noticing a restaurant award given to this place.", "author": "Touro T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-31", "description": "Food: Not as good as it used to be, this location or the old one in park slope. I've had way better pad thai noodles. The lunch special is definitely a steal, so not a bad place to come for lunch, however, not sure if it's worth pay for dinner. \n\nCustomer Service: It was raining, and when my father \u0026 I walked in we didn't see a bin or a pail for our umbrellas because the foyer was so crowded with Xmas stuff. So we walked in and as soon as we stepped our feet in, the lady yelled at us and told us to put the umbrellas in the bin. The other woman then proceeded to show us where it was. As my father and I were leaving, another lady walked in with an umbrella, but no one yelled at her! I didn't like that.", "author": "Adriana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-25", "description": "I was kinda down so my friend and I were just walking around in the neighborhood and he said, let's go in here and get you a Thai tea..instead I decided to get sticky rice with mango. Yum! \nWe had a nice talk, the atmosphere was quiet and place looked clean so I was happy.\nWe went at kind of a random time of day like 2pm so the waiters and cooks were having lunch..so service was slow, but it was all good.", "author": "Francesca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Great Thai Food! Food is always delicious and orders come out very fast. I'm a fan of the sautéed shrimp basil with white rice. The lunch specials are amazing. You get a salad, spring roll and appetizers and then your meal. Drinks like soda and Thai Iced tea is also include. Great food for a great price! The wait staff is super friendly and very attentive. There were a few occasions where they treated me and my friends to free deserts and treats. Only negative is that they stop splitting checks/cards, so you have to coordinate with your friends on who will pay on their card or you all bring cash.", "author": "Karen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "A nice little spot my friend and I stumbled upon. The 2 for 1 drink special enticed us to go in. In terms of food we only ordered appetizers. I ordered the duck rolls, which were fresh and refreshing.  It did not have too much duck which was disappointing but it was good nevertheless.  My friend ordered the crab rangoon. It was really good and had a little kick in it because they added curry. I preferred her order over mine. The staff was friendly and patient with us even though we took forever to order. I would return another day to try out the dinner", "author": "Jasmine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "Good place for a quick and dinner. This is the one of the best Thai place around cobble hill area in Brooklyn. Try their special menu or lunch pre fix and you won't be disappointed.", "author": "Deep B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-19", "description": "This is just for their $7.95 lunch special.\n\nI was pleasantly surprised by how much I enjoyed my meal.  I do love specials, though.  The salad with peanut sauce, wonton, and egg roll that came as sides with the lunch special were just filler.  I thought maybe they had ordered them from across the street at Chung Hing.  They weren't bad, but I wouldn't come back just for them. Regardless, I really enjoyed the main dish.  I guess it's hard to screw up panang curry, but I can't deny that it was good.  All items including a small side of white rice came in a bento box--oh, excuse me--\"Bangkok\" box.  I suppose it made for a quaint and efficient presentation.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "I can always depend on Lemongrass Grill. The Mango Shrimp and Green Curry are both fantastic. The drinks are sometimes buy one get one half off, so that's always nice.", "author": "Yetta L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "Just happened to stop in here for lunch today while walking by and so glad we did! The lunch special is a great deal, the food is really high quality and good portions. I got the tofu pad Thai and it was wicked tasty. The service was also really prompt. I definitely recommend it =)", "author": "Alexa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "4 stars.\n\nI think that I used to eat here at least once a week, every week.  I used to live right at Court and Atlantic, so it was just a short walk for me.  This is where I developed a love for Thai food.\n\nSolid place.  Kinda cramped on a busy night, but nice.  Interesting flavors for ice cream if I remember correctly.\n\nIt's been a while, but this is certainly gonna be one of my stops the next time I'm back in the Big Apple!", "author": "Plenty F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "Love this place! The service is fantastic. The employees are warm and attentive and the food is also great. I come here pretty often and it's never too crowded. Plus they offer an affordable lunch special where they don't skimp on the portions. Five stars!", "author": "Erica D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-17", "description": "I was lured by the $7.95 lunch special, plus I was craving Pad Thai (again).  It was mid-afternoon, a late lunch.  Even though the sign outside read \"lunch special,\" I had to confirm that with staff soon after we were seated.  While waiting for our orders to be served, I used the women's bathroom which was clean \u0026 not a closet.  Returned to the table \u0026 looked at the decor which was simple, a few decorative pieces.\n\nMy friend order Chili Basil Chicken w/ white rice.  Just looking at my friend's dish, I could tell the chicken was boiled separately and then added to the chili basil sauce which looked lacking in chili \u0026 basil.  I asked my friend how's his dish - he said it was lacking in flavor.  So I knew the chicken in my pad thai would taste bland and it did.  \n\nI ordered the lunch special Pad Thai Chicken which comes w/ a fried wonton, shrimp shumai, and spring roll served in a delineated bento box.  Bento boxes just aren't for serving Japanese food anymore.  I LUV bento boxes, all the different food items and flavors which satisfy many of my taste buds.  I savored \u0026 enjoyed everything except the star - pad thai.  I know Pad Thai is made of 20 ingredients, but I found this location's pad thai to be sweet, too little bits of tofu \u0026 egg, and the white meat chicken was boiled separately \u0026 bland only to be tossed into the pad thai dish.  OH, it comes with either Soup or Salad - I ordered the Spinach Soup which was amazing.  This soup had chunks of silken tofu, some baby spinach wilted by the hot broth - it was a hearty \u0026 flavorful soup.  Oh wait, salad was served in my bento box - the salad dressing was sweet, tasted a little like plum sauce, and tangy which enlarged my appetite.\n\nI like the Lemongrass Grill on William Street more.", "author": "Judy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "Love this place! Authentic, Thai food. The service is fast and the staff is friendly. Definitely try the green curry chicken - delicious!", "author": "Tiffany G."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}