{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "Lemongrass Grill is up there for one of the best Thai restaurants I've visited. Located Downtown Brooklyn, it's a great spot to go after the movies (Which I often do). The inside is open and inviting with enough space to seat everyone comfortably. The food is pretty good. I go with my usual, the pineapple fried rice that actually comes inside half of the pineapple! I like that the present it this way. \nOverall, I like this place a lot and try to go when I can.", "author": "Nicco K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Ok... So I been there twice for dine-in and one time for takeout. So, first time I got the drubken noodle thing. A Lot of food but I didn't care about the taste. So, after a long time I decide to give it another try. So I went again and this time I tried their lunch special with my husband. I got the vegetable pad Thai and he got the stir-fry shrimp thing. OMG it tasted Soo good and than on top of it we got a free drink each with outlet lunch special. Some kind of Thai ice tea. It was amazing. I will just go back for the tea... LOL\nComing to food, it was great actually spicy enough had tons of flavour and they had this little salad thing that was really nice and a side of appetizers that were awesome. And to top it all off, it costed us $20 for the two of us and that also included a beer. \nSo next week I got Same thing for takeout. Still delicious as hell. \n\nSo, please whenever you are around here go in and try their lunch special its Soo worth it, and yes the staff is super friendly and nice.\nLove it!!!!!", "author": "Pam K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-04", "description": "This is by far the WORST Thai restaurant I ever been to and I eat from Thai restaurants daily. Let's start with the servers, I gave this place 2/5 stars because they were really attentive and I never had to ask for a refill in my cup. They saw it almost empty and immediately refilled it. Now let's get to the HORRIBLE food, I ordered the steamed vegetable dumplings for appetizer. Absolutely tasteless and disgusting! The sauce that they paired the dumplings with did not compliment it or do the dish any justice. For the entree, I ordered the fried fresh basil rice with mixed vegetables and that was HORRIBLE! The rice and vegetables were over cooked and bland. The only flavor was the lime I squeezed on the rice. I will NEVER return here! I much prefer Spice or Joya.", "author": "Nikiesha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I was craving Panang Curry for lunch and Lemongrass Grill has an amazing lunch menu! \n\nMenu: a wide variety of options\nOrdering: quick and easy\nDelivery: Very fast!\nPackaging: so ordered a Thai ice tea and they wrapped it really well to prevent spillage. \nFood: (Amount) I got lots of curry but not a lot of rice, it was enough curry for two people! Which is great. Order extra rice is you like. (Taste) The Panang curry was delicious and right amount of heat. The appetizers with the sweet chili sauce and house salad was also very good. My Thai ice tea was strong. Which is great because usually you get it watered down at a lot of places. \n\nBonus: they also sent me coconut ice cream which I'm had for the first time! It was heavenly! \n\nOverall a great little place I found next to work. Will definitely be ordering again.", "author": "Aneesa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "Food was okay. The service was alright and they got the food to our table quickly after ordering. It was a group of 4 persons, 3 above the legal drinking age and one below, however only two of us were drinking, I ordered a drink and an appetizer while the friend that was drinking with me ordered Thai fried rice, a beer and another cocktail, least to say the servers kept passing and looking at our table to see if we were sharing our drinks with the under age person. Sooo uncomfortable to have someone watching your every move. They would pass the table atleast two times in a 10 minute span and look at us. Like wtf! Who does that? We know they shouldn't be drinking! The waiter made it known to us she got a ticket for serving under age persons which we totally understood, but why would you make us uncomfortable just to make sure you don't get another ticket. Great place though", "author": "Britainy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "We've had a few crappy Thai takeouts recently, so we've been shopping around trying new places. This one was really solid and I think we'll order from here again. The fried shrimp dumplings were very good, as was the spicy fried rice (it's very spicy). We got two free cans of coke as well, which we weren't expecting.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Good food, quick service.  Had the curry with mock duck.  It was pretty good. People there were pretty nice.", "author": "Robert O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "My husband and I were wandering Cobble Hill on a Saturday after dropping off my computer for repairs. We were heading back down Court St and I had a hankering for Thai food (which happens just about every time I go out). Luckily, we came across Lemongrass Grill. The decor was adorable and the lunch special, wait for it...is EVERYDAY. I'm a picky eater and never finish my meals, so the fact that it would only cost us $7.95/person is what sold us.\n\nYou get 2 dumplings, a spring roll and a salad for the appetizer and a decent sized entree with the special. Everything was prompt, delicious and just overall pleasant. The service especially was very attentive and welcoming.\n\nIf you're in the neighborhood between noon and about  3pm, I highly recommend you try it out.", "author": "Samantha B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-18", "description": "Ordered food for clients and received a busted container, apparently because the liquids were too hot. Communication with their staff was a struggle, time consuming and issue wasn't resolved.", "author": "Fareed I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Very Plain Jane But The Food Will Rock Your World ! Came On A Friday Night , Wasn't Overly Crowded Either (Especially Being Downtown Brooklyn). However We Ordered Grilled Wings As An Appetizer , I Had Orange Chicken With Jasmine Rice \u0026 My Date Had Teriyaki (sides and drink the same). All Was Extremely Delicious \u0026 Filling ... Would've Loved A More Variety In The Cocktails Departments But As Strong As The Drinks Were , No Complaints .", "author": "Diamond P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "My first time eating their pad se ew lunch special. It wasn't bad. The fried wontons were not that great. But I was happy with their salad and Thai iced tea!", "author": "Marz S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "So let me start by saying the food was very good. Drinks also were good and everything was budget friendly. \n\nMy 4 stars became a 3 once my bill came. When I first got to the spot I seen someone I know. I sat at their table for not even a full 5 minutes. I asked a staff member for my own table for a party of 2. \n\nWe eating enjoying the meal and once we're done of course asked for the bill. I notice an 18% gratuity charge and Im totally confused as it states on the menu that 18% is for a party of FIVE or more. So uh yeah its 2 of us so how is it Im being billed for 5+ ppl. The waitress says to me YOU KNOW THEM DON'T YOU. *insert perplexed look here*. We were not charged for the other tables food but definitely was billed for the tip. I told her I know at least 3 parties sitting here so are you now going to add their gratuity to my bill. I couldn't believe she even said that and kindly told her to remove it. \n\nBecause she assumed Id pay someone else's tip without asking me first is why my 4 star was downgraded to 3. Next time ask your patrons if they will be taking care of someone else's bill.", "author": "Nell d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "I recently dined at this place based on a recommendation from my Mother and I must say, I was NOT disappointed. The food and service was EXCELLENT. The place was very cozy and the staff were very amiable.  I had the curry puff for the appetizer and the Thai fried rice (with Shrimp added) for my entree. The fried rice was served in a pineapple and it was very filling. I didn't want to pass up the great drink special (BOGO free), so I got a Mango Margarita and it was yummy!! I will definitely dine there again when I'm in the area.", "author": "Vanessa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "First time here and it's the duck I've ever had.  The service was great and I could stop here but I have keep writing because it was\nwould not post.", "author": "Kerwin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "I've never been to Thailand, but I have heard that there exists a special and sacred place, deep within the Thai wilderness, where the Lemongrass Grill acquires its top secret recipes. I can neither confirm nor deny this rumor, but the culinary treasures that wait for you at this Court Street haunt will help you judge for yourself. \n\nPretty solid Thai place. The lunch specials are fantastic. \n\nYelp is asking me if this place is good for groups. I'm saying yes because this place is good for everybody.", "author": "Zak F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "One of my top 5 Thai food places. \n\nFresh food. Great quality. Great service and delicious drinks", "author": "Bill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "Tonight I ordered in from lemongrass grill and my delivery arrived with an extra order of pad thai that had FREE written on it in marker. I'm sorry....WHAT!? A free entree? I have never heard of such a thing!\n\nLast time I ordered in they gave me free dumplings but this free pad thai was just too good to be true (#blessed). Also all their food is really exceptional. I've had curry, eggplant, string beans, soup, dumplings and three types of noodles and every dish has been worthy of ordering again. Just great, classic Thai food. Oh yeah, and FREE PAD THAI. Like honestly, tell me where else would do that? Never ordering thai food from anywhere else again.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-18", "description": "I was disappointed in this place. The waitstaff was not that friendly and the service was par. We weren't even finished with our appetizer when they brought over our food. They never asked if we needed a refill on our water. And to top it all off, they brought over the check without even us asking them to. I felt that I was being rushed out of there. I would never go back.", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "love this place and happy hour drinks until 10pm :)", "author": "Stacy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "By far one of my favorite go to Thai restaurants. I love their lunch special, so much that it's actually all I've gotten there. It's $7.95 for a drink, salad, small appetizer, and then the main dish. So filling! I love the Thai iced coffee and Thai iced tea because they're both so sweet and delish! I could never decide. For my main dish, I always ask for the beef pad thai to be spicy and they come through with the spice. Such rich flavors in the pad thai and beef is just always a great choice of meat. I definitely need to try other main dishes, but my love for the beef pad thai has made it so hard to do so. Will definitely be a customer here forever!", "author": "Gina P."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}