{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "Its unfortunate that this restaurant has decided that its a great idea to treat its customers like criminals. You need to have a credit card with chip and show a photo ID- and that may not be enough either. So I suggest you bring a lawyer, bring your passport, birth certificate, seven forms of federal identification, one thousand dollars in cash and a letter from your bank if you ever want to go there for lunch. Or alternatively, go to any other restaurant in NY.", "author": "Pablo H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-13", "description": "Ordered delivery which came in under 1hr. \n\nOrdered the vegetable crispy roll which tasted fine but thought it was a little to doughy and not enough veggie filling. \n\nHad a craving of Nasi Goreng since I first had it in Bali and Lemongrass' take on it was quite good. I'd order from here again.", "author": "Crystal D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-24", "description": "The food was good, the service not so much. I will be honest and not forget to mention we did come right before closing, now that, that is out in the open, I will continue. The servers seemed touch and go, they give you one thing and disappear than reappear, this made ordering tedious, because instead of asking if you're ready when they drop something off, they will dash over to another table instead. When it was time for us to leave (we were the only people at the restaurant and not because we taking long to eat we were done, plates were cleared off the table) everyone was cleaning, I mean I understand wanting to go home as soon as possible ( I know they work hard and long) but so do we.", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "Giving them 4 stars only because this is my first visit so I want to make sure there's consistent delish food and good service. \n\nI will def be back!", "author": "Eclectic C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "Went here on a Sunday after a show. Parking was pretty easy on Court street because it was a late Sunday night, I parked right in front. The ambience is calm and dimly lit. We were seating promptly. We ordered appetizers for the table (Thai Wings, calamari and can rangoon). All of which were really good.\n\nThe main event was also very good. I ordered panang curry with chicken. It' was very good, not too spicy with the right amount of kick.\n\nWe had a party of 7, the only a split of 3 cards per table, so you'll need cash if you have a large party. Also gratuity is included in the bill.\n\nThe food is inexpensive and delicious I would definitely recommend.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "My friend recommended this place to me because of the lunch special and how good the pad thai was. I walked in with my friend and was seated very quickly. The lunch special is from 11:30-3:30 and you can get a dumpling, spring roll, wonton as an appetizer I got one of each and it came with a side of salad too. The lunch special comes with Thai ice tea or Thai coffee I believe. The lunch special includes pad thai and also curry. I also ordered a fried calamari appetizer. The wait wasn't too long because they would wait until we finish our appetizers then serve us our food. The pad thai was basically a full plate of food which was really good. Lunch special includes appetizer, 1 protein with your choice of noodle or Curry and also Thai iced tea for only a price of 7.95!  Who can beat that?! The environment was really friendly and they check on you a lot which was really nice! Definitely check this place out when you get a chance! I would definitely come back", "author": "Vicky C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-07", "description": "As A long time faithful customer it brings me total sadness to have to Leave this negative review. My colleagues and I have made this place our go to spot when celebrating each other's birthday during lunch. Everyone of us loved Lemongrass and when asked \"where do you want to go for your birthday? \" The response was always you nowhere, LOL. The food has always been good up until recently. I do not know what is going on but the quality has gone down hill While the prices continue to go up. As a foodie I enjoy good food and I equally despise bad food. Yesterday's visit left me and my colleagues with the decision that we will never eat at lemon grass again. The food was terrible! They used frozen vegetables.Our food was soggy and extremely salty, more than normal. We all had different dishes, all bad. None of us were satisfied. As a long-time customer who has always appreciated Lemon grasses fresh cut veggies Crisp and nice I was so disappointed to taste those soggy frozen Vegetables in my dish. I questioned both the waitress as well as the owner. They gave me some sob story about having to meet the needs of all of the customers and the time and expense that it takes to cut up fresh veggies. Smh, these are the very requirements of a pleasurable dining experience, the difference between a great restaurant and mediocre. The difference between what keeps your customers coming back or not returning. Needless to say it was a consensus. It's time for my NYCT crew to find a new Birthday Luncheon spot. Diners Beware!", "author": "Monica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Came here for lunch today and chose two preset lunches. The orders came very quickly. The lunches also came with a drink of your choice. I chose the Thai iced tea with my meal. My pad Thai portions were very generous and the appetizers were a little bit of everything. Overall, great restaurant for a quick bite or a luncheon with a friend!", "author": "C C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "Nice neighborhood Thai restaurant with a well-rounded menu for eating in and ordering delivery. Hosts and servers are super nice and the food is quite good. First time I visited I ordered the pineapple fried rice and it was served in the pineapple! A real treat! I ordered the same dish for delivery and it wasn't quite as good...because it came in a plastic delivery container, not a pineapple! :)", "author": "Lesley G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "The food was amazing! I got the Pad Thai noodles with chicken and it was oooooooo sooooo delicious. My friends got the Thai fried rice, Pad Thai with beef, and the sweet and spicy sweet and sour chicken. They were all amazing. I completely recommend it. The drinks were good too. It's definitely my go to restaurant now.", "author": "Regheim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Excellent service food drinks all in one tried their grill wing shrimp Rangoon thee best . Cozy good for a birthday dinner or a nice lunch date", "author": "Yvonne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Went here a while ago to grab a late lunch a while ago and I really actually enjoyed this spot. It's a really tiny place but the mint green color really makes it stick out from the surrounding area. It wasn't really too busy when I got here but the food was pretty great. The Pad Thai had thinner noodles and a saucier consistency that I'm used to but it complimented itself so no complaints there! I would definitely come back here again and maybe try their pineapple fried rice. Great little spot", "author": "Sergio P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Went here last night for a girls date with the best friend it was both of our first time which was cool.  I like the interior the colors pop it's not a really big space but it's still spacious and roomy; the decor is a yellow which is calming. We started with the wings which were super yummy with the dipping sauce the grill taste was a plus. We also ordered the Thai fried rice with chicken it wasn't anything special but still tasty and flavorful; drinks I had the lychee mojito and my best friend had this green drink forgot the name. Thai ice tea was delicious and refreshing very good taste for my first time, we decided that we'll be back.", "author": "Mora B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "The food here is amazing. The pork chops are great. The duck tamarind, and duck sam rod are the best. Also the chicken thai fried rice is really good. My family and I literally eat here every week. The owners are very very nice people. They are so friendly.", "author": "Priya P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-12", "description": "Stopped by here in an effort to try something new, as it's probably the only Thai place I haven't been to in this neighborhood... didn't leave very happy.\n\nStarting off, the mixed drinks -- which are buy one get one free as of writing this review, and I can see why -- are terrible. You'd be better off avoiding them and just getting a Singha.\n\nFood was okay, a bit too greasy and clearly thrown together from a bunch of pre-prepared ingredients, then probably microwaved. I wouldn't expect otherwise, but it tasted too much like that to really enjoy it. At least try to mask that if it's what you do.\n\nAlso need to mention that the service was slow and pretty uninterested in helping customers, everyone around us was complaining during the meal so it couldn't have been a one time thing.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "I love going to this place. Food is awesome. Prices are reasonable.  And customer service is pretty good when it's not crowded. When it gets crowded, then you might have a longer wait time. However the rice that's always given with the dishes, always seem to be a slight undercooked. Most times I'll get perfect rice but a few times it will be undercooked. Also they have 'imitation duck' which I think is very weird... please don't order than. Always get beef or chicken !", "author": "Starr Ann H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "I love it here especially for the drink special, buy one get one free from 4-10pm. I recently started dating and brought my boo here,  and he like it as well. A lot of choices,  good customer service  and the food is good. Not too expensive neither.", "author": "Joannie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Every time me and my gf come here, we're never disappointed with the food.  Haven't had a bad dish yet.  However the customer service can improve", "author": "Jamel A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-18", "description": "Most disgusting Thai restaurant!\n\n\nI went here expecting a cheap and even mediocre Thai meal and they managed to disappoint. They have a happy our deal but the drinks are 100% sugar. I am not sure how they manage to put so much sugar in a cocktail. When I informed my waitress about the diabetes giving drink, she told me that there was nothing she could do and I had to just deal with it. I ordered shrimp pad Thai and I got chicken with my shrimp meal. I do not eat chicken!!!!!!!  They good everything together and just spoon shrimp on top of the chicken Pad Thai. This place is beyond disgusting!!!", "author": "Aisha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-28", "description": "Was my favorite Thai place in whole NYC . But STAPLE in my calamari + bull shit response regarding it, giving one free appetizer . I didn't hear over the phone that they were sorry , it was just a quick f**k off answer .", "author": "Laziza K."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}