{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-20", "description": "Food is mediocre at best.  The service is awful. I sat down, dining alone and the restaurant maybe had three tables full, it was lunch time.  I ordered an app, salad and main and received all three at once.  As if that's not annoying enough, twice they tried to clear my salad from the table and I had even touched it yet. The servers actually lifted the dish from the table. Don't waste your time, money or the calories on this food court fare.", "author": "Sean K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "I love coming here for dinner after going to the nearby movie theater. You can't go wrong with any of the food and the staff is really friendly. Tonight I had the Oceans Four dish because I was craving seafood and curry, and it was great.", "author": "Sasha F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "Came here a little less than a month ago. Was looking for some Thai food really late on a Sunday night. We got there about 20 minutes before they closed. They allowed us to be seated anyway. The hostess kindly told us that we would have to order shortly, so the chef can cook it for us. The food came out quickly. Went with some Fried Won Tons and some Chicken \u0026 Shrimp Pad Thai....very good. The portions were really good and the price was more than reasonable. I was actually pretty surprised it was as cheap as it was, considering I was back home in NYC. Definitely a cool little spot....would definitely visit again whenever I'm back home", "author": "Eric J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-11", "description": "Food is always great but had a super weird experience. Asked for a Diet Coke with my lunch special.  Was told that doesn't come with the meal. So I asked what does come with the meal and was told 'hot tea, Diet Coke, Coke, Sprite'. So said 'ok ill have a diet coke'. Again was told that doesn't come with the meal.  Um what?", "author": "Helen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "We came for my birthday and the food was AMAZING! !!! Especially the basil fried rice w/ chicken also try the lychee shrimp. =)", "author": "Esteyban E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "Not bad at all this little Thai place in my neighbourhood.\n\nI had the crispy steak. it was really good. I enjoyed every bite of it. \n\nIf you check into yelp you can get a free beer. The prices range between $12-$17 for a main course.", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Great value- I always leave full. They offer a generous appetizer-entree lunch special for $8 and when I went today they also were offering free Thai Iced Tea! Good portions and their food is delicious. Menu has a good range of options. Service is fine, nothing special. I recommend!", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Great place to get together with some friends or groups for some good Thai. Great lighting and great service! I had the Siam Chicken dish that was de-lish!", "author": "Steven P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "The thai fried rice was good, as well as the calamari. The ambience of the restaurant is also nice.", "author": "Emma B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Food was amazing we for sure be back for more great environment and staff. New to the area and very impressed. Nice ambiance as well", "author": "Chad D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "This restaurant is great! Me and my boyfriend enjoy ourselves and meal everytime we come. The wait staff is very attentive! Will recommend.", "author": "Brundy F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-03", "description": "Went there with a friend of mine. It was empty. The atmosphere was so so. Fairly quiet. The food was okay nothing really special. The food reminded me of Sea Thai. Same taste just different place. The staff was kind of rude towards the end.", "author": "Tamarra H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-12", "description": "Wayyyyyy tooo sweet. Came here on 2 occasions and I've ordered the pad thai and the drunken noodles. Both were way too sweet and my drunken noodles weren't spicy at all.\nPortions are generous, but do not want!! I love Thai food and will usually devour/inhale everything on my plate, but here I couldn't finish b/c the food just wasn't that good.\nStill on the search for decent Asian food in this area!!", "author": "A. M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-23", "description": "Came here for lunch with a friend and we both ordered their lunch specials. I got the Kee Mao with Shrimp and he got the Chicken Pad Thai. When they first brought it over, it was reversed, Chicken Kee Mao and Shrimp Pad Thai. We let them know and then had to wait a really long time for our order once again. You would think that they would apologize or give us something for the inconvenience, but nothing. The bento box of food was okay, but my friends noodles were not the normal flat pad thai noodles at all, so that was a bit of a disappointment. I think I will stick to the Lantern or Joya for my Thai cravings at work from now on.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Love how fast it is and the food is great and consistent.  Pad Thai was great!!!!  Had my son with me and they had high chairs, lots of places don't.  First time eating in at Lemongrass and it's just as great as their takeout!!!", "author": "Shawna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "The papaya salad was awesome.  The basil rice was tasty.  Reasonable price.  Great for a date.", "author": "James C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-10", "description": "I've been here a couple times mostly due to its location and the fact that the other Thai joint across the street is always ridiculously packed. This place feels slightly more low key and family oriented, with nice decor and quiet enough to have a conversation. \n\nWhenever I've been here the wait staff has always been attentive, so I'm surprised at the negative reviews--but maybe I just happen to go at off-peak hours.\n\nMy main complaint is the fact that both times I've gone, there have been communication issues resulting in wrong orders. I'm not quite sure where it's stemming from because everyone I've encountered speaks English well and seems intelligent enough, so my best guess is that perhaps the menu's descriptions are not accurate enough/the waitstaff is not as familiar as they could be with the menu.\n\nBoth times that I have ordered tom kha gai soup (which is listed as such with a \"Ga\" on their menu) I have gotten tom yum instead. The second time this happened I asked for clarification on their soup because, obviously, I thought it was strange that the same mistake happened twice in a low-rush hour. They were kind enough to make the correction and bring me the right soup, but I noticed my server wasn't clear about which soup I was speaking about until I referred to it as \"coconut soup\" instead of tom kha, so maybe he isn't familiar with that name? Odd since it's listed on the menu that way.\n\nThe tom kha soup itself contains a lot of mushrooms (very small whole mushrooms with no distinct flavor as opposed to slices) and generous chicken pieces. Definitely one of the most hearty variations of the soup I've ever had. I personally don't care for so much in my soup, but the broth was okay enough to quell my craving--for now. \n\nI also placed an order for what sounded like a spring roll from the menu description--only to receive a plate of mini veggie pinwheels (like the kind you might buy for a party platter) arranged in a sushi formation. Not what I was hoping for!\n\nPROS: Nice location, intimate atmosphere, appealing food presentation, attentive waitstaff on off-peak hours, takes credit card ($10 minimum), and \"A\" sanitation rating.\n\nCONS: I feel like I never know what I'm getting when I order, and honestly, I've had better pad thai and tom kha gai at Republic on Union Square.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "We were looking for somewhere to eat whilst wandering around Cobble Hill and the Lemongrass Grill caught our eye.  I wasn't necessarily in the mood for thai, but their $7.95 lunch special had me sold.\n\nThe food was plentiful and good.  Not the best Thai food I've ever had, but tasty nonetheless, especially for the price.  The wait staff was attentive as it was pretty empty, and they were friendly in explaining the dishes to us.\n\nOverall I'd come back again, but it wasn't amazing to the point where I'd go back before I some other restaurants nearby.  One nitpick: the menu says the lunch special comes with Spinach Soup.  Perhaps I should have confirmed this, but as a vegetarian I didn't expect a miso-esque soup full of chicken to arrive in front of me.  My boyfriend ate it and he said it didn't strike him as spinach-y, so they may have done a swap but I felt that we should have been informed.", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Awesome Thai food, price and iced tea! There are a bunch of Thai restaurants around this area but I always find myself coming back to this one. Crab ragoon, pad Thai, pork chop lemongrass are all my faves here. I can't wait to explore more of their menu. \n\n** the staff are welcoming and fast.", "author": "Joe M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "Eh it was...... different. Wasnt good wasnt bad. Just different. lol thats all i can say", "author": "Amanda B."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}