{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "My first time coming to lemongrass and I have no complaints!!! Their fried calamari was great! Pad Thai with shrimp followed up with an amazing taste too. The workers were very polite and provided great service. Ambience is ok. Drinks are good but not too strong. Overall nice place to stop by for lunch or dinner.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-26", "description": "I have always had take out from this restaurant and through the years feel they must have changed chef's in kitchen and quality has diminished from when it first opened. I always have enjoyed their Pad Thai, Spring rolls and Chicken Satay. Well within this past few months it's turned for the worst. The Pad Thai no longer has flavor and ironically no crushed peanuts as in past, and the Chicken Satay tastes like rubber and inedible... at least spring rolls still are good. I had to return my take out Pad Thai recently due to it having no flavor and noodles so dry. Hopefully Lemon Grass takes in to consideration and makes the changes for quality then short changing on their ingredients.", "author": "DW W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "I like eating here because its located on a cute block in Cobble Hill. Really good Thai food. I went here with family which was great because everyone ordered something different and I got to try everything. \n\nThai BBQ Ribs, Thai Chili Wings, Pad Thai, fried calamari, Cashew King w/ Chicken, Thai fried rice, Chinese broccoli, pork chops.\n\nGreat service and affordable food!", "author": "Erin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Love this spot! I used to be all about Joya down the street but although this place they're comparable I must say this spot tops that any day. \nLunch special for 7.95 included appetizer and dessert. \nMy husband and I ordered the lunch specials while there with our 1yo who was offered a bowl of rice for free by a sweet old lady (who worked there obviously lol). \nAll the meals Ive tried (pad thai and pad see ew) have been refreshing (not weighed down by greasy oil) and decently portioned despite being lunch sized. The calamari was also delicious.\nBeen here quite a few times (even had it delivered to my job twice) and have yet to be disappointed.", "author": "J T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "Service was good, drinks good, not expensive at all great atmosphere very relaxed the food was seasoned to perfection not too much salt not too much spice it was just right. The calamari was great, and the crab Rangoon was also great.", "author": "Fabienne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Reliable local Thai place.  The food is always tasty and it's good for groups despite the modest size of the restaurant.  The noodle and rice dishes are good, of course, and check out the grilled wings and the Volcano Chicken too.  Great for takeout!", "author": "Jenn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "I came here with a friend after a movie. We were promptly seated. Even though we were seated in the middle of the restaurant and it was very warm inside, whenever the door opened, the cold air would come all the way through the restaurant.\n\nEither way I ended up ordering the beef pad thai and my friend ordered the chicken fried rice. I love that the fried rice came in half a pineapple. Interestingly enough, there was some kind of sauce on the pad thai. I think they sauteed the beef in a sauce then threw it all on the pad thai. Not sure why but it tasted better as leftovers. \n\nVery pleasant dining experience and they have a full bar! Affordable as well and they take all major credit cards.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "I'm not sure where to even begin with the most horrible service we received at this restaurant.  We first ordered 2 martinis.\nThe waitress seemed confused when I asked for a twist so I told her her olives were fine.  After waiting a very long time time she brought back 2 vodka sours.  \nWe told her that is not what we ordered but she insisted that it is what we ordered.\nThen the person who made the drink came back and insisted that the drinks were martinis and pointed at their drink menu.  She pointed at a tropical drink they call some fruit martini and still insisted that was what we ordered.  And refused to take the drinks back.\nWe really were taken back by this and told them to take the drinks back and they refused to take it back.  Just offered more vodka.  This became bit of a scene, they started to become more rude and continued to blame us for their mistake. So we decided to leave.  As we were leaving the waitress yelled at us very loudly \"never come back here\" in front of all their customers.  I have never been so humiliated in my life.  I am still in shock from the mistreatment.  Obviously I will never go back.", "author": "Kaysh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "Lunch! Can't beat it, if you are in the mood for Thai this is a must try (please excuse the rhythmic nature).\n\nPad Thai with Chicken. Yum.\n\nPortions and Price on point.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "Came here after checking out a few other restos in the area. \n\nThe ambiance is really good, great music and decor. I like the blue/purple lights behind the booths.\n\nFor the food, I had the cashew king with mock duck, it was delicious! \n\nWould come again!", "author": "Benjamin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-21", "description": "Delivery took 1.5 hours for a lunch special...... so there's that. I got the pad see ew? With shrimp- it was not bad, not good. The shrimp was pretty good quality and I enjoyed the duck sauce.... but I will definitely not order from here again", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-23", "description": "We went here kinda as a second option because the wait at the popular Tai place across the street was to brutal to bear.\n\nTo my surprise the place was quite decent, actually. We had party of about seven and they were able to accommodate us rather quickly. I really had no expectations either way but the meal was tasty and the service was on par.\n\nIf you don't live in the area it's not worth any special trips. But if your in the cobble hill area it's not bad for decent dinner Thailand style.", "author": "Tom C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Excellent quality food/decent prices/good service.  The only complaint I had was they are a little slow during lunch hour.  Otherwise, very good place ...", "author": "Carl E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Food was amazing. Highly recommend eating here. Pad Thai and Tom Yum soup were the highlights.", "author": "Korah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Nothing but good things to say. I always go back because they're so consistent. \n\n- Portions are excellent and full.\n\n- I love their fried shrimp with mango dressing/sauce. I also love their rice and the pork chops are amazing. The drinks are greattttt. \n\n- No complaints on service.\n\n- The atmosphere is calming \u0026 semi romantic. The price is within an affordable range--- so you can take your cheap friends here and still feel like you went somewhere.", "author": "M. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "The best pad thaid I've ever had. The broad noodles with tofu and broccoli were delicious too.", "author": "Hanna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "I've been here twice and honestly speaking I always get my dishes spicy and I think I've found the place that actually got it right. They're drunken man noodles are a must try. They're appetizers were good too, got the lychee shrimp and calamari. But liked the calamaris better. Plus they're lunch specials are probably the best deal I've seen anywhere.", "author": "Zannatun A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "Worst service every after 20 of past our delivery time I called and they said the kitchen lost the order. Horrible, I had to call them to realize this, this was our first and last order.", "author": "Evan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "This place was great! My boyfriend and I LOVE Thai food so we decided to give this place a shot. My boyfriend got the Pad See Yu and it was absolutely delightful. I got the Chicken Pad Thai and I have to say it was great! Other places where I've had their Pad Thai - it was not that great. The ingredients definitely tasted fresh. Service was quick and super friendly. I will defnitely come back. Also the food there is so inexpensive! Another plus!", "author": "Michelle Carolina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "Fried Thai style dumplings, curry puffs, fried calamari, lychee shrimp, crab ragoons, Chinese broccoli with beef, shrimp, duck with thai garlic sauce, seafood ginger joy and sticky rice...Geezuz this place always satisfies whether delivery or sit down. Try and try everything, I do!!!", "author": "Ashti D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}