{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "It's fun to be served fried rice in a carved pineapple. And they have sizzling skillets! Mmmm...pineapple.", "author": "Daniel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "Excellent chicken with green chilli.  For a special treat, order some Jameson inside your Thai iced coffee.", "author": "Randy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "Love the oxtail and the volcano chicken. Great restaurant and love the environment.  The wait staff is very friendly and attentive. Will definitely recommend.", "author": "Que S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-26", "description": "My friend and I came here for a weekday night dinner, plenty of seats. We got sweet basil with rice and pad see ew. Food was what we expected.", "author": "R S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "This restaurant hasnt disappointed me yet! Ive been here a handful of times and each time the food had been the perfect temperature,  amazingly seasoned,  and quickly delivered. The service is unparalleled. We enjoyed our meal very much!", "author": "Jeffery M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "I've been eating at Lemongrass on and off for about 6 years. The food is consistently delicious and reasonably priced. A variety of fresh flavors make it hard to decide on a meal here but honestly, it's hard to go wrong.\n\nThe inside of this restaurant is cute, predictably decorated in shades of, well... lemongrass. Lemongrass is good for either casual lunch or dinner or even a romantic dinner. Service is one word: effective. Don't expect to be doted on, but you also won't be ignored. Go for the food and you won't be disappointed!", "author": "Yan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "Excellent food. Panang curry was very tasty. Only marking down for music and ambience could be improved. Regardless we will be back.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "Great Thai food! Get the volcano chicken, huge portions, great for dates. The service was excellent, atmosphere and decor was cool. And the menu options were really varied but totally affordable. Highly recommended!", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-26", "description": "Service:  Seated right away, very attentive and gave some recommendations for appetizers and menu items.  Checked on us often and was very accommodating to my more demanding auntie.\n\nFood: Some of the appetizer portions are on the smaller side although beautifully plated.  Hot and sour seafood soup was well seasoned.  Green papaya salad was made well and wasn't too sour or salty which can happen sometimes with the dressing. Main courses: tried the String Beans Basil Pad Prik King which was done well, other recommendations are the fish--red snapper fried, it was real fresh and the whole table enjoyed it.  Dessert: don't recommend the fried cheesecake, but the coconut ice cream was pretty awesome. the fried bananas are okay, nothing spectacular. \n\nAmbiance/Price: Chill place, easy to have conversations without having to shout, average price for the city and for an asian restaurant.", "author": "stacy o."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "One of my favorite local spots to grab lunch. Very inexpensive, quick, and the service is always great. I'm a huge fan of their pad thai and the steam dumplings are delicious.", "author": "Daphny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "This place is great. It's a nice quiet place to go with great service and ambiance. The food is delicious and I get the same meal every time. Nice place to go out on a date.", "author": "Sheena R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "Always dependable for fresh tasty Thai food in a nice environment. Excellent country dumplings and fish dishes. Recommended!", "author": "Jason G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-22", "description": "Great selection of vegetarian offerings. I went a little early for dinner and the place was empty. The staff was unbelievably helpful to the point of fault.\n\nBetween the accent of the  waitress (southeast asian) and my dining companion (trinidadian)...no one understood each other!  Country style pork dumplings arrived instead of vegetarian dumplings. \n\nCouldn't really get into the meal. Every 2 seconds we were being asked whether we wanted some else.  Yeah, like how about leave us alone for a moment. Jeez.  So intrusive we felt it was a subtle message \"order- eat-consume-", "author": "Zoe H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-06", "description": "This place is great. Service is very friendly and fast not to mention how delicious the food is and fair the prices are. If your in the area and are looking for something to eat this is a must.", "author": "Marija D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-22", "description": "After watching a movie up the street my boyfriend and I meandered down court street for a place for a romantic dinner. Wonderful atmosphere with fancy cocktails. The meal was flavorful and enjoyable. The fish grill special was a bit more than I bargained for so prepare for a large whole fish to share with others. Not an individual platter.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-29", "description": "The food was awful, took forever to be served, and was overpriced.\n\nNever again!", "author": "Joel T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "My boyfriend and I passed this restaurant on a night out and decided to give it a shot.  We ordered takeout as we were not planning on dining at the restaurant.  The food was cooked and rather quickly which was a plus.  We left but returned 15 minutes later because we changed our mind about staying.  We asked the hostess if we could sit and eat the food we just bought.  She informed us that we couldn't as the tables were reserved for customers.  Apparently, we are no longer customers since we already paid for our food.  Additionally, we would be charged a service charge if we sat down.  A service charge for what?!  In the end, my boyfriend and I ate our food in the cold on benches in front of Starbucks.  The most hurtful part?  I enjoyed the food.  Nonetheless, we are never going back.", "author": "Danielle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "First Time Trying This Place Today , Stopped By During Thee Lunch Special. Very Medium Sized Placed With Very Fast Waitresses. Waited Approx 5 Minutes For A Table For One. Immediately Offered Water. Looked Over Thee Menu \u0026\u0026 My Waitress Popped Up \u0026\u0026 Explained Thee Lunch Special Which Included 3 Appetizers \u0026\u0026 Entree. Decided On Thee Shrimp Pad Thai Noodle \u0026\u0026 FREE Thai Ice Tea. Thee Food Filled Me Up So Quickly \u0026\u0026 I Still Had So Much Left Over . Decided To Take Out Thee Rest. Bill Was Only $9.74 ! Will Be Going Back Soon . Maybe Every Week ;-)", "author": "Keena C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "The Tom Yum soup is a cut above those in nearby Thai places . A great blend of shrimp and lemongrass flavors with a strong chili lift. Good Pad Thai  and steamed shut mai. A great warm place as the world gets colder", "author": "Diane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-06", "description": "The food and service is good. Very affordable and wouldn't kill your pockets. It has a casual/after work feel to it.", "author": "Mike W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}