{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Not only is this place kinda pretty, but the food is pretty darn good. The Mango Chicken was delicious, I highly recommend it! We also had the chicken skewers which came with this peanut sauce that just made it better.The servers were kind and patient. I would come back!", "author": "Zadia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "Do not eat at this horrible Thai restaurant! Don't believe the hype. Today is the second time they completely dropped the ball with my meal. My so-called \"sweet and sour\" stir fry was more like bland and bitter. The first time I ate here, they burnt the tofu in my fried rice to the point where all you could taste is an overwhelming burnt taste. Tried to give them another chance but ended up disappointed again. Too many other Thai places in NYC to put up with this crap. Take my advice and go elsewhere!", "author": "Jay H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "Never disappoints! They have a happy hour special on weekdays until closing, buy one get one free drinks. Lemongrass is always a clutch option and the food is freaking delicious!", "author": "Gessie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "This is one of my quick go-to Thai spots when I'm downtown Brooklyn! I've visited 10+ times over the last year. Honestly... it's can be a hit or misses depending on the chef making the food, but mostly hits, I do recommend this place at times. Their prices are great for drinks and food, they have specials and decent service.", "author": "Seraiah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "This was the spot that I always walked passed because i use to be a huge fan of cafe chile but once they started going down hill this place got it's shot. i gave it a try. Its pretty good. I had a couple different things off the menu but the one thing that was memorable to me to this day was the lamb chops. Oh MY Goodness they were amazing, well seasoned and just strait up delicious!", "author": "Racquel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "If you're looking for amazing Thai food, especially pad thai, you can always find some in Brooklyn. Lemongrass Thai is one of those Thai places that is authentic and delivers on the taste all the way. I ordered for pick up and the order went smoothly. They packaged it so well and cautiously since I stated I had to travel far. Very accommodating and friendly.\n\nNow on to the food. My chicken pad thai was on point. It hit the spot of my comfort food the night I had it. My husband got their version of drunken noodles and he loved his food as well. The Thai ice tea was good and we got two free ice teas. What a pleasant surprise! There's no question whether I'll be back. Lemongrass Thai is your way to go for some good old authentic thai!", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "This restaurant is the best, their customer service is great their prices are also very good. Lunch special is about 8$ which includes 3 appetizers one entree and one beverage. The appetizers is a salad , spring roll, and a wonton , all very tasty. You have s big selection of entree choices as well.", "author": "Gaelle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Best deal in the neighborhood. You get an assortment of appetizers, a small salad, a surprisingly generous entree *and* a Thai iced tea for less than ten bucks. Seriously, folks. You cannot beach this lunch special.", "author": "Siobhán H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Came here once for my 16th birthday \u0026 the food is great \u0026 the dessert ? OMG  Not to mention the sweet, patient staff.", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "I love this place!! It is definitely my \"go to\" place to grab lunch or even if you want to do a cute little date night .. I love their wings and shrimp Thai pineapple fried rice.. oh and their fried ice cream is amazing too.. did I mention that even with the food being so amazing the menu isn't very expensive so that another plus", "author": "Kay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Lemon Grass grill  location  is at Downtown Brooklyn. \nYou can take the 2,3,A,R train to court st Via. Jay St \n\nI come to this place every time I am at Court st. \nI would say this place has good fried rice. \nI recently tried the Pineapple fried rice and it was delicious! the pineapple is very healthy and cooked very lightly with the rice. It makes the rice refreshing and tasty. I would recommend you this if u like pineapple. \n\nFor Appetizer I get \nFried calamari  \nDumplings \nCrispy rolls \nThese are the best! \n\nI also love noodles . Get any they're all good.", "author": "Jannu B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "This is my favorite Thai food place. The lunch special is such a good deal, the environment is relaxing and fun, the food is so good, and the service is quick! I probably go here too often, but I love it.", "author": "Lauren O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-27", "description": "I'm only giving 3 stars cause the drinks are bomb now for the food .... not good chicken was raw not cooked seems like they love broccoli as a side because you get all the broccoli nothing had flavor the plate you see in the picture was not and I repeat was not eaten at all very nasty  I would never go back", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-03", "description": "Little small restaurant. I'm giving them 3 stars because their customer service could improve. The tables are pretty small so all we asked was for the unused chair to be moved for more leg room and the waiter responds why would you want to move it several times. We have you our reason already.  VOC must not matter too much to them. Got the wonton soup to start and Thai shrimp fried rice with some Thai beer. Food was a little greasy for my liking so I'm giving 2.5/5.", "author": "King N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "Lemongrass has been here for a VERY long time in Cobble Hill. Seemingly the decor has not changed since the 2000's. \n\nThe food is ok. The crispy fried duck entree I had was good but it wasn't anything to write home about. The spring rolls were very very fresh, which is a plus in my book, but it didn't quite have that explosion of flavor that I'm used to in Thai cuisine.\n\nOverall I would recommend Lemongrass. It is still some of the best Thai food you can get in Brooklyn. Now, Queens it simply does nto compare too.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "I love their Thai fried rice, which is served in a pineapple (my favorite fruit). I've been here numerous times and I always purchase their Thai fried rice with chicken and shrimp. The sweet \u0026 sour sauce tastes great with the rice.\n\nThe restaurant has a calm ambiance and all of the employees are friendly and smiling. Seating is done promptly and parking in the area has never been a problem. The food is inexpensive and I would definitely recommend.", "author": "Ayaa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "I got delivery on Seamless here. I got two things here: Crab Rangoons and Basil Fried Rice with Chicken. The fried rice I have no complaints. Filled me up and I was a happy camper. The Crab Rangoons I didn't expected it to be mixed with curry paste and I wasn't a fan of that. I expected it to be just cream cheese as the filling, so I won't be getting those again.\n\nDelivery took about 45min - 1hr. No complaints with the delivery man. Probably will get food from here again when I'm feeling Thai for dinner.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "The chicken fried rice is my favorite  it's so good!! They also have really cheap drinks and lunch and dinner specials. I've been here three times and I always get the same thing I have a problem  the waiters/waitresses are always super nice too! #supportsmallbusiness", "author": "Tajmah I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Just had a great lunch at Lemongrass. Pad See Ew was perfect. Asked for it a little spicy and chef complied. Came with a nice salad with a small spring roll and dumpling. Thai iced tea was good. Service was great, staff very attentive. Good can out quick. Definitely will come back.", "author": "Anthony V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "WHO: party of 3\nWHY: Pre-mother's day foodie delight\nWHAT: (Deets) generous portions in one serving each of Grilled Wings, Crispy Duck Salad, Thai fried rice (no egg), a veggie dish with tofu I forgot the name of lol, Thai Iced Tea \u0026 Thai Iced coffee. The wings were flavorful; they had the crisp of a fried buffalo wing, without the added calories/fat. The crispy duck pieces were perfection...OMG...the salad? Not so much. It was very salty and very sweet. I poured the dressing into the saucer below the salad bowl and muted the flavors with white rice. That's when I was in my zone...mmmm. Let's have a conversation about the presentation of the Thai fried rice...it comes in a lengthwise hollowed pineapple half. It's fragrant, and brings a great balance of salt and sweet. The Thai Iced tea was VERY sweet. I added about 1/3 glass of water to make it more palatable. My mom said the Thai iced coffee was Delilah as-is. I'll try THAT next time. Overall, I enjoyed the meal (but most especially the company) once I put my remixes in place.\nWHEN: 5/12/17 4:30p-ish\nWHERE: dine in\nHOW: bike/ public transportation 2/3/4/5 To Borough Hall\nBATHROOM: 1 stall, gender neutral \nWIFI: beats me\nDRESS CODE: as you like\nSERVICE: friendly, prompt, attentive, and well-times\nBOTTOM LINE: I will return.\nTIP: There are lunch specials 12-3:30p", "author": "Minah M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}