{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "Another Brooklyn favorite of mine although I'm pretty sure they are a chain all over nyc. The fried tofu is rather cheap and very tasty, in fact I was so hungry that I got 2 orders of it. I don't exactly remember what I ordered for an entree although I recall it being a large bowl of mixed veggies, tofu, and curry with a plate of white rice. My girlfriend ordered some kind of carcass, I'm sure it was tasty as dead animal tends to be.\n\nOne thing I noted was how clean and nice looking it is.", "author": "James H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "Tasty \u0026 inexpensive meal. Friendly staff. Warm \u0026 cozy.", "author": "Charrise P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "Great lunch special and good, prompt service. Definitely recommended if you need a quick bite.", "author": "Danielle N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "My boyfriend and I went to Lemongrass last night to eat while we waited for a 12:30am movie. The ambiance was casual , the lighting was just right and the background music was set at the right volume. When we arrived, we were seated immediately. Here is why I gave the restaurant  3-stars. After about 10-15 minutes we had to flag someone down to place an order. I do wonder how long the waiter would have waited before coming to our table. We ordered Crab Rangoon as an appetizer which wasn't bad. It had a nice creamy texture. I then ordered the Thai Fried Rice with pineapples and I was pleasantly surprised at the presentation. The rice was served in half a pineapple. My boyfriend order the Chicken Pad Thai Rice Noodles. Anyway, so while we chit chat and ate, the waited never returned to ask if we were okay or if we needed a refill on our drinks. Again, we had to flag the waiter down when we were ready for the check. The food was okay and the prices were very reasonable, but the service needs improvement. I will try them again--let's hope the service will improve.", "author": "Odessa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "We take out from Lemongrass all the time. Their string beans basil is delicious and always what I order. They made an error once in the order and not only had the food redelivered but they called me the next day and offered a free dinner as an apology. That's customer service. I'll still continue to order from them time a d again.", "author": "Thomas R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-05", "description": "My husband and I were in the area shopping for Groceries at Trader Joes. But we were really hungry and decided to stop in at the Lemon Grass restaurant- because we figured  \" We love Thai food and how bad can it food be...\" well, needless to say we got our answer. \nWhen we 1st walked by - we should have know better because it was Monday at 7:00 pm in the summer - and NO One was dinning in the restaurant- Clue #1\nWe were greeted with good service - but the food was really bad. Not good!!!! I figure let me go safe  and order Pad Thai --- and that was a wash and a waste of money. My husband had a more exotic dish with curry and Mango - and Boy was he disappointed. The view was good we sat by the window. But the food was so greasey and ladden with salt it made me really mad at my self for eating it. I am big on desserts- but I was so disappointed with the main course I decided to not waste any more calories at this spot..... They will not see me again (if i can help it)\nThe only good thing was the Thai Iced tea", "author": "Maria M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-29", "description": "The food was ok, yet my review is based on the service. We entered on a Saturday night. It was not crowded, so we were seated by the window. After about 15 minuets of being ignored a surly waitress practically threw the menus at us. Some one else brought us water. 10 minuets later she came to take our order but didn't ask if we wanted anything thing to drink. We ordered an appetizer for which she brought us 2 plates, (it was for a party of four) The food was brought out and again dropped at our table. Never did we get a can I help you! When we asked for the check, again because we were being ignored, she seemed annoyed. I thought she must have been having a bad day because another group of minorities came in who received the same treatment. Then I noticed a 'white couple' who were treated with a smile and even where given drink menus...We left vowing never to return  again.", "author": "Julia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "I would say that this is one of the most reasonably priced lunch specials that I've come across.  I paid $7.95 for a chicken pad thai which comes with 1 spring roll, 1 dumpling and one other appetizer which I forgot, in addition to your choice of Thai iced coffee, jasmine tea or Thai Iced tea.  I ended up giving my appetizer to my almost 4 year old daughter for her to eat in addition to part of my pad thai--I'm trying to watch what I eat.  With ordering a separate beverage for my daughter and a dessert of coconut ice cream ($5).  The ice cream was in a large portion of 2 scoops and we ended up sharing that one as well.  Coming from a neighborhood where there are no Thai restaurants, the versions that come out of our Asian restaurants in the neighborhood are just not the same and lacking in flavor.  Lemongrass Grill's Pad Thai had lots of flavor.  Please note, if you are going to use a credit card, they have a $12 minimum.", "author": "My T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "My girlfriend cant get enough of this place so we keep going back and I keep getting more bored of it. Its consistent and you never have to wait long but I haven't been thrilled with my meals there.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-28", "description": "Meh. I've experienced better is the perfect way to review it. This joint claims to be Thai,but, the dishes that they offer are NOT authentic. Nice space and all but people come for the food. \n\nI would recommend all of you to try Udom in Prospect Heights. There, you will have authentic Thai dishes. Everyone working there is from Thailand. They know how to cook good Thai food. Space,service and food - all thumbs up!!", "author": "Fork U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-10", "description": "I order from here A LOT. mainly because it is around the corner so its fast , but it also consistently reliable. Ive never had to throw away anything Ive ordered from here because it showed up at my house as a bowl of mushy, curry, unidentifiable something.  Dishes I recommend: Steamed Vegetable Dumplings; Pad See Yu; Curry Puff (greasy as hell but tasty as hell); String bean with mint. Beware: their pad Thai is boring.", "author": "C S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-28", "description": "Lemongrass was the first time that I've ever enjoyed Thai food - the food has always been delicious and I'm hooked on their Thai Iced Tea!\n\nThe decor is sweet and simple.", "author": "Beehive H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-16", "description": "The boyfriend and I ordered two noodle dishes (noodle mao and black fun) ,and I grew leery as I saw them on the plates.  They both look almost the same, and not having high expectations, I immediately thought they would taste the same as well.  I was wrong.  Both dishes were awesome and tasted entirely different.  I ordered my noodles extra spicy, and it was EXTRA spicy.  Be careful here (in a good way), because unlike other Thai food chain restaurants, you might just get what you ask for.", "author": "Jonathan Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-06", "description": "I'm lunching my way thru all the neighborhood Thai spots and the $7.95 lunch special is about as good of a deal as you get 'round here parts: entree + soup/salad + appetizer!  The quality is solid, a serviceable pad thai (wish they didn't shove the peanuts and sprouts in a separate compartment for takeout though), slightly better-than-avg and substantially-sized vermicelli spring rolls, and salad dressing with a kickin' peanut sauce.  I'll be back, but only once I finish my tour of Thai joints within walking distance of Borough Hall.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "I lived in the neighborhood for months, but didn't discover Lemongrass until I moved.  I've only ever gotten take out, so I can't account for the dining experience.  Never been disappointed by my food and make a point of going when I'm in the area.", "author": "Cali G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-11", "description": "i ordered red curry with chicken for take out.\nit was good, and the stuff was very nice and friendly.\nit took only five min. to get my meal. that's fast!\nthe curry was quite good, but it was literally chicken curry.\nhardly had vegetables..i hoped.", "author": "GO-GO-YU-BALI m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-26", "description": "The lunch deal remains decent, but our area is littered with Thai and the menu is weak and the food not much better. It's not a disaster by any means, but there are alternatives.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "Shrimp mango, fried calamari, pad See ew, and fried cheese cake is so delicious. I love this place and is very elegant at night it's definitely a nice place to have a romantic dinner. Love it.", "author": "Yve J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-01", "description": "Very disappointing.  Used to frequent the Park Slope location and liked it a fair amount.  The other night I found myself in Cobble Hill with some out-of-towners who were in the mood for Thai food.  But unlike our previous experiences, the service was shabby, the food was shoddy, and they couldn't even serve a proper cup of tea (I mean seriously, a Thai joint with diner mugs full of lukewarm tea?  C'mon).  \n\nAppetizers were bland to say the least.  Possibly the worst fried calamari I've ever had...chewy and tasteless.  Fried wontons were okay, but the summer rolls were tough and came drenched in sweet bean sauce.  I prefer to dip them in the sauce myself, thank you.\n\nMain courses were a little better, but each person in our party received their entrees about 5 minutes apart.  In other words, the first person's dish was cold by the time the last person's meal arrived...almost 20 minutes later.  Definitely did not deserve the 18% automatic gratuity for our party of 6.\n\nFinally, a minor quibble.  What are they thinking with the drinking straw wrappers twisted into little paper roses at the mouth of the straw?  You could poke an eye out trying to unwrap the little suckers just to take a sip of your drink.  Seriously, I appreciate the artistic intent, but even after you manage to disentangle the paper from your straw, you're either left with little scraps of paper floating in your drink or strewn in a messy pile across the table.", "author": "frank l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "This place really surprised me. I expected the food to be average but my dish (Pad See Ew or, as they call it, Fun in Black) remains one of the best versions of Pad See Ew I've ever had. I've gone back several times since and have never been disappointed. I have never had to wait for a table and the food comes out very quickly. Delivery is also fast and reliable.", "author": "Abbey C."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}