{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "My favorite is the beef pad thai. The vegetable spring rolls are good too. They cook the noodle perfectly, not overcooked or soggy. The food is flavorful and fresh. I usually order delivery for lunch and they arrive fast most of the time. Keep up the good work!", "author": "Yeemei C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Went here this past Saturday after shopping at Trader joes and I'm officially in love with this place. The food was delicious service was speedy and I will definitely be returning when I come back to the area. I had the basil shrimp and a Thai iced tea", "author": "Kimberly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "My husband says the chicken Tom Kha is the best he's ever tasted, which is great considering he's a picky eater. We ordered for pickup on a Friday night and enjoyed the food so much we came again on a Saturday.  I ordered the shrimp nana (or something like that), completely delicious and fresh. I will definitely become a regular here. Order the lychee shrimp appetizer it's like coconut shrimp but über fresh. Love this place!", "author": "Jackie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "The best service in this area, food taste good. Especially duck chilli sauce it's my favor. A few day ago I went there with my family so surprised when we finished eating the waitress she gave us an coconut ice cream with chocolate lava. it's was amazing time.\nIf you don't come you ll never know. we'll come again becauce we love it. \nLoveeeeeee...", "author": "Angela K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "This place gets me every time. We sometimes order take out, sometimes dine in, but their food quality is always consistent.\n\nVery favorites are the Thai fried rice, pineapple fried rice, drunken noodles and - discovered today - the Volcano chicken!", "author": "Daniel V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "We always order the curry puff appetizer, flaky \u0026 so good, especially w/ the cucumber! The bomb! Pad se ew is always on point if you like noodles. \n\nTried the Thai BBQ for the 1st time, it came on a large rectangular plate, large portion, soft \u0026 tender. Pretty good! All the food has great presentation, you can't go wrong here!", "author": "Janine D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-24", "description": "I live 6 blocks away from here,  the delivery time is always around 45 min and that should be the longest it takes any delivery.  \n\nBut 1 hr and 30 min and then when I call to check you stall me on the phone for another 5??? Give me a break.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "My first one star rating ever. Wait time was three times as longer as expected not to mention the mediocre food that I had to wait for.", "author": "Syed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Great lunch special place. Comes with a full appetizer course with variety of veggies and dumplings, your main entree and free Thai ice tea or Thai coffee. Last time they even gave in free ice cream dessert right on my bday without even knowing. Great staff", "author": "Albert H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "As a new mother, there are lots of places I know I'm not welcome, including the subway, sidewalks, and many stores. I love this place because of the service. They put me comfortably in the back of the restaurant and came over to say hi to me and my baby and were attentive. I love their fish, it's so good.", "author": "April Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Omg I loved this place! There was no wait and the food came in a pleasant timely manner. The food itself tasted delicious and was beautifully presented. Great Decor \u0026 decent service also. P.S. Get the mango shrimp!", "author": "Alfredia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "Their Tom Kha soup is amazing, very friendly and cozy environment! Prices are def reasonable!", "author": "Nana K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-25", "description": "Ordered a lunch and a regular order. They sent 2 lunches. When I called, they said they would send the accurate full order, please return the extra lunch (poor person who orders that lunch next)  45 minutes later, we're still waiting.\n\nLunch was mediocre at best. Appetizers tasted like they had been around a while", "author": "Mary R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-20", "description": "We ordered the Thai Fried Rice with pineapple and Khao Soi *.\nThe fried rice tasted like it was microwaved and shoved on the pineapple\nit was hard to get the staff members to help us since they was hanging around the bar", "author": "CLIVE M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "I have been wanting to come here for some time now after passing it on my frequent trips to the neighborhood. I found myself hungry and with some time to kill the other day so I decided to try it. I opted for the lunch special which was a great deal. You get a sampling of appetizers, a sizable entree with rice on the side and a drink.\nOne of my favorite foods is eggplant so when I saw that this place had basil eggplant with chicken I jumped at the chance to try it. I enjoyed my food and while it may not have been the fanciest it was definitely tasty and perfect if you want a quick Thai meal. I have to say the service here was great and I have never received my food so quickly before.\nIf you are looking for a tasty and affordable lunch that I would definitely suggest coming here.", "author": "Nicolle B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-06", "description": "As I reached this place I was extremely excited due to the known reviews of the place.  I had went with my friend for lunch, we came in very welcoming.  We ordered our lunch specials, once we received out appetizers 5 mins in they decide to bring our food out..Mind you if I'm not done with my appetizer why would i want my entree.  We tell the waiter not now we are still eating, 10 mins later he comes back with the entree ( still not done with the appetizers).. after that attempt I just gave in for the food WHICH TURNED OUT TO BE COLD.  I had ordered chicken w/ veggies.  The chicken looked so undone the added veggies(unknown) were so unnecessary the usual is broccoli and carrots and whatever veggies they add, Ive had better thai food and this place was not the one..", "author": "Zee W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "Really nice atmosphere - not too loud or too quiet. Attentive waitress who remembered not to give me Ice on my water refill (I know, I know, but I get tooth aches!). Shrimp salad was popping with flavor - delish! Steamed dumplings were fine. Curry puffs were ok but really good with relish. Veggie broccoli with rice was just ok but maybe ordered the wrong thing? \nOverall good experience but the two I dined with said they would give it a 3!", "author": "Lara W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-26", "description": "Looks can be deceiving. \n\nI guess they spent all their attention in making their restaurant look cool, and no attention to their food.\n\nThe restaurant is bright in a good way, the staff is friendly, and they play pretty good music.  Overall, a nice and casual atmosphere.  That is why it has two stars versus one.  However, the food here is a major bust.\n\n- Fresh Spring Rolls:  Not on the menu, they do have fresh veggie spring rolls when we asked. However, maybe they are not on the menu for a reason, because these were awful.  The wrapper was old and seemed too thick with the edges dry and gummy. The insides were funky and overstuffed. Just bad bad.\n- Thai Green Curry: Definitely hit the mark as one of the worst thai green curries I have had.  The curry clearly seemed old and oily as if it was sitting on the stovetop all day, or was from the night before. It emulsifed so the oil and sauce was separating. The chicken was flavorless. And it really did not have that good coconut taste it should have. Awful.\n- Coconut Pudding Dessert: I guess this was the saving grace of the meal, because it was decent.  However, in hindsight I cannot tell if it was actually good or just in comparison to everything else it was good.\n\nAll in all. There are three other thai places in a three block radius of this place.  They must be better this place, because the items were not fresh and seemed to be leftovers from the week.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-22", "description": "Best Thai iced coffee.   Yummy Thai fried rice served in a pineapple.  Love the decor.  I have been eating here for years....lunch and dinner.    I particularly love the Buddha with its food .", "author": "Dawn D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "food was great, service friendly, and food was ready fairly quick. i would definitely return \u0026 recommend. \n\ni ordered pad see ew.. usually asian noodles are too salty for me but they were perfect. \n\nalso ordered dumplings and they were great. should have ordered steamed though, since \"fried\", i think, meant deep fried. they were still delicious though.", "author": "Rebekah H."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}