{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "If you love Thai food than this is a great place to go and affordable! Only issue I had was the amount of salt put into my food. It was pretty salty but not to the point you can't enjoy it, I still enjoyed it. Seasoned good. I got the pineapple fried rice with shrimp. At first I was a bit hesitant getting shrimp because I may not have like the way they seasoned it but it was okay. Not seasoned as much but I feel like it balances out since the rice was already seasoned a lot. Didn't really get much interaction with the workers in there; they were more focused on moving fast and getting people in and out. I forgot the drink I got but it was pretty strong (at least for me, light weight) it was sour though, maybe because of the lime. Lastly, I did not make reservations. Don't really need to fit this place. I do plan on going back again.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "Overall visit to this restaurant was amazing! The staff, the food, the service all responsive and quality! I look forth to eating there as often as I will be able to!", "author": "Andre S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "I absolutely love this restaurant! I've been coming here for years and they never let me down. Great food, affordable prices, nice ambiance, and everyone there is so friendly! 5 STARS ALL AROUND!", "author": "Darween F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "Came here with babes.. date night. The place was nice. It was a cool setting. The food was just ok. I got the pepper shrimp. Alot of pepers not enough shrimp. The rice was good. The drinks was sweet and good. Not to strong  on the alcohol. They have 2 for the price of 1 drinks so we each had 2 drinks. Babes had shrimp fried rice served in a pineapple. Her food choice was better than mine. The hot wings was just ok not really hot. Overall its a nice place to come. Your opinion on the food may be different than mine so come here and give it a try.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Lemongrass Grill offers a variety of dishes that can give your taste buds a good feeling. The calamari was excellent. The texture is crispy out and soft inside which was lightly coated. The Thai  fried rice is serviced in a pineapple which is a welcoming change.", "author": "Simone C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Are you hungry? NOT FOR LONG. \n\nThe lunch special here is simply incredible. Now, 5 stars means something special and the food wasn't life changing. But it was good, and they just pile it on. Heaps of it.  Mounds! And for less than $10. \n\nThis restaurant is your grandma on steroids who just heard you're not eating right. Call an Uber, because walking will be beyond you after this.", "author": "Bryant P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Great place for lunch.\n\nGreat lunch special everyday 11:30-3pm, which includes salad with a fried wonton, fried egg roll, shumai and salad, and main entry with variety of options. There is also choice of drinks included. Price is from $7.95 to $11.95 per lunch special, and a great deal. Portions are dinner size, plenty of food. You can also order a la carte by regular menu,  drinks, desserts, they have happy hour from 4-10pm, 2 for 1 drinks.\nWe enjoyed it.  Fast, courteous and professional service. Food was good, but there were couple of things that I'm taking a star off for. We had Udon Mao Noodle with beef ($8.95) and Fresh Green Chili Shrimp and Scallops ($11.95) with brown rice ($1 extra). Beef was a little chewy and the dish a tad bland.Shrimp and scallops had  only 2 tiny scallops and about 6-7 shrimps. A lot of onions and sauce though.Great iced coffee, but comes sweetened in case you're watching your sugar. Just trying to be objective.\nThey also only take credit/debit cards with chip only or cash, so just be mindful of that.\nWill come back to try different options on the lunch special and maybe other items on their menu as well.", "author": "Diana .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "Reasonably priced for the portions, plating was nice however the decor is a bit odd, the entire place is painted lime green and there are signs everywhere about credit card rules (chip only) etc, the wait staff was polite and they were very busy that night.  the food.... ive had better thai places in new york.  the papaya salad wasnt spicy enough, and the lime wedges they put in there were already squeezed which confused me.  the curry was too sweet for my taste but my friends seafood pot medley was good.", "author": "Sophie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Well the place was plain looking\nBut the food was delicious wings is on point\nEverything I order was good and my wife food also\nI will be going again if I'm in area", "author": "Shotah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Lunch special is fantastic. I only had 40 minutes to spare, they brought the food fast. The starter was a salad with a couple apps so no need to make choices, you get a little taster of all. The ginger chicken was fresh and tasty.  But do note the server warned me that Diet Coke costs extra but regular Coke is included. Same goes for Sprite vs Diet Sprite and they didn't have seltzer. Maybe I misunderstood as that's quite bizarre. The food was worth the trip. I highly recommend the ginger chicken lunch special.", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Great food. Awesome happy hour, until 10pm. However, they raised the prices on the drinks, it's still a bargain.", "author": "Ivelisse D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "This was my first time eating at this restaurant my friend and goddaughters stated that they eat here several times and said l would enjoy the food. I order the Noodle Nana. This dish was delicious the noodles was great l loved the Oyster sauce and the broccoli was tender but not mushy. \nWhat l enjoyed the most was the great service. Since my friends have been there several times we were given a dessert with sticky rice and a drink that was truly delicious.\nI am not only recommending this restaurant but intend to come back here in the near future.", "author": "Appiah451 .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Walked in on happy hour today. The special is 2 for $10 (was it two for the price of one?) either way, great deal and great (+ strong) drinks! I ordered the Thai Fried Rice and it was absolutely delicious! It's served in a pineapple and the portion is definitely enough for two. \n\nMy only \"con\" is that the servers should asked if the customer is done with their plate before taking it off the table. Besides that, no complaints!", "author": "Brooke D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Their pineapple fried is the best and pad Thai . I went with a group of friends and was not disappointed . I ordered the shrimp pad Thai and a Thai iced tea . The service was great and the staff is very welcoming . We all left stuffed and satisfied . \nThe second time I went as a lunch date with my mother and father and they loved it. My mother absolutely enjoyed the pineapple fried rice and even put her friends onto the place . And my dad really liked the volcano chicken . I really recommend this place if you're looking for something tasty, new and for a reasonable price", "author": "Gina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Have been here multiple times and miss it so much now that I don't work in the area anymore! The lunch special is so convenient and their pad Thai is sooo good! The waitresses are Always attentive and gracious!", "author": "Rhea S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-19", "description": "Looking for a cheap lunch special that fills you up for days? This is the place to be. The lunch special comes with an entree, salad, two dumpling pieces, and also a free Thai tea. For 10 bucks, can't complain. The food is ok though, nothing special. I had the drunken noodles with beef. Meat can be a little chewy.", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "Came here on a Sunday night with a group of 8, place was moderately packed, always a good sign in my book.\n\nOrdered the pineapple fried rice duck platter. Exactly as pictured, duck was fried, I expected it to be roasted, but none-the-less, very tender and flavorful, rice was amazing. Based on this alone: 5 stars!\n\nHowever, they lost stars for the following:\n\n-They only placed 6 utensils and cups of water instead of 8?! (I understand the education system in NYC has failed us but come on!)\n-I munched on everyone else's dishes: the calamari was very lightly colored, a little soggy and could've spent more time in the fryer. \n-The wings were flavorless, but was saved by the accompanying duck sauce\n-The drinks were designed to give you a sugar rush (you have been warned diabetics), with no real strong alcohol in them.\n-Customer service was much to be desired--felt very rushed from ordering to paying the bill (and you know where two or three stingy people are gathered paying the bill is always a task).\n\nI will probably return if I'm around the area just for that pineapple fry rice with duck, but I won't travel out of my way for mediocre dining.", "author": "Nate S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-25", "description": "ordered deliver from here. it was virtually inedible. oily, flavorless. The edamame was so dry they looked like little prunes.", "author": "Tali G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Get the Yellow Curry w. Shrimp.\nIt was delicious.\nAlso really good was the fried calamari and vegetable spring rolls.\n\n4 stars b/c there was not enough staff and we booked an advanced reservation for 11 people.\n\nBut, I'd go back again : )", "author": "Davi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Great food great service. Came here on a Sunday night and it wasn't overly crowded and we were seated immediately I ordered the ocean 4 and my partner ordered the pork chops. Im we had Chang beer and they had a special on the drinks 2 for 1. All in all the food was delicious and I would come again.", "author": "Chrissa N."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}