{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "This is a good cheap place to get Thai food for lunch in downtown Brooklyn. Really cheap lunch special with a bunch of appetizers included and a drink. The food is pretty good - I usually get a curry with chicken or beef. The string bean basil is weird - delicious if you get it at night, but if you order at lunch I've always had it undercooked. Maybe they're too busy?\n\nAnyway, definitely stop in here for lunch.", "author": "Bill L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "I stumbled across this place a few months ago and it has been my favorite choice for a sunday thai brunch ever since. \n\nGreat service with very affordable and good tasting food, with a good atmosphere. I mostly enjoy the lunch special. My wife and i end up alternating chicken pad thai and chicken green curry together. The free appetizers and iced tea is an awesome addition.  \n\nDefinitely a great place for first time visitors and ongoing yelpers looking for some affordable great tasting thai food.", "author": "Sam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "Came here with a bunch of friends for lunch and the food is amazingly delicious , fulling and very affordable , the customer service is pretty good and the ambiance is cute and extremely serene.. I highly recommend this place and I will definitely come here again.", "author": "Nichole R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Delicious!!\n\nThe restaurant is casual and the menu prices aren't scary. Waitstaff are friendly, polite, leave you to your space and are very attentive. They do all they can to make your visit pleasant. You won't regret stopping in.", "author": "Dinah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I go to Lemongrass to satisfy my lunchtime Pad Thai cravings because they give a good portion size, appetizer, and free thai iced beverage - this is the best value Thai lunch special in Carroll Gardens", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-03", "description": "Most people come here for the pineapple fried rice, I came for the steamed dumpling and boy was I disappointed. The dumpling came drenched in oil which I wasn't expecting and the taste was okay. However, the fried dumpling and the sauce that it came with was amazing! That sauce though! It was so good that I ordered a second platter of it. Everything else was ok and nothing special, my friends who ordered the pineapple fried rice weren't that impressed either.", "author": "Erika S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-21", "description": "WATER BUGS OR ROACH WARNING OMG. I know every restaurant probably has bugs or whatever, customers try not to think about it and we sure as hell don't want to see it! As soon as I walked in, there was a big one literally crawling on the wall. If that wasn't enough to make my skin crawl, as soon as I started eating, there was another one on the seat nearby which scared the couple eating next to us. They just need to get that together.\nI ordered the pineapple fried rice and something else. The food was pretty great! Servers weren't attentive. I ordered a coke and I had to remind them like 4 times before I got it.", "author": "Mondyna P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "Food wasn't bad but presentation was much better looking than the food actually tasted. I went with my family so we had 3 different plates with 3 different appetizers. No one was overly impressed. The one thing I can say that was actually bad was the service from the waitresses. Overall I'd say the place was ok but probably wouldn't go again.", "author": "Mike I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Don't let the cheesy interior fool you! I walked in on a holiday for dinner after work and I was totally impressed. While it was a mad house, and there were only two or three servers on the floor, the service was prompt and came with a smile. It was noisy as hell (complete with yelling kids and rowdy customers) in the restaurant and I was annoyed for the staff. They kept their cool, though. Amazing. \n\nThe food was good. I had the basil fried rice and was served a generous amount which was delicious. So delicious I had to take my leftovers home.\n\nI will surely be back for take-out or delivery in the near future.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "After an intense cross training kick boxing class that KICKED MY ASS!!!!!!!!!! I was so HUUUUUUUUUUUUNGRY!!!!!!!!!! and needed some fuel.......... and so stopped at Lemongrass Grill... \n\nThe decor is nice and the staff is so attentive - which is real nice. With no hesitation I ordered the Steamed Thai dumplings as an appetizer (very good - really like the dipping sauce) and for my entree I ordered \"Ocean's Four Shrimp, squid, scallop \u0026 mussel w.coconut milk, basil leaves \u0026 pepper in Panang curry sauce. $13.00\"\n\nOMG that dish was so DELICIOUS............. yes I enjoyed every minute of it - then I ordered some veggies to replace the rice - since I am on a serious serious 30 day weight loss challenge - I ordered the \"Broccoli w. Thai Basil Sautéed w. shiitake mushroom \u0026 chili paste\" - so good..........\n\nI will be back................. HAPPY EATING!", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Food is good. I haven't had anything from the menu I didn't enjoy. I've been going here for years.", "author": "Sherqueena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "A friend and I came in around 6pm on a Friday and were seated immediately.  I ordered the Crispy Duck salad and asked that the dressing be placed on the side and added sliced limes.  My friend ordered the Green salad with Blanket Shrimp.  Dishes came out pretty quickly and my request was accommodated.  \n\nWait staff was friendly and they checked on us regularly, re-filling our water glasses.  My salad was delicious and filling.  Seemed a reasonable price for the portion.\n\nAtmosphere overall is casual and comfortable.  I'd definitely come back next time I'm in Cobb Hill", "author": "Cat S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "Lemongrass Grill has always been a dependable choice for decent Thai food. I used to eat in the Union Square restaurant several times a month for dinner. My favorites on the menu being the fresh summer rolls, the vegetarian spring rolls and most of all, the Tao Hu Hor, aka \"tofu delight,\" which is yuba, aka bean curd skin, wrapped around shittake mushrooms and tofu and smothered in a light black bean sauce with bamboo shoots over a bed of steamed spinach. (As I wrote that description out, my mouth watered a bit). This dish, as far as I know, isn't that common in Thai restaurants, as I always look for it and rarely find it. When I moved out of New York, I couldn't find it anywhere.\n\nSo! When in town, and when in the mood for Thai food, I figure I can count on Lemongrass Grill for this favorite entree of mine.\n\nApparently not at this location, though their online menu that I found (not linked above, probably because it's out of date) indicated that they do have it. I think I almost cried when the kind lady who answered the phone informed me that they no longer carry it (specifically, they don't have bean curd skin, but can make it for you without. As bean curd skin is what makes it, I declined and then wasted about 3 minutes of the lady's time trying to find something else I wanted to eat. I hate being \"that person.\" She was extremely nice and made some suggestions, but when your heart is set on something, you know how it goes...)\n\nAnd perhaps I was punished a bit for that bout of indecision because our order took about 50 minutes to arrive at our door. My amended order: veg spring rolls and Panang curry (red curry). They forgot to include the hot sauce that I asked for and depend on to make food spicy enough. Instead they included plastic utensils when I specifically had said \"no utensils\" (it's good that they ask, though, don't get me wrong). The veg spring rolls were OK, though more full of shredded cabbage than described on the (out of date) menu which says they have sprouts, tofu and carrots in them as well. The Panang curry was very tasty, though not at all spicy enough, and as requested, they added in some broccoli and bamboo shoots with the tofu/basil and left out the bell pepper. \n\nAll in all, OK, but I probably won't be ordering from here again since they removed my favorite dish from the menu, not that I expect them to put it back if it wasn't that popular. I know I can count on quicker delivery from other Thai places in the area, too.", "author": "Joi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "Been here more than once and I will always come back.  Such a great atmosphere, love the interior and the simplicity of lemongrass. Make sure you get there for the lunch special, which ends at 3:30, you will not regret it. I got drunken noodles, however its called something else at lemongrass.  The Thai iced tea was on point just like the food.", "author": "Shari D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "This review only pertains to their delivery through seamless, since I've never dined-in at Lemongrass Grill. In regards to their service, my food has always been either on time or early, and they always put something extra in with my order, like edamame or even dessert!\n\nI've enjoyed pretty much everything I've had here, but my favorites are the country style dumplings and cashew-king (insert protein of choice here). The volcano chicken is good as well. The only thing that I've had which I haven't been thrilled with was the duck salad. The duck seemed a bit greasy to me, which ended up making the lettuce and vegetables of the salad greasy too.", "author": "Emily J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-20", "description": "Staff was extremely rude upon entering and acted like they didn't want our business...so our group left and went to cafe chili and a polar opposite experience...will not be going to lemongrass", "author": "NJ J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-23", "description": "This is my second time here. The first time I came with family who live in Vietnam and they love this place. Every dish has its own sauce and taste, to compliment the food. I love the curry with chicken and love the prices. $7.99 for lunch that comes in a bento box fills everyone!!! You will love this place if you are looking for a Thai restaurant!\nHowever, the only reason I gave 1 star is because they have a sign saying if you post a 5 star review - you get 20% off your check! So I don't know how trustworthy the 5 star reviews are!", "author": "Zhana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Best Thai in the park slope range. I've lived in the hood for years and tried them all and Lemongrass is by far the most authentic you can get south of queens. Best Thai beef salad anywhere!! The Tom yum and Tom Kha soups are great. The green curry and the eggplant basil are very good. And papaya salad is nice and light. The best part is when you ask for something extra spicy they actually make it extra spicy! The only thing that has disappointed are the Americanized appetizers. People who are complaining and giving low ratings must want the super sweet Americanized version of \"Thai\" food that this place is too good to sell.", "author": "Emily S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "I actually love the food at the restaurant but the service is the worst. I've ordered delivery many times and it's usually slow but one night it took 1.5 hours. \n\nWe called the restaurant and they apologized and offered us a free meal. \n\nThey avoided honoring their offer with excuse after excuse until the restaurant finally offered a free dish - and not a free meal as offered earlier.\n\nI'm sad to say that was not ok with me and I will not be ordering from them again.", "author": "Micah R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-02", "description": "Sub-par thai food and terrible service. The leftovers were better the second day. There is another thai place down the block, will go there next time.", "author": "Aneta M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}