{"aggregateRating": {"reviewCount": 412, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-21", "description": "Convenient take out but PLEASE GOD stop sending cups of iced tea and coffee with my order!  Send cans of soda instead!\n\nAlso, when I choose to \"add chicken\" to my item then ADD IT.  Do not add one strip and charge me $5.95 extra.  \n\nStep up, Lemongrass.  More competition in this neighborhood leaves you no choice.", "author": "M C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "My favorite Thai place !!! I go here like all the time . It's so good . The food is fresh . The staff is so attentive and I went here on a date alone and enjoyed myself so much . Best Thai place ever", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "I'm the first to admit that I'm not the coolest cat in Brooklyn. White, middle-aged female dining alone in workout clothes and no make-up. Even so, I was a paying, hungry customer and can't return to a place that considers me irrelevant until I get up and let someone know I'm ready to pay.", "author": "Laurie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Food was very fresh and delicious. If your looking for an inexpensive Thai Restaurant for a quick bite, this is the place to be. The service is real good, they are very nice courteous and attentive. The price is def right. They give you a handful of salad, a spring roll, fried wonton, Thai tea plus a dim sum, plus an entree for only $8.95 for lunch special. You can't get cheaper than that anywhere else. Love them, always coming back again n again for nice cheap decent food.", "author": "Baobei B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-01", "description": "The lunch specials are decent and reasonably priced. I love their pork chop over rice and the pad-see-ew. They normally throw in a couple of little appetizer goodies, a small salad, and a bottle of water when you pick it up.\n\nThe service is good. The space is conducive for large groups, and the prices are affordable. I would suggest pick-up over delivery. Trust me, it makes a difference.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "The food is solid. I don't know if it's a full 4 stars--maybe 3.5--since it's really Americanized Thai food, but the lunch special is so terrific that you really can't complain.\n\nGot the Thai basil chili dish with chicken. Came with fried wonton, salad, and a spring roll. It was $7. Yes, $7. It was a massive amount of food and I had leftovers! ALSO, a free Thai iced tea?!\n\nIf I was being picky, I'd complain about it being too salty or the flavors being a little off, but not for this price. Awesome, awesome lunch deal. I'll be back.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Went last Friday night and had a pleasant experience. The food was amazing as well as the drinks. I had the Thai fried rice with chicken with a couple of mango margaritas. Great service! The waitress listened attentively and provided great communication. Will definitely come here again I'm the future without hesitation.", "author": "Jessy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "I recently had a lunch here. And I should say it was a fair deal. Seriously when you get appetizer, main dish and drink for just $8 you automatically switch to mode 'I can't complain'. So I won't. WC is clean, staff is friendly enough. Only annoying thing is decor colors. Salad green and yellow what might be worse?\nP.S. $3 beer is a good reason to get back soon", "author": "Vado A. R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "The food was amazing. We made reservations for a large group on Sunday at 2:30pm. We were able to get the lunch special for $7.95 which included 3 pieces of appetizer, a salad, entree (sauteed/noodle/curry) and a drink (Thai Ice Tea as an option, I thought I had gone to Heaven....what a great deal!). With that I ordered a meal to go for my husband.  Tip was included on the check. The service was fast, the wait staff were very nice and the restaurant was clean and spacious. Will definitely be back for lunch again.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-18", "description": "Really underwhelming. The seafood casserole was way over cooked= tough, chewy mussels and scallops. The spiciest curry dish on the menu was not all that spicy and not a curry. It had a watery consistency and little flavor. The mock dock was spongy and boiled. \n\nThe place itself is quite sketchy looking. They have signs everywhere they say they only accept chipped cards. They felt the need to indicate in the happy hour section of the menu that they offer no returns on the 2 for 1 drinks. Classy...", "author": "Crystal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "I love this place! The food is always soooo good and the servers are so sweet! I come here for lunch, dinner, birthdays, and work parties. I love love love lemon grass. (it's also very affordable)", "author": "Lola C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "I recently had take out from here. Based on the reviews I must of caught lemon grass on a good day because the food was phenomenal. \nThe Crab Rangoon is a fried, creamy \u0026 slightly curried cheat treat.\nThe pork chop is grilled and served with a bed of veggies. So good! \nThe pad Thai and Panang curry was also delicious.", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Omg... Their 2 for 1 drinks during happy hour is the shit...their service was great.. Form the time we walked in we was greeted with a smile and seat  immediately... The  young lady (waiter) with the baseball cap was very friendly, polite, and soft spoken, I literally had nothing but great  service from her... The food came fast and was fantastic . Please come and experience this amazing restaurant.", "author": "Chaka D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "My favorite Brooklyn Thai restaurant, I've been a customer since the 90s, always consistently delicious fresh food and good customer service", "author": "Christine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Good place. The staff always greets my friends and me. They always give us free Chai Iced tea. Sometimes they give us free desserts too. But that's because my friends and I are regulars. There was a time where my friend and I came for 5 days straight. The staff are friendly to us. The atmosphere is okay. Nice winds and clean air. Not too noisy, unless you go at night then it's jammed and it's too loud. We never had to wait to be seated. Though the waiting area looks awfully small. But good thing my friends and I never wait, since we are cool regulars :) \n\nAlso they always check ID with the chipped cards too. \n\nMy favorite thing to get is the Pad Thai. Though the waiters don't know how to pronounce English. But that's okay since there food is good and I just point on the menu. \n\nTheir Chai Iced Tea is too sugary, but hey I won't complain since it's FREE.", "author": "James D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "I ordered the Crispy Pepper Steak to go. Needless to say the steak was terrible. It was soggy, and overcooked. Do not recommend coming here.", "author": "Vez T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "First time ordering lunch delivery from this place and was pleasantly surprised. Their lunch special is an unbelievable deal. My lunch even came with a thai iced tea that I didn't order. I thought it was a mistake on their part (and some poor lad was missing out on his drink) but it seems as though they just throw it in as a freebie (based on customer reviews on Seamless). The delivery of food was also timely - took 40 minutes but came earlier than the estimated time frame. Food is pretty good. Only thing I didn't like was that I upgraded to sticky rice to meet their delivery minimum but their sticky rice sucks. Stick with the jasmine rice.", "author": "Haj da P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Pros.\nYou should def go for lunch special price which is reasonable.\nStaffs are helpful\nYummy food\n\nCons.\nNot recommended dinner price.", "author": "Joo G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-31", "description": "Overpriced, greasy, no flavor. Some of the worst Thai I've had! Don't eat here if you like authentic Thai!", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Nice ambiance; nothing fancy. Great place for Thai food and they have have happy hour everyday from 4pm-10pm ... yes EVERYDAY! The customer service is decent; could use some improvement ... we had to wait for a while for our orders to be taken and it wasn't that busy. The food and drinks are great; I recommend the basil fried rice and the Morakot drink.", "author": "April S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Lemongrass Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Er8MScWS6uLmC6P2dqlx1A/ls.jpg", "@type": "Restaurant", "telephone": "+17185229728"}