{"aggregateRating": {"reviewCount": 3, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "This review is for the DUMBO location, which according to the website is currently open Weds, Thurs. and Friday -- see their website for other current locations on other days.  This one is under the Manhattan Bridge Archway in DUMBO, where several other food vendors have set up as well.  Before opening at this location, Rice \u0026 Miso used to operate out of the West Elm Market on Washington St. in DUMBO, also (on Tuesdays only).  I used to go there routinely about two years ago.  Just made it to their Archway location.\n\nI think they are open for lunch only.\n\nThis is one of the few *relatively* light and healthy lunch options in DUMBO (#dumbofooddesert).  The rice balls are excellent (rice is *perfectly* cooked, flavors of fillings are well controlled -- not too salty), and the little bento accompaniments are a great contrast/supplement.  $10 for a bento makes a great lunch at a price that is reasonable by DUMBO standards.  \n\nIn fact it's not really a very healthy lunch -- no greens (except edamame), no fruit, a fair amount of mayo and the tofu is fried.  In comparison to the mostly high-salt, high-fat, deep-fried smoky-saucy hipster nap-bombs that are standard in the area, however -- grilled cheese, pulled pork, waffles, baos, lobster rolls, etc. -- I consider this a great light meal addition.  Plus, service is pretty fast and they include tax in the $10.", "author": "George S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-09", "description": "Rice \u0026 Miso Everyday is a popup at the West Elm in DUMBO. They're there Tuesdays... so not quite everyday.\n\nThey have \"bento\" box specials, which comes with a protein, two rice balls, soup, edamame and some veggies. When I went, they ran out of the chicken, so I had to get the tofu. It was thinly sliced, fried tofu, but cold. Not sure why they would do that. Wasn't very filling.\n\nFor my rice balls, I went with the tuna mayo and the grass-fed beef. The tuna mayo was the better of the two, because there wasn't all that much beef in the other one (at the very least, not very well distributed).\n\nThe miso soup was... interesting. It had kale instead of seaweed and also mushrooms.\n\nThe seaweed and carrot \"side\" was a very tiny portion (where you can't even see it in my photos).\n\nMaybe the chicken bento would've been better, but I don't see myself coming back.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "Good quality, the price is a little above average, maybe because of the quality. ( Note - I wish they didn't add salt to every rice ball)", "author": "John C."}], "servesCuisine": "Japanese", "priceRange": null, "name": "Rice \u0026 Miso Everyday", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "Dumbo Under The Archway", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/t1jri6YSkeZPva6Fq7PP0g/ls.jpg", "@type": "Restaurant", "telephone": ""}