{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-05", "description": "I don't know what happened - took them 40 minutes to driver drinks and just over an hour for popcorn.  The sever said they were very busy - I could tell as guests that arrived after us were served in 20 minutes.  No apologies.  Very disappointing.  I guess I'll give iPic a try.", "author": "Ken C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "*This review is only for the theater and movie experience, not the food/dining experience.\n\nI went to Alamo this past Saturday to see \"Get Out\" and I enjoyed the theater.  I saw the first screening of the day so I paid the matinee price ($11) which was worth it.  Who really wants to pay $15.50 for a movie?  So I basically saw a crazy movie at 11:10 in the morning in order to save coins, lol.  The theater itself is nice but I feel like its kinda hard to find.  I entered through Century 21 and I took the escalator up to the 4th floor and that's how i entered the theater.  \n\nOnce I was inside, the escalator wasn't working and I could not find  the movie on the touch screen.  I had to wait around 3 minutes to get my ticket because there wasn't anyone working at the register.  Eventually a man came to the desk but he looked a little frazzled lol he looked like he was the manager on duty and he was taking calls, talking to the escalator guys and he sold me my ticket.\n\nThe theater itself its nice and the food ordering system is pretty easy.  I would go back and try the food and of course make sure I'm there for the first show of the day! lol", "author": "CANDICE H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "People complaining because they're late to a movie and won't get let in per Alamo's well-known policy.....hahahaaha. Other movie goers hate you, so go ahead and stay away. This place is an experience. So you get here early to order your food and be ready for when the movie starts. This is a great theater for people who love and respect movies! Comfortable, spacious, fun. The front row isn't bad at all having the reclining seats but you'll be able to see better a few rows back. They've improved on some of their food items since they first opened so I think they're doing pretty well. Food is a bit pricey but think of the area and what you are getting. Shakes are huge, sodas are a good size, popcorn bowls are giant and I've never seen anyone finish them. Their hot pretzels are good. They give you 3 mini ones with both a spicy mustard and cheese. I've also had their brisket burger which was good and had a lot of fries. So I am not sure what people are talking about when they say you don't get the amount of food you pay for. Also, staff is always efficient, friendly, and stealth throughout the movie with your food deliveries. Love it here!", "author": "Erin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "I was so impressed by Alamo I was compelled to write a review ASAP. \n\nFirst off, it has a great location. It's in City Point Brooklyn right off the 2/3/A/C. Only a few stops from Manhattan. My friends had a bit of trouble finding it but I didn't have that issue. \n\nI went to see a matinee of Fantastic Beasts on a Saturday. Immediately I thought the theater -- both outside and in -- looked so cool. The House of Wax is probably fun as well, but we didn't have a chance to peek in. \n\nI paid around $16 for a ticket which I was actually surprised about. I've paid more at an NYC theater that wasn't a dine-in. Definitely worth the price in my opinion. \n\nMy friends and I ordered a bit after the movie started. I was worried the staff wouldn't see our cards standing up (part of the ordering system), but they did! I ordered popcorn and a beer (from a great selection of drafts -- to be expected from a Drafthouse) and got them within minutes.\n\nMy friends ordered more substantial food like wings and had to wait a little longer, maybe 10-15 minutes. As they had to be cooked, though, that makes sense. We did not experience any order/food horrors that other Yelpers wrote about. Perhaps the kinks have been ironed out at Alamo! \n\nI was a bit peeved at first when I saw popcorn was $8, but a. It IS a movie theater and b. The bowl was HUGE. YUGE. I couldn't finish it. Seriously yuge. \n\nI loved the ambiance and environment. Perhaps it's because Alamo attracts a certain clientele, but everyone was respectful throughout the movie (no talking except when necessary to a server or whatever). If you want to see a blockbuster like Fantastic Beasts, this is def the way to go. \n\nI can't wait to go back to see more movies and to try more of the menu. The food and shakes look bomb af. I will probably be a regular. \n\nOne word of warning, though: get there EARLY. We didn't know we were expected to arrive a half hour before showtime and the last person in our party arrived almost 10 minutes late -- if you ARE 10 minutes late, you will not be allowed in. The staff told us that we would be refunded, though. Luckily it didn't come to that.", "author": "Anna I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "While better than 90% of the movie theaters in town, Alamo pales in comparison with Nitehawk Cinema in Williamsburg. \n\nAlamo feels very corporate. It's in a mall - a rarity for New York City - and I suddenly felt like I was in the suburbs...not in a good way. That area of Brooklyn has become so strange! New high rises everywhere and zero personality.\n\nThe menu is quite sparse. I never found anything I really wanted to eat. What did arrive was clearly reheated old food. It was far from fresh.\n\nThe servers, while very nice and sweet, just couldn't keep up. I ordered a drink before the movie started and it took them over an hour to bring it to me. It was iced tea - nothing complex. I had to speak with two servers before it finally arrived.\n\nOn the positive side, seat reservations are a must for theaters these days. Being able to arrive minutes before showtime was a huge help in this hurried city. We didn't have to wait in any lines but walked right to our seats.\n\nIf you have a choice, go see something at Nitehawk. You'll have more fun.", "author": "Geoffrey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "They've definitely improved since they first open.   Seats are comfortable, food is good and a solid beer selection.  Prices are a little high, but that's to be expected. \n\nStill don't recommend going around dinner or lunch- people's silverware can be distracting.  But a late night movie or an afternoon showing is perfect; most people are just getting finger food to snack on.", "author": "Curtis C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "I came here with a couple friends to see Rogue One on a weeknight and had a great time. \n\nAlamo Drafthouse is similar to your average large movie theater, except there is a full food and bar menu available during the movie, and between pairs of seats is a table with menus and pads where you can write down your orders. \n\nThe selection of movies and times was pretty extensive- similar to with what I would expect from an AMC or other large theater. And prices are pretty on par with the rest of the city (we paid $15.50/ticket)\n\nThe theater itself felt a little small and had less seats than an average movie theater, but there was significantly more leg room and the seats were larger and more comfortable as well. The table between the seats was pretty big, and had plenty of room for two people eating meals. \n\nThe food menu includes appetizers, burgers, sandwiches, and flatbreads. For beverages there are milkshakes, cocktails, wine, and an especially impressive list of draft beers. \n\nI got the lamb burger which was honestly a little disappointing. Dry and the pairing with hummus was strange. The sweet potato fries were okay. As a whole, eating in the dark at a movie felt a little weird, but was a lot of fun! \n\nOverall, I'm definitely planning on coming back soon! But will probably stick to appetizers and drinks in the future.", "author": "Mia F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "Oh, Tim League...  Why did you allow other people to buy into the Drafthouse name? \n\nI'm a diehard for DH. Went frequently to the original during my university days in Austin.  Familiar with the expansion and admittedly, this location is beautiful. They spent a ton, clearly. \n\nSadly, the staff aren't up to the quality I'm used to in the Texas locations. No smiles. No cool factor. Nada. I also didn't get half of what I ordered.  My server didn't apologize, nor did she seem to really care that it happened in the first place. \n\nFor now, I'll stick to other theaters in the area until Drafthouse gets the kinks worked out.", "author": "B P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "One of my favorite places to watch a movie, even though it's not the easiest to get to from my side of Brooklyn. I absolutely love that you can reserve seats ahead of time because otherwise, my boyfriend would want to be one hour early and who has time for that? The seats are comfortable and having the option to order food and drinks is always appreciated.\n\nThat being said, I really hope they fix their current offerings. The only vegetarian entree option was absolutely inedible. I am not a picky eater, but seriously...no one ever wants a grilled vegetable sandwich. Just put a veggie burger on the menu and call it done. The vegetables were burnt, but not in an \"ok, it's just really grilled way\" but in a \"chemical taste way\". I had to spit it out because it felt like I shouldn't be ingesting whatever it was.\n\nThat won't stop me from coming back, though. I'll just be sure to stick to popcorn or fries next time ;)", "author": "NF T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-31", "description": "I really wanted to like this place. I even planned to watch my first movie in over a year since I gave birth to my twins. I bought tickets a week in advance online, booked a sitter, and paid an arm and a leg for Downtown Brooklyn parking.\n\nWhen we got there, we found out that they were closed for fire inspections and the movie was cancelled. What I didn't understand was the sheer fact that I purchased the tickets through their own website and registered my e-mail and phone number. A simple e-mail would have sufficed and made me plan to see the movie elsewhere. \n\nMind you, they did provide us with a reimbursement and food comps. While I do appreciate that, a sitter in New York City costs far more than what we got back.", "author": "Fatima B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-08", "description": "Looks like this place is still working out its kinks and there are quite a number of them. Compared to their Austin location it is unmitigated disaster. For Brooklyn it is merely okay.\n\nI went for a morning showing which meant that the number if patrons was tiny. Theater was perhaps 1/10th full if that. That still didn't stop my waitress from taking 40 minutes to pick up my order from the written slip.  I had to physically walk and grab another waitress to place an order. If you have ever been to Alamo you'd know it was atrocious. One of my orders that the waitress did pick up vanished without a trace. One of the orders got brought to the wrong table. The cookies we ordered (which really are muffins!) were completely burnt, as in scorched. Oh, and the screen advertised a 15% discount (settling in place, working out the kinks type of thing), which didn't get reflected in our bill. All in all, I can't possibly recommend this place to anyone yet. I'm giving it two stars because I think this place has some promise.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "I've been wanting to check out Alamo forever and I was not disappointed. Think movie theater with the normal movie fare + bar food + solid beer selection, made to order and brought to your seat. It's honestly kinda too decadent. And for some reason it's covered in Turkish movie posters. Also, I enjoy the touch of texas that comes with the queso.", "author": "Misha T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "We went to see a sold out movie and had a great experience. \n\nHonestly, the waitstaff going back and forth to serve guests and take orders was so distracting. \n\nBut the food was decent, airport pricing though. Was nice to have food while watching a movie. \n\nTip: make sure you figure out which pairs of seats share a table because we booked 2 seats sharing tables with other guests which made it awkward. \n\nThey also don't check tickets till you sit and order. Love the no texting rule", "author": "Kim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "I'm from Texas, so Alamo Drafthouse has been my favorite theater since forever.  This location continues in their tradition of fun, weird programming, amazing food and themed specials, and cool staff.  The creepy wax museum cocktail bar is a fun addition too.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "I love it here. Perfect date spot or solo movie session. Comfy + spacious seats, good popcorn (a must for me at the movie theatre), good local beer list and drinks. Staff are all nice and the service and prices are what you would expect. They are strict about phones and lateness but it's all for the sake of the customer so it's fine just don't be late and don't be a douche and you're good! The wax museum bar is weird and dark and good for those with morbid curiosity, however not appetizing whatsoever or good for the squeamish. It's good to check out but I wouldn't chill there. Oh, I've found that the theaters oddly smell like nail polish remover, idk if it's the cleaning products or what... but it's just something I've noticed when I walk in and then forget about. It's weird tho. Regardless, cool place!", "author": "Veronica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I love Alamo so much. It's extremely easy to get to, located right outside the 2/3/A/C. The building it's in right now, City Point, has a Target and a Century 21 and is preparing to add a ton of restaurants.\n\nIt's very easy to  understand the ticketing process, which is nice, because they all seem to be different these days. Once you're in, doors open 15-30 minutes before the movie. During that time, waiters are so fast and helpful, you can be served your meal. Meals are filling and extremely delicious -- I've had a bunch of different combinations since I first came there. The popcorn is big enough for two people. \n\nSeats are comfy and the system is easy to understand. You don't feel crammed or like a nuisance ordering food during your meal. I love it here! If I were rich, I'd come once a week.", "author": "Kelsey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-12", "description": "Manchester by the Sea: Fight Night Edition\n\nMy girlfriend and I are a fan of this place but it's attracting d-bags, apparently. Two guys got into a very loud verbal fight that disrupted the whole movie for about 5 minutes. One guy called another guy's girlfriend the big C-word, the other guy flipped out and started swinging at him. Management came and removed the couple that was throwing fists. Lots of verbal assault to the people that remained in their seats, after the show.\n\nI don't blame the theater for this incident but we pay more to avoid the douche crowds. Well, they're at Alamo Drafthouse now, so beware.\n\nI wish management would've comped the whole theater some free tickets because the entire movie was RUINED. Everyone in the theater was pissed and frustrated as we were walking out.\n\nIf any of you in that scuffle read this, \"Thanks, a--holes.\" Also, might I suggest anger management classes for the guy that had to be macho and start swinging at a dude that was seated. We get it, bro, you're tough.", "author": "James E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "I'm very disappointed in Alamo draft house Brooklyn. Me and my friends have been frequenting eat in thearters in brooklyn trying to find our favorite one and I was very hopeful for Alamo being the best of the best. The space is surprisingly beautiful, the seats are comfortable and allow a good view of the screen regardless of where you are sitting but like reviews posted to yelp over a month ago by othe reviewers I found that that's where the good stops and the questionable begins. Here is what went wrong with this place in the order that it happened.\n\n1. No one ever checked my ticket.\n\nNot at the entramce not at the thearter door not at my seat,Someone could have just walked in and taken my seat. Wtf\n\n2. They run out of food quickly.\n\nI ordered the mac and cheese, was informed they ran out 30min in, replaced my order with the tacos was also informed they ran out....another 30min in....??? \n\n3. They do not honor bottomless options\n\nI ordered a black cherry soda that was advertised as bottomless. It was delicious, and my popcorn was salty so I finished the cup off very quickly and put in for a refill according to the rules on the menu quite early hoping to would arrive with the rest of our food. I waited it never came, our food came and I reminded the wait staff about my refill and began to eat because the would obviously be bringing my refill immediately, I finished and continued to wait and still no soda, I asked a passing waitress again, and waited I noticed a waitress walking up and down the isles asking neighboring guests about a soda and tried to hail her down quietly but she didn't see me and took the soda back out into the kitchen. At this point I was upset and distracted and not able to enjoy the movie.\n\n4. There are billing issues\n\nMe and my freind ordered the exact same thing, truffle popcorn, bottomless soda, and a Brooklyn dog platter\n...... I was charged $30 she was charged $6.50 I told her not to correct the wait staff because the service was so horrible and it serves this place right, until I noticed they took my credit card and left hers on the table untouched, so we flawgged them down and she paid only the $6.50 she had been charged because even after having been flagged down they didn't relize their mistake and we decide that it was not our problem.\n\n5. You must make sure to check your credit cards before you leave this place.\n\nUpon leaving the lights went up and I was already contemplating a less than flattering review of this place on yelp. What else could possible have happened  right? Well Alamo took the fucking cake when the two guests infront of me noticed they were given someone else's credit card!!! As the man sitting in front of me stood up and said \"this isn't my credit card\" and begins calling out to the rest of us \"is anyone here named Ryan?\" My heart dropped and I reached to my wallet to make sure I had gotten my card back, thankfully I had but sadly Ryan had already left with someone else credit card no doubt. \n\nIm generally easy going, and can get over a mistake or two quite easily,so this honestly started as a 5 star rating, but for each issue I subtracted one star, because collectivly this is just ridiculos, they got the minimum rating allowed on yelp and as a tip I drew a  followed by question marks because this was just unacceptable, I will not return and do not recomend Alamo unless reviews of this place completely change", "author": "Alexzandra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Nice comfy seats(actually a little tooo comfy. Lol I went to sleep for about 5 min during a slow part of a film) but the food is excellent! Drinks could be a little stronger though. And the staff are amazing, amicable and helpful. I would recommend this for a date or if you need you some you time.", "author": "Zane M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "I am super late on this but I was waiting for Alamo to open for like a long time. As we know they were a bit delayed in their originally advertised date but they are open now and it a a beautiful thing. The first two times I went were during the soft open and a little bit after that. I was a bit worried about some of the wait staff and said as much when asked for my opinion in an online survey about my experience. Since then everything seems to be running on all cylinders. \n\nTwo fun things I have attended-On Halloween they had a screening of cult classic 80s tween horror movie Monster Squad and Andre Gower who was in the film was in attendance. During the Q\u0026A I got a t-shirt by wowing him with my knowledge that he was in Circus with the Stars!\n\nMore recently I attended a screening of Strike A Pose a documentary about the surviving men who toured with Madonna on her 1990 Blonde Ambition tour and were featured in her documentary Truth or Dare. Two of the guys from the doc were in attendance for a post screening Q\u0026A and 15 year old me who saw that tour at the Meadowlands on 6/26/90 got to fully freak out. \n\nDefinitely join the Victory Rewards program-I have gotten to attend two gratis screenings (of my choice) and just got an email that I can choose another screening of my choice in the next 30 days for my birthday.\n\ntwo issues:\n\none-the food the first time I went to an Alamo Drafthouse was in Austin where the chain was born. The food offerings at the NYC location to me fall a little short in terms of variety and quality for the money. I was recently sent a survey and told them I would like to see more vegetarian sandwich options would love to see breakfast offerings at screenings before 2pm like they do at some other locations. The flatbreads and the Brooklyn dog are pretty good amount of food for the money. The drinks are good.\n\nTwo-as of now Alamo NYC does not participate with moviepass and I am blaming that ALL on movie pass and their tomfoolery (more on this is my moviepass update review) I tweeted at Alamo around the time they actually opened and they responded that they \"were all set to go with movie pass that they were just waiting for moviepass\" Moviepass responded that they are always considering new theaters. Hmmmmm. As of now moviepass is accepted in their Austin locations. I am annoyed with this BUT I blame movie pass entirely and can't really complain because as of now two of the 6 movies I attended during the soft open were 1/2 price. Two were complimentary from Victory rewards and one was full price and one was matinee price. if you average that out it is really nothing to complain about. If Mike Sampson or Tim who is the CEO can strongarm moviepass into getting accepted at the NYC location I am all about it otherwise I will come anyway. I am already scheming for how I am going to see Star Wars 8 here opening weekend in December. \n\nADVICE: If you are taking the R or Q to the Dekalb Ave stop be in the front heading towards Manhattan and the back if you are going to Brooklyn. Go up the stairs make a hard left and you can center the City Point complex that Alamo is located.\n\nI AM SO GLAD YOU GUYS FINALLY OPENED IT MAKES ME SO HAPPY!!!!!!!!!!!", "author": "Eve S."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}