{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "The most comfortable cinema theater that I have ever been !! \n\nYou can enjoy watching a movie sitting on leather seat.\nThere are tables each pair of seats, so you don't have to afraid of keeping hold on your big popcorn cup and drink during watching movie.\n\nIf you want to eat or drink something, just write down to the order sheet and put it on the card holder. The waitress will come quickly.They have beers, popcorns ( may three kinds of flavors ), candies, and so.\nThe popcorn was so big and tasty. I was so surprised that it was in the big bowl !\n\nThe price of ticket was $15, and I've heard this is average price in America. \nThe mood of this theater was so good, so I think here is good for date, too:)", "author": "Aoi U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "Although I live 1 block from the Regal Court cinemas, I decided to go the extra distance to try this theater. Based on past reviews and their advertising, I was expecting an upscale, enhanced movie experience. The theater was clean and modern as were the restrooms. Overall, however, it was a \"not quite\" experience. Not bad - but \"not quite\" better.\n\nThey claim a superior seating experience - but \"not quite.\" The seats were leather, but no high backs to rest you head; were just as wide as a typical movie theater seat, and the tables for food were extremely small.  A 2'x3' table was shared with two seats (the seating map does not clearly show which two seats share a table). The couple next to me each got a burger, and shared nachos and a salad. There was no room for all the 4 items which arrived together. \n\nThey claim 30 minutes of a pre-movie film with no advertising - but again \"not quite.\"  This pre-movie entertainment consisted of old black and white films with old advertising from 1940's and 50's, but still advertising. They weren't even good B\u0026W films clips (like Laurel \u0026 Hardy or Abbott and Costello), so I did not enjoy it. (The couple next to me trying to juggle their food was more entertaining). \n\nThey claim their strict no cell phone policy helps prevent interruptions - however, the waiter running in front of you to service orders is even more of a distraction. Frankly, I do not find cell phones a problem anymore, but their cute film by a famous actress about cell phone rudeness causing a host of world problems (and babies in the toilet) was funny.\n\nThey have reserved seats, but if you use their app they charge an extra booking fee, and they do not allow open seats between guests even though the movie is far from sold out. Also if you use MoviePass you cannot use their app to order seats in advance and have to do it on-site.  The movie was slightly less expensive than the Regal on Court. \n\nI did not eat any of the food, so I cannot comment on the quality of the eating experience. Personally, I prefer eating before or after the movie, where I can engage in conversation with my companion(s). \n\nOverall, it was not an enhanced experience. but a \"not quite\" one. Mind you, it was not a bad experience, just not an better one. So I personally will not go the extra distance to come here unless they are showing something I cannot see at a closer theater or at a better time. I would only recommend it if you want to save time by eating \"real\" food (rather than typical theater snacks) and want an alcoholic drink while you watch -\n all delivered to your seat throughout the movie. I would not recommend it worth trekking out to.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "I absolutely love this place and my main reason is because of their customer service. The first time I came here, the server forgot my meal until almost the end of the film but apologized and gave my Significant Other and I free movie tickets. \n\nMy most recent visit here was great. My food came on time and was delicious (I had the braised beef burger). I love the fact that they create a themed menu for newly released and anticipated films. \n\nThis is a great place to take a date for a few reasons, there is a bar in the main lobby just in case you want to extend your date beyond the film, and the location is great. \n\nI will definitely be back to the Alamo for a date night with my S.O.", "author": "Dominique H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-20", "description": "Awesome place. Seats are comfortable and screen is huge. There are quite a bit of options on the menu. The food was actually really good. We ordered the truffle popcorn, wings, buffalo cauliflower, and a burger. We also ordered 3 cocktails and the total was ~90$. Well priced for the quality. Service is surprisingly quick given how many people are in the theatre ordering. Will definitely come back. Well worth the experience.", "author": "Amy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "I love Alamo Drafthouse! I almost exclusively attend movies at this theater, b/c of the experience. The truffle parm popcorn is amazing (I dream about it, and also re-create at home), the seats are so comfy, the viewing experience unparalleled.  If you haven't been to the Alamo yet, run and be ready for your life to change for the better!", "author": "Katie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "I hate to do this. But I must. I'm knocking down Alamo one star. \n\nSince it opened, this has been the main theatre that I go to for movies. However, I must say that the service is not very great here. At first, I assumed it was just because it's a new establishment that was trying to hit its pace. It's now been somewhere near half a year, and I've still experienced pretty poor service. \n\nI went a few weeks ago and ordered a well done brisket burger with no aioli. (Because let's be honest, aioli is just gross mayonnaise masquerading as \"fancy\"). When I got my burger, it was 100% rare and filled with mayonnaise. I sent it back with no hassle, but the second burger I got was medium-well and had even more mayonnaise than the first. If I would've sent it back a second time, the movie would've been over. \n\nPrevious times I've gone, I've also had to wait until after the movie to get my check. Not to mention that one time I went, the waiter provided a subtle spoiler to the movie I was seeing. Albeit unintentional, it was a spoiler nonetheless. \n\nI love Alamo Drafthouse, but I'd love this particular location even more if the logistical kinks were smoothed.", "author": "Chey O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "First time checking out Alamo Drafthouse in downtown Brooklyn and was happy with my experience! It's in the same building as a few shopping stores (century 21 and Target) and an amazing food hall downstairs! The space was clean, efficiently run, and spacious! I did take off a star because there was a funky odor all throughout the corridors leading to the each movie room. The experience once in the movie rooms is pretty cool- they have a full menu (drinks, apps, desserts). The waitress was friendly and prompt in coming over when she saw our card up (which signals we want to order something). Definitely try the truffle popcorn! The hook under the table is great if you bring a purse FYI!", "author": "Saira W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "As a baby of the 80s, I never got to experience a true drive-in movie experience, but the Alamo let me live out a tiny corner of that fantasy.  With a full menu, from appetizers to drinks, you can dine during your movie. \n\nThe seats were high-back leather armchairs that did not recline--I was a little grumpy about that, in the beginning, but I concede there may have been a dining disaster if they had.  I was able to select my exact seat online (no more rushing to the theater an hour before the show, thank you Texas) and the seat numbers were displayed visibly for self-seating.  My date and I ordered from the menu--she wanted the pancetta mac and cheese sans-bacon, but it wasn't possible to remove it. If all items are made to order, what's up with that?  \n\nAnyway, I can only speak for my jerk chicken sandwich and cookie shake since I didn't try the veg sandwich she went with.  The sandwich had decent flavor--and was slap your mama spicy.  It also had a super watery avocado crema that added no flavor and only served to drip all over my shirt.  Grrrr...  The fries were crispy (more on them later) and the shake was fine, not a lot of cookies, but enjoyable enough. \n\nI ding them a star for forgetting the water the first time, because the sandwich was super spicy, and because it was hard to see what I was writing on the table with the plate there in the middle of the movie.  I'm also dinging them because before the movie started, we tried to get the attention of two waiters passing by, as we had questions about the menu/ordering--both said they'd be right with us and vanished so we went with other options.  That alone wouldn't be worth dinging, but they walked my sandwich around a full lap and to three other tables before they/I realized it was mine--so by the time it got to me, the fries were cold. \n\nI'd come back, and I'd probably order food, but I'd make sure it was finger-food only.", "author": "Ilysse W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-02", "description": "So maybe just a movie with drinks until they work out the kinks .... didn't get our food order, told at the end of the movie \"they don't have it \". I'm forgiving and willing to give time but I'll be eating somewhere else. \n\n\nSix months in and the service/food issues still seem unchanged. Sticking with popcorn and one beverage, trying to order after the feature starts is just not practical. Not sure the best remedy.  Main theaters may be too large to really make it work. \nMaybe  as others have suggested a \"swipe as you exit\" to close out your tab. Waitstaff dropping off checks and sort out your payment at the climatic moments of a film is distracting. \nAt risk of sounding intolerant, wish there were fewer \"Alamo for All\" showings. Crying babies are annoying even for parents and I'm pretty sure none of the under 6 months crowd is watching. \nWill still be my taco Tuesday movie locale but fingers crossed for upgrades.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Finally! I no longer have to venture to Jersey to experience a dine in theatre! Last night I visited the Alamo Drafthouse for the first time... and I must say, what a lovely addition to the City Point \"mall\" or whatever you want to call it. \n\nWe purchased our tickets online, so there was no need to wait on a ticket line when we entered. Just a side note, not all of the chairs are reclining, so if you want a reclining one, make sure you choose that option when you purchase your tickets. \n\nThere were PLENTY of food and drink options to choose from. A tad bit pricey, but worth it for the complete experience. I can't wait to return again!", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "OK after a late arrival mishap a few months ago involving us not knowing about their \"no late entry\" policy and the on site staff being pretty unforgiving about it, I have to say the lengths to which the general manager and staff subsequently went to make things right has been really incredibly wonderful.\n\nI cannot say enough good things about our experience tonight - everyone was so friendly and accommodating, and we really had such a spectacular evening. The theater is spacious and clean, seats super comfy, ordering process easy, the staff was warm and friendly, and the food was delicious! \n\nThis is definitely our new go-to theater, thank you to Quinn, and everyone else at Alamo Drafthouse for ensuring the experience was everything we had hoped.", "author": "Kari Jo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "This place is great! I was psyched to hear that Downtown Brooklyn was getting an Alamo Drafthouse, and it's been wonderful to see it live up to the hype. It's a great addition to the neighborhood and, without question, beats the standard movie theater experience. My only note to the person that controls the food menu: BRING BACK THE SRIRACHA POPCORN! Other than that, this place is a 10 / 10. Nice work, Alamo Drafthouse Cinema.", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Still a 4, but I still love you Alamo.\n\nJust wanted to update that I tried the Truffle popcorn, but sadly was not impressed. It has a small inkling of Truffle but not enough to really make it worth the $9 price tag. Will be sticking with the regular butter, or maybe try the Sriracha popcorn next.\n\nThe pretzels are the jam though!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "My very first visit was for a matinee showing of proud Mary.  I used fandango and I was in quickly with a swipe of my debit card. \nThe walkways are small but the walls are full of movie memorabilia.\nThere are menus tucked into tables with pencils to order food and drink..It is best to arrive a half hour before to insure the food is ready by the time the movie starts \nI arrived after and ordered a pizza.  It did not take very long.  Their food menu is pretty vast..alcoholic drinks are also available \nThe theater sound is awesome,  seats comfortable and I will definitely be back \nThe Alamo seems to be for the serious movie goer", "author": "Dionne H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "The best thing at Alamo Drafthouse is the stellar customer service.  I worked with one of the managers to plan a big surprise party for my husband and I never set foot in the place until the actual party. I heard great things about the movie experience (nice clean theatres, super comfortable seats with tables for food/drink, no one is blocking your view, sound quality, and of course, the upscale food and drink service for lazy asses so you don't need to get up from your seat). \n\nI contacted the Alamo to get general pricing and terms, and Karla was so helpful answering my 23989016 questions from day one. There were no hidden surprises in pricing and she was kind enough to let me bring in a birthday cake (I mean, hello https://www.yelp.com/biz/the-cake-dealer-new-york). Since I planned the event for a Sunday evening and wanted to have enough time for guests to hang out with the birthday boy before the movie, Karla was gracious enough to open the theatre early to let guests get there in time for the surprise. She made planning a breeze and I was so happy I was able to show The Shining, which is my husband's favorite movie.  The whole party was themed around it: the invite, the cake, and the movie.\n\nI had a friend run point and get there early and said the service staff was excellent and took care of everything so that guests could get settled with food and drink. I ordered some easy to eat party food and people got settled while 80s/horror music was playing in the background (how excellent is that?) The surprise went off without a hitch and everyone snacked and had drinks and got cake and it was just SO awesome watching The Shining on the big screen with stellar stereo and being able to make your own sound effects with your closest friends and family in a private theatre. And the service from Melanie and the other server (I'm sorry I didn't catch your name!) was great; they're barely in your way and they were so quick and efficient.\n\nMy husband loved his birthday and our guests had a great time.  There was one little snafu but it was remediated afterwards, again b/c of the amazing customer service. I highly recommend having a party here, and it would be a great place to watch a regular movie and relax and grab some grub, too!", "author": "Katherine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "The Alamo Drafthouse is such a great cinematic and food experience! I watched a great movie here last night and I was so impressed by the service and the selection of alcohol. I ordered the Parmesan herb popcorn and a hard cider and I was so impressed by the popcorn. They even had multiple hard ciders for me to choose from. Also, the system of waiting on people is so impressive and I barely even noticed the waitstaff because they were so quiet and graceful. Anyways, I would definitely eat more food here as well, they have a big menu and great vegetarian/vegan options as well!", "author": "Sadie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "Good movies. Good beer. Comfortable seats. It's usually a very good time.\n\nOn the flip side, their no-disruption policy is unenforced. They let a small subset of people laugh during an entire horror movie (\"Hereditary\"). You may as well watch at home.", "author": "Jacob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "The Alamo Drafthouse is worth trekking out to. While I can't attest to their food, I love their popcorn. It brings me back to my childhood days when my mom would pop a fresh batch on the stove and serve it in a metal bowl. Alamo serves it up the same way and even offers clarified butter at no up-charge. Pair that with a local Brooklyn brew and I'm in heaven.\n\nI've seen a few movie premiere here and it's so much better than my local AMC. It seems like the crowd is more respectful here as well which is always a plus when you're dropping $30+ bucks to see a movie. Totally worth the few extra bucks!", "author": "Sara S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "The movie theater is great.  The seats are pretty comfy even though they don't recline.  Much better than Cobble Hill Cinema.  The food was AWFUL.\nI only ordered a spinach frittata and water - but wow it so was bad we couldn't finish it and I'm not a picky eater.  The water tasted so bad as well that it was a chore to drink - and I only did so once.", "author": "Cat N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-08", "description": "My first time here! Liked the spot. Seats are not the most comfortable (don't recline) but the service is on point. They have a comprehensive menu of food and drinks (like Ramos Gin Fizz Milkshake!). It does come at a price but worth it for that once a month movie outing with booze!", "author": "Aishani T."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}