{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-31", "description": "There are better places to watch a movie. I've been here once but tried to come several times in attempt to use a rain check given to me. Our first and last movie experience here was ok. The tables were sticky and food was mediocre. Staff was attentive and introduced us to our first movie dine in at Alamo. Honestly I'm not a very big fan of the dine in experience with people constantly walking past you throughout the whole movie so I wouldn't recommend this for certain types of movies. We wanted to return a second time and showed up without making prior arrangements on a Friday night with two kids. We were told there were no seats left. That's wasn't a problem. We reserved our seats on the website and came back again another day but ran late because church service ran late. The front desk let us up but when we got to the theater, the staff wouldn't let us in even though we were less than 10 min late, just missed the previews. Considering that people are being served, I don't see why they couldn't let us in. But that's ok because we just won't be returning ever again.", "author": "Katsi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "I love the fact that another Dine-In movie has opened in Brooklyn. I'm not a fan of the wings but everything else is great, also its a little over priced but that is expected of a movie theater. Keep in mind if you are going to order a lot of food be sure to have them take the items that you are done with as soon as possible because it's such a pain to have to deal with the limited amount of space and enjoy the movie at the same time. All and all this is a great date spot.", "author": "Cathia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-06", "description": "This place is so wack! Its like the hard rock cafe of pub cinemas. A totaly craven attempt to industrialize hipness with zero origjnality and my god the food was awful. I've never actually had to send food back in the twenty years i've lived in new york, but I couldn't do it- especially at those prices. Ugh. Its really like the hot topic of pub cinemas. Brooklyns good- y'all can go home. :)", "author": "ryan e."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-25", "description": "You can tell this place is still going through its growing pains. This isn't the only dine in theatre in Brooklyn, but they have a lot to do to get the level of some of the other dine in theatres. For one, the menu is massive and you take more time trying to pick out what you want than you do actually eating it. I've ordered meals with fries several times, and more than once, the fries were stale or cold. Also, the staff is so intrusive. They should be able to take an order without getting in people's way or being so loud. Just take the paper and go. The overall look of the place is really cool, and they do have some awesome events featuring some of the stars and directors of the movies. I hope to be able to update my review to more stars,  it for now, I've got to stingy on my stars until the staff improves.", "author": "Tamara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "I love the special guests for some of the quote-a-longs, the funny MCs that introduce the events, the no-talking policy, and the friendly staff. The overall experience is just better than at other theaters.", "author": "Shea H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Huge fan of Alamo Drafthouse--seats are spacious and well-spaced out. Love that I can reserve seats in advance (make note to pick seats at the same table if you're going with a pal, it can be awkward to share the small table with a stranger).\n\nService is terrific, servers manage to be efficient without obstructing views of the screen. My chicken sandwich was really dry and difficult to eat in the dark. You're better off ordering drinks and fries/popcorn/appetizers.", "author": "Jessica Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-01", "description": "It's been 6 months--Alamo should be better by now. There have been so few times I've been able to come to this place and actually order food and receive it correctly that it's laughable. We've gotten Comp tickets 3 times! 3 times!!! \n\nI love Alamo's concept; their movie policies are awesome and cannot be beat in terms of no texting, phone calls, talking, etc. It really keeps the jerk factor down during your movie experience.  Though this is NOT always enforced (like in Logan when there was a kid talking. Ugh.).\n\nThat being said, the food is barely mediocre. Seriously, don't bother unless it is just snacks. I have celiac and they CANNOT accommodate you. I actually got really sick because they claimed they had gluten-free bread and then it wasn't. So you simply can't trust the food if you have any kind of food allergy. My husband got a flatbread the last time we were there and it had so much pepper, it was inedible. I've also tried to get a salad, thinking that would be a safe option, and it was a soggy, spicy mess. However, truffle popcorn, gummy bears, and shakes are great--when they don't run out of stuff. We've tried to order cocktail shakes one night and they ran out of root beer, chocolate, and other main ingredients for the shakes. When we went to see Rogue One, I tried to order tacos--one of the too-few gluten-free options, and they ran out of tacos. Mind you, they had a special Rogue One taco and a regular taco option on the menu. How do they not plan ahead for this?  Obviously they have some major issues they need to work out. The food situation is no where near as good as the one in Yonkers. \n\nYonkers also has a 3D screen option, which Brooklyn doesn't have--which is another downer as far as I'm concerned. \n\nAnother issue I'm not really a fan of is the tables/seating. At the Yonkers Drafthouse (and others as far as I know), the tables are all across the front, so people could get seats together as needed. Now, because it is \"couple seating\", when you go to order tickets on line, it makes it a pain to get seats together sometimes because occasionally the only two seats together are when two people would NOT be sharing a table. How awkward is that? If it was just a straight table in front of you like the other Drafthouses, this wouldn't be an issue. \n \nHouse of Wax is possibly the only reason we keep coming to this place. \n\nSo overall, Alamo in Brooklyn is a decent option. Don't eat real food there. Buy your tickets early. Show up early enough to go to House of Wax. Be wary if you have food allergies. Don't expect to see 3D. And enjoy (if you can get over the crap service).", "author": "Christine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "I may never go to another theater chain again. Thoroughly enjoyed my experience here, being to order snacks/drinks via table service. Staff was very friendly, do their best to be discreet while taking/fulfilling orders. Only downside is they do not reclining seats (which wouldn't be practical here anyway).", "author": "Cary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "I came here to see \"Get Out\". I must say my overall experience was great. The chairs was nice and comfy. We sat in the front row and had no problem seeing the movie. The service was great both at the front desk where we reserved our seats and the lady who served our food. We ordered popcorn, hot dogs, fries, wings and drinks (free refills). The food was delicious. Nothing like your typical movie theater food. My fiance ordered an alcoholic beverage called \"the brooklyn\" which he enjoyed. Can't wait to go back again.", "author": "Deniece H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "Looking forward to coming all week, I made sure reservations were made. Looking at pictures the experience is exactly that. Now as soon as you walk in expect to go up some escalators which is not bad at all. They all worked lol. The theater seemed small, however it had more that one theaters on their building. It was cozy and host right size to snuggle up or just chill with who ever you decide to share the experience with. Hostess I lntroduced herself she was very nice and pleasant. She explained how to order. Now the rules they are very strict, so please take all pictures before the movie starts and after it's finished. The don't operate taking or cell phones seriously or they kick ou out with no refund. This was hilarious, it's about time a business mean business. You pay for what get nice quite and fun experience. We both had the Rose wine which was good and something chips and cheese (it's spicy). Bill wasn't bad at all, this does not include in movie tickets. I had great experience in Brooklyn ...BK all day. I'm definitely recommending this theater for ppl to come check and I'll be back. Oh BtW what was really dope movie lovers they have old school movies when I say old I mean they must found these movies in old Hollywood. Scary , Drama, etc I guess the hame specific nights. Love love love. Dope theater !!!", "author": "Kashiro W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "It seems like these guys are still working a few kinks out of their system. Every time I've been, there have been issues but they've always made good on them. I appreciate the effort. The main problem with this place is the center seats are so much better than the rest. If you can't get a seat in the center, you're arching your neck or sitting sideways in your seat.", "author": "Bennett C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "Very attractive and comfortable cinema. The food is just okay - basically bar food in a movie theater, but the service is quite good and I love their no phones/talking/texting policy.  The comparisons to Nitehawk are valid, especially considering that it seems that the Nitehawk copied the Alamo's business model. I'd say both theaters are pretty much the same thing - the only real difference being that the Alamo has more screens. Either way, if you're a movie fan, both establishments are welcome additions to Brooklyn. If the food improves, I'll change my review to 5 stars.", "author": "Ben G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "The theater was clean and the seats were comfortable.  I enjoyed the experience overall, but I have a few critiques!  The bathroom needs to be tended to more frequently and the papers at the tables need to be numbered, so the servers/runners will know where to bring the orders.", "author": "Tawana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "I LOVE Alamo Drafthouse, my boyfriend and I come twice a week from Manhattan even though there's a Regal by us. \n\nI love that you could order food and cocktails (even though the food is very average and a bit pricey) from the comfort of your seat and that the elevated seats are nice and wide and have plenty of leg room. \n\nMy boyfriend and I have even sat in the front row once and it was a really pleasant experience, it was far away enough from the screen that you're not straining your neck and the seats recline fully so it more than makes up for the front row seats. \n\nThere's reserved seating so you're not fighting with people over seats and at 15$ plus 1.50 in fees, it's cheaper than some Manhattan cinemas (cough cough iPic) \n\nI honestly cannot go to another cinema with its worn out carpets, long check out lines, stale popcorn and cramped seats after being at Alamo Drafthouse.", "author": "Jesse A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-12", "description": "I used to go to the Drafthouse in SF and loved it. This one is nice, but slightly less charming since it's in a mall. \n\nI saw a movie there last night and submitted a drink order. It never came. I told the server who took the order again. And never brought it. I submitted another ticket for the same order but no one ever came and took it. Then they slipped us a bill. Super lame.", "author": "A M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Took my mom here on a date. She really loved the comfort of the theater and it's many conveniences. Beer was a little over priced, toilets were fairly clean and functioning. All in all it was a great time and we'll go back.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "I've been a fan of Alamo Drafthouse in Austin for years, and was so excited when it opened in Brooklyn. I've been to it a handful of times now, though, and the same problems always come up. \n\nIt often takes 45 minutes or more for food to arrive after we order. When we try to order something midway through the film, the order is never even picked up. Orders are sometimes brought out incomplete--I had to ask twice for a mug to go with my pot of tea, and then wait for 20 minutes, at which point two different people brought me two mugs. \n\nThe theater itself is lovely and comfortable, and I LOVE the strictly enforced no talking policy--but having to flag servers down to ask for things they forgot and wondering if my order is going to arrive before the movie ends is a major distraction from the film. I'd rather stick to concession stand popcorn and be able to enjoy the movie.\n\nAdd to that the really limited menu and I'm underwhelmed and disappointed. The service in Austin is flawless, and I'm not sure why they don't adopt some of the same systems. I get that it takes time to iron out kinks, but I don't see any evidence of that happening here.", "author": "emerson j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "Hire more people of color for front-end and decision-making positions, please. Play more films made by filmmakers of color, please. Maybe I was there on an off-night, but to be anywhere in downtown Brooklyn \u0026 for the space to be 100% white doesn't make any sense.\n\nThis problem might be interrelated but the food needed work. Jerk chicken sandwich was shameful, \u0026 you can't serve raw kale, brah. Need to massage it or marinate it. \n\nThis is my first yelp comment, I'm not a troll or complainer. Just really hope some love is put into the areas above.", "author": "Eden E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-07", "description": "I want to start off by saying the facilities were all nice and new. Seats were comfortable. Tables were decently sized. All the food we actually got was decent and reasonably priced. I enjoyed the movie, too, which was the saving grace my experience.\n\nI've previously been to the nitehawk in williamsburg and liked it, so I was looking forward trying out the alamo. But we had a number of issues.\n\nWe placed our order at the beginning of the movie, along with most of the other tables. The server came by in a bit to tell us they were out of the shake we ordered. That's fine, it happens, we ordered a different one.\n\nA bit later, the server comes by to tell us that someone else's salad will be coming to our table, and not to worry about it, since we won't be charged. The salad never showed, which was fine, but the whole thing seemed a little disorganized.\n\nAn hour into the movie, every other table has their drinks and appetizers. We have nothing. We call our server over and ask where the food is, and she tells us there was a backup in the kitchen. Sure, whatever.\n\nA few minutes later, we get our pretzels and shake (along with someone else's chips, which we sent back). Our server comes by and asks us if everything good. I said yes assuming that our entrees would be coming later, a bit after the appetizers.\n\nMaybe half an hour before the movie ends, the server comes by with our check. On it, we were billed for a burger (we had ordered two), which we never received. I left a note that there was an error in the check. I just wanted the charge off the bill (since we had never got the food). The server comes by, and tells us that we should have told her when she came by after the appetizers came and going on about it for a bit. I was trying to pay attention to the movie, since this was happening during the climax, so I didn't hear everything she said, but I had thought she was going to remove the charge, since the movie was almost over and we hadn't got the food.\n\nInstead she brought us one burger (when we had ordered two) about 10 minutes before the credits.\n\nWhile I enjoyed the movie, I would have enjoyed it more at another theater. I think next time I want dinner and a movie, I'll go back to the nitehawk, or try the new ipic.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Only ever tried the truffle popcorn,and all the IPA's. Like this place a lot. Worth the trip from manhattan. Good seats,service and fairly priced. There's even an indoor bike rack .", "author": "Nicole S."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}