{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Went to Alamo on Saturday, 12/3. As mentioned in earlier reviews, my ticket wasn't checked upon entry to the theater (to be fair, there is instruction to place your ticket in the front of your table so maybe the server at one point looked at it?). That was a bit different, but I rolled with it. \n\nI found my seat to be somewhat comfy (yay! back support), but note that they're not super plush nor do they recline. There are also cup holders on the arms of the chairs, but because of the relatively close together layout of the chairs in the rows I would not use them, as your neighbor is likely to knock any cups placed there over. \n\nI arrived about 20 minutes before the movie and got briefed on how to order and what to expect from a woman who appeared to be the main server. After promptly placing my order for a beer and a burger I sat back to wait and watch my flick. I found the pre-movie videos to be hilarious and on-point (as the movie was Doctor Strange there were a few cinematic history shorts), and the venue's audio and video to be excellent. \n\nThe reason for 4 out of 5 stars? Service seemed to be hinky. I got my meal order about 40 minutes into the movie (almost an hour after the slip had been picked up by the server) and didn't get the beer that I'd ordered on the same ticket for another 30 minutes (after speaking to the server who'd brought the food - the same gentleman who had delivered everyone else's drinks - and writing on two additional tickets on separate occasions that I still hadn't gotten my drink (BOTH tickets were picked up and read and there was still a lag)). My burger order was great, and the servers were obviously hustling like mad, and that along with the great overall experience is why I'm willing to give this place another try.", "author": "Daniella S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "The theatre is nice but they need to get it together before I return.\nChairs are not very comfortable. The waiters were serving meals though out the movie, bending down moving through the aisle. It was so disruptive. I have been to other theaters that serve food and they serve the food before the movie begins.\n I was eating some nuts and the waiter came over and told me no outside food. Give me a break. Nuts in my bag is not considered to be food.", "author": "Adrianne W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-14", "description": "So, like a lot of other reviewers, I can confirm kinks.\n\nPros:\n\nNice large screen\nComfortable seats + atmosphere\nGreat drink selections\nVegetarian options\n\nCons:\n\nWait time for food -- we waited at least an hour into the film before our food that we had ordered during the previews arrived.\n\nMissing items -- we ordered a round of drinks that never came, but showed up on the bill. We also didn't get a fork to go with the salad ordered (I had to physically go ask for one).\n\nFood quality -- Caesar salad is subpar and very overpriced. It's advertised with chicken but buyer beware, it comes with almost no chicken. The veggie sandwich was pretty good, but the fries weren't great and arrived cold.\n\nAll in all, I would say Nighthawk has a much better service flow, however their theater is older and smaller. Alamo has great potential if they can get the service together. The Wax House is really cool though, so check that out if you have time!", "author": "Sydney L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "Went for the second time last night to give the place another shot after a mediocre experience for Wonder Woman. That time, the Thai Chili wings had basically no meat and my friend's plain margherita flatbread had so much spice (which went completely unmentioned on the menu) that she couldn't eat it. Friends subsequently had told me to give it another chance, that it had settled into a groove and the food had improved.\n\nPancetta mac \u0026 cheese: cold, rubbery, came with a SPOON, and what little cheese there was was concentrated in the middle (leaving most of the noodles bare and disgusting). The leeks were also gross and completely the wrong flavor. I almost sent it back (and I NEVER do that).\n\nTruffle Parmesan popcorn: again, what little seasoning there was was concentrated in the center and not distributed to all of the popcorn (which was also cold).\n\nThe drinks were fine but not super strong. The cookie flight was okay.\n\nFor the price of the movie and the menu items, this place is absolutely not worth it. Go to Nitehawk - the food's LEAGUES better and you'll have a much better movie experience.", "author": "Mary H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "Spend your money with nicer people than these. My husband and I took the day off work together, which is something we never get to do. Specifically to watch Star Wars. We had a bit of an emergency which delayed us, so we spent $20 on an Uber to get to the Alamo. We showed up about 12 minutes late and were told they'd already closed the doors and its policy not to let anyone in.  We'd already purchased 2 seats on the back row, so I pointed out we wouldn't disturb anyone.  Begged, pleaded and were told \"no, it's our policy\" over and over by the guy with a rat face and his bloated sidekick at the front. Some BS about safety announcements at the beginning of the film and it's a liability. Well not for any other theatre on the planet!  Policy, policy, policy. Well it's my policy to spend my hard earned money where people are a bit more empathetic toward their customers", "author": "Farrah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "All around amazing movie theater, and if you share their taste, amazingly curated film selection.  Beware of their menu though - the food and drinks, with the exception of the draft beer, is incredibly over-priced and basically a rip-off.  However, the beer is reasonably priced, and incredible and all-encompassing beer selection - seems like they want you to enjoy a beer with your movie?  However, if you would prefer something other than beer, be prepared to get hosed !", "author": "Fadda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Wonderful theater with a great old school vibe. I came here with some friends to watch Stephen King's IT. Service was very friendly and the food and drinks were pretty good too. Try the bar downstairs with the creepy looking fetus display! They have great drinks in crystal tumblers, order the Nymph Lolita. The carpets of the theater is from The Shining~", "author": "Ellen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "I've been to the Alamo Theater in Yonkers and when the Brooklyn one finally opened I needed to pay a visit. \n\nWent with a friend on a Sunday afternoon. It was a last minute decision but luckily it's reserved seating and you have to choose your seats when you purchase tickets. \n\nThe service was good -- this is a dine-in theater so don't expect the servers to not be walking in front of you constantly. There's a space for them to walk so you don't have to 'make room.' The theater is as dark as any normal theater but there are dim lights underneath the table \n\nThe process:\n1. Look at the menus that are in its own special pocket in the table (use the lights under the table)\n2. Write down what you want to order on the order cards on the table with the supplied pens. Be specific - well done, salad on the side, etc.\n3. Food and drinks gets served to you. \n\nWe each had two beers and two burgers that we clearly stated we wanted well done. These came medium rare. We sent them back and 2 well done burgers were re-served to us. \n\nThe servers were fine about the order being sent back and acknowledged that the kitchen made a mistake. The movie was good and overall, it was a fun time.", "author": "Chips R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Very enjoyable experience overall - I greatly appreciate having the option to spend a relatively appropriate amount of money on actual food (rather than incredibly overpriced popcorn/candy), and beer/wine/cocktails/shakes (rather than an overpriced, enormous soda).  \n\nThe theater I was in was large and clean with comfortable (though as noted by others, oddly non-reclining) seats.\n\nI arrived after the movie had started, but was able to figure out the ordering process in the dark, and the waitstaff served me relatively quickly.\n\nYou obviously do see waitstaff quietly and efficiently moving around, but I did not feel it detracted from the experience.", "author": "Katherine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Best movie theater in the city period.\nThe front two rows are the way to go. They recline almost horizontally.\nGreat menu. MASSIVE drink selection.\nThe lobby has the carpet from the shining \nThe bar on the lobby floor is also a wax museum with a magnificent staff.\nOne of my favorite places to go spend a night out!", "author": "Ynessa O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "we've been here twice and we love it. I really like the fact that you can choose your seats before coming in, to avoid the search for seats. the food and drinks are great! I really love the buffalo wings as well. this is definitely our go to theater now ^_^", "author": "Shurland C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-06", "description": "We love the Alamo and started with their locations in Austin where you wouldn't think of going elsewhere. We've given this location a couple of tries so far, and we'll definitely be back, but there are some real kinks that haven't worked themselves out just yet.\n\nThe good: seamless entry to the theater and comfortable amenities across the board. The staff is generally very nice and willing to help. They offer a free ticket during your birthday month, which is a nice perk, and their fried pickles are basically awesome.\n\nThe ugly: We saw a film there this past Sunday and servers tried to bring us other people's food at least 3 times during the movie. Meanwhile, we ordered before both of our neighbors and our popcorn and beer came after their meals, and it was the type of wrong popcorn. The previous experience included over-cooked flatbread pizza (think pizza crackers) and a seat change after our purchase was made (changed to the front row!).\n\nAll in all the Alamo brand is fantastic, and this is likely just how things go when opening a large new franchise in downtown Brooklyn. Just please don't cal it DoBro. Please...\n\nAlso, while not a fault of Alamo's in any way, note that the ADA row's seats do not recline, which is a nice feature of the theaters.", "author": "Gary P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "So happy Alamo opened up a branch here in Brooklyn!  Used to live in Austin, where my wife and I would watch movies exclusively at one of the various Alamo Drafthouse locations there.  \n\nFor the Brooklyn location, I would give 5 stars if they had more vegan options on the menu.  \n\nOtherwise, love the movies and events they host, the excellent staff and the strict no talking/texting/arriving late policy.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "I went with a friend to watch Get Out (the Jordan Peele flick) on opening night with super high hopes. Another friend of ours highly recommended it, so we were excited. \n\nI will say, I was expecting slightly lower prices since it is in Brooklyn. It felt like we would've spent the same on booze \u0026 food in a bar in Chelsea or wherever. We planned ahead and got drinks elsewhere, then found our seats without issue (which are truly comfortable) and waited to place our order. I loved the assigned seating. *Buy your tickets well in advance if you want the perfect seats!* My friend and I had plenty of room and a good view, so that was cool. \n\nI started to get annoyed with our server who for whatever reason felt the need to treat us like unattended children. But, that minor hitch aside, we had a good time. The flatbread pizza is a must miss, pretty bland and dry, honestly. I'd say it's a safer bet to stick with beer and fried foods! The fried pickles were SO GOOD! (I'm hooked now) and we really liked the hot wings (really heavy-handed with the Tabasco, haha). \n\nTo my surprise, the bathroom was pretty clean \u0026 orderly and everything else was pretty good! \n\nHowever, service definitely needs improvement. Several people ignored us when we were obviously looking for help finding the restroom. No one likes being ignored when they've already paid money for something. \n\nCheck it out \u0026 see for yourself. Worth the visit.", "author": "Ngozi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Never thought I'd be a convert, but Alamo is the best. Excellent food, ninja waitstaff, extensive drink options. You have to be there for the right movie - this isn't the place to see something that you want to focus on every film frame for - but for popcorn flicks, comedies, and nostalgic favorites, it can't be beat.", "author": "Anais K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "I have been to a few dine in theatres, IPIC, AMC and now this one. I really love the IPIC theatre but it's not in everyones budget, AMC dine in is great but the food leaves much to be desired.\nThis theatre is good, if you check in before arrival, you just take escalator right upstairs and walk into movie theatre, no ticket needs to be shown to get in theatre. U find your reserved seat and then waiter comes and explains service and asks to see your confirmation so that they know you are in the correct seats. The menu is pretty general with alot of choices for beers. We ordered buffalo wings and a burger w/ fries and cocoa cola drinks.\nIt was a little harder to see food once it came cause it was pretty dark in theatre.\nThe buffalo wings were average and the burger was ok. The sodas were pretty large. Both meals were around $15 and the sodas were $2.75 each. They also tell you that this theatre has a no tolerance for talking and cell phone usage, one warning and then the second warning they ask you to leave movie theatre, needless to say when movie started it was quiet as a mouse. My only disappointment is the seating, yes they have leather seats but the seats do not recline. Overall, good experience but other options for a dine-in theatre  that we like better.", "author": "Gina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "I don't understand the bad reviews!! Best movie theater around. Affordable ticket price, good food, good drinks, great bar to hit before the movie! Try the moscow mule, flatbreads and steak sandwich. No need to say the popcorn is the bomb! Soo gooood", "author": "Gabriela D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-12", "description": "My roommate had been excited to experience this theater and I was curious. Was pretty much underwhelmed by the whole experience. The seat looks more comfortable then they really are. They don't recline so you're sitting straight up like you're in school lol. The strawberry cheesecake milkshake with Jamaican rum was flavorless. It just tasted like creamy rum. Not sure if it even had strawberries lol. The \"Tesser Mac n Cheese\" which was in the special \"A Wrinkle in Time\" menu was SO bad. First it came out cold. It was in a mini casket iron skillet. Why? I don't know considering that it wasn't cooked in it so it tasted like the bottom of a burnt cast iron skillet. But nothing was burnt ‍. There wasn't enough \"cheese sauce\" or whatever that was. The fried chicken strip that was chopped and placed on top was the length of my pinky finger I Kid you not! Lmao. Like toddler portion. That was the only thing that had flavor. This Mac n cheese was $14 most certainly not worth it lol. I'm in no rush to see a movie here again. And if I do I'll eat before I get here. Their rating speaks for itself. There are other better dine in movie theaters on the city. This one just isn't hitting it unfortunately.", "author": "Summer F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-07", "description": "Theater is beautiful. Love the fact that you can reserve your seats. The House of Wax bar is quite interesting to say the least. Feel like it's a place you visit once and get over it. Definitely a great place to see a film. Food on the other hand, not so great. Mediocre at best. Go to Nitehawk instead for a more intimate feel and way better food.", "author": "King K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Decent food and waiter was very fast with food only complaint drink wasnt that good besides that great theater", "author": "Solomon G."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}