{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Alamo is like a cute cozy and petite version of iPic theaters. Although the seating didn't recline, they were comfortable. It was clean and the waiters and waitresses were pleasant. I ordered the Asian salmon salad and to be honest, it was the best salad I probably ever had in my entire life. The hot chocolate was a hit too! The only complaint I had was that my cousin had waited approx 30mins for her food to arrive which consisted of hummus and chips. Overall, I Would definitely come here again to avoid those iPic prices.", "author": "Nye C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-09", "description": "Really wanted this to work out, and the movie and space were great, but my food didn't come out until I told the server to forget about it (the check came with the sandwich included). I didn't pay for it and would've been very content at that point, but then they brought out the sandwich and fries that were made but just had been sitting in the back for an hour - cold. Then I had to eat it because I was pretty hungry, but I wish I could have left with a better association.", "author": "Anh-Tuan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "I am never going anyplace else to see a movie.  You sit in huge, leather upholstered club chairs, with little school desk type tables so that you can order food and drinks.  Not just the normal movie theater junk, decent edible food.  They've got a large selection of draft and bottled beers, some interesting wines, and decent food.  The best food tried so far is the wild mushroom flatbread.  It is perfectly mushroomy-cheesy-creamy-peppery.  I've also tried the cobb salad and blackened chicken caesar, both decent.  Have not tried the sandwiches and meats yet.  You're not really coming here for the food, but there is pretty much something for everyone.", "author": "Cary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Nice dine in theatre for $15 movie tickets. The food prices were way better and tastier then your average AMC or Regal. They served nice restaurant quality food that didn't break the bank.", "author": "Cynthia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "This is everything you want a movie theatre to be. Its not very big, so there are assigned seats and you buy your tickets online before so you know where you are sitting. For those people that complain that they were \"too close to the screen\" well thats your own fault for buying the tickets there! Anyway this theatre demands silence and that phones should remain off so that you aren't texting the whole time, which I like. Its cool how you can order drinks and food, and the prices are pretty standard for NYC. the only problem I have was with the popcorn. you would think being a movie theatre that the popcorn should be fresh and warm, well it wasn't. it was stale and cold. which is a shame because you pay 8$ for a massive thing of it and it is poor quality. its a great experience though to see a movie and the chairs are comfy. ill probably be back.", "author": "Joshua V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "You're not getting top of the line technology (video or sound) but it's good. The no tolerance for texting and talking is the best thing in the world though. Most NYC theaters have awful and disrespectful crowds, especially when it's a wide-release blockbuster movie. This cineplex stacks up there with indie theaters, etc.", "author": "Umair Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "In the spirit of goodwill, wanted to say that the person who edited the clips had a thoughtful response and I am thankful for that. Will hopefully be back in the future for a showing with less unwelcoming preshow clips  :)", "author": "Tasia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "I went here for my first movie and meal tonight and really enjoyed myself overall. My boyfriend and I reserved our seats online earlier in the day and walked in early enough to get a quick run down from the waitress on how everything worked. She was really nice and took our order quickly. The drinks and pretzels were a great start. I ended up getting the Caesar salad and my bf got the steak sandwich. My salad was a little took soggy in my opinion when I got it even though the service was pretty quick. My bf also felt his steak sandwich was a little undercooked but enjoyed it overall. I would definitely go back and try some other meal options. It's a nice option to change up a movie night. Definitely worth checking out.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "went for the first time today for the afternoon showing of beauty and the beast   - great seats, love the service, highly recommend the margherita flatbread =]\nvery clean and friendly waiter - not many people came so it was very spacious and waiter was very attentive. food came fast and hot =]. fyi: the honest tea is unsweetened but good", "author": "Jacqueline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Super cool I went to the bar didn't go into the theater just wanted to check it out but it seems dope they have so many beers at the bar I'm not much of a drinker but I was about to try some..Super chill can't wait to go back and see a movie ..", "author": "Cynthia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "It's a really great theater and a much needed upgrade from UA on Court.  I think the food was decent and decently priced and out waiters did an excellent job (we were a group of 8).  Can't wait to come back and looking forward to seeing some of their \"classic\" movies", "author": "Heather B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "Brooklyn has become so fancy.  And the Alamo Drafthouse is a part of the \"new Brooklyn.\" However, I was pleased to see a diverse crowd, and the customer service was good.  Maybe too good.  If you are ordering food and drinks, the attentive wait staff who peak in frequently is a nice perk. But if you aren't ordering food and drinks, it is distracting. For that reason, Court Street 12 and BAM Rose Cinemas will still be my main go-to theaters, but I'm glad we have another movie theater option in downtown Brooklyn.", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "The Alamo really changed the way I go to the movies. First off, the theaters themselves are fantastic, nice seats, plenty of legroom. Secondly, I love the way they do food delivery, the servers are like ninjas coming by with your popcorn and drinks. The Alamo is my go-to theater from now on.", "author": "Billy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Alamo draft house was one of the reasons we even signed our lease in the building next door in addition to all the shops that were promised to open in 2016 and not opened! We loved it in Austin as a place to watch some old classics, private screenings and just cheap movies. We were poor college kids back then so we rarely ordered food and drinks. I'm saying this because this review is kind of biased due to nostalgia.\nWe went to the theater twice during the weekday -once for their soft opening and another time a few weeks after that. We got 50% off the first time and 15% off food and drinks the second as they worked out their kinks. Their kinks were surely big the first time. They forgot to take our order, delivered our drinks late and forgot my friend's food. The bill also took forever to come after the movie was long done. We were definitely less than happy even with 50% off. The staff was apologetic though. The second time was much better. Everything ran extremely smoothly and we thoroughly enjoyed our experience. Food is not bad for what it is. The tacos are awesome, but I've had better Tex Mex. \nPrices are not cheap, but this is New York. We spent around $80 even with the 15% off for two including food, regular movie tickets, but no booze. People complain about the seats and I don't find them bothering me, but I'm tiny so that's relative. \nThe bar is also a great addition to the area and we definitely need to check it out. The wax museum is outright creepy and uncomfortable to me though so I don't know how I would feel drinking there, but it might be your thing. If you enjoy movies, you will definitely appreciate the thought they put in for decor as well.  Note, they won't let you in once the movie starts and they have a no talking policy so don't be disruptive.", "author": "Connie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "The only negative thing about the Alamo is that you'll never want to go to any of the larger cinema chains again. It's like choosing between flying first class on an amazing airline versus economy on a super saver budget regional one where you have to sit on top of your luggage for 5 hours, both for the same price! You actually feel welcomed here; the service, the attention to detail, the quality of the screening, all of it flawless. I can't recommend this place enough.", "author": "Stefanos M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "It was great to be able to order food and drinks while watching a movie, the seats are comfy, the sound is great, so was the service, and the house rules (eg no texting etc) were good!", "author": "Ida K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "My friend and I were looking for a place to see Beauty and the Beast so we decided to come here. This place was nothing like how we would expect abnormal cinema to be. The theater seats are very fancy. Why? Because each pair of seats comes with a table and table light. They have a menu with a wide selection of foods, desserts, drinks, and more. Although the food can be a  it pricey, it's good for the experience. It was nice to sit back, watch a movie while having dining experience. The servers would come to your table to take your order and bring it to you within minutes. This is something very different from what we have in LA so it was pretty cool to experience this once. I'd probably come back again another time.", "author": "Anh P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Probably my favorite theater in Brooklyn behind BAM Cinematek. Great beer selection and I love how they program old classics and popular movies from the past. The Thai Hot Wings are particularly tasty and they make their popcorn on the spot for you so it's extra fresh!", "author": "Gabe D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "We never got the food we ordered, but we were not charged.  In fact, our entire row never received our orders.  Maybe come up with a better ordering system.  Also, one of the armrests was broken.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-06", "description": "Place is great and staff is very friendly but they forgot our food. Guy next to us had the same problem. People with me had had that happen before. Hopefully they are still working out the kinks.", "author": "Marc M."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}