{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Love, love, love this concept!\nBig theater, large comfy seats, reserve seats ahead of time!\nMenu with some foods to nosh on during the movie like soft pretzels, burgers, oh and of course popcorn!  Popcorn served in large metal bowl with variety of seasoning choices. Yum.\nEven better, they serve alcoholic beverages!\nTo order, you write your selection on a piece of paper and stick it in a holder at your table.  The wait staff pick it up and then bring you the food/drink when ready.\nThough I really enjoyed my experience there are a few things I will mention: \n-the aisle floor was sticky, gross\n-service was kinda slow \n-No (overpriced) movie theater candy offered!  The only sweets offered were cookies, I believe.  The candy is part of the overpriced experience, is it not?! lol\n\nBe careful how much you drink!  There is no bathroom in the actual theater so you have to leave the movie to relieve yourself!\n\nDespite these things I would def revisit the theater.", "author": "Joey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-05", "description": "Location is great. Inside of a mall on the 4th floor surrounded by a lively neighborhood. Theatre has a bar with a wax museum inside. Kat the counter service associate was awesome. Felt a little awkward with wax figures representing dead people and babies cut open staring at you while drinking or eating. Theatre rooms itself were not big, seats don't recline however it was comfortable. Service was on point and food was good as well as drinks. Great menu options. I tried their jerk chicken sandwich which I felt could've had more seasoning (or better yet fried with a jerk batter) and a root beer. Popcorn comes in a large bowl and tasted fresh. Strict no phone/talking policy as well which is awesome.", "author": "Travis L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "I watched \"Won't you be my neighbor?\" here. The theater entrance is on 4th floor of a very clean and nice mall. I loved the decor. Lots of old movie posters. Comfortable chairs.\n\nFood service is pretty good. Just write your order from the menu and put in the slot. They have a full menu; from Bourbon to Shakes to Popcorn to Sorbet.No need for the pre or post movie meal on a night out.I enjoyed the Mango Sorbet. A very enjoyable place.", "author": "Noah I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-18", "description": "Love it or Hate it? Alamo Drafthouse Cinema falls into either one of those two categories. Cinephiles clearly love it. But not everyone does, and I think I may be able to offer a bit of insight as to why.\n\nWhat I love about Alamo:\n\n1) The screen and sound system = incredible! One of the best in NYC, the sound and picture quality truly made for an enjoyable experience. The colors were so vibrant and the large screen showcased every scene in a highly realistic way. A work of art. Made you feel as if you were actually experiencing it yourself, so real. \n\n2) The space. Very different from the typical movie theater. The seats are large and comfortable and because each person has a table, everyone is spread out across the entire room. The net result is fewer people in the theater, making it feel more intimate. No one bumping their knees against the back of your chair or having to peer between heads. Also, great air quality, not stuffy at all. And very clean. \n\n3) The system for ordering food and drinks. Simply slip a card into the slot and wait for someone to pick it up. On the night I went, they were highly attentive and quick and picking up requests. But quite a bit slower  when it came to delivering the food.\n\n4) The etiquette policy. No phones, talking, texting etc. Great policy which most people respect. The staff is very polite and hard working.\n\n5) The drinks. OMG, they make the best mixed drinks here. Tried one of the shakes -- it was small but good. \n\nWhat's not so great?\n\n1) The food. Make sure to order before the movie starts. Very hard to read the menu in the dark. Mixed review for the food. I ordered the chicken. It arrived small, cold and dry. Could have been just bad luck. The beans were incredible though - very delicious.  The prices aren't cheap, expected more. \n\n2) Interruptions. Because people were ordering during the film, the waiters had no choice but the run back and forth. It's a bit distracting.\n\n3) The bathrooms. As other reviewers have commented, there is an issue with the bathrooms upstairs. To solve this problem, I used the bathrooms downstairs, which were fine until one ran out of toilet paper. Oops.\n\nTo summarize- Alamo is a fun and unique theater. I'm glad I went and checked it out. It's a unique experience and I found it to be an enjoyable one. It is a little on the pricey side, but you could pay the same or more for a dinner in NYC without a movie included. For those seeking a gourmet food experience, lots of other (better) choices. Great time saver, see the movie and eat dinner simultaneously. Good for a first date, if you're looking to avoid awkward dinner conversation.", "author": "Marie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "One of the coolest movie going experiences I've ever had.\n\nBEWARE they have a STRICT no phones on during the movie. You get a warning and then you get removed!!\n\nThe theater is not large, maybe 50 seats if you count those awful seats directly under the screen. Each ticket has a reservation for a seat, so no worries about getting about someone sitting in your seat because they will check your ticket and no worries about getting a bad seat because you were running late... but don't be late, they close the door once the preview start and you are no longer allowed to enter the theater. \n\nThey dont have a concession stand... yhey have an entire kitchen and bar. They have a variety of menu options  such as nachos, cheeseburgers with fries and yes they still serve popcorn.There is someone going around taking your orders the whole night. And they try their best to no disturb you while you're enjoying your movie.\nI will say they have a weird collection of movies. But I'm not big on Sundance films and such", "author": "Paul T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "This is my go-to theater because it is close to my job. Once I leave at 8am I'm within 5 minutes walking distance and on the weekends I can catch an 8:30 or 9am show and be outta there by 11am!\n\nI always get the Thai Wings and a Blood Orange Soda (No High Fructose Corn Syrup) but the last time I ordered the Drafthouse Beef Burger when I went to see Deadpool 2 and it was delicious!\n\nThe thing I like about the theater is all the obscure and nostalgic movie posters on the walls that only real movie heads would recognize. \n\nThumbs up!", "author": "Mark G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-08", "description": "Now I love Alamo Drafthouse but I usually only go here to treat myself. Ticket prices on top of food can make it expensive especially if not alone. One thing is that I wish they had single seat options maybe just a row or two so that people who come alone don't have to share a table with a stranger especially since it is a small table which makes things more intimate.", "author": "Steffanie I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-30", "description": "Ordered tacos at the beginning of the Avengers: Endgame. That movie is three hours long. Never got the tacos. Ordered a simple mimosa, didn't get that either lol. Dope spot one of my favorites but ALWAYS an issue with not getting food/getting the wrong food anytime i go. More than likely will not be returning.", "author": "Alyssa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "- I enjoy the concept\n- wait service at movies\n- $35 bottle of wine\n- I expected the food to be more expensive \n- assigned seating s a cool concept s well\n- wait staff is quick", "author": "renje g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "This is my preferred movie theater in NYC so far. It's close to where I live and buying tickets online is as simple as it gets. \n\nYou pick the movie. You pick the date and time. You pick your seat(s). \n\nThe difference between this movie theater and some traditional ones is that this is a dine-in-theater. The menu has plenty of variety. My favorite things to order is the pepperoni pizza (I cant remember the exact name) and their chocolate chip cookies. It's just as good as the cookies your grandmother bakes. It's warm and the cookie easily pulls apart. You can see the chocolate stretch and ooze out. The food comes freshly made to your table as the servers come sneaking around like ninjas so they don't ruin your movie experience. \n\nThe seats are comfortable and there are some options for reclining seats as well but I believe it's only for the front row (don't take my word for it). The picture quality is what you expect. The sound quality is superb. Getting into the theater and finding the theater room is fairly quick as you don't have to wait in a line. I've taken friends and family to this movie theater and each time they've told me that they want to go back. \n\nTheir customer service is great too. I had to cancel tickets and the manager who was on the phone was really helpful and nice. He didn't sound annoyed at all and took care of my problems. I'd give this place 6 stars if I can. I definitely recommend.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "I loved the Alamo Drafthouse. The finger foods that we ordered were great. We had the fried pickles - yum, the nachos w/ queso (queso was so flavorful \u0026 had a different kick to it) which made us really enjoy it, and the wings which were good as well. We had some Brooklyn Lagers and then decided to try the cocktails which weren't tolerable for my taste. But other then that everything was great. I will be returning soon to see another movie to kick back and let my inner fat-so spirit loose.", "author": "Tatiana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Yes. Go here.\n\nIt's about the average price nowadays for a movie theater ticket, but you get a whole lot more in the experience.\n\nYou can get the full date vibe going on, thanks to the fact that you can order food and drink at your seat. That is a big plus in convenience.\n\nSure... you can't talk much or smooch much during the movie, but let's be honest. Sometimes (more often than not) your movie is the far more interesting attention grabber, and it's great not having to deal with other people interrupting your viewing experience as well.\n\nBathrooms are clean, hallways are filled with interesting conversational pieces. But the food, though... omg yes... truffle popcorn and berbere wings, and that strawberry cheesecake milkshake.... yes. Just go already, I'm going again this weekend.", "author": "Edin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Yeah... \n\nNever ever going to another movie theatre again. \n\nUnless it has a dine-in feature. Place spoiled me and my wife ROTTEN. \n\nBoozy milkshakes??? With cereal in it!???\n\nHot wings??? \n\nReserved seating??? \n\nI'm hooked. I generally hate movies but this place makes me love them. Even if the movie sucks, the food and drinks cant lol. \n\nReally enjoyed the customer service and how swift they acted. I also enjoyed the soft and comfy seats and the various selection of food. I was having a hard time choosing one thing. Now I have a reason to return and try more. Awesome theatre. Will return!", "author": "Kyle N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "I booked two dinner-time tickets a week in-advance to see Crazy Rich Asians at Alamo with husband. We are both Asian and we sat at our seats for over 20 minutes without anyone ever greeting us or to take our order. Isn't it ironic? \nDuring the time, one waitress walked past our seats three times to attend to the white couple sitting to my right, I can hear the waitress telling them that the chef can accommodate their special request for a burger dish. The reason why she never greeted us is up to your interpretation. \nAbout five minutes before the movie started, I informed a staff at the door, still no one came. We walked out when the movie started and we still have not been able to place any food order, deciding that the experience was not what we paid for. \nThe manager wasn't trying too hard to make things right. She offered to let us watch another movie free of charge the same evening, but most of them are at around 10pm, which would be way past dinner time. She gave us a refund without offering any free tickets or gift certificates. \nOf course, I would never come back.", "author": "Angelina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-03", "description": "Didn't like the fact that they kept everyone waiting until 30 minutes before the show. We all had to wait in the busy hallway. If they let people come in sooner, they could serve people food much earlier. It was very annoying having waiters go back and forth through the theater, while the movie was playing. It was distracting and sometimes they got in the way. They really should have a cut off time for when they serve food. They should also make people pay for their food as soon as they order it, because not only were they going back n forth during the movie to give people food, but they went back and forth, AGAIN, to give people bills. I like that they have a no talking or texting policy, but having people waddling around the theater with food, overrides that. \n\nalso the bathrooms are disgusting. i had a full bladder and had a hard time finding a toilet that wasn't covered in mountains of toilet paper, or pee stains. i thought i was going to have to hold it for the next 2 hours :(", "author": "Lights S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-13", "description": "Great place to watch movies. It's best to get your tickets in advance. They can be bought online via the app. There are showings with the lights up and talking is welcome. There are showings the regular way with silence a must. They'll expel you if violate the silence rule. Choose carefully. The staff is friendly. The food is ordered and served to you at your seat. The seats are not the largest, but comfortable. The seats are paired two by two. A bit of a tight fit. Beware the price of food is expensive. We paid $10 for one root beer float. We will be back.", "author": "A.J. N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "Simply no other movie theater suffices these days! Fun vibes, fantastic food, and the AMAZING milkshakes (alcoholic, if you're feeling it) are just a few of the reasons Alamo is my preferred movie going experience. The fact that they can even make waiting for the movie to start a whole production unto itself just proves the length Alamo will go to in order to create a theater experience worth the trip. The ordering process is clear, concise and unobtrusive, yet they are able to settle your bill and get you read to be out the door just in time for the credits to roll. The menu is fantastic on its own and they always manage to have a themed menu for the blockbusters currently showing, which means there's always something new to try out! And, to top it all off, the drinks at their adjoining bar are incredible in both quality and quantity. All of this truly makes Alamo a one stop trip for a great night. !!", "author": "Lauren F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Best theater in Brooklyn. It is located inside a mall on the top floor. In the lobby there is a bar and a small area where they sell Mondo records. The theaters have comfortable seats with small tables where you are served items from a menu. They have an excellent projection system with superior sound. Great air conditioning. The best of all: a strict policy of no talking or texting during the movie! Violators get one warning and then get ejected. \n\nThe only issue with this theater is that everyone wants to go here and tickets get sold out all the time. If you are wanting to attend a new film, get them well in advance!", "author": "Lucien D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "I really wanted to try this place since the first time I saw a theater going up on the site of the old Albee Square Mall. We finally made it and it was a strange experience to say in the least. We arrived and checked in on her app picked up our tickets and selected our seats pretty easy right sure. Since we had time to kill, we proceeded to the the back of the main floor, where there is a bar filled with Oddities such as wax faces, creeping you out as you enter a 19th century sideshow, speakeasy filled with the usual Williamsburg crowd. We took a few photos and proceeded upstairs to the theaters. \nWhen we arrived at the entrance of our Auditorium, there was a putrid smell of old, hoppy beer mixed with Fritos. Not appealing. We were forced to wait outside of the auditorium while the area was clean from the last show. When I arrived at my seats the floor was wet and sticky under where I was supposed to be. The young lady who would be our waitress came and gave us the rundown of how the theater works. We were glad to know that late-comers are not admitted and phone users stalkers, etc will be ejected. We had visit to a similar theater in Texas. The seats are comfy and the table with the low light is convenient.\nThere is only one size of popcorn, a giant bowl that taste like your grandma made it with clarified butter if you so choose.  Most come for the Truffle popcorn but that is more of a home thing for me. They only have one size of soda for $6 (refillable and made with pure cane sugar which was much appreciated). I only ordered popcorn and a soda but the other food items looked great and pictures. The restroom was a disaster area and lacked paper products (byotp).  But with the total of popcorn and soda being over $15, having to deal with an odd smell that thankfully dissipated about an hour into the film, and the possibility of my feet being stuck to the floor, I have to rethink coming to this theater again.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "This is one of my favorite spots in downtown Brooklyn. Everything about the place, from the food/cocktails to the previews, is worth returning for. I will always choose the Alamo as my first choice movie theater!", "author": "Carly G."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}