{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "I freakin' love this concept of a dine-in movie theater, especially when the food is as solid and beer selection is as diverse as  it is at the Alamo Drafthouse!\n\nI've been here twice in the last 3 weeks, and had never been to a theater with this sort of set up. The experience watching Fate of the Furious and Guardians Vol. 2 was made even better with fresh beers from the tap (White IPA and a saison) and the combo of a lamb burger with sweet potato fries (amazing) and the steak sandwich (kinda dry and chewy, but the chimichurri sauce was good). \n\nI'm just really impressed they're able to pump out drinks and food as quickly as they do. If you're into fried pickles, the ones they have here are really freakin' good - coming from a pickle hater, I even enjoyed them. They're the long spear kind, which is usually more difficult for me to stomach, but the breading and the bitterness of the pickle had a really good balance. \n\nMy only complaint is the seats can get a bit uncomfortable during longer movies, as there's no recline whatsoever, and the seats are pretty upright. Honestly feels like the back is a perfect 90 degree angle to the seat :/ \n\nStaff are really patient and are kind enough to hustle by while crouched down - they must get a reallllllly good leg workout from running around doing half squats. The check comes out around the 30-45 min remaining mark of the film, so you should be good to go by the time the movie ends.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "Overall, fine.\nPros: You can select your seat when you order your ticket.\nThey have a full food and drink menu and have table service.\nCons: The food takes a long time to arrive. The two times that I went, I waited about 30 minutes for my food to arrive.\nThe ticket states to arrive 30 minutes prior to the movie starting. The thing is, they don't allow you into the theater that early so you end up standing around.", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "I am a fan of this place. It encourages me to see movies in a theater again. They have found a seamless way to integrate cocktails, socializing, food vs snacks, and entertainment without the lines. \n\nI had two lovely cocktails while we chatted before the movie in the wax bar and then we effortlessly took ourselves to our reserved seats where table service was provided throughout the movie. \n\nI thought I might get annoyed by staff heads during the movie but it wasn't an issue. It's definitely worth a visit.", "author": "Urszula P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Best movie theatre ever. Sometimes I come here early just to watch the previews. Also for people who get stuck with the first row, the seats are reclining so it's actually not bad! It's also the perfect place to get dinner and a movie at the same time.", "author": "Alaa A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "I have always loved the experience of Alamo, especially in Austin TX where it started. My experience at the Brooklyn location has not been great, we waited 45 minutes for our drinks (sodas) and got our food 20 minutes before even any water came out. When we went to the back to see if we could just pick up the sodas they told us \"there are a lot of people here\" so we got the message that we just weren't of much importance to them.", "author": "Bethany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "I won't go to any other movie theater in New York.  Their no-talking policy is the best part.  In recent years, I've noticed how awful movies can be in regards to people talking, being on their phones, etc. but that's why this place is perfect- one warning and then you're out.\n\nThe food is awesome too.  I love being able to do dinner AND a movie all at once.  The organic sodas are tasty (try the orange mango) and the chips and queso are necessary.", "author": "Sara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Best movie theatre to watch a movie. Great seats. Clean theatre. Good food. I may only watch movies at this theatre from here on out. Lovely experience.", "author": "Quecvas J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Had our first go for a 10:25am showing of Guardians of the Galaxy 2. We were very impressed. Ordered our tickets ahead of time, so there was a brief confusion on where to go. However, a guy told us to head to the theater. \n\nWe had the popcorn with butter, a black cherry soda, thai wings, and a Shiner Bock. Seats are comfortable, food was very good, and the \"required\" silence was great. Perhaps an update will be provided when we see a busier (evening) time, but this was a real win for movie-goers in my opinion.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Great movie theater. Good food and adult beverages. Nice comfortable seats and great wait staff service. Yesterday was my first time, and will attend again if they are showing a movie I want to see. Alamo at Night is great. It's an adult spot so leave the kids at home for an evening outing. Moms and Dads will have a great night out.", "author": "Brandi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "I really enjoyed my very first ever Alamo Drafthouse experience at this Brooklyn location. My friends and I purchased our tickets ahead of time quite easily and just met in the main lobby about 25 minutes before our show. We wanted to have time to get to understand how the in-theater dining worked before the moving started. \n\nOur server, Nathan, was very nice and brought us up to speed on how to order. I opted for the Wild Mushroom Flatbread (delicious), Buttered Popcorn, and a glass of Prosecco. The portions of the flatbread and popcorn were enormous, and my only wish was that I could have taken the leftover popcorn home! There was just so much of it, served fresh and warm in a steel metal bowl. \n\nThe movie theater was pristine and clean, the screens huge, and the seats comfortable. I really love their No Talking, No Texting policy. And I can't wait to go back!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Amazing experience that lived up to years of expectations. Went around noon on the first Saturday and it wasnt busy at all, despite the discounted food special and $11 tickets before 2pm. Seating begins a half hour before the show so there was no rush to get situated and use the restroom. The walls are covered in awesome posters and everything feels and smells brand new still. \n\nFriendly staff members went around and explained the way things work (if you've been to Nitehawk, Syndicated, or another Alamo location then you know the drill). I ordered a pilsner and the brisket burger w/fries and all three were great. The fries were perfectly crunchy, but the film was a pretty quiet one so I had to time my bites. Not a criticism, just a heads up if you order them. The downside of a quiet theater with food is that eating is amplified.  \n\nIf I had to nitpick, I would say that the seat I sat in (second row, seat 12, theater #5) is too close to the screen. The seats tilt slightly but don't recline, so I had to turn my head to see some things. There is a ton of legroom and personal space between seats, but you will have to sit forward a bit to reach your plate while eating.\n\nI'll be coming back to this place a lot, so I hope the service and space remain worthy of 5 stars as more people discover this gem.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Just wanted to say Alamo is way better in service than any other!!! It's my official go-to when seeing a movie", "author": "B M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Saw Tully tonight in theater 2 and sat in row 3- very comfortable seats and service was quick and efficient. I had the jerk chicken sandwich with sweet potato fries- both good but the fries were better than the sandwich. Splurged and had the chocolate chip cookie shake for desert- amazing. City Point is a great venue and plan to come back for another movie and a little shopping next time!", "author": "Kathryn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "I've always wanted to go to a dine-in theater for the experience but most of them aren't in New York City and without a car, they were kind of hard to get to. With the addition of the Nitehawk and iPic Theaters at Fulton Market - and the newly opened Alamo Drafthouse - they're more accessible than ever! \n \nThe Alamo Drafthouse is a popular dine-in theater in Austin, Texas and the newly opened theater in Downtown Brooklyn, or \"DoBro\" as they're trying to call it nowadays, is their NYC outpost. Since they opened about a month ago, they're still in the training stage so our food (sans alcohol) was 15% off. I thought this was a nice touch considering there seem to be a few kinks they have yet to work out. \n \nWe arrived at 12:15 for our 12:50 matinee showing - unfortunately the House of Wax bar wasn't open yet (I think they open at 4pm) so we got our seats and decided on which snacks to get. I highly recommend getting there a bit earlier and ordering your food earlier or else you'll end up getting it much later in the movie. \n \nWe were probably the 4th or 5th group to order our food and received our items about 30 minutes into the movie. The guys next to me got half his order 15 minutes into the movie and then the other half about 3/4ths into the movie. We opted to try their Thai Chicken Wings and their Baked Pretzel with Beer Cheese. Both were very tasty and were a good portion size. I think there were about 7 chicken wings to our order. The pretzels were warm and soft when they arrived, which I really appreciated. I hate cold and hard pretzels! \n \nThey ran out of shakes for the day because they ran out of the soft serve the night before. I guess with 7 theaters and a Saturday night, it's possible that their boozy shakes were super popular the night before. \nWe had no issues with our food orders and the waiters/waitresses were very nice. However, I do have to say I was a bit distracted every single time they ran back and forth in front of us. I think the Alamo in Austin has raised seats so their servers don't have to stoop over and run quickly in between the seats and squat on the floor in order to avoid blocking people's views. \n \nAll in all, I had a good experience. I'm not sure if I'll be back anytime soon though - it's actually kind of hard to eat some of the food items in the dark!", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-08", "description": "This is by far the worst movie theater I've encountered. There are just way too many rules to watch a common movie. If you're late you're not allowed in a movie that you paid your money for. They say it interrupts the movie but I don't see what the difference is between someone coming into the movie 10 mins late versus 6 waiters running back and fourth every 2 mins thru the aisles. Then there's the paper and pen you use to write down what you would like to order and you leave the paper in upright position for the waiters to see. My problem with that is its really dark so it took the waiter 40 mins to notice my card I almost forgot I was waiting to order something. I gave 1 star because what I ordered was good. This place is a no for me and the space is very cramped. First and last time. They couldve used that movie space to give century 21 another floor space.", "author": "Andrea J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "I like the concept of serving food/drinks at movie theaters. But I think the execution is hard and hence very few movie theaters do that. \n\nFor starters, if you order food or drinks, more drinks, desserts, think about how many times the staff would have to come to your \"table\" to deliver food/take away dirty plates etc. Granted they are very well trained and not really blocking the screen or making noise, but it's still pretty annoying to see how frequently the staff walk/run around during the movie. Secondly, I can't even just get some bottled water here. Because this is a \"full service\" movie theater, I had to write down on the card, two iced waters, and wait for our waitress to get back. Honestly the whole process took 15min, and all I needed was some damn water. Thirdly, to those who eat here, there's an amazing food hall downstairs! We stuffed our face in Katz's pastrami sandwich before coming up here to watch movie. I don't know how yummy the food is served here because we didn't order an, but judging by our neighbor's sandwich, it's definitely not Katz quality. \n\nWhat I do like about this movie theater: (1) they specifically say during preview that talking/texting etc. are not allowed and you'd be ejected on first offense. It's sad a movie theater has to announce that, but unfortunately sometimes it's necessary and more movie theaters should enforce that. (2) the pre-preview shows are kinda funny. It's not some mainstream first look on some movies or TV shows in the making. We were there for spiderman movie and they were showing funny parts of spiderman movies all around the world. You are right, people in Turkey have their own spiderman movie too! \n\nNot sure if I will come back, but definitely interesting movie theater and worth a visit to see for yourself.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "The Austin mainstay of alternative cinema here in New York. I was shatter d to find they were out of stock of Topo Chico during a recent screening but that is an anomaly and not the reason for the 1 star.\n\nThe fact is this would be a 4 star review except that Cinema 5 (one of their larger screens for features / blockbusters) smells like a college bar on the florabama shore at 6am the morning after dollar shots night. After 6 months it still smells like fresh vomit / puke (and achievement for such a large space). Management seem apathetic about the issue so we avoid features in this cinema (heading to IPIC across the river instead).\n\nTheir innovative and quirky pre-feature videos continue to be an event unto themselves and genuinely add to the movie experience. Particularly enjoyed the recent series of inexplicable international pop stars.", "author": "Stephen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "This is not your ordinary movie theater. Even though there are several spots that serve food now, there is still something special about the Alamo. Or maybe I am biased because I am so grateful for this import from Texas.\n\nTickets are $15. You choose your seat online and get your ticket in the email. No need to arrive early to get a good seat or stand in line to buy a ticket.\n\nThe food is legitimately good. The most important thing in this review: THEY SERVE QUESO. And it's good. I will pay $15 for any movie for the option to buy this sweet, sweet cheesey nectar.\n\nNice big leather chairs and big table for your food.\n\nCan't recommend it enough.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-25", "description": "Actually getting into this place to see a movie would be great --somehow they always seem to be sold out, or there's no late seating of any kind. \nIt's an awesome place, just deeply, deeply disappointing.", "author": "Amy Lynn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Alamo Drafthouse Cinema is a unique movie theatre. Guests are sitted in a sitting booth with a table. You write your order in a piece of paper on the table. You place the paper in front of your table, the servers, take it (without disturbing you) the bring you your food and drink. 45 minutes before the movie ends they bring you your check. Everything is done without you having to move. The price of the movies is reasonable. I attended a family party for the incredibles 2 movie. It was $16 per person on a Saturday morning 9:00am show. Regular movie tickets are around $16, a matinee is about $12. Not bad considering the setting of the theatre.", "author": "Denise S."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}