{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Absolutely phenomenal beer and cocktail selection at the bar. Ordered the chips \u0026 queso in the theater and it was done exceptionally well - to the point it spoiled a few other items on the menu I ordered.\n\nI'll be coming here for the amazing film-going experience, but the bar stands so strongly on its own that it deserves its own 5/5 stars.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "UPDATE:\nEverything here is great. Our previous issues were totally just creases that needed to be ironed out once they got up to speed. I've visited quite a few times since this first review and it's the only way I ever want to go to the movies from now on. I recommend the brisket burger, Thai chicken wings and fried pickles. \n\n____\n\nI was so excited for an Alamo Drafthouse to open in Brooklyn. The theaters, seats, sound quality are all top notch. \nWe've been twice since they've opened and they are working out major kinks still with the service. They tend to run out of tons of food and drink items, but the staff don't really bother to inform you if they've run out of something; they just don't bring it and then you have to chase someone down to follow up on it over 20min later. I don't know why they run out of so much, but at least tell the customer and offer them an alternative. And then bring it promptly!\nMy first visit here had major slow food delivery, my second visit seemed to have good timing on the food delivery but my beer took over half an hour to come out. They ran out of my first choice and didn't tell me, then dropped my replacement beer at the wrong table, which was another 20min to sort out. They took it away from the neighboring table, i had to ask about my beer again, then they brought the same beer to me that they'd served to someone else. I would have turned it away but I saw our neighbors didn't touch it. That's gross though. Pour a fresh one! I was happy to see that beer didn't show up on my bill, and thought they did the right thing and at least comped it. Then I learned that wasn't the case they billed it to the neighboring table who asked for it to be removed. I had already settled our check by that time so luckily, and rightly, I considered it comped.\n\nMost of the servers have good intentions and are trying, but they're really under trained. Other servers didn't even bother bending down when they crossed the screen, which was distracting. They were kind of slow to notice when order cards were propped up too. \n\nI'll continue going to the Drafthouse, but I really hope the service steps up, and whoever orders the food on the kitchen side figures out the proper quantities so they don't run out of so much.", "author": "Tanya W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-25", "description": "Could all orders and food deliveries occur before the movie starts? (ie during previews only) It's very annoying and distracting to have servers running around the theater throughout the movie. Alamo has no concept of what makes a great movie watching experience. If they had any appreciation for cinema they would set start times a touch early and make it known that all food and drink orders to your seat must occur during previews before the movie starts. Also take the credit card scan first! This way you don't have a server bringing you a check during the penultimate scene of the movie.  Once the credits roll then you can have the servers drop the checks.  It's very frustrating because Alamo presents themselves as cinephiles but they clearly lack the understanding of how to create an excellent movie watching experience.", "author": "Sam C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-18", "description": "Listen, when I heard of this place I got excited. I love Nitehawk and I wish I could have given this a higher rating, I understand this is a \"training\" period but my experience was unacceptable.\n\nFirst I actually had a lovely time at the wax bar, super chill and cool vibes and an excellent beer selection. I had a Bronx ale while waiting for my partner to come before seeing Dr. Strange.\n\nThen we went upstairs, again a positive on being able to reserve your seats. Our server came, gave us the low down and we looked at the menu before we got there so we knew exactly what we wanted. Our server said the tacos were unavailable...no worries we ordered our drinks and meals at 7:45pm with the movie starting at 8:05.\n\nBy 8:20 we still had not gotten our drinks. Finally one beer appeared but not mine, they just dumped the beer and peaced. About 10mins later our server came to say my beer (which was the bronx ale I ordered downstairs) was out (do you not have enough kegs at your theatre for a beer to be completely out that quick?) and left AGAIN without waiting to get my new beer in. I ordered on the sheet and did not receive that beer till about...9:20. Total time waiting just for my beer....over an hour and a half. \n\nLet's go to food now. At around 8:45 we were given salads we didnt even order which we refused and the server kept going around our section asking people if that was their order. WHAT THE EFF but sorry, I'm trying to watch a pretty great movie. This is over an hour since our order was placed and still no food. Finally around 9pm we got our food, soggy cold and really not great. We ate it solely because of how hungry we were. This was really ruining the movie for us. \n\nNow, fast forward to when they said checks would be distributed 20mins prior to the end of the movie. That didn't happen. We didnt get our check till halfway through the credits and it had the two salads and a glass of rose on our bill! we had to CHASE our server to have him correct it. Then we waited....and waited.....and waited. The credits were over and now we had to sit through the screen and speaker tests. I deal with speaker tests all the time for work but it was giving me a huge headache that night because....I SHOULD HAVE ALREADY PAID BY NOW AND GONE. \n\nWe were handed other checks with other cards a few times, a server said that the \"Kitchen seemed to ignore our section\" to us. Why would you even say that to a customer? There was only 4 of us waiting and waiting for our checks, finally we got our, had to wait longer for it to be processed and we left. The entire audience in the elevator complained how the service was beyond shitty and that we should have received at least 50% discount for what we went though. \n\nI wanted this to be a great place but I'll just stick to NiteHawk. At least the movie was good but the experience really ruined the night for us. I doubt we will be coming back until you actually \"train\" your staff before putting them on the floor. I expected that maybe our checks would be a little late, maybe food was a little late but not what I experienced.", "author": "Vickie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "I went there a couple of days ago and I'ma fan! The old school theatre vibe is super dope. I love that my wife and I went in early and they were playing old school movie trailers! I have to say that the food and drinks are a little pricey so I can't give it 5 stars but a great experience!", "author": "Richard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-07", "description": "The concept is great as is the wax bar. However the service was terrible in the theatre, but the food was good. The waitress delivered the cheque and it had a dish on it that we did not order. I asked her to take it off, she returned with a new bill that did not have the correct amount taken off.. Third time she got the cheque right!! By this time the movie was over and the theatre was being cleaned by the staff! We waited 15 minutes to eventually get the bill back with the correct amount ran on my card! We were waiting so long we experienced the sound and screen test!! Then I check my credit card bill today and I have been charged for the original incorrect amount!!! Very frustrating!!!\nNeedless to say my boyfriend will not be returning until Alamo draft house have sorted out their service, be it hire more staff, manage them or train them!", "author": "lucy w."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "I wanted so badly to love this place. \n\nThe Good: \nThe tickets aren't crazy expensive ($15 for a Saturday night). \nThe popcorn was AWESOME! And the portion is HUGE. \nThe other food was decent. \nThe seats are comfy. \nThe sound and video was was really good. \n\nThe Bad: \n4 of the stalls in the bathroom had no toilet paper. The other 4 were running low and there was no one around to find to ask to fill it. After the movie, the bathroom downstairs had 2 stalls without toilet paper and the one that did, one roll was just sitting on the holder.  \nThroughout the movie, the staff was coming in and out to get more orders and, even though they tried to be discrete, it was distracting.\nThey check comes 40 minutes before the end of the movie....DURING THE CLIMAX OF THE MOVIE. It was hugely distracting. \nAt the end, the staff was rushing everyone out of the movie. I asked one of them for a box for the popcorn I couldn't finish and she said, \"Well I'll bring you one, but it won't fit it all.\" So I said, \"Ok. So bring me two?\" She brought me one. I had to ask someone else to get me a second one. I'm also someone who stays through the the credits, but the same staffer said, \"There's nothing at the end. It's just the credits.\" I told her I was watching because I'm respecting everyone that works on the movie, and she rolled her eyes. Not professional at all. \nThey don't have Milk Duds. \n\nOverall, for a movie theater that claims it's a \"distraction free\" experience sure has a lot of distractions on part of their staff. I might try again in a few months when some of the kinks are worked out, but I'd probably just stick to popcorn and maybe a drink.", "author": "Kimmi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "This place is sort-of the worst, which is really funny since they're angling to be pretty special and upscale. I would have rated them lower but 1) it feels really clean to me (of course, they are brand new) and 2) it's not as if there were any egregious problems with the movie itself, meaning issues with the sound or picture. But here's the full run down of what you can expect.\n\nBEST CASE SCENARIO: you see a movie in a comfy chair (which can't recline, though, as others have noted) and in a theater that isn't too crowded, which is nice. You will have plenty of personal space, no one kicking the back of your chair, and your seat will be reserved so even if you come late, you can sit wherever you planned to. \n\nWORST CASE SCENARIO: you're going to try to order something, and it's going to be a fiasco. They're going to be out of whatever you ordered, they're going to bring you the wrong thing, they're going to not bring what you ordered at all, or they're going to bring it ridiculously late. (Think 30 minutes for a drink.) The servers obviously make an effort to be unobtrusive but there's no avoiding the fact that there are bodies moving all around the theater for the duration of the film, probably talking, too--either to you, your neighbors, or somebody a few rows down, but audible anyway. So, more activity and distractions than you would ordinarily have in a theater. \n\nI've been here three times total, and this most recent time was the worst. Right away, the server was really rude with my boyfriend and I and gave us a lecture about sitting in the right seats, without telling us we were in the wrong ones, or asking us to move. (The theater was not sold out and we were in the right row but one off from the seats we'd booked; the woman next to us piled her stuff up in the seat we'd reserved, so we sat one over without realizing it.) We told the guy we would be happy to move and it wasn't a big deal and he actually *escalated* his sh*tty tone like we were trying to assault him or something--it was crazy. All the while, insisting we just stay in our seats. Then he rudely (are you seeing a pattern here?) said they were out of what we'd ordered because it had been a busy weekend. lol, ok. Sorry for ordering food on a Monday, we didn't read the fine print saying that was off limits. \n\nI'm sure he worked all weekend, was burned out and pissed off with the entire species, and that sucks, but treating us badly didn't make him feel better and it basically ruined our experience before it even started. We weren't inclined to order at all anymore, even if we might have guessed something on the menu they actually had available, (we really didn't want to interact with the guy again) so we sat hungry through the whole movie. I thought about complaining afterwards but who wants to be that b*tch? I just take it to yelp instead, haha :-D\n\nIt's sort of a risk to go here. And I know they're new, but they're a chain, so you'd hope they'd have this all down to a science. I recommend giving it a few more months to improve or change ownership, and visiting someplace more reliable in the meantime.", "author": "Alicya P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "I saw La La Land last night at the Alamo Drafthouse. We were extremely disappointed with our service/food which was sad because we were \"splurging\" on a night out to celebrate a special occasion. 1) My fiance ordered a lamb burger....but it never came! How does that even happen?  I mean, the order is written down for you! 2) I ordered the Asian Salmon Salad and it was horrible. The salmon tasted like it was still frozen when they started cooking it...so it had a really tough texture like overdone tuna. Also, most of the \"salad\" was really a cup of wontons.  When ordering a salad, why would I want overdone fish and a ton of fried food? Not worth the $16 at all.", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-14", "description": "I've waited ten years for Alamo Drafthouse to get to NYC and by the time it does, it's ruined by the plague of dine in theaters, the worst thing to happen to movies since cell phones.\n\nThe draw of Alamo for me is the no talking/no cell phone policy, as well as the interesting programming they occasionally have. But now that it's become a dine in, your film experience is constantly interrupted. Lights under the table are constantly on (and brighter then the ones over at Nitehawk), and whenever someone places a shiny menu under the table you get a nice flash of light. People whisper to each other while looking at menus, they comment when their food arrives (especially since Alamo attempts to do some interesting looking food and drinks at times), they spend ten minutes shuffling in their bags when the bill comes, they pull out their cell phone flashlights when they can't find their wallets. No individual distraction goes on long enough to ask to have someone talked to but it all adds up to so much continual distraction that you're better off braving the texting masses.", "author": "Allison K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "I live in the area and finally gave Alamo Drafthouse a try. I was afraid that the wait staff coming around during the movie would be a distraction but it wasn't. I ordered a wine and my son ordered a burger. He said it was good but he's 14 so who knows. Lol I enjoyed the movie and I love all the old movie posters around the theatre. The seats in Theatre 5 were not as comfortable as I expected. However, I will be back.", "author": "Latoya D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "Seats are decent, but not great. The speakers were set to be too loud and the staff did not seem all too happy. Furthermore, there are draconian like rules quite heavily presented and constantly running around by the waitstaff, to the point of distracting. It's appreciated that there's no chance to hear small chatter because of the deafeningly loud amplifiers, but at the cost of ear drums, I might prefer hearing my neighbors passing judgement on a character, or my friends prediction, if need be. It's certainly a beautiful interior worth admiring, but with higher end prices, and a bittersweet setup, I might end up going back to normal theaters where I buy the popcorn and soda during the previews and make it work.", "author": "Serena G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Second time to the Alamo Drafthouse and it was better than the first - service was good, popcorn, beer selection, etc...... but most of all - if you go - you HAVE to get the cookies. They are to die for and if I could rate them I would say they are the best I've ever had in my life.", "author": "Amy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-19", "description": "Came here for a screening of a friend's film and loved it.  Nice to have the option for food and drink at your seats.  After the screening we stopped by the House of Wax bar downstairs and it was very macabre and spookily cool!", "author": "Bev P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-13", "description": "A lot of issues to work out. Group to my left received their food 10 minutes before the movie was over (and it was wrong). Group to my right never received their food at all. \nComputers went down, and no one could get their cards processed.\n\n20 minutes after the movie was finished, manager arrived and comped our meals and offered a free movie ticket. Will give it another go in the future, but will hold them to it.", "author": "Jarrod G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "I've always known of the Austin location and was excited when I heard one was opening here. Saw Wonder Woman. Had the best buffalo wings I've ever eaten...maybe it's an Austin carryover thing (very crispy, great-tasting sauce, large)? But...the standout is the draft house draft menu...if you want it, they got it. Even my beloved Catskill Brewery select is there. Brand new seats set up perfectly...you're not aware that there's a server around you just when you need them. Haven't had this good of a time since my visit to The Electric in Notting Hill.", "author": "M. C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-13", "description": "This theater has an unreasonable late show policy. Bought a ticket in advance online but arrived 15 mins after showing time. Was not allowed to join my friends in my preselected seat. The first time I heard about this policy  was at the theater; it wasn't on the receipt. Well, at least they refunded me.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "This is really the nicest movie theater I've ever been to in my life. The theater's layout is just so comfortable to sit it. Everyone keeps quiet while the movie is playing. The staff seems so passionate about what they do running a movie theater. Come check this place out for sure!", "author": "Mike G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-06", "description": "I was really looking forward to seeing a film here for date night with my lady. We wanted to check out the entire establishment before heading up to the theatre. We sat in their House of Wax Bar area. Long bar with an extensive selection of libations to choose from. The lighting was just right. I really thought the leather menu covers were pretty swanky. It was a little confusing at first choosing from the drink menu at first. But after a few minutes of pondering, I figured it out. The drinks were really good and strong but slightly overpriced for the amount that you get. When I first got my glass, I noticed there was still an old lipstick stain. I told the waitress and she immediately got it swapped out for a cleaner glass. \nThe restrooms and theater areas were relatively clean. There were several toilets that were left unflushed. Not sure if they just don't work or ppl are lazy. I love the fact that everything is automatic  in the restrooms at the sink area. I personally hate touching things in public restrooms so this was a plus! \nOnce in the theater we ordered our food which was an easy process. I ordered fried pickles and a cobb salad sans Avocado with extra dressing. There was waaaaaay too much egg and cheese and not enough lettuce. The fried pickles were just ok. I'm used to fried pickles being small slices but these were cut the long way. My partner had the brisket burger which was flavored well but messsssssyyyyy. Overall, it was a fun new experience. I will definitely return but maybe just go for the drinks and appetizers.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "Food is always terrible and over priced. I've been to syndicated in bushwick which is basically the same thing but better and cheaper and I've just got to say without fail the food at Alamo is always mediocre and over priced. Their staff for the most part has always given great service but damn guys... fix the food. I live across the street and always leave disappointed", "author": "Melissa R."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}