{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-12", "description": "It was a great Mother's Day outing. Amazing Bloody Mary cocktail. Unexpected, salted rim. I loved this twist\nDeviled eggs and Flatbread to snack on!\nI mean who orders Deviled eggs at 10.30am...", "author": "Maureen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "I love Alamo and their concept. The idea of an intimate move theatre works for me every time! And you can order your food, drinks and snacks as you're enjoying watching the movie. We've discovered this place since we moved to Brooklyn 5 months ago and my husband loves coming back and biking the front toe seats with the recliners. It's actually quite ok. Food is alright and their milk shakes yum! \nI've taken away one star for the overpriced gummy bears and popcorn that made me sick once because it's so buttery... but maybe I'm just not used to that. \nFlat breads are tasty though. \nAlso their movies selection is slightly more unconventional and they like to bring back the good old classics.", "author": "Marzena D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "I've only had lovely experiences here.\n\nAs many others have mentioned, the process of buying online tickets and redeeming them is very, very simple. As in, the last time I went and showed my phone screen to the friendly guys at the front desk, they glanced at it and told us we could head right into our theater where our server would check them again once we sat down. That's it.\n\nIt's great to not have to weigh the decision of waiting in line for snacks upon arrival and very easy to order anytime during a movie. Big fan of the fried pickles and milkshakes.\n\nWhat I like most about this theater, though, is that although it's located on an upper level of a recently developed/very modern shopping center, the design team clearly made a concerted effort to make the theater feel truly...lived in. In a good way. Like the difference between the feeling you get staying in a room in a boutique hotel or Airbnb versus a sterile, uniform corporate chain kind of situation. It just feels like it's been there for awhile and it's a charming effect. \n\nMoral of the story: very into this place.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-07", "description": "Conceptual it's such a great idea. The idea of eating and having alcohol beverages from a restaurant menu than buying overpriced snack food is a phenomenal idea. Our waiter was great he explained how it worked. You simply write your order on the sheet of paper and place it standing on your table. There's a tiny light under you table to see.  \n\nPositive: The food was very good. Shockingly good. Not like a movie theater good but restaurant quality good. Waiter was great guy.\n\nNegative: The wait staff walking around giving bills. I don't understand the arriving 30-45 minutes early rule- it makes the process extremely strenuous. On top of that wait, they showed very awkward previews. Lastly the floors were very sticky.", "author": "Johnny G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "I can't believe it took me so long to review this Alamo. I've been an Alamo Drafthouse fan since I first discovered this wonderful gem in another state. When one opened up in Brooklyn I thought it too good to be true. \n\nI love everything that Alamo Drafthouse stands for.  No talking, no unaccompanied children, no cell phones, no disruptive people. Also there's a full menu of food and drinks. What more could you ask for from a movie theater? \n\nThe food is always good (but don't come here expecting 4-star cuisine, that's not the point), the seats are comfy, and every seat in the theater has a good view. Unlike other theaters that try to cram tiny seats in every available nook and cranny, the Alamo sets the screen far enough back that even the front row has a pretty good view.\n\nThank you for coming to Brooklyn, Alamo. Please never leave.", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "I pretty much live right above/next to it at City Tower. (Bragging rights LOL) Great experience every time I'm there. No need to show up early if you buy tickets online. Seats are okay, they don't recline. Surprisingly food is pretty delicious. Prices are as expected. The staff are pleasant. The process is seamless and the entire concept seems to translate well.", "author": "Pam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-17", "description": "I was eager to check out this dine in theater after hearing about it for a while now! It's upstairs in a shopping center so if you need to wait for a film you can check out target, etc. before or after while you're there. My friend and I decided to hang out at the bar inside the venue. They have a happy hour every day which is great! And you can even take your drinks with you into the theater. They have some crazy wax figures, some of which are pretty graphic!\n\nThe theater has assigned seating so make sure to book in advance or get there early to get a good seat. Even the last row still has a good view since it's really not that far back. The seats are very comfy and there are small tables between each set of seats where you can look at the menu and place orders. The staff come by and pick up your written order and then bring it out to you during the film. You can keep ordering during the movie as well. I found the prices a bit high but sharing something is a great deal. We went with the grilled cheese that comes with fries and it was good! Pretty decent portions.\n\nI would definitely come back here since it's very easy to get to. Right off the Q train at Dekalb.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Disclaimer: I'm judging this based on a private viewing where we rented out a theatre for our large group for a school event (~35).\n\nBefore this visit, I didn't realise I had actually been here before, on a random day when my partner and I were just avoiding the cold of downtown brooklyn 2 years ago. Flashforward to now with a school group, I was preparing for the worst - sticky chairs/armrests, shoes sticking to the floors, bed bugs in the seats, the smell of farts in the air. To my surprise, none of the above.\n\nWe went to guest services and the manager who was taking care of us came down shortly - he was extremely professional, courteous, and patient with 30 teenage children who were all itching for different things.\n\nOur package came with unlimited fountain soda and pizza. I was imagining a stale slice of Costco Kirland off-brand frozen pizza microwaved, but we were actually served individual flatbreads each. I was THOROUGHLY impressed with this, though looking at the menu I was a bit taken aback by the prices - $10 for popcorn, $12 for pizza, etc. While I do expect the concession stand to be exorbitantly priced, these were incredibly inflated. However, we were given a headsup from the manager that should our children decide to buy anything, we needed to be wary because of \"hidden surchages\" - tax, and an automatic 20% gratuity fee for services garnered in our private viewing theatre. I appreciated the full transparency from their staff, and it made me really trust them.\n\nThe experience overall? Impeccable. I'd definitely come back here with another group again, and am interested in coming with friends/partner. The only thing that worried me a bit was that after one student got a wrong drink order, it took them about an hour to get the correct one in...Also, the \"unlimited fountain soda\" was a bit of a disclaimer because after the initial taking of orders, no one ever came back in - understandable, to give us privacy upon viewing, but they were no easily reachable outside the theater either.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "I LOVE this! I wish they had this upstate. A movie theater with table service! You can order food and drinks, the alcohol kind, and enjoy a movie while enjoying your lunch. The food was good. I ordered the popcorn with clarified butter. It was a nice sized bowl too so I shared some. I don't normally share my popcorn either. \n\nI also ordered the blackened chicken Cesar salad. Nice sized bowl chock full of Ceaser salad ingredients and chicken. Paired with a nice cold Pilsner (all local beers on the menu!), it was perfect. \n\nThe service was quick, accurate and impressive! You fill out a card and pop it in a slot and they come by and take it and bam! Your food appears within 10 minutes.\n\nI'm sure we in upstate will catch on to this fun way of going to the movies!! Hurry up already.", "author": "Tracey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "I still love Alamo Drafthouse and still love going for the 'no quiet zone' aspect during movies, but there's been a slight decline from its opening. The food especially has gone slightly downhill. The flatbreads are still good choices, but even those have been inconsistent with each following visit. The jerk chicken sandwich is a huge no on the list. I recommend avoiding; it was an extremely dry, bland chicken. I actually just had a few bites and had to stop. The lamb burger used to be great, but as of recent, it's also been lacking some flavor. As for service, the few things I must note is that the servers don't really duck while going between aisles during the movie. Other times, they've read out the food order loud enough for me two aisles ahead. It's those little annoying things, but this is what is supposed to make Alamo great next to other movie theatres. I will still always support them for being a unique theatre next to most, but the food and service has been on a slack.", "author": "Sara L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-28", "description": "It's an interesting idea but doesn't translate to an enjoyable experience. To make room for tables the seats are squished. The waiters have to constantly walk in front of you which is very distracting.  Not being able to see makes eating some of the dishes more like stab your fork in the darkness and see what you hit.  The food tasted ok, but later on my stomach was very unhappy.  Also of course it's super overpriced for what you are getting.  But I suppose that's all movie theaters these days.  Overall I would go for a regular theater, especially the ones with reclining seats.  Or BAM to see the artsy stuff.", "author": "Emma J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "An absolutely awesome experience.  The student price is only 10 dollars and the service is quick and efficient without disrupting the your watching of the movie.  Definitely pricey but food quality is high.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Food is amazing! Kind of on the pricey side but super fresh. Great customer service! My only complaint is that the chairs are a bit uncomfortable.", "author": "Emanie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-07", "description": "Great spot to watch a movie but the staff always seems super aggressive towards black and brown people for no reason, which I have witnessed on several occasions. Yesterday was another example of that aggression towards a black family who were late to a movie and a staff member wanted to immediately escalate the situation and threatened to call security-- again for no real reason.\n\nI think it would  be wise for management to better train their staff not to assess threats based on people's skin color or do a better job  at hiring the right people. Either way, this type of thinking and attitude needs to change fast.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Went here for their Clueless movie event on September 12,2018. This was my first time ever going to an Alamo theatre. \nLocation: This is right inside of the complex where Dekalb Market, Trader Joe's and Target is located. The venue has a bar that looked super lively that you can go chill in and not need a movie ticket for. It also has a set of nice restrooms right there on that main level. The theaters are up the escalators in the lobby area that a part of their gift shop. There are also larger bathrooms up the escalator.\n\nProtocol: Once you get in the theatre you can find your seat and sit. I found their numbering system a bit confusing so I asked an usher/waitress who checked my phone and instructed us on where to go. If you know how to find your seat alone when  the waitstaff comes to you they will verify you have a ticket and then take your order. \n\nMenu: Fully extensive you can skip eating before you get here because you can have a seriously filling meal here. All we got here fries which were tasty.They also serve alcohol so you can get your drink on! The drink list is extensive as well. \n\nMovie experience: The seats are very comfy and there doesn't seem to be a bad seat in the house... unless you're in the very front. I was in the last row seats 3\u00264 and we saw perfectly. It's stadium seating so no ones head was in my way! If you get cold easily bring a sweater or something because they spare no expense with the ac... maybe it's to keep the people who are boozing it up comfy. \n\nFYI: After the previews, the screen announces that from that moment on it's a quiet theatre and anyone who is talking will be made to leave with no refund. No texting, no talking, no laughing or heavy breathing- okay I made up the last two! They also state if there is a loud table near you notify the staff aka snitching is now acceptable behavior in Brooklyn! This was a highlight of my experience because I hate talkers, texters and commentators at the movies. I'm happy to report that no one violated the rule and no ones phone went off during the movie! HURRAH!\n\nOverall: I would definitely come back here for another movie in the future, but not too often since their prices are steep!", "author": "Kia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-03", "description": "Last Tuesday I visited the Alamo in downtown Brooklyn to watch The Matrix. A limited release theatre run on the films 20th anniversary. I was super excited, it's one of my all time favorite movies that I didn't get to see theaters when it first came out. Even after 20 years the cgi still holds up!\n\nNow the terms of the theater, it was cool. The first thing that stood out was that they sold vinyl for movies \u0026 tv shows in the main lobby. They also carried t-shirts and other merchandise. There's a lounge with a full bar that you can hang out in before or after the movie. This is a good place to bring some friends or a date. Have dinner \u0026 movie at once \u0026 then have a few drinks after. \n\nSide note; it's Brooklyn, parking is kind of a hassle. The theater is located on the fourth floor of the shopping center.", "author": "Cory T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "I'm sure the movie theater experience is pretty good with all the four star reviews I am reading about. But we showed up for a screening and as the advertisement for the screening said to be one hour early. Exactly what we did. We stood on line with a bunch of other folks and waited an hour before the line started moving. Pretty much about two dozen people at the end of the line was given t-shirts and turned away because the movie we came for is full to capacity. Yup, my group was one of them. And they ran out of t-shirts. LOL. Terrible.\n\nSo, the solution was we put our names on a list and contact info on a sign up sheet for the next screening. It's been several days now and no follow-up. Customer Service seems nice but that doesn't provide a solution.\n\nAnyway, we did check out the theater a little even though we did not catch a showing and it seems like any other movie theater. It is a small theater with leather seats and each Screen has an attendant. It also has elevators and and escalators.\n\nThe lobby has a couple of electronic kiosk to buy tickets and you can buy tickets with seating selections online.\n\nI would consider returning to the Alamo Drafthouse. But for my recent experience it wasn't a let down at all but not good.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-02", "description": "First off, awesome experience, I found free parking a block away (wednesday night) and the House of Wax bar and novelty clothing etc sold when you first walk in, totally cool. \n\nGet there early, 20 minutes at least, restroom (huge ladies room and smells great, super clean.)\nPeruse the menu - something like 20 beers, sandwiches salads flatbread noshes\n...free refills on soda ... Large glasses of water...gosh I had to pee so bad but I hate missing any minutes of a movie !\nGreat service. \nMovie was 2 hours, I started to get uncomfortable in the seating after about an hour 15. I've gotten spoiled with the reclining sofa seats in Westbury.\n:/", "author": "AnnMarie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This review is for vegetarian and vegan people! Alamo drafthouse has reasonably priced and tasty food for a movie theater. They also have a separate vegan menu and non junk food options such as kale salads and tofu quinoa bowls! The popcorn was somehow the worst of the options see below for breakdown:\n\nTruffle parmesan popcorn: unfortunately the popcorn was semi stale and I was not a fan of tons of powder on my popcorn.\n\nPrezels with queso: Awesome and flavorful queso.\n\nSouthwestern Tofu quinoa bowl: tofu was well seasoned and tasty! The top of the bowl was flavorful but the quinoa itself was bland. Could have used a bit more seasoning and veggies.\n\nGrilled vegetable sandwich: Best item of thr bunch was surprised at how fresh bread and veggies were and how great it tasted. Highly recommend.", "author": "Sind P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-17", "description": "Actually this theater is pretty cool. Have tables attach to seats and server to take order. They have a lot of options on the menu from snacks to entrees to various cocktails. There are even reading lights under the table to help you to read menu in the dark environment. There are also many old movie posters in the hallway. Very interesting experience.", "author": "Qingyang X."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}