{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "If you're coming for the food, don't bother. I arrived early for a 8:50 movie, put my food and drink order in at 8:30, and received no food or drink for the entire movie. When I asked why, the waiter shrugged and said that they ran out. (Why my bottle of cider never came is beyond me.). Theater is lovely but they need to get their act together. My advice, eat at home or wait a few months. They are not ready for prime time.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "Love this place. Everyone stop whining. You get to sit in cushy chairs while good food gets delivered to your lazy ass. And, they have firm rules about talking and texting: bye bye!", "author": "L I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "The Alamo Brooklyn is horrendous Nov 2016.  No food on a Sat at 9:30pm.  Took the waitress 3 trips to keep telling us No Sandwiches, No Burgers, No Flatbread, No Salads.  No water brought for 30 minutes; Thai Wings delivered but raw and cold.  Everyone is complaining and asking refunds when leaving theater.  Go to Nighthawk instead.", "author": "Gregory G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-03", "description": "EAT BEFORE YOU GO OR BRING A KIND BAR! The screens and sound quality are top-notch, but both times I went, the waitstaff screwed up my order. They disappear to the other theaters, so you can't complain to anyone, lest you miss the action on the screen. Great concept, though! Roll the dice and good luck!", "author": "Bill L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-01", "description": "Needs a lot of improvement. Will update my review when I see them. We've been here for multiple flicks. The food options are definitely a step above typical movie theater fare, but the service has been inconsistent - ranging from attentive to getting our order wrong and not being able to flag down a server for nearly 25 minutes. Restrooms on both levels have been clogged and out of service because of faulty sensors on these occasions.", "author": "Vesper L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "greatttttttttttttttt !! 10 stars to rachel !! great food great drinks great chairs the movie just everything amazinggggggggg ray ray is the best", "author": "Bonnie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-17", "description": "This place is definitely hit and miss. My first experience went off without a hitch. I got my food and drinks on time and the staff was attentive. Second time around, I ordered my food a half hour BEFORE the movie started. An hour into the movie I got nothing. Couldn't find my waiter either. What rubbed salt into the wound was the fact that a party of three showed up AFTER me and my boyfriend, and they got their food BEFORE us!!! And I'm fairly certain that my dish was the same as at least one of them. We were offered free beers, but we had to find food after because I was starving. Disappointed!!!! Needless to say, there was no tip.", "author": "tanichea b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "Really enjoyed watching movies here with friends. Location is easily accessible, the train station is right outside. They are in the same building as Century 21 and Target. You can order drinks and the food is upscale bar food. The only downside is that the food is on the pricey side. Otherwise it was nice getting table service during the movie.", "author": "L Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-07", "description": "This place could be amazing, but they failed. Two stars for the comfy seat and excellent service, but the food is terrible. The menu here is very limited. It does not have as many options as the Alamo Drafthouse in Yonkers. My tacos were cold and tasted terrible. They do not have a good drink menu. I hope they update their menu but until then I will not be returning.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "I go here every chance I get. I like movies a lot. Like, I've seen Citizen Kane. But prior to Alamo, I hardly ever made it to the theater because I have social anxiety and showing up and getting a seat is more than I can handle. Reserved seats in advance has been a game changer for me. Couple that with food brought to your seat and a nice beer selection and I'm all in. The campy horror vibe in the hallways is also great, though the Wax Bar is more than I can handle. The ropa vieja tacos are a staple and a better bet than the flatbreads, or at least the meat lover's one, which is the only one I've had. The boozy milkshakes are tasty, but rich to the point where if you try to get drunk on them you will barf. Or so I'm told.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "I am an evangelist for this theater! I talk about how much I love it to all my friends on facebook and in real life all the time! There's so much to like, I don't know where to begin. I love the strict no-talking and no-coming-late policies. I love that clips before the movies are particularly bespoked to match the likely interests of the audience of a particular movie being watched. I love the affordable but delicious chicken caesar salad. I love that they stuck it to the online trolls and added an all-women Wonder Woman showing benefiting Planned Parenthood. I love that the staff is friendly yet unobtrusive. I love the comfortable chairs. I love that they have Terror Tuesdays, Cherry Bomb, and similar series showcasing interesting older movies. I love that the two times where they did have issues (one pertaining to the building's gas being turned off, which was not even their fault, and the other pertaining to a theater's sound being turned too low due to previous complaints that it was too high), the customers' concerns were relayed to the appropriate people and we were given Rain Checks for the trouble. I used to live in Japan where customer service and curated experiences are famously exemplary, but both the software and hardware of this theater's service is as good as if not better than my best memories there.", "author": "Mark P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "Went there to see \"Get Out\" and arrived 7 minutes late. The thuggy looking guy told us \"they all booked up\". We said yeah but we have tickets so he points us to the register. The hipster doofus there tells us they don't let anyone in even 30 seconds after the start time and tells us it's on the website. I didn't see that and I was just on the website. He then says the disclaimer shows up when you go to buy tickets. Stupidly asks my friend, do you want a refund? Duh! Still didn't see it when I did a test run to buy tickets. So who knows? Maybe hipster boy was just having a power trip. I doubt I'll ever bother to go there again. Not worth the trouble getting there.", "author": "Marcy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "I love movies. I love food. So why didn't the Alamo get a higher rating!? Because the menu is limited! If I go to a dine in movie theater I expect more options than a burger and wings. So many other dishes in the world of finger foods. I came hungry and I left hungry. I will admit, the hot wings were tasty! They just need more variety. The seats were comfy. Only the first row reclines, so be aware.", "author": "D B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-18", "description": "I went to see a movie here last night with my husband. The choice of movies, seat selection, staff - all terrific. We ordered one beer and a Diet Coke, a flatbread and jerk chicken sandwich. Upon reading our selections our server told us they had no Diet Coke and not the beer my husband chose.  No Diet Coke at a movie theater? Has never happened to me before. My husband let them select a similar beer because now the lights were out and the list of choices was long and of course no guarantee that something else he chose would not be available. Unfortunately he was not too happy with their selection which he had to ask for again as it took awhile to receive.  His food and my food did not come at the same time.   Obviously there are still kinks to work out.", "author": "rachel m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "I used to go to Alamo all the time in my hometown and was super bummed that there wasn't one in NYC! Until suddenly I heard about a wax museum and bar when looking up the location and where this museum was I found that there was indeed an Alamo draft house in Brooklyn! Had a great time when I visited! Will never be let down by the experience of Alamo!", "author": "Cheyenne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "Came back and they seemed to have largely worked out their kinks. Food and drinks arrived much quicker than last time, although the guacamole was still under seasoned. I'm impressed that they've been able to turn it around so quickly and have high hopes for this place in the future.", "author": "Wade C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "To me this was like multitasking your entertainment. I couldn't enjoy the movie or the food. I have low blood sugar and always bring a snack to keep it stable. Well I went to the bathroom and when I came back they confiscated my snack and wouldn't bring it back. This made me have to order their food, which did not go smoothly at all. I couldn't concentrate on the movie because I was so hungry and food took a long time to come. When it finally arrived, it was difficult to eat in the dark and see anything. I feel like I missed the whole movie. Also, I ordered the grilled veggie sandwich which was terrible. I don't recommend for anyone that likes to focus on a movie and enjoy a meal. These activities are better done separately. The manager told me he would give me back my snack and never did. This place was awful.", "author": "Suzanne G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-31", "description": "I'm hoping they were just having an off night. The theater itself was great: clean, spacious and comfy seats, etc. But the service was just so, so bad. When we got there, our server brought us water while we read the menu, told us to write our orders on the card, stand the card upright... and then we never saw our server again. After like 30 minutes, my friend actually left the theater to find someone to come take our order. We each ordered a drink and a meal. Our drinks came out soon-ish, but it took probably another 30 minutes for the food. And that was just for my friend's order. My burger never came. When our check came and my burger was still on the bill, we flagged it to our server. She quickly came back with the fixed bill and two Rain Check tickets as an apology. At the end of the movie, based on the chatter amongst the rest of the audience, it sounded like nearly everyone had a similar issue. I'm hoping they work out the kinks soon!", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "The theaters are pretty small and there's a lot of space between the rows to accommodate the tables and the servers, so there's no bad seats.  The food was good, a little pricey for what it was but you get to eat while you watch a movie.  I'm a big fan of the no latecomers/no talking/no cellphone policy.  I also like the reserved seating.  We had a great time, we'll go back.", "author": "Matt P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "We went to Alamo the week it opened and the service was not up to snuff. Food took forever to get to our seats. My husband \u0026 I were kinda disappointed coz this place is literally 5 mins from our apt  \u0026 so convenient in the winter months when everything sucks. But since then they've really upped their game. IMO they outdid themselves today. There was a power surge at city point 15 mins before our show \u0026 everything shut down, including the Alamo screens. Despite waiting for 20 mins, the show didn't start. This wasn't alamo's fault, they were waiting on the fire dept to fix some tech issues. Meanwhile, they took care of the drinks \u0026 food we'd ordered waiting for the movie, gave us refunds for our tickets coz looked like it'd take a while to get things up and running. They also Gave us two more complimentary show vouchers \u0026 $10 food/beverage coupons for future visits. And while doing this, each employee there must've apologized for the inconvenience 4X.. This is like, outstanding service, trying to compensate customers for what wasn't even their problem. I'm impressed. Needless to say, we'll keep going back.", "author": "Archana R."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}