{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "I've been to Alamo Draft House twice now since it opened last year. My experiences have been quite positive and I think it's a great option for Brooklyn movie theaters as far as I'm concerned. \n\nYou can easily purchase tickets for your movie online via the Alamo Draft House website or Fandango. One time I purchased a ticket online and picked up an actual ticket at the counter I believe. On my second visit I had a digital ticket so entry to the theater was a breeze. \n\nUpon getting into the theater you find your assigned seat and a server comes by to explain how ordering works. First of all, I think it's awesome to have assigned seats. This way you don't have to fumble around looking for a seat. Second of all, ordering is super easy. The food and drinks come out quickly and it make such an awesome addition to your movie viewing experience. \nI've had the ice cream, chips \u0026 queso, and flatbread from Alamo. All were very tasty. My boyfriend and I can't wait to go back for the flatbread; it was just that good. \n\nWe will definitely be back( hopefully within the next 2 weeks to see Beauty and the Beast). And I'd definitely recommend this theater to others as it's clean, comfortable, and you can eat and drink while you watch!", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Fave movie theater!!!!  I heart everyone who works here!!!!  They treat you like family!!!  Awesome customer service and comfy seats!!!!  I love it here!!!!  Although I have to say that I wish they had a larger selection of  movies but that is by far the worst of the worst thing I can say about them if someone twisted my arm and I just haaaaad to because my review was too short to put up and I had no choice but to add more words.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-12", "description": "While this theater is excellent for showing films, and employs a brilliant concept of serving full sit-down meals at reserved seats with tables in front of them, the food has proven, at least on today's occasion, to be woefully subpar. I would venture to say gross. \n\nI had a salmon salad, and the fish had that \"old fish\" sort of taste, as if they were struggling to get it to the table at the eleventh hour before it expired. \n\nIn the same vein, the clarified butter used on the popcorn had a sour dairy taste to it. \n\nIt was really a disappointing and stomach-turning meal that ruined what would likely have been a wonderful experience at the movies. The unfortunate thing about this is that in such an environment, one doesn't feel like it's possible to send anything back because you can't speak while the movie is on or you'd disturb everyone around you. \n\nSo my overall impression is that it's a solid theater, but the calling card of the business - the food you're supposed to enjoy while watching - really failed badly. Perhaps a simple burger would have been a better choice; much more difficult to mess up.", "author": "Eddie I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "It's annoying how much I love this place. My movie theater experience will never be the same. Ha! \nIt's perfect for dates, self-dates, family, you name it and you'll love it. With that being said be prepared for prices to match in terms of food etc. I will say that it's worth every penny. \nThings I love: \nCell phone use under any circumstance is not allowed in the theater space, nothing more annoying than seeing a phone screen in the middle of a movie.\nThe why that staff come by. If you want something you put your card up and they recommend you pay about 40 mins before movies end, which makes for a quick exit.\nI don't have any cons to be honest. Thank for such a great experience Alamo!", "author": "Chantalle U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "After hearing my Texas native friends brag on and on about the amazingness of Alamo Drafthouse, I finally got to see for myself, and guess what! I didn't even have to leave Brooklyn for it, because when you live in NYC, EVERYTHING comes to YOU. (Suck it Texans!)\n\nOf course I had to go here for Beauty and the Beast, because you don't go just anywhere to experience a tale as old as time. Bought tickets online. I was a little worried about logistics and knowing they enforce a late policy, but it turned out to be a non-issue because guess what? No lines!\n\nAfter riding an endless number of escalators to the top floor (still faster than waiting for the elevator), you just go straight to your theater and get yourself seated. A server will check your ticket when taking your order. How cool is that?\n\nI had come from a rather huge brunch so I wasn't feeling very hungry, so I decided to go lighter on my order. So I ordered an ice cream float, the edamame hummus with wonton chips, and a bowl of truffle parmesan popcorn. Yup, nice and light. Nothing about the food was impressive, except maybe the portion sizes, but it was all good and way better than anything you'll find it a regular movie theater. Popcorn was my favorite. No complaints.\n\nI'm impressed mainly by how well they have their system down. The servers manage to take orders, check on patrons, deliver food, and bring out checks all with a minimum of interruption. An extremely enjoyable viewing experience and I look forward to going back!", "author": "Steph C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "I remember telling myself that I would never go into this place called City Point Brooklyn place. My childhood was ripped away from me when they tore down Albee Square Mall... I understand that times and places change, but you have to admit the face of Brooklyn sure looks different if you were born and raised here. \n\nOkay okay okay, I know you're wondering why I went since I said I would never ever go. Well I'm going to blame my friend for it...LOL! We wanted to see an early showing of Kong and pick out our own seats. We could've went into the city but no shows were available. When he said it's playing at the Alamo I immediately turned up my nose and said NOPE. He looked at me like whatever and proceeded to buy the tickets. \n\nWhen we got there I didn't want to like it but I betrayed myself and fell in extreme like. It was pretty swanky I have to admit. We picked seats in the back... i love that you can choose your seat beforehand. I am that person that shows up 2 hrs early to ensure I have the seat I want... now I can get my 2 hrs back. What made the deal even nicer was the fried pickles...lol! While you can get a nice cocktail or a giant soda I was impressed with the fried pickles...lol ... they're one of my favorite things. There were other seemingly yummy things on the menu but I was preoccupied with you know what. The staff was great and definitely moving about as quiet as can be. \n\nSo basically I drank the gentrified kool-aid...lol. While I miss what Brooklyn use to look like, I have to keep this spot in my mental rolodex.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "This place is amazing! Talk about a dinner and a movie.\n\nI came here with my husband to watch Wonder Woman on a friday afternoon and we were both pleasantly surprised by how clean and how efficient this place is. Conveniently located right off the Dekalb station, it's actually inside City Point, up on the 4th floor.\n\nI think the coolest thing is being able to pick your seats when you purchase your tickets online. Gone are the days of showing up an hour early just to wait in line to rush in and grab seats or throw your jacket, hat and purse to hold seats for your friends while they go to the concession stand for sub par theatre food. \n\nThis is a FULL service place so all you do is look at the menu (like a restaurant) and just write down what you want to order and the server will ninja in and out to get your order, place your order and get your order back to you. They have a big menu filled with goodies, snacks, sandwiches, salads, burgers, shakes, soda and alcohol! (Wow, wonder if anyone has gotten so hammered while watching a movie) My husband got the steak tacos (4 per order) and I got the brisket burger that comes with fries. Plus their fountain sodas comes with free refills.\n\nOh and I have no pictures to show you because they have a very strict NO PHONE USE once the movie starts. They catch you once, you get a warning. 2nd time, you will get ejected without a refund. YESSSSSS!!!! No more annoying random glows or ring tones ruining a movie moment. I will never forget watching a sad serious moment just to have \"Baby got back\" ringing in the background. Mood killer...", "author": "Janet Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-20", "description": "ive been here several times with friends and had fun experiences(albeit soooo overpriced). That being said the food is just ok-it's more a novelty than a good dinner. i'd suggest\nonly getting cocktails and eating at dekalb market downstairs for realllyyyy good new york food. \n\nhowever what turns me off is their weird dystopian management system where angry guys with headsets literally will chase you down if you're 5 minutes late. Which in NYC they say they give 10 minutes but they do not, they kind of powertrip on that. I guess if your job is upscale theater vigilante-you do get some thrill out of the little power you're given. \n\nThe \"code of conduct\" honestly seems like a weird dystopian future that causes more disruption than good. it's wayyy more disruptive to kick people out for texting or talking than just let that person sit and not do their weird ducking thing and then being more interrupting. Code of Conduct or Dystopian Nightmare i guess it depends if you're Susie Homemaker or a New Yorker. Susie Homemaker codes don't belong in this city. Wise up or move on to the suburbs.", "author": "Helayne K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "The best eat-in movie theater I've visited\n\nThe atmosphere is vintage 60s, the hallways and decorations are beautiful.\n\nThe food is delicious. I usually order the burger or steak sandwich. Their shakes are great.\n\nThe waitstaff is lightning fast and I not interrupt the film viewing experience.\n\nBefore every film instead of showing sponsor ads they spend time showing related content to the film you're going to see which is usually informative and very interesting.", "author": "Arthur W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "I went there on a date 2 years ago. Tacos were the best tacos I ever ate,I ended up eating 8 tacos pieces lol the entire idea of eating in the move theater is great,it is an unforgettable experience,very comfy and makes you feel at home. I wanna go back there one day for those tacos lol", "author": "Dilyara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Have been to this Alamo location a few times recently and I love it! It's conveniently located, clean, and the staff is extremely friendly. The theaters range in sizes. We always order the popcorn with truffle butter (Rus loves it), the pretzels (I love the cheese dip that comes with them), and the strawberry milkshake. All of these things are delicious. We've also tried the flatbread (very good), the hot dog (meh, it's okay), the fried pickles (really good), and the wings (good). Skip the mocktails.\n\nAlamo shows new movies and old, so check the website to see what they're playing. I find the chairs big and comfortable. There are bathrooms on both floors.\n\nThe service seems to have improved since they first opened, and Rus and I haven't encountered many problems with the service. We're also becoming fans of the bar downstairs. Their beer list is huge! The space also seems perfect for music acts. Pro tip: If you have leftover popcorn, bring it down to the bar and hang out for another drink or two.", "author": "Carol B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "This is probably my favorite movie theater experience so far.\n        Yesterday I watched Mission Impossible Fallout and thoroughly enjoyed the movie, service and food.\n        This my third time going to this year. The staff are friendly and theater has a nice, vintage feel to it. I was in theater #2 and it holds about 40 moviegoers  with comfortable seats grouped in two sharing a small table. I loved the feel of the theater, it feels like I in my own  personal home theater or  a celebrity's house with some other guests.The menu has a great variety of entrees, snacks drinks and sandwiches. I had ricotta cheese meatballs served hot in a small cast iron skillet, with toasted bread it was delicious. I really enjoy this movie/dining experience. I believe for some moviegoers the food menu might be a little pricey.  The total movie experience at Alamo,  I believe its worth it.\n         I would certainly recommend.", "author": "Martin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "One of my favorite theaters especially having MoviePass. They've got some great food selections in their menu. Their flavored popcorn and fried pickles are a must. One thing I wish they could have installed was better leather chairs. They do not recline and are very stiff except for the first row since those seats are too close to the screen so they let customers recline in that case. Would be a perfect 5 stars if they had better chairs. I do love their no talk policy especially for certain movies you know people would normally chat about.", "author": "Christy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-14", "description": "I guess after going to a dine-in theater with large plush reclining seating and stellar service, it sets the bar pretty high. \n\nThe seats were small. Think the size of an airplane seat. And they sit upright without the ability to recline. Not even a little. \n\nThe menu was lackluster. I ordered a hot dog w/fries. It was ok (the hot dog that is. The fries were actually good). The food came out about an hour after we ordered it. 10 minutes later they brought out the bill. We were still eating. \n\nThe theater itself is pretty nice (aesthetically speaking), though. And it's close to work, so I'll probably be back. I'll just stick to popcorn.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "I had a good experience here so far. I went there for the first time finally after it has been opened for a while. It's easy to buy tickets online and select your seats ahead. The pick up process was easy by just swiping your credit card. \n\nMy friends and I got there little late and the waitress was nice enough to explain to us the ordering system. We got popcorn with truffle Parmesan and fries, which was not on the menu but my friend still ordered it and they did have it. Soda was bottomless. Portions were all large and nice. \n\nSeats were comfortable. There are tables between each two seats with under table light which makes ordering easy. And placing the order card upright the waitress would just come and pick it up and bring your orders over. You can keep ordering as the movie goes. \n\nOverall the experience was nice and I'll definitely return.  If you are the ones who hate people walking back and forth in the theater and wants absolute no   under table lights, this won't be a place for you.", "author": "Maria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Here is a list of things you can do in your comfortable leather seat (that you can choose prior to arriving!) at Alamo Drafthouse:\n\n1. Order a carefully crafted cocktail (like a gentleman). This means that I can get drunk without resorting to bringing a flask of bourbon and pouring it into a massive soda (like a degenerate). Not that I've ever done that. \n\n2. Watch any one of an excellent selection of films on a big, beautiful screen, with a pre-show designed just for whatever you happen to be seeing.\n\n3. Eat some actually delicious food. So far I've only gotten into the Wild Mushroom flatbread (Roasted Mushrooms, Mushroom Cream, Mozzarella, Truffled Parmesan), but I was legitimately impressed. This isn't just good food for a movie theatre, this is just actually good food. \n\n4. Sip on one of more than 20 tasty brews, all from New York State. Like the Rushing Duck Nitro Porter. If you like coffee at all, get on this beer. \n\nHere is a list of things you cannot do in your comfortable leather seat:\n\n1. Text. There's a strict rule against it, which means none of us have to get distracted by the glow of your stupid phone because you couldn't wait to tell Josh that Becky was being a complete bitch earlier. Show some restraint. Becky will still be a bitch after the film is over.\n\n2. Talk. Once again, this is a wonderful rule that they will actually enforce. This means that we can actually pay attention to the movie, as opposed to hearing your running commentary* about how you'd handle the man with the axe chopping down the door. Newsflash: You'd scream like a tiny little girl, and probably defecate in your pants.\n\n3. Urinate. This is the only problem with Alamo, as I see it. I have the bladder of a champion but after drinking all that bourbon and beer (and the massive glass of water I love that they provide), I have to pee before the movie's over, and I feel like they'd frown on me not getting up before doing so. \n\nI'm admittedly a little bit biased because I can walk here in under 10 minutes, but how can you not love this place? \n______________\n*This is a problem at more than a few Brooklyn theaters (AHEM Court Street AHEM).", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Alamo is great cinema. These people are busy and work very hard to keep every customer happy. At least they try to. Definitely the kind of place I feel very comfortable leaving a 20% tip. Keep up guys!", "author": "Elie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "For folks with children. \n\nAn absolute must for anyone with young kids. The staff is patient, the food selections are plentiful and the seats are comfortable. The theaters are smaller than big chains, which may be a minus for some, but no me or my kid. I've also been to a few birthday parties here for kindergarten kids, and a children's film festival, and they run them well.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "I'm very much in love with this new type of movie theater where the seats are super comfy and not grimy AF. \n\nI had a really good experience here. Even though you might have a side seat, you still have a good view of the theater and there's not need to arrive 30 + minutes earlier because all the seats are assigned. \n\nLove the huge beer and food selection they have here for the picking.\n\nThe only cons I have are the fact that their servers come during the movie to drop off checks and figure out payment options which ruin part of the movie experience. I also wish that their arm handles can be moved up like many movie theaters for dates.", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Great cinema. Definitely has an old school \"movie house\" vibe rather than a large cineworld type complex. Not much to add to the existing reviews - the bar is a fun place to grab a pre-movie drink in the evenings. The best thing about this place is the infant-friendly matinées - bring your kids, park the stroller in the aisle, order some food and drinks and (screaming/nappy changing permitting) enjoy a movie at a discounted price. The food is pretty good too; I've only ever had the cobb salad, which was surprisingly nice, but everything else looks pretty good too.", "author": "Tommaso S."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}