{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-18", "description": "I took my family to see Beauty and the Beast last night. As we arrived to the theater we were pleasantly surprised to see that they were giving out a rose to those who purchased the signature pint glasses. When we went to collect our 5 glasses and roses the gentleman behind the counter first told us we couldn't get a rose. Then he gave us one, we asked for 5 since we had 5 glasses. In a very rude tone he responded \"you can't have 5, you need a ticket for them\" we explained we had the tickets for the glasses. He then rolled his eyes and said \"we are only giving them to children\" after we had already seen them given to adults as well. We asked him for his name and he said \"why do you need to know my name\" we told him because he worked in customer service and we were asking. He then said \"my name is Orlando, I'm very funny about giving people my name\".\n\nThe theater is beautiful and overall a good time but people go to the Alamo for the experience and with employees like Orlando, they could lose many customers. I've never dealt with this at the Yonkers location. Hopefully the other employees aren't as terrible.", "author": "Luis P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Remember the Alamo! I almost forgot about this place due to it's ever shifting opening date. Luckily, as a member of their loyalty program, I received an email with an invite to see a movie during their soft opening.\n\nI used to live right near the Alamo Drafthouse in Kansas City and went there fairly frequently. I loved it. The good news? This place is just as awesome! Theaters are pretty small with ample leg room, thanks to it's eat-in cinema scheme. You won't feel cramped by any means. Don't expect a mega theater with a hundred seats. Speaking of seats, they are super comfy. I love that they show random movies and not your everyday shows. I had a chance to see the rise and feel of Weiner (pun totally untended) in the doc by the same name and had an overall good experience.\n\nAs I mentioned above, you have the chance to grab a meal there. There's also drinks (alcoholic and non-alcholic) and adult milkshakes. Prices are on par with pretty much any gastropub around the city. I ordered the lamb burger and iced tea. Free refills on bevvies. The lamb burger was solid, juicy, and came with some sweet potato fries. Just an FYI, if you're the type of person that needs to see your food, especially for Instagram photos, you're SOL.\n\nAnd speaking of that, phones are strictly forbidden. No texting, no phone ringing, no even looking at your phone. So awesome. It's why I hate movie viewing here. You shell out so much money for the jackass next to you to go on their cell. No thank you. Here they'll kick yo ass out. Long live Alamo!", "author": "Susan N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "Worst movie experience ever. This theatre is run like an airline or a strict military. We were a few minutes late despite jumping into a car on time but were held up by traffic. This is the first few minutes during which the commercials were playing. They refused to let us in. One of our friends was already in the theatre and was yelled at by a staff member for using her phone to try to contact us, and chased by staff after she was sent out of the theatre just to continue the lecture on the STRICT phone and late policies. The tickets DO NOT have any disclaimers regarding these policies, and had they been there we wouldn't have bought them. What was supposed to be a fun experience turned into an absolute nightmare. Do not go unless you can be sure that you will get there way in advance of the movie, and god forbid you get stuck in the subway or traffic.", "author": "Xin W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "I ordered my tickets to see Blank Panther for the second time. I saw the first one at the theater in Sheepshead Bay. I arrived at the theater nine minutes after the showtime and was denied entry. The employee suggested I view another movie or contact Fandango for a refund. I opted to get my refund. My sister went to a different employee to find out if the previews were still running then why we couldn't go in the theater. That employee had major attitude. I was high key annoyed and do not think I will come back to this theater. They need better management and policies.", "author": "Alyssa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "This has to be THE best movie theatre in my opinion. My boyfriend and I went to see Split which was amazing. We had 3 glasses of cider, honey BBQ chicken wings, and a burger with a side of fries which the kind waiter brought to our seats. He didn't keep coming back and asking us about our food which I liked. \n\nThis place is definitely the definition of dine in theatre. \n\nDefinitely coming back!", "author": "Emily A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "If you never have been to the Alamo Drafthouse before I highly suggest you do. I am very happy it is now in the city. It is a different kind of experience that people should try out at least a couple times in their life. Located on the 4th floor of the Albee Square mall, this movie theater offers comfy seats and delicious food at a reasonable price for the area. I would say skip the popcorn, it wasn't very good for the $9 I paid for it. However the shakes, and the burgers/wings are not to be missed. Trust me, you'll thank me. I particularly liked the strawberry cheesecake shake, and I dipped my fries into it and it was so delicious. I would go again, especially since I don't have to drive out to Yonkers anymore to have the same experience.", "author": "Wilson G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Great food, great cocktails, comfortable seating, great music, GREAT bartenders (Matt's a wizard), plus the house of wax!", "author": "Joe P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "This place is horrible and should have 0 stars (if Yelp allowed it). My friend and I had tickets today for a movie that started at 4:15 PM, a tall man with limp hair flaps told us that we couldn't have our tickets because we arrived at 4:18 PM. Apparently, he'd printed out our tickets after we left, according to the Fandango rep. I spoke with. It seems doing so might have prevented our refund. So to sum, we were refused entry to a movie for which we were minutes late, our unused tickets were printed by the stupidly rude man at the register, perhaps in an attempt to keep us from being refunded, and the same man kept the establishment he works for from making more money off our custom (food and drinks) by refusing us entry. \n\nSave yourself the pedantic stupidity, go to Nitehawk instead.", "author": "NN B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "I love (almost) everything about Alamo Drafthouse, but I have to knock this one down a star because of the limited menu. I've been to several Alamo Drafthouse theaters across Texas and they all have way more extensive menus -- not sure why Brooklyn doesn't get the same. \n\nI also arrived late (aka when previews had already started) to a movie and wasn't able to enter. That's fair! It's their policy. BUT I've been to two other screenings where people came in after the movie had already started, so the \"no late arrival\" policy enforcement seems to be hit or miss.", "author": "J. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "It was me and my sisters first time to this movie theater. Our server Nathan was professional for the most part thankfully but when it came to writing the order on the card and placing it up on the holder, he came over and said it's supposed to be on this side so I can tell but it didn't matter to me.If it didn't matter why did you say something anyway? I placed it in the holder upright where he can see it I'm not expected to know them little details and it's my first time there geez.", "author": "Grace R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "The single best cinematic experience you will ever have.\n\nDelicious food, friendly service, amazing film selection.  Alamo Drafthouse Cinema is changing the game down in Brooklyn.  All the other knockoffs like Nitehawk should bow down!\n\nSimply do not miss this place.  I will never go to another theater ever again.", "author": "David K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "I come here basically because I hate cell phones and talkers and people who come late, and I refuse to go to any other theater. Cell phones especially are a plague and you can't go to a single theater without someone pulling one out. This is literally the only theater you can be safe.\n\nIf you notice, every single one of the people who rate this theater low all showed up late to their movies. And you know what, it clearly says on their website and after you buy the ticket that they don't allow late entry. So if your stupid ignorant self can't follow directions, or you want to show up late to something, screw you. Don't come into my theater and bother me. I never show up late to anything. Even with the sucky MTA and awful traffic, I have still never shown up late to a single thing, be it movie, theater, or concert, because I plan. But you know what happens to me every single time I go to a show? Some dumb a-hole comes stumbling in late and bothers everyone. No matter how \"nice\" such a person is, they are still not welcome and I hate them. Well, that can't happen here.\n\nWhen I first started coming the servers were still a bit dumb, they'd walk in front of you during the movie. I went a few more times and they had stopped doing that, they were hunching over and trying to stay out of your way. So I guess they are getting better at the serving thing.\n\nWhy only 4 stars? Power went out and we missed out on one of our movies. I figured that's weird, maybe that's just a fluke. But they said it happens often. So... now we are not so sure about coming back. The staff were nice about it, and honestly this is not the theater's fault as it is the actual mall's fault, because the entire mall's power goes out, not just Alamo. They gave us replacement tickets and food vouchers. But that being said, even if it's not their fault the fact remains the theater can lose power at any time.", "author": "Vee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "I truly love this theater. It's the same price as other theaters but the experience is way better. The recliner seating is comfortable. I love the strict policy of no talking or texting. I didn't have to worry about bright phone lights shining in my face. The food menu had lots of options to choose from (appetizers, entrees, dessert, alcohol, milkshakes, etc.). Furthermore, the food is catered to you. Every seat has a table to eat from. I will certainly watch more movies at the Alamo.", "author": "Janet P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-23", "description": "I am updating my review because the manager reached out and said that - among other things - he'll talk to the staff about reacting differently when someone walks out sipping water from a plastic cup. Thanks.", "author": "Frances M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Second visit. No hassle, reserved seats. Clean theater. Power outage during end credits, theater issued rain checks. Great customer service.", "author": "Lane G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "Compared to other Alamo locations I've been to (mostly Texas):\n\n-The menu is small and lacks tried-and-true favorites like chicken fingers \u0026 fries, or a breakfast menu at all.\n\n-The staff isn't as well trained and doesn't seem to care/take action as much when customers are being disruptive.\n\n-The many food items are unreasonably expensive.\n\nIt's better than you're average NYC theater but compared to what we *should* be getting and what other Alamo locations dish-out, this is deeply unimpressive.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-28", "description": "If your train is late and you bought tickets on Fandango.  You are screwed.. No refund! The best they offer is waiting gor the bext show 3 hours later. Go back to Texas. You don't understand your market. Will never come back or refer.", "author": "Larendee R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-31", "description": "just stop, albee square\nyou already got us stuck in\ndekalb market hell", "author": "Haiku U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "It's 9:52 movie supposed to start at 10:10 p and we are still waiting!! My husband and friend are injured. This is insanity!!", "author": "Kay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Super excited to have this place come to Brooklyn and it lived up to my expectations. Great picture, great sound. Neat and clean. Good food and drink; it's an anomaly to have booze, never mind a good cocktail while watching a movie in NYC. The service is great and never a wait to pay your tab after the movie.", "author": "Oren S."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}