{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-16", "description": "My first time experience with eating a real meal and drinking hard liquor while watching a movie, in a cinema.\nIt was awesome. \nThe food, beef tacos, wings and fries were all very tasty and satisfying. Drinks... I didn't expect to have real cocktails. Watching Vice kind-a called for Old Fashioned. Made well and not cheep on the liquor. Again, a pleasant surprise. I liked the cocktails ratings: G, PG13... R. \nThe service was nice and even if sometimes they delivered meals and our second round of drinks during the movie it wasn't disruptive. Well done! \nThe only reason I gave 4 and not 5 stars are the seats: if you skipped the bar between the two seats sharing a table, it could have been used for more specious seat (I'm not a big person!) and maybe have a hanger for purses (my problem) under the table. Other then this, it was a perfect experience. \nI will be back and try other locations too.\nCheers\n\n\nAfter respond from Alamo, it seems that I missed the purse' hook under our table. I did look for it. My daughter couldn't find it either. Will look better next time. Cheers. See you next time.", "author": "Merav L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Such a cool movie theater experience! \n\nWhat makes this place cool: They have so many menu options, including a wide variety of draft beers, cocktails, and spiked milkshakes. Comfortable seating and ample leg room. There is a waiter for each section. \n\nThings to note: Early arrival is highly suggested. This will allow you to get your food right at the start of the movie. There's no entry after that movie has started. Additionally, this theater follows a strict no talking/ no phone policy while the movie is playing. \n\nOverall, Alamo Drafthouse is definitely a nice way to switch up your movie going experience. While I may not become a regular, as this can become a pricey movie going experience, I look forward to coming here again.", "author": "Jesica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "Love love love Alamo!!! Service was amazing, food and drinks were on point and it's a quick car ride from my house in Brooklyn. This will definitely be my new go to theater. Alamo gives you a full on dining/theater experience. The staff is AWESOME!!!!", "author": "Brent L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "Alamo was one of the big reasons for my renewed interest in cinema. Instead of the experience being uncomfortable and unenjoyable, it's now very nice. Good food, fun events, really comfortable reserved seating and solid picture/sound.\n\nAnd I know this last part is kind of silly, but the short clips they play before the show starts, instead of commercials or nothing, make the experience a lot better overall. It's this kind of attention to detail that will make me come back.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "I saw Avengers Infinity War here. I'm familiar with the Alamo Drafthouse Cinemas having lived in Austin, TX. \n\nI enjoyed my experience. Parking is sparse if you're driving here just FYI. Thanks guy a the ticket desk was pleasant enough I had purchased my tickets in my app so I didn't need much interaction besides where to go for my theater.\n\nThe lobby was well decorated. There's a backdrop of the city where you can take pics. The theater was very clean and the seats was comfortable. The menu could have a bit more option imo, however the appetizer menu is good if you just want to snack instead of eat. Of course  if you like beers the Drafthouse aspect will compliment your taste for that. The food service was quick and non disruptive.\n\nI'm looking forward to coming back bere.\n\nP.S. the movie was awesome that help too! That's my spoiler free review.\n\nP.P.S there's the DeKalb Market Hall. It's pretty much a food mall. If you want to do dinner and a movie the economical way with way better options. I recommend to watch the movie and then head to the basement after to choose from at least 20 eateries!", "author": "Seon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "Really cute theatre.  A bit different, and more \"Brooklyn\" than your typical theatre.  I expected the seats to be a bit further from each other because I'm used to the IPIC theatre on Fulton, but the theatre didn't feel too crowded.  Screen size was good.  Had a draft beer and the pretzels, which were yummy.  The beer was $8 and the pretzels were $10, so I did feel that I spent a lot for what I got, but the beer and pretZels were really good and I had an overall great experience.  I will definitely return.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "A little over a year later and I am still a fan of this theater!  In the past year they have changed things up a bit in the lobby where there is now a geeky gift shop of sorts that sells everything from their Tiki mugs to T-shirts to board games.  Also, when certain movies are playing sometimes special merchandise is sold down there as well.\n\nI feel like the staff at this branch has really managed to get into a groove now.  When I first went the theater was still young and the staff somewhat inexperienced.  Now everything flows super smooth and everyone from the box office (or counter if you prefer) to the waitstaff do an excellent job of being friendly and efficient.\n\nSeating is a pleasure here.  You get to pick your seats beforehand, so no need to panic about getting a good seat.  Also, the seats are super comfy and there is plenty of room under the seats to stash your stuff (even hooks under the tables!).\n\nThe menu is changed every now and then, so if you really like something it may or may not be on the menu next time, but you'll likely find something else you like!\n\nI continue to be a fan of the Alamo.  I feel it is a better experience now than before.", "author": "Benson Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "I love Alamo. You get to pre-pick your seat so you always know exactly where you'll be and there is no rush to be there uber early to find the center (does anyone else do that, or is that just me?) \n\nTheir menu is really good. I've been there a dozen times and I try something different each time and really love it. \n\nThey have a no cell phone and no talking policy which is the best thing ever. I wish every theatre implemented this rule because it really makes for a perfect movie experience. \n\nLastly, and this is a small detail but it's really nice. Their menus and the commercials before the movie tend to be tailored specifically to the film you are about to see. I always find it so neat. Alamo is delightful. I highly recommend it for dinner, adult beverages and a movie night.", "author": "Maya T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "So I've been to every movie theater in its class in NYC. It is hands down the only theater I would go to in Brooklyn. The Food \u0026 service overrall is pretty good here. Their shakes rival Shake Shack. It's nice and thick which any other way would be a sin.\nI love the location \u0026 the fact that is right on top of Dekalb market. '\nMy only suggestion is to arrive on time because I'm pretty sure they don't let you in if you're late. Which makes TON of sense because I don't want anybody blocking me from watching the movie because they're looking for their seats.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "I've never been to a Drafthouse Cinema so this was cool for me. \nAs we walked in I kept asking \"but where is the popcorn?\"\n\nNote well: DON'T BE LATE! I was late by about six minutes my first trip here and the sign on the door almost had me in tears. \"Late policy: NO THEATER ENTRY ONCE A FEATURE HAS BEGUN.\" I was well and truly early the day after I can tell you that. \n\nStaff was nice when honouring seats for the next day. I guess they understand all too well the trouble getting street parking downstairs. \n\nThe experience was nice. I went to see BP and coupled with very tasty wings, popcorn and beer, I had a wonderful time! The servers were on point too. Almost cute as they darted through and fro during the show with backs bent as they proceeded to tables to retrieve orders from us without interrupting the movie.\n\nOh, no talking or texting. Yes! \nAlso, try not to get too close to the screen (especially if you wear glasses or suffer the occasional vertigo. It can be tricky. \n\nI'll definitely be back. \n\nThe End.", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-28", "description": "The theater boasts no talking but they don't enforce it. We went there for the 11:05am Avengers and the couple in seats 301 and 302 next to me kept talking during the movie. I counted 11 times, of which I made 3 complaints over the span of 2 hours. The staff didn't say anything to the couple until my 3rd complaint, at which point the movie was almost over. They theater gave me free tickets and wrote an apology but instead why couldn't they either say something to the couple in a more timely manner so I didn't have to miss parts of the movie. This was the 4th time at this theater, and 3 of those visits had unmanaged talking. We won't  go back which is no skin off their back but I wish they didn't lie about their noise policy.", "author": "Anna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Alamo Drafthouse first entered the New York Metro market when they opened their Yonkers location back in 2013. While I was initially apathetic over its opening, it has slowly become my favorite theater to see movies - and now it's pretty much the only theater I'll go to. In 2016, this location in Brooklyn opened, and I hear two more are in the works for Manhattan and Staten Island oooh. While it's most convenient for me to go to Yonkers, this location was having a special showing that I really wanted to see. That being said, I decided to take a trip to Brooklyn and check it out.\n\nEverything about Alamo speaks to me - the aesthetics, the food, the details they put into their movie marathons, the cult classic screenings, the theme nights - just everything. Besides that, what sets the Alamo apart from other theaters is the fact that they serve food and they have a strict no talking/texting policy. You also need to be on time - latecomers will not be allowed entrance to the theater. \n\nThis Alamo is located on the top floor of City Point Shopping Center in Downtown Brooklyn. The theater actually has two levels; the actual 4th floor of the mall houses the theater's main lobby and box office, as well as a bar and small gift shop. A small escalator inside the lobby will bring you up to the theaters. I was really impressed with the lobby bar - it's large, impressive, and overall superior to the bar at the Yonkers location. The seats in the theater were nice and comfy, though I have mixed feeling about the tables in each row of the theater. It's set up so two seats share one table; while that makes it easy for people to get up if they have to, it can be awkward for people sitting next to strangers. \n\nFood and service were good, similar to my past Alamo experiences; this isn't a restaurant so I don't have high expectations for the food but all things considered it's good. They have a nice variety of options and do a good job with theme dishes for the season or certain movie showings. I would definitely recommend taking the subway or Uber/Lyft to get here - this is a pretty dense area of BK and street parking is really limited. \n\nOverall, I'm a fan of Alamo and would definitely recommend going at least once. Even if you just want to see a current release, for me the entire experience is superior to a regular movie theater.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "My favorite movie theater to go to in Brooklyn. Big, comfortable chairs; available food and drink; plus an easy-to-get-to location. \n\nBeing as popular as it is, getting tickets can be tough. Multiple times I have stopped over only to be turned away by sold out shows (thankfully there's an eatery downstairs to pass time). However, the process inside is simple - get to your assigned seat, use the lights under the table to look at the menu, write what you want on the placard and leave visible in the space provided.  Draft list is fantastic and reasonable prices at $7-9. The popcorn ($8) is also solid - a heaping pile of buttered popcorn served in a giant steel bowl. My last visit, tried the Jerk Chicken Sandwich ($14) - a hunk of seasoned chicken on a potato bun served with sweet potato pies. Loved the veggies and bun, but the chicken was a little dry. Sweet potato fries are good.\n\nAs long as you don't mind servers running around (they do their best not to disturb movie watchers), then this is a great place to see a show.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-27", "description": "My only gripe is the seating/spacing. Could be better. Other than that, very good experience.", "author": "DJ P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "After we had kids, it was difficult to justify paying a babysitter hours on end so we can get dinner somewhere and then go see a movie. Alamo Drafthouse solved this problem by giving us dinner and a movie in less time. No more guilt for getting date night sitters! \n\nThe Cinema is skillfully designed with movie throwbacks and cool decor. A bar that hosts the largest beer tap in Brooklyn and a creative menu that has constants and a select menu that changes every week or so to theme with the movies that are playing. What's not to love about this place?! \n\nPro tip: the seats in the front row of the theatres recline!", "author": "Don T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Love love love this theater. Came here on a Saturday night to see the Avengers movie, we had tickets for the front row which surprisingly was super comfortable. We didn't have to crank our necks up at an awkward angle in order to see the screen. Service was great and prices were very fair. I also love the location of this theater with the Dekalb Market downstairs. I also love that they don't tolerate people making noise and basically ruining the movie experience for others which I've had to deal with at\nCountless other theaters. This is my theater from now on!", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "I am a part of the cult. And if you go just once, so will you. The food is beyond good theatre food and the seats are comfy and spacious. The only thing else you could ask for is a great movie. But that's on the performers.", "author": "Sira K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "In one fell swoop Alamo Drafthouse became my favorite movie theatre of all time. Here's why:\n\nThe entire experience here was incredible from start to finish. You get the feeling when walking in as if you're in a grand theatre with all of the lights and awesome art work displayed all over the place. The place is also spotless, and there's nothing I appreciate more than cleanliness.\n\nThe cushioned seats are extremely comfortable, and some of them recline.\n\nThere are tables in front of each pair of seats and order cards which you can use to get some food while you watch the movie.\n\nI ordered the lamb burger with cranberry juice. To my pleasant surprise, the burger came with sweet potato fries on the side. The burger was really good; so good, in fact, that I wasn't even mad that they forgot to take out the pickles, which I didn't want. \n\nThe screen was enormous, and even though I was sitting in row 2 (the second closest to the front), I didn't have to strain my neck to watch the movie properly.\n\nWhat impressed me the MOST about this theatre was that care was taken so that the bathrooms would be a germaphobe's promised land -- the soap and paper towels dispense themselves automatically, the toilet flushes itself, and the bathroom door has a foot accessory at the bottom so that you don't have to touch the door handle to open the door (something that drives me crazy haha).\n\nAbsolutely well deserved 5 stars. I will certainly be back.\n\nAs an added bonus, you get a free ticket for your birthday.", "author": "Melissa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "Love this place. 5 stars. Best cinema in the city. Many bad reviews are from people that weren't following the very necessary rules and suffered the consequences. Boo hoo. That's a big reason why I love this place.\n\nBUT... the entrees here are not good. Do not eat your meals here. The drinks, the popcorn, maybe an app - great choices. You're much better off eating an early or late meal downstairs in the food hall rather than a menu item. I wish I liked the food here, but it's not good. There are way better options just a few floors below. \n\nStill the best place to see a movie though.", "author": "Zack L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "Went with my boyfriend, we had an amazing time. Ordered way too much food, the bottomless popcorn is a really good idea. Also the milkshakes with some liquor in them. Would definitely go back to get another one. Had a burger which was delicious. \nLike the experience that they serve food during the movie, like in a restaurant. I have never been to a place like this before. Really enjoyed it.", "author": "Veronika L."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}