{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "OBOYOBOY OOHH BOY!  \n\nHow cool is this place?  We came on a super frigid day to grab a movie - purchased the tix online and although not cheap are so worth it and they very easy and pick up was FAST.  This was the perfect venue for The Disaster Artist.\n\nAs I had never been (or heard of) the Alamo before, I didn't know that they had drinks, food, etc... It was a real treat to find out.  I love the fact that they are strict about not coming in late to the movie, about NO CELL phones or noise.  YOU GO, ALAMO!  You do you!\n\nThe seats are comfy and it just has a nice vibe.  Definitely a great place to grab a movie and grub.  Great for a date!", "author": "Carla L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Loved my experience here and will never go back to a regular theater. I rarely go to theaters anymore because I have a baby now so if I were to go to one, I'd splurge a bit. It's not even that much more than a regular theater. Tickets here are $16 and last time I checked UA charged $13 for crappy seats, bad company and no service. This theater is full service. You get dinner, alcohol, water, snacks, etc. I come to movies for popcorn and their plain popcorn with butter was so good. The waiter service is efficient and doesn't get in your way of enjoying the movie. However I did feel bad for them crouching and running through the aisles. Seats are huge and comfy and you get a table between two seats. Seats are predetermined too. \n\nAlso after you watch a movie you can eat in the great food hall downstairs or shop!", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Went there tonight to see Halloween. The movie theater itself is really nice. It was clean and looked like they take good care of it. The seats were comfortable. I like being able to recline and put my feet up. I also like that they have a small table there attached to your chair. I have been to Alamo theaters where the table is in front of you and not connected to the chair. It's awkward because you have to leave forward to reach the table. Here there was no problem at all. The food was average. I had a burger and fries. Fries were good but burger was kind of dry. It was supposed to have some sauce on it but I think they forgot it. I got cookies as well. The cookies are cooked perfectly. The cookies are warm and fall apart when you pick them up  overall good experience and I would go there again.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-01", "description": "This was my first time coming here and it was amazing. I went to see the legos movie which was pretty good as well. The reason why I'm giving 4 stars instead of 5 is because I ordered hot wings and the wings were so hard. I also order a chocolate peanut shake and it was SOOOO DELICIOUS!!! I think heaven's rocks were falling upon my head, but the wings just turned my whole mood. Other that, everything was amazing !!!! The servers and the customer service was on point. I really had a great time here.", "author": "Petty G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Super cool to have a theater like this in Brooklyn! The staff working there are nice \u0026 cool. Nice \u0026 clean bathroom, food was great ( I had bbq wing \u0026 popcorn)the popcorns bowl was big. I def will be back!", "author": "Shanique G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "Here's the thing, I know the Alamo is popular enough and people know what to expect. Yes there's an extensive and predictably pricey food menu, comfortable seats that you reserve when buying tickets, and strict rules that are enforced for the sake of everyone's movie enjoyment. But did you know about the Alamo for All program on Tuesdays which lets you bring a baby into the theater while all the rules are relaxed? Your babe is in as long as the movie starts before 2pm. I experienced it today with my infant and it was lovely. We showed up well after the previews had started (they normally wouldn't let you in at this point), parked my stroller in front of my seat, and ordered some lunch while the babe peacefully snored away through the 2 hour movie. Everyone in my row had a baby of their own, some of which made occasional noises, others were nursing or chugging bottles, while some had to step out for a diapet change, and you could feel the camaraderie in the air. Just what this grumpy mom needed mid maternity leave on a Tuesday afternoon. Can't wait til next Tuesday!", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "I have visited Alamo on 2 occasions and both were a pleasant experience. The first time I went, I have to say I was a bit skeptical for a dine-in movie theatre, cause ya know, distractions. But since I've been twice it's not something that stops me from going. Make sure to buy your tickets ahead of time because they do reserved seating. \n\nThe inside is pretty dope, they have art inspired by old-time classic movies. They also offer a bar where you can get drinks before a film, but you do not need a ticket to go there. The staff in the front are always super friendly. \n\nIt is best to get to Alamo early, so you can order your food before the film starts but remember you can order food at any point during the film apart from the last 45 minutes (at this point the staff do their final rounds and will then bring out the checks for each party). You order by writing down the names from the menu on little notepads at each table. The staff move around the theatre through the rows by crouching down as to not block the view. So no issues there. \n\nThe bowl of popcorn is so good!! Talk about eating like no one is watching. The chocolate chip cookie milkshake is amazing! I will probably get that at every visit. The menu is pretty extensive, everything from burgers to nachos is available so you can skip dinner. \n\nOverall, a lovely experience and will visit again.", "author": "Kiara N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "Nice theater. I love that I buy my ticket and walk straight in. At iPic you still have to wait in line, pointless. I like the menu, but keep it simple. I go for wings, tacos, sandwiches you know nothing too over the top. I only had an issue one time and customer service was excellent, the manager on duty was very approachable and understanding. They have a rewards program, it's free to sign up, no membership fee. I just wish I saw a better selection of movies, but they try. They even offer 3D every now and again, but tickets go fast. I'm not bothered by the rules, I only had one person act crazy while I had my phone out. I was checking for my rewards lol. I still feel comfortable looking at a text, no one flips out on you as long as you are respectful. I usually don't like going to the movies that often, but their prices and the vibe make it bearable. They also have a cute bar/lounge where you can hang out before or after your movie.", "author": "Nisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Oh man, this place has changed what I expect from going to a movie theater.  They have set the new standard.  So much comfort; so much quality.  You can literally show up and go to your seat and sit down.  Your waiter, who are all really nice, will check your ticket on your phone and then explain how to order and then take your order.  Their customer service is outstanding in an industry that laughably lacks any customer service.  I ordered a cocktail and didn't particularly like it, so they brought me a different one.", "author": "NoOneUknow S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "I love this theatre so much, I've started coming here about  three times a month. The menu options are great, and the food is actually really tasty for movie theatre food! They have the best crispy buffalo cauliflower, who woulda thunk it?! I docked a star because although it's a fairly clean cinema, sometimes it hit or miss - sticky tables and gross things in the cup holders. Also the wait staff can sometimes be a bit annoying, but overall the best movie going experience in Brooklyn!", "author": "Keturah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "When I first got an email saying Alamo was opening in BK, I was certain I'd be disappointed. I'm from Austin which is the hometown origination point for Drafthouse. I was sure it wouldn't feel like 'home', like the indie film promoting place I'd grown up to love. \n\nWrong-o, my friends.\n\nThis place is a bit more 'gentrified' than I prefer (I'm used to older Alamo's) but I walked in and it felt so comfortable, so familiar, so 'exactly what I was hoping for'.\n\nThey still throw bad ass and fun events, they do one-off showings, they do summer movies, tea party, and girlie night movies. It's new and nice and clean. It's everything Drafthouse Austin is but without the wear and tear.\n\nThings to know about Alamo from a seasoned Austinite:\n-Join their rewards program. Even if you don't go frequently, you'll get a free movie the month of your birthday. Woot!\n-Order online and pick your seats ahead of time. (You can also order/pick seats when you get to the theater, too)\n-SHOW UP ON TIME OR YOU DONT GET IN!\n-Keep your cell phone off and yo mouth shut.\n-Show up early to watch the previews. They always correspond to the movie you're about the watch. It's really fun.\n-The front row of chairs in the BK theaters recline! So yes, you're in the front row but you are relaxing in the best way possible, my friends.\n\nGo visit! It's the best, for real, for real.\n\nPs- can you guys do a TMNT pizza party?? The 90's version (Ice ice baby!) and all you can eat pizza! My favorite event from when I was a 'young buck' in Austin. Let's bring it back, yeah?!?!", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "I have been waiting for the right time to write this review. \n***\nBut first, a brief history on my experiences at movie theaters. I have loathed going to the movies for a few years now. With the bright light of people checking their phones during a film, the loud ringing of someone's cell phone during the movie, people having full on conversations during the movie, uncomfortable chairs, or people kicking my chair... I have had a combination of or at least one of these afflictions EVERY time I went to the movies; which pretty much made me HATE the movies. So, this review is a big deal. \n***\nI saw a movie during it's opening weekend at this Alamo Drafthouse. I am wearing a cast on my foot so being able to pick my seat was a HUGE plus. \nI chose my seats (a week in advance - seats go fast!), arrived 30 mins before the movie started, sat in my plush leather seat, ordered soft pretzels and a cocktail, and proceeded to have the best movie theater experience I have had in a long time. \nThe aisles are roomy enough for people to walk by and deliver food without disturbing you. If there is an inconsiderate person on their phone or talking, you can raise your card and they can be removed - HELLER! Last night, I went to another movie theater against my will and I will never cheat on Alamo again. \nAlamo Drafthouse, you have been so good to me that I almost want to keep this experience to myself so people don't flock there in droves to ruin my experience; but everyone deserves to enjoy the movies. I love the movies again and I have been to Alamo 5 times in the last 2 months. The customer service is great too!\nHuge fan, guys. \nAnd those soft pretzels are Delicious!", "author": "Monique R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "One of my favorite movie theaters in Brooklyn! Although the chairs don't recline (except for the front row), there is so much leg room due to the aisle the servers have to crouch through that I don't feel as all cramped. The seats are comfortable leather. It's an overall comfortable movie watching experience. They even serve food and drinks for you to enjoy during the movie. For movies in the morning (mine was an 11:40am showing), they have a special brunch menu. They also have exclusive menus for a lot of the movies.\n\nAnd they take MoviePass!\n\nMy one complaint is that the food is a bit pricey for the portion size, especially when you take into account tax and tip, although I can justify it a bit since I bought the ticket with MoviePass.", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "The best theatre the city has to offer. If you're tired of watching people play on their phones at movies this is the place for you! You can also enjoy an entire meal and alcohol while you watch your movie. I'd suggest the Thai chili wings or the buffalo cauliflower bites. The popcorn size here is enough to food an entire family", "author": "Alli D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Our favorite movie theater in NYC. This cinema has awesome old school and cult classic movies always showing. Double features, we saw the Jurassic world and it was really cool.  My absolute favorite was Isle of dogs, the specialized menu was so good!!! Togarashi popcorn and junkyard milk shake! They have an extensive beer menu with local beers for those beer enthusiasts. I really like the seating and they have different sizes, i actually prefer the smaller ones. They also started pre authorizing credit cards to streamline the bill which is great. One of the coolest parts of the Drafthouse is that they play cult classics and foreign films regularly.", "author": "Michael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "If you like movies, specifically cult favorites and you like having a cold beer with truffle popcorn then The Alamo Drafthouse is the place for you!!\n\nMy friend and I recently snagged some tickets for the \"Multiple Maniacs\" updated version for the big screen!! Also with a Q\u0026A with the Prince of Puke himself, John Waters!!! And his autographed new book \"Make Trouble\"!! I know ..dreams do come true. \n\nI, in typical fashion was double booked and I was down to the wire arriving. Thank goodness for reserved seats. My friend and I ran in and quickly wrote down two waters and two Flower Power IPAs on a little order sheet and stuck it upwards. It was just as quickly picked up and just like that we got our drinks. We also couldn't resist the giant bowl of truffle popcorn. It was the perfect choice for us. \n\nThe evening was perfection from the service to the film to the Q\u0026A! I applaud the Alamo for keeping the standard and experience as wonderful as my introduction to the Alamo in Austin TX many years ago. \n\nAfter the movie one can not resist a selfie on the Shining patterned rug!! And then there's the extremely interesting and morbidly beautiful cocktail bar and restaurant at the House of Wax. This place could not be a more perfect date night spot! Hint hint, nudge nudge!\n\nI can not wait to return and try some more of the food and have an after movie cocktail!! Love this place!", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Our Alamo habit has gotten so bad that if we want to see a movie and it's not playing there, we won't see it. \n\nWe love their no talking/no cell phone policies because some people don't seem to have much self-awareness. They found a way to deal with that. \n\nLike their food options, especially a fan of their soft pretzel and queso and hot tea, but generally we make it a point to eat at Dekalb market downstairs before the movie so we don't order much during the show. But the option is nice. \n\nA good selection of films as well. We've gotten into the habit of sitting in the first row for the recliners, which is surprisingly much more comfortable than you'd imagine. \n\nThe staff are genuinely nice and helpful and the one time we had an issue with our order/check, they took care of it immediately, no questions asked. Love the ability to choose your seats and to cancel your tickets on their app. You'd be hard-pressed to find a more civilized and pleasant movie-going experience in Brooklyn. \n\nWish they'd add their subscription service for Brooklyn because we'd sign up in a second but it looks like that's not going to happen for now, or ever :( I guess business is too good, and I'm making it better by leaving this review, but whatever. Alamo, we love you.", "author": "Olga P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "Awesome movie theater in Downtown Brooklyn. This theater has a very cool feel to it and includes a full drink and food menu. The food is a bit pricey but very good overall its a really cool unique movie experience.", "author": "Jake W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "Honestly, I am shocked. When I was younger my grandparents would take my sister and I to the Alamo and we always had an amazing time. The last time I went was the worst experience I had at any theatre!\n\nOn 5/24 When I arrived 10 mins before the movie there was a huge line with only one person at the register. So I went to the machine to buy my ticket. Found out that the one I was on was down. Then I waited for the second machine. Once I choose my ticket, and was about to swipe my card, I was informed by the two girls that had used it before me that the machine wasn't printing tickets. So I had to wait in the long line.\n\nOnce I got up to the teller, I told her what movie I had originally planned on (Deadpool 2). And she did apologize about the long wait to check out, and said my movie had already started. Upset, I said that was fine. I told her because of my schedule that day, I wouldn't be able to see a later movie. So she rang me up for the ticket.\n\nWhen I got into the theatre the waiter wouldn't let me sit down because the movie started already. I explained to him that they were having problems in the lobby getting everyone's tickets. He still argued with me and I saw I was standing next to an empty seat already. I told him how bout I just sit here so that I don't obstruct the view of anybody else. He finally agreed to that.\n\nBy the time that I sat down I was already fuming mad, starving, irritated by the crying baby  a couple of rows over that cried through the whole film. I kept trying to, get the waiters attention so I can order something and by the time I finally did, he told me that he couldn't get me anything.\n\nNow I am the type of person that always buys their tickets early because of my busy schedule and because I'm not a fan of waiting in line. However, the app to buy tickets was not working either.\n\nThis experience completely tainted the memory of going to a place that I enjoyed with my grandparents when I was younger. I am completely shocked by the whole experience I had. As of now I am very reluctant to ever come back to this theatre. A normal AMC/Regal would suffice.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "Expensive. Great service, great sound. But it's not for the usual movie night. Deff need to budget for this movie night.", "author": "Rene A."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}