{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "I really wanted to like this place, and actually did the first time I came here.  I actually appreciate the no talking/texting/late entry policies a lot.  It's also great that you can pick your seats.   \n\nHowever, the food is terrible and way overpriced and they don't allow you to bring food in (although that policy is not posted at the theater or on the website).  I watched a server berate someone for doing so in a really rude manner.  Servers spend a lot of time standing and watching the movies (I don't blame them, but they stand right next to seats) and they are always running around.  The bathrooms, despite smelling of cleaning products that are being automatically dispensed, are actually pretty dirty and appear to have not been cleaned by a live human in some time.  \n\nI'd rather go to cobble hill, an old and less fancy, but more relaxed theater where there aren't people constantly running around in front of, or standing next to, me while watching the movie.", "author": "Beth R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "I'm going to start off my review by saying that I was totally prepared for mishaps going into Alamo, as they've just opened. I've been reading up on Yelp of the terrible service, and expected that I might have the same experience.\n\nWell, I'm happy to say that I had the COMPLETE opposite experience as seemingly most of the reviewers have had!!\n\nI went to Alamo to see The Love Witch at 9:45PM. As soon as we entered, there were ticket kiosks, and the employee there was so helpful to everyone who entered (I was familiar with the kiosk as I've attended Nitehawk numerous times and they have a similar system, but it was a nice detail that they cared to explain).\n\nThe House of Wax bar: Lovely (for my taste) decorations of rare death masks (Including Napoleon's!) and anatomical wax figures. You get an intimate museum experience along with great drinks, what more do you need! The place was pretty packed, so I'd suggest getting your drink earlier or after your movie so you can have time to hang out and look around. Bartenders were awesome and fast despite the crowd.\n\nMy overall movie experience was really great, they DO advertise on the screen that they're still working out things and that you will receive 15% off of your bill (excluding alcohol). \n\nThe theater was MUCH bigger than I expected. The seats are really comfy, and the tables are much bigger than the ones at Nitehawk. Sound system was great as well!\n\nOur server was so friendly, and our food and drinks came out at an acceptable time, and I can say for the people sitting around us that we all got our food and drinks around the same time. They were out of the draft root beer but our server made sure to inform us before she left. \n\nWe got the herb/parm popcorn, and the queso dip with chips and they were both so good! \n\nI see some complaints about being distracted by the runners, but I think by now they've definitely improved, sometimes I didn't even realize they had walked by, and I was sitting in the last row!\n\nBills were placed on our tables, paid and signed before the credits finished rolling, and I think the crowd was delighted to find out that Anna Biller (the director) had a surprise Q\u0026A at the end of the movie, it was just a nice touch and part of the reason why Alamo has such a great reputation with movie fans.\n\nI think my final piece here is: You guys gotta give them a chance. If you're really concerned your Alamo experience won't be up to par, you know what you can do? Wait a month! It's not that hard. If I have to take away anything from the experience I had last night, it's that they're really trying and it's definitely paying off.\n\n4 stars for this visit! I hope to visit soon and be able to give all 5!", "author": "Katie D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-11", "description": "Just a bad idea. By the time your order is served up room temp, the lights are out and you are encouraged to consult the menu and ask for any other items by writing on a card dimly lit by puck lights under the desk cum table. Waitstaff can't seem to split checks; in our case, they ran the credit card too many times until it didn't work anymore, then asked for another. But the thing is, this place screams how it takes film seriously, and then ruins the end of the movie by attempting to collect your check with the lights out during the last 15 minutes! The whole thing is over-designed to allow a theatre to be a restaurant, or worse, a place to run up a bar tab in a dark room with plushy seats and a big screen -- and that just doesn't work. There's a reason god invented popcorn.", "author": "Poetessnyc S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-08", "description": "The star rating is the average of the theater and movie-going experience. \n\n5 stars for the movie experience. The theater experience is, of course, pretty amazing. But ticket prices are also higher because of it. \n\n1 star for the food. Overall the dining experience is not bad. What I mean by that is the service. The wait staff do their best to be unobtrusive but I'm sure after the novelty wears off, I will start seeing the unnecessary need of having people walking in and out of the theaters. Since everything is all digital now, why can't we just place our orders through an iPad. I'm sure we have POS tech advanced enough to do this. \n\nThe low score however, is for the food itself. It has to be some of the worst food I've ever tasted. I ordered a hotdog. Simple enough right? Somehow this hot dog just tasted \"off.\" The texture was really strange - almost like mystery meat or spam. I couldn't even finish it; and I always finish hot dogs. My partner ordered the jerk chicken and it was incredibly bland and dry. The triple chocolate milkshake was also nothing to write home about. And nothing about it gave me the impression it was triple anything. \n\nI do intend to go back to ADH, but I will most likely eat beforehand. Don't waste your money on the food.", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-30", "description": "This place is just trying too hard ... everything about it is ridiculous and over produced. Nothing cool or stylish about any of it. It's like a modern apt with crappy fittings, and faux vintage flashings.", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Went to see Dead pool 2 bought my tickets on fandango.com you can reserved your seats and you can choose where would like to sit at in the theater ,very nice theater i love the leather seats near the check in area it was my first time in this theater .the waiters are very nice and cool laid back in friendly there get your food pretty fast so you can eat and enjoy your movie at the same time .the day i went to see dead pool 2 it wasn't so crowded  so there was a gap of open seats . but i notice towards the ending of the movie a couple came and sit next to me , i guess where there where sitting at the guest party near them was  little loud so there decided to move there seats . and plus you have the Century 21 department store near the entrance so you can shop right after the theater !!!!!  (i would definitely return to this movie theater i love the leather seats in the movie theater it makes you feel you're in living room ) make sure you get to the theater on time because if you missed your movie appointment there would not allow you in the theater so you dont make noise as the movie is playing, you would have to reschedule a next movie appointment  (i love that idea )", "author": "L L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "I really enjoy coming here because the cinema has strict policies on noise and cell phone usage. No riffraff here or they get kicked out. The food and alcohol shakes are tasty, but a bit expensive. If you are a sloppy eater it can be difficult to enjoy the movie and eat, but if I can do it, so can you.  The seats are also larger than most and are comfortable-you do not need to worry about a rude neighbor getting into your space.", "author": "Syndy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Wow what can I say about this place. Really cool theater. If you want to grab a drink before the movie they have an awesome bar modeled after the house of wax. Before the previews start they often show cool clips to show. For example I saw Justice League here and they pulled a bunch of all cartoons and live action portrayals of the characters including an SNL skit that got a lot of laughs. The menu is great they have everything from popcorn to burgers to wings and flatbeds to milkshakes and alcoholic beverages . All you do is write what you want on a piece of paper and the waitress or waiter takes the card and gives you the check at the end of the movie.\n\nMy only complaint is there aren't a lot of theaters hence not a lot of showings. I trying to see a movie on opening weekend you better have bought your tickets in advance. Also the seats are a little tight so at times can feel like the person next to you is on top of you.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "I have finally tried the new cinema in brooklyn that everyone has been talking about and I must say I had a great time. I love what they did with the space, it's hip, upscale, and can be perfect for a romantic date night.\n\nSome things I dread about going to the movies are standing in line to order food while wondering if I'm missing the movie, people talking during the movie and seeing the lights from people's phones going off. Well, at Alamo talking and cell phones are prohibited and you buy your ticket and head into the theater and you are taken care of from there.\n\nThe servers were all very nice and accommodating, I love the seats they are very comfy, my only complaint is I wish that the seats reclined back but I'm just being a brat. \n\nFor food I had the Thai chicken wings, they were spicy but very tasty and came with a good amount of wings and I also had the jerk chicken sandwich with sweet potatoe fries. I loved loved loved the sweet potatoe fries they were big and had the perfect texture to them. I have to admit I was pretty sad when I finished them all. The jerk chicken sandwich was good as well it had a nice little spicy kick to it.\n\nI will definitely be back, I might just make this my go to spot for movie night. I highly reccomend it.", "author": "AMANDA R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "This review is long overdue. They make every movie an event. It's how movie going used to be. Comfortable seating, great service, good food (try the cookies).", "author": "Fred L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "This place is really nice. I don't think I want to go to any other movie theater anymore. The seats were nice. The drink selection is extensive. The popcorn was great. My experience here was awesome. I would recommend any one to go if you haven't yet", "author": "Brian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "I love this theater our server Eddie was awesome. I love having a glass of wine with my movie and Eddie had my second glass ready for me as requested. This is a great date spot but it also great alone too if you feel like treating yourself!\n\nI highly recommend the chips and queso and ask for extra chips to get all of the cheesy goodness!!", "author": "Titus J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "I've been to a few different theaters that serve food and drink, and this one ranks up there. We cam to see IT, and it was a really fun experience. We ordered a bowl of popcorn and a few beers. It's always fun to enjoy some food and alcohol in the movies. The theater itself was smaller than the normal ones, but it worked. The waiters do a great job with being quick and quiet too so you're never really interrupted. I would definitely come back for the experience.", "author": "Nick D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Alamo rocks! Great food served by friendly waiters. The vibe here is special from the decor to the custom trailers to the NO talking rule or late arrivals. It's a bit pricy for tickets but it's totally worth it. Try the sandwiches they are better than the flatbreads, which are perfectly OK. Good popcorn too!", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "Took a day off and spent it watching a full day of movies to escape the heat wave. It was an excellent day. Matinees are the best, watching a movie in an empty theater is also pretty great. \n\nThis time around I got the spiced lamb flatbread with pickled red onions and radish, surprisingly tasty and very good, much better than I had anticipated. I also got myself a Sky Blue cherry cola. This brand has no artificial colors or flavors, so it comes looking crystal clear like sprite, but tastes like cherry cola. It's as healthy as soda gets. Very good and it's bottomless. Worth it. \n\nBy late afternoon, I came out of my second flick and found someone had puked outside one of the theaters, staff were tending to it with detergent, but I recalled thinking this is the downside of serving beer and cocktails in a movie theater with carpet. That bile stench is hard to get out. My second thoughts were, this is why we can't have nice things. And there goes the brand new theater smell.\n\nIf this place starts smelling like a public toilet of piss and puke, I am probably going to stop coming if my threshold is reached. I am too old to find these kinds of smells charming or some sort of badge of honor anymore. \n\nThe end of the day, they had a industrial fan trying to air out the patch(s) of soiled carpet, but I am skeptical, I've seen too much. Kudos to the staff for doing their best, whoever the culprit was, they took off leaving the staff to find their disgusting surprise and bad aim. \n\nLastly, those who mention of the sound level being too loud, I too experienced this during my last flick of the day, it was for Wonder Woman, and the volume was deafening. The sound guy was definitely being heavy handed with the bass levels. The last screening, I ordered the Herb Parmesan popcorn, for $9 you get a bowl the size of two small babies, it's huge. I ended up sharing with my neighbor, he seemed STD free, so I took my chances and offered my popcorn, plus he was cute. He offered his nachos. We did not make-out. And we went home separately, sorry this was not the serendipitous NY romance story you were hoping for. \n\nOverall, the day at the Alamo, was enjoyable, in between movies, I did a little window shopping, ran an errand, then had a little ice cream and pho at the Dekalb food hall. This was definitely a treat yo' self day, and I treated muh self, oh-kay? Okay! \n\nEveryone should do this at least once a year. One day just for you! If you do, the Alamo is waiting to welcome you with open arms, unless you're late, then you get the door!", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "I'm just waiting for Alamo to hit the stock market so I can invest. The service is impeccable and unmatched. I was excited to become a victory member because Alamo holds such a high standard and treats its customers with the utmost respect. For instance, during one of my visits there was a fire alarm pulled in the City Point Mall which delayed our movie significantly. The managerial staff came in to apologize and refunded the whole theatre's movie tickets and comped our food. Wow! I was hooked from this point on. Alamo is a very unique place with something for everyone. I tell people these days, if it ain't Alamo, it ain't the movies. Check it out folks!", "author": "Sébastian P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-05", "description": "After getting lost trying to find the Target to buy discounted patio furniture for my living room I found this movie theater. After realizing I was probably a little too drunk off the peppermint schnapps that I lifted off my grandma to haggle with those gypsies, I thought I'd sober up to a flick. Although, I was real confused because all the advertised movie posters weren't even showing. Fake news? After fiddling with my ex girlfriends movie pass for 30 mins I finally got into the theater which was pretty empty as it was a matinee of Hereditary at noon. Given my nature for getting scared of (SPOILER ALERT) families, I sat right next to the only person in the theater. I asked him if he wanted to go half's on some fried pickles but he wouldn't budge and called security. Apparently I was in the wrong seat anyway. Assigned seats? What is this an airplane? Well I guess the same rules apply because I tried to light a cigarette and got my first warning by some sort of ninja server. She's lucky my reflexes were off given how loaded I was on the schnapps. After all that I got cozy in the lazy boy that was provided for me at no additional cost. Boy, I felt right at home and took off my shoes and socks and before I could even place my order of white wine milkshake and quinoa bowl I was fast asleep. And then before I knew it the ninja was back and telling me I had to leave! I obliged given how shiny and straight her teeth were. Probably could've took a hunk right out of me. And I'm between health insurances right now. Thanks Obama. I gotta say as a business maybe you shouldn't make your seats so comfortable if you don't want people to sleep. Also maybe don't be prejudice against persons with deviated septums. Y'all are like my ex wife all over again. I will give one star though due to the fact that I got into Madame Tussauds for free. Although I couldn't recognize any of the celebrities cause they all had gonorrhea on their faces. Anyway, see y'all back for the next Woody Allen movie.", "author": "Barry L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "Got there 10 minutes late for an event I had ticket in hand for, but was refused admittance for my reserved aisle seat. I didn't question it. I didn't argue. I kept my mouth shut and took the receipt for my refund. NYC subways did no favors, but this treatment will keep me on the island of Manhattan. Brooklyn ain't all that, and if Alamo Drafthouse thinks this is proper treatment of customers, I've got news for them. Even Broadway plays will seat you 10 minutes late. And don't get me started on the hipster cashier who wasn't at his station when I arrived to stand on line behind some non-business activity. Lazy, unprofessional, inappropriate, and unwelcoming. That sums it up. I could go on in three words.", "author": "Cole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Places like this are proof to just ignore others comments and experience something for yourself. \nThe theater itself is small so no matter where you sit you have a good view. The menu itself seems interesting. We had the ginger ale (which is made with cane sugar so it tastes great) and parmesan popcorn. This is definitely going to be my new go to place, the only thing is driving here sucks cause there is nooo parking nearby.", "author": "Daniela C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "The theater is overall a nice space. Clean, spacious and friendly staff. The food is pretty good, but also pretty overpriced. At least there's lots of variety/options.", "author": "Crissy R."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}