{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "Brooklyn Brisket Burger is definitely a must. Good enough to go without the condiments.\n\nAlso the space is real nice and intimate.", "author": "Eddy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "I really wish the chairs reclined, food was decent and drinks tasted like alcohol. Alas the chairs are just ok (cushiony-if you are on the smaller side [it's a super tight fit]; food was... meh... I mean the popcorn was... disgusting is the only word I can muster up the rest was a waste of money; the cocktail I ordered said old fashion what was brought to me was a cup of water (it was the clearest old fashion in the history of its making with about 20 ice cubes.... Overall if you aren't looking to eat or partake in libations this is a theater for just watching movies not a dine in spot. No need to fret though you have ample options of actually good food worth your hard earned cash in the basement.", "author": "Clari B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Let's be honest, this is one of the best theaters in the area unless you're a WEIRDO like my friend Mark that thinks it's some kind of a sin to have theaters that serve food. This wouldn't be a Yelp review without nitpicking though so here it comes: You have to buy tickets way in advance because popular stuff here sells out QUICK, making the wonderful Movie Pass utterly useless unless you're also a WEIRDO like Mark that frequently goes to movies in the morning on weekdays, then you can Movie Pass like crazy.\nOutside of that, let's be real with each other. The food isn't actually amazing or anything BUT they are serving upward to like 500 people at once so I don't expect some orgasmic culinary experience, so what they provide given the constraints is pretty spectacular. Here's my one big problem though. It's 2018, and they're still using those no frills tortilla chips for their chips and queso and it truly bums me out. Please get better tortilla chips. There's tons of big brands selling fake \"artisinal\" and \"Home made\" tortilla chips in grocery stores so I don't see why you can't upgrade if god damn UTZ can. I promise to pay an extra dollar for slightly better tortilla chips. Also once they gave us a big bowl of all the chip crumbs from the bottom of the bag and that was really fucked up to be honest. outside of that, A+!!!!!", "author": "Mike D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "I took my boyfriend to Alamo to see Spiderman for his birthday because he was raving about dine-in movie theaters for the longest. \nThe location is great, we went on a Friday night and found parking within a 4 minute walk of the theater. When we got to the floor, we printed out my online ticket on the kiosk which was easy breezy. Then headed to our theater. We sat in row 4, the 4th and 5th seat in, I personal would choose row 6 next time, it was a little too close for me.  \n\nI believe the pricing was very reasonable for the comfortable seating and dining experience. I paid about $60 for the whole date which is close to nothing considering IPIC as a choice.\nWe opted out of drinks so I can't fill you guys in on that. but THAT.BBB. BURGER. THO!? I honestly didn't order the burger I just ate off my boyfriends and it was soooooo good!! As a cheese lover, I regret not asking for more on my margherita pizza but the sauce was good and made with fresh mozz. \n\nThe wait staff was very considerate of the movie while taking and delivering orders. I commend them for walking hunched over, my back could never take that all night. \n\nI had a great time at Alamo and I will be back if I feel like being bourgeois at the movies.", "author": "Chanel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "My first time at this place was amazing. I had a great time watching \"A Quiet Place\" when it first came out. There were plenty of seats late at night and I loved the customer service there.  As a warning, their limited time Japanese popcorn is hotter then the flames of hell on level 4 Impel Down.", "author": "Jeeper K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "I have nothing but love for this place.   One of the very best places to watch a movie in all of NYC.  \nChill staff.  \nAMAZING programming.  \nThe absolute best crowds (pin drop quiet and super into films). \nPerfect popcorn. \nComfy seating.  \nI wish I could be there right now.", "author": "Brian Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-12", "description": "I love a good movie dining experience, unfortunately Alamo Drafthouse isn't it. The movie experience was great, but the food and drinks were subpar. We ordered our food almost 10min before movie started, but didn't get our meal until 30min into the movie. My date's order was wrong, and both of our meals were cold. He had the jerk chicken sandwich, which was highly recommended by our server, but he said it tasted like a rubber tire. I also would not recommend a cocktail, just stick with beer. I can't even describe the taste of my sake cocktail, but none of the flavors meshed well, and it sorta tasted like nail polish remover. Save yourself the trouble, Nitehawk in Williamsburg is 10 times better.", "author": "Tajuana G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-11", "description": "Came here last Saturday afternoon to see Moonlight and had a decent time. Despite arriving at the theater during the previews, we still managed to order food and beverages. The method of which to order your meal does need some improvement (electronic as opposed to writing your order down on a card). The service was good but they took a while to come back with everyone's credit cards. Glad that a theater where you can dine was created in Brooklyn and I do see myself coming back here in the future.", "author": "Jessy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "My boyfriend and I had a great time at this theatre. He loved the decor, which included lots of foreign film posters, and I was pleasantly surprised by how friendly and accommodating the staff was. We tried the Bianca flatbread, the truffle Parmesan butter popcorn, and the cookie milkshake (substituting chocolate ice cream for vanilla). Skip the flatbread and go for the popcorn, which comes in a huge metal bowl, and the shake! We had a very fun evening here and will be back, despite the steep-ish price tag.", "author": "Rachel E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-24", "description": "Came here to see Wonder Woman. Very nice and clean theater. I went with my family. We all came here with appetites. So we ordered food and drinks. My sisters first order of food was cold and she sent it back. My burger was extremely greasy (made me nauseous) and wasn't hot like it just came off the grill.", "author": "Francesca C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "UPDATE: I've been back here twice since my original review and they've really upped their game thank god, so I've changed my rating from 1 stars to 4. They still didn't bring out one of our food items but they also didn't put it on the menu so it wasn't too bad. Was very happy with the service in a very packed screening of IT. Now I don't have to trek all the way to Williamsburg for booze and a movie!\n\nORIGINAL: Everyone who works at the Alamo needs to go to Nitehawk Cinema to see how it's done. First of all, NO ONE checked our tickets or showed us to our seat, any random from the street could have walked in for free and sat down. Second, the food sucks - when or if you get it that is. Which brings me to part 3: we were an hour into the movie and didn't get ANY food and just one of our drinks. After 90 mins we got the burnt flat bread and popcorn. Then my boyfriend had to go and find the staff 4 times to ask where our drinks were. They eventually came! Tiny sizes, and we only got them because my boyfriend went off in search. I heard other people complaining at the end that they never got anything and were demanding a refund. I honestly will not be back even though it's 5 mins from my house. Nitehawk all the way. Alamo, you suck.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "This is how all movie theaters should be. It was clean, quiet, and requires reserved seating in advance. After all my coworkers raved about this theater, I decided to go for a Wonder Woman.\n\nOur seats weren't great, they were kinda off to the side. But the view was good enough for the movie, and the sound quality was nice. We had a table between our seats, and there were menus under the table.\n\nWe ordered -\nQueso, butter popcorn, mac and cheese, and the quinoa salad. The queso was watery, but good otherwise. The mac and cheese was decent enough, but the quinoa salad was probably a mistake. I wasn't expecting high quality food, and that's not what we got. The food was good enough, probably on par with any other fast casual restaurant. \n\nWhat I loved was the service. They forgot the popcorn, until the end of the movie, so they took it off the bill and gave it to us anyway.\n\nThe rules they insist on mean you'll have a quiet movie watching experience. The fact that they serve beer and food here make it that much better. This is going to be my go-to movie theater from now on.", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "One of my Favorite theatres, i go here all the way from queens. Love being able to order drinks during the movie (Food too in some cases)\n\nThe drinks are great and price is reasonable, the food however are a hit or miss for me, the burger feels under-cooked, but the fries and fried chicke or cheese dishes are great.\n\nOrdering while the movie is on is very simple and never distracting, they do a good job of quietly walking around and slouching down so there is no interruptions, and there's almost never a need to talk to them so it doens't disturb others.\n\nThe Theatre is very clean as is the bathroom, seats are comfy enough(wish they had recliners but this is good enough).", "author": "Amir Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "This place makes remembering the Alamo easy. \n\nAlamo Drafthouse is a very much welcomed addition to Brooklyn. While not perfect, it does offer a great experience for all movie goers. And I do hope to keep coming back to appreciate it more and more. \n\nI'm particular about my movie theaters. People know that about me. So I am quick to note any flaws. Alamo is a fantastic theater. They do the new cool and hip thing of being your one stop for your dinner (lunch, whatever) and a movie, experience. \n\nSimilar to Williamsburg's NiteHawk (which I find near perfect) you can sit down for a great film, have actual gourmet food (not bad nachos, stale hotdogs, or old poorly made pizza) and enjoy some adult beverages. Also it caters to an audience who doesn't want distractions, they actually want to enjoy the movie experience. These are true movie buffs. There are special nights, exclusive showings, screenings of films that bring back a sense of nostalgia, and a vibe that the place is setup and ran by people who love movies. \n\nSo it draws those similarities to the NiteHawk there. There are some differences to point out though. \n\nAlamo offers you the ability to select your seats online. A highly desirable option for those who deal with the anxiety of wanting to be at the theater early to snag a good seat. So you don't have to rush, yet you better be on time. They enforce a late policy, that you may not waltz in once the movie has begun. Likewise if you're disruptive, they will ask you to leave. Better keep that cell phone out of site. Your instagram pictures suck anyhow. \n\nAlamo is larger than NiteHawk. While NiteHawk is cozy, Alamo has the luxury of building large theaters on the top of a brand new shopping center in downtown Brooklyn. Not only are they large, you have leg room for days. Being in downtown Brooklyn makes it more accessible than  NiteHawk by subway, less so by car. \n\nThey both have places to drink and eat a bite before the show as well. NiteHawk has their own little restaurant downstairs while the House of Wax is located within Alamo. I do like Alamo's selection of beers and spirits better. There's just more options and variety. So that is a plus there!\n\nAs I mentioned earlier though, Alamo does have flaws. The food is not as good at Alamo. While obviously above the quality of a big budget corporate movie theater, their food is just alright in my opinion. I don't love it. It's like a decent restaurant. Some menu items are pretty good, I do like the sandwiches. Some things like the flatbreads could use some much needed improvement. \n\nThe place itself is beautiful, but feels a drop corporate. NiteHawk is a grassroots mom and pop place, while Alamo is a small chain. Now that's not to say I view Alamo as a corporate entity that has no connection with its patrons. I think they do quite a bit, but there is some distance between them and us, and I'll explain where. They know what big movie nerds like I enjoy. And they cater to that. While all businesses want to make money, I do believe they care about their customers. But there is some disconnect. Their employees are not the best. I find there are quite a few errors from my experiences and those I known to go there. Wrong orders, food coming out late or not at all, distracting audience members, grabbing the back of my seat to crouch down behind me? Cmon man! They are learning. It's a new place, but I feel if they want what the NiteHawk has, their employees should be people who love movies too. Who understand the experience for moviegoers. If they just want to hire whoever, we're going to get whatever kind of service. \n\nMaybe things have gotten better, and I will be back soon enough, it's hard to get in though during prime time screenings. While I saw Moonlight opening weekend, and La La Land New Years Day, I got those say in advance. It's been hard to get tickets for other showings. I go to various theaters based upon time, location, and other factors, but I would like to come back more. Sometimes I can't get tickets till people I know can commit. They also reward returning customers, with incentives and earlier access to purchase tickets, which is great! But I can't get those unless I'm able to get tickets. I'm a BAM member and would love to move up in Alamo's ranks as well. So if you want to see a show and it's at a prime time, make sure you try to get your tickets several days in advance. \n\nOverall it's a fantastic place. I love it. I think it's gonna keep getting better and intend to update my review when it does. If not, it's still a good-great experience.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "This is the best movie theater in NYC. Ticket prices are average and you get luxury seating, high end service, and the best sound and visual presentation you could ask for. Not only is the projection sharp, more importantly its consistently bright and not dim lit. \n\nThe Drafthouse has a fantastic free membership point system that rewards you with special screening invitation, free admission, free food, and food coupons. It's a great way to make you feel good about returning to the Drafthouse.\n\nHouse of Wax is one of the coolest bars in NYC that also serves some of the best drinks. It's a very fun bar to bring friends and visitors from out of town to. The Drafthouse's drink and food menu is a dream come true. You will eat/drink extraordinarily well at your movie screening and the waiters are total pros who genuinely work to make your moviegoing experience an exceptional one.", "author": "Alec B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "Interesting place for the cinema, I was enjoy there with delicious food. Service was so fast and quiet for that atmosphere. I would like to go this place again.", "author": "Dilan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "We had a great first experience. The movie we wanted was almost sold out when we went to buy tickets and I was worried about having to sit in the second row, however, even if you sat right up front the screen isn't so close that it's right in your face. We arrived about 20 minutes before the movie started and our server was friendly and knowledgeable about the menu. Ordering throughout the film was easy and drinks and food arrived in a timely fashion. Pricing was reasonable as well, pretty much on par with bars and restaurants in the area. We don't live all that close but will certainly be back again.", "author": "Catherine G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Alamo Drafthouse has 3 rules.\nNo latecomers. Don't use your phone. No talking.\nSo if you're complaining about that, you have a problem.\n\nMy friend got there late (less than 5 minutes), but luckily they still let us into the theater. She had the tickets, so I couldn't go in.. but they weren't really checking tickets so I probably could've just walked in.\n\nThe seats were decent. They could be a bit wider though. I didn't realize the seats had cup holders until the movie was almost over. I don't think anyone used their cupholders in fear of knocking over their drink. Maybe build the cup holders into the table? The table was a good enough size to hold all food \u0026 drinks but should have more than 1 hook for a jacket and/or purse.\n\nOrdering food \u0026 drinks was simple. Write what you want on a card, but it on the rail, \u0026 someone comes to take it while you're watching the movie. There are lights under the table to see the menu, but it can be kind of bothersome because you can't turn the page under the table. I feel like there should be a little shelf to write underneath as well. It's hard to write in the dark.\n\nI ordered the Black \u0026 White Cookie White Russian Milkshake. It actually had a black \u0026 white cookie blended in it with half of one on top. Never had a milkshake at the movies before \u0026 the fact that it was spiked made it even better. The fact that I don't have to sneak liquor into the movie theater is amazing. I also ordered a Sprite, which turned out to be a weird tasting lemon-lime drink \u0026 it came in a huge glass.\n\nFood wise, I ordered a Margherita flatbread. It was surprisingly filling.\nMy friend ordered Mac \u0026 Cheese \u0026 Thai Wings. They ran out of Mac \u0026 Cheese though. The wings were ok, I've had better.\n\nThe only time the servers distracted me during the movie was when I thought they were coming with my food or drink, but they were going to the table next to me. I was really hungry lol.\n\nNext time I probably won't order restaurant style food because I like to see what I'm eating. I'm not gonna be the one putting my food under the table looking crazy.\n\nI wish I took pictures, but I didn't want to get kicked out for using my phone during the movie lol.\n\nI'll give it another go, with someone who will be on time so I can order early \u0026 check everything else out at the theater.", "author": "Rhonda A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-12", "description": "Servers constantly run around in front of you while you watch movies. I couldn't focus on the movie. Also, because they missed my order, I had to speak to them during the movie. Not a place if you want to focus on movies.", "author": "Miku T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-21", "description": "To be honest, I'm not a big fan of dine-in theaters. I don't like to be interrupted when I'm watching a movie in the theater. If I'm paying to see a movie, I want to experience the movie. Alamo is the second dine-in theater I've been too. Theaters have big, comfy leather seats, with lots of leg room. But, the seats do not decline, which is disappointing. The severs speed through isles hunched over, as to not block anyone's view. But I found they often needed to talk to customers, which was very distracting. People were summoning servers with questions about the menu in the middle of the movie. If they could create a completely paper/electronic process, that would be better. Overall, the theater is beautiful and spacious, but it's too distracting to be enjoyable for me. Note: they're very strict about not letting late arrivals into the theater.", "author": "Lauren W."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}