{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "WARNING!!! DO NOT buy tickets from Fandango for Alamo Drafthouse. My wife and I bought tickets for a 6:20 showing of Sing Tuesday night. I'm a fan of Alamo, but if you're late and denied entry like my pregnant wife and I did, Alamo cannot refund your money because tickets were bought from a third-party and Fandango won't refund you because of course, I asked for a refund after the fact which was past the showtime, per their policy. Granted, we were about to be brought up, but once the opening credits began, the employee got word to deny us entry. Because of that split second, we missed out on the movie AND lost our money. WHAT A SCAM!", "author": "Gordon C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-06", "description": "The food is terribly bland, the one at Yonkers is way better and cheaper and I'm not even foodie lol. They focus more on the drinks selection because they have more options than at the Yonkers location. The menu is also different more food options at Yonkers, you would think because it's a chain it would be the same. It's good if you can't drive to a better theater, it is decorated nicely. I'd go but not to eat", "author": "Rebecka B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "This place is the WORST of what Brooklyn has to offer. My wife and two young children bought reserved seats for the new Star Wars movie, and they went in while I found parking. Three snooty employees and the manager told my wife that they have a \"policy\" of not letting people thirteen minutes after the time on the ticket--though there was no such statement anywhere on the website when I bought them. (\"Thirteen minutes\" - really? That's a policy?) They would not refund the money to my wife, and the manager told my kids they'd have to decide whether to see the movie without their father or forfeit $70 worth of tickets. When I park and get up there, the manager and her staff told me alternately that (i) the policy was unofficial, (ii) it was Fandango's fault, and (iii) there is no policy. They refunded the tickets after we embarrassed them enough in front of other clientele for them to make us want to go away, but the whole ordeal was absurd.  (Note it was no accident that my wife--who is black--got cast by them as a \"crazy mom,\" and when I show up--a 6'2\" white attorney--they suddenly have the power to refund our money.) The staff is a silly mess of hipster racist jokers, willing to tell a nine-year-old on Christmas that she has to watch a movie without one parent, because they couldn't figure out how to handle a simple issue of their own making. Boo. Also, the last time I'd gone there, the theaters smelled like feet.", "author": "Thorne C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-26", "description": "I really wanted to like it. The no talking/texting policies are great, but it's just replaced by wait staff coming through with regularity. \n\nThe screen and sound are great, but the seats are directly from the emergency row of an airline. No recline and very stiff. \n\nAlso, there were was one very small bathroom for all the theaters and another small bathroom for downstairs. It wasnt enough. \n\nAlso, popcorn is $7 plus tip, so good luck with that. \n\nI dont really get why a quality movie experience is so hard.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "I've been going to the Yonkers location exclusively for movies since they opened. Since Brooklyn is easier to get to, I was really looking forward to this place. The lobby area is a bit small and the kiosks weren't working, so we had to get our tickets from the guest services counter, no big deal. I really like Brooklyn's photo opp area much more than Yonkers, so I had fun taking a few photos there. The theater themselves are nice. There are tables in the middle of every 2 seats, unlike Yonkers and some other Alamo locations that have a large bar across the aisle. The food was good, I got the pancetta mac and cheese, but I was a bit disappointed by the food options. There's not much there. No pizza, no burgers, no chicken strips, some adult shakes are missing. I'm hoping this is a bit of a training menu and it will expand soon, because while I liked what I ordered, I wish there was more to choose from. \n\nWe had no problems at all during our showing. The food came out on time and we received our 15% off discount for training. I had a great time today and I will sure to be back many, many times. I'm willing to be a bit understanding right now and hopefully they improve everything going forward.", "author": "Ronald G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "We've been to three movies here already.  We had really great service - quick and got everything we ordered - in all three. Loved the seats. Loved the movies we saw.  I have read some of the negative reviews, but we experienced none of these issues at all.  Give this place a shot!", "author": "Craig B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "This was an Ok experience. I like that the price is reasonable. \n\nThe seats are comfortable, but not wide and very close together (i.e. you're squished in). When the person next to you gets up, their butt is right in your face! I ordered food and won't do that again. My sandwich and fries arrived cold! I was not pleased. Plus, they were out of one of the cheesecake shake. Irritating. Also, if it's your first time there, it's hard to read the instructions. However the staff is helpful. I thought being served during the movie would be distracting but it wasn't bad. If I return I will manage my expectations knowing what I experienced the first time.", "author": "C. D. W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "I went here on opening weekend to see the Handmaiden. I was very impressed by the bar attached to the theater, with the House of Wax displays. They were very elegant and interesting. The theater itself was spacious and clean, and it was nice that you can reserve seats online. The menu seemed ok.  My complaint is with the wait staff. I was starving, and ordered food and a drink as soon as I sat down. Food started arriving quickly to all the people around me, but after about 40 minutes into the film, after I sat through all of my neighbors finishing their meals, mine still had not arrived. I rewrote my order and placed it in the rail for them to pick up. Three waiters passed without their picking up the order. My food never came and I ended up just walking out of the theater.  Get it together guys.", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Saw Rogue One here last night. It's going to be hard going back to other theaters after coming here. The seats are comfortable plus we had assigned seats so we didn't have to rush to snatch up seats as soon as the doors opened, the food and drinks are good (I had the cobb salad, \"The Dude's White Russian,\" and nice, warm chocolate chip cookies; hubby had a burger and a virgin peanut butter chocolate shake; and we both had popcorn), the aisles are set up so that you can get up and go to the bathroom without disturbing the movie for everyone in the row, and everyone--per the rules--was on their best behavior. What little I was able to see of the House of Wax (it was pretty crowded) was cool as well. It is a little expensive, but you get what you pay for. We'll be back; I'm especially curious about \"Terror Tuesday.\"", "author": "Patrice K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "My son and I went here to see GET OUT, the ticket prices were very reasonable.  The movie theater is very nice and clean.  Make sure you buy your tickets in advance because this place can get packed and sometimes the movie is sold out a few days in advance.  This is a dine-in theater so this is where you will spend most of your money.  The food is okay but you can't expect great food at a movie theater.   You have to leave a tip and I did not like that since you write your order down on a piece of paper, someone picks it up then just drops your food off.  No one comes back to check on you or to even make sure your order is correct, so why would you need to leave a tip.  This is my only negative but I would return.", "author": "Jewelle O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Awsome! Amazing food and service! The sound quality of the movie was off the chain!! I can't rave about this place enough to my friends. I was pleasantly surprised with the overall service.  Very professional and efficient. Worth every penny!", "author": "Kevlar T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "Server walked in front of my table during literally the last shot of the movie. Just...come on, guys.", "author": "Melissa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "i'm so glad this place hasn't been discovered yet because it is awesome.  went here on a wed night to see dr. strange and it was dead.  there were maybe 15 people in the entire theater.  \nwe ordered the tacos and quinoa tofu bowl...both were tasty.  we each got a beer from the huge ass draft menu and they came out cold and delicious.\n\nword of advice: get there early.  i was supposed to meet another friend there but apparently he was ten minutes late and was NOT LET IN!!!  he texted me to inform me that he couldn't get in, but i couldn't text him back because they also have a crazy strict texting policy.  you will get kicked out if you text.  \n\ngreat place.\n\ncome early and hide your phone.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "Nice theatre, sound quality good, food decent. Now the negatives-like other reviewers commented, the bathroom does smell and the cheese for the pretzel was very strange. It did not taste like cheese but had the smell of blue cheese and was very gritty.", "author": "Gene N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Very cool theater with great service. Snacks and drinks are good and they have special events regularly. Neighborhood isn't the best but it's easy to get to by subway.", "author": "Bern G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "There was a mixup on ticket times that was purely my fault, but Ethan was great and really accommodated us. Will be back! Thanks Ethan. You're the man. Swag style/hat", "author": "Sam C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-06", "description": "*sigh* I hate to do this as I love the premise and sincerely *WANT* to love Alamo Drafthouse... but wowzers - the past couple of times have been soooo disappointing. My movie partner in crime and I strategized tonight for a viewing of Guardians of the Galaxy Vol. 2 - ordering a drink at the bar downstairs and taking it to the theater with us to eliminate any ordering issues (delays) we've faced in the past. Roughly an hour in - no one had been by to take our order card. Wanting some popcorn with a round of drinks, I finally got up from our seat to hand deliver our order (which totally defeats the purpose of this theater). Absolutely no one was there. \n\nA quick bathroom break (where half the stalls were out of toilet paper and/or overflowing) later, I was able to hand the order card off to an attendant who was in the food/drink area. About ten minutes later our drinks and popcorn appeared followed immediately by the check - even though there was still another hour left of the movie. We would have ordered more drinks and food had we had the opportunity (it's a slightly longer movie)!!! \n\nWe thought maybe they had some kinks to work out in our first couple of visits - but this seems to be a clear theme where you get to order once at the very top of the movie (if you're lucky) and then signing for your check thirty minutes before the movie is finished. So disappointed in the service, and I almost feel as though I need to see the movie again (elsewhere) as I was so distracted the entire time looking for someone to come take our order.\n\np.s. the first time we went the popcorn was FANTASTIC! but each time we go, it starts to taste more and more like typical dry/overly salted movie theater popcorn. Super bummed...", "author": "Liz G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "Nitehawk on Steroids!  GREAT Amenities, this aint your 5 years ago, arthouse film/bar \u0026 grill.  BIG screens, BIG theaters, Cool bar to meet up in downstairs before the show.  This is what  Studio Square is to the Bohemia Hall.  Bigger Newer Nicer, yet you know a lot less soul.  The service is a little slower as you might expect as there are only two servers in a theater more than 5 times the size of the Nitehawk, so factor that in I guess.  If I could get tickets to both places for the same show I would still probably go to Nitehawk, but this place is a great option!", "author": "Juan Carlos R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "It's a great date spot: tables in pairs, comfy chairs and not as many people as a normal theater. We had a beer each and they brought us our check about 10mins before the end, so we were able to pay and leave as soon as the movie ended. The servers do walk up and down the aisles, so if you get easily distracted, you might not be able to enjoy the movie like you would in a normal theater. I would recommend booking in advance; we booked about 5 days in advance to get seats.", "author": "Haven B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Soft opening for loyal fans!  Alamo is not your typical movie theater they created an environment that surrounds you with die hard movie goers!  Everything about the space from the fantastic bar (House of Wax) to the theaters itself was spot on!  Prices and services are very reasonable.  Its about the movie enjoyment and while it probably won't carry every main release all movies are highly curated by the staff.  Will be back!", "author": "Jj L."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}