{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-26", "description": "I've been to Alamo Drafthouse twice now to see movies. I had heard a lot about how great the chain is so I was excited to get one in Brooklyn.\n\nThe theaters are great. The seats are super comfortable and the tables are a lot better than other dine-in theaters I have been to. Screen and sound were good too. \n\nThe service and food are where the lost stars come from. The first time I saw a movie there they were running a 15% discount while they worked out the kinks. I saw a 7:15 movie and the theater was packed. The drinks and food took a little bit longer but it was busy so I wasn't too worried about it. We ordered popcorn after we finished our flatbread (which was good) and our server picked up our ticket quickly, but the popcorn never came and we were still charged for it on our bill so we had to work that out with our waitress at the end.\n\nThe second movie I saw was a disaster service wise. I saw a movie around 2 pm and there weren't a lot of people in the theater. We ordered drinks and flatbread about 10 minutes before the previews started. The drinks (two colas) took nearly 45 minutes to come and the flatbread came about 5 minutes after that. Every time the server for the row behind us passed by, he would bang into the back our chairs which was pretty distracting. While eating the flatbread, we decided we wanted popcorn as well so we filled out a ticket for that and a refill on our colas. After 40 minutes, the server still hadn't come to pick up the ticket even though it was upright and could be easily seen and the theater wasn't busy. We saw the waitress coming by with the checks so we took down the ticket because at that point we figured we'd be getting the popcorn after the movie was over. But the check came about an hour before the movie was over which we thought was pretty early.\n\nThe theater itself is great and the food was good, so I still think it deserves 3 stars. I will probably go back for those things and hope that service is better next time.", "author": "Cameron A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I had an enjoyable time at the Brooklyn Drafthouse today to see Rogue One. Spacious and clean theater. The waitress took time out to explain the set up to me and was attentive. Decent food quality as well. Only con is that I would prefer to have my own table and not share. Overall great experience. No drama.  Adult crowd which fits my style. I like picking out my own seat before hand as well. They also had an after movie bar from cocktails too.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Time-square was too packed with people in the movie theater, therefore I decided to come here on Christmas to watch a movie... Best choice I ever made! I was an hour and a half early to the movie theater so I was able to sit at the waiting area nice and warm! As for the service, it was impeccable, the front desk person was friendly, and the food I ordered came out quickly, the movie started on time, and the waiter was very attentive to the needs of ALL of the people watching the movie. I would absolutely come here again!!", "author": "Kelly D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Alamo Drafthouse... Hands down best cinema on the east coast. Anyone who gives it less than 5 stars is an entitled douche that can't see a movie without texting. After suffering the substandard projection at Williamsburg Cinemas this place is a Godsend. They know how to present a film, show actual quality new releases, cult classics, rare 35mm, and the 19th century morbid wax museum is genius. Staff is on point and genuine. Best of all - use your cell phone or chat? One warning before management kicks you out with no refund. Plus no admittance once the movie starts.  YES! Finally a cinema not full of inconsiderate a-holes! Go to an AMC if that's your thing. Glad to finally have a place where I can actually experience a movie minus the crap.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Phenomenal. Absolutely incredible facility, staff, food, and drink. I've been waiting for this theater to open for a while; it totally exceeded my expectations. I will undoubtedly be here over and over again, and I can't wait.", "author": "Jordan O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Stopped by on Friday night to check out the bar. The cocktails were fantastic, and the service was better! The bartender on duty recommended several delicious beers my boyfriend loved, and she told us all about the collection. \nAlso the music was killer, great vibe. \nMost fun I've ever had in a mall. Will be back!", "author": "Alison S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "This place is HUGE and beautiful. Went a few days after they opened to see Moonlight. We had to wait forever to get out drink order and then our snack came halfway through the film. The server dropped off our check near the end of the film but never picked it up to run my card. We had to stay over half an hour after the movie was finished while they ran our check and weirdly they were still serving customers after the film was over and they were doing the LOUD and annoying sound check for the next showing. They were giving 30% off all food while they ironed out their service, which is kind but they obviously have a long way to go. Seems like they are understaffed and under managed. The queso was not good, the chips were stale and the soda was flat. :( All in all a poor experience in a beautiful new theatre. I hope they can iron out their service and kitchen issues.", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "This place could use some work. The whole concept seems like a match made in heaven but there are some flaws. First of all its expensive a hell. Movies in general are super overpriced but really it would be easier to just go to a regular cinema and bring food in from outside. The chairs were very uncomfortable. The food as expensive as it was was just blah. I ordered a steak sandwich and the steak was like jerky. Pretty tasty jerky but jerky nonetheless. My fiance got wings which were also tasty but fried hard as hell. They had boozy milkshakes that our friends ordered but I didnt get a chance to sample it. Looked good on paper. The screen was huge and the sound was amazing. It was cool having a table that we could order food from. The ordering process was pretty interesting but when they brought out the checks it was when the movie was about 75% done and it was a bit distracting trying to settle up your bill and pay attention to the movie. Our waitress was a bit of an ass. I wanted to post her name in this review but decided not too. The beer I ordered wasn't available and the reason we were given was because and I quote \"Donald Trump is president\". First of all *bleep* donald trump but forget all of that. Just say you ran out of the damn beer. There was all types of mixups with our order. Several items we wanted they ran out of. All of this while the movie was going on. Very distracting. Seeing as this place is literally 1 min away from my job I will be back. Hopefully a better experience will be had.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "My favorite go to theater. Like their mix of commercial and indie/arthouse offerings. Yes it is pricey but very worth it for the viewing experience and food. Not used to theaters with comfortable seats and a menu beyond popcorn and candy. They also gave great customer service. Was late to the movie I wanted to see so they offered me with a choice of a refund or exchange for another viewing. I chose a different movie but there was a non-serious fire drill out of all things during the movie so the staff offered us rain checks so we can see another movie free of charge and the food everyone ordered that time was free! I love the food selections. Both Thai and hot wings are good, different levels of heat. Had the burger and fries and chips and queso on multiple occasions. Only thing I didn't like was the pizza flatbread (over cooked) and the edamame hummus with wonton chips (interesting on paper but... no). Drinks was great. Favorite is the tangerine Riesling. OMG I can't stress enough how awesome that drink is. It's basically a milkshake with Riesling, vanilla ice cream and I think some orange extract for that citrus note and a tangerine peel for garnish. Very refreshing. Again, pricey but worth it.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "They are still getting their act together. They were out of more than half the menu items and one of them they said they still had and so we ordered (Mac and cheese) never came which was left off our bill but never mentioned. The picture quality of the screen was amazing and the theater was clean. But they have a LONG ways to go to get their operation together. Might've preferred a regular theater, didn't need the suspense of waiting for food that was never gonna come.", "author": "Benjamin D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "First off, I went ON TIME with a group of 10 to watch my movie and the​ evening was ruined when I arrived at the theatre just to see another party was there earlier than us and sitting down in our seats. We went downstairs to guest services to find out what happened and apparently this party was supposed to come in tomorrow night to see this movie and was seated by the workers who DIDNT check their tickets. And I guess they couldn't move that party for some odd reason even though they were in OUR SEATS. They split us up into 3 different groups and seated us randomly throughout the theatre and gave us a voucher for the mix up.\n Still I was ready to get over it. I brought cookies to eat which was, i admit wrong, but SOME WAITER walks up and rudely snatches the cookies from my hand without politely asking me to put it away. And then, he waves the menu up in my face saying no outside food. All you had to do was politely ask me to put my food away and I would have done it. It's not like I was going to refuse and continue eating! He then goes on to tell me after being SO RUDE  'you need to be quiet because people are complaining about you and your friends'... ABSOLUTELY INSULTING. We didn't say a SINGLE WORD since entering - I was busy trying to catch up with the story because of YOUR screw up. Now we were just sitting there confused as to who was actually complaining (not our neighbors, we asked them.) Thanks to this despicable waiter for ruining whatever evening we were trying to salvage from this theaters screwup.", "author": "Erica K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-24", "description": "This place is a disaster. The theaters themselves are nice, with comfortable seating and great sound/picture quality, but unfortunately, their wait service couldn't be more distracting. Throughout the movie, we had waiters approach us four times with food we didn't order. Each time was more irritating than the last, totally interrupting our enjoyment of the movie. Honestly, as annoying as texters are during movies, I would've preferred to deal with that over the Drafthouse staff. \n\nI contacted their management and never heard back about this problem, so apparently they don't care. It's a shame because we could've used a nice theater in the area.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-03", "description": "I guess I'm a purist when I see a film.  I want my concentration on the film and don't want the distraction of waiters running all over the theater and people eating and drinking around me.  The theaters are lovely and would be terrific without all the distractions. Besides that, the food we did order was terrible.  Soggy stale popcorn, an inedible edamame dip and uninspired margarita flatbread.  And it's not cheap.  I will not be returning.", "author": "Tom B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-21", "description": "Tried to see a movie and was 10 minutes late. I had aisle seat tickets. Despite that, was refused entry. Like, I get you have policies against people showing up late or texting during a movie, and I respect that. But seriously, being turned away for being 10 minutes late was extremely upsetting and ridiculous. We could have quietly and politely found our seats in the aisle, and it wouldn't have been an issue. It's not my fault I had an uber driver cancel on me last minute, causing my friend and I to be late in the first place. Also the dude at the desk giving me the \"we've had this policy for years\" lecture didn't help either. Not only did we not get to see a movie we've been excited about for years (the new alien film), he was also condescending and rude when he turned us away. At least I got a refund, but the whole experience left an awful taste in my mouth. There are plenty of other movie theaters in NYC to spend money at without that kind of awful customer service.", "author": "Alxndr K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-03", "description": "If you want to sit back and get carried away in the movie - ALAMO ain't the place. All I remember is the silloutte of the \"waiters\" spikey haircut throughout the movie. Firstly, They DO make it clear: Do not arrive late, Do not use ur phone or u will be asked to leave, they repeat NO REFUND.  Kudos for trying to resolve the issue of cellphones and disturbances in theaters. Cool. But WTF?  Now a waiter walks the aisles throughout the movie!  There is a light constantly on at my feet so people can pull out a four page menu, reorder during the movie?!  Then to pay, 30-40 min. Before the movie ends (otherwise known as the movie CLIMAX, or in a quiet movie the BIG TEARJERKER OSCAR WORTH SCENES- a bill is passed around to every table and you were supposed to pull out your wallet, find ur credit card and leave it on the table.  I insisted to wait to pay until the lights came up so I could enjoy the movie, which was the reason I came, not for the 4 page menu. The waiter stood in front of me til I paid. I went to the hallway to not disturb others.  Also popcorn served in a big metal bowl on the table?  Hard to share and again, loud! In quiet movies. Just way overthought this place.", "author": "Felipe U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-03", "description": "I lived in Austin for 8 years and love the Alamo concept. I was psyched to see them come to my hometown! But the BK location is still working out some kinks. I've visited twice, and both times the service was very slow. Getting just a beer took about 20 minutes (didn't order food that time). During my latest visit, the ticket machine was having problems, which led to me getting another person's ticket by mistake.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-10", "description": "Was 10 mins late and they wouldn't let me into the theater. Despite it being almost empty on a Monday night.", "author": "Krista K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-26", "description": "Came with my little girl to watch Sing. Wanted to experience the dine in feature cuz why else would you pay $15 a ticket?! Well, as I sit here waiting for over an hour on my food, after asking 4 different times to two different waiters as to the status of my order, I get shrugged shoulders and your order is coming out now. Well... still no food. I approach a waiter outside of the theater room. After asking again for the status, he has the nerve to tell me to lower my voice out in the hallway, as not to ruin everyone else's experience. Ohhhh, so ruin mine and my little girl's. Ok, jerk. Ummm, the entire theater has been served, some even a couple of times and we're still waiting. 20 minutes left to the movie and I cancel the order. 2 mins after that, the waiter comes out with our order and says free of charge. Thank you, but no thanks. My little girl is upset now and needless to say, hungry.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Extremely impressed. Went to a matinee that is designed for families with babies. The food was excellent. There where about 30 craft beers on tap as well as quite a few in bottles/cans. Seats where comfortable and the waitstaff (you have a waiter that comes to your seats/table) was friendly.", "author": "Paul F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-17", "description": "As I sat watching Get Out my movie was interrupted mid climax for a fire drill. After fire drill was over they couldn't restart the movie due to malfunction of the projector. They made us sit in the dark for over 20mins plus and movie still did not start. They tried to resolve the issue by giving us vouchers to return but I REFUSE!!! Horrible experience!!!", "author": "Natalia B."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}