{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "This is one of my favorite movie theaters! Its located at the top floor of the City Point building which houses a Century 21, Target, Trader Joes and Dekalb market food hall. I usually purchase my tickets online and you get to pick the seats you want. I love that its a smaller theater, sells alcoholic beverages and has an actual food menu. And best of all, they kick out obnoxious talkers after 2 warnings. This place is great!", "author": "Tina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "I used to go to the movies at least once or twice a week at the same Regal or AMC, but since I moved to Brooklyn I haven't been able to. This movie theatre is the place I will ALWAYS go to see a movie from now on, even though I get discounts to Regal and AMC. I didn't even know they had a loyalty program (which seems awesome and totally do-able) that gives you birthday gifts and invitations to screenings. Too lazy to do a comparison of these three loyalty programs, but will definitely research it. It's $15 for a ticket, which is about the same as Regal/AMC, but you get a ton of leg room (since there needs to be space for the servers to walk by) and comfy seats, and of course the whole amazing experience.\n\nWhat I love about this one is that when a movie is booked and you gotta wait for the next one an hour away, you can just hang out at House of Wax, the bar that's literally right there. And it's an awesome and cozy bar with great music. Most of the time if a movie is booked, I just give up on trying to wait. But not at this Alamo. \n\nI also love that when you're waiting for the movie to start in the theatre, they're not showing you boring ads or movie trailers (OK some are interesting), but clips of random shows/movies/videos that are related to the movie (like when we were watching La La Land, they had random clips of musicals and things about musicals, and when we were watching Rouge One the \"please don't talk\" memo was played out by an angry Darth Vader who was kicked out of the movie theatre for being a nuisance with his light saber) . Really retro/Adult-swimy kind of theme if that's the best way to describe it. Everything about this place is super modern and not like any other movie theatre that you go to growing up. \n\nThey also claim that even when you're stuck with the first row of seats, they make sure that you're still able to watch the movie and the first row is at least 15 feet away from the screen. I love how they emphasise that they want to give value to their guests. (But TBH, the first few rows are still way too close for me.) The screen seems HUGER than usual, too. \n\nEven though the whole point is the dining option available, I honestly am really turned off by the menu prices and ended up bringing in my own food - ONCE. It's an awesome date option or if you want a fast date packed all-in-one with dinner, movie, and drinks at the same time. I've tried their sliders for about $13? but it was incredibly small and there was a tiny piece of plastic I was chewing on for a bit. I do wonder how they make sure their food is OK when it's so dark inside.", "author": "Kale H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Love everything about it, from the carpet design to the posters on the wall and the bar on the main floor. Great ambience. Watched a restored/ improved print of The Dragon Lives Again last night and the food-drink service was on point. The seats weren't crowded, ample space in between for leg room and the screen-sound were great. Theater personnel were extremely courteous and welcoming. Victory membership ftw.", "author": "Piraan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-10", "description": "I have been waiting to come to Alamo Draft House for 3 years now and although my first experience was pretty mixed... I still plan on coming back and am looking forward to a smoother experience in the future.\n\nPeople, before you come be prepared to encounter a number of issues. I am not really sure why there are so many problems still? But, I appreciate that they are currently offering 15% off food and drinks while they are experiencing so many issues. \n\n- Theatre was hot (though I personally didn't mind, others were very unhappy)\n- Food did not come until the move was almost over \n- Staff was not super attentive to orders being placed\n- Food/Drink prices are pretty high...\n\nPros:\n\n- You can freaking DRINK in the theatre - YES! And they have a large selection of local beers! This is a dream, really. \n- Everyone working here was actually really kind and helpful. Also, it seemed the people on staff here are actually passionate about films - it was quite a refreshing experience.\n- Themed Movie Experiences - There is a screening experience where you are invited to yell at the screen, there are Terror Tuesday screenings, etc. Check out what they have going on online, it's pretty sweet.\n- Rewards program", "author": "Stephie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "I agree with Sean C. I love the concept of the Alamo Drafthouse, love the no texting, no talking policy, the reserved seats and the comfy lounge chairs. Five stars for those things. Two stars for the crappy food and crappy service. Most recently last night, I ordered the (actually good) pineapple cucumber drink. Twenty minutes after they delivered my husband's cocktail and our seriously forgettable, tasteless lamb and brisket burgers (cold fries? no thanks), my drink finally showed up after I was able to get a server to come over and I passed him a note. I didn't want a conversation during the movie, just wanted my drink. On a previous visit, they double charged when they brought the check, and when I wrote a note to the server, they stood in front of me to discuss it, AGAIN during a pivotal point in the movie. Ugh.  The flatbread pizza is typically served right at room temperature.  The fried pickles aren't bad.  Chips have been too salty both times.  Popcorn is fine. Thank God.  It would be great if you could place your food and drink order ahead of time but there's neither rhyme nor reason to who gets what, when.. No matter how early I get there, waiting for food takes forever, and it's not worth it. Do yourself a favor and go to the DeKalb market stands either before or after the movie. Food at Alamo is seriously overpriced for the quality.", "author": "Finola K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "My friend and I came here to see \"Lala Land\" (great, fun movie!) and it would have been a four-star experience BUT we didn't get any water, despite asking for it three separate occasions. Although we ordered and got our food without a problem, the staff/waiter seemed averse to bringing water. They didn't give us an explanation as to why, or ask if we wanted to get bottled water instead--nothing.\n\nOther than that, the food and drinks were pretty good, though pricey. My non-alcoholic cocktail, Ginger Berry Cooler, was probably only about 3-4 oz, cost $8, as much as an alcoholic drink. My Brooklyn Brisket Burger was pretty big, but kind of dry. The fries were good, but oversized, as per typical American portions. Their menu is pretty creative, though, what with Sriracha Popcorn, Edamame Hummus, and so on.\n\nThe tables, shared between two comfortable seats, were pretty small, so it was hard to squeeze both of our plates and drinks on it. I love the concept of dinner at the movies, and would love to go back and hopefully have a better experience. I wish there was something like that here in Tokyo.", "author": "Peggy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "The concept is amazing, the drinks really good, but unfortunately what really spoilt it for me is the service - particularly a blonde guy with a ponytail in theatre 6 (we watched Beauty and the Beast). I can't review the food here because I never received what I ordered. Also, their \"strict\" no talking rule was not enforced, making me wonder why I paid the Alamo premium at all. \n\nWe entered the hall 20 min before show time and attempted to place an order. There was no sign of a waiter even 10 minutes after the show began. My friend finally managed to flag down the ponytail waiter by waving frantically, who then came by, barked the rules at us, and took the order card. He then forgot to bring one of the items (water) we had asked for. So we put up another card up with the water request and our food request. This time, the water arrived but our food did not. \nI was not happy at all with going hungry and spoke to a different waiter (a nice lady) at the end of the show. She apologized and spoke to the manager, who sent us two comp passes through the ponytail waiter at the end. Ponytail handed us the passes without once apologizing or making eye contact... making us fume again at the rude service. \n\nI love Alamo in other towns and this has never been my experience before. Really sad as I live just a few blocks away.", "author": "Sruthi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "What a difference a few months make. No longer do the servers interrupt the movie. No longer does the food come out 5 minutes before the credits, on top of it being cold and dry. Once I saw our server do the proper ninja/roadie run, I knew that all these problems had seemingly been fixed and it looks like the theatre is up and running swimmingly. Kudos to the management for getting their shit together!\n\nP.S. Get the Thai chicken wings. Absolutely delicious.", "author": "Ahnmin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-14", "description": "The food was not that great. The cinema is small and intimate, not bad but I like bigger cinemas. My drink was good. The place was clean overall. I'll try something else in the menu if I come back", "author": "Jenn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "The Alamo Drafthouse is a movie theater that also serves drinks and food to you as you enjoy the movie. They take their movie watching very seriously, with big box shows as well as indie and throwback films. They have custom previews for each showing and encourage film lover's fan service with lots of nerding out over trivia and inside jokes. Ticket prices are pretty affordable for New York City, however, the food prices are marked up a bit to make up for how nice the space is and the incredible service you get while you're here. I feel a little bad for the waitstaff as they have to literally stoop as they scurry past, which has got to be insult on top of injury for doing so much table running. Alamo also has a strict no talking or texting policy, and they have a system for you to rat out the loud mouths and get them booted from the theater. \n\nI've been twice so far and really enjoyed the cushy experience. I love to get a shake here as the long movie can be broken up by the decadent dessert that I feel too guilty to order when the lights are up and I can't finish over the course of a full meal (the cookie one is delish!) The wings are okay, albeit very very messy to eat when you can't see. The burgers are solid and come with lots of fries -  I notice a lot of people don't finish the platters. The popcorn size is GIGANTIC - its an aluminum mixing bowl about 12 inches across, it has to be about a gallon and a half of popcorn. Again, I have never seen a patron finish their popcorn. The kale salad with orange is actually really good, albeit a bit hard to eat in the dark. You cannot go wrong with the queso and chips - its probably my default order at this point. I noticed on my second and third visits that they ran out of items on the menu, and then you have to have an awkward whispered conversation with the servers during the movie, which defeats the purpose of the cards and everything. My last trip here didn't have any mishaps - things seem to be ironed out at this point! I am noticing that tickets sell out faster now, so I really encourage you to buy tickets online as far in advance as you can. Showing up and hoping for a seat may not work for prime times.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "This is my first dinner theater experience in the city, and I have to say that I pleasantly enjoyed my experience! We watched Atomic Blonde, but the review is more about the theater and not the actual movie so I won't get into that ;) I wasn't super hungry, so I ordered their chocolate milkshake with Cocoa Puffs and cereal crumbs, and boy was that delicious! One of my only complaints is that we weren't able to get the seats to recline, which would have made the experience much more sweeter! The seating was comfortable and the ambience and projection screen was great! So overall, if you live in or near Brooklyn, this is a nice, casual, cozy place to watch your movies!", "author": "Neal S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I don't know if I can ever see a movie elsewhere ever again.  The no texting or talking rules alone make it worthwhile.  Great app, reserved seats, table service.  Perfection.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Some of these reviews are all over the place, and I get it - it just opened! I went for a screening and due to it being new, we got a half price ticket, 15% off our food order, and our waiter gave us a headsup about things being a little hit and miss with the kitchen speed and apologized in advance.\n\nThen, before the film, an employee came out and welcomed us and again asked us to bear with them as they train employees, figure stuff out, etc. \n\nI'm not sure you could ask for much more of a brand new place when it comes to acknowledging their issues and giving fair compensation for it.\n\nGiven that, I don't want to dock any stars because of the small things, like the fact that my salad did take a while to arrive, because in the end it was fresh, tasted good, reasonably priced, and the portion was more than I could finish. \n\nAs everyone else notes, the facilities themselves are awesome, spacious, and super clean. The sound system is incredible and I may be the best in a theater I've ever heard. They also seem like they're going to be playing a lot of interesting films and series so that'll be nice to look forward.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "I'm used to the San Antonio Alamo Draft House. This is not the same.\n\nSA was more grass roots/indie style evenly mixed with A-list blockbusters. For better or for worse, this draft house has a more corporate feel like Regal or AMC theaters.\n\nNot a huge fan of online ticketing and assigned seating, but it does take the long lines out of the equation. Seats are more comfortable and recline with lots of leg room, but they almost have to recline if you're sitting in the first row. Food is way overpriced for what you get.\n\nIf you don't live in BK, I recommend parking that car and getting on the train. Parking is impossible in Downtown Brooklyn.", "author": "Joquanna W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "I've been to a number of different locations throughout the US, including Westchester, and I'm just not impressed with this location. I love the concept and i'm literally across the street so it's super convenient but I always end up leaving wishing for more.\n\nThey've definitely improved since opening (our first visit, it took three orders to get water, one item never came, and one item came cold). The hummus  platter is amazing in Westchester but just ehh in Brooklyn. The jerk chicken sandwich was all bread. The chicken Caesar was way over-cooked and dry. The cookies are great and there's a vast beer selection. Staff should know what drinks they are delivering, not just identifying them by \"this is the dark one, and this is the light one!\"\n\nThe bar is also pretty cool and has love music if you have time before or after a show.", "author": "Victor T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-05", "description": "I was excited when I heard that the Alamo was coming to the area and well...... I'm glad I got that over and done with! \n\n1st: the bathrooms were disgusting! Unflushed toilets and a smell that just won't get out of my nostrils! You figured for the style they were going for they would of had a bathroom attendant and as many people that pass through they'd have at least a damn bathroom spray every once in a while. \n\nTheater 5: the chairs are way to small, hard, and uncomfortable! This is where I think you 100% missed the boat on the design, NO RECLINING CHAIRS!!!! And this is where you have lost me as a consumer! When I watch movies, I love to be able to sit back and relax, kick my feet up,and snack. Did I mention the seats were uncomfortable?!? I walked out of there with my back and knees killing me! Horrible design flaw! \n\nFood: pretzels and beer cheese - that cheese is the most foul thing I've ever tasted! Where the hell did you order it from! I've had beer cheese before but that crap was nasty as hell! \nSteak tacos- not to bad but wish someone would of learned to make real pico de gallo. \nPopcorn- a little on the stale side but not bad. But they should of brought salt for those who may want more on the side. \n\nDrinks: weren't bad at all! Which was a nice change. \n\nAlso be warned: THERE IS NO PARKING!! All the old Parking garages have gone away, and I don't know how you open a center like that with no parking! Yea I get it, it's Brooklyn blah blah blah and trains blah blah blah! But this was a late night showing and cold as hell outside! But seriously, they need a garage and one that you have to show a movie ticket to be able to park and one for all the other shopping you can do in the area! And Parking is a joke over there, meaning you have to move your car by midnight. \n\n\nWould I come back ...... nope! I'll still to my AMC THEATERS with reclining chairs, perks, and comfortability! Sorry Alamo Draft House!!  Two thumbs  down!", "author": "Mieshie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "This theater is great. There could always be more space, but hey, it's New York. The staff was friendly and helpful. We ordered the queso, strawberry cheesecake milkshake, the margherita flatbread, and a cola. I'm a fan of the queso- decent portion and has a little kick to it. The margherita flatbread was like a cracker with some chopped up tomatoes on it..terrible especially for the price. \nOh, and they don't have sprite. I may be the only one that cares, but I was disappointed in that. I will definitely be coming here to see movies more often, and now I have a better idea what to order.", "author": "Loren M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Went for their test opening. They definitely have some kinks to workout but the space is amazing and the drinks are great. I really like how focused they are on the films and retaining the experience of the movie theater. Oh and reclining seats!\n\nWe were a little underwhelmed by the chicken sandwich but the kale salad was actually great. Will have to try it again to get a better feel.", "author": "Drew H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "This place was the best experience I've ever had a movie theater! It was spacious, the seats felt great, no one's head was in my line of vision; I LOVED IT!  Even the staff with their ninja like skills got our order and was booking it to get to all the other tables that were in our row.  \n\nI didn't feel like we waited long to get our food, I would only say that my only issue was the way things came out. Selfishly I was kinda expecting a restaurant like experience and THEN a movie experience. Like getting your drinks, then apps, then entrees and then dessert. While it all came out (and yummy AF), cookies, then drinks, then apps, and then entrees. Just a little pet peeve but nothing to make you not pop over at this place at least one in your lifetime!\n\nAlso, their NO TALKING POLICY was most appreciated! Even when the waiters needed to speak to us, it never disrupted my experience at all!  Will totally go again! BTW, I thought the staff was extremely pleasant and lovely!", "author": "Danielle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "This is the best movie theater experience, ever. I don't care. It's an actual fact.\n\nWe have been waiting for Alamo to open for what seems like forever. After a few delays, it finally arrived. We ordered our tickets (to see Moonlight - also, highly recommend) online about a week in advance. They were running a promotion for a discount on food orders (I think because they had just opened that week). \n\nThere is no need to stand in a line when you buy online tickets, you just go right to your assigned seats, which is really nice. The seats themselves are those comfy recliners that they have in the suburbs. Also, worth noting is the lobby carpet is from the actual set from the Overlook Hotel in The Shining. We ordered much too much food We both had dinners, plus popcorn and drinks. In retrospect - either sharing a main course and popcorn would have been adequate. I got a dark and stormy, it was huge and delicious, I did order another, but it never came (we weren't changed however, I attribute this to just opening and the servers learning the ropes). \n\nI love that nobody used their cell phones, not even to text. This is a theater for cinephiles. You will be ejected if you are disruptive. I can't even express how nice this is. \n\nTL:DR We cannot wait to go back here. We already have tickets to see Star Wars and we're taking our friends. So grateful Alamo opened up in Brooklyn!", "author": "Lauren G."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}