{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Terrible experience, with very rude and unprofessional employees. I had (3) seats reserved and purchased on fandango. We get to theater 10 min late (previews were 8min) and we're told we were not allowed in when the feature starts. \n\nGentlemen told us this has been a policy for over 20 years even though the location has been opened for a year. We we're directed to concierge when they rudely told us the sign is on the doors (the sign that I can't see until I get into the theater). Also it's on their website, a website I never visited since I always purchase my tickets  through fandango. Then he goes and tells me they did everything they can to notify me that this was the policy, ok so...you have a sign I can't see until I get to the theater, a notice on your website that I never visited and the best yet a notice they told fandango to post which is not posted.\n\nI will never go back to this theater again. This should have been avoided, what poor communication and terrible customer service. \n\nI did not get to watch a movie that I paid for and was talked to and treated terribly. \n\nSkip this theater, there are so many better ones with employees that treat you better.", "author": "David E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Do you ever feel like the world does things specifically for you?\n\nI went down to Austin last year and walked by the famous Alamo Drafthouse. But it was the Austin Film Festival, so I didn't have time to stop in for a movie.\n\nLo and behold, I find out a few months later that they were bringing the Drafthouse to Brooklyn. Wonderful. It must've been because I watched the movie \"Brooklyn\" when I was in Austin. That makes sense, right?\n\nAnyway, I usually hate dine-in movie experiences just because of how crappy you feel after eating a big meal and sitting for 2 hours. But I quite enjoyed the Alamo.\n\nIf you buy online, you get to choose your exact seats, which is great. We chose the row behind the handicap section, but that was probably a mistake because that's where the waiters/waitresses and food runners travel through. Some of them duck down and try to get out of your way, but some of the people are just way too tall or can't be bothered. So maybe go one row up and one row down.\n\nIn terms of ordering, it's pretty simple. You have some cards and a menu. You write down what you want and then stick the card in a slot in front of your seat. Then they come take it, and food magically arrives 15 minutes later. Seamless.\n\nI had the brisket burger, which was pretty damn good. It also came with soooo many fries. My only complaint was the single serve ketchup containers they give you. They suck to open in the dark and aren't nearly enough ketchup (especially if you want some on your sandwich as well). And if I had to give them a tip, they should invest in wet naps for the guests as well. Nothing more annoying than having greasy fingers for and hour and a half.\n\nBut anyway, they have a great beer selection here, mostly local crafts.\n\nSo definitely give Alamo Drafthouse a try. True story: you might run into Chuck Schumer in your movie theatre, bodyguard in tow.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-27", "description": "worse experience ever i had in a cinema！ IDK who came up with the idea of mixing a \"restaurant\" with a movie theater, I brought a couple of tenders into it and got confiscated, there are always servers running back and forth in the cinema which is really distracting, a theater should be a place for people to relax, but at here I feel like I'm being supervised lmao. Didn't even finish the movie because I don't feel like staying here any longer.", "author": "Zhanqing X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-30", "description": "My partner and I just finished our first movie at Alamo Drafthouse. We saw Halloween, a warm up for our anniversary evening, what we thought would be a fun and spirited way to kick things off. \n\nI'll say this; the theater was great, as was the service, food and drink. However, we felt much less so about the clientele. We understand and it was reiterated that there was a no talking policy. We get it, it's a movie theater, no phones and no conversations. Aside from gasps, \"oh my god what is she doing\"'s, and food ordering, we adhered. However, our very passive aggressive neighbors decided to take the time to write on an order card that we were too loud, give it to the staff, have them take it back, and then come back to tell us there was a complaint that we were too loud and to please keep it down... but, with the idea in mind that people are actively ordering food and drink throughout a movie, some degree of small conversation is inevitable. And forgive me, but missing a couple words of Jame Lee Curtis' dialogue about Michael Myers probably won't cause you to lose the plot... then again my partner and i are highly intelligent and i can't speak for the rest of the seemingly aged, entitled, passive aggressive hipster clientele.\n\nYes, it's important to be respectful at a movie theater. But, if you're looking for complete silence during a horror film your best bet is to stay home. If you're looking for silence during any film, don't sit in the middle of the theater; especially next to people when you can choose your seats. And if you're so miserable that you can't take the stick out of your ass for 2 hours with the 15 other people in the theater to laugh a few times and not pass notes like an 8 year old, please re-evaluate your life.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "Movies, comfort food and a strict no-texting rule are great highlights from the brand spankin' new Alamo Movie Theater. Now, let's deconstruct in practice of this new mega movie theater in downtown Brooklyn.\n\nThe building is new construction so these theaters are large stadium size with a table between two semi-reclined seats. This is not the smaller intimate Williamsburg Nitehawk Theater screens. Larger screens are great but how does that work in practice in the service black hole of New York City.\n\nIn our movie, Rogue One, we were in the third row so it is difficult to say that there was not texting but there was definitely a clear message of a no texting zone. The only major issue was the baby which was crying for two longish spells in pivotal scenes in the movie. On Sunday and Wednesday before 12-noon, the Alamo is open with their 'Alamo for All' movies for all which means that people can bring their babies. I did write feedback into these regards to the Alamo which did assure me that this is their policy. I guess if you steer clear of matinee movies on Sundays and Wednesday then you will be okay.\n\nThe Alamo is still new so there are going to be growing pains but there is a bait and switch feel in the sense that I specifically sought out the Alamo brand because of their no talking style and there is this Alamo for all.\n\nFor décor and overall experience minus the crying, it was very good. The food is not amazing but you are in a movie theater. We stayed with appetize, popcorn and a shake. The popcorn bowl was large and good. Upon request, you will be served water with large cups. Our server was very helpful overall and there was no issue with ordering. For ordering, you write everything on the sheets and leave it on the bar. Our food came relatively quickly. We ordered\n\nFor the full food order, we got popcorn with Truffle Parmesan Butter§ $9. The truffle butter was worth the extra dollar. We had three appetizers; Fried Pickels with Buttermilk Ranch for $8, Thai wings with celery, carrots, blue cheese dressing for $12.50,  and Baked Pretezels with Brooklyn Defender Beer Cheese Sauce \u0026 whole grain mustard for $9. All the appetizers were good. I liked the fried pickles and pretezels were easy to eat in the dark. The Thai wings were tasty but it is not the easiest to eat in the dark. Finally we finished with a Strawberry Cheesecake for $9. The shakes can be made with alcohol which is fun option.\n\nSpecial note for the Star Wars Rogue One screening, there was a special menu which was stated to be inspired by the tropical climates of sunny Scarif. I really like that they would have a special menu for movies.\n\nFor the overall experience, I would hope the Alamo staff will work to earn their reputation as a good place with quiet text free and noise free screenings. The location can be great but it is about the complete experience.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "I won't lie, this place has ruined all other movie theaters for me completely. I've been spoiled by Alamo and I refuse to go back to crappy movie theaters! \nThey love movies, they are purists just like me. No talking, no phones, no lateness, no nonsense! THANK CHRIST! \nThe staff goes out of their way to make sure you have an amazing time. The location is awesome, super funky House of Wax bar downstairs, incredible food (tacos, pizzas, truffle popcorn, sandwiches, milkshakes, and everything in between, all insanely delicious), comfy seats, fun programming before each feature, it's just an absolute joy!\nI literally have a blast every time I'm there. \n\nOh and a full bar with movie-themed cocktails and just about every beer under the sun. It's heaven on earth :)", "author": "Megan O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-24", "description": "Staff, more senior staff, was seated next to us for the entire show and talked loudly throughout the screening while ordering numerous drinks and food. It was only until they ledt did I realize how noisey and disrespectful they were, on the clock relaxing amongst paying customers...", "author": "Deven B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-04", "description": "I've been here a few times for various exclusive private screenings. Tonight when I attended it in ordering there was a problem with the server I asked for a simple thing. A glass of Water. I asked for it right when I sat down and then wrote in on the order card again after the screening started everyone else had what they asked for. I didn't go to staff or management because I didn't have the servers name or employee badge number. I hate to sound snobby but I do in fact part own 2 restaurants so I'm very sensitive to how a dining service is supposed to run and how to do it properly. I also didn't say anything because once the screening had started I didn't want to talk and quite literally make a scene. Yes I realize that I'm coming off a little strong but I was really thirsty", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Stop, look and listen up. This place is my new favorite activity. Great movies? Check. Delicious food? Check. Super friendly and quick service? Double check. \n\nSit down, write your order on one of the cards in front of you and set it up for someone to swoop on by and exchange it for all the foods. Yes, I said all the foods. \n\nI've been here twice, both in the same week, because tacos. I love tacos, but sometimes tacos don't love me. The tacos here though? Holy guacamole Batman! So so sooo yummy. Full of flavor, jam packed with meat and fillings and those corn tortillas are warm and soft and all things wonderful. The best part? No one can see me dropping food on my shirt, dripping sauce down my chin or shoving chunks of meat into my face. I don't know about you, but that sounds like my dream meal. \n\nThen comes the popcorn. I've gotten mine twice with clarified butter and WHOA. You go to any other movie theater and ask for buttered popcorn and you're going to get some oily substance that just covers the first layer of popcorn. Not here. Every single piece of popcorn is smothered in butter. I am a popcorn monster and even I couldn't finish this huge ass bowl. \n\nThere is more! You can order as many times as you want from the cards and no one is going to give you the \"are you seriously still eating\" stink eye because, HELLO it's dark and loud in the theater and once that card is down, your focus is on that movie. For you drinkers out there, this place also has a full bar and a menu full of typical bar drinks as well as fancy ice cream and other alcoholic dessert drinks. \n\nI love this place and I know you will too. \n\nP.S. The first row is the only row with reclining chairs. You're really close to the screen, but it's still totally worth it.", "author": "Lori K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "Comedy at the movie theater. Great venue. Lots of beer on tap choices. Also beer in cans. Assorted cocktails. Extensive menu including breakfast choices for early movies.  Great service. Clean restrooms. Close to public transportation. Great Tuesday night.", "author": "Genie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Whatever, I don't get the mediocre reviews. You arrive at the theater, and when you buy your tickets, you get to choose your seats! I mean, come on. For those of us with Moviepass, this was totally awesome.\n\nThe theater is clean, if you want to order food it's super easy, and they have booze! They have alcohol at a movie theater. And btw, if you're a beer nerd like me? Their taplist is phenomenal. \n\nThe bar outside of the theater is equally awesome. Drinks are a bit pricey but the entire place is a blast to hang out in, and the bartenders are fantastic. Alamo gets the full 5-star treatment from me. Why would I see a movie anywhere else?", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "Really cool atmosphere that reminded me of Los Angeles theatergoing - being here was first time this summer when I found myself missing LA :')\n\nOld movie posters lined the walls, and old Hollywood dance film reels played before the start of my movie. The theater was very comfortable overall, and unlike some other reviewers, I wasn't at all distracted by the moving servers. They're strict about silence at this place, and the audience followed the rules which made for a great experience. \n\nService was awesome, drinks were awesome, but food was expensive and so-so, which is why this place loses a star. I got a hot dog and fries (my cheap self gravitated toward the least pricey menu item) and it tasted kind of off in a way that unfortunately reminded me of sleepaway camp food. Really ridiculous for $13. I'd recommend sticking to one of Alamo's fun cocktails with gourmet popcorn.", "author": "Stella B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "Went to see the movie about my favorite Japanese rock band (for almost 14 years) a couple weeks back. I was super excited, so that might have added some points to this cinema. \n\nIt was my first time ever to this new cinema where you can order food and drinks while watching movies. I like this idea, but the staff were a bit slow in service. \n\nSoon after I sat down, the girl came to me and asked if I need anything. I said I need more time and she said she'll come back. More than 10 minutes had passed and I couldn't find her. Then she finally showed up, only because the girls sitting next to me arrived. She didn't ask me if I'm ready but just checked upon those girls. As she was about to step away, I stopped her and made my order of a beer. Then I waited, waited, and the movie started. 15 minutes into the movie, I still didn't receive my beer. I put up the white card (whenever you need service, write down your order and put up the card, an employee will come) so that I can ask them what was going on with my beer. About 5 or 10 minutes later, my beer came, finally. \n\nIt took 30+ minutes for one beer; and the seat WAs not so comfortable for short people like me. But the overall experience was nice and I really liked the beer ($7, the last one in the beer selection, which mixed up with coffee, yay!!!). I believe they have many non-mainstream movies to choose from. So, I will come back in the future.\n\nP.S. They will give you the check about 40 minutes before the movie ends and you have like 15  minutes to grab out your card/cash.", "author": "Jingqiao H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "The decor of this theater is pretty awesome, they are pretty strick with their late policy after the trailers come off there is no more seating...I understood but this sucked tremendously! I tried to take my little brother to the matinee and we just missed the matinee by a couple of minutes and had to wait 3 hours later and pay extra...this was very disappointing so whomever reads this make sure your on time. The drinks are pretty pricey inside but it is a cool hipster theater so you get what you pay for, I love how they have themed drinks and food on a separate menu. The seats are pretty comfy and for the smaller theatre they recline.", "author": "Zenda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "This place is the best thing to happen to movie lovers in Brooklyn in the last ten years. It is my second home. Projection and sound, great. The screen size, comfort of seats, leg room... you won't find anything better in Brooklyn. Late night/revival programming, top notch. Good food. Kind and friendly staff both in the theater and in the House of Wax bar (which is gorgeous). Oh, and they have their own bike rack IN the lobby!", "author": "greg m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "This is my favorite theater to go to with friends. You can order beers in the theater, and they show good stuff. The food is not special compared to the nyc restaurant scene in general, but compared to concession stand food it is out of this world. Watch out if you have dietary restrictions though, it's hard to get modifications here. There are definitely no keto friendly options.\n\nThere's a creepy wax museum themed bar attached and if you can't finish your drink by the end of the movie, you can just carry it on over to the bar. It's also a handy spot to wait for your friends to show up if you arrive early.", "author": "William J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-11", "description": "My first time here was successful. I love the facilities. The ambiance and the decor is great. The staff is friendly, patient and informative. Everything was clean and tidy. It all felt really upscale. \n\nHere's the thing: you can't mess up a burger. Twice. You can't do that to me. I ordered the first burger on the special Kingsman menu and it arrived cold. When I asked for it to be remade, it arrived cold a second time, so I didn't fight it. I ate it because I was hungry and because I've worked at a restaurant before. I know how it works. When a guests asks for food to be remade a second time, the kitchen looks for justice. \n\nMy friend's food came out to her hot. She ordered the lamb burger and both the fries and the burger were hot, so I know Alamo Drafthouse has the capability of making you a hot burger. \n\nMaybe it was personal. Maybe they saw me enter and thought, \"This is the one. Let's do it to this one.\"\n\nI'll probably return but I'll be wearing a mask and not ordering from the Kingsman menu. I think that's the trick.", "author": "Stephen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "I've been to Alamo numerous times. Great atmosphere, clean theaters, and all staff are friendly...I enjoy the food, have tried almost everything. They also serve alcoholic drinks as well, and a large selection of beer..,I like the no talk and text policy, no phone lights shining in my eyes, and patrons being loud and rude. Thank you Alamo!! A wonderful experience!!!", "author": "Margaret M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "I absolutely love going to the movies so I was very excited when one of the original hip booze-serving theaters from Austin expanded to Brooklyn. In fact, I had an impromptu birthday party there this year. Because you can buy your tickets online ahead of time and choose your seats, it's easy to arrange a gathering with a group of friends. We met at the bar beforehand which some people thought was cool and others were totally freaked out by as  it's a freak show theme complete with replicas of deformed fetuses lining the walls. I was somewhere in the middle. \n\nAs for the food, I enjoyed the fried pickles and my wine at the bar, and indulged in the Brooklyn Dog and a banana split shake during the movie (hey, it was my birthday). Both were decent, definitely expensive for the quality ($13 dog and $9 shake), but that's the norm when it comes to theater food so I was fine with it. Next time I want to try the strawberry rosé shake or one of their other boozy shakes for sure. I think overall I've liked the food I had at Nitehawk more but it was totally passable. The service was unobtrusive and efficient, and they brought everything we asked for with no mixups. \n\nThe movie-watching experience was also very comfy, with brand new furnishings, comfy seats, and a nice big screen. The theaters are much bigger than a place like Nitehawk, so less likely to sell out even when the movie just opened or at popular times. It's definitely a great if you want a full on movie going experience!", "author": "Christina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Great movie theatre located in Downtown Brooklyn that provides bottomless popcorn and soda which is always a plus. What's great about the theatre is that they serve delicious food and have waiter service. I'd recommend the fried pickles and wings plus their truffle Parmesan popcorn. One thing I would have changed about the theatre is to have all their chairs recline which they do not.  They only offer reclining chairs for the first row. There are certain theater rooms that do have reclining chairs in the back row if your lucky. A little tip, they usually have a movie trivia question right next to the front desk and if you answer it correctly they give you a free movie glass.", "author": "David H."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}