{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-18", "description": "I've been here four times since it opened, always hoping I'll love it. I had heard so much about Alamo Drafthouse and kept wanting to give them a new chance. But I'm sorry to say, it's not worth the wait. \n\nAs a facility, it's nice. Most of the screens are a good size and the decor is certainly better than your typical multiplex. \n\nThe food is poor, the service is okay (but strangely and consistently snobby), and it's simply not a good way to see a film. There's this preposterously hypocritical vibe here. You're constantly reminded not to talk or use your phone or arrive late under ANY CIRCUMSTANCES, because Alamo is all about keeping the movie experience ~pure.~ They don't even admit children. I can appreciate what they're doing, except this is a dine/drink-in theater where people are always darting in and out with platters of food and more beer. Where you get your check back during the final scenes of the film. Just admit what you are! I would never see a movie that I took particularly seriously for the first time around at Alamo, because the experience is too distracting. But I feel like I'm being chastised from when I first step in. Not to mention: this is the antithesis of a classic cinema experience because it feels like everyone is experiencing the film in their own vacuum.\n\nI can't stress this enough: stick to drinks and simple snacks in the screening rooms. All three times I've ordered the overpriced food, it has arrived very cold and all of it has been bland. Steer clear of the pancetta mac and cheese in particular. Just terrible. The programming is okay, but it would be nice if they changed out their programming more frequently. They occasionally play an older film, but if that's your interest, head to Metrograph in the city. Nitehawk's food (and programming) is much, much, much better--even Syndicated's is. Alamo may have pioneered this model, but their competitors in the city are preferable to this location.\n\nThe best thing about the Alamo is the House of Wax-themed bar, which is very cool. I suspect I'll end up there again before returning to the theater.", "author": "Dan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "One of the better theaters in the city. The screens are super high resolution (you can tell they invested there), and he sound system and chairs are top notch too. The chips and queso are also delicious!!! This is absolutely the theatre I'll be frequenting the most for the foreseeable future.", "author": "Jay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "One of the best movie places i have been. I saw the Sing movie a week ago. Clean, comfortable leather sits, big screen, perfect sound. There is also food available to order while watching the movie.", "author": "Des L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "It is great to have a movie theater in Brooklyn that's so easy to get to. The place is clean, including the bathrooms. The staff is very helpful, and there are plenty of choices on the menu. I will definitely come back here again, and highly recommend it.", "author": "D L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-04", "description": "This place is garbage. The food sucks - the only decent thing was the queso and they've  screwed that up now too - and they do absolutely nothing about people talking through the movie. I had a card up for half the movie and nobody so much as came around and took a look at it. So if the food is awful and they don't ensure that your movie-watching experience is enjoyable, why pay so much more to go here?", "author": "Qqq Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-27", "description": "I've been to multiple dine in theaters, this is not the best by far. I went twice in one week, to be sure my first experience wasn't the only.  Same problems 2nd time around.  Food and drink service is slow.  1 hour wait for food first time, 45 mins for food 2nd time.  Both times I ordered 2 beers before the bill came, I could've easily finished 4, if they were speedy enough they could have my $$. Food was fine, margherita pizza was OK and the burger was decent, but not worth the wait. I gave it a 2nd star because the downstairs bar is pretty great and the beer menu is very good. There are way better options in Brooklyn and Manhattan. I'd recommend going elsewhere.", "author": "Brendan O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-14", "description": "We made reservations to watch a movie on Valentine's Day. Had some bad subway luck and got there 20 mins late. Turned out the server in the theatre gave away our seats that were together to another couple that walked in right before us. When we told the manager about it she said they had a 'late arrival rule'. Apparently even if you have pre-paid reserved seats they can give them away. The movie hadn't even started!! Never going back.", "author": "Keki N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "I was a little hesitant about the combination dining/theater experience (would it be loud when everyone ordered? Would they be extra chatty? Would there be a lot of additional food and eating-related noise?), but I really enjoyed it. It's a nice theater, smaller than average multiplex theaters and with large, soft seats. There's a little table between sets of two seats for the food, but it is a very little table; our two entrees could barely fit. The waitstaff was very efficient and did not disrupt the movie at all. The food was pretty good and the portions were very large; neither my partner nor I finished our entrees, and I saw a lot of half-full popcorn bowls on my way out. It's obviously dark in the theater during the movie, so eating a proper entree was a bit of a challenge. Most people around me just got popcorn and beer, which might be a better way to go. Best feature: the restaurant-theater combo seems to attract a more respectful theater-going audience, and there were NO KIDS. It was the most polite and enjoyable theater crowd I have ever been with in NYC!\n\nOverall, it was a really fun change of pace from the typical theater-going experience! I will be back!", "author": "Sara M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-30", "description": "Love this place, but they're still working out the kinks. Last time I went, I ordered my food before the movie started. I didn't receive my Diet Coke until an hour in and was given my flatbread with 20 minutes of the movie left. Hope they can figure out service because I like the idea!", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "As soon as I found out about the new Alamo opening in my hood I was filled with excitement and anticipation. After stalking their website, thoroughly reading their menu and yelp, I finally went to see Dr. Strange this past Saturday. I purchased tickets and selected our seats about a week in advance which was super easy online. Tickets were sent to my email, I screenshot the screen, there were our tickets. Nice! We arrived about 950pm, our movie start time was 1030pm. We wanted to look around, see the House of wax exhibit and grab a drink at the bar. Very cool entrance, enjoyed the wax figures, old movie posters and the entire feel of the bar. It was packed with people who I assume were waiting for their movie to start or just hanging out on a Sat night. \n\nWe left the bar around 10:10pm, with our drinks in hand, up the escalator to theatre. Walked right into theatre 7, to our seats. They checked our tickets after we sat. The seats do not recline which we were sad about at first but they ended up being very comfortable with high backs. Our waiter greeted us nicely but broke the news to us as soon as he greeted us.... they were pretty much out of everything..... No flatbreads(pizzas), no sandwiches, no wings... because they were still in their grand opening stages of training. With a sad face, we said ok, now we have to look over the menu again because we already knew what we wanted before we sat. With only a few choices left we then ordered popcorn with butter, fried pickles, another beer and a strawberry shortcake shake with rum.. yes they can add liquor to your shake! SIKED!!! so we very quickly put up our order card. It took a little while for our waiter to come back to take it from us around the time the movie started. We received nice huge glasses of water first, then waited. Our neighbors got their popcorn and devoured it while we patiently waited for ours. Our fried pickles came first, they were good, it was our first time ever eating them, however couldn't eat more than 2 each. I still wanted my popcorn and shake. Our popcorn came mid movie. We were a lil upset but knew they just opened about 2 weeks ago and still had some flaws. The popcorn was warm and delicious! with real clarified butter.. mmmmm and free refills. Never ordered a refill for popcorn because we didn't have time to finish our first bowl. Our waiter comes over to tell us it's last call, never intrusive...they really are like ninjas.... I tell him nothing else, but I never received my shake. He apologized again and said he would bring it out and it would be on the house. That made up for the delay for me. Oh but they ran out of the strawberry shortcake shake ..bummer.. SO I ordered the banana split shake with rum and it was delicious. Lots of whipped cream the way I like it AND free... due to their error. We also received a 15% discount due to training on our bill. Which also eased the pain. I can understand they just opened and need to train everyone on pretty much everything. Once management and service gets their act together, with ordering the appropriate amounts of food to handle customers demands they will be my favorite theater in Bk so far. I will be back to give you all an update, hopefully often.", "author": "N. T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Great theater, great service, great audience etiquette (even while eating and drinking Alcohol, everyone does their best to be quiet). A thoroughly enjoyable experience, equitable to my other favorite movie theater, Nitehawk, and I will be back again.", "author": "Cara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-14", "description": "We ordered dinner at least 10 minutes before the previews started and we never received our food throughout the whole 2 hour movie, even after asking our waiter twice. The waiter barely apologized and just gave us 2 movie tickets for next time, as if this is very common practice and he does it every night. I appreciate the tickets but that really wasn't enough considering we were starving throughout the whole movie - the whole point of us going to that theater was for the food and drinks.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "I was not welcomed or acknowledge  by the waiter for my row and I was early.. He seemed  to acknowledge himself as Russell to everyone else that came after me and offered water..  I complained to manager on duty and he apologized,offered a raincheck , and provide lame excuse about just opening.. really?!  There seem to be a line for complaints that night because a couple after me complained about not receiving food. Seems like service needs room for improvement..I refused raincheck and don't  think ill be going back anytime soon and it's sad because I like to support local businesses.", "author": "Rudemarl .."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-06", "description": "Soo...being a big Nitehawk fan I opted for trying out the more commercial version at Alamo. The plus...it's cool and cute...super unique and interesting design. It is a great ode to old classic movies and the bar next store,although packed, looked adorable. That said the service was bad...took quarter way into the film to get a glass of wine and the queso we ordered was tasty but slightly cold and most of corn chips broken or just pieces. It was crazy that when movie was done no one could leave because no one had checks! The service needs to be improved big time. Also, someone please instruct the servers not to serve bent down like we can't see them...it's so much more of an intrusion if they are trying to bend down and not be seen. Just be efficient...deliver the food and drinks standing up but do it fast.", "author": "Allie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "Really enjoyed my evening! Staff was super friendly and helpful and the ambiance was really cool. It's obvious they are still working out the kinks, which is to be expected - they just opened. They seem really eager to work out the issues though. The service was a bit on the slow side but it didn't really bother us. Would definitely return and have recommended it to all of my Brooklyn friends!", "author": "christine i."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "They deserve a -5 but unfortunately the lowestl I can give them is 1.  Things started OK my meal arrived in a reasonable time.  My wife's meal came 1 1/2 hrs later, 20 minutes before the movie ended.  In the interim  I asked 3 different servers where it was and they were totally clueless.  All they could say was, keep your voice down.  What the fxxk!  Her meal finally came 20 minutes before the movie ended.   To top it off their credit card machine broke (according to previous reviews it has happened frequently  before).  Ten minutes after ALL the movie credits had ended  we and 15 other were still sitting there waiting for it to be processed.  I finally got my credit card back and paid cash.  I asked to speak to the manager, ten minutes later he still had not shown up.  I left and I WILL NOT BE BACK.  Go to Nitehawk instead they have their act together,  Alamo Draft house does not.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Like many of the previous posters, I've been waiting a few years for this to open as well.  I'm thrilled it's now open and operating.  I took part in the soft open on Tuesday and saw a showing of the Andrew Weiner documentary.  Despite it being their first or second day, I thought the staff was totally on point.  I never waited more than a minute before they saw my order card and were on it.  The only blip I'd mention is that I wasn't super impressed by the food.  The chips and queso were fine.  But the mac and cheese with pancetta was a little underwhelming.  A little soupy.  My guess is that they're still working out kinks in the kitchen, since it was essentially the first day.  So, hopefully that'll improve.  Regardless, I'm super happy that we now have access to a great movie spot like this, and I'm sure I'll be back in the next week...if not weekly, to see shows and try out more menu items.  I'm looking at you brisket burger.  Oh and one last thing to note, they only charged half price for all the food items the first few days, so that was super awesome.", "author": "Susan F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "If I could give this place zero I would. Walking into the auditorium it smells like swass and the wet feet of the homeless. As instructed we wrote down our drink order twice. A short 45 minutes late we were still thirsty. A quick trip to the bathroom I realized toilet paper was a luxury here and a bring your own is required. Actually everything about this place should be bring your own. Your own food, beverages, water, toilet paper and fan because none of the above listed is anything you can get from the service here. Fine maybe they are short staffed but give a fuck... clear a table or two, check back to see if the ridiculously over priced drink was actually drinkable. We were never given the opportunity to order a second drink. We just drank from the nectar of our own sweat and smiled as we got ass raped for the price of a reclining chair. The theater was insanely over heated, so if you come, wear your bikini and bring a towel so you don't have to fester in the previous attendees sweat. Take a trip to the bar downstairs if you actually want service but you'll risk missing the movie you actually paid for. Long story short. Wear a bikini, bring your own snacks/food and cash so you can actually leave when the movie ends and not have to wait 20 mins after while the service staff \"finds your tab\". Could be an off night but hell....on demand sounds 1,000 better.", "author": "C D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "I don't leave a lot of yelp reviews, but I wanted to make sure that the staff and theater got a lot of great reviews off the bat because they deserve them. I'm very excited about the opening of a Brooklyn Alamo. My friend and I went to see Moonlight this afternoon and decided to get lunch as well. Our server, Dustin, came by and introduced himself to give us the rundown. He was very friendly and helpful and explained that it worked the same as any other Alamo or dine-in movie theater; you leave a card and the server grabs and brings food out during the movie. I had a veggie sandwich with a non-boozy cocktail. I thought both were great. Compared to other movie theaters like this I can tell how much the Alamo staff is trying their hardest to not disrupt the movie. Good menu, great service, and so far it seems like really good programming. I can tell their are still some kinks that need to get ironed out, but it's pretty obvious that they're off to a great start. I'm very excited to keep going back. Thanks to Dustin and the rest of the staff!", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "I really want to like this place, its super close to me and the actual theater itself is really nice but the service is awful. This is the second time I've gone there and for the second time they never brought me the drinks I ordered. The first time I went the theater was pretty full and after I flagged them down three times they said they had an issue at the bar and had to re-enter everyones drink orders and that our drinks were comped, we ended up getting our drinks an hour and a half into star wars. Tonight I gave them another chance, the theater for Jackie wasnt very full and it was much smaller and there was more waitstaff, I figured this would be perfect and thered be no way theyd screw up again. WRONG! We got there early and right away we ordered a beer and a soda and 2 appetizers, keep in mind this order was put in while the shorts were still playing. As the movie started playing we were brought 1 appetizer, then the other. No drinks appeared. I waited a bit longer, and pretty soon the entire small theater full of people had gotten their drinks, some people were even on their second round. After 30 minutes with no drinks I raised another card and wrote that we still had not received our drinks, a girl came over and grabbed it, wrote down a note on the card and went off. I watched as that girl continued to bring the people around us second orders and more drinks, 30 minutes later our original waitress finally came back and was bringing us our bill, she asked if everything was good and I told her we still never received the drinks we ordered and as i was trying to explain to her that we flagged another waitress down and told her as well she basically shushed us by saying shed figure it out and ran off again. 15 minutes later she comes back and hands us our bill and says that our drinks will be right out and that theyll also be comped and she rushed out of the theater again. I take this time to look at the bill and see that they had 4 drinks on the bill, so apparently when the other girl took our notecard she added more drinks to our tab without ever getting them. By the end of the movie we never got any drinks. Its really frustrating because this theater could be really awesome, but they just cant figure out the food/drink service. I've worked in customer service and in concessions at a major movie theater for quite awhile and honestly getting drinks is the easiest part. Customer beware - I guess give this place a shot and see for yourself, but I highly recommend checking out a movie you dont really care if you miss parts of cause youll likely spend most of your time trying to flag down someone for service.", "author": "Rhiannon M."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}