{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "I love Alamo Drafthouse. I've gone to the ones in Texas, specifically the ones in Austin (the 6th street one - Ritz is my favorite), so it was awesome to check out the one in Brooklyn. The first movie that I saw there was Baby Driver last year. My husband and I got tickets to see it the night before the official theatre run, when guest Kid Koala opened up the movie with a little presentation about audio recording equipment. The event was part of special programming for Alamo Drafthouse's 20th anniversary celebration. \n\nSure, it could just be styling/marketing thing, but I like that the place really pushes the love of films and the history of film. Alamo Drafthouse puts on special programming like midnight movies or David Lynch retrospectives, etc. You don't get that everywhere. Also, the food is pretty good. The hubs was partial to the Wild Mushroom Flatbread. I was a fan of the shakes (you have an option to add alcohol to them if you want for a few dollars more). \n\nBTW - You order using slips of paper during the movie, like if you want refills or whatever, the wait staff pick up the slips and then bring you your food during the movie. You get the bill towards the end of the film. \n\nThis Alamo is located inside the City Point building. You go up a bunch of escalators. Also, you go up escalators again to the get to the theaters where the movies are screened. Inside this Alamo, there's House of Wax, where people over 21 can get a drink before their movie starts (or after... or whenever).\n\nIn short, I recommend the Alamo Drafthouse Cinema Brooklyn hands down.", "author": "Jeannette L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "I remember when Alamo Drafthouse opened their first Austin location and it became a trend to have an upscale theater serving real food in a great environment.  This has mostly translated to Brooklyn, but it's not quite there.\n\nI love that the experience here is unique and not like the AMC/Regal/chain theaters.  Nobody rips your ticket at the front.  Instead, you sit down and am greeted by your waitress who checks your ticket and asks if you need anything.  Then instead of those horrible \"inside looks\" and commercials, Alamo Drafthouse plays little black and white cartoon shorts, little old school commercials, etc.  It's actually really interesting and fun to watch.\n\nThere are also fewer previews before the main attraction.  At most, there are 10 minutes of previews instead of the 20-25 minutes at the normal theaters.\n\nAlso, I love that they serve a full menu of food and drinks.  And I love that you have a waiter who comes to take your order (as in, picks up the order you wrote on the paper and put in the rail), brings your stuff, and then brings the bill near the end of the movie.\n\nThere are a few things to work on.  The food needs to be a bit better for the prices they charge.  I tried the hot dog and fries.  The hot dog had a weird texture.  It tasted like a really large Vienna sausage out of the can.  The bun was soggy.  I also tried the baked soft pretzels, which were pretty good, although the queso needed a bit more bite.  They have this non-alcoholic fizzy drink with habanero in it that was interesting, but was actually a bit too spicy.  Their organic brewed iced tea was good.  I really didn't like their choice of soda companies.  Blue Sky soda always seems overly sweet and their cola just seemed like I was drinking simple syrup.\n\nAlso, for a relatively brand new theater, the seats are not optimal.  It's become so common now to have recliners that not having them sort of ruins the premium experience you expect at Alamo.  When you get recliners at AMC and Regal, you expect Alamo to go a step beyond.  And the table setup is sort of annoying because the table itself is so far from you while you're sitting that you have to sit on the edge of your chair and lean forward to get near your plate.  The old style in Austin with the rail going across the row or the recliners AMC has with tables that swivel in would be much better.\n\nBest of all, they do take MoviePass.  So instead of paying $16 for your ticket, use that money to buy food instead.  And remember to tip your waiter well.  They have a really tough job since they have to walk hunched over and really fast through the aisles so as not to disrupt the movie.  And they do a great job at it.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "Pre-Pick your roomier seats and get a table with food service. I like that I know in advance where I am sitting so my group can be a bit closer to each other. It has a lobby bar with real liquor and food service so don't worry if you need a little warm up drink. It's CLEAN! No sticky floors! \nThere is a menu that can use a little change. I rather choose my own flavored popcorn. The drink menu and desserts are good. The food needs improvement. The fries are never crispy-the food just isn't worth the price. There is no real choices for healthy snacks.", "author": "Correy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "you won't forget this Alamo.\n\nI've been spending a lot of time in this area lately, but only recently made it to the Alamo. just kinda blows my mind when I contrast what this area looks like now to what it used to.\n\ncomfortable reserved seats.\n\nordering food and drinks from your seat (we're talking sandwiches, salads, pub food, alco-shakes, beer, and more - not just popcorn).\n\nfrequent live events hosted by various folks in media: actors, directors, musicians, writers, and more. we attended a live riffing of a surprise movie by Trace Beaulieu and Frank Conniff (from the earlier seasons of Mystery Science Theater 3000) last week, and it was epic.\n\na really strange bar with waxworks on display (considering I'm recently hooking on watching Penny Dreadful, this was an added bonus).\n\nstop, stop, we can't handle all this winning!\n\nand the policy of no phones during movies is great! go update your Instagram or Pinterest or Snapchat or whatever the hell you kids use these days outside.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Pretty cool theatre in downtown Brooklyn. Street parking will definitely be tough but it's very close to the subways. I believe it also takes Moviepass but they don't allow you to use the kiosks for it. You have to take a few escalators to go to the theatre. The tickets are printed like on a receipt type paper which are scanned when you go into the theatre. \n\nOnce seated there's a food and drink menu that you can order throughout the movie until the last 30 minutes or so. You just write down whatever you want and leave the slip of paper so that the waitress can pick it up. They've got a light under the table so you can see the menu at all times. The lamb burger and the fries were pretty good for a movie theatre. I was expecting a soggy burger but it was delicious especially with the sauce. I wanted to try the truffle popcorn but I guess I'll save that for next time!", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "This was my first experience at a theater where you can also order food, and I'll all for it. It's perfect for when you want to catch a show after work and don't have time to grab a bite beforehand. \n\nI've read they will not let you in once the movie starts and after the credits rolled there was 10 minute countdown for everyone to make their way out for the next showing. I actually really like their commitment to punctuality and order. Parking can be difficult though so give yourself a lot of leeway, or take the subway if possible.\n\nThe servers were very discreet when taking your order, dropping off the food throughout, and the check comes 45 minutes before the movie's end. I enjoyed my mushroom flatbread, although a tad salty, and my sister's brisket burger was a little dry. Overall, not bad and I wasn't expecting the food to be amazing but it was tasty enough. Their water was ice cold and delicious though lol\n\nJust a note, there's a shared table between two seats, so if you're in a odd numbered party, you'd be sharing half the table with the person next to you. Not a big deal, but something to keep in mind-- my sister didn't have any problems with it. Also I was in the second row and wished the chair could recline just a tad so my neck wouldn't be as strained, so I would recommend at least the third row if possible.\n\nOverall, I wouldn't mind going back for the right movie. Clean and spacious theater, good service and option for upgraded food and drink options a plus (alcohol available too).", "author": "Susan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "The Alamo Drafthouse does not deserve 3 1/2 stars....it should have at least 4 stars, if not more! I am sure most of the bad reviews come from people who do not appreciate focusing on the movie (Alamo is a no text, no talk, no late arrivals cinema) and not being able to chat during a screening....this is indeed not the cinema for you. \n\nAll other, quality movie-lovers: THIS IS THE EXPERIENCE TO ATTEND :-)\n\nAlamo screens not only the best movies (current and past) but it provides outstanding service to it's guest - their food and drinks/beverages menu is outstanding! You can choose from cinema classics like popcorn, burgers and shakes all the way to healthy options like vegan salads or quash \u0026 goat cheese flatbreads. Plus, their beer menu is crazy! You can choose from over 40 different beers! \n\nYou can comfortably choose your seat and buy tickets in advance (not like some other dine-in theaters) and they are priced ok! \n\nI know the Alamo from my time living in Austin and I couldn't believe when I heard it just opened up in Brooklyn, a month after I moved to NYC because it is, by far and cross my heart, the best theater experience you can get. \n\nIf you love movies and enjoy drinking and eating while watching, the Alamo is your alwaysa-to-go-place! \n\nBut, don't forget: 1) no late arrivals, 2) no texting and 3) no talking! ;-) Enjoy the show", "author": "Tereza S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "The theater is located on the 4th floor of the city point shopping center. We were 5 mins late to our 8pm movie and had to switch to an 11pm viewing. The guy at the front was a bit rude when it came to switching our ticket time. \nSince we had to change our show time, we had plenty of time to kill and ended up dining outside of the shopping center so we didn't even have food inside the theater. We did like the sound of truffle popcorn, unfortunately it wasn't very appetizing. The popcorn was soggy and had tons of \"truffle flavoring\" powder. \nOn top of a whole movie time change, there was about an hour delay in the theater but the staff came around and gave everyone waiting a glass of prosecco. Once in the theater they came around and gave everyone a rain check pass which was really nice of them. \nThe menu seemed pretty cool, and the order system is really simple and easy to understand.\nSimply take a note card on the side of the table and write down your order, someone will come and quietly take your note card and will return with your order. Just wish we were hungry enough to try out some of the desserts. \nDont expect to feel like you're lounging here, the seats aren't the best in the world, they don't recline and aren't the type to cozy up on.", "author": "Sheila R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "Amazing place to see a movie. Get there 30 min early so you can see the unique previews which are clips of old films that are somehow related to your film. There's a server who will take your order throughout movie. Popcorn is great, we got one with Ethiopian spices which was really interesting. Great beer and drink list as well. For all the food, the theater is very clean. Definitely will come back to see all my movies here.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "The seats are so comfy. The service is good \u0026 there are many food options. Although it is expensive , I think it's worth the experience. Had a lovely time \u0026 will be back.", "author": "Lynn A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-17", "description": "It's the only and best way to enjoy the movies in Brooklyn/NYC. If you're going to see a movie anywhere in NYC you are already familiar with the fact that your ticket price feels like opening a small trust fund. With this type of money drop expected you might as well be treated like royalty, which includes opening credits to eject any rejects who talk during the movie or play with their dumb phone. Thank you Alamo for eliminating those people. Now that the theater is filled with civilized people you can select which adult beverage and snack suits your fancy. Added bonus there are rarely children at this theater! My favorite menus items include the queso chip combo and the buffalo style cauli wings with vegan (we don't know) ranch sauce. Either way it's a delicious chilled dip to cool your tongue off. They used to have a humus dip with won ton chips. Those were also great! If you are looking for something more traditional they have giant bowls of truffle or parmesan seasoning popcorn. I love pre-selecting our seats ahead of time and knowing that we don't have to camp out an hour early to get a seat (*cough cough Night Halk Cinema take a hint). The extra large iced waters are also an appreciated touch! Don't forget to arrive early to sip on more adult libations at the wax museum, located outside of the theater! You can even bring your rare sour beer selection from the wax bar into your movie! Yes the beer menu at the wax bar offers different options than the actual theater. \nHopefully nobody reads this because I don't want everyone to find out about \"my\" spot. :)", "author": "Fiona A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "Obsessed with this theatre. I won't even go to regular theaters anymore- which is a problem bc the Alamo isn't cheap lol. I love the space and comfort of the Alamo and I absolutely love the ability to order food/drinks during the movie. The food quality is also amazing, definitely not cheap food! Restaurant quality. Plus, as someone who in the past always ran late to movies and had to wait in line for snacks at the concession stands... the Alamo saves me time. I also like the fact that they play old movies too! I have the Alamo Drafthouse app and am always checking for future screenings to try and snag tickets to good showings before they sell out. For example, I was able to get a ticket for Pride and Prejudice the 2005 version, and I am thrilled bc it's my favorite movie! For Christmas they had screenings of cult classics such as Elf and Love Actually. Also, if you sign up with the App and put your email address, you get a free movie ticket for your birthday which is redeemable within a month of your birthday date! I also love the fact that as decor, the Alamo has framed movie posters in Arabic on their walls! As an Arab I really found that so cool! \n\nOnly downside is that they have limited screenings so they sell out really quick so you have to book tickets in advance. Also, the variety of movies they show per month are very limited so there may be a new movie you really want to see but it won't be screening at the Alamo. \n\nI did hear that they are planning on expanding and taking over the upper level of Century 21 to make more theatre space so I'm excited! \n\nIf you haven't tried it yet, check out a movie there!", "author": "Amani A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "Husband and I had date night and it was an interesting way to watch a movie. I mean who doesn't love some tasty food and drinks while watching a film? The only thing that was a little annoying was the constant back and forth. Servers constantly passed in front of our aisle to bring things to the table next to us. Our seats weren't as comfy as I thought they'd be either. The backs were way to straight. The truffle Parmesan popcorn was tasty. Serving was enough for three people. Hubby ordered pretzels again enough for 2 people and they were ok. \nWe probably are going to try other dine in movie venues  in the future.", "author": "Karla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Love, love, love Alamo Drafthouse!\nNow that I have visited the drafthouse, many times, I have a hard time seeing movies in the old fashioned way.\nDownsides:\nPeople tend to talk during the fun little bits they show at the beginning so if you want to hear them you are out of luck.\nThere is limited seating in each theater due to the nature of the service. Popular movies sell out quickly. You must be proactive.\n\nUpsides:\nGreat movie selection. New movies, old movies, cult classics, kids things. Fun for everyone\nThe little bits they show as the pre-show. Very unique selection of past commercials, shorts, etc.\nFood and Booze while you watch the movie. I usually end up getting the same thing every time but the menu does look good. Huge bowls of popcorn!", "author": "Leala V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-23", "description": "It was Good Friday and my super-hero obsessed son was decked out in all his Marvel merch. I took him to Alamo for the earliest showing of Captain Marvel. After waiting in a long line, I tried to buy 2 tickets and the cashier told me kids under six are not permitted. I lied and said....\"um, he's six...\" but she wasn't buying it. So my son looked at me with tears welling up, \"Mommy, that lady not going to give us tickets?\". I gave her the angriest Mom glare, but she simply called for the next in line, dismissing us. I do understand that businesses have policies, however this was frankly a pretty shitty enforcement. We found another theater down the street playing the same movie. Of which my 3 year old sat quietly and attentive the entire time. More than I can say for all the adults.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Going to the movies today has become a rare event. What was once one of the only sources of entertainment, now has to compete with great content from Netflix and the likes, in combination with the new TVs and sound systems, you can pretty much stay home and enjoy a pretty amazing experience.\nCell phones and rude behavior have done nothing to help to cause of the movie-going experience.\nEnter Alamo Drafthouse, no rude behavior allowed here, you will enjoy a wonderful experience without the glow of the cell phone from the person in the row in front of you distraction you from the flick.\nWant to catch a bite and a drink before or during the movie? Check \nThis is a refreshing experience and Sunday afternoons at the movies are back again.", "author": "Gustavo A. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Attended a really fun surprise birthday here last night. It's my first time coming to this chain. I gotta admit, it's pretty cool. Tables built into every other seat. An enormous selection (40) of NY beers on draft, some ciders and a full bar. They also offer a variety of food options, snacks and also alcohol infused milkshakes.\n\nYou can actually rent a theatre here and show a movie of your choice. We got to see The Shining which was pretty awesome to see on the big screen.\n\nThe only disappointing item we encountered was a very poorly made Mule. It wasn't drinkable. So I stuck with beer/cider after that. \n\nStaff was very friendly and helpful getting situated.", "author": "Joe D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "This place is still new to me but the few times I've been here I enjoyed myself. The theater has its rules they ask you to adhere to but I think it helps make the exoerience better. CPT time is not tolerated, you onky have until the emd of the previews to be seated l, after that you can't be seated and have to try to get seats to the next show.\n\nThe table service is efficient,  the food is great, the drinks are better, and the prices are moderate. Seating varies dependong on which theater you're in the but seats are comfy none the less. There are also rules for movie goers to adhere to throughout the movie. No cellphone usage or you'll get a warning then ejected and no talking. Can you say movie theater from heaven??? No loud rpwdy people disrupting the picture, nobody constantly getting up in front of you to get a refill or more snacks, amd no noisy cellphones and bright light from cellphones killing the darkness in the theater.\n\nOver all I can't wait to go back and loke the fact that they make movie themed beverages.", "author": "Elethia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "I kept hearing friends talk of \"the Alamo downtown\" as if if were some kind of secret club. City Point is the venue it is within- a hip, clean mall-type building with a food market in the lower area and various stores within 4 floors. The Alamo is tucked away upstairs. You're welcomed with dark carpeting  and a type of self-sufficiency mood. \n\nSit down in your pre-purchased seat with a table in front of you. There are cards in the front of your table in which you write down what you want to eat based on the menu. Also wrote your drink. Your server with pick it up silently when your card is finished. Stick it vertical in the holder so they know it's ready. Yes, the Alamo has its own language. \n\nI had the brisket burger with fries and a ginger ale. The burger was very good. It was heavy though, so beware. The red-centered burger is set on a fluffy potato bun with all the right fixings- red onion, tomato, lettuce, and a garlic mayo spread. I finished the whole thing but did feel heavy after. The fries are crispy and soft on the inside.\n\nMy friend and table-mate had the chicken sandwich and a chocolate chip cookie shake. Well, the shake was to die for. I only had a sip and the crunchy cookie pieces mixed with the cold vanilla bean flavor had me hooked. She said the sandwich was very dry and not that good. \"The fries were better than the sandwich,\" she said. \n\nI'm glad I found this gem. Alamo is close to the R, N, and F trains downtown. Be prepared to pay a pretty penny. Tickets for the movie are $17.50. Your meal will be between $15 and $30. It's a once a season type of place. See you in the summer, Alamo.", "author": "Dana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-22", "description": "I loved the Austin location, and this one's no different except maybe the seating arrangement. Same great menu, same concept, same ban on cellphones. If you're seeing something popular, definitely purchase tix ahead of time. If you're early, kill time at the creepy bar that nonetheless makes great drinks.", "author": "Josephine L."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}