{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-16", "description": "Horrible food + watery and expensive drinks. Same experience in the 3 times I've gone over the last 4 months. BUT, they have amazing popcorn, I will give them that", "author": "Red B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Love this place. Great movies, comfortable seats, no ones head blocks your view. Great to have a drink and watch or the option of dinner. The Wax bar is cool too.", "author": "Sheila G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "If I could, I'd give a 3.5, but am rounding up to 4 stars to give benefit of doubt.\n\nAlso prefacing this by saying I find some other reviews amusing - particularly about getting kicked out over texting when they make it VERY clear those are the rules of the house prior to the movie showing - and the fact that \"threw out\" is spelled incorrectly. \n\nThe food: average - I compare it to bar food.  They can run out of food at times so be prepared with backup alternatives. On our first visit most of the things we ordered were not available.\n1) fried pickle SPEARS w/ ranch dressing (spears are better than chips) \n2) Hot wings w/ blue cheese (good/typical), \n3) Baked pretzels: 2 - 3 pretzels comes with nacho cheese \u0026 a sinus cleansing mustard - meh, \n4) Chips \u0026 trio of salsas - nothing special\n\nThe Drinks: if you were at a bar you would probably be annoyed but it's a movie theater so it's all relative.\n1) Margarita on the rocks- ok, glad there wasn't too much sour mix\n2) Brooklyn - pretty strong,  like made in a beer bar instead of cocktail bar\n\nI like the novelty of a dine in theater.  There is a HARD no talking/texting/cell phone, no being disruptive rule.  After 1 warning, you're removed from the theater, with no refund and asked to leave.  Upon our first visit, we were scared into submission b/c there is an INTENSE blasted message with all their rules.  If your neighbor is an annoying gaggle of woman gossiping and laughing, just hold your card up and somebody will take care of it for you, no more loud \"SHHHH\".  Any issues you have, hold up your card \u0026 somebody will help you.  I appreciate all the above as it keeps the theater civilized and everybody can enjoy themselves without distraction or annoyances.\n\nThe ordering system:\nWrite order on cards supplied, place it upright in the slot and people magically swoop in as needed.  Food delivery takes a little bit but you're usually so engrossed in the movie it's not a big deal.  You can continue to order throughout your movie as you want.\n\nI knocked a star off for a few reasons:\n\n1)The service can be hit or miss.  1st visit, great - but 2nd visit, our server had the craziest stank attitude.  After acknowledging we'd been there before, her words were \"do you know what you're going to order?  We have a full house today so you better get your order in\" and proceeded to walk away without taking our order.  My bf basically chased her.  At that moment we decided only to get one item - I'm not going to order more and therefore tip more for such a rough introduction/interaction\n\nI felt badly for the group next to us who had wine questions - the same server basically mandated to one woman \"You're going to order this\" b/c she had no patience to answer questions = she herself has no idea what's on the list or how to answer any questions at all.  She then paused to say \"well do you want this wine, because we don't take drinks back\".  How is she supposed to know?! You certainly didn't help her and basically placed her order for her\n\n2)The place can get unbearably warm/hot.  We went twice in January and it basically became a SAUNA in there.  People were disrobing, taking their Uggs and shoes off, and fanning themselves with pieces of paper.  A server was dropping off an order at the table next to us and my bf asked if they could turn down the heat (Per instructions notated above) - and our stank server barked at us thinking we were being annoying and said \"just write down your order for him instead!\".  Did the request work?  No - by the end of the movie I was in my tank top.....in January.\n\n3)The bathrooms can be a bit of disaster.  My movie was at 9:35pm on a Saturday and more than half the stalls didn't have toilet paper or weren't clean.  Cmon, it's a Saturday - more people are going to visit your establishment.  Please keep the stalls loaded with TP and somewhat clean\n\nIf I could, I'd give a 3.5, but am rounding up to 4 stars, giving benefit of doubt for having a fluke server and it possibly being a busy night.  I'm hoping my next interaction will be as good as my first", "author": "Catherine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "I was really excited to finally come here as I'm a big fan of independent theaters that serve beer and food and know Alamo is legendary. Everything about the decor was superb, especially The Shining themed carpets, wax figures bar and vintage foreign movie posters. The movie theater we were in was also top notch and the service was great and unobtrusive. Sadly the food was absolutely terrible except for the popcorn. The fries and veggie sandwich were utterly tasteless and the flatbread was ok but not worth the high price tag at all. This was quite disappointing considering how great everything else was and you'd think they would pay better attention to such a big part of their business. I would definitely come back here to drink and watch awesome movies but next time I'll make sure to eat somewhere else before the movie starts.", "author": "Bob L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Knowing that this place used to be Albee Square mall, it's amazing. They did a wonderful job here. I loved the atmosphere and the theatre was clean, the drinks were small but decent. The seats with the tables do not decline, but the ones in the front do. I ordered and loved the Thai wings also the Buffalo wings were good too, but the nacho and cheese was not all of that great. First time at a dine in movie so we had to get the full experience. Glad we did.", "author": "Lipstick L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "I love this place! First shows of the day are much cheaper and I like picking out my seats online before going to ensure seats. When going to the theater to pick up tickets, it is super easy. Just enter the confirmation code and tickets will come out of the machine. There is no need to print anything. There are baby screenings during select times which I love. It is great to be able to still see movies in theaters and bring my baby. We ordered food during our last visit and waited a long time before getting the food, because the waiter said it was delivered to the wrong theater. This was less than ideal especially since our food was slightly cold by the time it got to us. We had the brisket burger which was good but tasted like a regular burger and nothing like brisket. The food and drink here is slightly pricey so be prepared for that! The seats are leather and comfortable but do not recline and the partitions don't come up. There is a table for every two seats to put food and other things on. The light to see the menu is slightly dimmer than I would like in order to actually read the menu but doable.", "author": "Cathy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "One of the best cinema's in New York. While this place doesn't have reclining chairs, it has a great menu and is located on the top floor of soon-to-be Dekalb Market Hall.\n\nI will add, the food is a hit or miss. Your basic American foods (burgers / fries / hotdogs) are all fantastic, but if you branch off to say the salad with salmon, it could start getting interesting real quick. The food is also overpriced for what it is, but if you're craving a bite, go with the basics. Avoid dessert as well, they usually never come or come way over cooked.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-07", "description": "I started my experience with a 5 for the outstanding presentation of the theater and house of was museum/bar.\nThe look is amazing, the service at the house of wax was nice.\nOnce in the movie theater, after my friends and I put our dining card up, drinks and truffle popcorn came promptly; however  30 min into the movie I was informed that my pancetta mac \u0026 cheese was no longer available.\nI asked for another Margarita on the rocks and left it at that my experience moved to a 4 star at this point, (knowing that another movie was being shown after the 8:00pm I was surprised they had run out of something already). 5 min before the credit ran a flat bread pizza was brought to one of my friends informing her that the tacos she had ordered at the beginning were no longer available. What???! Why wait so long and why would you assume she would take a pizza in its place (she happens to be gluten free) she declined the flat bread and requested the wings. They were brought out as the credits were rolling. Really??!\nOnce the movie ends a 9:59min timer is on the screen...what is this for? As we waited and waited and waited for out check to arrive to settle. Last in the theaters and finally settled and a half hearted apology from a server (sorry we are still in training.) we left, but not before we overheard one of the employees tell the staff to hold off sending the next guest in as they still had to clean up.\nHaving worked for 15yrs in the expansion of new and existing sights with a previous company the experience here tonight was unacceptable.\nYou send the best of the best from other locations to help develop the staff in a new city/location but never letting the guest see/ experience that you're not ready to service them.\nI haven't written off the Alamo Draft house just yet, I hope in the next coming weeks they work the kinks out, not only in house but also online (as purchasing tkts wasn't easy either and I had to call to speak with someone because I kept getting kicked out days before my visit).\nHoping my next experience is better.", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "As a native Texan nothing makes me happier than knowing I haven an Alamo Drafthouse nearby. The \"no talking, no texting\" policy is awesome. I don't have time to deal with disruptive neighbors when I'm trying to unwind and watch a movie! I love the food here as well. The queso is fantastic and reminds me of what you can get back home. The cookie trio is awesome! I love everything about the Drafthouse. If I lived a tad closer it would be my go to. \n\nAnyway, thanks Alamo Drafthouse for your awesome theater, events and company!", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "This place is great! I don't regularly go to movies because the usual BK peanut gallery is super annoying when paying $20 to watch a movie in a dirty chair.\n\nSo this place is fresh, clean, and new. You sit in comfy recliner like chairs and shortly after you sit the waiter brings you some water and explains the service. They have a varied menu that seems to accommodate for all sorts of dietary restrictions and alcohol. Who knew- hummus in the movie theater?!?\n\nSince we were seeing Dr. Strange at 10:30am- we didn't spring for alcohol- we ordered a French Press (Toby's Estate). Sadly, they had run out- so instead they offered us bottomless drip. I get pretty snobby about coffee (not excessively so) - and it was great not overburned or stale at all!\n\nIn the beginning of the film- they play a vm from a customer that was angry for being thrown out for texting- it is pretty funny. The whole crowd was quiet and attentive to the movie-- and the waiter was a ninja! I never saw him- yet my coffee was always refilled:)\n\nI might start seeing a lot more movies:)", "author": "Jaclyn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "5 stars and 4 thumbs up for the most well orchestrated and civilized movie-going experience around! Dinner and a movie has never felt so good. Pre-assigned seats to avoid the awkward negotiation of saved seats and personal space - check! Robust menu that offers dining options beyond lukewarm nachos - check! Fully stocked bar - check!\n\nThe overall experience is always fantastic -- but made all the more sweet knowing this company boldly stands on the right side of history. (Wonder Woman in support of Planned Parenthood FTW . Haters gonna hate. And people who don't understand how boycotts work will .... threaten not to visit from their keyboards in the suburbs of Nowheresville, USA.)\n\nAnd icing on the cake, I love the clever easter eggs around the theater like the Overlook Hotel carpet in the lobby. So good!\n\nI don't think I'll ever go to a regular movie again.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Soooo, this is honestly a first.\n\nI was writing the Yelp review in my head towards the end of our movie (The Monster Squad) and was ready to drop 1 star on them.\n\nHere's what happened...\n\nFirst off, I LOVE Alamo. I've gone to the one in Yonkers probably 5 or 6 times and it rules. So I knew what to expect. \n\nAnother thing I love is \"The Monster Squad\". If you haven't seen it, shame on you. It's f'in 80s gold! \n\nI saw that not only was this new Brooklyn Alamo showing \"The Monster Squad\", but that the main character (Sean, played by Andre Gower) was going to be in attendance doing a Q\u0026A! So I was mad excited. I went with my girlfriend and two of our close friends. \n\nOn first impression, this place is awesome. An actual full bar, it's clean, and the employees were super helpful.\n\nWe easily found our seats (which are definitely smaller than any other theater by the way, boo), got comfy and started looking at the menu. \n\nOur server's name was Jeremy. After he charmingly introduced himself, he let us know right away that the kitchen was short staffed (really? on opening week and on Halloween?) and that to compensate for that they were going to give us 30% off our bill. Now THAT'S awesome. So I knew we'd best order soon to get our food in time since it'd take awhile. \n\nSo, we order some drinks and some meals. \n\nTHIS is where our story starts to go downhill.\n\nThe soft drinks came relatively soon, but the wine took about 20 minutes to get to us. \n\nAndre Gower did a little introduction, and then the movie started. \n\nAbout 20 minutes into the movie, Jeremy comes back to let us know that they are out of the tacos we ordered, and can he get us something else. So, the kitchen is understaffed on Halloween, and you're out of food? Ok. But still, he was very apologetic and we were getting that 30% off so all good. We order the pizza flat bread. \n\nNo joke...this is the LAST time we see Jeremy until the movie is over. I'm talking about we did not see him (nor do I think did anyone in our row) for over an hour. I don't know TF he was doing, but it wasn't his job. \n\nSo, we're halfway through the movie, 3/4 of the way, still nothing. No refill on the soft drinks, no pizza, no Jeremy. \n\nThe movie ends and I am f'in livid, not to mention \"hangry\" as hell. \n\nAs Andre starts doing his Q\u0026A, suddenly here comes Jeremy with our check. When we show that we're not happy, he asks what the problem is. \n\n\"Umm...we didn't get our FOOD and you never came back!\"\n\nHe does NOT apologize and leaves to go fix our check.\n\nFolks, no joke, we don't see him again.\n\nThe Q\u0026A ends, people are getting up to leave, and we still haven't even gotten our check. Now, I am NEVER one to \"dine and dash\". That's a dick move and I would never do that. \n\nSo we're standing there wondering TF we're supposed to. The theater is emptying out and we want to leave to go get some food!\n\nSuddenly we hear...\n\n\"Is everything ok, guys?\"\n\nWe turn around, and it's a very kind woman (in a Friday the 13th sweater, YES!) smiling at us.\n\n\"Ah, no it's not. Two of us never even got our food, our server abandoned us halfway through the movie, and now he hasn't even brought us our check!!\"\n\n\"Oh...oh wow. Guys, I am SO sorry. Ummm...ya know what? I'm not even going to charge you for anything tonight. On top of that, I'm going to get some vouchers for a free movie for each of you if you'll just give me a second.\"\n\n\"Wow, that's very kind of you! What's your name?\"\n\n\"Sierra. Nice to meet you. Ok, I'll be right back\"\n\nWe're standing there for about 2 minutes, and GUESS WHO WE SEE?!?!?!\n\nThat's right, here's Jeremy!!! And what's that in his hand? It's our check.\n\n\"Ok guys, I took off the food that...\"\n\n\"Actually Sierra is taking care of it, man.\"\n\n(Bows his head) as Sierra is walking up. \n\nShe hands us our vouchers (TWO EACH!) and says, \"Please just give us another chance\".\n\n\"When you treat people this kindly, you got it!\"\n\nSo, while Jeremy definitely shit the bed, Sierra went CRAZY above and beyond to make sure we left satisfied. So, thank you Sierra! You are DAMN good at your job!\n\nWe shall be back very soon! \n\nGo Alamo!!!", "author": "Andy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "So I go into the Alamo having had a couple bad experiences at the Ritz location in Austin over the years (more from service than anything else), so I decided to check out the new Alamo as soon as possible to see if it might be a viable place to go see a movie or grab a bite to eat.  I'm happy to say that \"Yes, I think this Alamo location will be a big success.\"  I went literally on the very first night they were doing previews to see \"White Girl\" and in that case, I just ordered a milk shake and a veggie sandwich.  The milk shake was absolutely delicious, but the veggie sandwich left something to be desired. $13 for a very thin sandwich with the minimal amount of vegetables. I guess I was expecting something more substantial.\n\nI went back on opening weekend for a screening of \"Human Lanterns\" as part of Subway Cinema's \"In the Mood for Gore\" and though I had eaten dinner, I decided to a snack, so I ordered the chips with salsa (which also comes with guacamole) and that was a great choice. $9.50 for a bowl of chips with a choice of two salsas, green and red, and a nice bit of guac with pine nuts garnished.  That was a great choice, which I had with a glass of cider.  I then decided to splurge and get some cookies (as if I hadn't gained enough pounds from that milkshake) and I went with the peanut butter banana cookies and THEY WERE HEAVEN!! Man, those were so good, arrive to your table warm. $7 might seem like a lot for three cookies but they're nice size... and did I mention that they come to you hot?\n\nSo now the important question: The service. I gotta say for a brand new place, the staff of servers were so well trained and efficient and transparent. Never got in the way or left me having to find them. (To be honest, I'm rather impatient when I go to the movies cause I want to get out of there as soon as the credits roll.) \n\nI really enjoyed this Alamo experience and I'm really sold that this is going to work out. That area of downtown Brooklyn is really getting nice and having the new mall and the Alamo there will give me one reason to go to Brooklyn.", "author": "Edward D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "I've been here twice now. I've only ordered drinks (I recommend the Rushing Duck beanhead coffee porter). I would also recommend getting to the theatre a bit early to get situated and order food/drinks because it will take a bit of time to be served. I would agree that the sound in the theatre is amplified which is amazing for the movie experience but might be a bit bothersome if you have sensitive ears.\nBoth times here though the customer service was excellent and the movies were very good! Check out the wax museum in the lobby after which features an 1869-1922 Berlin based wax exhibit! Very interesting!", "author": "Kristy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "You know that music they play in a movie when someone is standing at the Pearly Gates of Heaven?\n\n~~~~ AAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ~~~~ \nAnd a Golden glow engulfs you????\n\nTHAT is the way I felt when I visited the brand new Alamo Drafthouse Cinema last week with my friend Jimmy.  We saw Kubo \u0026 The Two Strings and it was FAAAABULOUUUSSS!!!! :)\n\nWe went on a 50 percent off everything day because the staff was training last week.  Well, you guys sure did a good job of training them!   Our food was delish!  I had the mac n' cheese and a diet Coke.  Jimmy had a vanilla shake.  And we both shared a BIG bowl of buttered popcorn! \n\nOur waitress was a sweetheart.  The movie was AMAZING (5 STARS!) and the fact that nobody talked or texted throughout it (LUV their strict policy about that!!!) made the experience PRICELESS!!!!\n\nI will be going back again tomorrow.  And maybe the day after that.  And if they ever show up on airbnb renting a room for the night I may just sleep over! :P\n\nSo go here.  Unless you're one of those talker/texter types.  Then don't go here. Cuz if you do you'll be thrown out on your behind.  And I'll be waving at your silly ass as you're being escorted out the door!  The QUEEN (that would be ME!) does NOT want to be disturbed during her movies!  And this place is her CASTLE!!!\n\nNow pass that popcorn back to me!!!! :)", "author": "Tomeka S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Fun place to go for dinner, movie, and drinks. Very cool that you can go after work and have dinner while watching a movie. Nice variety of tasty food in the theater. My favorite part is going to the House Of Wax for a unique cocktail before or after the film. Nice bar just to go to and meet up with friends.", "author": "L Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "This place is dangerous. Be careful of he stairwell labeled \"exit\". I used the \"exit\" door at he back of my theater to go to the bathroom. There was a stairwell. I was stuck in the stairwell for 20 minutes and there was in fact no exit. I was banging on a door where I heard employees talking they said they would open the door \"in a minute\" then they walked away. I had to bang so loud on the door to my theater till someone opened the door again. It was scary.", "author": "Emily T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "The street it's on is currently unassuming... Enter the new, glass n steel modern building to a lobby boasting escalators to your left; elevators to it's right, and artwork on the wall to your direct right.\n\nI decided to go Up the elevators...\nA nice, smooth, unobtrusive ride...\nStepping out, it was as if there were no incomplete construction on the floors below... I stepped into a lobby area of the multi-theater complex that had a wait area with comfy seating, plush carpeting, note worthy, framed films from yesteryear just about everywhere!\n\nOh yes, and a small ticket desk. \nAfter asking, I learned a few of their regulations... My favorites were no talking, and - they Will eject- a once warned text/talker! \n\nThe rest room was unfortunately small and not brightly lit in a few places... This would not compel me to see a film on a busy day. The first two stalls were unflushed with what appeared to be stopped up toilets... Maintenance please?\nOtherwise, the stall I used was clean with adequate TP...\nThe sink was of a modern trough design and everything worked sufficiently.\n\nMet a bouncy young lady - Astasia? Her excitement working at this new space was infectious! \n\nThe theater itself was a bit smaller than I expected; but due to the attached tables and walking aisles, felt spacious and comfortable. \nAn usher directed me to my Reserved seat- and pointed out my server, who would stop by shortly to show me how everything worked.\n\nThe seat didn't recline, but it did rock a bit and was roomy and pleasant. I perused the menu a bit and decided I'd go light...THIS time! \nI ordered a popcorn...they use Real, clarified butter!! \n\nMimi, my server was attentive and unobtrusive. Thank you Mimi! \nWhen she came out with the popcorn,... All I could think if was... Oh. My. Goodness!\nIt was in a Big, stainless steel mixing bowl!  so glad I didn't order anything else!!\nnote: *** popcorn was NOT warm ***\n\nThe sound was a bit louder than I'd prefer. No Biggie...\n\nThe seat was Still comfy after Two hours...\nI Likee!\n\nWhen I left, I went to see if there was a frequent flyer card of sorts...\nA delightful young man at a promotional table started to answer me...when suddenly, a guy came up, interrupted him by telling me to Go - Its Simple-You Can Sign... I stopped him \"What? Excuse Me? -yes, this guy was....\" \nwell....never-mind... The moment was lost and I walked away to gawk at the framed movie stills and the House of Wax Bar!! \nHonestly,... that- and the earlier restroom issue were my only bad experiences!\n\nI will definitely return, as I live West of here, by the river... \nI took the escalators down to take a gander at the coming Target and Century 21 stores...\n\nThanks Alamo!", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "As other reviewers noted before, there are still some kinks to work out.  \n\nHowever, that doesn't deter me from rating this stellar joint 5 stars: \n\n-Great draft beer selection.\n-Both the parmesean herb popcorn and pancetta mac and cheese were great, much better than Nitehawk theater. \n-Service was slow at first but was continual through the movie. \n-Their credit card system went down and we had to wait about 10 minutes after the movie ended.  However, the manager came out, comped our meals and gave us free vouchers for another movie with no expiration date!  That is truly great customer service!  \n\nThe fact that this place is a 5 min walk from my GF's apartment in Fort Greene is the cherry on top.  Also, watching the waiters run around like a flurry of ninjas was entertaining.  \n\nFantastic place and looking forward to my next visit!", "author": "Jon L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-06", "description": "The seats are tiny. Surprised others aren't saying this, but this is the most cramped I've ever felt at a movie and the exact opposite of how I would expect to feel at a high-end movie theater that is supposed to improve upon a regular theater. I would go to the upgraded Battery Park Cinema instead which has huge chairs.\n\nThe service was pretty bad. Long delays with the food. Mine came out in the final 30 minutes of the movie -- just a burger. Other people got their food as the credits were rolling. I heard some people asking for refunds.\n\nFor this place to work, I think Alamo is going to need to reconfigure the seating (I've read that they have done this in other cities) and they REALLY need management that can get a staff on track. This is New York. If you mess up even once, people will not waste their time and money coming back again.\n\nA real bummer. I wanted to have an awesome night out, but the uncomfortable seating and mediocre service mean I'd rather make a night of it and go to Manhattan or just stay in and order food at home. That's the exact opposite of what Alamo's business model is based on. Yikes...", "author": "Sam G."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}