{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "great but the woman next to me never got her food and like the whole movie aired and she still never got her food.\n\ni'm hoping this place finds their rhythm w service soon cuz otherwise it's top notch re: experience", "author": "Gabrielle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "My family and I really love almost everything about this cinema. However, today was about the 7th or 8th time we've been there, and just like ALL the other times, our food and drink order was processed incorrectly. That's right. I realized after our popcorn was not brought out and I had to ask that it be removed from the check during the end of the  movie, that we have NEVER had an order proceed correctly here without some kind of intervention. Not once. I would blame the card system, but the checks always correctly reflect what we've written on our card. The servers are generally pleasant and (seemingly) efficient, but there seems to be an issue stemming from the fact that the person who takes the order is not usually the person who delivers it, so the waitstaff never actually follows up until it's time for the check. On another occasion, we were served the hot wings instead of the Thai wings we ordered, and the server insisted that they were Thai wings, in spite of the fact that we'd ordered this item before and this was not it. This cinema would be a perfect experience except for these issues. Unfortunately, this will certainly keep the size of our food and drink orders down to avoid these issues.", "author": "Bill O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-02", "description": "The freshest, cleanest theater I've seen in NYC -- and to have it here in Brooklyn is a point of pride. I recommend this place. Saw Jackie today and they had a custom pre-show with Jackie clips. This is sooo much better than the ads other theaters run.\n\nI want to be obsessed with this place but to me there are a few glaring errors:\nI've been there two times, both at off-peak times, and the men's room has long lines. They didn't plan properly here.\nThe seats are not that comfortable. Seems a big oversight for such an elegant place.\n\nHere's quick thing they could fix: the milkshakes are served goppy and not that cold. There has to be a way their milkshakes could be more like, well, normal good milkshakes?\n\nWe shall learn to love you Alamo - welcome to Brooklyn. Btw, the dark denim inspired wallpaper and tile in here is cool.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "The staff is very friendly and eager to help without disturbing the movie. They actually add to the overall enjoyment of the movie going experience. Before I started going to the Alamo I would only go to the movies maybe twice a year. So far I've been to the Alamo 3 times in 1 month to see Hidden Figures, Not Your Negro and Beauty and the Beast. I will be watching all of my future movies here as well. Great food, great staff, great experience!!!", "author": "Niesha M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "I was always a huge of Alamo's brand (especially their strict no talking/texting rules), so I'm happy they're in Brooklyn now. Have been several times. While the service struggled during soft opening, they have it nailed now. Good screenings, good food.", "author": "Jeremy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "This dine-in theater was brand spankin' new!  We went on a Friday night and had the theater almost to ourselves.  The service was fantastic.  Try one of their alcoholic milkshakes... I had one that was laden with honeycomb cereal and it was gone too soon.  I wish the pricing was a bit lower, I would have liked to splash out and try more of the menu items.", "author": "Hadley H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "This place has justifiable potential, and overall I can see the effort being put forth. BUT, it's totally missed the mark both times I've gone. They just can't seem to figure out the timely logistics of serving food, and the communication is terrible.\nFirst time we went, put in our order before trailers even started, and then had a comical runaround for the entire movie trying to get popcorn. Server was reminded twice and then we told a manager and then were told they'd run out, and then it appeared as the credits of the END of the movie started. \nWe were also bothered periodically by confused serves trying to deliver other orders to us, which seemed to happening all over the theater.\nSecond time, popcorn took forever, and the shake we ordered never came. Server nowhere to be found, told someone else, waited, and then our server appeared later saying they'd run out of this shake. Also the air conditioner was on. It's March in NYC. We have snow on the ground. Period. \nDon't think we will return anytime soon.", "author": "Aubrey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "Very nice theater with food and drink service as you watch a movie.  I enjoyed the movie and had a beer so that was cool.\n\nThe chairs don't recline so you are in the same position the whole time, but I guess that's standard if you want to drink, you can't recline.\n\nThe theater holds around 50 people so it's not crowded with overflows since each seat is picked by the consumer.  That's good so you can sit where you want.\n\nI would recommend this place as a novelty movie theater when you want to eat and drink and don't have time to go before or after the movie.", "author": "Catherine M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-16", "description": "I went to Alamo yesterday to watch Get Out and due to train delays due to a Snowstorm I was 5-10 minutes late and although I had reserved seats along with 6 other friends for a sold out email, they turned us away at the door due to their \"Late Policy\".\n\nOne of my friends was already in the movie waiting for us and rather than bringing in business, they said they could refund their ticket also, instead of just letting us go into the movie theatre, which for a sold out show, was very empty!!\n\nI was extremely disappointed by the way that this was dealt with because no where on the ticket did it indicate that they had a \"Late Policy\". I've been to Alamo many times before and never had a bad experience. Also, I bought my ticket through Fandango, so they were not able to refund the price!\n\nI watched them turn away multiple people due to this late policy, so really all it is doing is losing the company money and more importantly the wait staff, who benefit make money from tips. \n\nInstead of getting to watch a film I paid to see and was 5 minutes late to, I instead spent 25 minutes talking to the employees about how ridiculous this policy was. \n\nIt was overall a very uncool experience.", "author": "Sophie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "My experience was okay, but with other options in the area, I don't think that Alamo is going to be earning  my loyalty. \n\nCity Point, where Alamo is located, has a massive marketing campaign branding itself \"Brooklyn Born.\" Truth is, it could be a glossy shopping mall in Cincinnati or an airport terminal Texas. It has no character. Taking escalators up past Target and Century 21 sort of kills the vibe that they try so hard to cultivate with the old time-y theater aesthetic that hits you over the head when you walk in Alamo's doors. \n\nHonestly, do yourself a favor. Get a nice meal on Court Street, catch a movie at Cobble Hill Cinemas (a family-owned establishment), and then get a beer afterward at any one of the bars on Smith Street - better food, better experience, better price, and you're supporting local, ACTUAL Brooklyn-born businesses and people.\n\nI like that Alamo Drafthouse is so strict about talking and cell phones during the movies - that's amazing, and more cinemas should follow in their example. The theaters are pretty roomy, and the chairs are super comfortable. I also like that you can select your seats when you buy your tickets. For $16 (considering a normal movie in the city will run you $14/$16), it's not a bad deal for a very pleasant atmosphere. They've been open for three months now, though, and they definitely still have kinks. They NEED to figure out how to order food supplies properly. Our server was fine, but they were out of MANY items on the menu that were sold out. Pricing is definitely weird. My friend's soda was only two dollars left than my alcoholic drink, which was odd. \n\nWe were really excited about the bar, but the atmosphere was really odd. We walked in and tried to figure out if we needed to wait to be seated or what. We finally just sort of wandered in and took seats, at which point I asked a staff member if that was what we were supposed to do and he just shrugged and said \"sure.\" The bar is also very oddly set up, with a lot of wasted space and not enough seating. They have two giant tables in the back with almost no stools, which makes no sense. The server disappeared for long stretches of time, and getting water to go with our drinks was a struggle. I think that if you go here during peak hours, you're going to spend a lot of energy trying to get drinks, and definitely won't get a seat.", "author": "Cay V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "I went to see a movie and I arrived 2 mins after the start time. They wouldn't let me in even though we purchased our tickets beforehand. Just be aware you have to be punctual!", "author": "Clare C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Where has Alamo Drafthouse been all my moviegoing life?\n\nNo ringing cellphones \u0026 no texting during the feature, no talking, no small children (think there are exceptions at some matinees), no showing up late, no disruptive anything, \u0026 they WILL throw you out.  Plus food (giant bowls of truffle parmesan popcorn).  Plus alcohol.  Plus comfortable seating \u0026 good sightlines from anywhere.  Plus an excellent selection of movies, some mainstream (Rogue One), some arthouse-y (documentary on the band X Japan).  \n\nBefore the film, you get trailers for coming attractions interspersed with highly entertaining odd bits (foreign game shows, 1950s advice for teens, ads for long-forgotten toys) -- this isn't your local multiplex showing you an eternity of promos for junk food, the next blockbuster, or, gods help us, some crap TV series.  Even if they didn't have a no-lateness policy, it's worth getting there early, \u0026 this is coming from a generally tardy person.  You can buy your tickets online (reasonable prices too) \u0026 choose your exact seats.  So far, I've been three times \u0026 am now spoiled for most other venues ... but see below. \n\nTo be honest, it's actually been two times \u0026 a bit, since on #3 my husband, on his second visit, 15 minutes into the film, chose to swallow the contents of a perfectly good steak sandwich without chewing at all (no, don't know what possessed him; yes, he was perfectly sober; consequences not dangerous but very uncomfortable) \u0026 had to be hauled off to the ER for the GI equivalent of Roto-Rooter down his esophagus \u0026 some very puzzled looks from the doctors.  While he was off dramatically trying to undo the damage in the men's room, the staff ninjas there got me, our winter coats, \u0026 even our food (their idea) out smoothly \u0026 -- I really, really hope -- with minimal interruption to everyone else.  They could not have been more kind \u0026 helpful, but then they have always been great under far less trying circumstances.  \n\nThank you \u0026 apologies to everyone again:  y'all were heroes in a really, really idiotic situation.  I'll certainly be back once the embarrassment wears off, though Mr. Bezoar may have to settle for the multiplex or turn vegetarian.  \n\n(Minor caveat:  like pretty much every other theatre, the sound is full blast.  It's not that bad during the previews \u0026 such, but when the feature begins, the volume goes way up \u0026 you will be blown out of your seat.  Bring earplugs.)", "author": "Ann W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-21", "description": "A bit disappointed, mostly with service issues. The seats were nice and comfortable, the view was good, and the theater was clean. I went there on my birthday with my husband to see Rogue One. \n\nWe got to our seats and got our orders in for beers and two food items fifteen minutes before the scheduled show time. Kind of expected to at least get our beers within ten minutes. Five minutes into the previews I inquired about our order with another server who walked by. A couple of minutes later our server came by to confirm what our order was and informed us they were out of one of the food items. So, our ticket hadn't even been put in yet. Fortunately, our food and drinks were there with another five minutes.\n\nThe draft beers were fine but I got the chips with trio of salsa and about 1/2 of the bowl of chips was tiny, broken pieces too small to pick anything up with, like you'd find at the end of the bag. Just throw away the crumbs or use them in something else, but please don't serve them with salsa and charge me for them.", "author": "Kirstie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-12", "description": "First of all the map for choosing seats doesn't show where the tables are, or that there are tables. I was not informed that servers would be walking n front of the screen throughout the film. Due to dietary restrictions and basic understanding of human health I cannot eat a single item on the menu, but am medically required to eat something every two hours. So I ate a few strawberries. A waitress immediately came over in the middle of the movie to be a total A-hole and tell me I can't have outside food there. I couldn't argue it because the movie was on. The whole atmosphere is uncomfortable because it's a restaurant in a movie theatre. I had to smell cooked flesh throughout my film, which is nauseating. The people next to me ordered everything on the menu! I shared a table with a stranger, despite choosing a seat away from people. This environment may appeal to some, but not me. They don't serve anything nutritious, vegan, non-fried, or inexpensive. The whole set up is very distracting. It kind of ruined my movie going experience, which I seldom get to enjoy because it's expensive. I went here to avoid crowds of kids at Wonder Woman, but crowds of kids is way better than this! Will never go back.", "author": "Marie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-08", "description": "Good seats and decent sound. However servers constantly going back and forth throughout the movie was really distracting. The scent of the food also detracted from the experience. Overall would probably only come back if there was a no-dining screening.", "author": "Ale P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "This place is heaven on earth for movies\n\nPro- Food to your table/seat. Tons of legroom. Great menu. Best seats. Great screen and room. Waiter service brought to your seat. Unlimited refills on soda\n\nMinor minor minors - cons - tad pricey food but really worth it.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Amazing theater. Very comfortable seats. Food and service were both excellent. That truffle popcorn. So good. They must have worked through the new growing pains because everything ran smoothly at our sold out screening. We will certainly be going back soon.", "author": "Eric N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-17", "description": "Went here with my husband for the first time this past Sunday to watch La La Land. We got to our seats about 15 minutes before the movies was supposed to start, and my husband ordered a beer from our waitress straight away. He then had to remind our waitress about it, and it probably took 15 minutes in to the movie before it showed up. We then ordered a drink for me and some hot wings. The drink showed up after another 15 minutes, and it probably took an hour into the movie the hot wings showed up. They were really delicious though! \nWe then ordered another round of drinks and a sandwich to split, the waitress came and picked up our order and then.. nothing. That second order just never showed up. It wasn't on the check that they give out by the end of the movie so I guess they must have just thrown out our order?\nEither way, really disappointing.", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "We love the addition to BK. Great theater, food and bar!!!  We'll be there often I imagine :)", "author": "william p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "I've been here 16 times already. Its my go to movie theater you have a great audience who are not disrespectful, the food is usually a hit with me delicious (although rarely it has its off days). My boyfriend and I always sit in the front row, yeah its close but so worth the reclining chairs. $15 for a movie ticket is worth it for the movie experience alone. I went to the AMC and movie tickets are $17 dollars not only that but your selection of food is so limited and not worth it. if you're sitting anywhere that's not in the side seats you have to go over people to use the bathroom if you need to which sucks. But at the Alamo there is so much space you have an aisle between you and the next row. I wont go to another movie theater because it is not worth it when you have the Alamo. Not only that but you can become a member free they give you free movie tickets every year even on your birthday and the more you go the more rewards to unlock!", "author": "Maricruz S."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}