{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "I was worried that this was just another sign of gentrification apocalypse given its location inside the behemoth \"City Point\", but it's actually rather a nice joint, and not terribly expensive. It has personality.\n\nI have seen two films here and each has been preceded by really fun Alamo-made videos that go with the theme of the film.\n\nThe food is pretty great, and there's SO much on tap. Plenty of space, and seats are comfy. Check it out!", "author": "Karen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "I've never been to a dine-in movie theater until Alamo opened down the street from my apartment...and now I've been there more times than I can count! \n\nMy first experience was perfect. We tried the truffle popcorn and chips and queso - both quite delicious. The servers were quiet and the whole experience/concept was wonderful. My second time around, in one of the smaller theaters, was a lower star experience. They didn't bring us our orders in time, ended up giving my credit card/bill to sign to the table next to us...which I'll chalk it up to being new.\n\nSince then, I've come almost every other weekend. Food-wise, stick to the truffle popcorn, the baked pretzels, the flatbreads and the chips \u0026 queso. Don't get the wings, the glaze was too sweet. They also have draft Saranac rootbeer, a personal favorite of mine, along with their Moscow mules. \n\nGet there early, so that you can get your order in sooner, stick to the better menu items and enjoy the show. Also, just buy the tickets via their site and download an e-ticket to skip the line. I LOVE having a movie theater so close to home.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Cool concept - kudos for protecting cinema from texters and noisey guests!  Food is also great too!", "author": "Matthew O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Can't beat this for a movie! Clean, friendly, great place. The drink menu is excellent. So many craft beers.", "author": "Jess F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "It's a little hard to moviepass because it's so popular and so small a theater, the prices for food and drink can be quite a lot (and maybe not worth the price - the avocado toast was a little generic feeling and the cookies are a bit too sweet), and it doesn't have the selection of indie movies Alamo used to have (they lean much more towards popular fare now). However, for what they do, Alamo is still a great vibe - be sure to get your ticket early and try out some of their milkshakes!", "author": "Winn P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "Such a fan of this concept!! Dinner and a movie - at the same time!!\n\nWatched Wonder Woman here, which may also be why I had such a fantastic time. I also liked having napkins handy when I was bursting into tears! \n\nThai wings were awesome. A bit awkward to eat in the dark, but delicious! \n\nI should've gone with the popcorn (they're served in big mixing bowls!) instead of the fries. The fries were not great. Fried pickles and pretzels were good! \n\nHusband loved that he could get beer refills without getting up! The staff were super unobtrusive and were like ninjas in dropping off food and beverages! Checks were dropped efficiently 40 minutes before the movie was going to end, and the entire experience was great! Will definitely be back.", "author": "Joanna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "I have been waiting for this new theater, Alamo to complete construction and open up in Brooklyn for a while. When it was finally done, we went for a visit in December 2016 to see Rogue One: A Star Wars Story. \n\nWhen we found an entrance, we were lost for just few seconds. They have clear signs everywhere, and we quickly found out the theater is located on the 4th floor. \n\nRight at the entrance was a huge black and white photo of New York City, and some kind of silver triangle thing in front of it. They also had a few planes hanging from the ceiling. It was for taking a King Kong photo of yourself! \n\nThe theater was nice size, and since it is just built, it was super clean from top to bottom. The screen was a nice large size, great for an action movie! And everything was brand new - the seats, tables, carpeting - everything!\n\nAnd the seat number is placed on the table, right in front of it. Yes, this is seat assigned theater, which I prefer. It is always good to have your own seat. But... I must mention, no one, not a single staff, checked our movie ticket. Not when we walked in to Alamo, and not when we walked into the theater. I mean, anyone could have taken our seat, without having a ticket! I hope they are more careful and efficient nowadays...\n\nThe food was great, the movie was really awesome, but the only thing was, the experience of watching the movie. They have wonderful policies like \"No Texting, Talking, Cell Phone Policy\" and \"No Latecomers Policy.\" However, we saw there were several people allowed to enter the theater after the movie had started. But that was not the worst part. The horrible thing was that there was a crying baby in the theater. And the baby cried and cried for a while... The mother would not take the baby outside, and that really distracted us from enjoying the movie. The staff never came to handle the situation. Alamo allows mother-and-baby duo on certain days of the week, and that's great, but when the baby starts to cry and won't stop, please consider the other patrons and step outside until the baby calms down... And if the customer is not doing so, they should have a staff who talks to them and get them outside. For this reason, I am not sure if I want to go back  to Alamo...", "author": "June S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "Alamo was a nice theatre. I LOVED this Thai wings, YUM! Cookie and ice cream was AMAZING as well! I went to see Logan \u0026 it was a GREAT movie a bit sad at the end. Overall a GREAT experience at Alamo I will be back to see the Belko Experiment this weekend! \nOnly issue is the waiters running in front of you with trays and stuff, but after a while you don't even notice them anymore.", "author": "Brytnie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "It was an enjoyable experience. The staff scurrying around to deliver our food is quite a sight to see. I'm just wondering if there backs hurt. This was definitely the right choice to treat myself to a movie I wanted to watch alone. The food here is decent and the price is around the same as a restaurant in the area. I got the Thai wings and they were pretty good. The Moscow mule was also on par with the norm.", "author": "Antoinette C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "Alamo Drafthouse takes an indie-city dream from the slacker-enclaves like Portland and translates it into a metropolitan environment.\n\nFor the most part, they do a really nice job: huge, movie-theater screens (vs. smaller screens at places like Nitehawk); good food and excellent beer, decent seats, and servers who do their best to unobtrusively take and fulfill your orders in the dark, with think aisles. \n\nI was impressed at the admirable effort of the staff to run down the aisles like ballboys and girls in a tennis game. They got it mostly right, with a couple of key exceptions (brought me the wrong drink--thought we were all confused having to whisper about it, and never brought my friend's order at all). With the added challenges of serving in the dark, it's understandable that they have less than a 100% hit rate. And it's tricky flagging down your server to rectify missteps when you're likely to disrupt the audience's experience.\n\nThey can probably benefit from some policies (such as getting everyone in early and orders in before the movie starts). I understand that would take away the flexibility of having the customer order whenever and however they like, so anyone can strut in a few minutes late and still get their drink on, but it could also improve the accuracy of the orders. Just a suggestion.\n\nOther than that, I had a good time. The brisket burger and fries were pretty good, if somewhat overpriced, and the Other Half IPA was spot on.", "author": "Yan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "Hmmm. On the fence about whether this is a 3 or 4 stars, so here's my thinking:\n\nLIKES: \nVictory program means free birthday ticket. And you can use it 30 days out, which is an especially great policy if you were born on or around Christmas like yours truly.\n\nLike Nitehawk, the fun pre-show reel is made with lots of love. On a recent viewing, this meant an entire half-hour of Bowie deep cuts, from his recitation of Baal to a full theater trailer for The Hunger. God bless the person who made this, as it brought me joy.\n\nThe screens are massive and crystal-clear and the sound system is really crisp.\n\nThe tables are truly spacious and designed thoughtfully. There's also a lot of leg room.\n\nThe Guest Services folks are helpful and nice.\n\nDISLIKES:\nThe food is simply too expensive. $7 is the cheapest beer; $8 the cheapest snack (a COOKIE!), and most of the items range around $14-16, each. This means for 2 people, tickets, popcorn, and another snack (say a cookie or chips or wings or whatever) come out to about $60!!! That's without ANY alcohol or entree. Yikes -- Makes me want to Netflix \u0026 chill!\n\nThe popcorn sucks! It's that stale stuff that you can't dress up. I tried both the herb parmesan (said herbs nowhere to be found) and the truffle parmesan butter (soooo peppery). They give you TONS, so that's nice, but I'd rather have my popcorn taste like 10-20% better.\n\nPaired seating means an annoying couple might ask you to switch seats if you are solo, thus messing up everyone's ordering and leaving you to contemplate why fully-grown adults can't either view the seating charts in advance, or sever their precious umbilical cord for 2 hours. \n\nThe third row forward is borderline uncomfortable if you have any eyesight issues whatsoever.\n\nThe upstairs bathroom is hella crowded. Just another grinding reminder that the world doesn't understand the relationship between women, their bladders, and a big gulp.\n\n---\n\nBasically, for a must-see blockbuster, I think it'd be worth the reserved seating to relieve hassle, as long as you were having dinner elsewhere before or after. But for arthouse releases it's less of a draw; you can easily support nearby BAM and get the same stale popcorn for less.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "Such an awesome movie viewing experience . Amazing food and drinks . Incredible wait staff , super helpful . This theater also plays interesting indie films and their back films . So bummed I missed Mean Girls night . Such creative menu and themes . Would  definitely be back again !", "author": "Ana C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-19", "description": "Arrived to the theater early and had a drink at the bar. I could see where they were going with the decor (specimens of dead animals in jars, velvet curtains, ya know, very trendy Brooklyn), but in execution, it looked artificial. The drinks were fine, served in nice crystal. Now, this is where things went sour. My friend was running 10 minutes late, and we were informed that seating closes 5-10 minutes from the start time. That bit of information would have been helpful at the purchase of tickets or even in the email confirmation. Additionally, it makes no sense why they would close seating... it's a dine in theater. Aren't people walking around the whole time? Whatever, anyway, they were nice to refund us. We decided to have another drink at the bar area, and since no one greeted us, we sat down at a table. About 10 minutes in, a server/hostess idk and idc, asked us in a very accusatory manner who we were and WHY we were there. We explained we missed our movie, but that we were having a drink while we decided what we were going to do. She asked us again, if someone told us to sit down, and we were like... um no. Then she condescendingly told us that tables were for table service only. We apologized, but given her off putting and aggressive tone, I had to let her know I was displeased. The least she could have done was politely let us know, and point us to the bar. Yeah... definitely not worth it. Other dine-in movie theaters in Brooklyn are much more welcoming, so I'll be bringing my business there.", "author": "Chrissy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "Walked into here expecting a normal viewing of the movie Beauty and the Beast but instead was presented with fancy service and comfortable chairs. \n\nThe place is clean, our waitress was friendly, and the food was yummy. There is a small table between every two chairs so the cinema is ideally made to sit in pairs. My friend and I ordered the chips \u0026 trio of salsas (~$12), a banana split shake (~$9), and a margarita (~$9). The \"trio of salsas\" consisted of salsa with pico de gallo, guacamole, and not sure what the third sauce was but tasted great nonetheless. The shake was also delicious and our entire experience was just perfect. \n\nA ticket is $15~ each and the menu is pretty pricey but what can you expect from a movie theater that offers food/drink service? \n\nOverall, I would definitely recommend this place if you're looking for a movie experience that offers more than just sitting in hard chairs :)", "author": "Monet M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "There is no ten star option so here are five. The food is good. The truffle popcorn is sublime. The theater is silent. This is a theater for adults that love film, not a garbage hole for children to make noise/ make out. Alamo is fairly priced for the level of the experience. You feel like royalty reclining in the seats, ordering wine and cocktails and eating either a meal or some snacks. The staff is really friendly (you can talk to them before the film starts). They run in and out silently and efficiently continuing to supply whatever you need. \n\nMy husband likes going to the movies again! This is new, after EIGHTEEN YEARS trying to get him to enjoy movies! My in-laws are getting an Alamo in their city, we're so excited for them!\n\nI saw \"Won't You Be My Neighbor\" and that was lovely. Excellent film, but also excellent service and very good food. \n\nThen I saw \"Shouting at the Screen.\" This was a chance to see an amazing comic, Wyat Cenac, for a very reasonable price. And he and Donwill absolutely delivered. Comedy over the Blaxploitation movie \"Slaughter.\" So creative, so woke, just brilliant. And also truffle popcorn. Love.", "author": "Tai L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Great reserved seats, loads of room, nothing in the way of your view of the large screens. The food is good and they have a great craft beer selection and  a full bar menu. Great experience, so glad to see this venue in Brooklyn.", "author": "Shelton H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "This is the movie theater you've been waiting for. Between the pleasant and professional staff to the clean facility with new touches to the delicious and vast menu...this place just wins. And to top it off, the customers are treated with respect and provided with opportunities to see current movies in big comfy chairs. Worth it. I can't wait until several locations open because this is what moviegoing is supposed to be. Literally the regular movies at 50 cents more than in other theaters. Why would you ever do movies like that again.", "author": "Reshard R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "This was my second experience going to a dine in movie theatre, and I was satisfied. The seats were big and had enough room to comfortably get up and down. The tables were perfect size as well. \n\nHowever, I was not satisfied with the service, it took us nearly 45 minutes to get our food and they only came through 3 times through the movie to pick up orders. I requested a water in the beginning of the movie which I never got. \n\nI ordered the fries pickles and fries, the fries were a very large portion that I don't think one person could ever finish. The fried pickles were really good though, came out very hot and crunchy.", "author": "Shannon F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Bizarre yet fun, low key yet unique - Alamo cinema is the weird kid among all others. It has the weirdest cinema bar - with death masks of people from the past as well as specimen of dead infants. It has the weirdest flyers in the corridor - monsters, sex, aliens as if you were going to watch a horror movie.\n\nYet it also screens wonderful movies (the movie selection is semi-indie - with some blockbusters like Arrival, La La Land, as well as good indie - Manchester by the Sea and international movies - like Handmaiden), with the unique service of real food and drinks DURING the movie without disturbing anyone. The hummus with chips and chicken on a stick are stellar. The smoothie with rum is outstanding (I love strawberry cheesecake smoothie + rum). \n\nMovie ticket is fairly price like other place ($15.1 for a ticket) and $3 additional if you book online. Food is $$ priced - a smoothie is around $10 and an appetizer is around the same.\n\nIf it is your first time here, REMEMBER TO COME ON TIME! If you are late for more than like 10~15 minutes, unlike other cinemas, you won't be allowed to go in and have to reschedule your tickets. Worried about servers disturbing everyone during the movie serving food? They are like ninjas. Just sit back and enjoy!", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "extremely rude staff at guest services. to start with, they had changed our seats without letting us know and so we were not able to sit with our group of friends. \n\nwe were not able to resolve our seating issue because we were additionally being rushed to go into the theater because they have a \"door closing\" policy and no one can enter the theater after the doors are closed. which means, our friend who arrived only 7 minutes after us missed the movie and lost $17. this policy is outrageous consider there is staff walking in and out of the rows delivering food, which is extremely distracting. \n\nonce in the theater, we felt uncomfortable with the amount of strict rules we had to comply by. our popcorn, stale, cold and barely palatable was $9. \n\noverall, will not be returning nor do i recommend it.", "author": "Matty S."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}