{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Went to ALAMO DRAFTHOUSE on Oct-28-16. I like how the the cinema is setup. Nice large screen the seats are comfortable.  The staff lady- I forgot her name- was courteous. I hope to come by again especially for the independent and Asian movies...", "author": "kevin h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-26", "description": "Last Saturday my friends and I arrived exactly 9 minutes late to the 9:30pm showing of Sorry to Bother You. The movie trailers were definitely still playing. As we were about to enter theater 7, a rushing staff member immediately busts out of nowhere to tell us that he cannot allow us inside because they have no more seats available. He told us that we could get tickets to another showing or ask for a refund. This was very confusing for me since I had paid for 4 seats five days in advance. When we tried getting tickets for a later showing, we were told that there were no more seats for that showing either. I had no choice but to ask for a refund and make other plans. So early the next day, I called the theater to inquire about why we weren't allowed to enter after I had preselected our seats several days in advance. I asked if our seats had been given away. The person who took my call said that happened because we arrived late. How is 9 minutes considered late? Their website does not let ticket buyers know about a lateness policy. On top of that, we did not at any point receive any apologies from the man who stopped us from entering, the woman who issued the refund, or the man who took my call. This place has potential but the staff is very poorly trained. They ruin what could otherwise be a great theater experience. My suggestion is to take your business elsewhere like I did. The next day I ended up watching the movie at Cinepolis.", "author": "Yvette M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "The theater itself is nice and the wax museum bar has good drinks, however the service during the movie was awful. We were one of the first people in the theater and one of the first people to order food. We were one of the last people to even receive our order. I had to talk to three different people, all of them apologizing for us not receiving our food. Everyone around us got their food before us even though they ordered after us. My boyfriend didn't even get what he ordered and instead they offered a free burger. The food arrived 15 mins prior to the end of the movie and 2 hours after we initially ordered it. \n\nI would not recommend going to this theater for a full dinner. Maybe just some drinks and snacks. Not worth the hassle or the money. Extremely disappointed.", "author": "Christine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "I've been to Alamo twice now and each time I've had a great experience.  \n\nThe first thing I like is that ticket prices are usually less (by $2-$4) than I would pay going to the AMC/Regal near me and that's for the normal seats that don't recline.  The second thing that makes this place for me is their popcorn and soda serving, you get both directly to your seat at prices that are easily comparable to the other theaters and they both have free refills (which are again brought to you at your seat).   I've never ordered food or alcohol there but the prices on both seem reasonable, especially beer which can be had for $4-8 a pint (or can).  Lastly, the previews are only for a few films they're showing and then it's into the film rather than a long drudge through everything the industry is peddling.\n\nTheir policies regarding being late to a film (once the lights have darkened you've missed your film) and cell phones (don't even take it out) are harsh but quite frankly that's part of the reason to go to this place.   It's no nonsense, you don't have people walking in during the film trying to find their seats and scrambling in front of you or having you move to get in and you don't have people on their cellphones pulling you out of the movie.  If you don't like the idea of being punctual or of being detached from the outside world for any period of time, this place isn't for you.\n\nIf you're looking for a fun movie experience, go to Shouting at the Screen with Wyatt Cenac!", "author": "Jesse K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "I've always attended my local theater, but since it wasn't playing the movie I wanted to see, I decided to try this new theater. The Alamo is situated in a grandiose building on the 4th floor.  Once you arrive, you're welcomed by an interesting almost 80's esque decor with its own little House of Wax (which I didn't attend). \n\nThey don't accept tickets, but you walk in and find your seat by yourself or through the help of their ushers. Once seated, you're introduced to your waitress/waiter about how the process works in terms of ordering food/drinks while watching a movie. Afterwards, she checks your movie ticket which I had on my phone.  \n\nOnce the preview started, I began looking through their menu and ordered what I wanted on a paper card they had at each table. Approximately 20min, I finally got my order of popcorn and drink. I will say the Herb Parmesan was really good, but a lot of popcorn for one person.  These bowls are definitely to be shared.  Don't put the bowl in your lap or you'll get grease on your pants like I did.\n\nThe screen was a good size, and the seating was roomie with a great view and hardly any heads in my view.  \n\nThe con's I have is that the food is a bit pricey imo.  I also think some foods can be somewhat of a distraction similar to someone on the subway eating McDonalds....its not terrible, but noticeable to me.\n\nOverall, this is my new go-to theater.  Can't wait to see my next movie here.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-17", "description": "I didn't expect this place to be in such a large shopping complex. But once inside, that didn't matter. The servers let you know the deal by informing you thoroughly about how it all works. Of course, I ate before knowing that the food and drinks were too expensive - but stands to reason since the place is pretty unusual (relative to other movie theaters). It just felt a little too commercial in there - but whatever! The movie ticket cost the same as anywhere else (and was less than some others I saw).", "author": "Halina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "love this theatre. comfy chairs, with people who serve you. is it cheap? nah, but the menu is pretty large and varies. much better than a regular theatre. also, after or before a movie..head down to house of wax for a drink or to check out some cool shit.", "author": "Desiree D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "The three stars are for the New Theater.  The toilets were disgusting, like you could NOT use them at all.  14 stalls and 13 dirty the first part of the movie and forget it when we got out.  \n\nPlease do better I won't be back, I feel a clean restroom is paramount.  And the food was a NAW, the service and servers were super nice.  Popcorn cold, huh! Daym", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "4 stars for concept, ambience and food.\n3 stars for service, server was very pleasant and friendly, but had to deduct one star from this for timing. (See below.)\n\nWatched a movie here last week, arrived at 7pm for a 7:10pm movie. The hallways are narrow and hung with colorful vintage 40-50's style movie theater posters. It felt like they were trying to revive the old Hollywood glamour of visiting a theater. (Think of the modern snazzy bowling alley concept.) It was also much cleaner and ritzier than most regular theaters. Glad there were assigned seats so we didn't have to scrounge in the dark worrying about getting good seats if we weren't there early. \n\nThe menus fit into a handy slide-in shelf right below your personal mini table. There are snacks, sandwiches and entrees and also an extensive alcoholic beverage menu. I was impressed with the number of local/micro-brewery beers they carried. The waitress directed us to write down our orders and she would come by to collect them. My friends ordered the truffle Parmesan butter popcorn $9 (yum, though pricy), baked pretzels $9, chips and trio of salsas $10. We also ordered beers and a glass of wine. The snacks came out about a third of the way thru the movie. The server mentioned we could sample up to three beers or wines to decide what we wanted--great idea! However these came around two-thirds into the movie, and out of the three beers and two wines one of my friend's and I had asked for, only one beer and two wines were available. I wish they told us earlier! Also I ended up not liking the one that was available but it was too late in the movie to try another one and order the beer in time before the movie ended. Afterwards we learned the server was in training so they automatically deducted 15% from the bill which was considerate, which is why I rounded up the overall 3.5 to a 4 star. \n\nIf you appreciate movies and want to make a night out of it, and comfortable chairs and fancier snack/food options make you happy, then Alamo is your place.", "author": "Susan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-05", "description": "Came here Christmas night to see Sing! \nGood date-night theater, but not sure if this will be my go-to when I need to take my daughter to see a family?movie.\nI do like the dining experience, although it's a lil distraction to have the attendants walking up and down for orders. There should be a different system. The seats are uncomfortable; it's like you are sitting at a right desk in class. \nOn a more positive side, The French fries were the BOMB! I think we also had the nachos dip which was good. \nOverall decent experience. Close to home but won't be my movie experience of choice. I'm an AMC girl.", "author": "Mitch. J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Watched Doctor Strange at their noon showing, and tickets were only $11! Obviously, they eventually do rip you off with ridiculously overpriced menu items, and I suppose that's standard. My boyfriend and I shared a popcorn ($8) and a non-alcoholic strawberry milkshake. The servers/kitchen had mixed up our order and brought us an alcoholic drink instead, but once we pointed it out to them, they were very understanding and replaced the wrong order with the right one. The seats were very comfortable, food was served on time, and we had a great time. We will definitely be coming back.\n\nAs of now, all menu items except alcohol are 15% off because the staff is still in training :) Take advantage!", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "UPDATE: I was really happy to find I was emailed in relation to my bad experience and the customer service for Alamo Drafthouse is beyond great. They really care. I'll be going back again thanks to the lovely staff and my past good experiences.", "author": "Katie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-21", "description": "This movie theater truly sucks. The service is terrible, the people who work there are pretentious jerks, and I've yet to have a good experience there. Save your money for the Nitehawk.", "author": "Eleonore C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "What's not to like...\nComfy seats....check!\nYummy food.....check!\nGreat drinks......check check!\n\nI've been here a few times and I'm always happy as a clam when I leave. \n\nI will say it's not the type of theater you go to to see a super serious film that you must focus on (i.e. Manchester by the Sea or what have you) but for a fun comfy experience it's the best! \n\nThe pretzels are so yummy as is the Bianca flatbread. The drinks are good and strong they have a great draft beer selection. You can also get a free giant glass of ice cold water if you want.... just write it down. \n\nI usually leave full and tipsy without spending anymore than I would have at a regular movie theater. Especially bc after eating overpriced stale popcorn and soda at a regular movie theater I need to stop and eat some real food elsewhere!", "author": "Jamie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Watched Moonlight ($14 per ticket) during the theater's opening week and had a good experience. Food was good, service was reliable and the food was surprisingly good. We had the salmon salad and chicken sandwich. \n\nWe had none of the issues other reviewers have mentioned. We'll be back!", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I enjoyed the Alamo Drafthouse the SECOND TIME ! it was the best ! The food was hot the waitress was nice ! Gave a tip , I love this placeee ! Going back more and more times !!", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "Let me start this by saying I wish I could give a higher rating. My mother and I saw that one of our favorite movies, Crossing Delancey would be playing so we decided to try out the Alamo Drafthouse Cinema. We were quite early and were told we had to wait to go upstairs - okay. The location, City Point is brand new so while they are going to put in other things like a Trader Joes, a Target and a food court, only Century 21 is open thus far. We went to look at clothes before returning to the theatre.\n\nNo staff member even acknowledged us as we made our way up the escalator and there was no one to tell us which was our theatre. Instead, we had to look at all the possible doors to see where we were meant to go. I think that was odd considering I didn't have to show anyone my ticket and could've just walked in. I understand that the theatre is new but I found that to be a little concerning.\n\nFinding our seats, we immediately started to look at the menu. The theatre is set up with tables and a light so you can read the menu when the movie is going on. I don't know what the pre-show entertainment was but I was more confused than entertained by it. That might just be personal opinion though.\n\nOne of the waitresses came over to explain to us how it worked and she was so sweet. I wish I'd gotten her name but she was bubbly and full of recommendations. Mom and I purposely arrived early after seeing reviews that the food service was slow. After a lot of discussion, we decided on a banana split milkshake, a coffee, a chicken caesar salad and a mushroom flatbread pizza.\n\nLet me preface this by saying I cook a lot. I'm not a professional by any means but I know a lot about food from cooking as well as watching the Food Network. Or maybe I just am sensitive, who knows? The drinks arrived promptly. The shake was absolutely delicious but for the price, we should've gotten one of those metal containers with all the leftovers. The coffee was french press, which I don't like as much because it is always so much more bitter but it was good. They even gave us a cup of milk and not those little creamers.\n\nThe issue lies in the food. The flatbread came first and it was just so overspiced. Nothing about the flatbread was supposed to be spicy but it was so salty and so spicy that my mother wouldn't even eat it. I think if it weren't spicy, it would've been delicious. I ate it all, mostly because I didn't want to waste the money more-so than because it was absolutely the best thing I've ever eaten.\n\nWe waited and waited for the salad. It was a good portion through the movie when we had to ask again what happened to it. I don't know if it was the kitchen or if there was some sort of mistake but eventually we got it and... well, the croutons were good. We asked for dressing on the side and got a very small container of it. The lettuce was fine because who could mess up lettuce.... but as we saw before with the flatbread, the chicken itself was so heavily spiced that it was almost inedible. Mom ended up eating around it. We also had to get two more containers of dressing because that one little container couldn't possibly coat the salad. It took a while to get the extra dressings.\n\nI appreciate the idea of Alamo Drafthouse and I think I would try it again. The seats were good, we had a great view of the movie and I enjoyed watching it. However, the overall experience was definitely brought down by the food itself. I realize that they've basically just opened and need to work out some kinks but I think it is the menu that needs a lighter touch. I like spicy things when they are meant to be spicy. A mushroom flatbread and chicken caesar salad should never be spicy!", "author": "Amy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "The customer service at this theater is lacking. All employees should go back for remedial customer service training.  I arrive several minutes late to the theater admittedly but I was in theater number 5 looking for my seat when a representative told me I was late to the showing and must leave the area. The movie had not begun as of yet, the only thing showing on the big screen was propaganda for future showings. When I went to the Guest Services area the representative restated the policy that I was late and would give me a rainchech for a future showing.  I had two minors (teenagers) left in the theater and the representative did not care they were alone. Specifically,  when the theater's policy dose not allow unaccompanied minors without adult supervision.  The only thing the representative should have done was to help me to my seat being I was in theater 5 already but refused to help. I would like to warn others that this theater lacks customer service and stay clear of this theater.  You would think for what they charge to visit this establishment they would exercise better customer service skills. Don't go to Alamo!! Find a better theater to spend your time and hard earned money at. Also, tell all your friends and family to avoid this place and seek a better time elsewhere.", "author": "Robert F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "I love the idea of an eat in movie theater!! A really great experience, awesome for a date night. The service was exceptional, not too long of a wait for the drinks and food. We ordered a dirty martini - it was okay. What was really good was the milk punch! (A super spiked milkshake). The popcorn is okay, kinda stale, no complaints about the flavor or portion though. Also the fried pickles! A must have.\nAll in all, great experience.", "author": "Avee C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "There were cockroaches everywhere, the bar, the theatre, the bathrooms. I can only imagine what the conditions are like in the kitchen! When I complained to the management about the issue, they responded \"it's an old building, it's difficult to control\". What kind of answer is that??? And, while their response was completely unacceptable, it was their attitude that made it even worse. They asked us to leave because \"we were making a scene\". When I pay $16 per person to see a movie, I don't expect to see food all over the floor and cockroaches crawling all over the place. Who are these people??? We ran into another couple that was asked to leave because they had checked their cell phone for messages from their babysitter that was watching their 8 month old daughter. WTH??? Whose running this place, Hitler??? I appreciate having rules that are meant to handle unruly patrons, but these people are ridiculous. I've seen many good reviews of this venue and drove over a toll bridge and paid $50 to park my car to go here. Needless to say, I was quite disappointed. Seems like the management here is more interested in bossing people around than dealing with real issues like sanitation, cockroaches and filthy bathrooms.", "author": "Anthony D."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}