{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Movies. Food. Booze.  \nThey are all on the tad pricey side, even for NYC, but I guess that's the price for full-service in-show dining.\nCome early for fun pre-show clips, usually related to the movie at hand. \n99% of the time I love the Quiet Zone (tm), but it was a bit of a downer during some movies where you just want that audience energy.", "author": "rk t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "The Alamo Drafthouse is a true gem in Brooklyn. While I've never been to the original location in Austin, the entire experience is unparalleled to any other theater nearby. The prices for food and drink are a bit steep but the experience more than makes up for it. The seats are comfortable and the ambiance is similar to watching a movie in your own living room. The thing I like best about the theater is the selection of movies. Of course, all the critically-acclaimed, new releases are showing here but they have a lot older films that are played throughout the year, as well. I've seen two classic films within the last few months, in addition to Lady Bird and American Assassin. If you do go the food route, despite the price, it's good. Or maybe I was just starving that night? lol... Either way, I recommend the drafthouse and feel fortunate we have such a cool experience right here in our own backyard.", "author": "Brandon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "I'm an Alamo Drafthouse fan. There are sooome imitators popping up here and there, but Alamo will always be the best and most innovative to the standard theater experience. This one location is one of THE most beautiful of the Alamos yet!", "author": "Hamm B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Been here at least five times now and we are so lucky to have this nearby!\n\nGreat milkshakes popcorn, and hot dogs. Flatbread is salty and alright, quinoa bowl does the job....although I must say maybe food is less spectacular when you're eating in the dark?\n\nMaybe they should try charcuterie and cheese with crackers? \n\nAnyway leather seats are amazing, the theater is spacious, clean, wonderful and top notch. There's even an awesome Museum of Wax bar connected to the theater with cool cocktails and even way cooler anatomical wax replicas. If you love Mutter Museum in philly, you'll feel right at home!\n\nI refuse to watch movies anywhere else now. Awesome pre-trailer videos, no commercials, personal and comfy. And milkshakes if you want it! Sign up for their Victory Club, earn points, and get more free food!\n\nWhy would you ever go anywhere else for basically the same price?? We had friends in town and were dragged to a Regal Cinemas last month and the difference was stark and depressing. Never again!", "author": "Ash C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Big screens, clean, great service, central location...favorite movie theater in BK. Get there at least 1 hour early if you're using moviepass", "author": "Dan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-16", "description": "Comfy seats, getting beer delivered is cool and the staff is unobtrusive.\n\nI am not a picky eater but what the Sam Heck are they doing serving what I think must have been the mushroom flatbread.  The woman next to me ordered it and it was ridiculously pungent.  It's just crazy.  She was picking at it for over 30 minutes of the movie, and then some time before the staff cleared the dish.  It was overwhelming.  Don't get me wrong, I love mushrooms, but this was just... I don't know.  Mushroom cream might have been the issue.  If you're going to serve food in this environment, it really shouldn't attack the senses.", "author": "Jon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "I was very pleased with my experience here. I've been to one other theater like this, (Nitehawk), which I love, but I kind of felt like the program here is a little more fun and unique. The concept is the same -- order food and drinks from an actual menu, while watching a movie, however I loved how Alamo had so many specials, including a handful of food items and drinks that were inspired and themed based on the movie we were watching. That was a really fun touch. The theater was clean, seats were comfy, and the food was tasty. I'll have to go back and have a drink at the House of Wax bar that's attached. I also love this location because of all the other great things housed in the same building... Trader Joe's, the best Target ever, Century 21, and the amazing food hall downstairs.... I might has well just see if I can rent an apartment somewhere in there because this is probably where I'll be spending all my time from here on out!", "author": "Christina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "This place is fine if you live in the neighborhood (ticket prices are comparable to other NYC theatres), but it wasn't as cool of an experience as I would've hoped. At least not worth the 40minute commute on my end. My southwest bowl was also served cold, and not very good :/ If I ever end up here again I would just eat somewhere else beforehand but def get the truffle popcorn here! My movie also seemed weirdly loud... Though I'm not taking a star off for that bc it's probably just because I'm getting old and crabby", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "The food is expensive- this is a twice a year date night thing for me, it's an experience that I definitely enjoy.  I love hot dogs and milkshakes so this is right up my ally.  It's cute!  Check it out.", "author": "Bran F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "5 star movie going experience \n3 star dining\nEquals my 4 star rating\n\nTo date I've been there 13 times. Long enough to make a qualified review.  \n\nI love the movie going experience. Comfortable seats. Strict No talking/no texting policy. (Saw I guy get a warning last night). Great selection of films. Great special events with live Q \u0026 A's after. \nGreat classic films. Awesome projection and sound. \nBasically, Movies presented to you by people who love movies. \n\nAs far at the food. I wish it were better but it's kind of hit or miss. Some days good some days not so good.\nMy multiple experiences have been that the popcorn is hot and fresh at the 7:00 show but stale by the 9:00 show.  \nThe jerk chicken sandwich with sweet potato fries I ordered last night was downright cold. However the veggie sandwich I had a few weeks ago was piping hot. Same with the flatbreads: once cold once hot. \n\nThe mixes drinks and beer selection are awesome but the shakes seem to made from a mix. Too sweet too airy. \n\nMy biggest complaint after multiple trips is about the service. After placing your order and the first round of deliveries you can put up your order card and not see a server for 30 minutes. However this (In my experience ) is more the case In the larger theaters. \n\nAll in all this is the best place to see a show and I will still be back. I just hope they can improve their quality and service.", "author": "Leigh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "This is a great theater to go to once in a while. I didn't love most of the food but I still had a pretty good experience overall. The bottomless sodas are pretty great.\n\nThe sriracha popcorn was good at first, but the bowl is gigantic so we couldn't finish it. As the sriracha and butter cooled, it solidified and got pretty gross towards the end. I loved the Thai wings - they were my favorite out of everything we ate. They had the essence of buffalo wings but were slightly sweeter and had a pretty good level of spiciness. I was expecting to like the pancetta mac \u0026 cheese, but it turned out to be the most disappointing. The leeks were overpowering and I got sick of it after a couple bites. The jerk chicken sandwich was just okay. The chicken was super dry.\n\nThe service was really great. If you're going for the first time, you should get there early (I believe they start seating about half an hour before the movie plays) so that a server can explain the ordering system to you. It's pretty simple, you just write down your order on the sheet of paper and stand it upright. The jerk chicken sandwich originally came with sweet potato fries, but we were able to get them substituted for regular fries. Throughout the duration of the movie, the servers periodically walk through the aisles. There's no way around it, and they're pretty good with not blocking your view and being quiet, but if you're someone who hates even the smallest of distractions you might get a bit annoyed. Next time I'd probably skip the entrees and just get drinks and apps.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "I love this place. Though, it is more of a special treat than a go-to theatre, as the tickets are about $16 and you get sucked into ordering drinks and food...\n\nPros: You pick your seats beforehand... Big plus. I also would venture to say that there isn't a bad seat in the theatre... Obviously some are better than others, but you won't get stuck with a sore neck if you're in the front row. The food is better than expected for a movie theatre, and has a ton of variety. Service has always been fantastic; somehow I don't feel bothered by their rushing back and forth in the aisles. \n\nCons: the are few, and expected for what you are signing up for when you decide to go to a restaurant/movie theatre. Sometimes your neighbors are a drag... We were once next to a teenage boy who slurped an empty milkshake for the entire movie. Also, the prices are steep - as mentioned before, this is definitely a treat and not a place for regular movie watching.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "pardon, my all caps but i am quite frustrated and disturbed by what happened to myself and friends today.\n\nracism is alive and well at alamo - do not go here. they will throw you out for sending a text message - meanwhile their employees are talking non stop during the movie and they refused to give a refund!\n\nthe general manager and manager mr. thomas were incredibly offensive and egregious towards me. he used racial slurs, and said to \"get  out niggers\" \n\ndo not go here unless you want to be humiliated.", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "Went to Black Panther Event.  I did not now where the movie theater was no markers or big signs.\nI got to the movie after once again; having to figure out where it was.  \nSecond row seats DO NOT recline.  If you want food service it's best you sit by the end.  Didn't like it, no one came to me for my order.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "Giving it a 3 cuz I was really depressed that I couldn't get my seat to recline like the cool people at the function.  It's a really cool spot though. Not crazy big as far as seating but I kinda liked that about it. Venue is cool especially with the wax museum.  It's a nice spot for a classic date setting.  Dates I never go on because I'm sooooooooooo lonely, bored, busy, broke, single, and savage.  Guess that's why I stay home and showbox every night.  *Trump shrug*\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Bet someone hates me now for that. *still shrugging tho*", "author": "Brandon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "After reading a bunch of negative reviews I was very scared of the service and my date night last. I went there last night and the service was great! No complaints at all. \n\nI guess something that could bother people is the staff quickly walking around with food and drinks, in front of you and on the isle. But that really doesn't bother me at all. \n\nI had the brisket burger, flavor was delicious and they respected that I requested no tomatoes. Unless I was too drunk to notice, I had no tomatoes. My boyfriend had the lamb burger and said it was really tasty but the size should have been bigger for the price. He said \"it was half size bigger than a slider burger\" They did not change his request for normal fries instead of sweet potatoes fries. They weren't bad though. \n\nI drank the frozen margarita and he had the wise men cocktail. Both delicious and kinda strong. \n\nAll was good.", "author": "Alicia V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "I really liked the movie, Ladybird  - though this is not a movie review. The tecate was good, too(though it was served in the can with a quarter of a lime - not sure what I was supposed to do with the lime) and this is not a beer reveiw. The food, ding ding ding - this is solely a food review and sadly, it was all very salty. We split a cheese burger and a Cobb salad. Everything tasted fine, but now I need to drink a few gallons  of water. Back to the theater - the seats were very comfortable. I was struck by how everyone was so quiet in the hallways after the movie. The Alamo does a good job making it clear to patrons to keep quiet and out your cellphones away. I would go back and skip the food and just order a few drinks at the start(and visit the food Hall downstairs).", "author": "James H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-17", "description": "I used to love this place and now I officially hate it.  Their late policy is the dumbest shit I have ever encountered.  I was late 10 mins because a doctors appointment took longer than I expected and I missed seeing a movie I badly wanted to see with my family because THEY WONT LET YOU IN meanwhile you can go in and out to use the restroom no problem. So guys whatever you do, do NOT BE LATE.  I am never going back here again, I am so furious.  Terrible policy.  Really effed up my day.  I understand for theatre but for a MOVIE??? Come on guys. Get real.", "author": "Lizzy J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-02", "description": "I love the Alamo Drafthouse in San Francisco (it's in the old New Mission Theater space and they kept as many of the original theater details as possible, including the cool signage outside), so, we thought we'd check out this new addition to downtown BK and see Rogue One here on a weekday. It's too bad the developers couldn't have used an existing theater space, but, oh well. The theater is in a brand-spanking new building (that also includes Target, Trader Joe's and Century 21) and on the 3rd floor. (Note: there are elevators, but when we were there, they didn't seem to be working. Possibly b/c it's a new-ish building).\n\nYou know the score, you can eat and drink booze while watching a film. The beer menu is pretty extensive and they have specialty cocktails based on the particular film being shown. What I like most about the ADH is their zero tolerance policy for no cell phone use and no talking during the films. If you violate that policy, you will be removed from the theater. YAY!! Finally, I can watch a movie without the glow of some a-hole's phone b/c they *need* to text their friend or have to listen to someone's inane movie commentary chatter. Also, honestly, I don't think this is a place for kids, because of the no talking policy, and well, with all the beer and alcohol served it's more like a bar where one can watch a movie. So, either get a sitter or go to another movie theater. \n\nOverall, it was a so-so experience that I'll attribute to growing pains (bill mix up, took forever to get our order (almost halfway through the film to get two beers and appetizers??) because of some possible mix up-- and I presume that things will go more smoothly once they're open for longer amount of time. Well, I hope so. I'd go back in a few months to see if things have improved.* \n\nOh, and when you're buying tickets/selecting your seats online, be sure to double check the seat map and make sure you're sitting with your movie partner at the same table, rather than seated next to a stranger, at different tables.\n\n*After I wrote this, I was reading the other reviews that date back to October 2016. I'm seeing a reoccurring theme about messed up food orders or, food not appearing at all. Pretty sure three months or so is enough time to get this worked out, no?", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Be ready to spend some ca ca cash, at least $100 a head, arrive early and don't be rude. People are complaining about the policies of the theater but I think they are great; no-one likes a rude hipster, or hipsters in general. Which are the kind of people who always complain!! \"OMG can I have some gluten free, free range organic water\" LMAO fuck off hipster...anyways, getting off topic here.\n\nFood is average, image and sound is ok but fuck me sideways the service is great. I mean serving is hard enough now imagine doing that shit in the dark. \n\nI don't think is worth the price. You're better off going to Williamsburg cinemas and then going to Banter to grab drinks after the movie.", "author": "Enrique G."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}