{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "Reserved seat, but 5 minutes late and they won't seat you. Between MTA and this absurd policy hope they go out of business fast. Such a waste trying to get over there. Even 15 minutes late would be understandable. At 5 minutes, they're still showing previews. \n\nAlso, their attempt to prevent people from entering late is just fettered. Because my friend was inside. When I couldn't get in, she got up and left.", "author": "Shell H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Know before you go: Alamo enforces a VERY strict no cell phones, no talking, no arriving late policy. If your friends are the type to do any of these things, you will be asked to leave. That kind of strictness is a little uncomfortable, but I loved watching a quiet movie! Even at places such as The Angelika, people are texting and phones buzzing. Shut it off for a few hours.\n\nI've had so many movie experiences where this rule was lax or not followed by patrons and the experience was totally ruined. Not here - you have to comply or you're kicked out. A little harsh, I think, but that might be the only enforcement provision that works.\n\nThe food here is OK. The fried pickles are fun! The truffle popcorn may be the best popcorn I've ever had at a cinema. The sound of fellow patrons eating is a little annoying but you can try to book your seats away from others. I love that you can order beers and then very necessary beer refills. I'll be back.", "author": "Gigi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "It was a great experience! The costumer service was excellent. They checked on us and when the movie was over someone asked how was it. \n\nThe food is pricey but if you never been, it's worth going all out at least once. I order the chicken sandwich and my boyfriend ordered the burger with fries. The strawberry shortcake and chocolate chip milkshake was so good!!! If I wasn't full, I would have ordered another one. The only thing I didn't like was the sweet potato fries that came with my meal. So I end up eating my boyfriends fries instead which was so good.\n\nAnother thing that is weird was the seating. When ordering our tickets, on the screen we had the chance to choose where to sit. I was going to choose 6 and 7 because on the screen it looked like those seats are together but if I did that, we would have been sharing a table with a complete strangers. I WOULD RECOMMEND", "author": "Shalequa L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-20", "description": "I've heard about the Drafthouse chain for years from cinephiles I know all over the country. So I figured I would give it a shot and check it out for myself. \n\nI saw ROGUE ONE there and while I enjoyed the movie, the overall experience left a lot to be desired. \n\nFor one, it is REALLY distracting to have people walking back and forth taking orders the ENTIRE time the movie is playing. I wasn't aware that this was a feature of the theater. I had assumed people make their orders before the movie begins and get their food early on, but not through the entire screening.", "author": "Brandon E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Located on the 4th level of this shopping center with a Target \u0026 Century 21. This is one of those New Jersey-esque style dine in movie theaters. The ticket prices are affordable at roughly $17 for a 2D movie experience. They let you in 30 minutes before the start of your ticket time so you could order your drinks, entrees and or movie snacks. Each seat has pen and paper for you to write your order down, then you place it on top of the wooden box or wave it up in the air for a server to quietly come by and grab it. They bring out your order as quiet and swiftly as they possibly could to not ruin your movie experience. The service is superb at Alamo Drafthouse and this is what gives them their 4 stars. The menu items are above average priced but what do you expect from a movie theatre. $8 fried pickles, here I come! Their mocktails are DELICIOUS \u0026 super cute served in martini glasses. \n\nThe only thing that I think needs improvement are their chairs. I was magically hoping someone would tell me that it could recline the entire time. I may just be spoiled by AMC recliner chairs.", "author": "Sandy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Food was good, drinks were strong enough! Prices were decent; $30 per person and I ordered 3 (huge) chocolate chip cookies (i got a bonus cookie so I got 4!), the Mac and cheese (decent enough, moderate size portion), and a drink.", "author": "Kenya K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Great service with the food/drinks.  Understandable that sometimes refills or orders during the movie is not instantaneous.  Patience is key.\n\nThe mango/orange soda is amazing though!\n\nSeats are not as wide as others, but still an enjoyable experience.", "author": "CC N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "I'm a big fan of dine-in theaters, so I frequent Alamo \u0026 Nitehawk a lot. I love Alamo: the theater is great \u0026 very comfortable, and their service is excellent (seriously... the servers all are friendly, quick and professional). Their strict no-phone rule should be applied in every theater everywhere! The special movie nights \u0026 events are awesome and it's what keeps me coming back.\n\nHowever, the only thing stopping me from giving this a 5 star rating (like I did for Nitehawk) is the boring food. Alamo really has to step up their menu. The food isn't terrible, but it's pretty average (especially when you live in NYC and you're surrounded by stellar food everywhere). The flatbreads all taste like supermarket-quality pizza, and the majority of the menu is just underwhelming. I know this isn't a restaurant, but when a movie is playing at both Alamo \u0026 Nitehawk, and I choose Nitehawk because of the food.\n\nOther than that, you're guaranteed to have a great time here. Just don't have high expectations for the food.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "I love this place. The food is excellent-- from the really fatty, bad-for-you stuff to the vegan bowls- it's all so damn tasty! I don't think I've ever had a bad or unpleasant server, either. Lately I haven't been 100 percent into the movie picks [December picks], but I'm sure that will change with the release season. I am kicking myself for not starting a campaign to make the \"Black Panther\" shake a menu standard. While I'm happy to see the Berber wings made the jump, that shake was a religious experience for me. Thanks, Alamo! Keep up the good work.", "author": "Emily Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Love this theatre! So luxurious! For $16 you get assigned seating on soft leather chairs in a room that brings the comfort of your own living room with excellent amenities! When we walked in I was a little confused at first since there is no concession stand. Instead, the wait staff takes your order while you're seated and brings your meal/snacks to you during the showing. We had the pretzels (okay, a street pretzel or Auntie Annies are better honestly), the popcorn (so buttery yet elevated from the typical movie fare) and a black cherry soda (which was clear so first I thought we got the wrong order lol! So yummy!). The service was quick and the selections were plentiful! Looking forward to visiting again soon!", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "A totally different movie experience. You can dine at your seat from a full menu along with alcoholic beverages. There are tables in front of your seat. There is a wait staff. Sodas and teas are unlimited. They have a very strict no talking policy and cell phone use. They encourage you to complain about people who do not comply and they will get a warning and if they do it again they'll be ejected.  I hear the food is good but I did not partake. There is even a bike rack in the front of the theater if you can to bike to a movie", "author": "david l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-22", "description": "The movie and dinner dream combo is a wonderful idea IF IT WAS AFFORDABLE. At Alamo, not only do you pay for a standard-priced ticket, but their menu was even more egregious in pricing than theaters. If you want a movie, drinks, and dinner (like they advertise), be prepared to drop $50 each person.\n\nSide note: watched the girl next to us give...happy massage..to is guy, which was more entertaining than the actual Alamo experience.", "author": "Teng H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Another great experience at the Alamo drafthouse. This is how you watch a movie as a fully functioning adult. With good food and drinks! The food is actually amazing here, no lie. I am surprised at the quality every time. Like how can this be theatre food? It's so good! This location in particular was very nice. It's quiet and more laid back than some other locations where the crowd tends to get rowdy. The theatre is clean and kept up nicely. The food service is fast and efficient since the servers are very attentive. My food and drinks were delivered before the movie even started which was perfect because I was starving. For the level of service, food and movie going experience you receive this place is a great deal for a fun night out. At a good way to shake up your movie viewing experience if you're bored of the usual popcorn and stuff chair situation. I will be booking my next viewing soon!", "author": "Chris G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "The dine- in theater has reached Brooklyn! The seats are kinda roomy with a thick armrest with cup holder between each seat. Every 2 seats shares a small table for food. Though the popcorn (\u0026everything else on the menu) seems a bit expensive, it is massive! I doubt 2 bowls would fit on one table -which won't be a problem if your sharing a table with a friend. I have yet to complete a bowl! The food is -eh... The meal I enjoyed most was the Taco dish (don't recall the name but there's only one). The milk shakes are pretty good- especially the ones made for adults over 21 . \n\nBefore the movie starts you are treated to some old commercials and cartoons which are good for nostalgia and a laugh. After the \"don't talk or else\" warning, the theater suddenly gets LOUD as the movie starts. If your ears are sensitive, bring ear plugs! \n\nAlamo seats have a tendency to sell out. There are not as many seats as in a normal theater because you have more room between seats \u0026 the waiters/ waitresses need room to move about safely \u0026 discreetly. Oh! And the front row seats recline!  Seating begins a half hour before showtime. They show new movies as well as old. Check out the monthly schedule online and enjoy the show!", "author": "Taina A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "Great concept--and one of the worst meals I've ever paid money for. The idea of food, drinks and a movie is a winner. Please, please improve the food. It's all uphill from here.", "author": "Laurel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "Love this place!! I almost always get the nacho trio. I've had many other dishes here too and I've never been disappointed. The waitstaff is always pleasant and I have never left this place not having had a good time!!", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Having been to every kind of independent and mainstream movie theater, I don't see how it can get much better than this these days. Reasonable movie tickets, fun classic screenings, a unique theme, beautiful lobby space, moderately good food, and a pleasant staff. All of that equates to a 5-Star experience. I've been to some of the major chains in New York (namely AMC) and have had horrible experiences across the board.\n\nI stopped by the bar before the movie to grab a beer and gaze at some wax sculptures before heading up to the theater. I had a initial confusion as the beer available at the bar is not the same as what is available in the theater. To eat, I had some fried pickle spears (average), a jerk chicken sandwich (average) with some sweet potato fries (good!), and a trio of cookies (great). The waitstaff were well-trained, pleasant, and non-intrusive during the screening.", "author": "Colin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "I went four times in the last week. This is huge before this I had it been to a movie in almost a year. Really love this place: the convenience of ordering real food to your chair. For the most part the staff is great but they do miss things sometimes but overall strong effort. In addition I think maybe special orders are just ignored, e. g. Extra sauce, no onions, etc. \nFood rating shortcut: Love this *, Skip this **, Ok©.\nBeef Tacos ** - The flavors are ok but it was kind of mushy. Corn tortilla was not heated or grilled. Personally, I don't like that uncooked tortilla texture. Vegan Burger© - The flavors are ok but again, kind of mushy which may be just distinctive of veggie burgers in general. Truffle Parmesan Popcorn** - Bleech! Too much cheese. So messy and did not taste good. HORRIBLE!! Chips \u0026 Trio of Salsas* - Delicious!, Brooklyn Brisket Burger * - Good burger. Avocado Toast ** - A little salty but use the wedge of  lime and Voila! Tasty. Cauliflower Bites** - Very good. Accompanying Ranch sauce gives a much more savory taste with a fatty feel. Not necessarily making them better. Strawberry Cheesecake Shake ** - Very tasty and very filling.", "author": "Me 2."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "This was my second time here and I enjoyed it S much as the first. The food is tasty enough and the drink options are literally endless. \n\nIf I'm looking for a quiet place to see a great movie, with the option to eat and drink this is it!!!", "author": "Jeanene B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "The only reason why I'm giving this place 4 stars is because the wait for food and drinks is ridiculous.. \nNot only did it take a long time to receive our drinks but even for a simple refill we must have waited about 30 minutes to get it. Apart from the long wait the movie was great, it was very clean and the staff was very friendly.", "author": "Tiffany V."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}