{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "It's a nice location and setting, very clean and neat. It wasn't full and the people were super respectful of each other. \nI'm not a big fan of the high prices for what you get at the end.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Tl;dr: Solid theater. Come for movie, skip the food but if you must - snacks only.\n\nThe good: the theater itself is solid. Spacious and comfortable seating. They have a clip at the start of the movie that specifically calls out no talking or they will kick you out. I haven't seen it happen but having experienced chatty neighbors in the past I appreciate their diligence to a sound movie going experience. They have the films you would expect coming from the main hollywood production companies but they also sprinkle in some independent and foreign flicks as well.\n\nThe bad: the food and cocktails. Oh man, the food is not great. I'm going to echo some of the other comments: stick to the snacks. The chips and queso ($9.5) is very tasty albeit salty, but this is something (the only thing) I would return to. Once, I tried out the veggie sandwich ($13) it was just not very flavorful and the little flavor it did have was mild and bland. Another time I sampled the Bianca ($15) and the Wild Mushroom ($16) flatbreads - there were two of us and we went halvesies on it, 1 flatbread is plenty for 1 person. Although I liked the Bianca better, the arugula added some texture and volume to the flavor, overall they were both rubbery and greasy - very disappointing. I also got the Bitter Orange cocktail ($13) it tasted so abrasive, nothing about it was good. I didn't taste the Aperol, didn't taste the Gin - it just tasted bitter and sour. I couldn't finish it. \n\nThat said, I'd definitely go back to the theater only I'd make sure to skip the food.", "author": "Natasha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "Absolutely loved the decor. The food was better than expected. I ordered their Jerk Chicken Sandwich w/ Sweet Potato Fries. Definitely recommend trying it. \n\nComfortable seating and amazing leg room makes for a pleasurable viewing experience. Look forward to checking out another movie there very soon.", "author": "Durval M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Alamo Drafthouse is my go to movie theater and a 5 star in my book- here's why:\n\n1) Theater Experience (5 stars)- You book your seats online in advance at similar prices to regular movie theaters- (a night show costs $15.10). When you arrive at the Alamo, there are no lines. You immediately walk straight to your assigned seats and your server will check your phone receipt and greet you at your table. Each row is elevated so you never have to worry about someone blocking your view. Seats are spacious and comfortable- you have a ton of leg room as there is a walking aisle in between each row so the servers can get in and out swiftly. Service is attentive and friendly and they discretely deliver your food and drinks without distracting you from the movie. Whenever you need something, all you have to do is write it down and put up your card. \n\n2) Food and Drinks (4 stars)- An extensive food and drink menu with lots of alcohol choices and milkshakes. I've tried a few items on the menu. Some of my favorites- Asian Salmon Salad, Chips and Queso, and the Wings. Some of the food has been a bit of a miss- i.e. both the lamb burger and brisket burger. I'd say safer to go with the appetizers such as Chips and Queso. \n\n3) Rewards Program (5 stars)- Unlike some other theaters, the Alamo Rewards program is free. They give you a free ticket on your birthday and other free goodies the more you visit.\n\nOverall: Dinner and a movie is quite the enjoyable experience at the Alamo. Now that I've experienced the Alamo, I refuse to watch movies anywhere else.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "This is the place to be! Best place to watch a movie in Brooklyn hands down. Perfect date night setup and the drinks are the bomb! Love those wings as well. Service quick, neat and silent :-)", "author": "Carl L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "if anything, my issue with this theater is that despite people telling the waitstaff they've been to Alamo before and familiar with the whole deal, they then proceed to check their phones, use their phone screens as flashlights and chat during the movie (or worse: shout at the screen). never seen anyone kicked out or even warned, ever... but I've seen quite a few disruptive attendees. so, basically, do better Alamo. have your staff tell people to shut the f@#$ up and put their damned phones away. b/c no joke, I see people whip out their phones immediately after all the \"WE'RE SERIOUS\" PSAs. wtf.", "author": "Zeke H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Went to see Black Panther here at 12am on opening night simply because 1: there would be no children and 2: they serve a wide range of food and alcoholic drinks .  Because it was midnight and I didn't want to eat something too heavy, I ordered their Thai wings which were tasty and similar to what you'd get at a bar....and opted for their ginger berry cooler which was in a martini styled glass. The ginger berry cooler was somewhat warm and tasted less fizzy than what I expected. Would definitely order a different drink in the future, preferably a cocktail or one of their Baller shakes.\n\nOther than the food the theater was great with comfortable seating. I will definitely return!", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "The best movie theater in New York City, in my opinion. Watching new releases at the theater with food and drink is great, but my favorite thing is getting to watch old cult classics (I've seen Just One of the Guys and Grease 2 here, to name a couple) in a room at Alamo with other people who love the same old, weird, underrated movies. Service is great and the menu is robust. Highly recommend!", "author": "Valeria J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "My movie buff friends mentioned the Alamo awhile ago \u0026 I finally went this year when I ventured out to Brooklyn. Reclining seats AND food service? Yes please! \n\nYes, the food is overpriced but I wasn't disappointed with the quality of the food. I ordered the WILD MUSHROOM FLATBREAD which was delicious! I think my boyfriend ordered one of the sandwiches which was pretty good too. The servers are seriously like ninjas and are very good at appearing and disappearing, as to not disturb your movie experience. \n\nThe theater is in a great complex too. There's a Century 21, Target, and now the Dekalb Food Hall is open. Make a day out of it!", "author": "Jenni K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-29", "description": "Look, I like Alamo Drafthouse--and I'll continue to go. But there are some issues they need to address. \n\nFirst of all, the people downstairs in the reception area have always been incredibly nice. That's a huge plus. The bar is fun and the theaters are comfy. I also love the fact that there's no talking or cell phones allowed. \n\nBut let's get down to where they really make their money: food and drink. In the past I've had to send one dish back because a main ingredient tasted off (my friend confirmed this wasn't just in my head), and then there was the time I found a long hair in my order. I wasn't that pleased, but stuff happens. I didn't complain and just got on with my life.\n\nBut last night I was more than just a little annoyed. I always make sure that I get to the show early. Theaters open 30 minutes before the screening? Great! That gives me a chance to read the menu and place my order before the seats fill. And lucky me, last night they had new menu offerings. \n\nSo I placed my order for a fried chicken sandwich and waited...and waited...and waited. Finally, just as the show was about to start (and the theater is dark), a dish was placed on my table. The only problem? It wasn't my order. There's no way my order of fried chicken could have read as \"grilled cheese.\" \n\nI got up to tell them the order was wrong--previews were still playing--and was told to write the prob on a card and my server would take care of it. So I did. And then I waited some more. Finally the server came around and took the grilled cheese away and the clock reset. Everyone else around me got their orders, and I was left waiting until the mistake could be rectified. For those counting, it took about 45-50 minutes to get my sandwich even though I had ordered ridiculously early. \n\nIt also made me think: what happens if they bring a wrong order with an item that a customer is allergic to? I mean, I already kinda ate a hair here. It's not that big of a stretch to think this could happen. \n\nLong story short, it's still a good time. But I'm going to be extra wary about the food. Which is a shame b/c the fried chicken sandwich wasn't that bad (could have done with more sriracha, tho, but I like things spicy).", "author": "Shawna R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "I had a really great time here! Went to see Ingrid Goes West and they had a special menu that featured some of the items mentioned in the film! \n\nBeer was yummy, cookies were delicious. I like the concept and would definitely come\nBack again... I totally hate movies! They converted me.", "author": "Ange C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "I went to this location on 2/16/18 to see Black Panther. Not only was the staff friendly and the service was great, I enjoyed my food and got to revel in the awesomeness that was Black Panther. And I was very happy to see all viewings of Black Panther were sold out here and for several days! I promise this isn't a review of the movie itself... \n\nBeing that this was my first time here, I was a little confused on how things go (no ticket scanning, for example), but my hostess took time out to tell me how the theater works, how to order, etc. I sat in row 1, seat 1 of my theater. It was literally the only seat left in the theater when I purchased my ticket online because BLACK PANTHER. I thought I would have issues with viewing the screen, but it was pretty nice, especially due to the foot rest and comfortable seats. \n\nI had a great experience here and can't wait to come back for my next movie.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "I liked this movie theater for the most part. It's a really cool retro movie theater. They have cool movie posters everywhere. There is a bar located on the bottom floor of the theater which is awesome. The seats are comfortable and they have an awesome drink and food menu. Lots of options and food for everyone. My only problem with this place is how expensive it is. Popcorn is $9 and the other food options are also a bit pricey.", "author": "Vicki G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "I come here... probably way too much. I love this place. Aside from being able to walk directly to our seats, I am a huge fan of the Alamo's strict no talking policy during movies. It has created a culture I can trust and don't need to worry about. They have a large menu to select from. Not everything is amazing but most of it is good. There are at least two or three things in each section I love and will get repeatedly. Their shakes are so delicious! Drink selection is on point and I typically get my order pretty expeditiously. I've gotten my order wrong a few times but new servers can mess up and I always get the problem rectified quickly without it disturbing my movie watching experience. The staff is very kind, the atmosphere is super dope and I always enjoy my visits here. (Also, DeKalb market three floors down makes for a perfect date)", "author": "Ximena C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "This is my favorite movie theater in the city. All the things I love about it:\n\n- Reserved seats means you can slide in juuust before showtime without worrying about being stuck in the crappy first aisle rows or, even worse, nervously but hopefully asking people if the ambiguously occupied seat next to them is taken and if they wouldn't mind scooting over a tad as you try to ignore the evil glares. \n\n- If you sign up for their emails, they send you notices of when new movies are coming out so that you can book your tix in advance. Case in point: they sent me an email today about Infinity War coming out next month, and I immediately snagged my ticket.\n\n- They have a very strict late arrival policy, and NO, you will not be able to get in once they make the announcement about the theater being a quiet zone, BUT, they are very accommodating when it comes to rebooking you for another showtime :) \n\n- the food options are way better than any other theater, and neither the food nor drinks are exorbitantly priced, but rather on par with other restaurants (or maybe even slightly cheaper for the drinks. They also do an extra themed menu for the movie playing, which is super cute. Beware, snacks are still exorbitantly priced like at other theaters. #fortheculture I guess lol. \n\n- staff from every single role is SO nice. The waiters that assist during the show. The people that check you in. The usher in the hallways that will happily take photos of you and your crew when they see you struggling with selfies. \n\n- the only thing I was bummed about during my most recent trip this evening was that I decided to try something new and ordered a frozen margarita, which ended up being strangely salty. Like, they had added salt IN the drink in addition to around the rim. I mentioned it to a waiter and asked if I could order a different drink and they were more than happy to accommodate the request. I ordered my usual and that ALSO tasted very salty, which has never happened before. But, this is just a small thing. \n\nI love this place and can't recommend it enough!", "author": "Tina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "I absolutely love this theatre. It makes going to the movies feel luxurious and fancy. You can reserve seats in advance, which is great. On top of that the theatre itself is very cute, and when you get there, you are seated on large, comfortable reclining leather seats.  You get a table in front of you and you can order food. And the food is a little overpriced, but on par for NYC prices. But, it's TASTY!! The shakes and cocktails are SO good. Mexican hot chocolate - mmm!  And they have wings, sandwiches, flatbreads and snacks.  They make it easy to order food by writing your order on a card.\n\nFinally, they enforce the rules so people turn off their cell phones and just focus on the movies. I just love this place!!", "author": "Akhila K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "Alamo Drafthouse has reliably comfortable seats and I really enjoy the service we normally get when we come here.  Unfortunately, this time around there was a level of respect lacking not only in basic customer service but also in general human discourse in modern times.  We had bought two beers and a sandwhich downstairs (there is a food court in the basement which many people go to grab a beer or item of food before the show).  We wondered if food would be allowed in the theatre since they also serve food and drink but didn't see any signs prohibiting it. Since the food court and theatre are in the same building paying the same rent, and since there were no clear signs, we figured it was ok, but were totally fine with throwing away the food if there would be an issue.  We were planning on buying more drinks once inside.  \n\nOnce we were seated, as I neared the final 10% of an arepa, the food police came out.  An individual came up to us and explained that no outside food or drink could be allowed.  Fine, no problem, we get it, you want us to buy more (and so called 'health codes' etc which everyone knows is bs, since allergic individuals can bring in whatever they want but ok, no problem well spend more money).  Before anyone could respond he said 'ill go get a manager', a response which dumbfounded us since we had no issues with it whatsoever. \n\nThe manager came up to us and instead of politely asking paying customers to throw away the food, she (a young girl in a t-shirt) told my partner that 'he needs to go' in a tone of voice consistent with someone who enjoys a small taste of power (such as a mall cop, security guard, DMV employee, etc).  Mind you, at this point we had already paid 40$ for tickets, and were ordering 40$ more of drinks, apparently our money wasn't good there since there were a few crumbs of a sandwhich remaining which was literally made in the same building.  \n\nI don't mind being told 'no' but there are ways of communicating with paying customers so as not to convey disrespect or resentment.  Its not hard, just go back to kindergarten and be nice.  We are here trying to have a good time, and this manager had no interest in being helpful, rather, she seemed to relish the role of 'enforcer'.  Counting our total bill was roughly 160$ with food and drink.  This is not a discount theatre and a certain level of service and respect should be had.", "author": "Eric F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "Went to Alamo for the opening weekend of Wonder Woman with my boyfriend. Overall had a great time. Small annoyances, but I also was at opening weekend of WONDER WOMAN, so small errors are forgiven.\n\nFOOD \u0026 DRINKS\n\nChips \u0026 Queso: Perfect combo of thick and flavorful. Wish there was an option to add chorizo or something. Only let down was that it was barely luke warm when it arrived.\n\nThai Wings: So good! Not spicy at all, but they also arrived luke warm. Also wish they gave out hand wipes. \n\nBrooklyn Brisket Burger: So flavorful. Came nice and hot, aioli was divine, definite winner. The fries were subpar, not memorable at all. We had so much food we didn't care about the fries anyway. \n\nWild Mushroom Flatbread: Truffled parmesan makes my heart sing. Definite winner. Issue here was that it was so bread-y in the center of the flatbread. Needed to be flattened more for a crispier finish. \n\nChocolate Peanut Butter Shake (with rum): Came with reese's pieces on top and chunks inside. Could absolutely taste the booze but it was super flavorful. \n\nStrawberry Cheesecake Shake (with rum): Came with whipped cream on top, also a winner! Personally a bit sweet for me, but I liked it as well. Booze-y too!\n\nWater: I know it's weird to review water but bless this theater for giving large water cups, think big gulp 32 oz size. Seriously hate constant refills so seeing the jumbo large cups made me so happy. Oh it's free, in case anyone thought you actually had to pay for water lol.\n\nTHEATER\n\nSeats were plushy and comfortable, and tons of leg room! The servers/waiters have to walk in front of you (but they're like, a step lower than your seat, so not constantly in your way). My boyfriend is 6'6, so he was very appreciative of the available room. I really suggest to check out the menu in advance to figure out what you want. It makes ordering a lot easier and you're not struggling during previews to figure out what you want. I wrote down everything on my card, and got our food about 20 min into the movie. \n\nAlso, yes they do drop off your check when there's about 40 min left in the movie. Yes it can be annoying to look for your card/pay when you're in the best part. What I did was have my card ready IN ADVANCE so when the bill came, I barely missed a second as I put down my card on the receipt/bill tray. I signed for the check once the movie ended. \n\nOVERALL\n\n4/5. I think a lot of my rating has to do with going into the theater with a game plan: knowing what to order, payment ready, etc. It doesn't take away from the experience IMHO.", "author": "Fareeda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "A fun date night! \n\nDon't use your phone and get lost in a modern or an older movie.\n\nThe seats are comfy and the popcorn and soda is super yummy.\n\nGo now and have fun!", "author": "Irene C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "I've been to the original Alamo Drafthouse in Austin many times in the past, and I recall early plans for their first New York location in the Upper West Side several years ago. That didn't pan out, and maybe it's because they got seduced by this development in Downtown Brooklyn. It's huge. \n\nTaking up two floors on the top of a brand new building, it's a sprawling oasis for an alternative movie watching experience. They have some current hits like Get Out streaming, but they also stick to their guns with avant garde programming that's unique and thought provoking. Case in point; I caught my friend's band Morricone Youth play a live soundtrack they wrote to accompany the 1979 classic, Mad Max. Not something you experience every day. Coupled with comfortable and spacious seats, nice snacks (the queso and fried pickles were awesome), and a few cocktails brought straight to your table... it's a winning combo that's nothing like your youth smuggling in Twizzlers and warm Parrot Bay rum in a Sprite bottle.\n\nI tried their jerk chicken sandwich as an entree and it was utterly disappointing. Just a train wreck of hard, rubbery chicken that was a huge miss. I usually stick to snacks, so this was was my first time getting some of higher substance. If this is any indication of the rest of their more fleshed out fare, maybe the move is sticking to the small stuff.", "author": "Ruggy J."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}