{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "If I'm reviewing this as a movie theater it would get five stars--comfy seats, good sound quality, good location, and generally no complaints. If I'm reviewing this as a restaurant/food providing establishment it would probably get three stars, so I've averaged the two and gone with four stars. The food there is semi pricy, but not really if you consider that theater popcorn is usually super expensive anyways, so $15 for a sandwich doesn't feel quite as bad. The shake I had (chocolate chip cookie shake) was really good, but shouldn't have been $9 for the size it was. It didn't taste super rich while I was drinking it, but later that evening my stomach was quite upset and I'm pretty sure it was all the heavy dairy. The grilled veggie sandwich was not good and I wouldn't recommend, however they gave you a lot of fries which were very good. I would have included a photo, but phones weren't allowed during the movie. \nThe idea behind serving food in the theater is cool but it still needs a bit of work as we had to place our orders twice to get our food and then our plates were cleared before we were finished.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Most New Yorkers know that movie going in the city can be a pain in the rear. Buying tickets in advance, getting there 40 mins early for a decent seat, loud patrons and lit up phone screents, overpriced popcorn - why even subject yourself to such torture.\n\nLuckily we now have Alamo Drafthouse. I can order tickets and pick assigned seats....which means I can be there 1 min before showtime and have my seat. Seats are luxurious - leather that fully reclines. Nice tables where I can order from wide food and drink menu. Great helpful waiters.\n\nSaw Death of Stalin on Friday night. Having an Old Fashioned cocktail and some thai hot wings made it a very enjoyable experience. \nTrue luxury movie-watching.\n\nAnd they make it clear - no late entrants, no cell phones or obnoxious conversations - or else... \nI can't remember a movie going experience in NYC that I've enjoyed in last 2 decades until Alamo Drafthouse. Simply awesome", "author": "Lenny Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "We came to watch \"Manchester by the sea\" for the first time at Alamos. As soon as you enter you like everything you see. However, the tickets area looks like an information desk, I didn't see any sign that said tickets here or anything like that.\n\nAfter we finally got our tickets we went up an escalator out of service, along the walking to the auditorium you see some interesting posters of movies and a nice carpet definitely inspired by the movie the shinning. \n\nOnce you enter the auditorium, you fall in love with the screen, it's huge and super clear high definition. The idea of having food service to your seats is great, but very distracting and kind of annoying. When the staff keeps getting orders around the room they move back and forth bending their backs so you can see the screen, but by doing that you don't focus much on the movie and it's upsetting.\n\n\nI thought it was going to be more organized to order and get the check, but nope. I think they should add buttons to the seats so people press and pay with their cards through a payment system.\n\nFood was great though and has quality.", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "I do like this theater a lot, but there are some issues I just can't get past.\n\nThe food is not good. Food is their main pull, they offer you restaurant quality food with your movie instead of the regular popcorn. Every meal I have had here has been disappointing. I think the main problem is that I think they just try too hard instead of just doing simple things right.\n\nThings NOT to get:\nBlackened chicken caesar - I'm cajun, expected something along those lines (Blackened isn't even a cajun thing, but whatever), instead what came out was some cumin spiced chicken on top of my caesar salad. I like spice, but this was so spicy I had to down my drink. No free refills obviously and I'd have to wait another 15 minutes for another so I didn't bother to try to eat the second half of my salad.\n\nHot Dog - the cucumber slaw with the sauerkraut just tastes strange. You only get one, i guess how much bread they use is suppose to fill you up. They should just give you two organic hot dogs, like apple gate or something, on a nice soft bun and a nice mustard and cheese/chili if the person wants. Would be 5x better than this hot dog.\n\nPeanut butter milk shake - ours arrived warm, way too much peanut butter. A quarter of it was all we could stomach. \n\nCookie milkshake - the cold ice cream makes the chocolate chips way too hard.\n\nSteak sandwich - really just underwhelming. \n\nI haven't tried the whole menu, but the tacos were the only thing we thought was good.  They have good popcorn and they're really willing to work with you. I asked them to make a simple chocolate shake and they did.\n\nThe staff is very good and I can dig the whole hip vibe. They really do a great job branding themselves. But assigned seats aren't as unique as they used to be in theaters, they better get their food situation together if they expect to make money of that. If it doesn't get any better I'm just gonna start eating/drinking downstairs when I wanna see a movie.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-12", "description": "Normally I love Alamo Drafthouse and come to the Brooklyn location quite often. However, on Saturday 3/10, myself and about 7 other patrons were stuck in an elevator for quite some time after the escalators were closed off. After finally releasing us from the elevator, we were not offered any kind of apology, explanation, or compensation for the inconvenience. \n\nI will likely continue coming to this location, but I was disappointed with the lack of professionalism in handling this incident.", "author": "Chloe F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-19", "description": "I usually stick with iPic reserved theaters and I should have.\n\n1. The concept of \"no talking\", when there is food serving is absolutely terrible.  There are small white cards you can write on to communicate, but if the server misses the card and you want their attention, you're out of luck because you can't even whisper without getting a warning (how old are we?).  The servers will speak to you, but you'll need to write your response on card (how old are we?)\n\nI'm not a child that needs to be taught theater etiquette!\nStay clear of this playful theater and stick with adult iPics.\n\n2. I had wings (below average), popcorn (great), fries (average), salad (below average), drink (below average)and beer selection (below average, please change name from draft house).\n\n3. Server forgot my drink and I couldn't get his attention until almost 30 minutes through my movie (when I could have just whispered to the server \"hey you forgot my drink\").\n\nAgain, if you're an adult, this theater may not be for you. It feels like elementary school.  No speaking concept will ruin this place. I will not be back.", "author": "Terence B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-16", "description": "Love this movie theater! Downtown Brooklyn has really benefited from having a movie theatre so conveniently located. I agree with the other reviews that the food here is a bit overpriced but so is the food at any other theater- anytime you get popcorn or candy it's expensive. I love their nachos, such a huge portion! It's a fun experience for a date night!", "author": "Maddy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "I love this theater! Great location and great customer service. I've always had great experiences here and enjoyed my food.", "author": "Ashlee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "This is hands down my favorite movie theatre in New York City. For several reasons! The seats are spacious and dream-like comfortable, you can order food, alcohol, milkshakes, alcoholic milkshakes - and it's GOOD food and alcohol! Not to mention how they give love to the indie films :D It's the perfect date spot too, like dinner and a movie all in one, hello two birds with one stone.\n\nNow for the real reason this place is the best:\n\nDo you have any idea how annoying it is when someone is late to a movie, uses the FLASHLIGHT on their cell phone to find a seat and proceed to use their phone to answer emails, check facebook and text \"Derek \" for the duration of the movie? Cause I do. Someone does that at the Alamo and their ass gets booted. It's amazing!! It's one of the only (if not THE only) establishments in NYC with a built in filter for assholes. \n\nI seriously once whitnessed people taking flash photography selfies in a Regal movie theatre. And they didn't stop until multiple movie-goers yelled at them. Wheras the Alamo - The twats next to me took a photo of the clown the first time it appeared durring \"IT\" (which ruined EVERYTHING) and they got kicked right the fuck out of the Alamo. YES ALAMO, YES. Movie enthusiasts thank you!!\n\nAnd any douchebag who gave this place a poor rating because they were kicked out is clearly a stupid asshole because 1.) The Alamo literally tells you over AND OVER again that you're gonna get kicked out if you use your phone and 2.) they're one of those dick wads that uses their phone in a goddamn movie theatre!\n\nWhen you're trying to watch a golden-globe winning foreign film, and the douche cannoe infront of you is texting THE WHOLE TIME, it ruins the damn movie.\n\nIf you want to text or use your phone at all durring a movie, do us all a solid and watch the movie AT HOME. Then you'll also have privacy so you can fuck yourself. It's a win-win for all parties. \n\nGo Alamo. You guys are the tits.", "author": "Sparkman C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "Pros- Lots of films to choose from. Staff is very nice and helpful. One guy even asked for my movie preferences and gave me recommendations. Comfy chairs and a good waiting area. \n\nCons- Food and drink are very expensive. A coke and flatbread was $25. One bathroom was down so long lines.", "author": "Laurisha C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Very disappointed with this place. They really tried to deceive me. Alamo has a beyond burger on their menu and ofcourse like every other vegetarian I got so excited, seeing how beyond meat has had a shortage since the beginning of the summer, like I mean everywhere. So I order and receive my \"beyond meat burger\" and I instantly know it is a substitute... This burger has peas and shit, wtf. The whole deal with beyond meat is that it tastes like meat but made from plants so no fucking peas. I'm just mad they tried instead of just taking it off the menu. It was $16, the same price as the steak sandwich. Can't trust these mfers.", "author": "Crystal G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "If you live in this hood, pretty much the only blockbuster movie theater option used to be the UA on Court St.  I would begrudgingly will myself there to watch whatever Marvel or DC movie comes out next (because, you know, I'm still 12).  However after discovering the Alamo Drafthouse, I may never go to another cinema ever again.  Why bother?\n\n1.  It's cheaper than the UA around the corner.\n2.  It's cleaner.\n3.  It's not as crowded.\n4.  There's no line, you just walk right in.\n5.  The seats are nicer (PLUS you get to reserve them).\n6.  The screen and acoustics are top notch.\n7.  The awesome popcorn was served to me in a very official giant silver bowl.\n8.  It's right outside the Dekalb subway stop.\n9.  Although I didn't try the food, the menu looked awesome.\n10.  The spicy drink was actually spicy.\n11.  The servers were friendly, and made every attempt to stay out of the way.\n\nYep... I think I'm just gonna straight up marry this movie theater.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-07", "description": "I came here to see Black Panther, the movie experience was good. There was one rude staff member who kept doing entirely too and being unnecessarily rude! She was not my server but kept butting into our business, she completely RUINED my experience before the movie even started! She told me I can't take any pictures of MY food or anything inside the theater, that I ordered, that I paid for. Of course, this was BEFORE the movie started and there was no flash. Therefore the nosey worker was busy minding other people business other than focusing on helping her clients. BAD FOR BUSINESS!\nI ordered to flatbread pizzas and 2 glasses of Prosecco, everything was decent. My ACTUAL server was magnificent and brought out my extra drinks in a timely manner. \nThe theater was huge. What I do not like is that the seats do not recline and the arm rest did not go up (unless I didn't find the correct buttons). That's uncomfortable especially if you are viewing a movie with a date. \nI would suggest sitting on the end to avoid the back and forth of servers running through the aisle. I would also suggest a late movie because parking is a hassle downtown Brooklyn during the day. \nI would post pics but I don't have any because the staff told me I was not allowed! Before the movie starts there is a screen full of childish rules that will result in you getting kicked out. Too many rules and politics for adults to watch simple movies. Overall experience here was horrendous. NEVER coming back. I'd rather go to iPic.", "author": "Abbey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "I have always loved cinema. Cinema is a beautiful art form that connects people to each other, places, and time. My mother used to take me every Friday to see a movie, and it was a time I cherished very dearly. I am not like most people in this era of Netflix in that I see about 1-2 movies a week in the theater. I still feel the best way to enjoy a film is on a big screen surrounded by strangers. And this Alamo Drafthouse is a dream come true for a cinephile like myself.\n\nFirst and foremost, this place respects cinema.  It shows in the curation of their film selection, both past and present. Every other Saturday at noon, they play a classic film.  I've seen The African Queen, The Dictator, and ET. They were perfect ways to start my Saturday.  Also, they have a good selection of foreign and independent cinema to go along with the big tentpole films. \n\nSecond, their strict rules are strict but make a huge difference in the moviegoing experience.  They don't allow talking or texting or late arrivals.  If you're caught doing any of this, you'll be thrown out without a refund.  I can't articulate what a difference this makes.  I recently went to another theater and was shocked at the amount of texting and talking.  It completely takes you out of the film.\n\nThree, the beer selection and food is quite good.  The menu has dozens of local beer selections and at a totally reasonable price.  My go-tos are usually the ACBC blonde Ale and the M Train flatbread pizza.  Also, the queso and milkshakes are awesome.  And don't miss out on their themed nights. They'll have food and drinks that relate to the film!\n\nFour, the sound and projection are great.  The screens are big and the sound is always on point. They, unlike many theaters, still have film projectors.  They even have a 70MM projector for great films like Dunkirk and true classics like Howard the Duck.\n\nFive, their rewards system is quite good.  Sign up and you'll get free events.  I've seen lots of Q\u0026As and advance screenings because of the free membership program.\n\nThere are other places in the city that do the whole food and movie pairing service.  But I find their service to be intrusive and the screens to be too small.  At Alamo, you're getting real big screens and the servers are barely there, which in the context of a moviegoing experience is exactly what you want.\n\nBeing a film nerd can be quite ostracizing sometimes. Many people don't quite get how one could love movies so much. But Alamo has created a home for the weirdos like myself and I am truly grateful for that. I recently took my Mom to see a movie with me here, and my Mom told me that for our movie nights, we would go nowhere else.\n\nQuick Pro Tip: Buy advanced tickets.  I don't mean a few hours before.  I mean a few days before.  They will sell out.  And if it's a Marvel or big summer film, a few weeks before.  You will be out nerded by the nerds, so be on the email list and buy tickets ASAP when they get released.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Pretty awesome. For the longest time I was upset because movie theaters in Asia have let you choose seats for years. Years! And still, to this day, I have found only one other theater in NYC that lets you do that.\n\nBut along with the seats, you get the food. *sigh* the food. Don't get me wrong, it's not gourmet by any stretch. But I love it! I love that it feels like you're relaxing on your couch at home, and some ninjas are just ducking around bringing you food (you guys are awesome!). It makes going to the movies a breakfast/lunch/dinner event. Or maybe you just go after a meal and get a dessert. Either way, very fun. So far, I've only tried the root beer, wings, and popcorn, and they were all fine. Although slightly annoying is that there wasn't much ice in my root beer, but I think that's prevent the straw sucking sound at the end. It's not cheap, but again, it's an experience.\n\nAnd ordering as a newbie is super easy. They have the directions clearly laid out for you. We even figured it out when the lights were gone and the trailers have started.\n\nThe theater and seats themselves felt clean, so no complaints from me. I love that you can get your tickets digitally so you can just walk right on through.\n\nI also love the strict no cell phone rule because I'm evil like that ;)", "author": "Melody C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "Worst Theater ever, the front desk is ran by bratty white boys with napoleonic complexes. The policy that you cant use your ticket that was prepurchased if you are late is absolutely ridiculous and any true movie goer would know that life happens and you can always rely on previews to buy you some time to catch a movie you really want to see. I came all the way to this theater to try something new and I am absolutely disappointed. Never again. Clearly a frat house theater.", "author": "Ayida S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Fun Fun Fun\nBeer/Movie/Comfort Food - what else could a movie buff ask for?\nThe theater is comfortable and clean . The draft beer selection is aces. The food choices are really good. Had the pretzels for appetizer and I recommend the ropa vieja tacos for meal. Parking is best secured off SpotHero.", "author": "Chris A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Upscale movie theater with reclining, assigned seats and full food and drink service!\n\nI've been to a few of these in Austin, TX and have always been a big fan. The different here vs in Austin is that in Austin, you can walk to the beer bar, sample beers and hang out and then walk into the theater with your beer. Here, you have to order the beer from your seat without any sampling. Boo.\n\nThe beer list was seriously impressive. In addition to probably 30 taps, they even had 750mL bottles of Blackberry Farm Saison from Tennessee, which is an outstanding beer. It was pricey, though, at $35! There was a good showing of local beer, which is a good sign. Wife and I actually went with milkshakes and they were fantastic. Wife got the chocolate peanut butter and rum milkshake and I did the espresso chocolate. Our friends next to us ordered chips and queso, and the queso dip came out cold so had to be sent back. That's the only hiccup during the whole experience. \n\nWe didn't get dinner here as we had already eaten, but the food menu looked very appetizing and the selection was huge with flatbreads, sandwiches, salads, tacos, mac \u0026 cheese, and hot dogs.\n\nHighly recommended upscale movie experience.", "author": "GT W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "1. Do not be late. They have a policy of closing the door exactly 13 minutes after the ticket show time WITHOUT telling you anywhere on the webiste or ticket. I see that they said no seating after the movie starts but definitely not 13 minutes as we were told. I did make it to the movie when previews were playing but come on.\n2. Regardless of the number of tickets, a purchase generates only 1 code, which means you cannot enter until your party is all there because... I don't even know why. Basically my friends were told to wait for me before they can be seated.\n3. If you really want to eat and drink during your movie, this is your place. But if you are not, you will be distracted by servers passing through  during the movie. Although they try to zoom past you as they don't want to distrub you, they still go back and forth with food and checks. It could be a bit annoying.\n4. I had a milk shake and nachos. They were both better than what i expected from movie theater food.\n5. I LOVE that they enforce the no cell phone or talking policies. Otherwise, the loud exclaims and expressions that people make during movies are still present. Argh.\n\nOverall, I enjoyed the movie there, however it is not somewhere I am keen to return. I don't mind going if I will be in the neighborhood but will not make a trip there.", "author": "Crystal Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "Tip--If you come here before 7PM the Wax Bar has an awesome happy hour that is cheaper than in theatre drink prices. You can bring your drink outside of the bar and to the theatre! Alamo has for sure gotten better since they first opened. The staff now is much more chill than in the beginning when they used to yell at you about cell phones before the previews even started. You really can't beat being able to go to a movie and have full dinner and drink service during. The seats are comfy and they have a great draft beer selection-hense the name. Food wise, we've tried the popcorn, burger, chips and Queso and chicken caesar salad. The chicken caesar was not good and only had like 4 tiny chunks of chicken, so I wouldn't get that again. Everything else has been yummy though. The popcorn bowl is massive and cheesy goodness. This is so above and beyond going to the regular movie theaters.", "author": "Renée G."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}