{"aggregateRating": {"reviewCount": 621, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Saw LaLa Land, while enjoying cookies and wine. The beers and wine were good. Pretty great to enjoy a the food/movie/booze experience in a cool location.\n\nThey are NOT PLAYING about the no talking/no texting rule. If you come here and text, they will kick you put. They're very strict but they advertise this enough.", "author": "Anthony S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "Came here with my Bae. We've been to a few dine-in theaters, but we're pleased to find out that one was in Brooklyn that played current movies and have special theme nights. \n\nThe space isn't big like a franchise theater, but it has a bar! The theaters are more intimate, so make sure, if you can, to buy your tickets online in advance.  Popular movies and times tend to sell out quickly. They have old movie poster's hanging up all through out the space, which are cool and interesting to view.\n\nWhen we arrived, we were able to go directly to the theater where our movie was playing. We were greeted by a waiter who let us know how everything works. The prices are a little too high for certain foods, ie buffalo wings for $12.50,  side of fries for $7....just not enough food for the prices. I also had the nachos and cheese,  which was good EXCEPT the fact that the nachos at the bottom were completely broken up and couldn't be dipped into the cheese. \n\nThe drinks were pretty decent in taste and price. I had two frozen margaritas for $9 each and my Bae had a tezcat (?) Beer for  $5 and a mixed vodka and cranberry for $9. They have a pretty large selection of spirits, beers, wines. Just need to add CORONAS!!!\n\nThe seats are also a little small, they dont recline and for some reason they didn't make it so the arm of the chair/cup holder can be lifted so you and your date can snuggle up. \n\nOverall, I had a good experience and would come back again, but would probably just order drinks, unless they updated menu prices selections or serving sizes.", "author": "Shaquanna J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "The Alamo draft house definitely is polarizing. I've had a few friends who have had terrible experiences (no food/drinks ever arrive, wrong credit cards returned, no one taking their order, etc.) However, I've always had a great experience, in the 10 or so times I've been since it opened. \n\nLove the concept and really LOVE reading all the reviews on here of people being dumbfounded by why they were kicked out by texting, bringing in outside food and showing up late. You guys are hilarious!", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "Watched Guardians of the Galaxy 2 at this theater. Movie was cut off before all the end credits \u0026 post-movie cut scenes were shown. Out of 5 cut scenes, only for the first 2 were shown before the screen went dark and the \"get out\" lights came on. Until then it'd been a pretty good experience. Makes me wonder if it was an error on the projectionist's part or if it was the Alamo's attempt to to get as many customers in \u0026 out in the least amt of time. Either way it left a bad impression. \n\nSo 1 star for having an convenient ticketing system, -4 stars for cheating me out of a full viewing of the movie.", "author": "Olive F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Really like the seamless option of selecting the seats ahead of time online. I was scared about being turned away but even though the previews started the guy let us in - thank god. While i was putting my work phone on vibrate the server chastised me, even after i explained i was just putting it on vibrate. Like calm down?? I know the policy is strictly enforced but i hate being accused of something I didn't do. Now the good part which i assume is mostly why people go because theres so many other theater options- the food is good! Try the thai wings, popcorn with real butter, jerk chicken burger ( its type spicy) and the cookie trio w/ ice cream or milkshake. Good experience and like the yonkers location as well.", "author": "Amika N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "I came with a friend to see the Lego Batman movie and had a great time. \n\nThe theater is very clean and comfortable.  It's small enough to provide a more intimate experience but large enough to provide a decent amount of company sometimes needed to add a little added entertainment.\n\nIt is appreciated that there is an emphasis to discourage phone talking and texting.  I haven't witnessed anyone get escorted out so I guess it's doing its job.\n\nThe staff is polite and helpful and attentive. During my first visit I asked to get my seat changed and it was done with no problems. \n\nSo far I've had a vanilla shake and a chocolate chip cookie and both were tasty.    I'll definitely try other flavors. \n\nOne dislike is that the lights under the tables don't turn off.  They can be a distraction at times with their brightness.\n\nAfter the movie visiting the House of Wax was a nice end, seeing the death masks and other busts.\n\nThe theater is a good addition to downtown and I will return.", "author": "Lucien A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-31", "description": "I REALLY, REALLY want to love this place because it's such a great concept but I don't think it's going to happen. My first visit was smooth but that was because i was there midweek and i was 1 of 3 people in the entire theater. \n\nSecond time I sat next to a real hog.  I mean, damn, he was a real piggy. He ordered food throughout the entire 2 hour movie, starting out with tortilla chips and salsa, never taking a break between each chip, not even to breathe so it was a constant clutter of noise.  On top of that he was just a very loud eater....open mouth eater.  I kept giving him the side eye so he'd get the idea to shut up.   Meanwhile, i ordered a milk shake and it took them an hour to deliver it... that was after i complained about it. I would ask them to reconsider certain food that make a lot of noise. It's very distracting to hear people chewing thick tortilla chips.\n\n Latest visit i ordered a burger and fries and an hour into the movie i had to get up to see what that hell was taking so long.  I thought maybe they went out to kill the cow or something, shiiiiit.  Turns out they lost my order so the waitress took my order again.  Half hour later the young lady comes to apologize for the slow service but my food would be out and comped. Half hour later the movie was over and NO food. I came to the movie hungry because i knew what i was going to order a meal.  I complained to the manager and was given  2 free passes and a food voucher.  I'm going again just to use the free tickets and vouchers but I may implode if I have a 3rd terrible experience.", "author": "Andy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "Here's how to get the most out of your Drafthouse experience:\n\n-The policy on talking and phone use is strict, so get there early to settle in and make sure you don't bug all the other patrons during the movie.\n\n-Getting there a bit early also makes it easier to order drinks and food, since you can speak rather than use cards.\n\n-As for what to order, for drinks stick to beer and wine. They have a great selection of draft beer, but the mixed drinks are average and overpriced. For food, stick to things that are easy to eat with your fingers. Trying to eat a salmon salad in the dark is its own form of tension and it'll take away from your film.\n\n-For early shows, they always run out of coffee, so show up early or show up caffeinated.\n\n-They will always forget to bring you water. Every visit I've had to ask more than once, so make sure to reiterate to your server that the human body is 60% water and you'll die without it.\n\n-While it's not my scene, they have special \"for all\" screenings where the lights are a little bit up and they tolerate more noise. Definitely search these out if you are interested in a full meal or want to bring the kids.\n\n-When the movie is over, head to the downstairs to the bathroom, as it's typically less crowded.\n\nThat's pretty much it! Enjoy your movie and quiet down!", "author": "Forest C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-05", "description": "The Theatre itself is good, and a great concept regarding the dine-in option currently in use by other theaters. BUT! The service staff constantly walking through the aisles to deliver food and take orders DURING the movie is just horrendous, and ruins the actual viewing experience. \n\nWe had an African American young lady in theater 4 on February 4, 2017 / 11:00pm showing of Split, that would stomp every time she passed. She refused to bend down like the other servers when walking through the aisle. Simply NO CONSIDERATION for the customers who paid their money to enjoy the movie. Work on this, as you will quickly suffer because of it.", "author": "Gordon H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-15", "description": "Listen up...another nice movie venue in Bk.  Clean with huge screens and  terrific sound.  On the plus side:  no nuisance ads, instead pretty informative pre-screening tidbits.  Personally I'd rather get my own popcorn.  Here there's seating plus tables and servers who bring your order.  Hmmm, innovative yet, an unnecessary contrivance that is intrusive since even while the movie is running, so is the serve staff up and down the aisles.  Leather seats comfy but not after a 2-hr movie.\nI actually prefer typical adjustable movie seats and, if I wanted a table I'd rather go to one of the many restaurants in the area.  Check it out anyway!", "author": "Dawn P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "It's a very nice theater. We came in kinda late for a movie. Our theater was full and we had to be in the first row. It was still very comfortable. \nThe seats are comfortable and reclining. The staff is awesome, very quick and very respectful. \nThe menu is great! Lots of drinks options, beers, cocktails, shakes (with alcohol too). We got a few beers and a bowl of herbed popcorn which was delicious. \nWe loved the theater and the experience. I would not have a full dinner there but it's effect for snacks and drinks.", "author": "Kate N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-16", "description": "One star for our servers poor attitude. We came 25 minutes early and I was using my phone light to view my menu (not the flashlight). He comes over to introduce himself, then immediately says \"we have a really strict cellphone policy. Use the light underneath\". And we were like... even before the movie starts? And he just replied with \"if you use your cell during the movie you will be kicked out\". We were like, ok dude... We get the policy, and the movie was nowhere close to starting. It was just a VERY unwelcoming way to greet someone, and it could have been done nicer.\n\nOn top of that, they asked us if we've been here. I said we had been to NITEHAWK, and he literally SCOFFED! I later on also overheard another server in the row in front of us give HER guests a hard time for it too, saying \"Nitehawk literally stole our idea, so that's why.\"\n\nThe servers at this place need a serious attitude check. Did they really think that another company wouldn't pick up on their dinner + a movie idea? \n\nJust really really poor attitudes in this place. There's a reason Nitehawk has 4.5 stars and they do not. Management should take note.", "author": "James K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-22", "description": "I love this theater, but the food IS. NOT. GOOD. It all tastes reheated. Why would I pay the extra cost and schlep all the way there for a \"dinner theater\" benefit that I don't want to take advantage of. Honestly, I'll take my chances with a bad seat at Nitehawk and enjoy their dinner theater 100% of the time if I have to keep eating this food. It's just not worth it to me.\n\nSome specific notes:\n-all the sandwiches are dry and tasteless.\n-the buns are not fresh and the meat is bland.\n-most everything is either lamb or beef. not enough veggie options.\n-no rotating menu means I'm always forced into the same choices.\n\nIf they could turn around their menu, I would probably be here twice a week. Instead, I'm looking at other dinner-and-a-movie options.", "author": "Rob W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "A really great spot to take in a movie, because you get to eat and drink while there's a movie - and aren't we all looking for something to do with our hands?\n\n\"This movie is too long, my hands need something to do.\"\n\nThe servers walking back and forth can get annoying if you're not prepared for it. BUT, they do do a great job of trying to stay out of your way. It is a job that I do not envy. They're bending, and contorting, and schlepping thru the dark so your privileged American ass can shove reheated vegetable spring rolls down your food hole. Show some respect.\n\nThe food isn't that cheap. Salads and sandwiches are like $15 to start.\n\nStick to the appetizers as they are decently priced (I'd recommend the soft pretzels at $9 for a portion of 3). The big bowl of popcorn for $8 was also decent. \n\nMixed drinks are like $10, and not that strong. Wine is $9+, and the glass is stupid small. Crap wine, too. Tasted like Hawaiian Punch and band aids. Beer is $7+. Good selection, though they were out of a few.\n\nSo, like, it's definitely not cheap, and you have to come prepared to deal with some distractions. $15 seats, and a meal means you're probably spending at least $30 to see a movie. Service can take a bit, so don't come starving. \n\nTo end with some positivity (Hooray!) - Very comfy seats. Friendly service. Something different. Come at least once - and bring some patience. And sneak in wine.", "author": "John J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-19", "description": "I love this place. But. If there's no one in the theatre. Sell me the Damn seat. Give me a break. Only a mope doesn't sell the seat.  I work with the public, I've been pressured to do things, your spider sense tells you when someone's skirting the rules or just waited too long for the train. Sad. I love Mark. He always makes this place feel homey.  However, his foil just Shit in my breakfast. Love Alamo, will be back soon.", "author": "Noah P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Such a great experience. Popcorn is amazing, and the beer selection is even better. Seats are very comfortable. And they don't tolerate any nuisance of a loud audience.\n\nThings which could improve: (1) service at the start could be better, (2) the theatres are not always ready 30 minutes prior to their normal open times - which sucks because they run cool slots prior to the feature.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-04", "description": "The Alamo has SUCH potential. I had really high hopes going there for my first time after hearing great reviews about the Alamo in Austin. We got there a little early to grab a cocktail before the movie started, however we quickly realized there aren't many surrounding bars in the area.\n\nWe ended up grabbing drinks at the Wax House which is located right in the theatre lobby. No complaints there! Great service and even better drinks (that you can bring into the movie if you don't finish them beforehand).\n\nThe seating for the movie is 1 table per couple so it's a little awkward if you're going with an odd number of people because one person will be sharing a table with a stranger. I was of course excited to try the food since it is a dine in theater after all. And, since it is a dine in theater I didn't set my hopes to high as far as food goes.\n\nMy friend and I ordered wine, siracha popcorn and a burger to split. The wine was served in a small glass, but the siracha popcorn made up for it. It was delicious! However, the burger should be called the Bummer Burger. We explicity explained we'd be splitting it but gave us not utensils or extra plates to actually split it (which they clearly could've done themselves). The burger was also cold and came out rare instead of medium rare. But by the time our server came back to us it was too late to complain. I definitely recommend ordering drinks and snacks vs. an actual entree at this theater.", "author": "Megan D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "No No No!!!!! I went on a late afternoon.  The theater was super tiny and a very small screen.  There were only eight people total but it seemed like the waitstaff was constantly running back and forth before and during the movie.  It was distracting and took away from the entire movie experience.  Imagine sitting there totally engrossed in the movie and you see someones silhouette scurrying back and forth right in front of your view of the film. Annoying. \n\nI ordered popcorn and a soda---the popcorn came in a HUGE bowl but it was stale and cold. The cup that I was given my soda in smelled like it had not been properly washed.  It also tasted like it had traces of cherry coke when I ordered a sprite....  I thought it was a waste of time + money honestly.  You're better off just going to a regular theater and getting dinner someplace else afterward.", "author": "Lora M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Getting to be my favorite movie house and I've only been twice. Here's why: the service is excellent, the waiters/waitresses are all full of personality and are ninjas at getting your orders to you without interrupting your show. Second: You can't pay enough for silence during a movie, it should be a requirement everywhere but other theaters just live with it.\n\nThe reason why you're missing a star - Teasing that Strawberry Cheesecake drink and not having it should be a crime. Both times I've gone (a month between) they don't have the shake. It's not McDonald's people, fix the shake machine....or whatever you use.\n\nAlso.....how about Chicken Sandwiches on the menu?", "author": "J. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "I was here a week ago and i have to say the movie theater was lovely. The theater is very clean and well maintained. Also the workers and staff was very professional.  Also i had a problem with one of my orders and one of the managers named Mr thomas was sooo considerate and caring. He took care of the problem with a smile\n\nAlso the general manager was very welcoming as well. \n\nTo the movie staff and mangers keep doing an awesome job and maintaining an wonderful atmosphere.", "author": "Rondell T."}], "servesCuisine": "Dinner Theater", "priceRange": "$11-30", "name": "Alamo Drafthouse Cinema Downtown Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square West\nSuite 4-400", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/XDQU6A6-23hjoLqoPD6Qaw/ls.jpg", "@type": "Restaurant", "telephone": "+17185132547"}