{"aggregateRating": {"reviewCount": 21, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "Great food. Friendly staff. I have been here twice and both times the staff was friendly. The fiat time I ordered the chicken Caesar wrap meal with French fries and I loved it. The second time I ordered the chicken slovaky on a pita and that was also delicious", "author": "Ana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-28", "description": "Greek Xpress is exactly how it sounds, a quick place to grab a Greek inspired lunch.\n\nTheir lunch specials are reasonably priced around ~$10 and come with either fries or rice. I chose #5, the Gyro pita sandwich. \n\nThe Gyro pita definitely met expectations. Fresh veggies, red onion, white sauce all wrapped in a pita. The veggies were fresh, the white sauce was good, but the gyro meat and pita could use an upgrade. The meat was cold and a little gritty, and I would've preferred if it was heated or bit crisp on the edges. The pita was ok - not fresh... but not necessarily 'unfresh' either. \n\nI'd hit up this spot again if I'm craving a Gyro and want a reasonably priced lunch.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "I am in complete and utter love with their salad!\n\nI know what you're thinking... you're in love with a salad???  Really??  Well, YES!  Not so much the salad, but their homemade Greek Vinaigrette is EVERYTHING!  \n\nI initially tried their food because my colleague got a salad with his entree and it was too much food, so he gave it to me.  And now, I have to have this salad at least twice a week.  I wish they sold the dressing, because I'd buy a bottle!\n\nI add the grilled chicken to it.  Its always tender and seasoned to perfection.  It's a wonderful addition to the Greek salad.  My only problem would be that it costs the same to get the grilled chicken Greek salad ($10.75) as it does to just get a Greek salad ($10.20).  And I like the tin container it comes in when its given to you as a side as opposed to the salad bowl it come in when you order the salad as your whole meal.  I always transfer the salad to a bowl I keep at work so that the dressing and toppings came be more evenly distributed.\n\nNevertheless, this place is now a favorite!", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "The food is good. Funny enough my biggest complaint is the use of red onions over white on the Gyro Pita.\n\nThe greek dressing is fantastic as some have pointed out. \n\nThey close early though and visiting anytime near close will not result in a good time.\n\nOtherwise though staff is friendly and service is fast.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "This place replaced the old Greek spot which I'm glad they did because it was previously ran by two old grumpy guys and the establishment only took cash and nothing else.\n\nThe lunch specials is where the deals are as they are about 10$ and come with choice of fries or rice pilaf. I got number 5 which was the Gyro Pita Sandwich and got it with the fries. The Gyro was huge and easily filled me up. The fries were too salty for my liking so I didn't enjoy those as much.\n\nOverall you get the most bang out of your buck here with good quantity amount of food to fill you up.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-09", "description": "Been here about three or four times and it's been consistently good. I usually stick to the lunch combos. The food is well prepared and tasty. I particularly love the oregano fries which they give a generous portion of. Staff is always pretty friendly and efficient. Space is small so don't plan to eat in.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "Solid Greek-style lunch option if you are in the area. I ordered the Chicken Greek Salad with pita bread which came out to $10.35. A bit on the pricey side, but the grilled chicken and Feta were flavored to perfection. The salad composed of romaine heart lettuce, red tomatoes, red onion, cucumber and black pitted olives. I was a bit disappointed that there was no stuffed grape leaves and the dressing it came with was not that yogurt sauce Greek salads usually come with. For me, the salad was good enough on its own and I did not use any dressing. The portion was hearty and I would definitely go back. I think if this place needs to change anything, it should be the pita bread it uses. In my opinion, it was ok, but I have had much better. Also, if you plan on bringing a group here, you need to do take out. There are no seats, but standing room only by the window to eat if necessary.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "Fantastic and Fast! I grabbed a lunch special between work stops one day and was impressed by the speed and quality of what I had... lunch special #5... gyro on pita bread. How can you go wrong? \n\nWell, the meat could be greasy, or dried out... theirs was neither! Seasoned just right, juicy, and flavorful. The gyro came with a side of fries, also lightly seasoned and just cooked to perfection! \n\nI'm a little miffed that $10 is considered a lunch \"special\", but what should I expect for Downtown Brooklyn? Seating would also be nice, but again... look at where we are! There is small counter space if you're one of the few having lunch to stay. But then, that was only me. Everyone else had an office to get back to. I wouldn't recommend the spot if you want to dine in, but if you can handle finding outdoor seating, this is the spot. My true rating is a 4.5/5.", "author": "Richie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Great deal for lunch special. Got a gyro with a side of rice pilaf (which was really just Spanish rice) for $10. Big portions, fast service, extensive menu. Better for takeout, as there is only counter seating, and with the window open, no AC. Definitely a great spot to check out if you are looking for lunch in the area.", "author": "Sophie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "Went on a Sat ordered take out no comfy seating available only chairs by window but ate in car, my husband ordered Gyro it's shaved its the only way to enjoy as per my husband \u0026 I !! I ordered chicken salad ! We loved it !! Prices are negotiable !!! Great tasty charcoal chicken \u0026 my husband enjoyed the Gyro .. will def go again", "author": "Renee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "I think they used to be called \"Souvlaki House\" so I never checked them out as I'm not a souvlaki fan, until they changed the name. I can't think of a reason not to give them 5 stars for my experiences so far. One time I had gyro and another time burger lunch specials which came with fries in a nice insulated box. Both times the food was very good and satisfying in amount. I wish there was more sauce on the gyro but that's my personal preference. The fries were tasty and soft, not the kind of dried up sticks you get at chain fast food restaurants. The price was a couple of $ more that what you'd pay at McDonald's or Burger King for a similar combo (less the drink) but it's worth it and this is downtown Brooklyn, NY after all.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "If you're looking for the old gyro place that was in this spot for over 40 years and think they just renovated nope.   That being said this new place is friendly, clean and a lot more variety. Still gyro to gyro I like the older place just slightly better. My gyro ran around $9.00 and it was big tasty a wee bit dry on the meat.... So in the end if I'm near by I'll go again still I reserved the 5 star for the old Greek guys I'm really going to miss....", "author": "Erelichada S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "This restaurant is wonderful the staff was very nice and welcoming she made jokes with us and made it a friendly environment and the food was really good too, so you're really getting your money's worth. The staff member's name was Coco and she's a worker who deserves a bonus!", "author": "Erick G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "This place is Amazing! I happened to be shopping around the area and saw Greek Xpress.  As soon as I walked in I felt welcomed. Was greeted by Tommy (the owner) and was explained what everything was on the menu.  I ordered from the lunch special which the prices are very good and the food portion were big.  My wife ordered Spanakopita and loved it! We topped it off with their awesome Frappe! Highly recommend it to anyone in the area! They wont let you down!", "author": "Alan Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-18", "description": "I ordered take out from here and my order was completely wrong. I ordered soup that did not come and was given the wrong side. On top of that the gyro meat with soggy.", "author": "Rachel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "I've never written a review, but, felt inclined to let people know how great the service was at Greek Xpress. Called in to order food on Friday night for a party held Saturday noon. Coco, the person on the phone was helpful, had a great attitude and efficient. Food was delivered on time and was delicious. I received a call from Coco about 15 minutes after the delivery and she realized she forgot to give the paper plates to the delivery guy. She sent a guy out just to give us our plates! It was above and beyond what we expected from the little Greek place! Thanks so much Coco, we will be ordering from Greek Xpress again because of you!", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-21", "description": "We just ordered take out from Greek Xpress. We tried the chicken souvlaki platter and a chicken souvlaki pita and really did not enjoy either. Even though we live just one block away, the food took a very long time to arrive and it was cold when it got here. The chicken was extremely over cooked, dry and burned in some places. For $15.95 it was a very small amount of meat. The platter comes with salad, pita and a choice of rice, lemon potatoes or fries. We picked the lemon potatoes, which were quite dry and tasteless. We will not order from here again.", "author": "Deniz O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "I ordered from here food and service is good i would recommend. They are fast and friendly as well.", "author": "Rifatul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "I now have a go-to Greek place in Brooklyn.  The beef \u0026 lamb gyros are very tasty.  The meat is well seasoned and the tzatziki sauce is the real deal.  The Greek salad was fresh with a very tasty dressing.  Generous portions at a slim price.  Bookmarked for future dinners.", "author": "James T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Obsessed with this place! Everyone was so welcoming and didn't rush me to order when I just couldn't decide on what I wanted from their endless options. The food was super fresh and they were quick. It's a clean environment with an amazing staff and most importantly amazing food. Definitely a must have!", "author": "Andrea Z."}], "servesCuisine": "Greek", "priceRange": "$11-30", "name": "Greek Xpress", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "158 Lawrence Street", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/TCTLe8D_lXutU7pLFDHolg/ls.jpg", "@type": "Restaurant", "telephone": "+17185763798"}