{"aggregateRating": {"reviewCount": 17, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-16", "description": "Friendly staff. Only accept cash and their in-store ATM fee is $3 with a max $100 withdrawal. Two price increases in the last year. An egg/cheese/tomato on roll is now $6. I'll start walking two blocks to save $2.", "author": "Mark F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-11", "description": "One word - TRASH! I've worked in Manhattan for many years \u0026 then i came to Downtown Brooklyn \u0026 find this place. There's always a good amount of people in here \u0026 I still question why?! The menu \u0026 register prices don't match. I ordered egg \u0026 cheese on a roll \u0026 it was $4.25 \u0026 with tax $4.72!! You have got to be kidding me! Only\nto see they use one egg? Never again will I buy from this establishment. Luckily I didn't walk out today without paying.\n\nIn general, this place is no consistent with prices, you don't get a big portion \u0026 only cash. BUMMER!", "author": "M. R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-22", "description": "All the other reviews here are right. This place charges whatever the hell they feel like, and it's always an unreasonable amount for basic food. Do yourself a favor and go anywhere but here.", "author": "Alfred P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-08", "description": "First thing to note: Cash only. If you're looking for your typical breakfast sandwich on the go, I would not recommend this place. Too expensive. I ordered a simple turkey, egg and cheese and it came up to $6.50. My Manhattan delis don't even charge that much. \n\nAs for lunch options, the portions were generous and the price seemed to fit better.", "author": "Ashley P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-20", "description": "While the quality of the menu is average, what you are charged seems to often differ from the menu - you really can't tell what you will be charged until you get to the register!   A regular ham hero is listed at $6.95 but I was charged $7.75 - the same as their \"signature heros\" - when asked the response was prices went up but not on the signature heros - very dubious at best!", "author": "Joe W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "I work in Downtown Brooklyn, but I usually don't go past Adams Street for lunch, but my boyfriend told me about One Way Deli  and how delicious the wraps are. Since I've been on a semi-healthy kick, I decided to try out a wrap from One Way Deli.\n\nIt's not a spacious nor fancy deli. The staff here are very friendly and quick at fixing your order. The staff are friendly, helpful, and quick at fixing your order. \n\nThe first time I came here I ordered a whole wheat Grilled Chicken Caesar wrap and the cost wasn't too expensive only around $8.00-$9.00. The wrap was enormous.  It consisted of Romaine lettuce, grilled chicken croutons, and Parmesan cheese. \n\nI ordered the grilled chicken Caesar wrap for under $8.00-$9.00, that's actually not bad. The wrap was humongous and I actually didn't quite finish the entire wrap. I got a whole wheat wrap and it consisted of Romaine lettuce, grilled chicken, croutons,  and Parmesan cheese. The wrap was warm and truly a delight! It was fresh and tasted amazing! It was possibly the 2nd best wrap I've had so far.\n\nThe second time I came here I ordered the Reuben wrap which consisted of corn beef, sauerkraut, and I believe mayonnaise, but not 100% sure. The corn beef tasted and looked like pastrami - nice and meaty! Unfortunately, I wasn't a fan of this wrap and I think it's because of too much sauerkraut. \n\nAny way, I am glad that my boyfriend introduced me to One Way Deli because sometimes I get bored of the usual lunch spots near my office. If I ever get bored of having salad, a wrap for lunch is a nice semi-healthy alternative. I look forward to trying their other wraps. In fact, the pesto wrap sounds irresistible - may have to get that next.\n\nTip: This is a CASH only place.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-18", "description": "SERVICE:\nThe staff are very into what they are doing and helping the many customers. They were pretty attentive and quick, something that is highly valuable...especially in food service industry. The deli in fact is pretty tight, and a lot of people seemed to be popping in during the time we arrived to pick up a wrap.\n\n\nFOOD:\nMy boyfriend and I split a turkey club wrap. It was warm and pretty tasty once we got it and went on our way. The bacon in the wrap is what really stood out for me. Was crunchy and crisp and I think made the wrap. The food is a little overpriced, but what do you expect? You gotta pay for convenience!\n\nWHEN IT COMES DOWN TO IT:\nI wouldn't choose to come here regularly if I actually lived in the city, but it was on the way to our destination and we were looking for a quick bite on the go.", "author": "Tricia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-11", "description": "I used to come here often for breakfast. Then I realized how overpriced they were and it bothered me that they charged tax on food!. I just bought an egg \u0026 cheese this morning (6/11/14) and got charged $4.07. One egg and one slice of cheese; no coffee or juice. Apparently they raised their prices 2 months ago; like they weren't expensive enough already! Neve will I be back there. 1 block away at the pizzeria you can get an egg \u0026 cheese for $2.75...tax free. Good luck One Way! You get two stars because I get it, you have to do what you have to do to get your business running but your prices are ridiculous! Your eggs aren't even organic! Pfft!", "author": "Anette S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "MAKE SURE YOU CHECK YOUR ORDER UPON DELIVERY! I placed an order and waited 30 minutes for something they only got half right. It also so happens to be that they messed up the most simplest order, a bacon egg and cheese. I tried to catch the delivery guy before he left with no success, so I called and told them my order was incorrect. I was then told that I would have to wait an additional 20 minutes for the sandwich and that they wanted the incorrect order back (which btw is a health violation). I had to go in between seeing patients to get the correct order (which was already made). So I would have been waiting 20 minutes to receive a cold sandwich that was ALREADY COLD when given to me. This is the second time this place gets my order wrong and does this. You're better off physically going and actually watching them make your order instead of ordering for it to be delivered.", "author": "K D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-21", "description": "3 stars because the staff is great. I love the cooks and the two ladies at the counter are nice.  You have to butter up the shorter lady, but once you have shes a sweet heart.  \n\nThe food is okay.\nThe coffee overprices. $1.35 (small). \nThe ice coffee, frightening. Ech. xc\n\nThe heroes are good, the chicken parm is great. I go here often because I work close by. \n\nThumbs up- Staff.\nThumbs down-The difference between the price on the menu and the price you pay. I wish there was a bit more consistency with the meals.", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-30", "description": "Awesome sandwiches?!  Well, they're decent.\n\nSpacious interior, roomy and airy, to wait?  No.\n\nInexpensive?!  No.\n\nThey season burgers and things they're cooking with salt beforehand like any good cook?!  No.\n\nThey start their chicken cheesesteak with raw chicken on the grill?! No.  It's already cooked.  I guess they want to cook it twice.\n\nLocated next door to my office?!  YES!  Which is how A LOT of lunch places survive in this city.  Only during work will I eat something called a \"Texas Wrap\".  Well, at least I get to Yelp about it.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-27", "description": "This is a very busy deli so be prepared to wait on line but other than that their foods pretty good.  Pricey, but it is a very busy area.\n\nTheir wraps are very good. I've had the caesar salad and mexican wrap. very good and full of flavor.  Also, they're pretty big considering the price so I usually have half for lunch and save the rest for later.\n\nOnly con is that they don't take debit/credit. It's 2012 and you're in the middle of court street! come on guys!", "author": "A. M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "The crew is nice enough and they work really hard.  Unfortunately the food is just not that good and very expensive.  And why are the cold cuts pre-cut?", "author": "Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-11", "description": "The iced coffee is the best strong full flavor, not americano and no chemical starbucks taste. Costs a little more than others but less than Hortons or Starbucks. Makes a good hot sausage hero. Always crowded tho.", "author": "Walter R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-30", "description": "just got a sandwich from them and real lame, they are cheap with their ingredients and way overpriced, NOT impressed.  I went there yrs ago and the sandwich was great but seems like they needed to pull more profit and shaft their customers.  Now ther eis no wonder why the place was empty at 12:30 on a weekday.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-14", "description": "Food is standard,nothing outstanding. I  stopped going in because of the nasty girls at the register, very rude, I asked for a piece of lemon for my tea and the woman took a piece in her hand and threw it into the paper bag and gave me a nasty look, this happen once to often so I don't waste my time giving my money to people who are nasty and there food is nothing special.  There specials do not contain the ingredients that are listed, more than once I ordered an item only to realize that half of what was supposed to be included was not given to me.  Had enough, if you want decent food there are other deli's on the same street that have better food and a better value for the money.", "author": "jane n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-03", "description": "If you are trapped downtown the One Way Deli is perhaps your best bet. The store is maybe 12' x 30' and they use every inch. A large coffee is $1.65 versus La Bagel's $2.45. The food prices are reasonable for Brooklyn Heights.The store is BUSY but it is a repeat clientele, the same people eat there several times a week 52 weeks of the year. I eat the Brooklyn cheese steak once a week, I think that it is $5.25 which is cheap for Brooklyn Heights.", "author": "BRIAN M."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "One Way Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "26 Court St", "postalCode": "11242", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/R-Nt1m_vpHxcXG2wRDXRDA/ls.jpg", "@type": "Restaurant", "telephone": "+17187971393"}