{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "Cool place. Cool vibe. Great beer. \n\nCame in around 5:30 pm on a Friday  with a group of 7 and were sat immediately. Lively place with nice workers. Would definitely recommend.", "author": "Kris J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-21", "description": "Like any other bar except this one is not dirty looking on the inside and it has a foos ball table, a shuffle board and some other games. \n\nApart from that, service was slow and food was crap.", "author": "Avina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-15", "description": "Been wanting to check this place out for quite some time and I'm glad I did -- \n\nAfter hearing the prices could be steep for this \"pour your own pony spot\" I threw caution to the wind and joined a friend to see what the fuss is all about. Yes -- you can find certain drafts on the pricey side - $2.18 per ounce - but this was for a pretty rare beer. On the other end of the spectrum I found one of their own, locally brewed beers for roughly .30 cents per draft. \n\nIn short -- buyer beware and read the cost per ounce before pouring !! \n\nThe service was blah but I get it -- the bartenders know the drill and seem a bit put off that you aren't usually going to go through them for your favorite pint. That said, you can still find other varieties plus drinks and food. \n\nOverall -- I would go back -- they have an area for games and the layout is pretty cool", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "After a long walk over the Brooklyn Bridge, stopping for a refreshing beer and delicious food was a great choice. The service was great and people were very helpful. The wings were amazing delicious. The steak Sandwich was very tasty and packed with flavor. If I am ever in Brooklyn, I will be back @raulvsfood", "author": "Raúl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "I love this place for brunch or late night drinks! They have a large brunch menu, the bowls are especially delicious. I have also been here for some late night birthdays and have had so much fun! They have game tables and the beer wall is serve yourself, so a really cool activity. This is definitely a great place to take a group of friends looking to have a fun night out!", "author": "Carly G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-13", "description": "A big group came to celebrate a friend's birthday. They started off telling us that we can't do the unlimited brunch which was fine since I was hungover. We were 25 minutes away from the dinner time, but they didn't allow us to order a dinner item until 25 minutes passed. When I ordered it, they forgot about it and never brought it out. \n\nWe got the pretzel to share, and it was pretty good. There was a big beer selection and delicious cocktails.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-12", "description": "One of the largest selections of tap beers I've come across. Various types of seating. From communal tables, to intimate couches, to tables for four, it's got it all. \n\nRandolph provides whatever you need. It's not in a prime location for weekend activities, but I imagine the place can be packed with work day crew over the weekdays. \n\nThere's a self tap station. I have no idea how it works, or how you use it, but it's there. If you don't want to deal with that you can deal with other humans, such as the bartender at the bar. You know like before Watson or Skynet takes over. \n\nThey have games in the back, which makes it even better for groups. As I explained though you can be couple here on a date and it'll be fine. I just have no idea what it's like here on a Saturday or Sunday as the neighborhood could be a little dead around that point.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "This place was cool.  I tried the brunch for the first time. Strawberry \u0026 berry French toast with a side of chicken. Very delicious. Would have gave it 5 stars but didn't feel like they were friendly or attentive enough. Mind you, it wasn't a full house.", "author": "Elle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-14", "description": "After crossing over the Brooklyn Bridge my husband and I were tired, thirsty and cold since we have chosen to do this trek on one of the coldest day of the winter!  As usual, with the help of Yelp we found Randolph Beer, a very fun place near the bridge where we could crash and warm up for a few before heading back to NYC!  \nThe place takes up most of the space on the second floor building at the corner of Prospect and Pearl Street in the DUMBO Section of Brooklyn.  There are communal tables as well as various tall bar tables throughout; there are sections with comfy couches and armchairs, and a large bar counter as well as a more  private section to the side for families or large groups.  There are plenty of games and TV screens to keep you occupy if you so desire.     It was crowded and loud in the early afternoon, so I can imagine how crazy it gets at night! I loved the hip and electric atmosphere, their self-service selection of beers on the wall, their fresh water canisters located throughout the space and most of all the disclaimer on the menu that all proceeds at this time go to the victims of the fires in CA!!! \nWe settled for an oyster stout, Death from Below and just a stout, Fig and Cacao- 16oz for $10.00 each; both were rich in flavor and taste!! We studied the menu which was very eclectic, offering from very healthy dishes to bar food; we shared an order of Chicken Wings which was fine.  \nRandolph Beer turned out to be the perfect place to enjoy great beer and fun times in DUMBO!", "author": "Patricia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-13", "description": "I come often, as one does when there are limited choices in the area and you've worked in the nabe for 5+ years (we love anything new!). I'd call ahead to make reservations for tables - it fills up fast, and I do love the oyster happy hour special + drink choices. The regular food service is so-so, because your wait time for food will be unpredictable, and I witnessed the server argue with my co-worker about his order, \"NO, you ordered this!\" - why on earth would my co-worker not recall an order he made (still sober, I might add)? Eventually he just gave up and took the dish because he was hungry. \n\nFood-wise, I'd stick to just the pretzel, the shishito peppers, oysters and fries.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "Great beer! We had the Randolph imperial stout and the saison. Daniel was a great(and funny) bartender!", "author": "David H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-12", "description": "Came here for brunch either some friends, they have lots of seating and no wait time for a Saturday afternoon at 2.\n\nThey have a couple options but we decided to go with unlimited drinks for 90 minutes and for 43$ and anything extra like (bacon,fish,chicken was added to that amount) the unlimited mimosas were great and they have lots of options and beer options as well.\n\nWe got \"big ass pretzels\" French toast and steak sandwiches. The pretzel is my favorite appetizer on the menu,the French toast was fluffy but not the best it did taste a little uncooked, and the bacon could of been crisper (although I like crispy bacon) and the drinks keep coming!\n\nVery strong drinks, waiter very attentive but not great food at all", "author": "Tekisha H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-06", "description": "Great place to hang out. It's very spacious, so it's great for groups. There are a couple of games you can play. Seating area has a mix of couches, communal tables, and bar tables. I tried the beer tap which was interesting. I found it pricey. If you want to \"try\" the beer options it's going to cost you at least $1 per sip. Most bars you can ask to try the beer if you're unsure. I ended up not trying as many as I thought I would. Cool concept though. \nI also tried their burger which was really good. Service was lacking, as we constantly had to ask for napkins, utensils, condiments. But not a bad place to hang out.", "author": "Sarina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-10", "description": "Not too impressed to be honest.\n\nCame for a holiday party last winner and it was very meh. The location is kinda cool and the beer ATM is a very unique idea but we did not really have good service OR food.\n\nWe paid for many hours of unlimited bar service and food and most of us didn't even get to eat as they gave such small quanities. Our company was close to 200 and they made enough for MAYBE 100 people.\n\nMy coworkers had to pay a lot more in tips to even get a simple drink. They also never told us last call and instead took people's drink orders and wanted to bill those that were made AFTER the 3 hour prepaid open bar package. \n\nThey also never verbally said they wanted us to leave and instead started clearing and cleaning tables while we were sitting at tables! Is it that hard to tell us you are closing?\n\nWould not go back again", "author": "Yue W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-10", "description": "Hung out here with a friend of mine.  The venue itself is gorgeous though it was cold outside and you could feel some of that in here.  I don't think I drank anything here and quite certain I didn't get food here since it may have been too late for that.  My friend had no complaints so if I were in the area with a friend again, I'd consider going back.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "My friends and I came here after work on Friday to celebrate my partner's birthday. We really enjoyed our night at Randolph Beer. \n\nAtmosphere:\nUpon walking in, I was impressed with the space and how favorable the layout was for both large and small parties. The reservation process online was easy and guaranteed us our table for 2 hours. Uniquely, the brewhouse is cashless but you can request tokens at the bar to play the games (Ski-Ball, Foosball, Pinball, etc). I liked how clean the place was, as it provided a slightly classier vibe than your typical drinking spot. While the place was busy, it didn't feel overcrowded and we didn't have to shout all night to hear each other. Service was very friendly as well. \n\nFood/Drink:\nInteresting menu consisting of both your typical bar foods and healthier options such as cauliflower rice bowls. I had the Burger with Waffle Fries. I was very impressed with the food- the Burger was juicy with a buttery taste, and the fries were also tasty. I also tried the Fried Chicken sandwich, which was also very good. Food was a bit expensive, (the Burger was $17), but the quality was above your typical bar standard. All food is ordered at the bar and there is a fun self-service beer on tap section. \n\nOverall:\nIf you're looking for a relaxed bar with great food and drinks, Randolph Beer is an awesome spot. Prices are a bit high, but the quality and experience is worth it.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "I would rate this place a 2 on the food and 0 for service.\n\nDon't expect to be served... You have to fill up your own water and beer and go up to the bar to order food. I got a calamari for $16 and it was an extremely small portion of food and definitely not worth the price.", "author": "Nancy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Randolph Beer is my favorite place for brunch. They have a great menu to choose from, and is also vegan friendly. They have great craft beer and their cocktails are so good. The dark and stormy and fresco are my two favorite. Great for groups and is kid friendly for those cool hip millennial parents!", "author": "Alex W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-20", "description": "Food was great and who doesn't love unlimited mimosas! I definitely recommend getting a table instead of the bar. It was nice to sit down with friends! The bar can be a bit loud in the afternoon. Service was a bit slow so try for a pitcher to split!", "author": "Michele M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-22", "description": "SUCH a COOL bar! Fun atmosphere with games to play. Nice craft beer selection. Plus the oysters were killer.", "author": "Eva F."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Randolph Beer", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Prospect St", "postalCode": "07307", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/419QKcSPfAx7rAdg6HOHAA/ls.jpg", "@type": "Restaurant", "telephone": "+16463833623"}