{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "Yeah, not sure if this is a place to go back to. Nice atmosphere, nice bar, but doesn't really set itself apart from other places. The beer is also expensive (I know about craft beers) however, when you are pouring your beer, just be cognizant that your beer may be up to $20.00! Here's now it works: At Randolph, you get a beer card from the bartender so you basically pay with that card using their electronic beer dispensing system. Make sure to look on the display to see how much the beer costs per ounce. In terms of food -- corn appetizer was good, jerk chicken sandwich lacked flavor. Overall, it's a boujee brewery... I would go back only if in a large group for an event.", "author": "Isra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Great atmosphere, small but comfy. Really dig the tables and bar, old distressed wood. Service is solid. Will definitely be back.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Just went with a group of my friends. Been here once before and the music was too loud but it seems like they fixed that problem. Great drinks, friendly/hip atmosphere and awesome burgers. Would definitely suggest.", "author": "Noah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Worth the wait. \n\nI went to Randolph Beer DUMBO on opening night with some friends and it was so much fun! Yes, it was the first night and, yes, it was packed, but you could tell there was so much potential for this bar/brewery to be whatever you want it to be: all day brunch with friends, a place to take my parents, perfect date spot; etc. \n\nThe beers they're brewing on-site are actually delicious...I think there are 7 on tap. If you're into beer, try them all and do it from the Beer ATM. It allows you to taste everything without breaking the bank. I didn't try any of the cocktails, but I know they have them on draft and if they're the same at Nolita and Williamsburg, then they're delicious (and bottomless at brunch). The food is soooooo solid. I NEVER order veggie burgers, but I had to after seeing another table's and it was everything I wanted. Our group also had sweet potato tots, the fried catfish sliders, shrimp tacos and the big ass pretzel and beer cheese. Everything is really really good, and great portions for sharing as a group. \n\nSpace is cool (probably better when not so crowded). Lots of different areas with different vibes like the beer hall tables, the comfy couches, and the little mezzanine overlooking the tanks. I could picture being here during the day, playing some shuffleboard and having a few beers or after work for dinner with my girls. It's really that versatile of a space. \n\nCan't wait to come back! I'll definitely be here quite a bit!", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "We came in a party of 15 people and for a place whose tables seat no less than 16-18 people you would think they would be able to split a check. Not only would they not split our bill, they won't take more than 5 credit cards. To top it all off the drinks came in one at a time and took upwards of 20 minutes to get and some took 35. Then as if that's not enough, the staff was beyond rude when we questioned where our drinks were and asked why they can't split a check. As if we were the ones being unreasonable. Don't think we'll be coming back here. Really terrible experience overall. Although the soft pretzel was pretty bomb. It's the only thing that's showed up at the table so far. Oh and someone else got their avocado toast. The rest of us are all still in the edge of our seats.", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "The best Randolph in NYC! Tons of space--booths, sofas, foosball, shuffleboard, dozens of tables, bigger bar and even an event space.", "author": "Redwan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Went here for brunch one weekend and it was the best Sunday ever! Me and my friends had a good time. Staff is awesome (but service is a little slow). But if you're looking for a good boozy unlimited brunch, give this a try.", "author": "Zane M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-02", "description": "A little noisy, but it's a nice bar with great beer selection and games like foosball and pinball machine. \n\nRating is low because I got food poisoning from eating their warm veggie bowl with salmon.", "author": "Nao H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Cool place! Went there with an out-of-town visitor on a hot Saturday afternoon and was glad to find a cool facility, a relaxed atmosphere (despite some over-the-top-birthday parties), a long menu of good beer selections and great food...including the super-delicious shishito peppers!", "author": "Marco S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "This place sucks and won't last long. Came here for brunch, it was empty and still the food took forever. I could have made a better meal at home for the price. Walk a few more blocks and go to bagel delight instead for 1/3 of the price.", "author": "Ailyn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "AMAZING!! From the service to the food. I had a great experience. The Bartender knew what to recommend from food to drinks. I ordered the salad with steak. It was delicious. My girlfriend ordered the burger which was delicious. I will definitely be going back this summer.", "author": "Tiffany U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "They overcharged my credit card. I liked the burger tho. Beer selection is great. Would come again if not for the card issue.", "author": "Collin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-15", "description": "Decided to try out this location last Saturday with my friend. She had never been to any of the Randolph's and I didn't have a babysitter so I choose the closest location. I ended up being able to get out of the house by myself. But it was a quarter to 4pm and Randolph's is the only place I know that serves unlimited brunch past 3:30. Anyway upon walking inside we were confused how to get up in there but luckily we're smart and can hear which led us thru the door. Once we got inside. I probably counted like 2 Black people which is ok. But definitely is different than the Williamsburg location. This Randolph is a self serve. But my friend and I never got up to serve ourselves once lol. I ordered the jerk po boy (I always order the Jerk Po 'Boy it's my safe option here) I guess I really just come here for the unlimited pitchers lol. Anyway, I like the jerk po boy it's juicy with enough spice and comes with season waffle fries can't go wrong with it. My friend didn't really see anything she liked on the menu but she choose to get he shrimp \u0026 grits. We ordered a pitcher of the mimosas but my friend didn't care for the mimosas. She's not a big drinker and doesn't like tart tasting drinks. She decided not to drink her mimosa. I didn't care for the mimosas either like that but stuck with them. I can tell they didn't use sparking wine or champagne. My friend then wanted to get sangria but our server which was this cute Spanish guy with long hair (forgot his name, he was really helpful \u0026 patient) told my friend that they had no sangria. So my friend could only choose between the strawberry cucumber, the lime, cucumber \u0026 tequila, and 2 others I forgot. I told her off the back the strawberry cucumber is nasty as hell. I made the mistake buying a pitcher of it at the Randolph's in Williamsburg and struggled trying to finish (I don't waste liquor...or at least try not to) anyway our server let us sample them...and yeah they were all nasty lol. But I really appreciated him letting us sample. So we just cancelled the unlimited. My friend got her shrimp \u0026 grits and didn't like it at all. It tasted bland...the grits taste Ike nothing ...we didn't taste the shrimp. She told our server to give her the jerk po' boy after that. All and all the place is nice and roomy. It's family friendly as well. There's a bunch of beers on tap. It's just not a \"sex and the city\" type place where you go to be seen and meet single people lol...that's probably more so Williamsburg or Nolita (even tho I've never been to the Nolita restaurant but I've been in the area plenty) anyway this Randolph's is good for first dates (they have a shuffle board and some other cool games to play, meeting up with a group of friends/coworkers/family, a quick drink and bite to eat. Will I be back to this particular Randolph's? yea but as family unit. I'll take my single friends to Williamsburg or Nolita.", "author": "Tameisha G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "If I could give this place zero stars I would. We tried to order drinks off the menu but they were almost out of everything. Off of a recommendation, myself and group ordered a couple drinks. One persons drink came out and then no one else's drinks ever came. We managed to flag down the waiter who said he thought we had our drinks. I'm not sure how because he never came back. We canceled the remainder of our order and paid for the one drink. Unfortunately, then, for that one drink, we were charged an incorrect higher amount.", "author": "Garrett D."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Randolph Beer", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Prospect St", "postalCode": "07307", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/419QKcSPfAx7rAdg6HOHAA/ls.jpg", "@type": "Restaurant", "telephone": "+16463833623"}