{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "I can't say enough good things about Randolph Dumbo. We rented out the restaurant on a Friday night in April for our wedding rehearsal/welcome party (175+ people). The team at Randolph, and especially the co-owner Kyle, bent over backwards for us throughout the process. \n\nWe had multiple tastings in preparation for the event, and were provided off-menu items to meet certain dietary restrictions of our attendees (the food is outstanding by the way - among other delicious items they have the best pretzel this side of Bavaria). Their team went out of their way to customize the space for us, adding personalized touches throughout (in addition to the preparation we did ourselves). Finally, for a buyout Randolph was very reasonably priced, especially when taking into account their willingness to accommodate our every request outside of the initial agreement. \n\nTo anyone used to dealing with New York bars/restaurants for a buyout situation I can say Randolph couldn't have been easier to work with. We truly found the entire experience to be wonderful and couldn't put forward a higher recommendation for the team at Randolph.", "author": "Daniel J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "I found the waitress, Julia, to be quite rude. She had multiple snarky comments throughout the meal and seemed to think that our table was beneath her.\n\nThe jerk chicken poboy was delicious. \n\nI'd like to come back because the food was good but I will be sure to avoid Julia's section.", "author": "Jason H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "The beer options were pretty great but that's about where the greatness ends. The Fried Chicken Sandwich has no seasoning and severely lacked flavor... thank goodness for the waffle fries. I would also recommend not coming for the cocktails. The Strawberry Cucumber Fizz was terrible. I didn't want to even risk ordering another drink. I give 3 stars for the chill vibe and we had a nice lounge section.", "author": "Channelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "This  place has an awesome concept. POUR YOUR OWN BEER! Charged by the fl oz. The selection was good. The beer list they had on the tables and on tap weren't the same so it threw me off. But anyhow, the concept is pretty fun. Just look and see which beer you want, and then put your card that is given to you and then pour as much as you'd like. Pretty cool. Didn't have any of the food but looks pretty good.", "author": "Lester E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-14", "description": "The food is ok but the fried chicken sandwich is hit and miss- sometimes it's freezer burned and rubbery. More importantly though -- my coworkers and I used to come here a lot to play foosball on our lunch break. That was the main reason we came. But then they replaced that table with a cheaper one that wasn't installed properly; the handles are all out of wack. So we pretty much stopped going. If you guys fix that foosball table please reply to this review. We'll come back!", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-15", "description": "Before we walked in we read a review that the service here was terrible. That should have been enough for us to steer clear, but we figured how bad could it be? We arrived at 1:30 PM on a Saturday for brunch and ordered by 2. My medium rare burger arrived at 4 - cooked well -it was inedible. I could go on and on about how many things went wrong but I'm just happy to get out of there and know I will never return.", "author": "Keith G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "We had my husbands birthday party here and it was perfect. Food is fantastic (big ass pretzel, French friends with jackfruit  everything is delish) and our service was amazing. The server was communicative and willing to do whatever it took to make our experience the best it could be. Highly recommend  this place especially for birthdays or bigger parties.", "author": "Kayli J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "I love this spot for a weekend brunch. Never too crowded, the staff is great, it is kid friendly and the food is better than most of the other nearby options. The menu is expansive, there is something for everyone, and the space is really well designed. Surprisingly kid-friendly along with being a place where you can go drink one-too-many.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "Arcade like atmosphere where you use a beer card to fill up on beer. Buyer beware (!!) - prices add up very quickly. Be sure to read the price per ounce before purchasing. I made the mistake of not checking and paid $2 an ounce for a sour. Pretty ridiculous price if you ask me. I can go to a craft brewery and get a sour for half the cost I paid at Randolph. My girlfriend and I ordered the jerk poboy and corn. The jerk lacked flavor, think very peppery pulled chicken covered in cheese. The corn tasted better, but I'm not sure we'll be back with such high prices.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "Really terrible food. This place is obviously known for its beer, and I didn't have any so I won't speak for it in that regard. Eggs Benedict was horrible. Eggs were hard, the hollandaise tasted like it had turned and even the waffle fries weren't good. The pretzel appetizer was tasty but $11 is outrageous for something I would bet my life was made elsewhere, frozen and reheated. Street pretzels are just as good and cost less than a third of that price. I had an iced coffee and asked for milk, but never received it. Just overall terrible dining experience. If you're going here, just get drinks.", "author": "Gina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Came here for my cousins birthday. Beer isn't my favorite thing but they do have a bar where you can order regular drinks too. The whole\nIdea of it was very cool.", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-30", "description": "A disappointment. \n\nI've been to the Nolita location and it was fine. The new Dumbo Heights location is far from OK. The music was blasting so loudly that everyone had to shout at each other to attempt any conversation. Constantly yelling \"WHAT?\" back and forth is not my idea of fun. I really think that 50% of the problems here could be fixed by turning down the music.\n\nFood Pricing: High\nExample: $10 Pretzel / $11 Shishito Peppers / $17 Burger\n\nBad environment to be eating in even if the food prices were more reasonable.\nThe vibe of this place (primarily caused by the noise level)  is kind of well...stressed out, and promotes anxiety. \n\nThe beers are listed on a chalkboard with no price but their ABV%. I asked for assistance and chose the highest ABV beer so I could drink up and get out. The prices are on little screens at the taps, difficult to see and understand (until after you've filled your glass).  After filing the standard sized glass my cost was $23 for a beer ($1.55 per fl oz.) and nothing special either. If I wanted a $23 beer I would have gone to ........ um.......well......NOWHERE! There are no $23 beers to be had anywhere in NYC, including the top hotel bars and lounges. \n\nThe ordering, fulfillment, and payment process is confusing and unorganized. \n\nThe employee who assisted me tried to offer me something to compensate for the rip-off beer, but I couldn't hear a word he said and decided to cut my losses and leave.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "Good beer selection however the aesthetic is trying too hard. Some menu items were very well done such as the French toast and the fries while others lacked flavor such as the eggs Benedict. The place is very loud so it's hard to have a conversation. All in all it was okay and the prices were good for the food but it probably isn't worth going with better options in the area.", "author": "Timmy W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "Where do I begin had a reservation for 2pm half my party arrived alittle late but the rest that arrived on time were seated immediately. Took us a while to even get water out waiter seemed a bit/a lot frazzled we did the unlimited  drinks. Our food took literally  over an hour to come which the server kept saying the kitchen was backed up but to me they weren't even that crazy two big table but that's it. Again we did the unlimited drink with 1 main course for everyone when it finally came time to order server told us the lobster roll was +6$ because \"you know lobster is expensive \" whatever granted but that should be stated on the menu which it was not and he said they had ran out of shrimp and grits....howwww?  He said a whole 8 top ordered it...still didn't add up but whatever. We still had a great time and left pretty drunk but that's most likely because got ALOT of drinks before food came. Will I return maybe just not for a sit down meal probably just sit at bar and play the games they have. BTW all the brunch punches suckkkkk.", "author": "Oneka B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "I'm not sure I understand the negative reviews on here. I placed an order for pick up over the phone for dinner and the staff was extremely polite and accurate with our order. Although I cannot speak on the ambience or the beer, the food was delicious.  We got veggies bowl, one with grilled chicken and one with steak. Both the chicken and steak were juicy and cooked well. Veggies were fresh and seasoned well. We also ordered mac and cheese and sweet tots. Both fantastic, mac and cheese- creamy and flavorful and the sweet tots were the best tots sweet potato tots we've ever had- especially paired with the chipotle sauce it comes with. Don't let the negative review dissuade you, give this place a try even if its just for the food.", "author": "Sara A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "This place was awesome! Our group went in and it was a very cozy atmosphere, nice places to sit all over, including lounge Chairs and couches. The beer was also great so many to try! The beer wall makes for a very enjoyable experience. I'd recommend to anyone to go to this place and have a few beers!", "author": "Jacob H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "This is my new favorite bar in Brooklyn! With a beautiful and spacious indoor seating area with games and couches and the awesome selection of \"pouring your own beer\" by the ounce, this is a must visit!", "author": "Amy T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-15", "description": "It's great to have a new bar in the area, but every time we've been here they seem under prepared. Not enough bar staff, kitchen is backed up, and not taking new orders. Wish they just had more staff, and were a bit more prepared.", "author": "Vic S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Would be 5 if everything wasn't so unnecessarily pricey. It's always pretty packed so they must be doing something right. Cool place, but I don't plan on spending 30$ for one beer ever again.", "author": "Shaun V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "Pro:  light and airy indoor/outdoor space; interesting selection of beers; games.\n\nCon:  entry level beer costs $10 ($9 plus tax).  Even this NY beer drinking veteran finds that bitter", "author": "James D."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Randolph Beer", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Prospect St", "postalCode": "07307", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/419QKcSPfAx7rAdg6HOHAA/ls.jpg", "@type": "Restaurant", "telephone": "+16463833623"}