{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Seemed like a really cool place. Came here after work for a beer and had a good time with hubby. The bartender was attentive something I like. When she seen I was going empty on my glass she approach me to ask if I need another. The food was good. We order the shrimp ceviche and the shrimp tacos. I wasn't to fond of the tacos though. We also ordered oysters east and west coast. I have to say I would always love east coast.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Great atmosphere music games and bottomless brunch every weekend !! Brunch starts from 11-4pm I love the drinks and food", "author": "Joey O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Although the Brooklyn \"bro\" culture is alive and well here, Randolph Beer is a cool place to hang out after work. Its location across the street from my office is a huge plus. \n\nI love that they have the pay as you go beer taps. I hadn't seen something like that since I was in the South of France and I have always wanted it to exist in the US. When I first started my job my coworker told me about it and my eyes lit up. \n\nI mostly just come here for the beer, I've never ordered food or even used the pay-as-you-go feature (we have been sitting outside since it has been so nice out.)  Randolph's house beers are on point and I do enjoy coming in to grab one of those. As for everything else: it's your standard craft brewery. \n\nAt this point, nothing really impresses me when it comes to selection because so many places have a good selection of beer (I was also spoiled in Pennsylvania where we had a place with an 8 page beer menu and I frequented it ever since I was 21.) What always impresses me are the house beers and whether or not they are actually good. Randolph's selection never disappoints.\n\nIf you are looking for a quality brewery with a cool tap feature, check this place out :)", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "I've been to the NoLita and Williamsburg locations of Randolph so I was excited when I heard the DUMBO location was opening up because HH options around here suck.\n\nUnfortunately, their opening was delayed several months due to plumbing issues, but they finally had their soft opening and I went for a work event.\n\nFirst of all, the layout of the place is really weird. It's a split floor, and very winding. The beer ATMs are closer to the entrance than the bar (where you need to go to get a beer card), so that's awkward (especially when it's packed). Lots of tables though.\n\nThere's also tabletop shuffleboard and a pinball machine.\n\nThe upstairs area is tiny (3 picnic style tables that you can reserve) so not a lot of room to move around. Waitresses came by pretty often, so that was nice.\n\nDraft list had a lot of variety. Most beers were $10 for 16oz, which isn't the best, but at least they're good beers. But the beer ATM list is different, so hard to maximize your choices in one fell swoop.\n\nIn terms of food, they have a full menu. We just did a bunch of appetizers to share. The waffle fries with cheese were yum (melted cheese on top and a dipping cheese on the side). Shishitos were also good, bit pricey at $11. And the Big Ass Pretzel was as advertised. I'm a sucker for beer cheese.\n\nWill definitely return, but maybe on a night where the whole neighborhood isn't there for the opening. Keep up the good work, guys!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-10", "description": "We really had a good time there. The beers were awesome, really good food and the crew really nice. And playing games while drinking our beers was definitely a plus.  I highly recommend this place if you are looking for a good time!", "author": "Maxime T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-14", "description": "Very cool spot. Especially when you finish work. East coast oyster was so much better than the west coast there. I remember them infusing oyster in beer. Thought that was creative. I believe that was in October. Place is very spacious. With an outdoor seating. Definitely be back.", "author": "Benito M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "Inviting new addition to DUMBO, despite being later to open than anticipated. 24 beers on tap including 4 solid house brewed selections. Pour your own with an issued \"debit card\" or poured by the bartender. \nFood ( at least on a weekday afternoon) ordered at the bar.   Brussel sprouts just a little too sweet. Beef \u0026 veggie sliders both delicious.   Friendly bartender ( Henry ) said they have a permit for sidewalk tables in the nice weather. Mostly communal table style inside, but pretty big by NYC standards. Nice open \u0026 clean brewing room at work.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Super cool spot! We came on a Saturday night and were able to score an awesome table area for large group. They have a few arcade games which is fun, the bartenders were awesome, and the place is really spacious. Will be back for sure!", "author": "Bianca M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Great service! Great food, cool environment... loved everything about it and staff was really friendly also.", "author": "Raffaele P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-27", "description": "I was really excited to check this place out since seeing the \"coming soon\" sign pop up.  Sadly, I don't have great things to report back.  My husband and I stopped in on a Saturday afternoon.  I'll break it down simply:\n\n- Atmosphere:  Very hipster-dumbo.  Fun games, industrial vibe, and diverse patrons.  The music is SO loud.  Maybe I'm getting old and my days of shouting over music bouncing off of beer kegs is over.  Or maybe the decibel level was well over the normal limit.  Either way, I'm brining my Dubs if I make it back.\n\n- Beers:  Cool idea to allow customers to pour their own beer by ounce.  They had a great selection and the process was easy.  On the downside, the prices were high.\n\n-Food:  Here is were I rank LOW.  We just wanted a quick snack so we ordered the avocado toast plus an egg ($3) and plus goat cheese ($3).  Seemed a bit ridiculous but hey, we were in DUMBO.  45 minutes later, still no food.  I asked the waiter who took the order how much longer he thought it would be and all he said was, \"I did ring it in.\"  Ten minutes later I cancel the order with a different waitress.  Coincidentally a guy from the kitchen comes out with the dish apologizing for its tardiness and offers to take 20% of the top of the bill if we still want it.  So we accept graciously because at this point we are starving.  The dish was a thick piece of cold, burnt toast.  Topped with sliced avocado, a trace a goat cheese, and a very cold over easy egg.  It doesn't take much of an imagination to guess how this tasted.\n\nOverall:  Beers were cool but overpriced.  The food takes an hour and comes out cold.  Maybe try their other locations which seem to have better Yelp reviews.", "author": "Jen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "I know it's been awhile since I last took the internet by storm with a fevered review that shook the food service industry to its CORE, but fear not, for I have returned to take advantage of my position as a judgmental patron of occasional brunches to transform my biased perception of a brief two-hour experience into a full-fledged declaration of the objective quality of the restaurant. In this case, I declare that the restaurant is good!\n\nI came here for a co-worker brunch last week (get turnttt am I riteee???!). We decided to participate in the brunch special, with consists of 90 minutes of unlimited brunch punch, mimosas, select beers, a main entree, and--if you're a supporter of Satan himself--bloody Marys. The restaurant requires the entire table to participate and all members of the party to be present before the clock begins. I must commend the waitstaff for being so accommodating when one unnamed member of our party arrived 45 minutes late (cough*OLIVIA*cough) so we had to wait to start our ordering/drinking. We were not pressured to leave or met with any bad attitude (which honestly would have been completely justified). Once our full party finally assembled, the waiter was very attentive in refilling our drinks and giving us recommendations on what to order. \n\nThe interior decor was spacious and comfortable, though the bathroom stall doors did not seem to lock properly so I had multiple people walk in on me and I also walked in on multiple people. Luckily, the alcohol had kicked in at this point so this was not a real issue for me. \n\nTurning to the food and drink, both were excellent. I am a sucker for eggs benedict, but thanks to a combination of peer pressure and my love for the classy exclamation \"kiss my grits!\", I am proud to announce that I broke from tradition and instead ordered shrimp n' grits, and I'm glad that I did. The perfectly-cooked garlic-poached shrimp sat on a creamy bed of well-seasoned grits, which was enhanced by a sunny-side up egg and shishitos, Asian sweet peppers that added both flavor and texture. \n\nThe drinks were unique and refreshing. Between the tequila/cucumber and the dark \u0026 stormy, the alcohol provided a nice complement to the food and the conversation. I especially enjoyed the variety of the drinks, and how attentive the waiter was in refilling our drinks and reminding us of our time remaining so we could properly plan. \n\nGood friends, good food, good alcohol, good service - would recommend!", "author": "Ray B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "HUGE place. My cousin chose this spot to have some wine after work and talk about life. We had a bottle of Malbec which was a good bang for our buck. They had distributors there so we had the opportunity to try their new Malbec called Loca Linda! We actually enjoyed it more than the current one so that was awesome. It has a much fresher taste. If it's at the same price point it's def a go to if we return. I wasn't crazy about their food options. We ordered veggies and Mac and cheese. After a lot of wine we devoured the Mac and cheese! My cousin enjoyed her veggies as well. I don't eat corn so that was NOT an option for me lol. All in all def a good place. Probably great spot for large groups.", "author": "Tara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-20", "description": "​Was at Randolph Beer having lunch in Dumbo for a birthday extravaganza and my manager and I ordered a chicken sandwich. It was raw. Brutally pink. I have sent it back with no mean intentions. The manager comes out and says there is nothing wrong with the chicken and suggests we can't tell cooked chicken from bright pink chicken. No apologies. Just asked us If we wanted to order something else. Ridiculous. I know what cooked chicken looks like. In the words of Gordon Ramsey, \"the chicken is raw!\"", "author": "Claudia T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "Horrible service. My friend brought me here because he's been here before...but we had THE ABSOLUTE WORST time.  After a lengthy delay, my friend flagged down a server...and that was how it went...had to constantly flag someone down for service.\n\nI told him we are NEVER coming back here again!", "author": "Asha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-06", "description": "Came by 7pm on a weekend, not very crowded at all. My friends (8 of us) and I sat at a large table, waiting for a server to come by. \n\nAfter 20 minutes and as we're about to leave, a neighboring patron tells us that they only serve at the bar. We had to each individually go up to order the food at the bar. When we asked for water, we were told it was self serve as well. \n\nIt's a huge space with such great potential but the customer service is so subpar. \nThe food is pricey as well and doesn't look like the type of divey bar where you order food at the bar. What are we tipping for if we have to do everything ourselves at this place?", "author": "K W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-21", "description": "The beer was pretty good and the space was nice. The red headed bartender was an absolute nightmare. She was extremely rude and condescending. She gave dirty looks and attitude for asking to try a beer. It's a brewery and sampling a beer should not be a crime. For this, I will absolutely not be returning to this bar. It's not my fault that your life path led you to here and now and taking it out on your customers is highly inappropriate.", "author": "Sender C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-26", "description": "The atmosphere is really nice with decor and games as for my food that's where it all went wrong the chicken sandwich was under cooked the entire inside was practically raw,I really hope I don't get salmonella.", "author": "Sleepy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "I went here over the weekend with my girlfriends for brunch the waiter was very friendly and we loved the drinks which they make pretty strong. They offer bottomless brunch as wel which is a good price. I recommend getting the starwberry cucumber fiz my fav!!!", "author": "Stefania Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-12", "description": "Literally the worst service I have ever encountered in Brooklyn. We booked for bottomless brunch, turned up and said we had a booking - the host rolled his eyes and said, \"you can wait.\" Ok? Waited, ordered some coffees - after 30 mins, no coffees and no service. Flagged down one guy who said \"I don't do coffees, that's your problem\" and left. After 40 mins flagged down another guy who said \"you'll have to find your own waiter.\" Eventually the waitress returned - it was a pretty empty place with very few tables sat so it's not like she'd been working elsewhere. Clearly annoyed, told us to order. We ordered, then said we'd have mimosas - she just went \"then get your IDs out.\" I mean we were a group of women in our mid 30s sitting quietly in the corner and having food but ok... I understand sometimes people need to ID people i guess, though I've never been ID'd over the age of 30 while eating brunch. Food took a long time to arrive and was nice when it did but in order to get our watered-down top ups we had to literally chase down the waitress. Everyone we encountered was actively rude and we didn't once get a \"Thankyou for coming\", \"how was your meal?\", \"can I get you anything?\" Etc. I left feeling embarrassed because we'd recommended this place to our visiting friends who said they'd never encountered more hostile service. I literally have no idea what we could possibly have done to offend them but everyone in this place was so actively mean and unfriendly that I would never go back and would never go to the other breweries under the same ownership either", "author": "Holly A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "Came here for Brunch in October. Our waiter was great! I wish I could remember his name but I took a while to write this review. Food was amazing and drinks are very unique. I have been to the other location in Brooklyn, but I prefer this one because it has free retro arcade games! Just ask a bartender and they will give you a cup of tokens. The decor is also really cool. 5 stars all around", "author": "Chenelle R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Randolph Beer", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Prospect St", "postalCode": "07307", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/419QKcSPfAx7rAdg6HOHAA/ls.jpg", "@type": "Restaurant", "telephone": "+16463833623"}