{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "My new meet up spot in the area. Love everything about it. Great coffee and pastries. \n\nWill definitely be getting some work done here.", "author": "Feven S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "I have come here at least 10 times since I live nearby.\n\nThe guy behind the counter is so rude. He will avoid eye contact and then roll your eyes if you ask him a question. He is usually the only person there so I guess he just doesn't give a f.\n\nThe bread is amazing, but the pastries are over done. I've gotten pastries that are borderline burnt. This is their style though, you can see their croissants and other pastries are on the browner side vs other bakeries.", "author": "Win C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Stopped in on a Saturday morning. Cute little cafe with maybe 10 small tables that can each sit 2 people. Not really good for larger parties, but I suppose you could squeeze tables at the front together (although it's a tight squeeze up there as it is).\n\nPretty basic drink menu, but I think often it's nice to get away from all of the over the top drink offerings of other cafes/franchises. Great selection of pastries and bread, however, don't come too too early! I noticed a bunch of other stuff being put out after I'd already ordered and started eating. \n\nThe chai was fantastic. One of the best I've had. It was definitely sweet, but my favorite part was that it was full of that wonderful spiciness that many chai lattes seem to lack. \nTheir ham and brie croissant was absolutely fantastic. Wonderfully flaky and crispy, but melty and steamy on the inside. Great savory flavor to balance out the chai. \n\nThe only issue I had was that I saw the barista handle food w gloves he'd just used to handle money... pet peeve... but the food really is that good that is still come back. I wish I was in this area more often!", "author": "Amelia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "I first encountered this place when I stayed at a hotel on Smith St. in Brooklyn.  I ventured down the street and wanted coffee.  As I entered, I saw the display of croissants and how flakey they were so I ordered a Chocolate one and a Kielbasa for breakfast.  \n\nYou can literally see each layer of dough in these croissants.  Very crispy on the outside and soft on the inside, just how a croissant should be and boy was my chocolate croissant delicious. \n\nMy second time at Bien Cuit was recently when I took my dad there for breakfast.  We bought a bunch of baked goods to take back to Hawaii and we also grabbed some bites at the cafe for breakfast.  \n\nFood: \n- Quiche Lorraine - Very soft eggs with pieces of bacon? or pancetta? mixed in.  Crust is very flakey and buttery and most of all, delicious! \n\n- Spring Onion Quiche - Again, very soft eggs with spring onion.  QUite flavorful with a flakey, crunchy crust.  \n\n- Kielbasa - The winner!  This was such a good pastry and both my dad and I were fighting for the last bite haha.  Basically it is two slices of bread with kielbasa sausage stuffed in between with a mustard seed sauce.  This was then topped with cheese and a poached egg.  It is also heated when you order it.  Very delicious and highly recommend it.  \n\nService was great.  Coffee was great too and they serve almond milk.", "author": "Teddy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Every time someone visits I have to take them to Bien Cuit! The smells alone of baguettes baking are worth a visit. So far we've tried the almond croissant, chocolate croissant, and croissant bread pudding (yes, there's a theme here) The croissants crunch as you bite through them, then fill your mouth with flaky warm goodness. Oh and get yourself a cappuccino bc why not? Go go go!", "author": "Ellie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "We love getting egg sandwiches when we can. These are hands down the best egg sandwiches we have had. It is wrapped in flaky, light croissant dough. The egg tastes as if it is poached . Not sure what the flavors were that were added but they were excellent. Cinnamon roule was lovey as well. Plain croissant was outstanding as you would expect. Latte was skillfully made. One of the outstanding bakeries anywhere.", "author": "John E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-22", "description": "I walked into Bien Cuit and stumbled into a sea of laptops. No one was eating anything. Bien Cuit is a coworking space!\n\nIt's super dark, too. Bien Cuit is a cave!\n\nI approached the sales counter. The gentleman behind the counter was on his smartphone and didn't even look up at me. Bien Cuit is too cool for school!\n\nI looked at the lovely baked goods. Bien Cuit needs to find good homes for them! But how?", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-05", "description": "I've been coming to Bien Cuit since it opened, and it is probably the best place in the area for bread and pastry. Unfortunately, it has become a little too expensive. The turkey swiss croissant is delicious, but it consists of a croissant cut in half with one slice of turkey, one slice of cheese, arugula and mayo on the inside. I used to come here on the regs for this sandwich (when it was under $10 and also had more than one slice of turkey and cheese; I think it started and $7 or $8 bucks but now is $10.50 plus tax). Now I think I'll just buy a croissant and put my own slice of turkey and cheese inside. Should be more like 3.5 stars.", "author": "F. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "The night before I was in the mood for a well crafted, French Pastry. Once a upon a time there was a perfect spot on the Upper East Side. Francois Payard Patisserie was my go to spot any time of day, a light lunch with a glass of wine or a latte with their fabulous baked goods. It was a warm and rustic spot that just closed one day.\n\nWalking into Bien Cuit, it had the same French-Country rustic feel. There aren't wines by the glass but there are fresh baked pastries, coffee and more importantly Tartines. \n\nI see the freshly baked breads and loafs. I zero in on a beautiful looking Salmon Tartine. Made with Horse Radish Crème Fraîche, Pickled Beets and Fresh Dill on long piece of Campagne bread, it was the perfect size for my lunch. There was no wine but I had a nice latte in a large mug. I also snuck in a small chocolate thingy they were selling under glass.\n\nFirst time impression? I'm a fan. There's a Specullos Éclair with my name on it. ;)", "author": "Bill S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "Nice vibe, cold eggs. \n\nYou would think. for an eight dollar breakfast sandwich you would get at least hot eggs. But not here, all I got was a cold egg on the circular croissant for eight dollars the end. When I gave it back to the cashier and told them it was refrigerator cold she said what do you want me to do about it. they warmed up the eggs but then they were too warm. kinda crispy. Not the way I like my eggs, no no.", "author": "Jared B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-15", "description": "Pastries - 4/5 - While I cannot vouch for the rest of the goodies this place offers, I can comment about their croissants, both plain and chocolate are pretty darn good. The one item I did not like from the haul I purchased was the poppy seed croissant, which for some reason was kind of tough to chew for a baked good that was purchased at 11am. This is something I'd expect at 5pm, but not 11am! \n\nCoffee - 4/5 - Strong, well-balanced, happiness in a cup served by the stone-faced employee.\n\nTartine - 3/5 - Salmon tartine was considerably underwhelming, especially when I love salmon. Crust was incredibly hard to bite off and not recommended as a to-go item. \n\nStaff - 3/5 - Guy who picked my items was cordial and helpful, but the female at the register have a certain \"je nais se qua\" that I loosely believe comes off as \"I don't want to be here so why don't you just tell me what you want so I can ring you up and GTFO\" vibe. \n\nSpace - 4/5 - Cozy, rustic, welcoming; only complaint here is I wish they make it apparent as to where the line forms. Coming in for solely coffee would be disappointing because there is a line for everything plus coffee, and not just coffee.", "author": "Helen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Probably my favorite bread spot in Brooklyn. I love the baguettes and the croissants are THE BEST. I come in all the time with my girlfriend. The workers are always pretty great. \nI missed the beignets this weekend but the guys there were all very great about it. The tall red head and the guy with long hair were very informative.  great staff!\nI got and Almond Croissant instead which was AMAZING!\n\nMy go tooo shop for all things good!", "author": "Tiyee T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-15", "description": "I love Bien Cuit. Best coffee on Smith street and an excellent selection of savory bites that really balance flavors. I usually enjoy the vibe and find it chill and refined and appreciate their use of actual plates and cups. I was taken aback today when I came in and they were serving all drinks and food in disposable products. It took away from the experience and of course added to waste. It was SUPER busy so I understand how employees felt  like they had to move fast and use disposable products. But it really took away from my experience. I like to sit and savor their delectables and today felt really off. Hopefully this doesn't happen too often. Maybe bring in another counter person during the busy weekend hours?", "author": "Rebecca P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Breads, breads, breads! I traced this place down from a wonderful brunch experience at Estela that they served the best sausage, avocado and runny egg sandwiches. The bread itself was so good that I shamelessly called Estela to ask for the name of the bakery. So here I am embracing the heavenly good smell in the store!\n\nThe cute bakery shop is spacious to hold ~8 two-seats tables (4 by the window, 4 by the wall). They proudly serve Joe's coffee at reasonable prices. I ordered the sourer sourdough--Miche (Blended Rye \u0026 Wheat Flours, 68-Hour Fermentation). The bread is hearty and flavorful! Its so good that I can eat it as a dish without butter/gem. But crust is deadly hard get a saw to cut it (joking! But you do need a good bread knife). \n\nOther pastries all look very delicious with nice presentations. You can tell their skills just from the delicate presentation (see pics). Would love to come back for pastries bites and grab another half sourdough to-go!", "author": "Cristina X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Found this place from a tour we took in Brooklyn... AND PEOPLE OF YELP, When I tell you the best croissant I have ever had it is true! We also tried the Sourdough this was unlike any sourdough I have ever had! Very good. And the baguettes were top notch as well. Service was very friendly. If you go to NY go to BIEN CUIT. It is a must!", "author": "Cameron M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "Location: Still, Another spot at Cobble Hill, where family can be together hanging out, cars are no longer too fast and time can be bit lazy compared to living in Manhattan\nPlace has many seats for people to sit in and enjoy wifi.\nMost people here went for food\nBut I do croissant\nSo at 8 o'clock\nI found the croissant is bland, tasteless.\nI just wanna know: where's your cripsy layer,\nwhere's the chewy feeling\nwhere's the texture\n\nThey are gone, they are gone\n\nService: oops, They clearly do not want to be on the shift that day... kinda slow and rude...\n\nOverall: 2 .5 stars...", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "A solid bakery, but not necessarily worth going hugely out of your way for. I ordered the apple cardamom danish, which had a nice complexity of flavors and a lovely rich dough. The chai latte I ordered was a bit slow in coming and not at hot as I'd normally like my morning beverage to be on a chilly day. That said, everything looked amazing and they had a lovely variety of pastries and breads. I could see this being a regular indulgence place if I lived nearby.", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-18", "description": "I had a good cup of herbal tea. They serve Irving Farms coffee which is very good. \nHad an excellent cranberry ginger danish. Even though danish might classified as sweet, actually a good savory. I so appreciate when bakery items are not sweet, where you can actually taste the ingredients. Fine service. Plenty of staff to take care of people. Airy open space - relaxed and classy setting.  A step above the other places in the neighborhood in terms of food, service and setting.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "I previously posted that I got sick from the breakfast sandwich here.  That definitely happened but I wanted to update that post with the fact that I wrote in to the cafe and promptly got a response from one the managers.  Once I confirmed my payment information, I was promptly issued a refund which was great.  Good people but that may have just been an outlier.", "author": "Ron W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "Great little place with excellent food!  The Breakfast sandwich with round Croissant and egg is superb!  Must try. The Mocha was excellent as well. Service is good but not great. Although that might have been since it was a busy time.", "author": "Vaibhav G."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}