{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-02", "description": "This review is on the croissants only. We have tried at least 5 different types. One thing they all had in common is they are all over baked. Too well done. when they are so dried out they lose flavor. Bien Cuit gets very good croissants reviews. I find some times when food is pricy some people that just don't know better believe it's good. I don't mind the price if it tasted delish. Could it be I just had bad luck and bought bad batches. I've given them 5 try's 2014-mid 2015. Screw me 6 times shame on me. Bien Cuit I have no use for you.", "author": "Jeffrey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "Bien Cuit. Bien awesome.\n\nSeriously love this place. When Bien Cuit showed up in the neighborhood I was a little like, meh, another cafe, take it or leave it, but once I smelled the amazing aroma of freshly baking goods in there, I was in love.\n\nThe real thing doesn't disappoint either. The croissants are truly blow your mind good - especially if (lucky you!) you get one of the fresh out of the oven ones. And I don't just mean the plain ones. The ham/brie, the chocolate, the almond - all amazing. AND the plain is ridic good also. \n\nThere is also this apple thing (I can't remember if they call it a croissant or something else or what) that is to die. It has this crema in it that I have literally only found in such perfection in Italy in what they call sfoglias. SO GOOD.\n\nThe coffee is also great. I'm a cappuccino head through and through and I love the capp at Bien Cuit. Highly recommend this spot for everything - and they have wi fi too. BOOYAH!\n\n(Oh one last thing, don't bother with the sandwiches. CROISSANTS or the apple thing, which may be a croissant too...)", "author": "Daniela F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-05", "description": "I was so psyched when this place opened.  Finally, a great local bakery.  But nowadays I curse myself for going there for anything other than a loaf of bread.  The breads are consistently amazing, but only just about worth their price.  \n\nThe pastries, while often very good, are so overpriced it's insane and they are inconsistent in quality (e.g., today my almond croissants was quite burnt).  And the coffee is just not worth it - nor the erstwhile spritzers (which were simply fruit juice mixed with soda water).\n\nStill, the breads bring me back.  And then I end up buying something on top, and.... dammit!", "author": "Phil S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "If you like being transported to paris look no further.  Hands down the best croissant in brooklyn and IMO NYC(Claude is a close second)\n\nFor a great espresso and breakfast this is my place.  The sandwhich for lunch are also Top notch.\n\nDeduct one star as sometimes the service is Great, others not so much.", "author": "Margo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "Really good coffee and pastries. Super cute back patio too! Everyone was lovely here.", "author": "F. A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Had a delicious salmon tartine and went to heaven. Very accommodating with my off-menu coffee request and it tasted good too! We will be back to try some of the sweet treats on the menu :)", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "Maybe the best baguette I've ever had. The other breads are great too (try the miche!) Almond croissant is extraordinary. I love their salami sandwich and am eager to try the venison meatball 'wich they unveiled this winter.\n\nI've had one over-sweet tart (I think it was mango), and one underwhelming sandwich (turkey on croissant), but everything else I've tried has been first rate. If everything were a dollar less, I'd probably eat or shop here 4 or 5 days a week. It's more expensive than the nearby Italian-style bakeries but, really it's a whole different thing, so it's hard to compare.", "author": "Frank E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-07", "description": "Croissant. Coffee. Word.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Delicious quiche and chocolate croissant in an authentic bakery. I think it was a little overdone but we accidentally went on Bastille Day so it was understandably crazy for them. Iced coffee had good flavor and was really strong", "author": "Alix Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-26", "description": "I like to stop by this shop when I can on the weekends to grab a petit pain.  I love their petit pains!  I've had the pugliese and the raisin walnut, which were both quite flavorful.  I've also tried the ham and brie croissant which I really enjoyed!  Buttery and savory goodness! This place is perfect to grab a little snack!  \n\nAlthough it can get a bit pricey, I stick to the small stuff, which is fancy enough for me!  I'm giving this place 4 stars for a great place to grab a small and simple snack in the neighborhood, and because every time I've gone in, the staff is super friendly!   But -1 star for the price point which drives me away from trying some of their other baked goods.", "author": "Heather D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-03", "description": "They are constantly out of stuff; notoriously they don't have their almond croissants much past 9 a.m. The scene behind the counter is indifferent at best, a nightmarish chaos orgy on weekends. The poorly made coffee often isn't ready. The sugar/milk station is a sh*tshow. They are badly in need of a real pro to come in and fix their operation/workflow.\n\nTheir product is great when it's in stock, but I prefer to buy it elsewhere when I can. Runner and Stone is making better bread, but their Gowanus location isn't nearly as convenient as here.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "Nice ambiance for a French-feeling cafe. The cappuccino I had tasted watery and lacking coffee strength. The maple yam danish I ordered was delicious, but pricey at $3.75. For the cappuccino at $3.50, I could have gone to Starbucks, which is a last resort when I'm in this \"chic-wannabe\" neighborhood.\n\nI would recommend sitting here if you have a few moments, and more currency, to spare. Otherwise, walk a little further down to Ecopolis for a better beverage and less pretentiousness.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "I would give multiple reviews on different aspects of this place.  The bread is fantastic -- definite five star.  Some of the reviewers here say the crust is too hard -- it is hard, but the inside is nice and soft and that is the way I like my bread.  Pastries are excellent too.\n\nMy first criticism is the coffee, which I really didn't like at all.  And, second, the prices are a bit high.  It's also slow getting in an out of there.\n\nFive stars on the pastry and bread quality, 3 stars on everything else.  The everything else portion can be fixed.  Overall I'm very happy this place is in the neighborhood.", "author": "Nikolai S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-26", "description": "The croissants are amazing (I dream about them) and the coffee is good. But there are one or two baristas who are so bloody rude--and not subtle about it at all with blatant eye-rolling and snippy responses to questions. I guess, as one reviewer said, they know they have a great product so they don't need to waste any energy on kindness, but man! do I feel bad for a few minutes after ordering. Then I eat my croissant and I don't care anymore. I just don't understand the attitude...why work in a face-to-face customer service job when you hate people?", "author": "Alissa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-24", "description": "No wifi on Saturdays. \n\nReally overpriced--the mini quiche, although tasty, was $7. \n\nCounterwoman was really belabored about toasting my quiche, and told me she didn't know how long it would take because \"it's a new toaster.\" Then she forgot about it. When I went up to the counter to see about the quiche, she totally ignored me. I said, \"is that my quiche?\" (it was sitting on the side of the toaster). She said--\"oh yeah, i thought you left.\" The staff doesn't have their act together. The place looks a bit empty in back.\n\nLatte was good--two shots standard.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "You had me at the miche.\n\nAfter a handful of disappointing bakery experiences, I began to wonder if there was any decent bread in New York. I'll admit that the I had aversions to Bien Cuit based solely on the storefront -- a lot of hackneyed businesses have been popping up on Smith Street over the last few years and this looked like it could easily be one of them.\n\nThat said, the miche is delightful, with a chewy, slightly sour crumb and rustic, flavorful crust. The baguette is formidable; certainly the best I've had anywhere in NY so far. \n\nI won't speak to the coffee (I haven't had it) or the ambience (I've spent a collective 15 minutes in the place). Go to Bien Cuit for the bread.", "author": "Angela T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "The latest bougie bakery to come to Cobble Hill, Bien Cuit is the place to fuel your ridiculously beautiful south Brooklyn weekend. Airy and well lit near the window, BC sustains light conversation on weekends and dead freelancer silence on weekdays, but it's not really a place to put down roots. They seem to be sending mixed signals in that they have free wifi but no bathrooms, so your work date will last only as long as your bladder can hold out. \n\nThey brew French pressed Crop to Cup for prices which have become standard for the neighborhood but that doesn't mean you have to like it. Their bread and croissants are exceptional though, noticeably better than even the good rival cafes and bakeries. Sure you'll pay for it, but croissants are a decadent bourgeois luxury that will be first against the wall when the revolution comes anyway.\n\nA+ baked goods, A- people and dog-watching, B+ coffee, B- ambience.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-19", "description": "I really wanted to like this place, but I have to disagree with d'N'L m. who compared this bakery favorably with Bay Area locations like Tartine. I was really hoping to be blown away, but I was totally underwhelmed and somewhat disgusted by my experience. I stopped here at the end of 10-mile run and the ordering process was totally fine and they treated me well despite the fact I was wearing sweaty running attire.\n\nI ordered the well-praised chocolate croissant and a half loaf of the raisin walnut bread. The price for the half loaf, at $6.50, was kind of shocking. I walked to the subway and ate the croissant while I was waiting for the F train.\n\nThe croissant while gorgeous looking, though small, was just not that buttery or generally all that great. The chocolate filling was excellent. Tartine, Cafe Fanny, and Acme Bread in SF and Berkeley all have this place beat by a mile and Acme charges prices that are significantly more reasonable.\n\nDisturbingly, as I was about to discard the bag that had contained my croissant in the garbage, I felt something hard and dense in the bag when I crumpled it up. I found that there were two hunks of sausage in the bag. It appeared as if they had been removed from something and tossed in the bag to discard, but someone failed to throw out the bag. If I was a vegetarian or abided by certain religious dietary restrictions, this incident would have caused me significant distress. Mainly I was just weirded out and mildly disgusted.\n\nThe raisin walnut was great (excellent walnuts, great texture, good sourdough flavor), but at those prices I likely won't be coming back. \n\nA number of the danishes looked quite appealing as well, but my sausage incident makes leaves me wary of ever returning to this establishment.", "author": "Jonathan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "Yet another cute over-priced Cobble Hill coffee place that I would normally skip except, they have some seriously delicious pastries. The croissants are some of the freshest I have tasted yet and I hear their breads are unreal. Somehow I always walk out of this place with a beverage wondering how I managed to spend $5+ on it, but then I take a bite out of my chocolate filled croissant and forgive myself.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-10", "description": "Hairs (not hair, hairs!) in my croissant. I bought and almond croissant and their were two hairs in it. The girl behind the counter was equally horrified and refunded my money right away, which I apprciated. However when I heard her talking to one of the bakers, they acted like it was no big deal, or worse, that they were not surprise. \nThe place has no music, it's hot, and no bathroom and the coffee is pretty terrible. I would recommend any other place on Smith St.", "author": "Tiffany C."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}