{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "After being on an almond croissant quest for most of my life, I can truly say that Bien Cuit comes as close to a real French almond croissant as those you will find in France.  Having lived there for 3 years, they do a great job of mimicking the original.  Some of the other pastries I've tried weren't as memorable, but I'll definitely be back for more almond croissants!", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "Beautiful and delicious pastries! I love the toasted baguette with fresh tomatoes and quail eggs. Yum!", "author": "DJ T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "this place is pricey but its worth going for their pastries \ni recently had their poppy seed and artichoke with goat cheese croissants and they were set on right on my palate. honestly i hate goat cheese all kinds of them but that goat cheese with artichoke was balanced nicely. and the poppy seed it had the perfect sweetness. and their tarts are one of a kind (eat it once in a while it is expensive but definitely a GO!)\n\nBUT the reason i give them a 3 star is because of their artisan breads. the crust was just knackering! to bite into, and the taste wasn't that great either, oh and their coffee's and teas nope its really pricey for a cup that looks like it will only hold espresso shots \n\ni can understand why the pricey pastries because they use rare or real good quality ingredients like butter (which is expensive) unlike some pastry shops that use shortening(all trans fat and leaves that clay after mouth taste)", "author": "Soo Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "good coffee! it's always nice to see a bakery taking just as much care for their coffee as for their food. they also have more selection of smaller cookies which is good as I don't want to pay as much for lunch as I do a coffee and small snack.", "author": "Corey M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-31", "description": "Food is typical faux french bakery style. Coffee is super acidic and terrible. not worth the super high prices. Go to another french bakery with normal prices, you will be twice as satisfied. Someone needs to add another 2 dollar signs.", "author": "Bill R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "Came here for breakfast with four friends, Sunday morning 9:30 am. \nPros:\n- good pain-au-chocolat (good because of the quality of the pastry - so rare in NYC)\n- good atmosphere: plain and simple decor, lots of wood, *incredible sun in the morning*!  We were basking in it for almost an hour, sitting by the window.\n- interesting variety of baked goods, though I did not get to sample and some looked a little dubious\n- wasn't too hard to get a seat for five people, because most of the crowd is coming through to take out.  Good, spritely morning vibe.\n\nCons:\n- offensive price on the tea: $3.50 for a small tea.  What?  Jerks.\n- generally high prices, but on good baked goods I can forgive this\n- slow, weird service - they were just a little overwhelmed, and had a mechanical attitude, but it wasn't a real problem... \n- I didn't see plain croissants, which seems foolish, given how good the pain-au-chocolat was", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-21", "description": "I work at a coffee shop that serves Bien Cuit (9th Street Espresso, shameless plug), and I have to say, these baked goods are amazing!  The bread is perfectly crisp on the outside, chewy on the inside with a wonderful hint of sourdough, pair it with butter and live happily ever after.  Pecan/Blue Cheese and Cheddar/Cherry/Basil scones...need I say more?  Go get some!", "author": "Frace I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Their pain au chocolat are the best I've had, ever! Flaky, crispy, the right amount of chocolate. I only tried the pain au chocolat this time, but everything else looked delicious and top notch.", "author": "Linda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "I'm so happy that Bien Cuit opened up on Smith Street. It's a fantastic addition to the neighborhood, and you can see at a glance that baker Zachary Golper is a skilled artisan. If you read his bio, you'll see he has a fine pedigree as well in baking and pastry. But don't come in expecting lobster tails or many things you might find in other Brooklyn bakeries. The almond croissant or pain au chocolat are well worth the calories--they are extremely satisfying. I really enjoy the selection of breads, and that you can get half a loaf (it's just me and my husband so it's great not to potentially waste some wonderful bread because we don't eat it fast enough). But the last time I bought bread on a Saturday morning, the crust was nearly impossible to cut through for regular slices. I guess if I could just admit sometimes I want to serve the bread in slices and not hunks, is it blasphemy to want the place to have a slicer? But no matter, the breads are all wonderful from crust to crumb. Grab a sandwich for lunch and a tart for later and I'm sure the coffee's good, I just don't drink much so I don't know if this is good joe. I can't give this place 5 stars, only because the staff really doesn't put out a very friendly vibe. I don't know if I come in at the wrong times, or right after a really rude customer, but I hate feeling like I'm actually being inconvenient when I want to know what bread is which and when i say I'm deliberating between pastries so I need 30 more seconds. No one in my experience has been downright hostile, but the lack of friendliness and enthusiasm is clear. I just strongly believe customer service is important so I wish I could get to the bottom of that, because I'm really enthusiastic about the products here. The awards for this place thus far are well-deserved. If I could go intern in bread-making from Chef Golper, I would!", "author": "Cara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Tres Bien, Bien Cuit.  But...so overpriced!  You'd think they were FedExing the bread from Paris.  Regardless, a great place to get a baguette on a Sunday morning when you want to make brunch for a date who slept over.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "This place is adorable. Great coffee and the pastries are beautiful.", "author": "J S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "Sitting here now. The pastries are incredible. Shared one with my wife and ate way more than I was supposed to. There's something in them that is so addicting. My wife is glaring at me to keep my hands off her breakfast and to go get my own. I'm torn though because the prices are super high and even higher if you factor in portion size. My stars are based on value and for that I'll have to deduct a star. But if you're looking to treat yourself with an addicting experience try their pastries.", "author": "m l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-18", "description": "Generally the staff in this local bakery/coffee shop are very nice and the food tasty. However, for the price you pay, I would not expect to chew into a huge piece of white plastic wrap in the final bites of my pear danish. Just not OK.", "author": "Amanda Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-02", "description": "I was willing to overlook the condescending and uninterested staff so long as the bread was amazing.  And at $4 a baguette one would hope for truly amazing.  The bread, however, was so hard and dense that it verged on inedible (it went in the garbage can). I will not be returning, as you can get a delicious and edible loaf from Sahadi's on atlantic ave at half the price.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-11", "description": "Service was great, paying by an ipad made it better. But the huge cockroach crawling on the wall right next to where we sitting killed any chance this place had. Management came over immediately and took care of it, but the damage was done. Any establishment with a roach as big as my finger I will never go back to.", "author": "Sharaf M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "Awesome bread!  I bought three different breads yesterday and each was excellent.  And I happened to accidentally  walk in on Thursday when they are closed.  Well , the owner was so nice that he let me buy the bread anyway.  What a nice bonus, great bread and nice people who run the shop.", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Everything is fantastic here (just don't order coffee). The pastries and sandwiches are outstanding, and worth the indulgence. They have without question the best croissant I've had in any borough. One tip: lay eyes on the croissants before you order. Sometimes a batch will get burned, so ask for one of the fresher ones/ one of the ones in the case.", "author": "Nate O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Bien Cuit is only a block away from my home and it is the most amazing food thing to ever happen to me. I walked in one day when chocolate croissants had JUST come out of the oven. Now, I'm not a big pastry, croissant person AT ALL - in fact, I probably hadn't even had a croissant in 8 years up until that point. I just strolled in to get a coffee.  But the man told me I HAD to get one - they were piping hot and FRESH. Meh, I was hesitant and rolled my eyes with a 'whatev, pastries meh'. But he insisted ... so, I caved. Fine, whatev - I'll try it ... and HOLYOMG. It was one of the most magically, delicious things that has ever touched my tongue.  I now STALK that place, hoping to catch them - any pastries - right out of the oven! Their croissants are all light, flaky and about as close as you're going to get to any true Parisian pastry. I highly recommend the croissants, quiches and tartines ... you really can't go wrong with ANYTHING there.  Anthony Bourdain visited once upon a time - and that man KNOWS what's up.", "author": "Betty C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-24", "description": "This has the best croissant I've ever had in New York. Cost me 3.20. Perfect texture. Big! You can taste the work. Beautifully folded. Light airy crisp on the outside, beautifully buttery on the inside.", "author": "Del L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "i am so sad to be leaving cobble hill after living here for the past three years. bien cuit makes me glad that i was lucky enough to stay as long as i did, in order to quickly taste their fantastic pastries and baguette sandwiches, before i depart for the west coast....", "author": "jessica l."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}