{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-17", "description": "Sandwiches may look pretty here on yelp and Instagram but they suck balls. \nThe display for their sandwiches look like soviet era sparsely decorated medical supply cabinet. The sandwiches are pre-made taken out from the fridge below. You know what salmon does to bread and in the cold? Taking a bite out of my cold damp open sandwich that came from the morgue I knew it was a mistake coming here. Coffee was forgettable. I thought these boojie places know good beans, the right grind and the best water temp. I've had awesome coffee from Chinese bakeries with a C rating. If this place didn't have wifi for the hipsters to linger for hours I wouldn't know how they survive", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "The salmon tartine is aesthetically pleasing and tasted very good. The bread it was on was also delicious, but it had a tricky crust to tackle- prepare for the contents of your sandwich to fall off if your attempts at biting the crust get violent!  Overall, overpriced for an open-faced sandwich, so I don't think I'd grab lunch here often.\n\nThe coffee was great. A cappuccino is reasonably priced and well-executed.\n\nThere is ample seating and the overall feel is quite comfortable and, dare I say, \"rustic\"- great for coffee with a friend or a date.\n\nThe service is solid, and the pastries look amazing. High-end artisan bread is what this place does well, so I'm sure I'll be back and will adjust this review accordingly in the future.", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "Came here on one of our annual excursions into Brooklyn... sorry BK, too damn hard to get there more frequently...\n\nCame here after a day taking pictures at the waterfront and stopping by the Transit museum to look at old subway cars. We were in desperate need of a coffee and some sugar. Luckily, Bien Cuit was our next stop and we were ready to grab a seat and chill out.\n\nThe store smelled heavenly... I had to seriously hold back from ordering everything. We settled on a grape tart and both eclair varieties. They didn't feel heavy at all... maybe all that walking before worked up a nice appetite. The presentation was on point, fancy enough that you knew there was a lot of skill involved in making it, but not overly pretentious and covered in edible gold leaf.\n\nIt was a really pleasant experience and the staff were super cool and friendly as well. Exactly, the Brooklyn vibe I like.", "author": "Joe L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "TL;DR Little coffee shop with a great selection of fresh baked breads and pastries!\n\nSo while visiting some old friends in downtown Brooklyn I came across this unassuming coffee shop. It had the typical new Brooklyn aesthetic with lots of exposed wood, brick, and steel. \n\nIt had a decently long line with the usual commuter crowd, but I figured since I'm not in Brooklyn often, to grab a bunch of stuff and figure out what I really liked later. I got an americano, a champagne loaf (spoiler alert: the loaf was sour and tangy like a whole wheat sourdough), a pear eclair, and chocolate and orange eclair, and some cookies.\n\nThe coffee was excellent, the eclairs were ok, but both the bread and the cookies were the stars! Bread is definitely their \"thing\" as they proudly had like 10 different loaves on display that were baked in house. \n\nI wouldn't necessarily travel out of my way, but would definitely stop by if I'm in the area again!", "author": "Hector V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "I bought a few demi-baguette at the grand central location and as I walked towards my track I noticed something.  They were hard as rocks - like so hard I couldn't squeeze them. I barely broke an end off. If you saw someone hitting a demi-baguette against a marble column,   that was me. Like primitive man, I was using the tools around me to tenderize my food. I needed to make sandwiches and this bread would have broken my wife's teeth. Figuring it was a mistake, I brought the rolls back and recreated my parlor trick on the counter. The bread was intact but the counter might have cracked.\n\nThe sales associate  wasn't amused.  I don't blame her. I was a dick but she was totally professional and informed me that that was the way the bread is supposed to be and offered me ciabatta instead. 5 stars for the sales associate and 1 for this particular bread! I have purchased other items here but I do not recommend demi-baguette unless you're dipping it into soup.", "author": "Thomad M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "My fiancée and I happened upon this place as we strolling down smith street. It has a very nondescript entrance. \n\nFood: I had the goat cheese and artichoke croissant and my fiancée had the eclair. They were both quite delicious, something that is definitely try again. To drink I had the iced black tea and my fiancée had the summer spritzer. Drinks were as expected\n\nService: service was okay, not very friendly or chatty but they got the job done. I'd give them a three star on the service. \n\nAmbience : it's a nice cozy space with a lot of two people seating. A nice place for a date.\n\nI'd visit the place again to try something else on their menu.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-11", "description": "This place was hip just to be hip. Overpriced watery coffee, iced tea that was just iced tea, and an atmosphere that screamed Urban Outfitters and ironic mustaches. \n\nPass on this one unless you are trying to impress someone who is very visual and whose taste buds are ambivalent. Mia's cafe nearby had better coffee and a nice patio out back that made for a romantic and intimate setting. \n\nI will say that they had run out of coffee and had to make us a fresh batch -- so maybe it hadn't steeped as long as necessary, or perhaps they were rushing. Either way, I'm moving onward and upward.", "author": "Katie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-11", "description": "Absolutely awful baguettes and croissants. I took the subway for an hour just to go try them since there were such great reviews, but this place turned out to be a complete disappointment. Rocks are softer than the baguette I purchased. The pain au chocolat was more like a dry croissant with some cocoa powder messily shoved in the folds. Price is expensive, though standard for Brooklyn. Still, complete rip-off. Rather than charging $3 for a pain au chocolat, they should pay people $3 to eat one. Should change the store name to immangeable.", "author": "Tiffany G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "I'm partial to chocolate croissants, but I was so intrigued by the delectable mound of salted chocolate buckwheat cookie. It is a dark chocolate truffle cookie - melt in your mouth - experience. I totally recommend it with a cup of cafe au lait, which is light, more milk than coffee. Lovely.", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-09", "description": "Totally agree with another customer's view on their bread and pastries - borderline burned. Cannot look their croissants  ---- feeling they just ruin it with that overkilled baked brown color........................... other breads look do dry and over baked, too.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Their almond croissant (4 1/2 bucks) looked a bit too dark for my liking but oh boy it tasted so delicious. Perfectly flaky with the right amount of almond paste. Like another review mentioned, it is not at all oily. Their Joe's brew coffee is not much to talk about though. A bit too acidic for me. I also had their ham sandwich. Even though it was small and expensive (seven fif ty in 9/2016) it was everything else I wanted. Something else that works for this place is their backyard patio setting, where you could sit and chill, while surfing on their free wifi or watching little birdies visiting their garden.", "author": "Thuy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "With so many good bakeries in NY, it's really hard to get to them all. This was a bakery that was recommended by a friend, so it moved up in my bakery \"to try\" list.\n\nHad the Chocolate Almond Croissant $5 and Quiche Lorraine $7.50, with some Coffee $3.00 to wash it down.\n\nBoth the Croissant and Quiche were fresh, tasty, and flaky. However the portions are pretty small.\n\nBesides the sweets, they also had a lot of bread options that looked and smelled good.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "We stopped by this place because it looked really pretty from outside.  Inside has he counter with some tables for people to sit, but the aroma around the place was very good.\n\nWe ordered an iced latte with chocolate chai pastry.  Even though pastry wasn't as soft as he other one I tried right next to it, it had full of flavor and the balance between chocolate and chai was well executed.  As for the coffee, my wife, my personal coffee expert, said it tasted really good and \n\nAnother nice place that gave us the good impression to us about Brooklyn.", "author": "Jay I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "By far the best bread you can buy in the hood, consistently good, good choice of different breads.  I shop  there at least twice a week. Always friendly service too.  Today which is 11. 10.2018 at 6:24 pm I walked in to buy a couple of buns and a loaf, there was one person behind the counter, he acknowledged my coming in by giving me a look and then returning to reading something on the back counter, I waited a minute and asked if I could still buy , he turned around nodded and went back to reading whatever he was reading, essentially dissing me in the worst way, I gave it another minute and then walked out realizing that he wouldnt give a s... about me.  Hopefully BC is going to take a better care of basic customer service, not asking for much just sell what you have and don't play hard to catch games.", "author": "T K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "I'm really into the idea of this place, but didn't find the service to be very pleasant or helpful. I ordered a cold brew and a feta and kale danish. The coffee was great and the danish looked beautiful. That being said, I took a bite and it had clearly been pulled out of the fridge, so it didn't have a very good texture and I wish it were either at room temp or that they would have offered to head it up. \n\nI'll definitely come back to try the breads and other pastries, but think there is some room for improvement on service.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "Been here a few times. Even though the pastries are baked fresh daily, they don't actually taste that fresh. Not sure why, maybe it's the humidity control, but the croissants are the slightest bit stale. Also, the chocolate one has very unevenly distributed chocolate. Runner \u0026 Stone's pastries are far better.\n\nAlso, they have rotating coffee beans. However, the last time I went, I asked for a coffee, and they said they don't do brewed coffee anymore despite it being on their chalkboard menu (not sure if they meant they were out for that day? that week? forever? It was only 2pm so who knows...). Ended up getting an Americano (which is also unhelpfully not listed on the menu as an option, even though the barista said it's a common alternative to the brewed coffee). Just confusing overall.\n\nThe space itself is cute though.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "What could be more rejuvenating in a cool autumn evening than a latte made with actual pumpkin?! Pumpkin-spice fanatics, this place is a must try. The latte is made with a purée of pumpkin, molasses, honey, and pumpkin pie seasonings. It adds a surprisingly delicate pumpkin spice flavor and gives the latte a smooth, creamy texture. The slightly nutty flavor of the almond milk makes this a delicious treat. You definitely pay for what you get ($4.50 for 12oz). I had a French almond cookie along with the latte- thin, crispy, buttery, and nutty. Just teetering on the edge of crispy and overdone. \n\nThe space itself is very large, with an industrial yet natural feel. The wifi is good, and the staff don't seem to mind the company. There are plenty of other goodies on the menu, but they seem to specialize in breads. I noticed wine on the menu as well.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Cute cafe in Brooklyn with an assortment of bread baked on site.\n\nCame here on a Saturday afternoon to study with my friend and bumped into another one who lives in the area. He frequents this cafe and usually buys a loaf of bread a week. \n\nWalking in there are 4 tables for two (or one if you're working with a laptop) by the window and 4 more lined against the brick wall opposite the bread/cashier. They also have patio seating in the back but it was chillier than we thought for a summer day so we didn't sit out there.\n\nI got a soy latte and it was good. My friend got a coffee and a pan au chocolate - no complaints. They also have some cute desserts that I didn't try but they looked good!\n\nI would come back to study.\n\n*wifi \u0026 outlets\n*clean bathroom", "author": "Connie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I like this place! The coffee was nice, the place was nice, the macaron cake we got was nice... Everything nice!\n\nI didn't think that macaroon peach cake could be nice but I was wrong. It's a refreshing and yummy cake. The macaroon part was some stone hard but that was still ok. We wanted to get an eclair too but they seemed very old not not fresh. Next time maybe!", "author": "Dilek T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Great place to stop in for a cup of coffee and pastries during an afternoon break. They specialize in really delicious bread.\n\nHighly recommend their iced latte with almond milk, pistachio eclairs, and raisin croissant.\n\nFor such an awesome place, I loved how unpretentious and low key it was.", "author": "Vicky L."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}