{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-31", "description": "I ventured in here the other day after the gym. As I walked in, the heavenly smell of sugar enveloped me. Yum! This is a cute little place with a few tables in the front by the window and more along the counter. You can see treats and sweets coming out of the oven and into the display.\n\nNot feeling the savory items that were there, I ordered a cappuccino and an almond/chocolate croissant. (Kind of a pan au chocolat meets almond croissant!), it was good, although one corner was ever so slightly burnt. After a few minutes I realized that they had forgotten my cappuccino and had to ask for it again. It was quickly delivered but definitely was a let down, as the espresso didn't shine through as I wanted it to...\n\nThe reason it gets a 3 and not a 4 is that they forgot my drink and the woman who took my order made me feel like I was somehow imposing on her by ordering and it seems just a smidge pricier than other bakeries  who have similar offerings. (Maybe that's not true?)\n\nIn any case, I think I'll come back because they do have some lovely pastries and breads available.", "author": "Vee V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-30", "description": "I tried to drink the worst cortado that I've ever had. I couldn't finish it. It's possible that the tall guy who made it doesn't know what a cortado is. There was almost no milk in it, but just a little so that you got this kind of burnt coffee milk flavor. Essentially like bad espresso with a tiny bit of bubbly milk in it. I had a nice cortado the other day at Ground Support, served in a glass, right amount of milk, not bitter, etc. If that cortado is an A, this cortado is a D-. Like you could drink it if you really needed it, but mostly you shouldn't.\n\nI should add that the other drink we ordered, a small chai, was not really a chai at all. In a way similar to the cortado, it was so awful that it suggested the person who made it has no idea what a chai latte is, or simply doesn't care. It was a small portion of steamed milk, which tasted faintly like chai tea. Also the kind of thing that you could try to drink, or consume, if you needed to, but that you wouldn't if you didn't have to, or where you feel like you should since you just paid for it. s", "author": "James H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-08", "description": "Hands down best bread in NYC! I am from a tiny village in southern Spain where bread is still baked in the same bakery as it was over 600 years ago. This is the real deal!  I always take a loaf with me when visiting friends or to social gatherings and people are stunned when they try it.", "author": "Tonino S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "Not usually a big baguette person but the demi baguette here was delicious! As good as the ones I had in Paris. Will definitely be back to try their famous croissants!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-02", "description": "Coffee - excellent. Breads - delicious. Pastries (esp choc croissant) - stellar. \nFive stars, except for I deducted two for the condescending, douche-bag-y counter service.  \nAmazing baked goods are one things, but unfriendly service leaves a bad taste that even the best chocolate croissant can't fix.", "author": "Ab U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "OK, OK, it's pretty darn good. I had some kind of pear apple tart, and it was divine. Glad I am not too close to here. I can't be trusted.", "author": "Brigita J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "Great selection of pastry, a bit over priced though; such as the $9 mini tart (yes, tiny mini tart). Calm environment to enjoy a cup of tea/coffee, would recommend it.", "author": "Pj S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "This place may have the best croissants in the City, and I'm no slouch to the pastry arts. Awesome texture, beautifully creamy crumb, and you can easily taste the quality of the butter.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "5 stars for quality of the pastries.  3 stars for the prices.  I had an almond croissant (absolutely amazing) and a large drip coffee for nearly $8.00.  That's too expensive for me to go there regularly though I will go back occasionally for a weekend treat so I can try the other pastries.\n\nThe servers were very nice and helpful and I liked the atmosphere, though I dislike the free wifi concept b/c people just park themselves there.  No seats available at 9:30 am on a Sunday.", "author": "S M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-16", "description": "As croissants go, Bien Cuit is as good as it gets. They make croissants that are very much like the croissants you get in France and they've been a staple part of my diet on rushed mornings for a while.  I just don't like Croissants from other places as much now - they seem too cakey or greasy and don't have the same flakiness.\n\nThey can be a bit understaffed at peak times like Saturdays and it's a little pricey too but that's NY, I guess.\n\nI recommend the almond, chocolate, chocolate almond, and regular croissants.", "author": "Dave F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-15", "description": "People have their sins. Some people love chocolate, some adore ice cream, some love bacon. I am a fan of bread and this bakery does it well. It's true that they have good pastries and maybe they have good coffee (don't really drink coffee) but the bread is where it's at. OH and don't ask what a good sandwich bread there is. If you're looking for sandwich bread, you're barking up the wrong tree.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "Delicious iced tea and cookie, but the entire experience was made ever more enjoyable due to the smile and kind service behind the counter.  The young man working today was solicitous and friendly--unfortunately a rarity in this neck of the woods.  Also, a good place to escape the stroller crowd, and free Wifi to get some work done.  I sat near the window for several blissful hours.  \nCan't wait to return!", "author": "Kat M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "Fantastic pastries!  Friendly service and they make great coffee! Nice place to sit, sip some coffee and enjoy a relaxing Sunday.", "author": "Syddie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "I have been back many times since my initial review and the issues have been corrected. I have not had a bad experience at Bien Cuit since.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "I went here for breakfast for my mom's birthday and I cannot say that we were anything more than disappointed. We love the bread, croissants and tarts that they serve. As the daughter of someone who is French, I love spoiling her with French baked goods. \n\nThe bad experience started right as we said \"hello\" to the barista. The man was completely miserable. When we started placing our order he immediately snapped and said that they didn't have three of the four things we first ordered. \"We don't have lemon, we don't have English breakfast tea, and I need to spend 5 minutes making the earl grey tea\". As my father looked around in shock, we realized there were two boxes of English breakfast tea, displayed on the counter and he asked the sassy barista why he couldn't just use tea from those boxes. After two minutes of him arguing and saying he wouldn't use a tea from those boxes he aggressively grabbed it from my dad's hand and snapped. Unfortunately the disappointing service didn't end there. I placed an order for a cappuccino and asked what milk they had, since I am lactose intolerant. He looked at me in disgust, and starting reluctantly listing the types of milks they served. Once he was done taking my order he went back to my father and asked him if he really wanted to wait five minutes for the tea, let's me honest- no tea takes five minutes to make. As my father said yes he miserably went on to making our order. \n\nWe love the food Bien Cuit offers, yet I have to say, every single time I go there, the service only disappoints me, ruins my experience and completely makes my morning sour. The service has to change.", "author": "Margaux S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Need to give them 5 stars for their bread. Got a loaf of bread and it's exactly what I would expect from a Paris boulangerie ... crusty on the outside, shewy on the inside, with a levening taste. Perfect bread. The pain au chocolat and croissant was flaky, buttery but not oily, will go back for that too!\n\nThe rest, I don't want to rate as the bread \u0026 croissant make it for me.", "author": "Sarjevane Own Opinion O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Love that place! super friendly staff, amazing sandwiches and pastries. I wish I could spend more time there!", "author": "Lior S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "I love the filling in the almond croissants. However, I find the croissants themselves to be somewhat meh. The reviews from people who are reminded of Paris always confuse me. I've never had such a well-done (bien cuit!) croissant in Paris. I find that the slightly burnt nature of the croissant really takes away from it. I realize that this is part of the appeal, it just has never really spoken to my soul. The savory options are interesting and good. The whole operation is a touch overprice and I find the service to be exceptionally hit or miss. There are a plethora of other coffee shops nearby where the service is reliably nice, including Konditori and Blue Bottle, which are mere steps away. Good place to do work or meet a friend if you can get a small table.", "author": "Meghan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "Although seemingly expensive, but if you consider the quality, it is well worth it. This place is unique for its taste and craftsmanship. One does not need to be an expert, just try a few more bakeries in Brooklyn to know the difference. \n\nMy particular favorite is MIche bread. I cannot pass on their pineapple tarts and chocolate croissants.\n\nThe people who work there are friendly efficient and knowledgeable. \n\nI am so glad there is a place tike that in our neighborhood, where we can stop by in the morning before I take my son to school.", "author": "Boris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-16", "description": "Love this place. Don't listen to Edwin M. -- if you look at his profile, the only places he gives 5 stars to are Konditori. Must be a part owner of Konditori or something. He \"just moved to the neighborhood a week ago\". Hm....Konditori just opened a week ago. interesting. \n\nAnyway, this is my go-to coffee and snack joint at work. It is expensive, yes, but you definitely get what you pay for. Pastries and sandwiches are absolutely delicious (took me a couple visits to figure this out, but if the display looks empty, it's because they keep pastries in the cooling racks and just the display is just for...display) and coffee is excellent. The staff is always friendly, if a little hipster-y. The atmosphere is warm and there is always a place to sit. Granted, I only go between 9 and 6 on weekdays, so I can't speak for the weekend crowd.", "author": "Zainab A."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}