{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-01", "description": "I was so excited about coming here. After confusedly looking at the options, I ended up choosing the roasted grape danish (as recommended by the nice barista) and a coffee to go along with it. Meh, meh, MEH.\n\nBorderline stale pastry, weird grapes (I guess that's what roasted grapes taste like) and unexciting coffee.", "author": "Tara T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "It just keeps getting better folks.  If you DONT live across the water, and need an excuse to come across the bridge(s) do it for Bien Cuit.  Not that they need the press, but what Zachary and Kate are doing over there is nothing short of Paris style baking in Brooklyn.  There is NOTHING i mean NOTHING that is not expertly prepared and lovingly produced.  Whether you stop to get a baguette for your lunch or dinner or a almondine with your coffee, you will not be disappointed.", "author": "Tim W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "Just popped in today because I heard they had opened. I ordered a latte and asked for a recommendation on a pastry because they all looked so delicious. The girl behind the counter was really sweet (she even made a flower design in my latte) and suggested several of her favorite things. I got the muenster and raspberry pastry and it was so yummy. A perfect combo of savory and sweet and baked just right. She said they even visited the farm where the raspberries came from.\n\nLoved my first experience. I'll be back for sure.\n\n+Bonus: They have free wifi!", "author": "Amber R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "Probably the best bakery in Brooklyn.\n\nThe first time, I stopped by for a half-sandwich while running errands in the hood. Bf only got a mocha. His coffee was yummy, but nowhere near as yummy as my sandwich. I had the roast beef. It was perfectly composed, fresh ingredients, delicious relish, yada yada. But THE BREAD. Amazing crumb and just the right amount of crunch.\n\nStopped by for the second time this Sunday to pick up a baguette. Only $4 and the best baguette I've had in years. They hand it to you warm. The smell is intoxicating. It took all my self-control to bring it home in one piece.", "author": "Marisa D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-26", "description": "Bien Cuit has a lovely atmosphere, however the drink and cookie I tried were not quite up to expectations.\n\nOn a sweltering day, I stopped in for a cold drink. I ordered the mango fruit drink with black pepper. Interesting combo, but the mango was overwhelmingly sweet- straight up puree. I ended up adding some water from the free pitcher, which helped. But the black pepper was also too piquant. I love me some black pepper on food, but it hurt my throat drinking it! \n\nThe shortbread cookie was a bit burned on the bottom. Otherwise a good attempt.", "author": "Dee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "Excellent breads and pastries, quality sandwiches, friendly staff.\n\nWriter-types, be advised: Bien Cuit exhibits those rare-for-Brooklyn traits: (1) air conditioning, (2) wifi, (3) available seating, and (4) good food and coffee.\n\nThe coffee isn't top-quality - if you want Stumptown, you'll need to walk another block or two.  But if you're part of the nomadic writerly tribe, constantly trying to find a pleasant spot where you can stare in frustration at your laptop while sipping on something caffeinated, then Bien Cuit is a godsend.\n\nThe loaves of bread are pricey but excellent (baked on site). I had the sunflower seed loaf over the weekend and was thrilled with it.", "author": "Dave K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "Since it's opened I've had a regular croissant, ham and brie croissant (twice - I'm a sucker for this...) and today had a ham/turkey/bacon sandwich for lunch. I've also had a baguette which I used for a sandwich (I've had a lot of time to plan my meals - the bar exam is right around the corner!)\n\nAll of the food was great, the staff is super friendly and attentive - and there are just so many different, freshly baked goods here you can't help but want to sit down and take it all in.  Definitely worth checking out if you're around the neighborhood!", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "I was extremely excited to have another great addition to Smith street and am even more thrilled that its on the north end of the street as most of the better bars/restaurants tend to be towards the south end near Carrol Gardens. \n\nBien Cuit is a little cafe with a small offering that is done well. I've purchased their basic baguette as well as a few pasties including their flatbread savory tart which was to die for. \n\nA welcomed addition to the neighborhood.", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "On the hunt for Paper at Paper Source, I walked passed this cute little front with a sign that said bakery and put it on my mental list of places to try. Little did I know that I would be walking into it a mere 20 minutes later with some time to spare before having to dash off. \n\nI walked in and immediately loved the space. The open layout, the seat at the window with a pillow so people can plop down. I loved that the bakery space is in the far back, but you can see what they're doing. I also loved the way their goods are displayed-sparse, but plenty.  It also helped that the girl behind the counter immediately offered help and I was sold immediately. I ordered the salami baguette which has mustard and mini-pickled cucumbers on it.  The baguette was awesome, too! It was brown and not too hard to bite into. The salami, mustard and pickles just added to the lightness and crunch.  As I told the woman behind the counter, \"because presentation is everything,\" I'll try that. The sandwich has ribbon wrapped around it. Maybe a bit on the girlie side for the men of Brooklyn, but so worth picking up! It is perfect and spot-on for someone who is hungry, but not starving.  \n\nI also ordered an Americano which was really good and their mango mint lemonade that had pulp in it and was delicious. I could tell that the mango wasn't ripe, but I don't blame them at all, fruit is fruit and ripens on it's own schedule after all. Either way, I'd order it again and again and again. It was the perfect drink for yesterday's muggy day. \n\nI really enjoyed the atmosphere and can't wait to actually sit a bit longer there and maybe do some writing. Great addition to Smith Street!", "author": "Sara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Had an amazing croissant filled with goat cheese and artichoke. Very good espresso as well", "author": "Kathryn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "A wonderful edition to the neighborhood for the past several years, building their success on the shoulders of their world class, fresh baked croissants, breads, and pastries. I don't go out of my way to post reviews on yelp, but a recent negative review drew my attention. Someone lied about Bien Cuit's croissants, making negative, false claims.  If you want genuine reviews of their food you can look to the top culinary magazines in the nation. Their croissants and baguettes are unparalleled!", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "Good bread and very good (if not exceptional) croissants but really overpriced-there are equally good and more reasonable alternatives.", "author": "George W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-20", "description": "Everybody knows bread is raw toast (even when it's expensive and hyped raw toast). \nI spotted the rustic sign hanging above Bien Cuit and entered to a distinct wheat scent, greated by a nice dude and not-so-nice prices. I'm the first to admit I've never been fond of french pastry; it's probably just too subtle (read: nuanced*) for me. Feeling as adventurous as this kind of venture can make you feel, I went for the hazelnut bostock for $4.08 (\"A bostock has been described as a syrup-soaked, frangipane-topped, crispy-edged brioche that's an ode to breakfast glory\"). While this item was certainly beautifully crafted and well-constructed AND structurally sound, it didn't hit me over the head (even if it shouldn't have, I wanted it to, and I'm the customer, so shove it) and didn't pack much in the way of distinct flavor, hazelnut or otherwise. *They almost taste too healthy in the way that it's not advantageous for something you know isn't nutritious to taste.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "Their almond croissant is amazing. It's so flaky and crispy. I don't live here and came for a croissant a year ago, and it's still the best I've ever had outside of Europe (and can compete with those in Europe as well!) and I still think about it. I stopped by today to get another taste of this deliciousness, but apparently you have to come in before 10 if you want an almond croissant.\n\nThe pain au chocolat is not bad, but not quite the stuff dreams are made of.\n\nFriendly baristas, nice environment, free wifi. Not a bad place to get some work done, but power outlets are scarce.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-07", "description": "I'm not a coffee shop human resources expert but if a customer says good morning at 7:15AM (today) the lady with the 19th century spinster's tight lip ought to say good morning back, not silently dare you to place an order by cocking her head and impatiently waiting for the transaction to end. Might I suggest selling pizza in Indiana instead of silently judging the clientele? OK, so you're a wreck and not living your best life yet. I'm happy to gift a subscription to O magazine so you'll start living your best life too! Only, I doubt you'll be working there much longer. PS - I enjoyed the espresso and friendly service at Blue Bottle across the street at 7:16AM.", "author": "Thomas R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-02", "description": "pricey and trop cuit - do not really appreciate the attitude either! Relax dudes :-)", "author": "Calliope C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Bien Cuit is my favorite place I go to when I want to treat myself with an excellent tebirke (poppy seed and almond paste pastry) and a cortado. In fact, I get excited when I see Bien Cuit's pastries being sold in other coffee shops because that means I don't have to make it over to Smith Street to enjoy their fantastic pastries!", "author": "Charita P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "this place is very expensive. no getting around that. but this is one of only a handful of places in NYC where you can get a real croissant, that tastes like a Parisian croissant. I truly miss  the months spent in Paris where there was an average of one bakery per block and most of them were orders of magnitude better than almost all French bakeries here. And the croissant would cost a euro. But I digress. We are in NYC. And NYC, a good croissant will cost you at least $3. However, I have also paid $3 and gotten crap. The plain croissants, chocolate croissants, almond croissants, and an apple thing whose name I forget were all delicious . Also, the almond croissant was so rich and full of almonds that I was stuffed upon finishing it, which makes the high price tag more palatable. I haven't tried the bread.", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-30", "description": "Had a coffee and an apple danish - both pretty good to my taste. Staff are nice, really cool that they have an open layout kitchen and everything seemed fresh. It was freezing inside though.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "Great produce but bad service and no restroom! Is that even legal? The croissant was amazing, the pain au chocolat great and the lemonade they have is pretty damn good. I just don't get why they are rude...is not that they have to interact that much!", "author": "Paloma D."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}