{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-12", "description": "Don't really get what's the hype about this place. We had the Tebirke, a sort of puff-pastry croissant topped with a generous coating of poppy seeds and filled with a marzipan paste. The puff pastry was not flaky at all and very dense. Go to Eric Kayser instead and you'll get to know real puff pastry.", "author": "Grumeau .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "The baked goods are excellent but whether at the farmers market or the store on Smith Street the employees-- well, not the most welcoming collection of souls I've ever met.  But, if you grab something up front and take it to the garden out back you will be fully carb loaded for the day to come.", "author": "Beth P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-15", "description": "The place looks nice and the espresso was just right - I'll definitely come back. Croissant sandwiches looked promising!\n\nService was a bit snooty - your run of the mill Brooklyn hipster attitude for no reason when I asked a question... from the bearded, plaid wearing dudes. No service with a smile here.", "author": "Aya G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "This is my favorite croissant in the city - possibly second to croissants at Petrossian, but definitely more convenient location and a lot of coffee shops feature B.C.'s pastries so that's a definite plus.\n\nThis bakery is a must try if you are into bread and pastries!", "author": "Avery W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "The most awesome, flaky croissants around!  There are other breads and sandwhiches.  there is dining space and an outdoor garden to have your treat and with a cup of tea or Joe.", "author": "Winnie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-21", "description": "This is like having a really unhealthy relationship with someone who is rich and likes to spoil you once in a blue moon but otherwise treats you like crap because they know you'd just crawl back for more.\n\nFor the life of me, I cannot understand the business model of making a small batch of food that regularly sells out early in the day and turning away customers from coming back.  The service is horrendous - rude, apathetic, sullen. I've been passed over several times for the next in line for someone who's a regular. I am not that transparent, I assure you. \n\nWhen they do have food available though, it is pretty spot on - the croissants are very good - not the best for me - but they hit the spot. But the Tebirke is why I keep crawling back - holy mother of food that is some good stuff! Another favorite is the goat cheese and artichoke croissant - although the dough to filling ratio is sadly like 85 to 15 - not what one would hope for. Coffee is really good here as well.\n\nThe breads are ok - but really overpriced for what you get. Actually the food here is expensive, period, more so than the majority of places in the city.  I'd rather go to Amy's Bread for the dough.", "author": "Na-Ne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Sunday am at 10 and this place is full, with people coming in non stop. With this in mind, it's hard to say I'm surprised that their goods are ridicoulously delicious. \n\nOk fine, it's also ridicoulously expensive $4 for a Danish(oh man what a treat tho that huckleberry) but eyyy you get what u pay for. If you are a entemans type, stick to it.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-08", "description": "There has been so much buzz about this, so finally when I was in the area, I made it a point to stop in.  Perhaps I have become immune to these cutesy-hipster stops, but this place did nothing for my senses. \n\nI was in the mood for an iced coffee, but they couldn't do it. Said the ice maker was broken. Yea right. They didn't have an ice maker. Duh. \n\nThe lady at the counter was a bit haughty, which irked me to no end. Listen lady, you need me more than I need you. In any case, I had a pretty forgettable chai and the financier cake was just OK. I guess I am not a big fan chocolate raspberry ganache. \n\nEpic hipster coffee bar fail.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "The pastries and cakes here are truly delicious. They put a lot of effort and thought into their baking.\n\nThe vibe is nice and quiet - a few people having conversations, and a few people solo writing or reading. \n\nThank you for the lovely pastries, Bien Cuit!", "author": "Fatima S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-28", "description": "Bien Cuit, is a French owned bakery specializing in French pastries. It is strongly advised to go there in the early morning when their baked goods are warm and tasty, and when their coffee is fresh. It is best to go there on a weekday as opposed the weekend due to the throng of opinionated hipsters who seem to crowd the place on weekends. \nThe quality of the ham in their gruyere and ham croissant is fabulous. It is soft, chunky and smokey. The croissant shell is too flaky and dry; it is not the fluffy golden colored croissant, but rather a brown over cooked shell. It is a pity because the fillings are definitely super. \nThe coffee is okay. I wouldn't recommend their iced coffee and it seems to be watered down and bitter. \nDo try their almond cookies: they are friable and \"adult\" sweet. Their almond cookies and a class of hot coffee, for instance make for a golden \"break-after-studying\".", "author": "Dullua C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "***Almond Croissant Review Only***\n\nReturning from a recent trip to Brazil, I was graced with a 12 hour layover a la JFK. Scrounging up the warmest clothes I brought with me (jean jacket and thick-ish leggings), I took the MTA into Brooklyn, ignoring the Delta agent's recommendation \"...go to Manhattan... (you poor Yankee doodle fool)...\"\n\nAs I got out of the metro all pumped with visions of East Coast hipsters, I passed only sad face homeless people shivering in the cold and the occasional scary man. Ducked into a Starbucks for some free electricity to calculate my next move: an almond croissant at Bien Cuit.\n\nNow, this croissant is twice baked with brandy, hence the extra brown exterior. Upon breaking through the easy-to-shatter exterior, the interior reviles air and buttery-ness. The almond filling is dense as it is generous, with a modest amount of sweetness that allowed for appreciation of the almond flavor. I am warm again!\n\nBien Cuit's almond croissant is the real deal. They do it right. Go Brooklyn!", "author": "Anna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "I love the Miche sourdough loaf here.  Too bad they're always out of it! Message to boneheaded baker: if your customers are seeking a product, and you are always out of it: bake more, hellloooo", "author": "Rafael R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-04", "description": "Terrific bread, lovely chocolate croissant, great apple galette, incredibly dry and blah poppy seed croissant. The star deduction is two-fold: a rather hum drum selection, some rather overcooked looking almond-chocolate croissants (which we would have tried had they not clearly been burnt) and holy hannah, would you look at those prices! I'm not usually one to balk at the price of a good pastry as I know how much work goes into them, but $28 for a 6 inch diameter tart that's about 1 inch in height? You have to be joking.  I was appalled.  Or how about $8 for a teeny-tiny version of that same tart. Ludicrous. I know the rent must be sky high, but truly, this was beyond the pale.\n\nThis will not be a regular go to bakery, both due to lack of great variety and the astronomical prices...if I couldn't bake decent bread myself, though, their artisanal loaves are truly terrific.  Willing for fork over $13 for some seriously great bread? This is the place to do it.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-02", "description": "Unfriendly and overpriced. Coffee is okay. Food is quite nice though. We had a avocado tartine and a croissant which was both nice.", "author": "Antonia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "SO GOOD. We got a few goat cheese tarts and croissants to eat there and they were so good that we got a few things to go include pain de chocolate and croissants. I heated them up for breakfast the rest of the week.... did not regret that decision. :-)", "author": "Brittany K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "Britney Spears was here!!!!!!  okay on to the Pro's\n\nPlease go in and have an almond croissant.  if you can make in time before they sell out.. I slipped in on a rainy afternoon!  Service was quick and sweet!!  Free Wifi!  I love Brooklyn's little surprises....", "author": "Sovi P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-23", "description": "I wanted to love this place (what caffeine and carb addict wouldn't). They've definitely got the croissant thing going for them, and the shop is cozy and fairly quiet. \n\nI can't offer a rave review of the coffee; it was good, though not great. I was even less enthused by my server. After sitting and drinking two mugs of tea I asked where their restroom was located (figured ample seating and food service equaled facilities). The server/cashier looked at me funny, shrugged, and the following exchange ensued:\n\nDude: \"We don't have a restroom....but you can hop down the street to the one at Starbucks.\" \nMe: (laughing, thinking he's joking...did he just say \"hop\") \"Are you serious?\"\nDude: \"Yeah, we just send people down to their restroom. They're cool with it.\"\nMe: (in disbelief) \"Uh, okay...\"\n\nLook, if you're going to market your shop to a more upscale crowd (with upscale pricing), then at least have the decency to open your facilities to paying customers. It looks cheap when you send paying folks down the street to use the facilities at Starbucks.  \n\nIf you're in a bind for bread and can stand the prices and possibly surly attitude from some of the staff, then grab a croissant or the like...to go.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "The best croissants in America. Hands down.  \n\nGreat options for savory treats and delicious pain au chocolat and croissants. Check it out if you can!", "author": "Brianne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Hard to find because there is not a big sign. But wow !! This place is awesome. Food , coffee and hot chocolate are great. You will not be disappointed.", "author": "Joel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-03", "description": "I made the mistake of ordering the white fish bagel, it had hardly any whitefish salad and the bagel was tasteless and old refrigerator tasting. It was $8 ahhhh. The pastries looked good and the environment nice.", "author": "A V."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}