{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "A friend and I came here to get some work done and it was a good spot. Speedy internet which was a huge plus for what we were doing. Great coffee! Nice people behind the counter who cared about their customers. Their pastries/sandwiches looked tasty, but I can't personally attest as I have yet to try them! All in all it's a great local coffee spot.", "author": "Tora T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "So I went to Bien Cuit this morning to get some breakfast. I had a pain au chocolat and an almond croissant! It was delicious ,the pain au chocolat was my favourite, flaky, buttery and still a bit warm. The almond croissant was really good but I had better. Overall I like this place and will definitely be back!", "author": "French L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-07", "description": "This place is great although the bread is a bit overcooked at times. Having said that the fresh pastries and wonderful bread brings me back home in Europe. Wonderful! HOWEVER, the staff have an attitude. When you're paying or ordering it comes across as if you 'owe them something'. Smile, be friendly and courteous to your customers. They don't need to act 'wannabe French with attitude'! You're making a great product, and please keep doing it with friendliness, that is what distinguished American service from European service!", "author": "AT F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-28", "description": "Horrendous prices. Lukewarm 'hot' chocolate that cools within minutes. Pastries with a gummy, rubbery supermarket texture rather than delicious buttery flakiness one expects from quality croissants (e.g. Balthazar, Patisserie Claude, Ceci-Cela).\n\nBut I kinda liked Bien Cuit anyway and will try it again. \n\nThe cafe is light with a big window facing Smith Street. There are only about seven 2-person tables so it feels spacious. The staff tried hard to be welcoming and friendly. The goods are displayed appetizingly. \n\nThe warm white chocolate with orange blossom drink was tasty, but stay away if you associate that fragrance with grandmotherly toiletries. In addition to a standard hot chocolate there is also a vegan/bourbon option. \n\nI won't buy their tarts again due to the price. The crisp dry cookie shell may be traditional but it's bland. My tart then had pale pistachio goop which wasn't as flavorful as marzipan and unfortunately didn't moisten the dry cookie. The chocolate mousse, rich topping and brandied cherries were tasty but not for $8.", "author": "karen h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-04", "description": "Amazing baked goods. \nNice strong coffee.\nCool gift items.\n\nPoor decor, but they have an open kitchen which is kind of cool, but it's very raw looking.\nTiny tables.\nToo quiet.\n\nOverall, nice place to pick up a quick breakfast or some dessert, but I wouldn't want to hang out there. And it is a little pricey, but hey, you literally see them making everything on premise and get hot fresh baked goods, it's like heaven.", "author": "Kitty B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "The Miche sourdough here is incredible - deep and tangy, the flavor lingers in your mouth long after you're done eating it. Would recommend to anyone looking for a loaf with spunk and pizzazz. \n\nService has always been prompt and friendly when I've visited.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Always an amazing breakfast place; great coffee and pastries, best bakery in Brooklyn if not New York! Go try it!", "author": "Liv R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "Update: I passed by Bien Cuit again on a Sunday afternoon around 1pm and they did have the almond croissant. It was good, don't know if it was amazing but definitely good so I'm updating my rating.", "author": "Mike Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "Great \u0026 very fresh pastries. Interesting breads. Nice place to sit. Sure, it's not cheap, but it's in a great location with high rent \u0026 serves high quality. They make a memorable hot chocolate. I'm a fan of Joe's coffee (it's my favorite in the city) so am glad they are serving that.\n\nBut what prompted me to write this review was that they have a (relatively) new person working there who is also so nice \u0026 friendly, smiling, and brightens up the morning - very tall guy with a beard, can't possibly be from NYC or the east coast is my guess. So this review is particular kudos to him!", "author": "Jeremy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "FINALLY FINALLY FINALLY an awesome bakery in Cobble Hill. All of their breads are made in house and their selections of iced drinks are a refreshing summer treat. Besides breads by the loaf, they sell a range of small rolls such as saffron, chive and olive and have amazing croissants - like goat cheese and artichoke. Perfect place to dip in for a carby treat or to pick up some fresh local bread for dinner. An AWESOME addition to the neighborhood.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-16", "description": "I live in the neighborhood and frequent this place. Here are my two cents:\n1. my favorites are the small breads. they are all incredibly tasty, with nice texture and ingredients in great balance. the croissants and desserts are excellent for NYC and above average by European standards (not sure about Cali- cant compare)\n2. the coffee is pretty meh. head down to van leuween on bergen and smith for a really great cup of any coffee-based drink, esp espresso-based. \n3. the staff ranges from very nice to attitude-prone. a hit or miss. \n4. prices are pretty steep. \n5. I still frequent b/c its the best bread in the area. the small breads are close to the best I have ever had. the rest is just best in the area.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "Nice little shop. Good coffee great pastries.  Friendly staff. Not sure about the reviewer who said there was a rude lady behind the counter, I don't think the rude lady actually exists but, this is NY lady!  There are 8 million a-holes in this city, you're going to run into a few.", "author": "Bryan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "Loved the deserts \u0026 the coffee was so fresh \u0026 different (felt like I'm in Paris). Kate behind the cashier was so friendly \u0026 sweet. Will definitely come back again!", "author": "Sunshine A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-22", "description": "Went in today I. The afternoon to get my caffeine fix. Long day at work. I was lured into trying this place out based on reviews and my hankering for something different than the generic coffee (which I enjoy very much) that you can find after every block. While I was there I also decided to get a pain au chocolat. First bite and I fell in love with it. Light buttery, flaky, probably the only time I like flakes and perfect amount of chocolate. Thumbs up for a croissant well done! Then why the two star rating? You may ask. The coffee. A small was way too small to begin with. But I assumed quality versus quantity. Right? The coffee at first sip was alright at best. As I walked out of the store there was stream of coffee running through my wrist. And after every sip it kept dripping until my frustrated self dumped a hot cup of coffee inside the dumpster, a first in my life. Wat a waste of a perfect afternoon and 2 US dollars.", "author": "Merina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "A coffee shop in a bakery, or a bakery in a coffee shop? Either way, this place kills it. Best baked goods in the nabe. And don't just try the sweet stuff--their breads are amazing. Cool, competent staff without the militant barista vibe you get elsewhere.", "author": "T J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Amazing almond croissant and coffee. A fantastic addition to Brooklyn. Down side is customer service...the workers are more interested in chatting with people, then moving the line along. Have some patience...it is worth it.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "Best chai latte in the neighborhood ! Must try their croissants!", "author": "Aziza S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "$8.95 for a 1.5 inch wide slice of delicious banana walnut cake?  It was the most perfect banana walnut cake  I've ever had - half banana walnut bread (but less dense) underneath a banana mousse cake that held it's shape perfectly.  I might buy it again, although the price was shockingly steep.  Notwithstanding, Bien Cuit is a 4 star establishment.  I've never had a pastry I didn't enjoy and it's actually a lovely, quiet space to read and enjoy that very expensive and delicious aforementioned banana walnut cake.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-08", "description": "Bien fou.  By Saturday afternoon they had no desserts except a few overpriced tiny boring eclairs and some loaves of bread. Totally unacceptable for a business to not manage its product correctly.. went out of my way to try this \"great French bakery\" and was huge disappointment. Needs to get his act together. Meanwhile sticking with the real deal at Almondine.", "author": "G R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-16", "description": "the only reason they deserve 2 stars, is the Maple Yam Danish and the Miche bread.\n\nbut man, they really need to step up their coffee program. \n\nit's just so very, very bad. not the overall quality of the bean/roasting, but the preparation. \n\nscorched milk, stale drip coffee, unacceptable espresso grind, non-rotating tea selection... \n\nno bueno!", "author": "Kathleen A."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}