{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "$4.90 for a latte is a lil pricey, but the atmosphere is legit and I thought the staff was quite nice.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Amazing. All the food is great. But the chocolate almond croissant is ah-maze-ing. Good coffee too.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "I had a chocolate croissant here after searching for chocolate croissant on Yelp because, well, I. needed. one. \n\nThis was delicious. I spent the couple minutes I had to wait in line battling with myself about whether I wanted to have the almond or the chocolate croissant because well, now I had the choice. I decided on chocolate and it was just what I needed to feel human again.\n\nI am now devastated reading the reviews to the right of my write a review page here and I see that they have almond-chocolate croissants. I have failed. \n\nI guess what I'm trying to say is, Bien Cuit has some delicious, flaky, sweet but not too sweet chocolate croissants. The pastry case looked like something you'd see on some food cable show and if they're as good as the chocolate croissant I'd keep coming back to traverse all of their offerings.\n\nI'll be back!", "author": "Will C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "My mouth is watering as i write this review because the hazel nut croissant was heavenly!!!!!", "author": "AR A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "This is a place I frequent. I gave three stars because the lattes and cappuccinos are a hit or miss, depending on who's making it. With espresso drinks costing six bucks with tip, the management should better train their employees so that there's a quality consistency across the board. On a positive note, the baked goods they offer are premium.", "author": "Ral S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "The croissants and desserts are on point here, large space \u0026 ample seating. Every once in a while there is something new on the menu. Speaking of which try their new eggplant sandwich! \n\nIt gets packed on the weekends but the staff does a great job keeping the line moving. Make sure you come early in the day otherwise some of the pastries and sandwiches will be gone for the most part.", "author": "Triston K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-04", "description": "Yummy pastries, although my chocolate croissant was a tad too done!  Overpriced, but it is Cobble Hill.\nGood service.", "author": "Jorge A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-04", "description": "The croissants are burnt, and no this isn't how they are supposed to be!! \n\nMy husband and I are French and most of what is behind the counter looks and tastes like a big mistake! Their flavor combinations are severely questionable in the danishes and more elaborate pastries.\n\nIn addition, everything looks like it's been shot with a shrink gun and miniaturized. Whereas the price has been grossly inflated. \n\n$4 for a tiny odd tasting pastry, please! And $4 for a \"Demi-baguette\". It's actually the size of a quarter or eighth of a baguette!\n\nLastly, the service is cold and creepy definitely not friendly.\n\nIt's obvious the owners take their clientele for idiots and are trying to sap them for as much money as possible while giving the least possible.\n\nBut no longer us! We won't be back!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "They make the best French baguettes and croissants in Brooklyn.  My children love to hit this spot to satisfy their chocolate croissant cravings, as do I.", "author": "Ray A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Best. Chocolate. Croissants. Ever. Felt like I was in France again!! I've been going here for years- love this place. It's so cute and everything is so delicious.", "author": "Becca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "I've been missing Paris lately, and no joke, the croissants and coffee at Bien Cuit give Paris a real run for its money!\n\nI ordered the almond croissant and mocha latte. The croissant was super fresh and flaky and the almond filling wasn't overbearingly sweet. You can see all the baked goods cooling straight out of the oven. What more could you want?\n\nI'm not a big coffee person (the taste is a bit too bitter for me. Sorry, everyone,) but I downed this latte. It was lightly sweet and frothy. \n\nAssuming I wake up in time for weekend breakfast again, I shall be back!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Great bread, above and beyond staff and head baker/chef/Jeff. I came in to get some sourdough (they make a really great loaf) and asked one of the employees if I could buy some of their yeast starter so I could try baking at home. She went back to ask the baker and he ended up coming out and spending a whole 15 minutes talking to me about how I could actually make my own starter at home. He walked me through it, answered all my questions, and said I could shoot him an email any time if I needed help troubleshooting. Really patient and friendly, I'll definitely be back. Thanks Jeff!", "author": "Céline D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-20", "description": "Came here for a meeting yesterday. It was about 10 and the place was pretty full, that is to say there was only one table left. There is an average amount of seating so if you are going during a high traffic time you might want to plan to take things to go. \n\nThe regular coffee is fantastic and also fantastically cheap. Very few times do I go to places like this and the coffee is less than 3 dollars. The chocolate croissant (brioche au chocolat) was 3:50, which is a pretty typical price. But it was absolutely delicious, perfectly flaky and crisp on the outside and soft and buttery on the inside. \n\nWhile the two things I got were enjoyable, the ambiance is pretty mediocre and the service was a little lack luster. I wanted a chai latte, and as I can't have dairy I asked for almond milk. They apparently had none, no soy milk either, which seemed like a huge lack of foresight on their behalf--No one noticed at closing the night before or at open that there wasn't enough almond and/or soy milk? It was 10 when I got there, some one could have fixed that pretty quickly since they'd already been open for a couple hours.\n\nAlso, I had never been there before and it was raining outside and I had no umbrella so I was a little frazzled when I arrived and I didn't realize that you order at the front of the counter and then get your coffee order at the very narrow end of the counter. Instead of saying this to me when they saw me sitting at my table waiting for my coffee to appear where I ordered as my coffee got cold at the end of the counter, they just looked at me and whispered to each other which made me feel really uncomfortable. \n\nSo even though the coffee was great and the croissant was delicious I would likely never come back because the service was poor and the atmosphere was just kind of stale, generic, and pretentious.", "author": "Shayla G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Terrific breakfast pastries, salads and coffee.  Highly recommended for breakfast.", "author": "Jeff R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "Poor service. Bread is often too hard, almost burnt. Bread is way overpriced. \n\nBut the worst is the pretentious manager who lacks manners and has an attitude. If the owners were smart, they would fire the manager today!", "author": "R P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "I was taking a stroll downtown Brooklyn.. walked by this coffee shop stop for some coffee ...simple environment but there's no electricity to charge which is something I kind of noticed in Brooklyn even Starbucks doesn't have electrical power", "author": "Karina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "I really love the bake goods at Bien Cuit. Everything is so fresh. The croissants taste almost  as good as the ones in France.", "author": "Fiona T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "The fact that they only have 4 stars is a damn shame. My roommate finally dragged me here, and I had the tirburke (I'm probably murdering the spelling)--an amazing pastry with almond paste layered into the dough. It was absolutely spectacular. \n\nOn a Sunday morning, they were out of a lot of the pastries, but this was just flawless. My roommate got the fig pastry, also superb. Thanks for ruining all other baked goods, Bien Cuit. Nothing compares.\n\nAlso: huge props to the employee (owner?) who gave us tips on when to pick the figs on our fig tree. We had no idea when to harvest them!", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "I freaking love this place. Come 3-4 mornings a week for my iced latte. I only wish there were more bien cuit's throughout the city because I've become such a coffee prude. I only want theirs. Tasty food, cold and serious customer service, but not the worst I've experienced so I can keep coming back, cute decor, and consistent drinks and food quality. The company is really smart by taking their time to grow, I really respect that of them. Doing everything smart instead of blowing themselves out of proportion like many newer coffee shops once they get big. Plus it also ruins the exclusivity of a place when they're on every corner.", "author": "Bree R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Def one of the better bakeries in the area but not a true croissant or baguette. But no one is.", "author": "Bonnie K."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}