{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-14", "description": "I hate doing this to a newcomer, but sometimes tough love is necessary.\n\nIt took me an hour to get to Bien Cuit, but judging from the baked goods I consumed, I wasn't sure whether the translation meant \"well cooked\", or \"well done\". Judging from the appearance in real life, and in pictures posted in the virtual world, it appeared that the intent is to let the fire work its magic beyond what is considered acceptable to a normal distribution of palettes.\n\nI am being gentle. \n\nMuch that I was looking forward to check out the breakfast pastries and tarts, I was disappointed by the regular croissant and the Cherry Chocolate Hazelnut brioche. While, I can only blame myself for showing up at 9 am (the bakery opens at 7) in terms of not finding any warmth in the pastry, I can fault the croissant for not having any shatter effect or even being crisp. I found the texture more bread-like than anything else. Quickly moving on to the Chocolate croissant, I found it to have better texture and layers of cavernous dough - however, with one problem: there was no chocolate. I raised this with the server who promptly replaced it with another one that did. It could well be teething problems only, for they did open for business yesterday. \n\nHowever, while I really liked the filling in the artichoke goat cheese croissant, I found the quantity inadequate. This was also the case with the Cherry Chocolate Hazelnut Brioche, which had minimal pastry cream, chocolate, and sundried cherry. The brioche did appear to be \"well done\" given the dark brown sheen to the exterior, as was also the case with the Palmier cookies that were far too crunchy for my liking (compared to those served in a w. village bakery that used to be a regular haunt).\n\nI have no doubt that the credentials of the chef are impressive (including a stint with the venerable Philly institution Le Bec Fin, now closed), and the different breads on display did point to that. But, I do think it's necessary to highlight that many items in the pastry menu need considerable attention.\n\nTo end on a positive note: the iced coffee was excellent, there's ample space and natural lighting, and the service was both knowledgeable, and courteous. The latter being traits that were missing in the former occupant of this address. Ultimately, it's \"What's on the inside that counts\". Unless, you're only a tease.", "author": "Atif I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "2016 finalist for James beard awards best baker. The place is legit. \n\nAlmond croissant and try their cappuccinos.\n\nPrices are reasonable - above two about $8.\n\nFor one of the best bakers in the country that's not bad at all.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-09", "description": "This was just a fine french bakery for me. I like their danish and croissant but those are too overly priced. I bought two pastries and I paid almost $9. And since I live in queens,  I might not come here just to grab their croissant. Those are not that special to make me to travel down to brooklyn again....If I am around there again for some time, I might try another bakery since there are too many great bakeries to try out in brooklyn:)", "author": "Annie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Some of the best parties and bread in all of New York. Their croissants are absolute heaven, and their crusty bread will make me happy on any day. \n\nKeep it up!", "author": "Tara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "My new favorite cafe in the neighborhood. The bread is AMAZING.... And the coffee...! Great little outside garden too!! \n\nLove this place.", "author": "Tiffany G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "This is a busy little bakery with cafe style tables and chairs.  I liked the offerings and chose the chocolate mousse cake.  It was delicious.  I highly recommend for a treat or a lighter lunch.", "author": "Isabelle F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "All of their pastries are freaking delicious.. Every time I drop by, I get something new and I rarely get disappointed.. but they're expensive. \n\nAnd what's also amazing is that everyone on staff is really passionate about their bread. You ask them about their faves or what's good, and they will give their honest opinion and talk wildly about the bread they bake. \n\nI can tell that they don't like it very much when people stay around for long, especially when they're busy (around ~3 pm when school's out and parents bring in their kids)", "author": "Jane K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-20", "description": "Fine. Nothing special. Questionable prices. Excellent service. Would probably return if I were in the neighborhood.", "author": "Travis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Delicious bakery! Their bread is killer, as are there pastries... Sometimes the service is slow, but always friendly and well worth the wait.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Love this place! I come here far too often, as I work in the area. As a Francophile I have to admit that I absolutely obsess over this place. The staff even remembers my order, which means I come here way too much! I do love this place, it is very expensive and sometimes they run out of their bakery items. Delicious bread and coffee.", "author": "Colleen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "We came here on a very cold December Sunday morning at 9 am, and this place is already full (a sign of popularity).\n\nThe croissant are amazing with very crusty outside and buttery inner layers.  My latte wasn't bad at all, except it took a while for them to make it.  I need to try their breads next time.  If my judgment on their look is accurate, they should taste like heaven!\n\nThe place is very cozy and it was particular cozy when the weather was below freezing and I am sipping hot latte.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "i am so, so into this bakery lately. \n\nwhile the prices are a little steeper than the italian bakeries on court street (like much more steep) the quality and variety are what's special about this place. while you can get your standard loaves of raisin walnut bread, or olive loaf there are varietal picks of like spring bread with nettle (it's green) and of course any french pastry you could possibly want.  the variations of croissants are endless. plain, chocolate, almond, ham and cheese, artichoke and goat cheese to name a few. then there are sweeter treats like danish and brioches. you can also score quiches, sandwiches tartines and cookies. \n\nthe coffee that they serve is JOE coffee. a roaster i recently discovered when visiting Austin and will put myself out there is saying it is JUST as good as stumptown and the like for all you coffee snobs out there. myself included. listen - a legit bakery is going to serve legit coffee. try it.", "author": "Maia D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-26", "description": "One star?!  Yes!  \n\nHarsh? I know!\n\nWhy?  Inconsistency.  W I D E inconsistency.\n\nWhen they first opened, I really liked this place.  Baked goods were... \"good\".\n\nOn more recent half dozen experiences..... awful.  \n\nVarious croissants tasting like it was made with bread dough....no flakiness, very little butter taste. Baguettes had no flavor, very unstatisfying.  \n\nListen, if I'm going to eat carb loaded, nutritionally void, expensive artisanal white bread....it better be DAMN GOOD!\n\nCoffee is okay.  But I need a restroom when I drink coffee. \n\nRestroom?  None.", "author": "Abc M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "It's no Almondine...croissants were good and buttery. But Pain au chocolate was dry as dirt. The baguette was hard and dry. Disappointed.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-23", "description": "I was looking for an authentic French baguette with a crispy, crackly crust and chewy crumb. Unfortunately I found theirs had a very-very hard crust.The heels are salad crouton like... dry with no chew.", "author": "Jack O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Every time I come here I bite into something and think: there is no way this could be any better. I swear, it's the best place--any kind of place!--in NYC. How is there not a line wrapped around the corner?? The coffee is solid (Joe), the pastries are freaking insane, and the bread is the best I have had baked in NYC. (The bread is all on the super rustic, artisanal, extra crusty, extra chewy side.) This sounds like hyperbole, I know, but as I sit here with my coffee, having just polished off a delicious feta and kale croissant (hot!), I am contemplating what to get next. I know the chocolate almond croissant is the best pastry I have ever had (except for the custard filled croissant, xiuxo, at La Boqueria in Barcelona) and the turkey and cheese croissant sandwich is always wildly satisfying, but I'm also eyeing those other magical looking things in the case... Beet green and goat cheese quiche? The always classic plain croissant (my favorite plain croissant in the city, too--a little on the dark side, crispy outside, soft and very slightly sweet inside.) The almond croissant (also the best almond croissant ever, but when looking at the chocolate almond croissant, it's a little hard to consider!)? One of those almond tart looking things? A salmon topped toast? And jeez, I could always just get a whole loaf of Miche to chow down...  I saw someone say the place was hip just to be hip. I don't get that. It doesn't strike me as a particularly hipster place at all. It's just a damn fine bakery with good coffee. The pastries aren't cheap, but for what they are, they aren't particularly expensive, either.", "author": "Tanner L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "Not exactly In my neighborhood but we make  a special trip to go here and pasainos meat deli. Really good authentic French breads unfortunately w gentrified Brooklyn prices. But beggars can't be choosers.", "author": "mj b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "One of my go to places in the neighborhood to kill time over a coffee. They serve joe coffee and the shortbread and almond cookies are amazing. They also have sandwiches which I haven't tried but look great", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "Delicious.\n\nI needed a nice place where I could get a drink and some food to chill for about an hour and this spot was excellent.  Nice relaxed vibe + well-made pastries = happy me.  Their sandwiches are very delicious and their tea was delicious too.\n\nWhen I think Bien Cuit, all that really comes to mind is...delicious.", "author": "Maisha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "These croissants are freshly baked and it has a soft flaky buttery texture to it. I had the original croissant, ham and brie, and au chocolat. They were all amazingly good..and paired it with an ice coffee. It was a great way to start off my day. I would definitely go back again to try their other pastries. I mean who doesn't love CROISSANTS!", "author": "Alvin G."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}