{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "Pricey, but tasty and beautiful pasteries. Coffee is well-done too. Nice place to treat you and yours if you don't mind giving up a few extra dollars.", "author": "Kwame L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "Bien Cuit is all around pretty great. The pastries and breads are fantastic. In particular, their Pain de Mie is absolutely perfect for making French toast. I do agree with other reviews that they could step up their game with the coffee, though. I've only ever ordered regular drip coffee, so I can't speak to the espresso-based drinks.", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-21", "description": "Well again I find a place i like and I go everyday! My daily breakfast has been the chocolate crossiant  $3 bucks, it is amazing and I think the price is ok. I also got a 1/2 loaf of sunflower rye bread last night and we paired it with some cheese from Stinky Bklyn and had amazing cheeseburgers for dinner. Unfortunately with $7 1/2 loaves of bread I will not be buying to many.  I would love to see the prices come down a little bit so I could try more of their selection of pastries and breads. The last thing I will say is mad props to your am and late afternoon staff! They are more than helpful, super polite and sweet and definitely give gret suggestions.", "author": "Lexie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-23", "description": "I've walked into Bien Cuit three times, stared at the displays/looked around for a solid 5 minutes and no one has offered their service. Well..actually the last time I went in the server asked if I needed anything after she finished socializing with her friend but as I was heading to the door. That's fine. $6 for a 2 and 1/2-inch tart is ridiculous anyway. Plenty of other ways to get a full meal with not much more money on Smith Street.", "author": "Angela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "This place is really cute with awesomely yummy coffee and pastries.  Last time I went I got an iced Americano and the quiche of the day and was quite satisfied on both fronts. They've also got a really cool iPad register (which seems to be trendy in the Smith Street area right now).  And the light in the afternoon is absolutely delightful in the seating area.\n\nI don't give this place 5 starts for 2 reasons:  It's a little pricey (which is expected when pastries are quality) and the staff is hit or miss.  Some of the staff members are really friendly, helpful and will joke around a bit.  Some other staff members scowl at you for having the gaul to ask them to make you some coffee (um, sorry, I thought that was their job?)", "author": "Martha D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-19", "description": "Cleanliness not withstanding, the bread, regardless of recipe, is always over baked to a color darker than a cardboard box in the rain.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "Their pastries are phenomenal.  I stop by occasionally and have tried a variety of them.  This morning was their yam danish, and everything about it was just perfect.  More than perfect though - the flavor of the yam was unexpected and delightful.  \n\nYes, they are pricey ($3.75 for that yam danish) but if you want mind-blowing quality and unusual flavor profiles, this is your dream bakery.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "Nice and flaky croissants! One of the best I've had in New York... not to many bakeries in the states can do it right. The coffee is so so, but good enough to have with the croissant. I wouldn't go there just for coffee. I haven't had any of the breads or sandwiches yet, but I plan to soon. Great addition to the neighborhood! Merci", "author": "M. P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-24", "description": "I love this place! The espresso drinks are top-quality and the breads and croissants are dangerously delicious. I'm a big fan of the turkey and swiss sandwich on a croissant for lunch. \n\nThe space is small and cozy, and you can work with a laptop without being hassled (though be warned - there is only one table that has access to a power outlet). \n\nLovely little bakery/cafe, so glad it's in the neighborhood!", "author": "Anna N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-11", "description": "I also want to love this place, as good bakeries are hard to find in these parts. Unfortunately, the quality of their croissants are inconsistent, along with some other baked goods. I would suggest that they obtain mugs and saucers for dine-in customers. It kills the experience to sit at their place and drink from a to-go cup.", "author": "Natalie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "raisin walnut bread deliccccious. I like the dark almost burnt curst. their chocolate chip shortbread cookie very good too.", "author": "Margaret Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "I'm updating my review and upgrading Bien Cuit.  Becuase guess what--2 years after opening they really made do on their promise and redid construction so they could offer a restroom! YAY! This is HUGE.  I'm serious.  Also because they actually recognized that the lack of facilities was a problem and they made the effort to address it--this shows a commitment to customer service.\n\nTheir croissants are still the best ones I've had outside of Paris.\n\nAlso, another point in their favor--the other day I was doing work and their WiFi was down, and the owner came over and personally entered the password for the office wiFi for me so I could still get online.  WOW! Those kinds of gestures are really meaningful.\n\nSo Bien Cuit, I'm glad you're here to stay.  You're a good neighbor :)", "author": "Spike G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-02", "description": "Loving this delightful cafe.  It has charm, class, and cute baked goods.  The interior is wooden and the interior has an exposed brick wall that makes you feel as if you're in Manhattan.  With delicious pastries like the ones that I just had today like the fruit tarts(i.e. peach and raspberry), pain au chocolat, muenster cheese \u0026 raspberry croissants, who could really complain?  They have a variety of fresh homemade bread(some even have Yukon gold potatoes in them, yes they are cooked all the way).  There are tiny bread samples to get a feel for the texture and taste of the bread.  The price range is in the teens if you are used to paying a few dollars for your local Trader Joe's bread. They also have some different spices, pastas, and random food items.  I like their quiet atmosphere and great window for people watching.  It's great to have a bakery on Smith Street to have a coffee fix or to grab a cup of tea with a friend.  The coffee ranges from $3. 25 and up and the teas are in the same ballpark.  There is quick service and the man at the counter greets you as you come in.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-12", "description": "PASTRIES: 5 stars. Just as delicious as they looked. Made with obvious dedication and skill. Specifically, I sampled the mango, boysenberry and cocounut tart and the financier. Can't wait to try more. \n\nESPRESSO: 3 stars, I ordered a cappucino to stay. I received instead a latte in a paper cup. This was irritating for two reasons: \n1. anyone else who ordered to stay received a ceramic mug\n 2. If I wanted a latte, I would have ordered one. I like cappucinos because they characteristically are foamier and contain a little less milk. Yes, I do know the differences between espresso drinks as I am a former barista, with years of experience and latte art skills. The server was rude and gave me a serious attitude about re-making the drink and made it wrong AGAIN, then tried to tell me I was ordering the wrong drink even though I was very nice about the whole exchange.\n\nCustomer Service: 0 stars, rude, unskilled, just....blech. I always, always tip servers well because as a former food service worker I know how tough that job is and I appreciate their hard work. This girl was simply too rude to tip. Just to give you an idea in case you want to walk in here for a drink - she has clear glasses and dark hair. Unpleasant, avoid her at all costs. \n\nAn otherwise lovely, elegant little bakery like this place would do well to hire more skilled and polite baristas. Overall, two stars off for crappy service, 5 stars on pastry, which is really the point of this place. Will return, but regrettably not for coffee.", "author": "Maysa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "Not everything is 5 stars here (I think though, most of the pastries and breads are at least 4). But I'm a pain au chocolat fan, and their version? The best I've had in the city (on par with the best I've had anywhere, including Paris). The chocolate is high quality, and just the right amount, the pastry is flaky, buttery, and never overly soft. In total, an exquisite, wonderful croissant that will make your day that much better. I'll also mention that they switched coffee (they were using Brooklyn Roasting Co, and are now using Joe), and their cappuccino is really tops now (before it was more of a low point compared to everything else they have). I'm not a big baguette person in general, but I love their raisin walnut and sourdough-style breads, and I'll also plug these little shortbread cookies they have on top of the counter. Delicate and wonderful. Also, everyone I've dealt with has been perfectly fine and often friendly, and they have a nice bathroom now at least (to address the issues an earlier reviewer mentioned). So go, you won't be sorry.", "author": "Alexa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "excellent pastries and breads.  also good coffee", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "Been here a few times, a favorite for after a Friday night dinner. Now I haven't had any of the breads here, but the chocolate almond croissant is delicious, the Lemon Blueberry tart is awesome and the Pistachio Cherry Chocolate tart is out of this world. I would say it's a little on the pricier side but you're getting high quality ingredients. The coffee is just ok, nothing to write home about, but it's not terrible as some other reviews suggest.", "author": "Danny N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "Pricey and the service is horribly slow - same person mans the register and fills the orders - but excellent bread. I get a weekly loaf of the sunflower rye, $11", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "Best pain au chocolat (especially when its right out of the oven!). Flaky and crispy on the outside and soft and buttery on the inside with the right amount of gooey chocolate in the middle. Creamy and perfectly brewed latte to wash it down. I will dream about this combo forever!!", "author": "Vivs L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-13", "description": "I have mixed feelings about the place. I'm trying to be as fair as possible, and not put too much information about my personal experiences there. \n\nPros :\n- the food is REALLY GOOD, when eaten right away\n- very practical to pay by card with their ipad\n\nCons:\n- the croissants and pains au chocolat are good and tasty when eaten right away, but  lose their freshness and taste very quickly (I've seen better). \n- everything is definitely overpriced (and depending on what you buy, very small portions...). It may be true that the bakers have been trained in France but there are other places where pp have the same kind of experience and they don't charge as much\n- The 2 waitresses that I've met there were just very unfriendly. No smile, no acknowledgement. It seems like it was just a pain for them to be there. I've been to the place more than once and their attitude was always the same, so it's not like they were having a bad day. \n- unpractical - there is only one plug, very close to the door... so don't go there to work. And no bathroom.", "author": "Flo H."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}