{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "This is solely for the Almond Croisant.  $5 for a croisant a bit pricey you say?  It's quite delicious.  I've never had one like it before.  It is one of those things that is worth trying in life.", "author": "Simon C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-08", "description": "Had an interesting experience here this evening. Coffee was so so, but the atmosphere was even more bleh.", "author": "Jennie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-27", "description": "Good but not amazing and at double the price of other bakeries.  7+ bucks for a loaf?  That's ridiculous.  Their pan au chocolate was again good but more expensive than other bakeries.  So above average bread at the most expensive prices I've seen.", "author": "T L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-15", "description": "underwhelming. mixed feelings\n\ntheir almond croissant was superb, but their coffee was so bad.\nalso, the atmosphere and service is uptight and inefficient. seating is also uncomfortable. also, they don't have a bathroom for customers.", "author": "Hyun L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-02", "description": "The food here might be fine, but the staff are extremely rude. I did not ask for any odd/ unusual requests, and yet they clearly acted as if me being in their store was a horrible inconvenience to them. I would rather spend my money someplace where i am not treated like a second class citizen.", "author": "Renee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-24", "description": "One word: Miche!!  It is simply something wonderful this bread. The only reason it's not 5 stars is because sometimes it's a little too Bien Cuit (well done) for my taste. Choose the least dark one, buy yourself some French butter or Humbolt Fog, and you will be a happy person for the next few moments. Enjoy!!", "author": "Patrick F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-08", "description": "Used to love them but....now...would give them SO MANY MORE STARS if a) they ever answered their phone during business hours, which they seem totally averse to doing and b)if they brought their cookies back, especially the chocolate chip shortbread cookie, which was divine. \nHowever, the cookie that used to be there all of the time got switched to part of the time and now- never. My husband asked once and got a special batch baked for him 2 weeks ago; when he asked again recently he was told they 'never' do that. God forbid you go the extra mile for a would-be customer? Too bad, because although I'm sure their other pastries are good, there are many other bakeries in the area that we'll be visiting instead.", "author": "Kara J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "Very cute space. Has an authentic feel. Everything looks delectable. I had the iced lemongrass green tea which was yummy. Prices are what you expect from that area. Would definitely go back!", "author": "Bianca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "I had the chocolate croissant and it was ok only. I don't understand the hype. It just tasted like a normal croissant to me.", "author": "Vanessa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "okay so heres he deal with this place. skip the fancy expensive little cutsey hipster (insert other negative connotations from two star ratings below) and try a half loaf of the campagne, pullmans, sunflower rye, miche bread. this is the real stuff. the baker spent time in france and it shows. these bakers really know bread. also its empty in the back because thats where they...bake...the...bread. \n\nif you are lucky and can score a pullmans still warm, you will forget what croissant or a toaster is for about 3 whole minutes. Swear on it. actually i wish i didnt have to divulge this info because its kinda that good.\n\nalso i have had thier choclatey little cake/pie and i must say it is like you jumped in a pool of ghiradelli pudding.  \n\nyum.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "There is no better bread in the city. You can buy a plain croissant and sit on your stoop savoring it flake piece by flaky piece. Also, the baguette, I have been told, is of Parisian quality. And I don't say that lightly.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "The loaf of bread called Miche is a true work of culinary art.  A gorgeous, massive round(ish) shaped loaf that's wholesome and chewy on the inside and think and crusty on the outside.  There's multiple types of flour so you can't really classify it as a wheat or rye. \n\nI saw a few people comment on the cost of the bread. No one would think twice about  a $10 bottle of wine but a $10 loaf of bread that's a real show stopper at a dinner party is a real treat. \n\nThey have other types of breads as well that are great like the Pugliese.  But if yiu want to make an impression on your guests or with your host, the Miche is the way to go.", "author": "Lee B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "It's nice to be inside this cozy place, smells warm bread in the morning...etc. But it's still a bit pricey like other yelpers mentioned. It is good, yes, but I can only afford their breakfast items time to time. But it's a nice bakery to have in our neighborhood.", "author": "Yumi I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-25", "description": "I think plenty has been written about the superb pastries. But I agree with many that the coffee is terrible! I had it a few times to make sure. Twice I spilled it out, I couldn't finish it. I am not sure why they don't listen to the complaints on here. I am not sure if it's the \"french press\" machines, their water, or what. But It's just plain bad.\n\nCoffee is an important part of the pastry experience for me and many others. They are a perfect pairing! Oh folks at Bien Cuit ...we want to love you...just fix the coffee. Merci.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "We got croissants to go to bring to the airport with us as we were headed back to Texas. Flaky, crispy and chewy... yum! Why only 4 stars? because I had my heart set on having breakfast there on our last morning in Brooklyn but being new years day they didn't open til 3. Oh well, hopefully they will be around when we make it back there.", "author": "Gabrielle K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-28", "description": "Visited today for the first time, drawn by the prospect of an expertly made chocolate croissant. It's a pleasing, cozy place, perhaps a little clever/hip for my taste. A rear patio is being readied, which should be quite a draw. Counterfolk were pleasant enough. The croissant was of high quality and I recommend it. The shell had a crisp touch and the pastry beneath was just right: not too thick, nor gummy or dry. The chocolate was dark and just sweet enough. A red eye was served in a generous white porcelain cup with a saucer (only a small spoon was absent), which made the experience so much more pleasurable than a paper cup would have. The coffee was rich and fragrant, a lighter roast and slightly acidic. (I am a dark-roast philistine whose ultimate cup comes from a Peet's in the Marina.) Inspired, I chose a big lug of a raisin-walnut loaf and a baguette to take home. I was asked if I wanted the whole loaf or just a half-- nice to be offered the option. When I got home I tried both. The raisin-walnut loaf, I am afraid, was overbaked. The juices from the raisins in the crust had become scorched, giving it a predominantly bitter taste. The walnuts had also been baked to bitterness, and the loaf had lost its resilience: cutting it was laborious, with shards of desiccated crust flying about. Apparently it contains pink peppercorns, which I did not detect. The baguette also fell short: I like a crisp crust with an inside that is still 'alive'-- fresh, a little whiff of yeast, substantial enough to spread softened butter on without tearing but not sturdy or filling. This was an unequivocally sturdy baguette; its charm had departed. This was, again, my first Bien Cuit (aptly named) experience, perhaps anomalous. But for now I will stick to the lyrical loaves of Saraghina Bakery.", "author": "jg k."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-01", "description": "There is some serious baking going on here, no doubt.  That was a good enough reason to patronize this place.  But now...even better...they just got BROOKLYN ROASTING COMPANY coffee...amazing...the best...", "author": "Keith K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "I stopped in this bakeshop with my girlfriend a few weeks ago.  Their selection of breads and pastries made my mouth water, and the staff used iPads instead of cash registers.  Very cool, guys.  Very cool.", "author": "Raphael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "One of my favorite spots in the neighborhood to get a croissant + coffee and read a book. Could've been a 5 star if the seating wasn't always so tight and the service a bit less aloof.", "author": "Albert S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-15", "description": "Not vibing the vibe. These guys need some soft ambient music and an attitude adjustment. The pastries although good, are overpriced--but what can you expect from Boerum Hill?", "author": "kc r."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}