{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "The best sourdough miche for the times you can't make it to She Wolf at the farmers' market. Once I learned how real bread is made from Michael Pollan's book \"Cooked,\" there was no way I could go back to eating bread that wasn't the result of a days-long monastic effort. I'm convinced Bien Cuit is one of the better options in the city for real bread.\n\nBien Cuit is serious about their breads and their whole-wheat sourdough is slow fermented with no added leaveners or preservatives. \n\nI come mostly for the miche but the croissants and open-faced sandwiches also look nice and coffee is passable.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "Here is my optimal game plan when it comes to Bien Cuit:\n\n1 - find a reason to need a loaf of bread. We typically come to Bien Cuit whenever we plan to make soup later that day. Lots of choices at reasonable prices, and you have the convenient option to get only a half-loaf.\n\n2 - pick out a sandwich to enjoy while there. I personally would opt for the Breakfast Sandwich or Turkey Croissant. Simple and tasty, despite being a bit overpriced for what you receive. Skip the salmon.\n\n3 - eat the sandwich in their awesome garden area. It's pleasant, peaceful, and usually empty. To me, this is the key selling factor for ordering breakfast there, as the interior seating space can get tight.\n\nI probably wouldn't come to Bien Cuit only for the sake of eating, but their bread and garden make it a good spot regardless.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-13", "description": "I've been dying to come here for years.\nWe got there super early but unfortunately, there wasn't much of a selection. Apparently, they were waiting for a delivery. :(\n\nHere's what we tried:\n\nBaguette w/ Ham.\nHoney \u0026 Sea Salt Roule.\n\nBoth were pretty good. \nI do wish they had more to choose from when we were there...", "author": "Liza Faye T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-16", "description": "That shiitake cheese quiche was especially delicious. Had to come back twice to have it again. Coffee is PIPING hot so be careful with your first couple sips. Now definitely not the friendliest of spots but I'm from Los Angeles and we're told to expect this so no harm no foul. Wasn't too impressed with the croissants but nevertheless, I enjoyed visiting this place.", "author": "Kaori T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "I run by this place a lot and it smells delectable from the outside. So even though I'm not a coffee drinker I couldn't help but bring myself in for some pastries. I ended up buying two.\n\n+ Ham \u0026 brie croissant - good, but standard. wouldn't get again.\n+ Romesco \u0026 chorizo danish - really good when heated. unique combo. would get again. The flakiness is perfect.\n\nOther loves:\n+ free wifi\n+ wood paneling\n+ all the tables are 2-tops so v easy to chill by yourself\n\nBecause I chilled here for maybe two hours I had a chance to see more of the staff interactions that other Yelpers have written about. The staff isn't rude but also isn't bubbly either. Yeah sure, they could smile a bit more? But I also noticed how warm it can get in here so maybe that affects the vibe. I don't know.\n\nRegardless I do think their pastries are bomb dot com so helllls ya I'm going to come back and order myself a chocolate almond croissant since I didn't get it this time.", "author": "Connie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "I have been trying my best to not overindulge in this place and kill its charm, but I'm not sure that would even be possible. A flakey toasted turkey croissant out on Bien Cuit's tiny, overgrown, vibrantly green patio filled with aromas of freshly baked bread drifting in from the inside is my personal idea of a perfect light lunch or breakfast on a lazy weekend. Part of me honestly doesn't even want to write this review and give away this little gem. Great selection of pastries, a long list of fruity iced teas, freshly baked loads of bread, and a decent coffee menu can be found on the menu. \n\nAlso, I can't come in and leave without taking a $5 half loaf of bread home with me - campagne and sunflower/rye are both great. I say if you are going to load up on carbs, you might as well do it right, but be sure to get here in the first half of the day because the cafe runs out of some of the customers' favorite treats quick.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "It's a cute space to do work or catch up with friends for coffee/ pastries. I like their butter croissants and definitely when it's fresh. I had their chocolate croissant but didn't love it as much. Their herbal tea selection is not a lot but it makes sense since they are more known for their espresso drinks", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-04", "description": "One of the best bakeries in the area, and truly a gem in the neighborhood!\n\nPros:\n- BEST plain croissant in the city (fight me); my go-to\n- Love their cookies \n- Free wifi\n- Wonderful breads that are baked fresh\n- Good number of tables (although they can fill up during busy times)\n\nCons:\n- On weekends the line can sometimes be out of control\n- Service/cashiers can be hit or miss (some are unnaturally grumpy)", "author": "Gene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-16", "description": "Was in the neighborhood today and scouted around for a bakery to pick up a french baguette for my little one to nibble on. I walked in and saw a vast display of baked goods: croissants, almond croissants, CHOCOLATE almond croissants, oh my! Completely forgetting about the baguette, I picked up 2 almond croissants, which were served to me from a fresh tray out of the oven! Nom nom! When it finally clicked to me why I was there in the first place, I asked the friendly gentleman behind the counter for a french baguette ... which were sold out at the time, sadly. Thankfully, they sell miniature versions for $2, which was soft in the interior and satisfactory to my child. However, the crust was a bit tough for my other half and I. Nonetheless, the almond croissants were delicious and I will likely dream of them tonight!", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Supremely delicious bread, ranging from the buttery pan de mie to the heady champagne loaf. The bread is good enough where I'll trust Bien Cuit with any baked good, despite the fact the chocolate buckwheat cookie left a little to be desired. \n\nA nice space and a good place to do a little work or reading.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-16", "description": "Cozy, dirty \"French\" bakery but people here don't know the difference between regular hot latte and extra hot. I always ask for a regular hot latte and I always receive it extra hot that I'm not able to drink for at least 15-20 minutes. I talked to them about it but they blame their steam machine, which is BS because you can warm up milk without burning it if you know how to do it. The problem is that the owner doesn't properly train the staff. Very disappointed and annoyed that I had to waste my time waiting for my latte to cool down.", "author": "Ester L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "Best bakery in Brooklyn, period.\n\nFood: Get the almond croissant! Pro tip: ask them to warm it up in the oven. I still dream of these croissants - it's the perfect flakiness and crispiness. The chocolate croissant is also devine.\n\nSpace: it's a small shop with eight or so tables to work from. If you're a freelancer, and plan to stay for the day, there is an outlet at the last table!\n\nI always make a trip when I'm in the area. The chef is super talented and it shows in the food.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-28", "description": "What you need to know: \n- On my quest to find the perfect croissant, many places point to this shop as having some of NYC's best croissants. Perhaps, my expectations were too high going in, but I wasn't that impressed. \n- Very cute shop with intimate tables and well stocked with water and utensils. \n- Accepts credit cards \n\nWhat we ordered: \n- Plain croissant price $3.25 - I got these croissants in the later afternoon, so perhaps it was not the right time of the day, but they were not that memorable.  I appreciated the large and crisp flakes on the outer membrane and the dense and multi-folds of the interior. \n- Pain au chocolat $3.50 - I wanted to call these croissants \"hardly chocolate croissants\" due to the sparse bits of chocolate found inside. My friend and I split the croissant and there were numerous bites where I didn't have any chocolate. Just like the plain croissants, I appreciated the multi-folds of the interior. \n- Baguette $4 - The baguette was the best item we got! It had a slight sour tang to it, reminded me more of a levain bread.  It also had a great crust.  $4 for a loaf of baguette is a bit steep but definitely worth it!", "author": "Karen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Came here for breakfast this am. Coffee was delicious and the turkey and Swiss on croissant was the best thing ever!!!!", "author": "Mindy J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-16", "description": "Got a large loaf of the campagne bread. Was told it's a sourdough.\nWas rock hard, dry and over done. Will need a chainsaw to cut through this log of wood and douse with some good olive oils to drown out the flavorless sawdust taste. Given the $$$ paid, don't want to pitch it out. Not a sourdough. Burnt wood. Did I just get a bad one? Can I get a refund?\n\nGoing back to Sullivan street bakery.", "author": "Madhu T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Great coffee, great pastries, and really nice people. The chocolate buckwheat cookies and sea salt and honey roule are my personal favorites, but the croissants are also great. Not usually too busy mid morning during the week, so it's a good place to meet people or work remote.", "author": "Veronica P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "Given the hype about their baked goods I'm a bit confused. I got a plum danish and although the plum and cheese filling was pretty phenomenal, the actual pastry was sort of bready and not especially flaky. I was underwhelmed.", "author": "Tom F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Chocolate almond croissant was ridiculously good. My boyfriend also liked his coffee, and my friend bought a delicious baguette that was supposed to be for later but ended up being a pre-dinner snack. I want to try the apple danish next time!", "author": "Gab G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "Ah. So, so good. The bread is incredible and the chocolate almond croissant is truly a thing of beauty. Got one and then immediately bought another for a friend to try. Recently for the salmon tartine and was very impressed! The salmon is like a pastrami.  Definitely one of my favorite bakeries in all of NYC. Just for the bread alone. It's pricey, but worth it.", "author": "Sara A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "$1.75 for a very soft, delicious chocolate chip cookie. 4 stars because the selection is somewhat limited. Cute spot for a coffee and pastry while studying.", "author": "Fatima L."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}