{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Best croissant I've ever had, even in Paris. Bien Cuit is aggressively marketing itself as a destination bakery - and has even put out out a cookbook - so my hopes might have been too high. We tried two eclairs today - one was sickeningly sweet and the other was great in concept (pistachio), but the filling was runny and it had refrigerator flavor! That's certainly not as advertised.\nOn both our weekend visits there wasn't a line but we still we couldn't get seats (and there seemed to be little chance of it), despite waiting for 15 minutes, because Bien Cuit is at heart a cafe where people camp for hours with their laptops. Which would be fine enough if we lived just a few blocks away and could pop in and out with our purchases. However, I won't be making Bien Cuit a pastry destination in the future on weekends unless I just happen to be passing through Boerum Hill on my way home.", "author": "Hilary H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "It took me a little over an hour round trip just to get a bag full of pastries, but it was worth every minute.  I have yet to try anything here and be disappointed.  I am a baker and not easily impressed with laminated dough items, but they make some delicious ones.  Flaky, buttery, crisp, chewy, tender.....everything you could ask for.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "The bread is amazing - the only issue - the loaves are too damn big!  :)  So many of us live alone or in couples and since the bread should be eaten soon after purchase and I, for one,  would love to see some non-Coscto sized loaves. \n\nMaybe this is how it was done 100 years ago?  Maybe it's needed for the right crust to bread ratio?  I'm not sure. \n\nI froze 2/3 of the half loaf I bought, and it worked but would love to see some smaller loaves.  \n\nService was ok - not overly friendly like at Breads Bakery Union Square.  It felt a little, \"our bread is holier than thou and we will deign to let you buy it.\"  So - up your game and smile and greet people with sincere welcomes and bake us single folks a loaf with lots of seeds, nuts, grains and a crunchy crust with soft inside and... 5 STARS baby.  :)\n\nIn the meantime, thanks for the best \"country artisinal style\" bread I've found in NYC.", "author": "Steven K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "one of my friends is a pastry chef who worked at several michelin starred restaurants. this is her favorite bakery in brooklyn and it's really hard to argue with an expert.", "author": "Amanda N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-19", "description": "Ideally, I'd like a bakery that:\n\n1. Is very close to my apartment.\n2. Has a very welcoming and friendly staff.\n3. Stocks amazing freshly baked bread and\n4. Other delicious baked goods at\n5. Affordable prices. \n\nLuckily for me, Bien Cuit is almost there: it covers 1, 3 \u0026 4.\n\nHaving been in only a couple times, I must say that the staff doesn't seem particularly interested in helping me out with the bread selection (or anything, really). I don't need them to be my best friend, but it would be nice not to feel like I'm intruding. \n\nThat said, most recently the man behind the counter did grudgingly tell us about the Miche, which he described as a rustic sourdough. I was a bit skeptical about getting it because (1) the crust actually looked rock hard, and (2) let's be serious: $10 is just too much to pay for a loaf of bread. However, at $5 for half, I decided to give it a shot. \n\nAnd I'm glad I did, because this is EXCELLENT bread. No joke. It's hearty and flavorful and almost a meal in itself. You know it's good because even without butter or anything, it's still awesome. \n\nBut there is the problem of the crust. Just as I suspected, it's so damn hard that I fear for my knives when I am cutting it. And my fingers, because when my knives aren't futilely scratching at the surface, they are sliding off the side. I don't really need my fingers for much, but I fear blood would ruin the flavor of the bread. \n\nIf a serious crust doesn't scare you, get this Miche and make yourself some butternut squash soup; this bread is the absolute best thing to eat with it. Also, Bien Cuit's croissants are absurdly tasty, so grab one of those too.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "You can't go wrong with an exceptional croissant and a Cafe Au Lait, now if you do this every morning, dig deep into your pockets. It will add up pretty quickly. For those of us, where money is no object, I say let it rip. \n\nHowever, Brooklyn is known for some exceptional bakeries. Caputos comes to mind at a third the cost. Their croissants aren't as pricey or as good, but their bread is outstanding. So, if your Porsche can handle a quarter mile drive or so, go to Court and Sacket St., you won't be disappointed. Cross my heart. XoXo", "author": "Gif A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "The croissants are outstanding! Staff is friendly and helpful. Chef Zach is the man! Highly recommend.", "author": "Meg R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "One of the best croissants you'll find in NY is right here at Bien Cuit. For context, I am a certifiable croissant snob and addict, and I wholeheartedly proclaim that Bien Cuit has one of the best croissants you'll find in the North America. I literally seek out croissants in every city I go visit. (Best ones I've found so far are in Paris, and surprisingly, Toronto.). Bien Cuit's croissant can compete with the best of them. \n\nIf you want the best version of their croissant, go there on a dry day at 7am when their shop opens. (Moisture in rainy day's air degrades the integrity of croissants.) At 7am, Bien's croissants are rested, super fresh, and if you are lucky, they may still be a little warm. \n\nSo, what makes Bien's croissants so good? It starts with the ingredients. They use the good stuff. You can tell. I won't name names, but let's just say if you happen to go across the street where they would sell you much larger croissants for slightly cheaper, you should run away. Go to Bien's and taste the real butter perfected for this delicate pastry. \n\nBien's croissants are not the flakiest things. I think that's in part because they are used to make sandwiches. But this is more of a stylistic difference. These guys are top notch in every way. And the great thing about this style of croissant is that you won't look like a 3-year-old sloppy eater after you take a bite. All the flakes and butter fall right into your mouth and melt into one smooth, lasting and satisfying orgasm. OK, you get my point.\n\nOn the days you might want to switch it up, I also recommend you try their almond croissant, and chocolate almond croissant. Both fantastically decadent and nuanced in their respective makeup. The frangipane they use is a great exercise in sugar, almond and heavenly goodness. \n\nI took a star off in my rating primarily because I find the service here can be a bit spotty. The staff can sometimes be in their own world. Generally they are fine. For the damn fine pastry, I couldn't think of a single better place in the area. And for the croissant, you have the best here. \n\nFinal side note, I have absolutely no idea why the owner chooses to call their exquisite croissant \"plain.\" Totally short selling it. The French would proudly herald: Croissant Au Beurre!!!  ...Bah, mais nous sommes Americains. ;)", "author": "Xin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "On Tuesday morning at 9:25AM, I was finally able to obtain the last coveted almond croissant.  It was orgasmic.  The outer was flakey and inside was the smooth sweet almond paste.  Wow.  Now, I finally understand what the rave is all about.  Unfortunately, you have to get here extra early just to get one.  Once it is gone, they don't make it anymore for the day.  =(", "author": "Ling C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "The almond croissants are always burnt and don't taste like almond. I know they are trying but their croissant style misses the mark.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-08", "description": "I can't believe I'm only rating this 3 stars.\n\nThe truth is, I was a tad disappointed. I wanted so much to love it, but alas...it left me hoping for more. When we arrived (between 11 and 12 on a Monday), their display case was practically empty. All the breads and pastries they boasted on the website were nowhere to be seen. \n\nThankfully, the sandwich I wanted (squash and white bean) was available. I must say, I didn't have a STRONG desire for that sandwich, but as it was the only vegetarian option, I was just glad it was there for me. It was edible, but nothing special. It might have been better if it were pressed, toasted, or at least heated up.\n\nMy latte came in a to-go cup. They didn't even ask me if I were staying or not, but I saw other people around me with cute mugs. I thought the espresso was decent, but a little harsh.\n\nMaybe bakeries just aren't my thing. I'm just so sad to have looked forward to this for so long, only to be let down by my experience. Now that I think about it, I did like everything; it just didn't live up to my expectations.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "Le Bec. Fin alums run this high end...(ouch) high quality bakery.  I went for apres sushi dessert on this snowy October Saturday(oxymoron)\n\nConsumed and bought:\nWhite hot chocolate w/ orange blossoms- $3\nTeeny linzer cookies- $.50 each\nChoc. chip short bread cookies- $2...ish\nCroissant- $3- yikes\nHalf a country bread- $4\n\nPrices are exhorbitant, but little BAKERY ELVES  bring out the gorgeous breads and baked goods.  Linzerish cookies are the best east of Salzburg and a bargain at $.50 each.  The white hot chocolate was a little bit of heaven on this depressing day.  Love that they sell half breads though at $8 a loaf it makes sense.  Other delectable stuff to try. Some baked love stuff here...yeast to oven...in the BK!", "author": "Franny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "This is a review only of the bread baked and sold at Bien Cuit. I hope that the owner or bakers read it, and use it to make needed improvements. Obviously this bread is top-notch in terms of ingredients, long fermentations, conception and taste. HOWEVER. The bread almost always has burnt crusts -- in particular the infamous long fermented Miche, which I have now given up on because of just how burnt it always is, but also the slightly less fermented Campagne. The crusts not only taste bitter because of how overcooked they are. They are extremely difficult to cut into slices. And Bien Cuit will not cut the bread for you on the premises. It claims to have no slicer.\n\nSo -- PLEASE stop burning these loaves. It ruins them.\n\nAnd PLEASE  invest in a slicer and provide slicing on the premises. PLEASE. \n\nI fully realize that \"Bien Cuit\" means well done, but that shouldn't mean as done as possible.", "author": "Steve Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Fantastic coffee \u0026 wonderful service (a little slow sometimes but with a smile). Great vibe. Clean bathrooms. Didn't rate 5 stars only because seating is a bit tough but nothing to do with service.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "My friend and I shared the regular croissants and pain au chocolat--both of which were incredibly buttery, flakey and tasty. I felt like I was eating straight up butter though which is how you should feel while eating a proper croissant I've heard. I probably wouldn't go out of my way to come here again but the croissant soothed my morning hunger pangs and it was a good place to chill with a friend.", "author": "Laura Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-25", "description": "My experience\nFrench baguette 2 of 5. Extremely hard. It was not late afternoon so it was not and old bread.  Wwlas  around  lunch time. Almost impossible to grab a piece by hand\nService 0 or 1 0f 5\nHot chocolate 0 or 1 of 5\nCroissant chocolate. 5 of 5\nSelection or variety. 3 of 5.\nThe place small like they know very well what they are doing. But it was my worst experience of restaurant/food/hospitality service during my 7 days in NYC.  We decided to visit this place based only on online reviews. I let them know it was my first  visit, expecting an explanation of their concept and main or signature products.  But nothing.   So, you see a lot of bread but nobody explain me the difference or characteristic of each.   I am fan of  bread, dough and all the process.   I was expecting details . But I did not even receive  a \"yes, today we have the following.   Xyz breads\".  It's smell great,  we decided to give it a try. I am used to French baguette, including the different version or derivatives .   I know it is crispy texture and that after some hours(depending on weather or temperature during preparation, how is the fermentation process, the water used for reverie, and many other factors) it turns extremely hard.    But in your display you should always have the real fresh ones. All are fresh, but I means those that  are crispy in the outside, light in the inside and that you can tear or cut a piece with your hand.  .    Getting into service and variety. I approach the counter, ask for  sandwich available in baguettes. The said none. The options where only like 4 type of sandwiches pre done and in about 2 type of bread and croissant.  And they never explained me the charactertistic of the bread selected for sandwich.  I want to confirm; i asked. You have baguettes?  Answer. Yes.   You have different ingredients for sandwich.?  Answer. Yes.    You can combine both and make a sandwich in a baguettes. Answer.  No we can't\n \nThey are many options to handle this,  the ingredients  are in front of us.  Expectation\n- sir, we can only sell whole baguettes. We can sale the entire baguettes, how many sandwich you want? .  And the remaining will be a great option for your afternoon snacks.    This option the commerce will sell an entire baguette + 1, 2, 3 sandwiches \n- sir; we can do this. Sell a baguettes and sale the equivalent of the ingredients for sandwich.    We cut the baguettes in the best way for you and you can \"do your own in the table\"\n\nBut sadly no option was offer.  So I still give it a chance. I had decided to take the train skip several breakfast place and make my own dream of a French bread market.\nI finally ask for a baguette, a chocolate croissant and hot chocolate.   I am not a coffee person, but their coffee machines, beans etc... look like big quality.    The chocolate was a joke it taste like a cup of milk with just a dash of cheap cocoa powder.  If you decide to serve cocoa powder at least  serve it \"strong \" or ask the customer how they like it.\nI still was expecting a great baguette. At the counter I told them I am planning to eat it here. Is possible to get it cut.  Yes sir, but it never happens.   So i was there with a hot none tasty chocolate and a baguette that was almost impossible to grab a piece by hand.  We sat for 20+ minutes.   The places was not crowed they saw us.  Never can back and offer to get it cut.  Or explain this our characteristic it will be great to combine it with butter.   Of course I know that operational cost are expensive so I was willing go pay for the butter.\nGuys. Not sure if this is your main location, your first business or if this is an international  business.   But being in different industries for many years one thing is for sure.  Your margin and sell are not in the bread buns, your business is in the side or additional products. Let's sells sandwich, let's sell the ingredients.  Or think outside the box. This customer is giving us an idea why we have 10 breads but only offer sandwiches on 2.   Last note.   Baguettes or similar bread are the main bread for sandwich and bread in Spain, Caribbean, south American and central America.", "author": "Al V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Best croissant ever. After a bite, tears will drip down your cheeks and make your espresso americano.", "author": "Jeong Soo K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Allow me to comment again on what a wonderful place this is. It's truly special. We went there over break and had such a wonderful time. When I think about the bakery scene in NYC it's pretty lame. I remember going to San Fran and just being taken back by how much better their offerings are. Look at a place like Tartine out there, if placed in NYC it would have zero competition.. What do we have? City Bakery? Bouley Bakery? Sure there is Grand Daisy or Sullivan but, they are limited in their offerings and they are not like places you are going to hang out in.. \n\nEnter Bien Cuit, the best damn Croissants in NYC.. You can't get a decent croissant out here. I don't understand the shape that NYC has adopted.. They are not like the classic croissants, they look more like these rounded calzone pastries or something.. The croissants at Bien Cuit as amazing.. They are crispy and flaky on the outside and the almond filling is so delicious..But my favorite part is how they allow the almond on the outside to brown up to a perfect crunch.. \n\nIn addition to the Almond Croissant we had a few other pastries and then ordered a bunch to go.. As well as their Pan Pugliese. Pan Pugliese is one of my favorite breads and this is by far my favorite version in NYC. I sliced them long and grilled them on my kitchen grill.. Served with vitello tonnato, served with carmalized onion and blue cheese, served with ricotta and prosciutto on a couple of different occasions.. Each person that tried it could not get over the bread.. It is just so good. \n\nWe last night, I made a broccoli soup and served the soup over a toasted bruschetta and used the last of the bread for croutons on a salad.. I was sad to see it go..", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "I loveeee this place across from my apartment. One of the best bread I found in the city, and the croissant are oh-so-good. The place has a nice ambient, a mix of people working and having social time. \n\nThe place is mostly jammed, especially in the weekend. The staffs are always nice, except when came over Wednesday night, the 20th of April. He was very rude and made a lot of clanking noise while was cleaning. Didn't even reply when I said thank you and I'm sure he noticed it.\n\nI hate to take out a star from the review, but I hope services could be improved.", "author": "Dita A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-15", "description": "Don't buy the bagette after 5 in the after noon . Too hard . Not good at all and you paid $4 .", "author": "Marc S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}