{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-11", "description": "Just say no. I ordered a bunch of pastries on here from Caviar deliveries after seeing the great reviews. Many of the croissants were burnt. They were no better than ordinary pastries and not that flavorful. I also got the Mexican chocolate cake which was interesting, but Bien Cuit was not worth returning just for this. Skip this.", "author": "Nancy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Items sampled include:\nMaple Yam Danish\nAlmond Croissant\n\nLocated in the Boerum Hill section of Brooklyn and now expanding as far as Manhattan I'd original heard about Chef Golper and his bakery, Bien Cuit, from a friend.  A relative of the extensively trained baker my friend, well aware of my predilection for pastries, suggested I should give the bakery a try, particularly for their almond croissant - an almond croissant that I can say without hesitation is the best I've found to date in New York.  Buttery yet crisp on the shell with an open and airy crumb substantial with custard-like frangipane yet not at all wet or sticky this is the sort of croissant that leaves you stunned - at least until you walk back to the counter for another because you were foolish enough to think you would share it with a friend (and end up ordering an equally impressive maple-yam Danish that puts even the best sweet potato pie to shame, as well.)", "author": "Michael U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "I love trying new coffee shops and was excited to try this one based on the rave reviews on Yelp (and also because this places promotes itself based on a joke of a one star yelp review \"coffee tastes like licking the wall\")\n\nI tried both the iced latte and a hot latte but both came up short in terms of espresso strength. It's a pretty weak latte and I should've taken the hint when the person ordering in front of me requested his latte be made \"extra strong\".\n\nThey were all out of almond croissants when I got there (430PM) so I was unable to try one.\n\nFor all you coffee heads, they use BQE coffee beans.\n\nI wouldn't recommend this place but if you're desperate for some caffeine, this will suffice!", "author": "Rena W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Their almond chocolate croissant... best croissant I've ever had? Not too buttery, with the perfect balance of crunchy and flakey shell with the tender inside. Every other croissant will disappoint me from now on. Luckily I live 15 steps from here (only thing keeping me away would be the calories \u0026 the $5 price tag). \n\nI'll be back with reviews of their other menu items!", "author": "Carol H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "I've been coming here on and off since the day it opened. Miche and most other breads are solid 5 stars, baguette - not quite: it lacks the contrast between crusty exterior and soft interior: the whole package is on a hard, crusty side. Most pastries are original, exciting flavor combinations. And croissants... well, mostly they are very good, unless, when they are too \"bread-y\". It has become more frequent, unfortunately. On the last 2 occasions they were also FLAT and bread-y, which is, like, a no-no in the croissant universe. May be the owners are too busy with a new Grand Central venture to supervise the croissant baking in Brooklyn? Please, train your Brooklyn underlings better, do not give them any slack. We rely on those croissants in the morning to set the right tone for the day!", "author": "Anna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "I'm really trying to like this place and want a place that has tables like here and Konditori across the street, has good coffee like blue bottle a block away, but has pastries like bien cuit. I wish I could take pieces from all of them! But the coffee here just is not good and it's so hard to get many of the pastries past 9am. \n\nAnd for a place this size to not have a bathroom? I was actually told to go to Starbucks! I thought the guy was joking but he says that's what he tells everyone!\n\nSo I guess I will have to keep looking for my perfect coffee place or continue buying food from bien cuit and bringing it to blue bottle and hoping I get a spot to sit", "author": "Jamie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "I love this place, it's always nice to have a french bakery at your neighborhood.\nTheir coffee is very good BTW.", "author": "Yael I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "This bakery offers a variety of French inspired treats. There are breakfast pastries like croissants that are crispy, buttery, and flakey. There are savory pastries like ham and cheese croissants. There are fantastic breads. There is EXCELLENT coffee. All of the baked goods are rich with flavor and baked perfectly in the French style. The coffee is tasty and well made. Good coffee beans are used. I love coming here!", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-09", "description": "Where to begin? This is the worst of Nouveau Brooklyn, over- and un-: overpriced, unremarkable, uncomfortable, and unpleasant. \n\nI have sampled croissants all over the city--they're simply one of my favorite things in life--and the croissants here were notably mediocre, and incredibly overpriced at $4 (and more) per croissant. \n\nTo the reviewer who wrote, \"the best croissants in America\"--is that a joke? It's incredibly misleading, and so incorrect as to be frightful. This is the problem with Yelp--you can't trust most people, as they entirely lack taste and judgment. New York is a great croissant city, maybe the best in the US, but I've also had worthy croissants in Seattle, San Francisco, Los Angeles, and Chicago (hard to believe, I know, but its true). \n\nIn New York, the best croissants are to be found in the bakeries located within what I call the \"croissant belt\": the 60s-80s on either side of the Park, with a few satellites downtown (e.g. on Ninth in Chelsea, near Sheridan Square, etc.) who are also true artists. I could list bakeries, but wouldn't that spoil the delight you'll experience when you yourself, on your own, happen into these wonderful havens of croissant-dom?  \n\nDo yourself a favor and avoid Bien Cuit--it is an impostor. This will be one of those New York purchases you instantly regret: \"did I just spend almost $5 on a shitty croissant? What would my mother say? What was I thinking?\" Etc.   \n\nOne additional note: never does service influence my reviews on Yelp: it just doesn't make sense! Who gives a fuck about the service? We're here for the food. I hate reading the reviews that say \"Sure the food was delicious but I'm leaving the restaurant a star because of the service\"--it's the damnedest, isn't it? And confusing, because it fuddles the star-ratings of a few excellent restaurants. When I review, I'm only concerned with the food. I will note, though, that this is the type of place that staffs and attracts unattractive, sullen, and impolite white people (ill-bred) on the verge of middle-aged-ness, slovenly when it comes to maintenance of personal appearance and hygiene.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-17", "description": "Bien Cuit is just getting worse. Downgrading based on three things:\n\n1. The croissants have gotten much worse. They used to be passable, better than many NYC croissants. Now they are mass produced garbage that somehow taste soapy. \n\n2. The bakers rage when asked if they could select a bread for me that is a little less Bien Cuit. He begins to lecture me about what a true baguette is and how amazing his are. WTF?! I can go to the bagel shop and ask for a light or dark bagel! \n\n3. The price. I need a 7-figure salary to shop here.", "author": "Gavin G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-10", "description": "Bien= \"Well or Good\" in Spanish\nCuit= \"Cooked\" in French\n\nA cute little hipster-ish coffeeshop/bakery is probably a gem in the neighborhood since this part of Brooklyn is not really hipster nor trendy at all. Staff are pretty friendly and seating is quite limited and the prices for the drinks are around $2-4.50 depending on what you get which is understandable. \n\nDownside are the prices of their pastries. I got myself an Americano ($3) and their Cassis (Blackcurrant) cheesecake and paid $10.89 in total. so I'm guessing the cheesecake alone was $6 with tax?? Don't get me wrong both their Americano and the Cassis Cheesecake were really good but paying over $6 for a small pastry or piece of cake at a coffeeshop put me off a little.", "author": "Old Fart M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "This place is so good!!!! They have really great baked goods and unique treats like a poppy seed croissant. Definitely worth a visit!", "author": "Mary A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-31", "description": "$3.25 for a burned, flavorless croissant. I know that bien cuit means well done, but this was a bit much. I had high hopes and am disappointed.\n\nAlso, it was a Saturday morning and the place was packed, especially the seating area by the front window. I waited at the front of the bar for seven minutes before being told my brewed coffee was at the side of the bar. The counter service had ignored my presence until this point. Being an observant first time customer, I was watching, waiting to see where my coffee popped up and when I didn't see it quickly, was trying to catch any of the three staff's eyes. This was a definite service fail.\n\nAlmondine in DUMBO is way better, in regards to good, french croissants and baguettes and friendly, fast service. If you can make it up to DUMBO, it's worth it.", "author": "Charlou M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "What can I say, it took to long for me to find this place.\n\n-Coffee is always amazing.\n-THE BEST PASTRIES IN BROOKLYN!!!! (I am not exaggerating)\n-Staff is kind, helpful and friendly.\n-The place is nice, clean, inviting and hip.\n\nI like checking out coffee shops that care about the coffee and vibe. Only when I love a place do I come back. This is one of these places. A real Brooklyn Gem!", "author": "Josh R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Hands down, my favorite patisserie in NYC. Delicious and creative pastries in a charming location with a cute little backyard.", "author": "Mary H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "Good coffee and a selection of pastries and little sandwiches. There's a nice little outdoor seating area thats nice to sit at, drink your coffee, and read or chat with friends.", "author": "Kaitlyn F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "CROISSANT. Croissant, croissant, croissant. \n\nI'm not going to be petty and dock this place a star just because it can't set up a conveyor belt into my mouth.\n\nI am reviewing this place as a bakery, rather than a café. The croissants are tender and buttery. You can mash them into your mouth and feel the flakiness slowly collapse, but not totally concede to the soft white insides. As for loaves, this is the only place in NYC where I may safely bring Old World natives to buy bread.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "I just bought half a loaf of multi-grain. It's 9am and the half-loaf is not fresh. It was baked yesterday. How can I arrange to buy bread that was baked the same day?\n\nAddendum: the owner states it's baked the same day. They should pack them in bags to retain freshness and humidity; nothing tastes fresh in this bakery, including the croissants.\n\nSecond addendum: I kept the Bien Cuit loaf in its brown bag, bagged in another plastic bag, bagged inside an airtight bag. It has kept its freshness for 6 days now and the taste is very authentic. It actually becomes more authentically rustic with time! So they are doing something very right.  So this review went from one star to 3 and now to 5.", "author": "Zalman R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "It's warm like a spring day. Yay, let's go on an adventure in Brooklyn! Since I was in the neighborhood, I couldn't do without coming here as they are famous for their baked goods. They have an interesting variety of eclairs (chocolate, grapefruit, pistachio). I had the grapefruit  (coriander cremeux, prickly pear glaze, pomegranate seeds, candied jicama and orange zest). Fruity dessert feels lighter for the belly. Their croissant are perfect, buttery, flaky, just like how they make it in Heaven. I believe that's where they got their recipe. And they are quite large in size. Now, I hope that I'll find myself wandering again in this neighborhood so that I can enjoy more of their croissants.", "author": "Helene C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "Come here for the croissants.\n\nThey have the best croissants - Flaky on the outside, soft and doughy on the inside. Perfection. \n\nStick with the plain croissant because the almond croissant is way too sweet.\n\nSandwiches aren't bad, but they are pretty tough and sometimes the baguette could be rock hard. There also isn't much inside the sandwich other than thin slivers of meat and cheese.\n\nCoffee is good, but I would stay away from the hot chocolate and other drinks. \"Homemade\" hot chocolate here is just chocolate syrup and milk that isn't fully mixed and pretty weak/light. It's more like warm chocolate flavored milk. In the summer they have fruit fizzes that sound amazing, but is just ok.\n\n+ Croissants!!\n+ Coffee\n+ Seating\n+ Accepts credit\n\n- Almond croissants\n- Hot chocolate\n\n5 stars for the croissants, 3 stars for everything else.", "author": "Katrina L."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}