{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-24", "description": "Wonderful pastries and very good coffee. Coffee that you can actually taste the flavor of coffee, which apparently can be hard to find. I was on jury duty near metro tech and decided to arrive early and walk around one of my favorite Brooklyn neigbs, Cobble Hill. Or whatever they call this section. It doesn't really matter to me, what does matter is the sublime nature of these croissants. I've had plenty of terrible ones, some good ones, and some great ones (Paris). These pretty close to greatness. Both the plain and the almond variety. My only complaint is that I live too far away to be a regular in the morning, damnit. But, if you're around this area then stop in this rustic looking place and grab a cup of good joe and one of their incredible pastries.", "author": "Will R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "They have the most beautiful artisan pastries display I've ever seen. I had their raspberry danish and it was gorgeous on the outside but pretty dry on the inside. Good thing their baristas are fantastic because I didn't mind its hardiness when washed down with a perfectly poured cappuccino. Pretty fair pricing considering the quality. Though they should offer an option for warming up your pastries.", "author": "Cherry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "Best tasting bread I've had!  Con is that they do not slice bread :P  Recommend coming very early for more selection.  Personal favorite is the Miche loaf which has been fermented for 68 hours!  They have great pastries that are not overly sweet.  Every thing is better enjoyed the day of purchase as they get a little stale the next day.", "author": "Sara M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-17", "description": "My husband and I went to Bien Cuit for coffee. The girl behind the counter was awful! So unpleasant - no smile, no hello, just stared at us until we spoke. We tried to find something affordable (4.25 croissant or 7.25 pastry?!?!?!). This is Brooklyn people! Coffee was terrible (my husband's iced coffee came out of a white stained bucket that looked like the kind you see at construction sites! How gross.) Mine had a terrible aftertaste. No \"thank you\" at the end of our odd transaction either. Too many other great places close by to ever go there again.", "author": "Aggie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "Maybe the best croissant in the City. The plains are always fresh out of the oven - perfectly light and crispy while not being overly buttery. I've also had the almond croissant which is one of life's great sinful pleasures - the thing weighs at least a pound but it's worth every amazing bite. They also have a variety of fresh loaves of whole grain bread to take home. Nice staff and good counterculture coffee. This place gives Balthazar a run for its money and is by far the best bakery in the downtown Brooklyn area if not the entire city.", "author": "James A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-06", "description": "I feel a bit shameful.\nI live between two of the best streets in BK, Smith and Court. \nI feel most of us who live between these streets pick one as our favorite, like the houses of Montague and Capulet. I was a Court girl. All of my favorite groceries are on Court; my laundry place, my bagel place and even my route to the subway but, one thing I didn't care for were the coffee places on Court. I was basically choosing between the overpriced and under-seated Cafe Pedlar and the overpriced and over-commercialized Starbucks. \nBut what could I do?\n\nThen one night, having had walked back from the G on Hoyt, I was forced down Smith in need of an IV pumping french-roasted caffeine (preferably in the form of a latte) STAT. \nWhen I passed by Bien Cuit. I was stumped. \nHow long has this been here? I wondered. \nI stepped in and was joyfully welcomed by a nice barista and given a lovely latte and then I was handed an Ipad. \nI looked around quizzically, I nearly asked 'Are we now at the point that with every latte you get a free Ipad?\" I mean it happened with Ipods, so why not Ipads? However he then told me to sign with my finger. Not only do they not have registers but, they have paper bags only and are ridiculously eco-friendly (which is saying something in this 'hood).\n\nThe latte was silky smooth and the perfect ratio of espresso to milk. I have since had the bread (get the half, the whole is a bit too expensive and the half is more than enough) and their croissants and all that I have had I have loved. \n\nThe icing on the cake though, for me, is the service. I sat for two hours, when I was the only patron, the barista let me be, like I was in my own private coffee house without being disturbed, pressed to buy another amazing cup or stared at to clear my table. Then when a line of people formed, he handled each customer with care and allowing them to take their time, while making sure the other customers were not antsy or feeling forgotten. \n\nI must say that, with such splendid service, delicious pastry and perfect lattes, I do not know if I can any longer be simply a Court girl.", "author": "Donna F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-12", "description": "Bien Cuit reminds me of Choice in Clinton Hill--quaint, on the smaller side, always bustling, and full of yummy smells and great food. I usually order to go since I come on Saturdays after yoga. I've had the hot chocolate which is thick and rich and is not for lovers of Swiss Miss--this is the real deal. The latte is pretty decent as well. I've yet to come in time for the elusive almond croissant, but the plain croissant was buttery and flaky (for once, a good thing!) and the breakfast sicilian really hit the spot. I should make more of an effort to stop by for their breads and other treats.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "I visited bien cuit on Saturday around 1 PM. The place was full but not packed.  I came from Long Island because I am a bread enthusiast and I am always on the lookout for new bakeries.     My main reason was to try their breads and pastries and bring them home for the guys to taste.  \nI liked their pain de compagne, however, I didn't see significant difference in taste with the multi grain bread (They were both very good though).  The pain au chocolat and croissant were outstanding and reminded me some bakeries when I was younger in France.  I would say that in terms of the bread, I still prefer Pain D'Avignon and Balthazar. Bien Cuit is a bit better with their pain au chocolat and croissants.  I can't say anything about the baguettes because they forgot to put it in my bag (though I paid for them).  The reason I give this place only 3 stars  is due to the service. I would even go as far as calling it arrogant.  The girl behind the counter was so annoying and uninformative that I almost wanted to leave (this is becoming a Brooklyn problem not only reserved with Bien Cuit).  To make a long story short, after she patronized me for  asking whether they would slice one of the breads and a bunch of other stupid comments about the breads themselves (she know nothing about them besides that \"this one is popular\"), she forgot to add the two (paid for) baguettes to my bag.", "author": "M R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-05", "description": "I had the Apple Cardamon Danish because I had heard that it was outstanding. It was a total dud it was hard and sorta tasteless.  Apples were not evenly distributed throughout the pastry. For $4.00 I really was expecting more. I went there on Saturday around noon so maybe that's why the pastry was hard but what about the taste?  I would like to try the Almond Pastries since those are my favorite but I will make sure that  it is earlier in the morning.", "author": "Dorothy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Hands down best croissant I have ever had. Been to France multiple times, and this place is far better. Espresso is really powerful!! My favorite baked good is everything.", "author": "Joey b b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-05", "description": "$4 for a ok baguette?\nIf they find des imbeciles to pay that price, good for them.\nI'll take the subway to Kayser instead.", "author": "Jl F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "Excellent food and coffee. Some of the employees are cold and condescending but there's a lovely young lady who runs the register (i.e. iPad)", "author": "Katie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "I am not from the area but had to stop by fedex nearby. This ham and Brie croissant is so good I had to yelp it even before I finished it. Cappuccino is really good too, wish I didn't spill half of it on my table lol.", "author": "Andy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-05", "description": "Went again, for a quick coffee and pastry recently. My coffee was nicely brewed.  The palmier like pastry with chopped pistachios was just ok.  Not mind blowing.  Also, does anyone really care that a coffee and pastry in a \"chic\" part of Brooklyn costs upwards of 8 bucks? Not sure I get the high praise for this place. I clearly haven't tasted the yelper koolaid.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Best bread in the tri state area.  Possibly anywhere.  The croissants are a religious experience.", "author": "Ed W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "This place is a delicious trip to Paris for your taste buds.  I highly recommend their poppy seed, pistachio pastry.  It's sweet and flakey without being overwhelmingly heavy.  Teas and chai lattes are also great here. And, a stop wouldn't be complete without bringing home some freshly baked bread.  It's a bit of a walk for me on a weekend morning, but honestly worth it.", "author": "Jeanette D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-11", "description": "This review is solely based on their customer service or lack of it.  I walked in on a Sunday afternoon to get a sweet treat after hearing rave reviews from a friend about how good their pastries are.  There was 1 person in front of me on the line and another 2 behind me.  There were 3 employees behind the counter, but only 1 person were actually servicing customers.  One guy behind the counter looked at me standing on line and smiled, but instead of asking if I wanted anything he walked into a back room.  A 3rd staff member was behind the counter busying himself with moving pastries around.  Hello people, do you not see customers waiting to get helped?  After 5 minutes of waiting and not getting a lick of service from any of the 3 employees I decided to just walk out.  There are lots of other bakeries in the area and I am sure one of them actually has staff that wants to do their jobs.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "Although on our way to dinner, my friend and I were stopped mid-step by the floating aroma of beautiful, warm, baked butter. Even with a full meal waiting, there was no hesitation to investigate further.\n\nThe small space was incredibly charming with lovely French jams and flavored salts, and, of course, fantastic looking breads and pastries. While tempted to take on a full pre-dinner baguette by myself, I better decided on the Pain au Chocolat. It was warm out of the oven and flakey and delicious. The chocolate was just rich enough and just sweet enough, perfect.\n\nI would never pass this place up if serendipitous fate brings me here again at the time  of fresh oven pull out. And while the the wait was a little slow, the staff was kind. The young father behind me ordering a pastry for his adorable son in fluent French was also a plus.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "As everyone says; it's expensive. However, this place makes one if not the best croissants in the city. Plain jane croissant is my favorite, though the ham \u0026 cheese was good too. The coffee is delicious to be sure. I've only taken things out so I can't really comment on the vibe.\n\nI can comment on the review of a previous poster who went in at the finish of a 5 mile run all sweaty; Dude, that shit's nasty! Get clean before you get in life you sweaty runner. Sorry about the sausage pieces in your bag, but really; you're a sweaty runner in line. Go shower first!", "author": "National H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "good morning brookly ny, i woke up this monring craving for a danish so i got dressed\nand headed over and i got there the first thing i noticed. Is the place looked liked it just\nhad opened. as i entered i saw no worker for at lease a minute or two. i still waited then \nsomeone finally came and asked may i help you. like usual my order never really change\nso i ordered my coffee and danish to go. as i reached in my bag for my wallet i lifted my\nhead up and notice the most disgusting thing that morning. i saw bugs crawling flying \naroung everything you can imagine. so i payed for my stuff and i was gone. got to the \ncorner and threw it in the trash. never will me nore my wife go there again. bad business.\nhonestly i miss the old workers dont like none of the new workers like that. bad customer\nservice but at the end of the day only can get mad at the people running that place. \nwhat ever happen to the maintenane, it use to be clean nothing like what i saw. no disrespect\nill never go back there again.", "author": "John M."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}