{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "For about the first time in a while, spouse had a non-acidic drip. Wow. Kudos!!!\n\nI had the macchiato which was decent, and definitely not one which woulda cause this place to be avoided in there  future. \n\nNice job.", "author": "Jakub W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "Amazing almond chocolate croissant! So flaky on the outside and soft in the middle. Would love to try their almond croissant sometime. Though it usually run out around 10 am", "author": "E C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "While every morning millions of Americans toast their monoglycerides- and soybean oil-infused food-like product that they think of as bread, I'm slicing into a wonderful loaf of Bien Cuit's campagne. This is bread, real bread. I sleep every night excited that the following morning I will be slathering a slice of that bread in some butter and eating it, with joy.\n\nUnlike Paris, you can't just walk out of your New York City apartment and find bread -- let alone good bread -- around your block. This is still New York, and you can find pretty much anything here. Bien Cuit is your answer to excellent bread.\n\nWhen you open the door to the bakery the scent of fresh bread engulfs you. You know you are in a little slice of bready heaven. While I'm there to pick up my bread I always end up getting the carrot and onion tartine. I also spend a few very happy minutes admiring the pastry display (and sometimes I eat one).\n\nTip: as someone who lives by myself, I always get a half loaf of the campagne, which if you use consume thick slices of bread daily, will last you three days. Keep it any longer and the bread's no good.", "author": "Premshree P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "I came here to taste some of their pastries and had an Apple Cardamom Danish and a Poached Quince Eclair. The Danish was solid, but a little less flavorful than I expected. The Eclair, though. I don't think enough good words can be said about the eclair. The filling was not typical pastry cream, but instead Pomegranate Cremeux, which was just delicious. I can't wait to come back and try more of their pastries that are a little different from usual. I also have tasted their bread from a grocery store and it's very good, but buying a full or half loaf at this point does not make sense for me.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Such a cute place! I like the interior just as much as I like the coffee/pastries here :) Wooden floorboards and minimal furnishings are my thing, and mingled with the smell of freshly baked goods and coffee is the perfect combination!\n\nGreat coffee, actually by far the best I have had in the city so far. I can only vouch for the croissants (I had the ham and brie filled one) but they were both top notch. I live in Astoria so won't be able to visit as much as I'd like to! \n\nP.S. Plus one star for the lovely and friendly barista.", "author": "Mellie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "This place has the best pastries in the USA, which are as close as I have found to what I love in France. Plus, the staff are always so kind and happy (must be because they are walking on delectable clouds of croissant dough :-) \n\nAdded bonus, the coffee is strong and there are some nice seats if you want to read or people watch or just enjoy your pastry.  The only bummer is that there isn't a toilet if you are staying for any long period of time (and also the reason I can't give it 5 stars, though it's close).", "author": "Hannah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "Just stopped into Bien Cuit to buy a baguette for tonight's dinner. I left with a chocolate croissant in tow and munched on it while I walked down the street. There have been numerous times in my young life when I've ordered a chocolate croissant only to find that I've paid for a lump of hard dough with a dollop of old chocolate inside. Not this time, my friends. The pastry was soft and buttery and the chocolate was rich and just melty enough. In fact, I felt like there was extra chocolate in mine, which made me feel very special indeed. If my baguette turns out to be half as good as the croissant, I will be a happy Brooklynite. \n\nP.S. It's places like this that make dieting impossible.", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Bien Cuit has absolutely amazing pastries. Even though I live in Upper Manhattan, it is well worth the trip!", "author": "Alyssa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "Bien Cuit offers some of the best pan au chocolat in the area.  They know it, and you'll pay through the nose for it!  Light, flakey and not overpowered by chocolate.  I'm with the cool aid man - ooooooh yeah!\n\nTheir lattes suck, however.  It's as if you're paying for warm milk.  Stick with the bread and stay ahead!", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "They make the only chocolate croissant I've had in the entire city of New York that's anywhere near as good as a European one: flaky, not too sweet, rich. Way, way better than Balthazar. Categorically better than anywhere else in the city. I don't know how they do it during those oppressive humid summer months when anything would turn to mush.\n\nEverything I've had here has been fantastic, though things aren't as good very late in the day as they are earlier. The prices are high, but the quality is really superior.", "author": "M G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Pain de mie is buttery excellence, which also helps it keep a long time.\n\nCoffee is a bit bitter and weak, but espresso is top-notch.\n\nI'm taking them down 1-star from my prior review because they've recently taken to overcooking all of their breads. Not only does that diminish the flavor, but it makes the crust a bit hard. Still quite strong, but I'd like to see them fix it.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Food is incredible but to quote another reviewer staff is \"a little hipster-y\"? Wouldn't be so bad if they weren't also almost comically self-important and unfriendly.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "Their bread is probably the best I have eaten -- ever -- including in Italy and France. The miche and rye/sunflower are my favorites.  It is sold fresh and still a bit warm (at least in the AM).  I'm not a fan of baguettes in general so I'll leave that alone, but the sandwiches they make with them are mighty fine.  Croissants of all kinds are spectacular.\n\nI find it comical that people complain about coffee and drinks, but the store could spare them the pain by not selling anything other than fabulously baked goods.", "author": "Pierluigi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "The best pastries in Brooklyn, and I'll arm-wrestle you over that.\n\nI occasionally buy a massive loaf of bread, thinking I live in Paris, and let it sit for  the week on my cutting board, building a hard crust.\n\nThe staff are very cool, friendly and  super mellow. Hours can pass in Bien Cuit, and I often find myself lost in conversations with friends before we see the broom.\n\nUnfortunately, I really don't like the coffee and have given up.\nIt's too bitter and not in the French or Italian tradition. I don't get it.", "author": "Kimi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Do you know how hard it is to find really fantastic bread in New York? Mouth-watering, crust-just-crusty-enough bread? It's not easy and Bien Cuit delivers completely.\n\nShould I mention their croissants? As I write this review at Bien Cuit, I hear three little children raving about the croissants. \"The ham and cheese is good but your plain ones are the best.\"\n\nThe  decor takes a narrow space and does its best. The staff is wonderful and kind. Plenty of room for laptop users too.", "author": "Sophie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "Love love love...did I say LOVE?\nThe best baguettes in the borough hands down! I really like that they have a basket of mini bits of their different breads by the register.  It has allowed us to try several of their other items including Raisin Walnut - dense, chewy and not too sweet and the Campange - yummiest sourdough! Also, a bite of their Miche was like being back at Poilane Bakery in Paris.  It's just sooo good.  The croissant are consistently good as well.  Other french bakeries have good days and bad days with their croissant, but Bien Cuits are always amazing.\n\nAdorable cozy seating area. Although you'd have to get there early to get one.  But who cares.  The smell of excellent coffee and fresh bread baking wafting through the air is wonderful.  I don't mind taking my goodies back to share at home.", "author": "Maria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Best spot for in the area to get your PSL fix. Be sure to pick up a croissant (especially the almond croissant if you're early/lucky enough) You won't regret it!", "author": "Mary O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "It's the best croissant you can find, at least in Brooklyn, just not to be very conservative. Yes, it's expensive, but hey, the \"you get what you pay for\"-law it's not a joke. A staple in the neighborhood. Never disappointing!", "author": "Luca A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "I would love to rave about bien cuit, the ambitious newish bakery on Smith Street.  It smells right, the air heavy with the sweet smell of yeast and starter.  The loaves look amazing, and, sometimes, they are pretty good - a really well developed crumb based on a long rise, a tasty crust, and good structure.  The best thing I've had here is the miche - the loaf is so big that their problem with crusts (see below) is minimized. \n\nUnfortunately, the baguette is such a disaster that it ruins all this.  The crust is way too thick, almost uncuttable even with my serrated bread knife.  It's also so thick that none of my guests recently were able to eat their chicken salad sandwiches.  And, this inedible baguette cost $4.\n\nOnce burned, twice shy.  I'll try the miche again.  Everything else I'm happy to leave.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Most expensive almond croissant in New York. (4.25+tax? thats a freaking bahn mi.) \n\nDo you know why? Because if you dissect that croissant, you will see the most gorgeous innards that you have ever seen. The highlight is the excellent quality of the marzipan. Its rich yet not overly sweet with the almond flavoring not too overpowering. That stuff is like golden jizz, viscous and glossy and nothing like actual jizz. \n\nI approve. I also approve of that lady behind the counter. She's awesome. \nI just wish it was a tad more affordable. Maybe if I was richer, and had a gym membership I would frequent this place.", "author": "Candice A."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}