{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Behind a non-descript storefront on a non-descript commercial strip (one-way street) in Carroll Gardens, you will find this very French bakery that was sent from heaven. Just a subway ride away.\n\nHoly mother of Pepe Le Pieu, this is seriously good. \n\nI had the apple cardamom danish.  It had crackily ends and was subtly satisfying. My wife had the spinach quiche.  Now that's what I'm talkin' 'bout. Rich, delicious and immensely wonderful, with a bit of a crispness in the crust that adds the bit of texture that makes it just about perfect. Sacre bleu.\n\nThe coffee is strong and good. A \"large\" is in name only, though.\n\nNot only was the food presented beautifully and look absolutely breathtaking, but the young lady serving wasn't too shabby either.\n\nMerci.\n\nWe took home a baguette in all its crispy crunchy goodness.  All of the breads on display looked phenomenally good.\n\nBien Cuit literally means \"cooked well done\" as in a steak. I would say well done, period.", "author": "Al H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "Location: Two stores down from Konditori and not far from the A train / within 5 minute walk.\n\nService: Everyone seemed happy and they were helpful. \n\nFood:  THEY SERVE FOOD!  Most cafes only have muffins bullshit that they get delivered from bakeries.  Not here!  At Bien Cuit they make fresh bread, pastries, and also serve sandwiches!   I got the pumpkin Latte with a goat cheese croissant.  They toasted my croissant and it was crisp \u0026 buttery. oh wow it was good.  The latte was on point too. Its hard to find a flavored Latte (outside of Dunkin Donuts \u0026 Starbucks) so I was glad to see the pumpkin flavor available. They did not use a syrup for their pumpkin latte either. It looked like pumpkin pie filling mixed into it.  The latte was smooth and had a rich pumpkin flavor but not too sweet. Just the way I like it. \n\nI will definitely come back here again and I am bringing some friends.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-28", "description": "Bien Cuit in French means well done, and this place lives up to its name. Everything is way too overcooked. I know that might be how the French did it before the Revolution when the average Frenchman was on the struggle-bus and hungry. \n\nBut France has changed alot in the past 250 years. People don't overcook their pastries anymore! Not even in the countryside. Bread doesn't have to be burnt. Also, what's up with New Yorkers paying so much for French stuff? Parisians overpay for 'American burgers' and 'brunch' so I guess it's universal to overcharge for foreign things, but $4 for a tiny pastry is a bit much.\n\nSo for me, overpriced, overcooked, overhyped. That said, I used to love this place before I took my French friend and she made all the complaints I wrote about. I'm easily swayed.", "author": "AJ J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "After visiting Bien Cuit, you'll never look at pastries the same way again. Is it possible to love something without even trying it yet? That's how I felt about this little bakery.\n\nTo preface this review, I have a short story...\nAs most of my family/friends know, I hardly ever watch TV. But when I do it's usually a show about food of some sorts. This brings me to my next point: \"Unique Sweets\" featured Bien Cuit on one of their episodes and whenever I watch these shows, I make sure to make a mental note to visit ESPECIALLY when it's close by. Just from the images and descriptions, I knew I had to visit.\n\nBien Cuit, meaning \"well done\" is certainly appropriate. All of the desserts here are carefully crafted down to the very last bite. Upon arrival, the storefront is simple/minimalist and reflects the rustic nature of the inside. Although its spacious, there isn't much seating to go around. I was there on a mission. My friend was cooking me dinner that night and I can never go empty-handed. So I asked the girl at the counter for suggestions (she was very helpful) and I ended up deciding on three pastries:\n\n-Huckleberry Danish with Yuzu Curd, Huckleberry Jam: Flaky, tart and very flavorful. Those berries certainly packed a punch. This was my wildcard if you will. It's hard to describe if you haven't had this fruit before, so take a chance on it. It's good.\n\n-Apple Cardamom Danish with Pureed Apple and Cardamom Strudel: Second favorite of the night. I'm a HUGE fan of apple desserts so this was a win-win. The unique pairing of flavors certainly works.\n\n-(The true star of Bien Cuit) Chocolate Almond Croissant/Twice-baked with Brandy: If you have to pick an item, CHOOSE THIS. You can thank me later. It's everything a croissant should be -- flaky, soft, buttery, nutty (from the almond paste)... you get the idea. And the fact that its baked in brandy? Say no more. It's a true showstopper. \n\nYes, Bien Cuit may be a tad bit on the pricier side. But I can guarantee the quality is there within every single bite. I hope you enjoy it as much as I did.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "Good place to grab a quick sandwich, pastry, or yummy bread to take home.  They have tables for two on the side.  My croissant sandwich was interesting and the croissant was the perfect crunch and flakiness.  They also had open faced sandwiches on nice bread for something lighter similar to food we ate in Prague.", "author": "Vanessa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "I am completely at a loss to understand the negative reviews. I have been here dozens of times and everything has always been excellent. They really specialize in BREAD - try the Miche or the Campagne. The croissants, pastries, and cookies I have tried have all been world class. I got a Christmas Stollen for the holidays last year which was very memorable.", "author": "Arthur D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Not sure how my wife found this place but we decided to have breakfast there this morning. All I can say is, I wished we had a gem that Bien Cuit in LA. Amazing baguettes and breads and delicious coffee. I was impressed by their selection of iced teas too. We will definitely be back again.", "author": "Manfred H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "This coffee shop has a good selection of breads and pastries, both of which I was able to try.  We were taken to this cafe during a Brooklyn local food tour.  I loved the interior,which makes sense because I love the whole style of buildings in Brooklyn.  I will say that the name of this place means 'well done' so the exterior of all the pastries is a bit more crunchy than I'm used to, but I liked it. I had no expectations when I came in, so I was delighted  that they had sourdough (Californians love their sourdough). The shop is a bit tiny, but that is likely out of their control. If you take their pastries home, know that they are still delicious one to two days later.", "author": "JADA s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Bien Cuit\nNY: Brooklyn: Cobble Hill\n1pm Monday 11th May 2015\nFour Stars\n\nI had an excellent \"Well Done\" Ice Coffee.  They proudly serve \"Joe\" Coffee.  I really like when places have their own customized cups.  There seems to be a correlation between nice cups and good coffee. Maybe it stems from caring about your product.  I mainly chose this place because it was Air Conditioned.  There is relatively limited seating but I found a place to settle in.  There are 3 two tops by the window and four or so two-person tables along the side.\n\nThe place only gets four stars for the moment.  However, I will have to return to try their pastries and other fares which looked amazing.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-10", "description": "Just ordered an almond croissant to go and it was burnt to a crisp. Surprised they would even bag this up. I wish I had looked at it in the shop before I left. Super disappointing because the almond filling was delicious. The rest of the croissant was so burnt, I could barely break it in half.", "author": "Kathryn L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "We went for breakfast. The place was really crowded and we had some problems to find a table (they have very few tables).\nThe coffee was good, it took them quite some time to make it but nowadays it has become the norm. \nThe bread was super-good. We got a small baguette and the onion bread. They were divine.\nThe pastry we got (a danish) was more forgettable. The filling was good but the pastry was too heavy for a danish.\nAlso, all the savory sandwidches looked really tasty.\nOverall, a good place for a good breakfast but not so relaxing because it can get easily crammed.", "author": "Luca R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-30", "description": "Came here to try out their almond croissants because it's my mom's favorite pastry. They did not have any, only the chocolate almond croissants. Got one of those and the almond poppy seed one. I would not recommend the almond poppy seed because it's more like a brioche roll than it is a croissant. No layers or flakey anything. Minimal almond filling. Could be good for someone who wants more of a brioche roll. Chocolate almond croissant was tolerable. The croissant itself was flakey. The almond paste/frangipane was ok but it was too runny and too sweet. They should be more of a paste than oozing almond+sugar. But if that's your thing,  you might enjoy their pastries. \n\nBreads were great. Hearty olive loaf to go for lunch later. Spectacular.", "author": "Lilee N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "I got there around noon hoping to get lunch, but their little open-faced sandwiches were all over $7 and not very impressive. I ended up getting a peach ginger macaron cake ($9), which was pretty tasty.\n\nPros:\n- Cute interior\n- Pretty desserts and lots of different bread loaves for sale\n- Relatively cheap coffee\n\nCons:\n- Lukewarm service, though the cashier was very nice\n- $7.50 for a small open-faced sandwich with only a few toppings :(", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "A good place to get ripped off on burnt and stale bread. Based on my purchase of sour dough bread, croissants and chocolate croissants. My opinion to the bakery is that if you're gonna have this double edged sword meaning of \"bien cuit\" as your moto, you absolutely must deliver the inside of your bread fresh and soft!", "author": "Jina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Great pastries, breads, and coffee at Bien Cuit. Service is...pretentious, sometimes downright rude. But everything they have is fantastic.", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "I had been meaning to try Bien Cuit ever since I attended a FIAF French Dessert talk featuring Zachary Golper months ago, and was finally able to so last weekend. For those who haven't been, this sleeper storefront packs a mean butter waft straight to your noise the second you open the door. There isn't too much to choose from so early in the morning, but your giant breads and amazing croissants were definitely ready to eat and or take home. \n\nI would skip the APPLE CARDAMOM DANISH. It was my pick when I was there, but it wasn't as magnificent as their super flaky ALMOND CROISSANT that my boyfriend decided to try. If you happen to stop by and those chocolate buckwheat mini cakes are still available, JUST GET IT. It's so moist, so chocolatey, not too sweet and has the most delicate touch of salt that just knocks your socks off.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "Seriously impressed by this place! only been there once - hence only 4 stars, I might be back to get them that 5th star ;)\n\nI was in need of a quick and small snack before entering the jungle of Trader Joe's on a Sunday at 4pm: Bien cuit had *exactly* what I wanted: savory tartines!! I got the salmon one: the fish was flavorful, the veggies were crispy and fresh, the bread was crispy and tasty, the whole thing was great. The coffee was also delicious (I got a cortado which they made to perfection imo). \n\nThe place itself is nice, bright, and not too busy although it is quite small. Their pasties also looked really good and I'll definitely need to check them out next time!", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-29", "description": "Ambiance/decor-4\nService-5\nFood-3\nStrikeouts-1/3\n\nCame in expecting an assortment of pastries and wasn't disappointed. They are known for their bread, but I was in the mood for their pastries which is supposedly baked daily.\n\nThey have two flavours in the fall category and I chose the fig Danish. For a Danish, it did not taste fresh, sweet or soft. It was actually pretty tough and rather bland taste. This is my first and only strike. \n\nI really wanted to give this place another chance so I went to buy their tart. This was a bit more expensive ($8) than I would have liked spending on a tart, but it was really well done. It wasn't too dry and it kept it's form when I was eating it.\n\nOverall, based on two desserts, an average place. Can't say it's worth coming Across down to come, but if you're in the neighbourhood, definite drop by.", "author": "NimbusExpress N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "The perfect french bakery/café you want to have in your neighborhood with the best pastries, baguettes, and great croissants and breakfast pasteries.", "author": "Natasha N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-18", "description": "Sad to say this was a very underwhelming trip to Smith street in Brooklyn. Perhaps the breads are much better, but I did not try them based on the mere look of them...that being said, the pastries were lack luster and over-proofed. Not even enjoyable enough to finish. Poorly executed sandwich on a stale baguette which was heated slightly in a microwave. I don't like to write negative reviews, but please! Someone step up the game here.", "author": "James B."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bien Cuit", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "120 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/YPU9GDbfkFx7fisR2ZL8Wg/ls.jpg", "@type": "Restaurant", "telephone": "+17188520200"}