{"aggregateRating": {"reviewCount": 31, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-16", "description": "Not quite what I consider \"ghetto Chinese\", given the neighborhood it's in and the lack of mumbo sauce, but serviceable for a quick meal that's not going to blow anyone's skirt up.\n\nThe prices for the combo meals are decent and for $7, you're full and happy. Fluorescent lighting is off-putting but probably earth/power bill friendly.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-14", "description": "There are two types of bad Chinese food. \n\nThe bad Chinese food with the thickest sauce and crispiest chicken (to disguise that it very well might not be chicken) that is so bad it's good and that is almost always better as leftovers. \n\nThen there is the bad Chinese food with soggy lo mien, bland cabbage to make up for the absence of vegetables, chicken with sauce that may have come out of a jar from the local key food and is accompanied with the feeling to up-chuck everything in your gullet the moment you come up for air.\n\nSadly, Chung Hing met the latter criteria but, being the fair person I am usually not, I left a bit of my portion in the fridge to see if maybe it was better as leftovers (as so many Chinese dishes are). Unfortunately, it seems the normal process did the reverse to Hing's Chinese as the moment the leftover General Tso's hit my tongue I knew these would sadly be a meal my toilet bowl would remember. \n\nUgh, I would feel bad for writing such a review if I hadn't just spent the last few hours vowing to never eat Chinese food again. Then again, Christmastime will come and us non-believers will have only one option before heading to the theaters...", "author": "Donna F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "Probably the best bet for chinese takeout in the neighborhood. The food tastes much more authentic than my regular go-to. The general tso's chicken was not goey like some places tend to be. Felt a cold coming on and their hit and sour soup helped clear me up, I will definitely be switching!", "author": "Jackson C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "This place is good old-fashioned Chinese take-out. It even comes in white paper take-out containers. Broccoli was crunchy and not over-sauced and the boneless spare ribs made my kids happy.", "author": "Kristin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-11", "description": "Chung Hing is you typical quickie, hole-in-the-wall Chinese take-away spot  -- despite tables, you really wouldn't want to eat in -- with no real surprises on the menu, or in the posted food photos... I scored fried pork dumplings, and a small order of chicken in black bean sauce with brown rice (for a total of $9.50 with tax). The dumplings were done perfectly and not too greasy, while the chicken in black bean was good, but not exactly mind-blowing.\n\nBoth the dumpling order and \"small\" entree were massive, so budget-wise, this is highly recommended.", "author": "Lee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Chung Hing is the best take out style Chinese food in Brooklyn Heights, CObble hill, and Carroll gardens. Their sesame sauce is AMAZING. Prices are great. And the woman who runs it is on point. I used to go to Golden City on Henry, but now that its closed CH is the way to go.  The sesame bean curd is the shit. So is the sesame chicken. \nDo not listen to all these so so reviews. I LOVE Chung Hing!\n\nOnly problem is it doesn't accept credit cards, but that's because they know people will eat there no matter what.", "author": "Hilary B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "I think this place is 1 of the best take out places I've been to in a long time. The prices are great and the food is delicious!!! I'm new to downtown Brooklyn and I've had some BAD Chinese food. But this place is really good.", "author": "Pamela H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-14", "description": "They'll deliver faster than you can hang up the telephone.  Their portions are enormous, and you can easily get more than one meal for $7.  Cans of soda are only $1 if you're into high fructose corn syrup mixed with caffeine.  The food is nothing to write home about, but it'll do the job when you want lots of cheap Chinese food and quickly.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-21", "description": "Re-reviewing because I made the apparent mistake of going back and it wasn't as bad as I said before.\n\nI think I actually ordered the same food as the first time, but this time it was palatable, and I didn't get sick. All right. There's something to be said for greasy Chinese right around the corner.", "author": "David L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "Doesn't seem like much has changed since the first review 2 years ago.  Chung Hing is still standing.  The portions are huge and the prices cheap - 7 bucks will feed me for 3 days - pretty impressive.  I'll be back considering that there really are no \"great\" Chinese take-out places in the area.  At least here you get some bang for your buck.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-12", "description": "This is your typical neighborhood Chinese joint. The food isn't bad but it isn't great. Nothing's unique about it but the portions. I get two dishes and I eat for a week.", "author": "Albie L."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Chung Hing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "157 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8WhGjDEnHBPvRUzCzoMHwg/ls.jpg", "@type": "Restaurant", "telephone": "+17186255870"}