{"aggregateRating": {"reviewCount": 31, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-10", "description": "Live in downtown NYC and can't seem to ever find good ol no frills Chinese takeout.  There are a couple of sit down restaurants you can take out from but most are expensive and don't give good portions.  Otherwise I can't find decent Chinese downtown.  Decided to hop on the subway a couple of stops and pick up food at Chung Hing in Brooklyn.  Had chicken and broccoli, white rice, roast pork, and beef mei-fun.  Entire meal was inexpensive and delicious.", "author": "Ross G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "What you want!  \n\nMe: Umm.. sweet and sour chicken with fried rice with egg drop...\n\nWhat fried rice??! (Making annoyed face at me)\n\nMe: ...soup.  The fried rice that comes with lunch special\n\nYou have to say pork!!  Pork fried rice!! (Shaking her head at me)\n\n------------------------------------------\nReview:\n\nService:  see above transcript\n\nFood:  soup is sour and flavorless.  Sweet and sour chicken only has a small bit of what appears to be chicken( I had to use zoom and use macro mode on my phone to capture the bit of chicken). Fried rice is just steamed rice with yellow food coloring.\n\nCleanliness:  cashier was handling money and preparing food at same time without the use of glove.\n\nValue:  not great considering the abuse.  Without abuse it would be excellent.", "author": "John C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-17", "description": "We have ordered here a couple of times but the food is just not good. They are also not very generous with their proteins. It's a shame.", "author": "Elle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-07", "description": "Oh, Chung Hing. On the hunt for some lunch and having to pass through the UPS store, I opted for Chinese. This place is definitely a no-frills type of place with only a few tables for those who do not wish to order take out. \n\nThe service was fast but the friendliness stopped once I asked for BBQ sauce. The woman at the counter said it will cost an extra $1 (For BBQ sauce?). I was very skeptical about this upcharge and was wondering whether it was because I looked new to the neighborhood. Turns out, I was correct. I called the place less than 5 minutes later in my best Valley Girl voice asking for the same exact thing and for additional BBQ sauce. My price quote was 50 cents cheaper. \n\nThe food portion was okay for 1, filled me up, and the food was good for the most part but I will not frequent a place that tries to steal my money.", "author": "Steffi J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-25", "description": "Food is just ok. Cheap. Ordered Chinese ribs tonight.  They were so hard you couldn't eat them. I called them and they promptly sent me another order.  Same thing.  Hard. They have been slowly going downhill. They cut the amount of meat in there dishes also", "author": "Hettie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "The employees at Chung Hing have a deal with the guy that loiters outside hustling for food and they take a cut of whatever he scams you out of. When I agreed to buy him food, he took me inside and ordered something (he said just \"a large\" to the lady taking orders) and I was charged $24. When I walked by 30 minutes later, he was chatting with the security guard of the restaurant and still asking people to buy him food. Another lady was questioning the employees about his food and told me she paid $22 to buy him food that never arrived. Disappointing", "author": "SK S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-13", "description": "Purchased food from this spot a few times, only because I'm in the area, pressed for time and I always buy the same dish, since I am a bit leery about fast food in general.  The workers who take your order always sound like they're in a rush, even when you're the only person in the joint ordering.  I guess it's because during the peak lunch hours they probably get a lot of orders called in and folks coming by to get their grub on.  It's definitely a local spot that is in need of cosmetic upgrades but overall it's ok for a quick bite.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-12", "description": "Not so great. I had the General Tso's Chicken, spare ribs, and a few other things. Nothing was really good, except for the egg roll. The egg roll was the best part of the whole meal; everything else could use an assessment by restaurant management. The ribs were covered in a jello-like sauce and were riddled with bones and fat. The General Tso's Chicken did not taste like the typical General Tso's Chicken at all; it had a different flavor all-together. \n\nI have low standards for Americanized Chinese food, but this didn't meet the mark at all.", "author": "Albert A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-10", "description": "Not the best :( they put too much corn powder, so the dish and soup are all tooooo sticky", "author": "Wen-Ni C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "Working on set. Decided to go here during my lunch break. Chicken and brocolli was descent. Service was good, prices were fair.", "author": "Billy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-15", "description": "I'm from the WestCoast and when I was in Brooklyn recently, I just had to get some NY style Chinese food I was craving. \nChung Hing didn't disappoint me, I had the Egg Foo Young, and liked it. The food was fresh, tasty, a good amount and when in the area, I would certainly go back.", "author": "Gerhard W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-16", "description": "Your typical local, down the street Chinese food take out. Nothing unusual at his place. Not bad and not great. Your a average takeout joint.", "author": "Felix K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "I don't know you change new chef or not, my order  look like shit, broccoli beef broccoli is too old, Hot and SourSoup sometimes too sour sometimes too spicy,I just want to give your opinion Check every meal before you Delivery，if not you will lose a lot of guests, I give to you 3 stars because your cashier she service is very good.", "author": "VanNess W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-07", "description": "I have a pretty high tolerance for bad Chinese food, but the lunch I had recently was inedible.  The wontons in the wonton soup were thick and gummy, the fried dumplings exploded with grease and the shredded chicken was bright orange.  The rice was the only decent thing.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "I ordered takeout for the first time from here and am very impressed (I am Chinese American and have a pretty good taste for Chinese food). Ordered the mooshu pork and it was ready very quickly.  Good sized portions.  Good prices. The food was well cooked and seasoned and they don't add msg. I would not recommend dining in though they have tables there but would definitely recommend this place if you are in the mood for Chinese takeout.  I will definitely order from here again.  They have the standard menu of hundreds of items!", "author": "Spencer L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-05", "description": "If I can give this place a negative star I will. First off made a order for delivery I ordered chicken with Broccoli and that came with no sauce mixed in instead I have to mix it myself next they gave me no plates or forks which means now I'm literally eating from a bag to lay it out. Then I ordered chow mein which came back looking like chicken noodle soup idk what the hell they did but the whole order was messed up they sent the delivery man back only for him to take my chow mein and not come back it's been almost 3 hours since he last came so I know he isn't coming back I call the restaurant and they just hang up on me not saying anything. So this place gets a big F and a U cause they really gave me garbage to eat. Never will order from this place in my life again. I warn you stay away it's horrible the food is bad and the whole ordering is bad. They didn't even attempt to fix my order all they did was just take it away smh and you expect me to pay for that ?", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "This is very solid Chinese takeout. You're not going to find better in the area. As a matter of fact, this is the only place to order from, as everything else is gross.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Almost two hours and still waiting for our food - we were told \"they got busy\" and then the woman hung up on us.  No \"I'm sorry\" or anything.  Awful!", "author": "Laura P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-26", "description": "Pretty much what you see is what you get - typical take out place.  I was going to give them a 4 star rating because they are always efficient and the food is good.  However, when I was eating lunch there today, a solicitor came in and they didn't make any effort to get him out.  i mentioned this to them as I left and just got blank stares.  in my opinion, the proprietor of a restaurant should not allow solicitors to come into their place of business and annoy paying customers while they are eating.  Just my view", "author": "Carl E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-26", "description": "Standard Chinese takeout place in Cobble Hill.  It's serviceable, but the food is pretty greasy.  If you're looking for cheap, easy Chinese food, this place will work well enough, but nothing special here.", "author": "David F."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Chung Hing", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "157 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8WhGjDEnHBPvRUzCzoMHwg/ls.jpg", "@type": "Restaurant", "telephone": "+17186255870"}