{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Had a wonderful experience. Location was cool. Our waiter Segundo was on point. Food was hot, and delicious. Definitely recommended others to go there", "author": "Barbara A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-07", "description": "Waiter knocked over drink kept messing up order and got the credit cards mixed up at the end .. food was good though. But ill stick to the city claw daddys lol", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-21", "description": "Went here last night, 1/20/19, and had a decent experience. The food was good and the adult capri sun, coconut flavor, was tasty. They were playing some great throwback tunes over the speaker that had us jamming in our seats. We had the cajun wings as an appetizer, they weren't that good....lacked seasoning. It was also kind of cold in there, we were close to a window and had to keep our scarves on. Also, our food got cold rather quickly, maybe due to how close we were to the window. Service: the hostess was very nice and engaged us in conversation. The waiter however, wasn't very personable, just took our orders and brought us our food. No check-ins. Anyway, overall I had a pleasant experience and will retun", "author": "Peg L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-02", "description": "Soo yesterday my friend and i had reservations at 9:45 .. got seated on time waited for our food but when the waiter gave us our food he didn't even ask what sauce or know which sauce was for who so our food gotten mixed up .. then when i got home i threw up all my food (and no it wasn't from any other food because i was preparing myself to enjoy a delicious meal at the restaurant ).. also this happen to another couple who came earlier .. so i don't know if the sauce was old or what it was .. but I'm very disappointed.. a downgrade from the city location .", "author": "Kari C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-24", "description": "I've been to claw daddy's several times and I'm usually thoroughly satisfied however today it was very lack luster. The crab tasted like it was boiled in saltless water and the seasoning was just thrown on. My friend barely got any sauce on her crab legs. Very disappointing visit, it's usually 5/5 due to their consistency however today was very dissatisfying.", "author": "Lynda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "I love the ambiance and the food is just amazing!!! I have been to both locations and the service as well as the flavorful meals are the same. Truly a cool place. Will be going back.", "author": "Kareen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "Love the adult capri suns and the claw daddy's special sauce  the waiter also gave us 2 free cajun fries for checking in on yelp", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "Been to both the Brooklyn location and Manhattan. Great music, fun atmosphere and amazing food. I've had everything on the menu and it is all delicious. Great place to bring family and friends to enjoy fresh seafood boil, garlic noodles, chicken wings and lots and lots of adult Capri Suns! Always 5 stars :)", "author": "jane p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "I love this location me and my friends frequently come in for a quick drink and some good seafood if you're ever in the area check it out and our server segundo is the best", "author": "Nancy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "Well first of all, I was very disappointed with the fact that the restaurant is very small. We were seated at an area and when I asked to be changed to another table i was told that the table was reserved but I had a reservation as well. Anyways we were seated by seguvo, and he was very pleasant. He made us forget abt the horrible seating. He's very sweet and understanding. He was also very patient we us as we were indecisive with our choice of meal. I will visit again only if he's our waiter. Overall it was good. The food was to die for. Adult Capri sun was A1.", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-20", "description": "I've been to claw daddy's in the city. The crab legs are usually good, but I was a bit disappointed with his evening. The crab legs themselves weren't flavorful. You HAD to crack it and dip it in the sauce it is prepared in to get some flavor. Otherwise, my appetizers were good: Buttery Garlic Shrimp, Cajun fries, deviled eggs. The dream adult capris up is also delicious. The environment was cleanly and service was great. The food was served very fast.", "author": "Chantel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "The best seafood ever!!! The service was nice and the food was delicious. My friend from Europe was shocked about how nice the restaurant was.", "author": "Pierre H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-17", "description": "I came here to with family to celebrate my birthday. I was super excited that I no longer had to travel into the city to visit this restaurant for some seafood and the much anticipated \"adult capri-sun\". The location was great, previously it had been a neighborhood diner that I had visited maybe twice and was happy when I thought that something else with better quality food had taken over the property. To my dismay, I was wrong. We ordered quite a few things off the menu and most were disappointing. The garlic shrimp was tough, overcooked and lacked flavor. The crab cakes were burnt, mushy, and meh..the lobster roll came to the table and the bread had been toasted for far too long, it was hard and brittle, almost with the stale feel and taste. The wings were fried a few times too many and lacked the \"kick\" and flavor we were promised. The worst tho, were the crab legs. Cold, fishy, and flavorless even when covered in the claw daddys special sauce, which was mediocre at best as well. The best thing about this place was the sauteed corn (which was a little salty) and the adult capri suns. It's a cute look, but if you want quality seafood, I'd skip this place. I had better food at the boil. 3 stars because I'm feeling generous.", "author": "Jen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "What an amazing concept. The food is amazing, flavours were really delicious and the staff were really good (well deserved 21% tips). As an European visitor, a concept that could work in Europe. Top Stars and a must visit!", "author": "G G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "The server Segundo was very friendly and personable!! The food was very good! I would definitely come back again!", "author": "Felicia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "Claw Daddy's Happy hour is the best I love the Wings and I love the Snow crabs and Shrimp the drinks are good and the service is great also. We go to Claw Daddy twice a month", "author": "CheecheeitsMe N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-23", "description": "You can't make a reservation online because it tells you to call but the number does not allow you to speak an employee. It's alil ridiculous and I find it hard to believe that the hostess can't handle answering a phone n seating ppl at tables. I've seen it done many times at the LES location.", "author": "Sasha L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-06", "description": "Honestly, the food is amazing. I've been going here for awhile and my last experience was very distasteful, that I'm not even going to go back to this specific location (3rd Ave, Brooklyn). First they said there was a problem with my choice of payment (debit card); which I've used at this location before. I was forced to take out cash, and when i gave the money to the waiter, who wasn't even serving me but still brought me my check, he came back to me with all the money i gave him + my change; which was weird. Instead of bringing me just my change, he brought me back all the money for the bill and explained to me how much he was giving me back. (Doesn't make any sense) he comes back after I'm getting ready to leave to tell me he doesn't have all the money; keep in mind when he came back with my change he showed me he had all the money. It was just overall embarrassing and very distasteful.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-30", "description": "Just to begin, the crabs were good and 1lb was plentiful. The crab cakes are awesome as well as the jambalaya but if you're hungry the jambalaya is a tease.  It should be on the appetizer list not the full menu.  They have a cute Adult Capri for your drinks but my drink was non alcoholic iced tea which was flavorful but included a price of $6.00 and NOOOO REFILLS!!!  Being seated was a chore. We had a reservation and decided to do a walk in as well at approximately 8:00 pm. First issue, they entered the wrong number.  It was corrected at 9:00 pm while our reservation was at 10:30. We were seated at 10:15, not acceptable.  We were a party of 3 and seated at a table for 2 near the steps and an exit door.  To say the least, think about the space and where food will be on the table.....not conducive to a dinner out for three meals on a table designed for two!   The second issue was the location of the table. The staff utilizes the nearby door for trash. During my dining time this door was used at least 4 times which caused an extremely uncomfortable chill!! Amidst winter and while chowing down on my crabs, I could not transition my coat on and off. This was an uncomfortable situation and did not enhance my visit.  Although the crabs were okay, the dining ambience was totally unacceptable and the reason for my low rating.", "author": "Nor W."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}