{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-31", "description": "This was my first time going here for a \"Girls Night\"  I must say I really enjoyed myself. The food was delicious! The atmosphere was great, we had the best seating. Kudos to our waitress Antoinette, she was very professional and very sweet, and extremely patient because I couldn't make up my mind about what to order. I loved the \"adult drinks\" that came in a pouch.(my favorite was the Sweet Georgia) I order the \"Boil Shrimp\" with the corn on the cob and potatoes. The food was very filling and flavorful. My only issue is that I wished they cleaned the shrimp better and cut off the heads. I would definitely come back to this place!!!", "author": "Kisha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Great food! Would definitely recommend. It was a lot and not expensive!\n\nWe got prawns and they were awesome, and they give you refills on drinks. Definitely good if you're with a lot of people.", "author": "Oscar P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "Delicious per usual! Im always nervous to try the second location of any restaurant chain when the first is amazing but I gave it a shot. \n\nI got my usual grilled oysters for an appetizer and then crab legs \u0026 shrimp in medium claw daddy's sauce. \n\nWhile the food was amazing the other location is still slightly better but this one isn't as crowded so either work for me. \n\nAlmost deducted a star for the horseradish sauce which was very bland.", "author": "Ashlee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-11", "description": "The food was really good; however the service was extremely slow. My friends and I were seated about 7:12 and the waitress came to our table about 7:20 we put our orders in for drinks and appetizers, we didn't receive them\ntill about 8:00. Not blaming the staff it's entirely managements fault, hiring more staff could help that issue. Other than the wait, I enjoyed my time at Claw Daddy's.", "author": "Jessika W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-22", "description": "You must visit this place if you like spicy and fresh seafood. We have been there for twice and the combination was of seasoning and spicy source is perfect. You may add corn and sweet potato fries for inside of shrimp and you would know that is great in a sec. lobster is amazing and try adult caprisun \nStaffs are great and friendly", "author": "Haris T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-26", "description": "Claw Daddy's was my son's choice, he wanted to go for his birthday. The restaurant itself is very nice good ambience nice decor. My husband ordered the lobster roll it was very small for the price but good overall. We went during happy hour so the oysters were only a $1 each. They were very big and very very fresh. I ordered the crab legs with the claw daddys seasoning it wasn't my favorite seasoning but that's just my taste, it wasn't bad just wasn't crazy about it. I can't say enough about the service our waiter was very attentive polite and knowledgeable about the menu. Looking forward to going to the Manhattan location to try some crawfish", "author": "Myling M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-09", "description": "It's alittle over priced but still it's not bad . oysters are very fresh \u0026 so are all the sea food there .", "author": "Emily W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "Food and drinks were excellent. I posted a picture of our food on FB and all were The drinks were tasty and packaging was unique. We took advantage of the Wednesday special. . I will be back!!!", "author": "Brenda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "Fun, down to earth, relaxed vibe. The wings were crispy and the clams were buttery and delicious. The crab was easy to pull from the shell so you know it's fresh. Got the house wine and it got me tipsy! Fair price point too. Oh, and presumably the most under-rated factor about this place? The staff genuinely seems to like working there. They clearly also like their manager which I think people appreciate. \n\nI'm coming back for sure, and I think you should too. With a group perhaps.", "author": "Nick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-29", "description": "Went for clawfest, which was great! We had 2 bags and some fries. Decently seasoned for some NY boil. Definitely would return, but only for clawfest.", "author": "Nayah H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-07", "description": "I give claw daddy's 3 starts ONLY because I don't like shrimp with the head on (I completely hate shrimp with the head on) I don't want my food looking at me. I like the food, it was well seasoned. The drinks weren't anything special but it does the job lol. I would recommend it.", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "Finally, Brooklyn has its own Claw Daddy's location!\n\nI had dinner and drinks here with my friends and had a really good experience. \n\nThe food was delicious; amongst us we ordered the steamed crab legs, po'boys, and the crab cake bites. \n\nOur Adult Caprisuns were on point as well - kudos to the bartender!\n\nI will definitely come back soon and take advantage of their happy hour!", "author": "Chanell H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Whooo Wheee! Just go and be satisfied!!! If you're into tasty crustaceans this is the place!", "author": "Lorenzo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "This is was my first time going and it was amazing! Be mindful that the food is spicy so if you really cannot handle spice you definitely should opt for mild(which is still slightly spicy). Everything was perfectly seasoned and the adult Caprisuns were definitely yummy. I definitely plan to return soon!", "author": "Symone P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "This place is the great. Happy hour is the best with $7 adult caprisuns and $1 fresh oysters (among other things - but this is my drive). The seafood plates are so rich in flavor and very meaty. So far have not had any bad experiences. The only bad thing might be how crowded it gets and you probably almost always have to make a reservation.", "author": "Chanel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-15", "description": "Been at the bar for 10min so far, and no one has even acknowledged me. Haven't given me a drink menu or anything. I'm dreading even getting a table at this point.", "author": "Fatima M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "Nice spot for after work eats. We went for happy hour and we were seated immediately. Bartender/waitress was attentive and food came out promptly. Love the nachos and the clams.", "author": "Jessica J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-04", "description": "I was not given my French fries once I checked in and showed it to the waiter . He just brought me my regular order", "author": "Nettie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-14", "description": "The Best Seafood EVERRRRR I will definitely be going back. I ordered 2pounds of the snow crab legs in garlic sauce. I thought I would be able to eat the whole two pounds right then and there , but that wasn't the case. I had to take the rest home. My waiter was great also \nIf you love seafood I recommend Claw Daddy's\nThey open at 5pm everyday and the adult caprisuns are pretty strong.", "author": "Channelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-01", "description": "The food and service was amazing.  The prices are reasonable. We were seated right away. They have a very limited cocktail list; didnt care for the Capri sun cocktails as they are only made of I think an Asian vodka, no other liquors.  Also their  shrimps weren't deveined(yuk) and I purchased 2 lbs.", "author": "Terrie B."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}