{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "It is a very interesting place with great decor. I love that you can get messy with the food and not worry about ruining the table or your clothes. They give you a cute bib and gloves so you can dive right in to your food. Food is amazing and so are the drinks! Def recommend it, it's such a fun experience.", "author": "Fariha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Food was really good, but the service was meh at best. What we asked for: a 2lb bag of snow crab legs since we both wanted crab legs with the same sauce. I explained this to the waiter explicitly. What we got: 1 2lb bag of crab legs and 1 1lb bag. ‍ Then we asked for drinks and didn't receive them until we were nearly ready to leave, smh. But the manager Derek was a pleasure! He helped us rectify some of the issues and he's really pleasant and easy going. Will definitely give Claw Daddy's another try in the future!", "author": "Jay W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "I was excited to come here for the food but when i got there it exceeded my expectations . The service was amazing !!!!! He was amazing !! Very helpful with recommending drinks and food !!! If you love seafood and fun drinks this is the spot for you! Happy hour soooo worth it !!!", "author": "Angelica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Absolutely amazing.  Forget about their cajun sauces. Even plain taste delicious.  This is my utmost favorite place ever!!!  Be prepared to wait if u did not have a reservation but overall its worth the wait!!! Ultra fresh and delicious!!!!", "author": "Deana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "This place was great! We got the king crab boil with that Garlic butter boil. It was amazing!! Loved the Adult Capri Sun drinks as well! We had the wings for happy hour they were good as well. The only thing we got we did not like was the deviled eggs they were dry and not a good flavor. The waitress was wonderful and removed them from our bill.  There was a DJ playing old school R\u0026B and Hip Hop. I would return here again for sure!", "author": "Kelly O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "This location is a great addition to the Brooklyn neighborhood. The food is always amazing and the service is great. The bar tenders know what they are doing and makes the best adult capri sun drinks. One of the must order side dish would be the garlic noodles. It's awesome!!!!!", "author": "Joe Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "I LOVE Claw Daddy's!! Great food, friendly service and a nice atmosphere.  I prefer the food at the Orchard st location. The Brooklyn location doesn't pack the flavor in my opinion.", "author": "Fiona S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-10", "description": "Their Happy Hour oysters and crabs has got to be one of the best ways to stuff oneself silly.", "author": "Jacob F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-05", "description": "We had A BLAST here. Walked in and the place was packed, but we snagged a table in the bar.. our waitress was so lovely, and attentive, and I'm pretty sure in a past life we were best friends. Great beers on tap, and incredible playlist, and pretty decent food. Maybe it's what we ordered, but portions were a bit small. Regardless, we'll be back for sure.", "author": "Amber S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-31", "description": "I live in Brooklyn and I was so happy to know that I could dine at Clawdaddy's without having to travel to Manhattan anymore. However, between the 2 locations I would rather choose a hour train ride to dine in Manhattan than eat at this Clawdaddy's. The service here needs to be improved. The food came before our drinks and untensils. We had to ask numerous times for untensils. Granted that most of the food can be eaten with our hands, but how does one enjoy salad and noodles with their hands. Also, on top of that we asked for the tools to crack open the snow crab legs, the waitor replies with \"we dont have any clean ones left\". So you mean to tell me none of your staff had time to make sure there was enough clean ones? or you couldnt just go rinse some really quick and bring it to our table? Just pure laziness. On top of that we asked for extra sausage in our seafood bag, no joke we counted only 3 pieces and were charged double for the sausage. The overall food quality was ehhh. I dont know if its the same owners as the one in Manhattan, but the staff needs to be worked on. Will not be returning to this location.", "author": "Willie Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-14", "description": "We were really excited a Cajun seafood joint was in the neighborhood since one of our faves is the boil in Manhattan.  We came in on a Sunday at the end of their claw feast special without a reservation.  While they allowed us the feast without a reservation but within the time frame, it required all four of us to do it.  They had to check with the kitchen, but allowed it.  While the presentation of two deep bowls full of shrimp, clams and snow crab were impressive with the dump onto the table, the shrimp and snow crab were pretty mushy.  They were either over cooked or previously cooked and cooked again with preparation in the sauce we picked out.  Given the proximity of the location, we were really excited to have Cajun seafood so close, but unfortunately the quality won't have us coming back for more.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-01", "description": "great ambience, drinks (someone try to convince them to not use plastic cups thoooo), Derek the manager was very welcoming - look for whoever has the flyest outfit on \n\nsnow crab legs on point\nw garlic butter sauce, medium spicy on the side bwoi\n\nand a side of garlic noodles\nand mix the sauce w the noodles BOI!!!!", "author": "Grace Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-10", "description": "I ate at this restaurant in Brooklyn 3/9/19. I arrived at 7:00 PM. I made it just in time for happy hour which ends at 7:30 PM. I ordered some adult drinks and raw oysters. The drknks were just ok and are nothing to go wild about and without happy hour are deff not worth 11 each, period! The oysters however were fantastic and for $1.00 each durring happy hour its a deal, dont just order a 12 get as much as possible. On to the meat and potatoes of this review. First they give you gloves and a bib. That should tell you that shit is about to get real. The main course for my darling a lobster. It comes with potatoes she added corn and the spice was set to mild. If you love your partner as much as I do mine then you wont mind the roughly $50 price tag on that dish. On the bright side it was cooked to prefection and the flavor was sealed in as it was prepared in a plastic bag which helps infuse the flavor of choice. The flavor for her was garlic butter. It was delicious. As for me I ordered the shrimp with the addition of sausage and the spice level of medium in garlic butter sauce. Ky dish was also prepared in a bag as i believe all their dishes are. It works. Thw food is very fresh and very yummy. Over all I am satisfied with this venue. The scene however doesnt feel like a seafood joint. The music and atmosphere seems more like a lounge and just doesnt work. If the price is an issue i suggest you try the burger lobster joint in manhattan.", "author": "Henry D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-04", "description": "I was super excited to come to this place. The drink was very good.  The food was disappointing and the service sucked. The waiter was up our backs constantly watching our every move it was so awkward", "author": "Sequeya H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-27", "description": "This is a great place to eat Southern Creole food in NYC. The Capri Sun drinks are a nice compliment. Get ready to get down and into delicious messy eating at Claw Daddy's.", "author": "Tony S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Everything was amazing I had shrimp and crab boil in claw daddy sauce it was delicious, I'm a vegetarian but my husband enjoyed the wings which were $1 a wing during happy hour he also had the shrimp nachos and Cajun fries which I tried as well and loved! The adult Capri suns are really good and strong! Ohhh and the shrimp and crab legs boil I had was a lot I had so much extra for take away", "author": "Stella T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "This place just opened and it's my new favorite place to go to in brooklyn! The service is great and the place just gives off a great vibe. Our server Seyundo was amazing! The happy hour deals are great and the music is always vibing. I recommend to anyone looking for good food and great service!", "author": "Jamina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "I give this restaurant one star I've never been to a place where they don't exchange your drink if you don't like the one they gave you let alone the waiter was pushy as ever while eating my food he hovered over our table every minute which was very uncomfortable the food isn't worth the money I've definitely had better seafood for a cheaper price and the food upset my stomach as soon as I stepped out the door of the place FYI the name of the drink was BLUSH do yourself a favor and just don't go here !!!!! Signed Upset Customer", "author": "Agnita M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "Claw daddy's was my first seafood broil experience \u0026 I loved it! Tons of food \u0026 delicious ! Our waiter Sewit was awesome, helped us crack open our lobster \u0026 everything lol. 5 stars for sure. Ask to be served by Sewit if you go to Brooklyn location", "author": "Theresa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-03", "description": "The food here is great and was decently priced. Walked in with no reservation on a Friday night with two friends. It was about a 30 minute wait but we were able to sit and have drinks at the bar while we waited. The menu is simple and fairly straightforward. The service was okay-- it felt like they were rushing us out at one point and had initially sat us at a table that was too small before we asked to be moved to a different table. I will definitely come back for the Mac \u0026 cheese, fries, and shrimp. The lobster roll was good but I wouldn't order it again (unless I got it for free)! Overall a decent experience with good food, drinks, and music.", "author": "Chiamaka I."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}