{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-31", "description": "Awesome spot for grilled oyster and crab boil. I especially liked the butter cheese flavor and the \"just a dream \" drink that looks like an adult Capri sun. The backyard area is cool for a crew or a couple . Definitely coming back soon !\n \nBeware thou in groups of the gratuity is REAL  expensive. Adding as much as a whole meal . But  enjoy", "author": "Capriece S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-27", "description": "$70+ down the drain.  I really wanted to try this place after all the folks I know had gone and had the adult caprisuns and seafood boil.  The pictures looked nice and I was craving seafood. So, after we left BAM, this was a no brainer.\nUpon our arrival, there was an open door.... storage, but ok. We were quickly directed to the main entrance. Cool. We wanted air conditioned dining anyway.  We were asked if we had reservations (no.) And we were sat in a lovely spot market reserved. A bouncy lady (later found out she was the bartender) came and took our drink order. We both got the Mardi gras adult caprisun.  Tangy, without any passionfruit flavor at all. Much like a mojito made with soju. Not bad at all.\n10 minutes or so goes by and finally the waitress arrives.... she was either tired or simply sour. She was completely disinterested in doing anything. I asked for the combo of seasoning choices, she pretends to ask the next waiter, then refuses. We ordered. The My friend got crabcakes to start, later, she ordered deviled eggs and chicken sliders.I got the snow crab and shrimp with butter garlic seasoning (which is supposed to contain the original cajun).  We wait. \nCrabcakes came (not bad, just a tad salty). Deviled eggs arrived, same verdict. Next came the boil and strange looking pieces of fried-ness via a runner. The sauce was a tad pale and watery, but still looked edible. Tasted my shrimp. Nothingness. Tried a crab leg. Same. 10 minutes... Waitress still MIA. I'm started to become irritated. Then came the flies. Big ones. Small ones. Buzzing about. Ughhh.\nNext table's waiter noticed the absence at out table and asked if we needed anything and I asked whether all the seafood was boiled plain and seasoned after. He replied \"of course\"! I balked at this notion and explained the \"boil\" concept.  His sweet bewilderment said it all.  Our server finally appears and begrudgingly asked if we needed anything. I requested some seasoning, which she attempted to protest, telling me I should have ordered more flavors. O beg your pardon? After she rudely rejected the request earlier. I was floored.  I accepted some old bay and hoped for the best. My friend reminded her she ordered sliders. She proceeded to point and say, \"that's what come on the slider\".  What????  My friend politely acknowledged and she left. No words. 5 minutes later it arrived and my Luke warm dining experience was finally underway. \n3 legs in, I get my first rotten one. Greenish gray and stiff. Eww.  The entire claw was rotten and ended up in the bucket.  The shrimp are heads on, no prob... but the were not even close to being \"cleaned\".  Upon closer inspection, neither were the crabs.  Green gunk everywhere!  I was disgusted. Inspected the rest and threw in the towel.  I washed my hands and waited 20 more minutes for the bill then noticed the server had changed and was leaving!  Another server appeared eventually and I finally requested a manager.  My friend got a to go container for the sliders.\nI explained the food situation minus the rude server. I didnt know whether she had a bad day or what. His response was something to the tine of that's how it's done. Hello? This isn't the only boil joint in NYC or even the Slope!  Then he says all crablegs are precooked! No apologies for the rottenness, no adjustments for leaving the majority of my order picked over and disgarded. When I brought up the fact I cook them at home and the other small chain I frequent has a completely different process, he accused them of using msg, lol!  Then invited me to visit the other location in the LES.  What??? Mind you the other place only uses fresh crushed herbs and spices with real butter! 20 minutes later, still waiting for the bill when it arrived full price.  I quietly paid and thought about all this mess.  The friendly bartender came back from lunch and I told her the short version and over tipped her directly.  She was horrified and rushed to talk to the manager who in turn sent two shots.  My friend left hers (I was allergic, so i was given a plain one). I took some of my money back in time.... sitting at the table waiting out the weather. I was completely checked out.\nI wanted to give this place all the stars but the response to the issues I encountered were a bit too little too late.  I am the customer who comes and just wants to have a decent dinner and go.  Despite errors I still choose to stay calm.  This attitude was taken with a grain of salt.  The only reason this was two stars was for the super friendly bartender who was horrified after finding out what occurred after her break. Never again.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-12", "description": "I love this place! The bar area and restaurant are both welcoming- but the bar is better lit if you really want to see your partner getting sloppy.  They have a generous happy hour with $8 adult soju  Capri suns (a little too sweet for me), $6 beers, $1 oysters and $1.50 grilled oysters that are literally heaven personified. While it is tempting to just eat oysters and beer- the boils are great, too!\n\nI always get the 2lbs of shrimp with the claw daddy's sauce medium-- then a order of the hot sauce on the side ($4). While the heat of the hot is what I prefer- I think it is better dipped with the medium as you are getting more flavor. When you order the 2 lbs- you get free potatoes and corn- and then I just take half of the meal home with my extra sauce and eat it over rice the next day.\n\nThe service is often slow- chalK it up to Nola style and just enjoy- the food is worth it!", "author": "Jaclyn V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-31", "description": "Came here on a Friday night. Made reservations through the yelp app. Arrived earlier than my friend so I started the night at the bar. All three bartenders were extremely nice and attentive. The drinks made at the bar was super strong. When my friend arrived we were walked to the back of the restaurant which was chaotic at best. It's an extremely narrow space formerly a long time diner in the neighborhood. I highly recommended claw daddy to my friend who has never been. Unfortunately she barely at her catfish po boy which was recommended by the waiter. Andddd to our unpleasant surprise there was a medium length strand of black hair in our seafood nachos. We were told sorry and bought another order. I might give this location another chance but the jury is still out. Please note this is definitely not a date spot. If you're looking for a raucous good time in bk. This is it.", "author": "Lillian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "Hands down one of my favourite seafood/Cajun/creole places ever.\n\nEven when you order takeout food is as delicious and as good, maybe not as generous with the portions but still a lot of flavour and tasty.\n\nAnd the spicy is really spicy, I like spicy foods but couldn't handle the extreme level!\n\nTheir Mac and cheese is divine! It's just the perfect balance in my opinion.\n\nWould definitely recommend", "author": "Mirabel I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "Service was quick wings was good for appetizer friend loved grilled oysters ( I didn't try ) \u0026 crab legs were good !!! Try to come for happy hour from 5-7:30 everyday.", "author": "Adrienne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-15", "description": "I would like to start off by saying that I recently changed my favorite food to snow crab legs (used to be Tostitos chips and queso if you're curious),  so I DEFINITELY can speak with authority on this restaurant.\n\n--\n\nBeing from SOUTH Jersey, I am always on the hunt for good seafood in NYC. I think finding a good boil restaurant in the city that you live in is a must. So naturally I had to try out Claw Daddys. \n\nThe Food - 4/5\nDANG. I love my some boil seafood. Definitely come during happy hour (1-6ish I believe), bc it will make your adult juice boxes SO much cheaper. I would also check in on yelp if I were you - FREE fries. TO be honest fries are not necessary when eating this food, BUT we ordered medium spicyness which was way too hot, so the fries made a nice cool down break from the spicy seafood. Unless you're prepared to have a fire that cannot be quenched lit on your tongue I would order mild. \n\nThe Ambiance - 2.5/5\nVery modern and minimalistic decoration. I felt like I walked into a bluestone lane. Like come on, if I'm eating boil I want to be in a completely wooden room, with really poor lighting. Step it up - claw daddy's. \n\nThe service- 5/5 \nWe had a reservation at like 1pm on a Saturday and it was PACKED. (definitely make a res) Anyways, we were seated right away and the waiter was very attentive, and not in the annoying way where he checked up every 5 seconds. The perfect balance. He gave us good recommendations and even though it was crowded our food came out pretty quickly. (This could speak to the seafood being pre-boiled and then just tossed in the sauce upon ordering) \n\nOverall great experience and decent prices for boil seafood. The only downside was the bluestone lane vibes.", "author": "Abby T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-21", "description": "Claw Daddy's was just an okay experience. I recommend making reservations as the restaurant was very packed when I came on a Friday evening. \n\nIt's a young, vibrant crowd with a great DJ (hip hop \u0026 r\u0026b) but no matter your age range, you'll enjoy the scene. My 65 year old dad fit right in but he's hip so don't be shy to bring along a parent, auntie or uncle. \n\nSo three stars because the food is just okay and overpriced. But that NY for you, right? You can only order full pounds of your seafood choices so come with an appetite. That sucks for people who aren't interested in eating a whole pound of shrimp or a whole pound of clams etc. but it makes for sharing among your table. \n\nThe corn was undercooked and the shrimp was over cooked. Also, the only type of shrimp you can get in your boil bag is shrimp with the head on. I spent more time removing the head shoulders knees and toes off my shrimp than enjoying it. But no seriously, had to remove the head, tail and devein. That's too much work. \n\n\nThey also serve \"adult Capri sun\" drinks but I didn't find them to have too much alcohol in them.", "author": "Bell A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "First time at Claw Daddy's. The drinks are awesome. I love the bags. Waiting for our crab legs to come out.\n\nSo the crab legs were really good. Sauce was nice and spicy.Loved it. We will definitely be back", "author": "Apples Oranges P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "Greatly enjoyed my time here with my friend. We were looking for food plus an experience. Not quite the most graceful experience as we were cracking lobster away while the sauce flew around.\n\nStill an enjoyable one since that food was delicious. We got the grilled oysters that we demolished while sipping from our capri sun type drink holder. The lobster broil came out soon after. It was huge and wonderful filled with a pool of claw daddy sauce which I believe is a combination of all the sauces. \n\nDespite its large amount, we ate everything minus the shell. \n\nOn top of the good food, the service was great and on point. \n\nEnjoyable place to be :)", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-05", "description": "What a treat!! I would catch the happy hour if I were you. Not just cause it's really good for drinks but it gets super pack around that time already. \n\nI started with a ginger drink and oyster $1 and wings. A bit disappointed with the oyster as they are super small (can't be cheap and big) and the wing is like just sad small. I can't barely get one bite of any of them. The drink is really good except it comes in a bag. Please serve my drink in a glass if I am at the bar alone waiting for friends. I am not drunk yet. The drink does hold a punch thou. They are strong even for happy hour drinks. \n\nMoving along to the main course, we opt for shrimp two dozen in galic sauce and they come with potatoes and corn which isn't that expensive. Why require two dozen minimum to get those for free? We got some side dish which are nothing to be wow about. Shrimp is amazing thou. We asked about the lobster price and it's laughable. They charge way too much for lobster and I doubt they are any good. \n\nService is 100% except you kinda have to wave down your waiter sometime. Smile and be nice.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "I'll definitely be coming back here! Both the boil and appetizers were absolutely delicious and filling.", "author": "Godwina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-15", "description": "So I've been on an oyster kick for the past few weeks. Desperately wanted oysters before heading home, heard that Claw Daddy's has $1 oysters, and ended up there! The raw oysters were good - not as fresh tasting as oysters from other places I've been to, but they were huge! The grilled oysters were delicious also. Fries were okay (coming from a huge French fry lover). If you want a strong drink try the Mardi Gras Capri sun! \n\nI sat at the bar alone - it was about 5:45pm on Monday and considerably empty. Food came out quick. Bartenders were very nice and attentive. They played chill mellow music. \n\nDefinitely would come back to try the rest of their menu!", "author": "Alicia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "I came with my family for Mother's day and it was extremely packed. This is the first time I came to the Brooklyn location. This location is extremely small compared to Manhattan but the food and drinks are amazingly the same!!!", "author": "Kathy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-07", "description": "Visiting from Louisiana so you all know I know my crabs , crawfish , potatoes sausage and all the fixings that goes in a boil.  \nMy daughter suggested we try this place bec she loves it , we walked in and the smell of the seasoning smelled .. The space was tight to really try and dig in to eat crabs it seems like my elbow was touching my neighbors table lol! \nBut all that said. my daughter informed me that the guy who is the cook has won trophies beating the others boilers in Louisiana....  Now! I'm definitely curious to try this food.  \nwe ordered the shrimp with potatoes, sausage, corn with medium garlic sauce and side of raw and grilled oysters and chicken wings and a cpri sun drink... OMG the drink was very strong    \nOk here came the food to the table  \n\nThe presentation was beautiful! I was not to impressed with my sauce  flavor was a little sweet and too garlicky and it was a lot like Bisque. imy potatoes, corn and sausage were covered in too much sauce it was like eating mash potatoes with gravy and corn soup but eating it as a ball. I guess it's a famous NY flavor,  but hey! At least I tried it. my daughter sauce was very good, maybe I'll try that next time and ask for a lighter sauce on the side to dip  \nBut until then I'll stick with my spicy cajun Louisiana seafood boils \nBut definitely will come back again to try something different", "author": "Nikki B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "Finger lickin' good seafood. Easy online reservations. Everything on the salty side but flavorful. Been here twice and ordered the 2 lb combo, which comes with potato and corn (1 or 2 big pieces each). You can only get 1 sauce with the 2 lb combo.\n\nLemon Pepper is my favorite but even mild has quite a kick. Claw Daddy sauce is way too salty for me. The garlic butter will leave you smelling like garlic all night (avoid for date night haha). My favorite is the king crab legs (meaty and easy to crack with the scissors and tools). Shrimp is filling and clams can be skipped unless you love them.\n\nThey give you bibs and gloves to avoid a hot mess. Happy hour specials include draft beer, adult caprisun, and not to be missed grilled oysters. Wings are ok, kind of dry.\n\nHighly recommend the crab avocado salad to balance out the rest. Gumbo is spicy but thick and flavorful. Garlic noodles and jambalaya are good sides for big groups but will fill you up.", "author": "Jess J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-22", "description": "$$$$$$$$$$$$ WAY TOO EXPENSIVE \n\nThis place is very nice but super tight. Our chairs hugged our neighbors chair the entire time. People are so close together everyone who doesn't have their food is like in your face watching you chomp down on yours lol. \n\nHere's a few details I will get into. Our server was super busy, he was the only one towards the back of the restaurant taking orders for all those tables. I already knew it was going to be lack of service due to that. I was absolutely correct! Not once did he check if we need anything especially our drinks which were sitting empty for over 45 minutes. We had to constantly tap him while he spoke with other people just to get his attention and ask for additional things at our table. \n\nI was a little annoyed that a couple who came way after us were given food (happy hour wings) before us. We ordered 15, they ordered 10 and got it before us. I had 2 very hungry small children with us but of course the other folks were worthy enough of getting their food first for some reason. That was my first turn off. \n\nThe lack of stars is because this establishment does not have good food. In all honesty the king crab legs were decent. The chicken biscuits were so dry I choked on it, worse than KFC biscuits. The Brussel sprouts had a weird taste to them and the macaroni and cheese was not good at all. The Cajun $1 wings need more seasoning but they were decent. The clams and draft beer were also decent. \n\nWhen you order your boil it must be 1 pound or higher. The server convinces you with all his might to get 2 pounds which of course is super expensive and it ONLY includes corn and potato at 2 pounds. They should've added the sausage to it as well. \n\nWe didn't have alcoholic drinks but they do serve you soda or lemonade in the pouches. Peach lemonade was a huge hit for me since I don't drink. I had about 3 of them, they were so good. \n\nThe ambiance is nice with a good DJ but the food was wayyyyyyyyyyyyy over priced. We only had exactly these items and my bill broke me in half. \n\n2- 2 pound king crab leg boils \n1 pound clams \n25 Cajun wings $1 each\n1 Mac n cheese \n1 Brussel sprout \n8 non alcoholic drinks in the Capri sun pouch \n1 draft happy hour beer \n\nTotal = $355 What the heck is that? Our server got an automatic $50 tip for NOTHING! Our party of 6 wasn't even a real party of 6. It was 4 adults and 2 4 year old children that you didn't even service at all so that $50 tip should not have been included. \n\nI will not be coming back. I'll explore other places. Believe me when I say \"Happy Hour\" is not really happy hour. I blew the bank on this place close to $400 on 3 boils and some wings not worth it.", "author": "Gigi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-12", "description": "Claw Daddy's in Brooklyn has a very different atmosphere than Claw Daddy's in Manhattan.  I made a reservation for a Friday after work.  Good thing I didn't just show up.  So many people showed up and were told 2 hour wait so they just left.  I waited about 5 mins to be seated and the race was on.  They turn over the tables here QUICKLY.  There is no sitting and chit chatting here.  Sit, get your drink, get your food And get out. The food was great, just like at the restaurant in Manhattan. \nThe table set up here is very tight. They definitely try to fit as many people in as possible.", "author": "Tara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "First time here, surprised by the music but it made the vide better, thanks to yelp I got some free Cajun fries and they were amazing!!!! I ordered the crab legs with original Cajun sauce with the potatoes. The crabs stayed hot and they tasted good I didn't touch the potatoes because they were drenched in Cajun sauce. The drinks  I ordered sweet Georgia it tasted good but didn't get me twisted haha I enjoyed myself wish the DJ played some\nmax B. If you're in the area stop by Patrick with the red checkered shirt was cool.", "author": "Randy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "I had a truly wonderful experience here. Yuchin (our waitress) was so attentive and patient with me, as I'd never eaten seafood from a bag before and I had many questions. Lol. \n\nInitially, my party of 5 was seated at a table directly in front of the door. The Hostess moved us to a table in the back without issue when requested. Yuchin came over promptly to let us know it was happy hour (until 7:30 pm) and let us know what was included. Then she gave a little time to mull over the menu. \n\nThe prices varied depending on the type of seafood you wanted, but we all went with the 2lb special they offered which included 2 types of seafood (at the price listed) with complimentary potatoes and corn. I had the snow crab legs and shrimp and they were large and filling!  I was only able to eat about 1/2 of my meal, which excited me because that meant I had leftovers for the next day!  Yaaaaaaaaaaas!!  Lol. I had the garlic butter sauce and Cajun flavor with medium spice - not mild (there is a difference!).  I initially wanted the spicy, but Yuchin warned that mixed with the Cajun flavor, the spicy was very spicy. The medium spice was just right!  I wasn't a huge fan of the garlic butter sauce, but it was bad. I'd try something different next time ( \u0026 there will most definitely be a next time).\n\nI didn't have anything liquor but I tasted the Yours Truly adult Capri Sun and it was delish. \n\nBe sure to check-in for your free Cajun fries. They tasted more like seasoned fries and they were so good (it's pretty much the only thing my little Brother ate). \n\nCan't wait to go back!", "author": "Cassie V."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}