{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "I had dinner at Claw Daddy's last week and I know I'll be back. I've been wanting to try this restaurant fir a while and now I'm so glad a did. My friend and I shared a two lb combo of the shrimp and crab legs with the classic sauce and it was heavenly. It came with corn and potatoes. We shared the grilled clams another delicious choice. We asked for bread for dipping in the sauce which was two dollars. I think the bread should come with the meal but it's worth it because you need to do something dipping!", "author": "Amy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-07", "description": "I just want to start this review by saying that the food at Craw Daddy's is PHENOMENAL. Me and my girlfriend ordered the Louisiana Boil, which is an absolute must if you're eating here. We ordered a pound of Shrimp, Clams, Snow Crab legs, the special seasoning (definitely recommend), medium spice level (looking back would've gone with mild cause medium was very hot), corn, sausage, and potatoes. As stated before the food in the bowl was amazing, but definitely seemed out of proportion. I don't know if they were low on clams so they added extra shrimp to compensate? But there was definitely a proportion problem.  We were also very surprised that the food did not fill us up as much as we had expected. Being from Delaware I expected to leave stuffed, but my girlfriend and I left still fairly hungry (which really should not be the case if we're spending over $100 on a meal). The alcoholic juice boxes were very good and I would recommend. The interior didn't seem to match the food (very bright and modern).  Overall very good food, but at a very high price point for the amount of food you are getting. \n\nSide note, if you check into yelp you get a free french fries side", "author": "Alex S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-06", "description": "Best seafood spot I've been to in BK. And I Love me some crabs, yum. The restaurant is cozy, modern and beautiful. They also have happy hour, $1 wings and raw oysters. When I received my 1 pound snow crab order, the waitress open the bag for me and kindly placed my order in a large ceramic bowl! I appreciated that little touch because I hate eating out of the plastic bag. \n\nBibs, gloves, claw cracker and pail were also provided per table. They carry 4-5 different flavor options with different spice levels ranging from mild to insane! I typically prefer mine with a little Old bay. I would recommend the flavor classic Cajun with mild spice(has a slight kick). All of their flavors are wet rub and not dry rub, like Old day. The only criticism or pet peeve I have is that they did not devein the shrimp.", "author": "Blue S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "Stopped by for their soft open, and it was a good time.\n\nTried their wings, and their clams, and their shrimp. All very good, but their fries are surprisingly great!\n\nAlso had a few of their Capri Sun style drinks, and they were dangerously fruity. I saw how much alcohol they were pouring in, but couldn't taste it!\n\nWill definitely be back. Would be nice to see a business stay in this space for once...", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "Love claw daddy's. The food is always wonderful, presentable and proportionate. I frequent to this spot for a good crab or lobster season boil. Seafood is my favorite and this establishment has my heart. I almost always gets the crab leg and shrimp/crawfish combo with potato and corn and I'm always filled. Great drinks as well and very different serving container from most places.", "author": "Sheree P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "So glad my boyfriend brought me here. I was craving king crabs and he obviously knew the spot to go. The food was delicious!! I went with the king crab, original Cajun sauce and mild on the spice (was told medium was very spicy). I didn't think I was going to get full but to my surprise I was. \n\nAs for drinks I decided to try their adult caprisun called \"yours truly\". It was a good drink but the one my boyfriend got which had lychee mix in it won me over. \n\nAlso, I wanted to add I love how they offered gloves and a bib. It kept me mess free the entire time. The scissors also made getting the meat out of the legs pretty easy! Don't think I left anything on that plate except for the crab shells.", "author": "Samantha F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Yea. I got the crab legs with my friend. It was amazing. I loved the atmosphere and my server was some fire. Always checked on me and refilled my drinks.", "author": "Julius S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "I've got to say, this location is a lot better than the one in the city, but it may just be because it's newly opened. Unlike the city, there wasn't an obnoxious line or reservation needed. Although I anticipate it will get busier over time since it is next to Barclays.\n\nFirstly, the space is cute and cozy. Wooden tables and a very chill atmosphere. We sat down right away and ordered some DELICIOUS adult Capri sun. They've got a great deal during happy hour (5-730PM). Oysters and wings were on the menu and pretty filling.\n\nWe ordered a combination of shrimp, king crab legs, and crawfish with corn and potatoes. I personally loved the Cajun flavors we ordered - not too spicy or bland but just enough of a kick. I know everyone raves about crawfish, but it was too much effort for not enough meat. Between the two of us, it took forever to finish though so maybe 6 pounds for 2 people was more than we bargained for! Clearly I eat with my eyes more than my stomach.\n\nThe bill for 2 of us came out to ~140, but keep in mind we definitely splurged. With great happy hour prices, you'd be able to get a filling meal for 40/person. \n\n8/10 recommendation, simply due to lack of efficient service when we asked for the bill or ordered drinks. The waiters don't check up on you often as they should.", "author": "Ruby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "All you REALLY need to know about this place is that they have adult capri suns and deliciously large portions of fresh seafood.\n\nI came here on a Wednesday night and the DJ in front was bumping some seriously catchy early 2000's R\u0026B and hip hop. We were seated in the back of the main dining area. Make sure to order drinks in time for happy hour when you're here! The Georgia (not the actual name of the drink, but it has the word 'Georgia' in it) was insanely good. It's made like an alcoholic sweet tea with lemon peel. I had 3 and let's just say they snuck up on me!\n\nMy friend and I shared a few small plates since we weren't too hungry. We got six $1 oysters (part of happy hour only), biscuit sliders, crab avocado salad and fritters. The service was a little slower than our bellys had anticipated, but once the food came we were happy. \n\nI'll 100% be back to try the seafood boil options!", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Pre-Opening Event:\n\nAsian garlic noodles - cooked right not too garlic-y\nSalad- standard , balsamic dressing regular \n\nDrink Just A Dream- slightly fruity but not overly sweet, good pour for a pouch \n   Sweet Georgia- smooth slightly sweeter\n\nClam bar in main dining area\n\nWings were tasty. Crispy on the outside, moist and not over cooked on the inside while still being cooked throughly. Could use some sauce but fine as is. \nCajun fries- tasty, not the best ever. Seasoning was baked in unlike many Cajun fries where seasoning was sprinkled on after cooking \n\nHead on shrimp- well favored, sauce was delicious and flavorful. Clean, quality jumbo shrimp/ prawn\n\nDecor- more upscale mountain home than typical seafood joint.\n\n\nNo full bar available \nBar slammed and struggled to keep with with 2 people behind bar. Of course one seemed to keep up a little better than the other. After an hour of struggle 3 owners stepped In for back up.\nBack patio only partially set up but enjoyable nonetheless.\nVery crowded \nlimited seating\n\nMain level had hand-washing station/ sinks for washing seafood juices/sauce off your hands.  \n\nDownstairs bathroom smelled a bit like a basement which they must've known based on the candle.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "Yes ! Yes and yes ! If you love seafood, eating and getting deliciously messy and broil style; Then this is the place you wanna go to. We went on VDay, they had a special meal for two including App, entree, dessert and drinks that worked out better for us than buying single items off the menu. \nOur waiter was awesome and tended to our table, it was our son's bday and he bought the dessert with a candle and helped us sing happy bday to him and even bought us additional bread for the left over gravy we had . \nThe drinks was good and was not watered down. We were able to get two adult Capri son like drinks included in our dinner special.", "author": "Notoya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I came here for the pre-opening and had the opportunity to try a few different items. I started with a few of their raw oysters which tasted extremely fresh and were pretty decently sized. I also had some of the grilled (or baked?) oysters but I preferred the raw. I'm not sure if this location will offer Happy Hour like the Manhattan one, but it would definitely be worth it to check out if they have oyster specials. \n\nThen I moved onto their catfish sandwich and chicken biscuit. Both items were pretty tasty but I preferred the catfish one. I was also lucky enough to try some of the cajun fries right as they came out and they were very crispy and flavorful. Later, I tried their shrimp and clam boil (?) which was a bit on the saltier side, but overall very delicious. \n\nFor a drink, I tried their blush adult Capri Sun which I really loved. It was a lychee flavored one and was pretty sweet/didn't have too much of an alcohol taste which I prefer. I've also had the adult Capri Sun at Tuesday Kitchen which a lot of people rave about, but I actually prefer the one here since it didn't taste as strong (although there was definitely still alcohol in it).\n\nOverall, I would recommend this place for a casual hangout spot, especially if they have Happy Hour specials. The hostess was also really nice and it's a nice dimly lit setup. Was a great pre-event, definitely left feeling super stuffed.", "author": "Sarah X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "This four stars is not for the food because the food was not that great to me.\n\nThese stars belong to the stellar crew that this location has. Everyone from the hostess to our bartender to our waiter was top notch, knowledgeable and engaging. \n\nThey serve one type of liquor here: kinju(sp) some shit that smells like devil springs but tastes almost like flavored Bacardi. \n\nThe drink with the rose petals was my favorite although the second round tasted painful. \n\nThe medium spice is hotter than one would expect for medium. The garlic noodles is basically spaghetti not the thick lo mein noodles that shaking crab has.", "author": "Raye S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Came for the pre-opening event. This was an amazing event. Very packed. This location is huge. Takes up the whole corner of the street. It's close to Barclay's Center. Great ambiance. Great place to hangout or have a party. They have bar seating, booth seatings and tables good for big groups.\n\nHostess and staff were very friendly and nice. Food was great. I really liked the raw oysters. Had some big meaty ones too. Also tried some fries, garlic noodles, fried chicken wings, chicken sandwich, garlic shrimp and clams. I was expecting only seafood due to the name, but their non-seafood items were surprisingly just as good. Plus I can take my vegetarian friend here for just the fries and garlic noodles alone (although not sure if it's cooked in the same oils with meat). Super tasty. The fried chicken was good either by itself or in a sandwich.\n\nThe bar area is cool. Had the montawk wavechaser on draft. They also have wine and other liquor. \n\nThere was a poster for Wed specials, so I would ask about the happy hour and specials.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-03", "description": "I love seafood and this is one of the places that I will sure be coming back to the shrimps was so big oh my god they were so big and juicy I really enjoyed my time and I will definitely be giving you another visit very shortly", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-11", "description": "It's a Friday night and I foolishly didn't make a reservation before stepping in. Don't be a fool and make a reservation beforehand. \nDrinks- $11 for an alcoholic adult Capri Sun\"style drink. Pretty good drinks. We also had the Peach Iced Tea which was pre-sweetened but not overpowering. \nFood- finger licking good\nAmbience- Fun, casual and they had a DJ playing a mix of R\u0026B, Hip Hop and Old School jams.", "author": "Sophy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "If you are a seafood lover this is your place!!!!\nI recommend going turn a group of at least 4 or more! Much much better experience that way, so you can get the messy table. Even have a a few selections for shelf fish allergy individuals like myself!! Drinks were awesome as well, would definitely go back", "author": "Alex C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-11", "description": "Warning!!!!!! Served spoiled seafood. I came here after work one night with a friend. I checked Ingo yelp and got the free Cajun fries which were okay. Then we ordered the crab fritters and shrimp ceviche. The ceviche was okay but the fritters let's just say I've had waaayyyyyy better. Now we came here for the grilled oysters and boy were we did appointed. They looked great but they were spoiled. The oysters literally smelt like feces. We altered the waitress and she took the food away and gave us free shots of soju. She also removed three oysters from the bill. Honestly I was heavily disappointed it was my 3rd time here and I was appalled that they would serve spoiled food. The nerve!!!", "author": "Jody-Ann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-22", "description": "Came here for the first time a month ago and WOW! The seafood gumbo was DELICIOUS and SO flavorful. Plus, the \"Capri sun\" drink pouches were soooo cute and the drinks themselves were so tasty! I had to take a star off because my plate wasn't as full as my mother. She got a 2 lb bag of king crab legs with a side of shrimp, corn and potatoes and her plate was massive. I had 4 average looking king crab legs with no corn or potatoes. Needless to say I was left hungry.", "author": "Alexandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "Omg!!!!! Service poppin! Drinks poppin! Music poppin!!  Haven't eaten here yet, but soon some!!!!!!!", "author": "Shalisse G."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}