{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-09", "description": "Overpriced and seriously overrated..\nThis place is trying to copy the serious crab boils on the southern coast..\nI suppose people in this area people are unsophisticated or have lower standands..\nIn this spot numerous restaurants have opened  They last about 18 months..\nWhat is really needed is a good Greek diner that serves good food at good prices and is open early and closes late..", "author": "Sonja G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "Came here to celebrate my birthday with a small group, we came just in time for happy hour. Let's just say adult Capri-sun , my oh my Sweet Georgia. Waiter was amazing thanks for being so honest and realistic. Food was perfect everything came out right on time , I have to come back just to make sure it wasn't the drinks getting the best of me , let's just say Brooklyn has done it again", "author": "Ava L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-21", "description": "Service in the bar area was super friendly and attentive despite her being completely slammed! Always appreciate a hard worker who's got her eye on you even if she can't make it to your table immediately. \n\nWish there was a full bar but overall great food great vibe!", "author": "Mason M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-06", "description": "Too expensive not worth it! We spent at least $700 for a couple of shrimps, half a corn, two potatoes, and barely any meat. We're still hungry. It was tasty food and great service but they need quality and quantity.", "author": "Zawad N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-19", "description": "It was ok. I've had better. I tried the crab legs in garlic butter sauce with potatoes and corn on the cob. There was no option to mix or combine proteins. I could seriously have just had a pound of steamed crabs legs from the stop and shop up the street for half the price perhaps less. All in all nothing special here.", "author": "Shawanna W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "Alright let me just start by saying this place is AMAZING! Me and my husband both love seafood and had never even heard of this place before but I am so glad we found it because we will definitely be going back! A part from the delicious food the service was incredible! Our waiter whose name was Suwit (I asked him how to spell it) had such great energy and was so accommodating. Everything he recommended was simply delicious and the food and drinks came quickly, we were never waiting on anything! So not only are you going to have a bomb ass meal but incredible service as well. I cant say one bad thing about this place, just head on over!", "author": "Jamie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-28", "description": "There is much to say about Claw Daddy's! First impressions.... great host and wait staff. We had zero wait with a reservation. At the bar, the adult capri sun is less than boozy. More like a regular capri sun. Nice flavor, but you do not feel like you're enjoying a cocktail!\n\nWe frequent The Boil every month and are HUGE fans, minus the wait. Here he ordered his usual...shrimp and snow crab. I ordered my usual... king crab in butter garlic with medium spice. Both of our meals were absolutely overwhelming. We could hardly taste the meal through the spice! I could not taste the garlic butter on my king crab whatsoever. The atmosphere was fun and I wish I could say I would be back, but I won't!", "author": "Alicia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "This place did not disappoint me at all. The $7 happy hr drinks the $1 wings and oysters. We wanted everything on the menu because it all sounded so good. We had excellent service. We ordered a pound of shrimp and crab with the everything sauce with corn and extra sausage. I'm still licking my fingers and I'm going back next Wednesday for the special", "author": "Demetria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "Delicious seafood.\n\nDepending on the season and day of the week, the wait can be a bit long but the food is worth it. Crab legs are delish as well as the po'boy. For a seafood restaurant, the cajun wings are AMAZING! Enjoy!", "author": "Chantelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-29", "description": "Great food!! Waiter gave appetizer n entree 5 minutes apart. We were rush to eat. We had to take the appetizer to go.", "author": "Bsmiles R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "My waiter Segundo was absolutely the BEST!!! He was attentive, friendly, prompt and made sure we were well taken care of!! Our food came out fresh \u0026 hot!! His service was 200% on point! We will without a doubt come back again!! THANK YOU SEGUNDO YOUR THE BEST!", "author": "Regina M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-24", "description": "This is was of the WORST experience I ever had. So me and my sister and my mom walked in to\nJust get a drink and we sat at the bar, their was two bartenders at the bar and one of them completely ignore us. We sat at the bar for 20 minutes and the bartender didn't greet us, ask u for our orders, ask if we wanted water or even remove the old food that was in front of us. Me and my family drove an hour from Long Island to\nCome here and we would never come back !!! We are going to stick to our local seafood spots. NEVER AGAIN !", "author": "Asia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Food was good, Drinks were good, Atmosphere was positive. Will definitely be going back again.", "author": "Chanel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "Love this place ! The adult Capri sun drinks are so good and strong ! Also, must try the grilled oysters! May be the best I've had !", "author": "Gisette B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "I go to lower east side location regularly. I Recently found out they opened one in brooklyn near by Barclay center. Went there over the weekend with some friends. Very busy already but drinks and food came out without delays. We had so much fun there. Great food and staffs. Ps good music with dj.", "author": "Martin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "It's so delicious that you will come back I promise that . Very fresh and just straight to your taste buds.", "author": "Leidy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "Omg shioban the bartender is the bartender with the mostest we wanted a table but it was packed we end up staying at the bar with her she was awesome not to mention the shrimps was so good .... adult Capri sun yes please 2 and ur good . Dj was dope as welll 5 stars .. will go back and chill at the bar with shioban greatest customer service ever", "author": "Tamika C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-20", "description": "We were told the wait would be 1.5 hours but we put our name on the list anyway, because we figured there would be a wait anywhere worth going. We ended up being sat within 20 minutes. Took a while for our server to get to us but that's because 4 of his tables were sat at the same time. My seafood bag came out significantly before the rest of the food, including the 5 wing appetizer but the food was good.  I wanted a regular cocktail, but they only serve those adult Capri Suns so I opted for a glass of Prosecco instead. The DJ's music selection was definitely a plus. We'll be back again.", "author": "E. V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-23", "description": "The drinks and bartenders are amazing. I honestly felt uncomfortable hearing the hostesses talk about people as if they were nobodies. It  was disturbing.", "author": "Nicki W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-23", "description": "It was a hit with my husband who loves seafood. I'm more into a more traditional dining experience. I'll give it a go again and see. I know my husband can't stop talking about it so he'll be there again soon!", "author": "Gale L."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}