{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-17", "description": "Great food great service but a little too pricey. They have a very unique style of eating food which is great for families. It's best for a first date or a family reunion!", "author": "Moe M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-28", "description": "Quite disappointing- the baked clams were terrible - so chewy we had to spit them out after 5 minutes of chewing. Service was also sub-par - very long waits until our order was taken and they didn't care at all when we mentioned the clams. \n\nOther food was good but tiny, think small tapas for \"semi-entrees\", like jambalaya the size of a small saucer. Sweet potato fries and crab cakes were good. \n\nAlso definitely not a place if you care about the environment- everything including some of the food and all drinks (!) come in plastic bags. I guess eating off the paper table cloth rather than plates slightly improves the environmental balance? \n\nShame, I thought this could be a new regular place but with all the great new places popping up in the area it just doesn't make the cut.", "author": "George W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "Amazing!  Food is wonderful.  If you don't like spicy or are unsure, order mild!!! But still, as a medium-spicy girl I ordered medium.  It was spicer then most, but not so spicy I couldn't enjoy the flavor.  I highly recommend the king crab.  Now that it has become more popular, I would not go without a reservation.", "author": "Rachel I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-15", "description": "Made a reservation here for a bday dinner for Two. As I'm seating gossiping with my better half we notice it's been 15 minutes and no one has approached us. Finally, someone comes and asks if we're ready to order I say I would like a glass of water for starters, He says he'll bring my water right over and be back in 2 minutes which became another 15 minutes,  Finally he comes back and I'm ready to place my order I feel like I'm being rushed he never suggested anything I ask wheres the drink menu he points to the table where I haven't noticed it. He never came back so I can place my order for a drink. Our food was bought out with no utensils for the crab legs and seafood. We had to ask others for more water. So finally,  are watier is walking past and see me struggling with my crab legs and says would we like the scissors and crab leg tool thing ( forgot the name ) at this point I'm over it and want to leave. The young man cleaning off my table was more attentive.  Overall food is okay here, I usually go to the one in the city which I will be heading back. Sucks because I'm closer to this one. The waiters \u0026 waitress are so attentive to there customers and so helpful. \nI would say if you are looking for some tasty somewhay affordable seafood I would suggest take out at this location. For a full good great time and excellence service head to the one in the city!", "author": "Jasmine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "I love this place!!!! Every time i go there i enjoy it more and more.  I loce tgeir shrimps in the claw daddy special sauce!!!! Delicious", "author": "Tara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "Go to place for Cajun seafood in Brooklyn!  Exceeded expectations. Very crowded but service was as good as the food!", "author": "Brett B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Really fun spot. Fresh seafood and nice drinks. Would def go back with a bigger crowd.", "author": "Jane J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "So good as always !! The spinach is delicious and the $1 wings are good too ! Make sure you get there in time for happy hour !!", "author": "Micah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "The foods and drinks were good. I really loved the adult caprisuns. The extra strong ones were definitely EXTRA STRONG! The roasted clams were on point, definitely amazing. The one thing I would say was that the Cajun sauce was definitely underwhelming. Was very under salt and my friends and I all agreed that it was missing more of that Cajun flair and kick.", "author": "Magdiel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-12", "description": "It's a great place to eat. The place was delicious. Sitting on a Saturday night didn't take too long, I did reserve in advance on this app however. Again great food. Everything I and my friend had was delicious. I'll be back, but it's way too loud in there, they can certainly tone down the music. The only thing that really took away that 1 star. Bisou!", "author": "Gaelle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-17", "description": "Anything besides the boils is terrible. Dry bread. Unusually small portions of sea food. Pricey bill.", "author": "Anna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-27", "description": "Just recently opened, came in here on a Saturday afternoon for brunch. Laid back atmosphere, bar in the front and seating in the back. They have a nice happy hour menus with grilled and raw oysters and 7 dollar mix drinks in the sunkiss pack. The Sweet Georgia soju based mixed cocktails were strong. The grilled oysters were really good, well seasoned with bread crumbs on top. We ordered a mixed bag of clams and shrimp, with snow crab. The seasoning was lemon pepper with mild heat. Even with mild heat it was already quite spicy for us. The Gumbo was spicy and flavorful and the grab avocado salad was really good. Salad was a nice touch as the boil is very salty and having something to balance it out was nice. Overall its a nice place to go with a group, service was attentive, the place was nice and clean. The food was very good in general, I would definitely come back when the weather is cold and you're craving something with some spice and mess.", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "Great atmosphere good food great drinks i would definitely go back again if in the neighborhood", "author": "Moe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-17", "description": "Food is ok.   I had the catfish sandwich which was thrash.  Mash potatoes was yummy tho.  Very nice staff and customer service.  I'll come here for happy hour only. Now vibes here.", "author": "Clyde L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "The food was good! Just wish it was seasoned a bit more but I enjoyed it. The place is cute and warming! Tissues for days !! If you make a mess. The workers were accommodating also, but everything was good! I enjoyed myself.", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Lovely place, great prices and great service. The food was delicious. I will be coming back very very soon! The lobster  and shrimps  were heavenly!", "author": "Jesus M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "I've been to the location in Manhattan and it was a great experience, so I was excited to try the Brooklyn location. We came early and were seated immediately but the place fills up quickly so definitely make a reservation. Our waiter Segundo was super fast and attentive which made dinner enjoyable. We had the Sweet Georgia and Tropical Dream drink which are tasty and will definitely creep up on you. I love their Cajun Boil and I'm still thinking about when I'll get a chance to go back. 5 stars for me.", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Delish my boyfriend and I ordered the grill oysters amazing and I got the shrimp and it was a lot of shrimp good service!", "author": "Stella A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "Overall amazing! The food was great but watch out it is spicy! The drinks were killer! Our bar tender Ryan was amazing! Service was the perfect combination of attentive but also giving you your space. I'm a stickler for always having my drink filled and it was always filled up until the very closing. They didn't push or rush us out even though we were there right until the end of the night. I even left my bag there and they picked up the phone an hour later after closing and put my bag safely in the office for me. I just can't wait to go back and try more of the food and every single drink! Best dining experience I've had in a while.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-25", "description": "Nice addition to Brooklyn because there are just way too many Thai spots, and who can go wrong with an all seafood menu. The place use to be an old diner (brooklynites jeopardy) so the inside is familiar yet completely refreshing and modern chic. Simple is best when it comes to the interior, which seems to have a good amount of seating, as it can become crowded on the weekends. There is a DJ in house mixing throwback hip hop and r\u0026b, totally good vibes. Now to the food right...I had the fried catfish sandwich with fries, and shared wings, mac and cheese, devil eggs with my family. Straight to it...the catfish was OK it needed a bit more dressing on it as it was dry and the crunchy bread did not help. The mac and cheese was nothing to rave about close to kraft noodles and cheese with breadcrumbs on top (they gotta do better than that). The wings were crispy crunchy with extra breading but not bad. The devil eggs (I know who in heck orders that?!) actually were a hit for us. They were seasoned and filled just right...simple and delicious. My family had the snow crab legs, shrimp, corn, potatoes and sauce bucket lol. They both enjoyed but did say even the MILD sauce had a spice kick to it. The portions may be a bit smaller than you would like if your a seafood lover. But the prices are fare so just order more lol. I would go again and recommend you giving Claw Daddy a go! Oh and happy hour is until 7:30pm everyday!! ; )", "author": "Tee M."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}