{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-07", "description": "Came here on a Sunday and it was pretty packed and the service was slow. We only ordered appetizers and the adult pouches and everything else took a long time to come out. The deviled eggs were bland, the Codfish fritters weren't fully cooked but they did have nice flavor, the Mac \u0026 Cheese was ok but kind of dry, the garlic butter shrimp was amazing and the wings were good also. I u", "author": "Mecca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Great spot to eat. Good tasty food, the portion of my 2lb bowl wad good enough and the DJ was really good", "author": "Bob D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-11", "description": "My wife and I were craving some Cajun style food and Claw Daddy happened to pop up. Giving it a three star because the service was fine... My problem was the food. I ordered a pound of clams and I was not satisfied at all. First of all, came out to about 6 pieces of clams and that happened to be a pound apparently. What really had me disappointed was that one of the clams weren't even fully cooked. It was still closed and I did inform our server about it.. P.S, we are actually on vacation and came from California... Like I said, service was great but the food itself needs a bit of improvement in my opinion.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Glows:  Lots of fun!!! Great tasting food!!! Excellent service!!! Quick service!!!! Messy but worth every drop!!! Easy ordering and enough food to eat and share.  \n\nGrows: seats are very close.  Some customers were uncomfortable because of the closeness.  Be prepared by wearing comfortable clothes...experience is messy.", "author": "Janet H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-05", "description": "I am a seafood enthusiast and love experiencing new restaurants that offer an eclectic spin on its traditional presentation. Thus, I wounded up at Claw Daddy's, which is a more refined (and more expensive) Cajun boil experience. Although, the ambiance of the restaurant captivated me, the food did not and left me with food poisoning, which is the LEAST thing you want to endure.\n\nNow,this review is going to discuss how this was handled by the manager, Derek. I first called at noon the day after, to be greeted with a series of automated correspondences, instead of being able to directly get through to the restaurant to speak with them directly. So, I emailed the restaurant  an explanation of the situation, description of my symptoms and my concern for it occurring again to another fellow patron. Now, I haven't been able to keep anything down since I dined with them Saturday night and went to a clinic to retrieve antibiotics and confirmation of a food borne illness.  Ultimately, my weekend was ruined and spent in utter discomfort because of whatever I consumed there (I ordered Oysters,Grilled Clams, Mac and Cheese, Shrimp, and the Shrimp Boil). Naturally, I felt regret for eating there and felt it was a financial waste to have paid for inept food.\n\nSo, I finally get a call back Sunday evening from Derek. Once on the phone with him, I had to initiate the conversation and discuss the situation at hand. Not even once, did he apologize or even begin to want to find what may have caused the reaction, instead he said \"you definitely did not get it from us\" and \"its not food poisoning because it takes at least 3 hours for your body to react\" (which is completely FALSE). The combative and defensive nature was uncalled for as I never spoke without a respectful tone and made it clear that I truly felt miserable after dining with them and it was even confirmed by a doctor that it was indeed food poisoning. Prior to Claw Daddy's I felt amazing and left with hot sweats, a pounding headache, stomach pains, and violent vomiting. Derek then asked me to show proof via lab test results in order for them to believe me or even reach any solution. So, I'm not sure if this is protocol for them because this may happen too frequently where they are losing money or because he simply did not want to provide quality customer service and in the least, some sympathy. \n\nI am currently awaiting my lab results, simply to prove the agony that has caused such a disturbance in my body and even my daily habits. Once I get them I'll be glad to post on Yelp to show what bacteria this establishment was breeding .", "author": "Serena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "I thoroughly enjoyed my experience at Claw Daddy's. The location was great, centrally located near lots of transportation. You really can't beat that in Brooklyn. Our server was awesome, attentive and helpful. I would recommend making a reservation. I stopped in on a Saturday night and it definitely was a hot spot. The food was well seasoned and fresh. I suggest the Claw Daddy's special sauce if you enjoy a favorable punch in the mouth. Lastly, you can't leave without an adult CapriSun. Ahh the nostalgia...enjoy!", "author": "Lissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Amazing food...amazing service...amazing ambience! \nThe first time we went I ordered the king crab legs and snow crab leg boil. It comes with potatoes and corn. It was cooked to perfection and the adult capri suns with that extra shot...umm yessss!\nThe second we went I ordered the lobster, crawfish and snow crab legs boil and it was also delicious...with my adult capri suns of course lol. \nNot one complaint...and I've recommended them to about 3 ppl so far!", "author": "Krystal K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-12", "description": "The food was delicious, and the final was surprisingly low to the table of 6 who had some drinks and shared multiple plates and were quite full.  The music was FANTASTIC. Everytime a new track came on, someone at the table commented how great the tunes were. \n\nOnly thing holding back on the 5th Star was the service. The hostess and server might've been having a rough day, but it was quite apparent to the table they were not hospitable which slightly dampered the happy mood of the table (ie \"happy people table, meet Debbie Downer\").", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-14", "description": "I had an awful experience at Claw Daddy's in Brooklyn yesterday. First off, we had a 5pm reservation, while walking to our table, we were informed that we needed to give the table back at 6:30...how rude! \n\nOrdered the Louisiana Boil with Snow crab, clams, corn and sausages. My waiter gave me shrimps instead of the clams. Received the snow crab and they smelled funky and rotten, like they had already gone bad. I brought it to the server's attention and asked him to smell it as well, he refused and said he would just give it back to the chef. He didn't even apologize for the bad food. \n\nAbout 3 mins after, the people sitting 2 tables down from me, asked me why I sent my crab legs back, what was wrong with them. They said theirs smelled like bleach. They brought it to the supervisor's attention, he smelled it and confirmed it did smell like bleach and took it away. \n\nI'm definitely never going back to claw Daddy's. You don't serve people bad seafood!", "author": "Jay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "Seeeaaafoooood BOIL!! Southern style! They had many options and they move quickly. The food was SOOOO GOOD! The drinks were good as well", "author": "Tishonda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-08", "description": "Went for the claw feast with some friends\nEverything smelled and tasted amazing definitely would recommend to others and I can't wait to come back", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "CLAW DADDY in BK!!!!!!!\n\nFinally, one of my favorite restaurants expended to Brooklyn. We came in on a random Tuesday night because we saw that there is claw daddy in Brooklyn and we had an amazing time. Our waitress Lisa should get her own 5 star review separately from the restaurant. She was very attentive the whole time and very pleasant. We had 14 fried oysters and 2 clams, brasses sprouts, and Cajun fries for Appetizers. Everything came out fast. Within 5-10 min. \nNext we ordered 1lb of shrimp and 1lb of king crab legs. We got it with mild CD special sauce. Comparing to the city location it was a lot less spicy and a little different. Not bed by any means, but not the same. Next time I'll order medium for at least one of the orders so I can dip into spicy sauce when I want to. Another difference is that the dump the shellfish into a big salad bowl unlike the city CD where they leave it in bags and you have to get elbows deep in the sauce to get the last crawfish out of there. Anyway, I'll be back to try the rest of the menu!", "author": "Paul Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Amazing service and amazing food. Love the vibe. Second time going and more to come ..", "author": "Annabellee M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-28", "description": "Unfortunately, this place did not deliver the service I expected. Everyone talks this place up, however, be careful when going to this establishment. \n\nI attended this place for my bday dinner. One person from my party was late and I was told by the hostess that there would be a 30min wait as per their company policy. So my complete party and I proceeded to wait the entire 30 mins, only to be told by the manager and hostess that the \"new\" wait would be 45mins. If you did not want to serve our party, you could have just let us know instead of trying to belittle us by saying that we were late. Which you already \"punished\" us for by having to wait the 30mins. \n\nIn conclusion, I have never been treated so rudely for a Bday dinner. I doubt I will ever return to this establishment and I plan to let my friends and family know. No one should be treated like that and I hope they can work on their customer service skills.", "author": "Leah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "Service sucks, and the food came out cold.\n\nI will continue to go to the one in the City.  This location was a major disappointment. \n\nServers had no class or customer service etiquette. \n\nThey did however provide free shots for their major screw-ups. \n\nNever Again!", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "First things first, DEFINITELY MAKE A RESERVATION! It was so packed that we were basically sardines standing by the entrance. We had reservations and arrived a few minutes earlier so totally not anyone's fault we weren't seated the same second we walked in. The New England clam chowder was thinner than I've ever had but I still liked it. The Mac and cheese was delicious! I also ordered shrimp with mild garlic and butter and I thoroughly enjoyed it! My friends who got medium said it was pretty damn hot so be warned!", "author": "Ilana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-18", "description": "I've wanted to try this place for sometime now. I am always disappointed when restaurants don't live up to their hype. Wine there on a Saturday at 6:30, and were told it would be a 45 minute wait. We decide to get a table in the main bar area. With the theee of us the table would be packed but didn't want to wait so we were seated right away. Immediately realizing it was still happy hour our frustration was easily settled. We were excited to order drinks but didn't see our server until minutes to 7 pm. When we asked to order two rounds of drinks since it took forever to come we were declined, but still ordered one round. Of course after that we didn't see our server for a while again, so we asked for another server. The new server that came happened to be the manager , and he all owed us to order another rounds of drinks as well being that our previous round of drinks still had not arrived. He explained that with the busy Saturday evening crowd there was a shortage on the service side. Nevertheless we decided to order apps n entrees one time. We got a variety of everything to see what we liked. The food came out in good timing and everything tasted good but the service was definitely lacking. We got a two pound combo and did not receive any napkins, bibs, gloves etc necessary to eat our meal. We had to ask for napkins and everything else never came out, so we ate our crab legs n shrimp with our bare hands cuz I'm definitely not scared of doing that either but it's nice to have some protection at times. The drinks were ok, I could tell the difference in bartenders because there were differences in the same drink. The place just recently opened so I'm hoping they get it together with service, because I would like to go back and update this review to a 4 star one.", "author": "Saasha G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-05", "description": "I have been to this Restaurant on several occasions and the food is usually Delicious.  This evening I ordered a take out order of Crab legs and Garlic noodles.  After traveling over 1hr home I discovered that I was given BURNT Garlic Noodles.  I am very disappointed.  I don't think I'll be coming back.  I am so disappointed.", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "Great service, food delicious, drinks were exactly how I like them. I didn't care so much for the sauce maybe next time I'll try a different one. Def lots of flavor and more food than I realized.", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "Perfect place to enjoy this season crawfish ,awesome Kevin waiter and cozy atmosphere, great prices and free Cajun fries as well", "author": "Duy L."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}