{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-02", "description": "Nice restaurant, needs more servers, good food spice levels are really high recommend mild to medium unless u like the feeling of crying and eating * I'm Caribbean so I'm telling you it's spicy no joke *", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "Great place food was amazing...eventho I'm not a fan of heavy spicy foods and took the waiters recommendations by going with the ClawDaddy sauce it was pretty good..I will defiently be returning soon!!", "author": "Shivon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "What a great addition to the neighborhood! There are two parts to this restaurant--a beautiful bar area and a casual sit down area. Plenty of space and really kind and great service. We stayed in the bar area and made it in time for some happy hour specials which were really amazing! $1 oysters, $1.50 baked oysters and clams, $5 beers, $6 wines. We stayed for dinner and had amazing chicken sliders, shrimp po boy, shrimp ceviche and deviled eggs. All were really great and the portions were very generous. I'm looking forward to coming back to try everything on the menu!", "author": "MR S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "Claw daddy's is one of my favorite seafood spots. I recommend it to anyone who would listen. Of course when I heard there was a new location downtown Brooklyn I had to visit. Upon arrival service was great, ambiance was good but I couldn't help but notice that the crab meat was a little saltier than usual. It wasn't the sauce but it was the actual meat itself. I'm not sure why but it was significantly noticeable and made my meal a little less enjoyable. I will consider trying by this location again but if this happens again I will have to continue to go to the city.", "author": "Asha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Amazing all the time. Love the claw daddy sauce and the drinks are strong so be careful! Been there several times now.", "author": "Lotus A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "Seems overpriced for the amount of seafood but it was really good and the ambiance of the restaurant if cool.  Young feel.  Music was hip-hop which is aight but something a little softer would have been nice. Especially since the lighting is low.    Overall i really enjoyed. But just a little high on price for amount of food.  I am from New Orleans so i am biased.", "author": "D C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "I love Claw Daddy's. Their food is bomb. Their drinks are bomb. The ambience is great! 10/10 for sure. I would go to their LES location all the time, but I am so happy they are in Brooklyn now.", "author": "Alex P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "I had a really good time at claw daddy's. It was the grand opening of the Brooklyn location and as expected they had no tables (we arrived at 7:40pm and were party of 6). we didn't quit that easily - we put our names on the waiting list, joined the bar and waited for a party to be called. Now what's cool about Claw Daddy's is they offer you these \"Capri Sun\" pouches for your beverages whether it's a nonalcoholic or one of their infamous cocktails you get to enjoy it in one of those cool adult kid like treats. After 20 to 30 minutes we were seated in the dining room. It was my first time at a restaurant as such, where you dine with bibs and gloves, but I opted to take the non-messy route for my first time at claw daddy's. Instead of opting for one of the seafood bowls I had a smorgasbord of appetizers - the chicken biscuit, the garlic butter shrimp, the lobster roll and the little fish puppies. My friends ordered the seafood bowls which I did sample and I must say they were pretty damn tasty (it's part of the reason why I'm going back!) There's no reason for all that flavor to be locked up in a plastic bag and I don't have a chance to fully enjoy it. Overall Claw Daddy's was a great experience: love the food and music. My waiter was so-so but the general manager gets four stars.", "author": "Laquana B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-31", "description": "I got played eating at this place. We ordered a 1.5 pound lobster with there garlic butter sauce. I was excited until I actually tried the food. The lobster came with two pieces of the tiniest corn and two tiny potatoes (great sides). Inside the lobster there was barley any meat. The quality of the lobster was beyond horrible. When it comes to seafood of your eating bad quality you have a huge chance of getting food positioning. I'm staying away from this place and if I do decide to eat lobster it'll be in red hook.", "author": "Julius S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-28", "description": "To be honest they need to learn how to season their crab legs. $56 for mad unseasoned crab legs is not fair. drinks are the best only good thing about this place sorry. Next!", "author": "Megan T. T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "This spot was awesome! Staff was super nice! Checked In and got the Cajun Fries, ordered wings, crab Boil and two rounds of adult Capri Suns (Yours Truly \u0026 Blush)!", "author": "Crystal N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-30", "description": "Food was great. I kind of wish they offered shrimp in the bag with out the head and shell.", "author": "Shavon I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "OMG!!! The food was so delicious I ordered another round of crab legs, cajun chicken. The setting in here is beautiful and our waiter Segundo is so pleasant and friendly.  The minute I walk through the door, I was seated. The music was relaxing and the place was just relaxing. I will be back...Thanks Segundo for making my night.", "author": "Tiamaria D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "Good food, good service, a little overpriced in comparison to other seafood boil restaurants.", "author": "Tiffany J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-28", "description": "Clawdaddy's was the worst experience we got there the bartender was unattentive was Rude... i watched her make a drink use her hands on the computer then finish making drinks as never washing her hands...  Touching the lemons or mints. Make a drink didn't like it then throw it out never to wash out the cup.\nTwo two bartenders what working Sunday evening neither one showed any interest I approached the manager and ask him if these are the only girls working he went to the other bartender and I watched her say to the manager what about the other girl  when I finally spoke to the rude girl to ask the service she asked me you're not waiting for a table no I'm waiting to get a drink I don't understand why that makes it different why did it took her that long and if she thought we was waiting for a table there was still food in front of us you didn't clean up your bar area.. I left not going spent money where i wasn't wanted.\nRude and Rude..", "author": "Carla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "Great ambiance and location.  Never had an issue with food or drinks. Brooklyn's Claw Daddy's ROCKS!", "author": "Aisha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "Claw Daddy's is my favourite restaurant in NYC and I often visit the LES location. This was my first time at the Brooklyn location and I wasn't disappointed. The atmosphere was more intimate and the music was upbeat. The food is not as good as the LES location but its still up there (pro tip, order a side of mac n cheese and mix in a little of the Claw Daddy's special sauce). The Happy Hour special is one of the best around with $1 oysters, $1.50 grilled oysters and $5 draught beer. The LES location is better for larger groups but the BK Claw Daddy's is well suited to dates. One thing I would add is the food came a little quickly, there was too much on the table in one go. I would ask the waiter to slow the food down as to not overwhelm the table.", "author": "Matthew B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "This place was great. The seafood boil was amazing!!! It was just a bit spicy but it was amazing. This place has the best noodles ever!!! the noodles are with a garlic sauce that tasted pretty good. The environment was cozy and the decor was beautiful. The adult Capri suns were very good. I had the just a dream flavor and it was simply delicious.", "author": "Alondra G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-26", "description": "The waiter never packed me or my friends food he packed one order and made it seem like he packed everything we just were there yesterday last night and we felt rushed", "author": "Nasheema G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "I'd never been to the location in Manhattan, but since this one opened near my apartment I've been going at least twice a week. The staff is great (shoutout to Crystal and Soo), and the food is phenomenal. Start with the grilled oysters at happy hour and stay for the shrimp and crabs.", "author": "Brent A."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}