{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Make a reservation because this place gets packed! We started with the grilled oysters which were delicious. The cajun wings wings are just ok. Their adult capri sun drinks are strong and also available as part of the happy hr menu. As a main entree,  We had the crablegs with shrimp, corn and potatoes boil. We also tried a lobster roll with fries. The lobster roll was good but on the small side. The service is outstanding, fast and friendly. I'll definitely be back. My only minor complaint is the space is very tight", "author": "Lucky R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "This was a birthday surprise dinner and it was great!! It was packed but we had a reservation which was a plus.  The staff was wonderful, from the hostesses and our server Segundo.  Dinner included snow crab/shrimp/sausage lemon pepper boil, gumbo, catfish po'boy, buttery garlicky shrimp, Mac \u0026 Cheese, spinach and grilled oysters.  Everything was great!!!  The flavors were on point, even the spinach.  One point to management, Bay Leaf is non-digestible so I would suggest removing them after the cooking process.  Please make sure to try one of the Adult Capri Suns.  I tried the Just Dreaming and it was good!", "author": "Brooklynite P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Had a taste for seafood so i dragged my friend out the house \u0026 came here. I heard soo much about this place \u0026 was excited to come here. I ordered a Mardi Gras drink \u0026 got a combo of shrimp \u0026 snow crab legs. I wanted the shrimp with the head chopped off \u0026 i didn't mind paying extra for it but the waiter i had rudely said no we don't do that. I asked him why not \u0026 he rudely said cuz it's policy besides it's not a big deal. Then after that he basically ignored me for the rest of the night \u0026 only talked to my friend. The food \u0026 drinks was amazing. I really enjoyed it. Hopefully i don't get the same waiter when i come back.", "author": "Brianna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-06", "description": "Came here on a Wednesday night for girls night and we are glad we did! \n\nLoved the ambience and the customer service we received! Food was delicious (except for the deviled eggs). We each tried oysters for the first time, it had great flavor: I can see why are waiter recommended it. I LOVED the fries and the wings (so simple yet so good!) The only issue we had with the food was the portion size of the potatoes and corn, our server was nice enough to fix that for us. Drinks were so so but definitely gave us a buzz.\n\nI'm looking forward to visiting again...can't wait!", "author": "Anasthasia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "Went back a few times. Quality of food seemed to have changed but still decent. Realizing the portions are a bit skimpy now that I've tried more on the menu. Jambalaya is good but it's a kids meal portion. \n\nAlso in my most recent visit the service was nothing like the first  pimple of times I've been there. My mom is a big fan of the boil and wanted her to try this place out. We came in on a Saturday night. We knew we would have to wait had a sound problem with that. I was given a time of 1hr. I went back in to check the status at the 45 min mark they had my phone number wrong but still told me to wait. Waited another 30 mins. At this time my reservation for 10pm was now creeping up and waiting was pointless. I see people that came in with no reservation being seated before us. At this point I checked in for my reservation time still waited 20 mins. When we were finally seated it was at a two top with an added chair. Ordered for 3 people there were no room for plates mins you we were placed close to the bathroom sinks. Meaning high traffic and possible fire hazard. My moms crab leg bucket was placed on the floor to try and conserve room. And that's not acceptable at all min you near rest rooms and emergency exit. It took 10 mins for any server to acknowledge us. When asked about refills we got a rude no with no explanation that maybe \" oh we don't offer refills we apologize, can I get you something else.\" It's all about how something is presented. With all that being said I highly doubt I will be going back and will also be passing on this experience, after I had friends and family visit and some out of towners.", "author": "Janae W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-12", "description": "Ok I  am a little undecided on weather I like this new location or the Manhattan location better. As the original Manhattan location service is better and moves a little more organized it has no personality really..if that makes sense. This location was very fun and lively lol .This location service is very slow, but I am sure it is due to being under staffed. There were not many waiters/waitresses so it made waiting to order simple things long, but what I might say is they did handle everything well. Everything ordered came out correct and we ordered quit a lot of food. Our waiter Patrick was nice enough to even offer a free round of shots due to the wait. \n        The food itself was great. Wings nice and crispy, oysters clean and a great size and by far they have the best crabs legs in size and the best house sauce. BE AWARE THE SPICY IS NO JOKE ( ask for bread) \nThe best part of this location I must say is the dj. Everyone around deff enjoyed themselves and were singing to every song. They even had a reggae set with allll the best old schools songs. LOVEEEE the DJ!", "author": "Sade T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "I've been here 3XEACH time was a better experience. I LOVE the menu, the drinks and the OVERALL SERVICES", "author": "Inyajah T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "We had a horrible experience here for dinner the other night. Although the food was good, the service ruined it for us. \n\nWe made a reservation for 7pm and was told our table wasn't ready yet, so we decided to have a drink at the bar because happy hour ended at 7:30pm. We quickly placed our orders to make it in time, and closed our tab right away because we thought we were being seated soon. Ya right.\nWe waited almost 1 hour to be seated for a RESERVATION. After approaching the host multiple times, we got the same answer every time - that the table was paying. How could they still be paying for an hour? \nI've been to many restaurants that tell me before I'm seated that I have until a certain time because of a reservation OR that they kindly ask me to wrap up because they need to adhere to someone's reservation time. I think that's perfectly fine, and good restaurant etiquette. So I'm not sure what went wrong here. We were never updated on a wait time, which I think would be common courtesy. And had we known, we could have just ordered and ate at the bar area in that hour we waited. \n\nWe were celebrating the bf's birthday that night, so this ridiculous wait time put a damper on the start of our night. In addition, the wait staff brought us shots of some sort of cocktail (that did not taste good at all) as consolation?? Not sure. No one ever came to explain the situation or apologize to us. \n\nAs for the food, they have many options besides the seafood boil. If you decide to go the boil route, everything is priced per pound. You choose what seafood you want, what kind of sauce, and the spicy level. \nThe medium level was pretty spicy for me, and I can usually handle some spice. If you get 2lbs of anything, they include potatoes and corn!\n\nI hope this review will help management service their customers better when a problem like this arises again.", "author": "Kimmy U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "I went to Claw Daddy's with two of my friends on a Friday night. We had reservations at 6 but we came in late. I guess we got lucky because the second everyone from our reservation was there, we were seated right away. We tried almost all of the flavors of the pouches and they were delicious! Sneaky Cut and Just A Dream were my FAVORITE! The fried pickles were OK. The buttery garlic shrimp and biscuit sliders are a MUST! I was a little nervous ordering the biscuit sliders because so many people said it was so dry but ours were so soft, fluffy, airy. HIGHLY recommend. Next time I will definitely order the shrimp boil. I tried some of my friends medium spice and it was actually spicy (I'm so used to going to places that say spicy aka salt and pepper nothing else). I'm looking forward to coming back!", "author": "Panna F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-26", "description": "Always a good vibe when you hit up Claw Daddy's. The music is always good no matter the genre and they play sports on the televisions. Food comes out in timely fashion.\n\nFood is also delicious. Wings are always crispy and tasty. Can't speak for anything seafood but shrimp.", "author": "Russell B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "The service was great and food delicious. We arrived shortly before closing and they stayed open for us and other patrons. The atmosphere was so comfortable with GREAT lighting. It was my baby girls birthday and they even brought her a special dessert (that we did not order) and the owner offered us discounts for our next visit. Incredibly friendly staff and awesome food.", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Got an invite to the friends and family soft opening, and I have to say, I was impressed.\n\nThe old Jane space hasn't been wildly overhauled in the LES staple's outpost, but there is definitely a new feel in the atmosphere. We walked in and found staff who were busily preparing their space for new faces, but they were still warm and welcoming. They had a DJ who, once he got started set the tone for the night, which was upbeat and fun. The drink menu was on point, and besides stellar beer both on draught and in a can, there were generous pours of wine and champagne and crazy drink pouches to choose from. Oh and those pouches. Think Capri Sun for adults , and while they look like easy going low ABV drinks, they are dangerous ( in the \"this tastes like juice , wait why am I so drunk kind of way*). The food was also pretty much perfect: the highlights for me were the chicken biscuit sandwiches and the wings, both of which were friggin awesome. I hope these guys can make this space work for them, as they have a really good thing going on. \n\nThanks as always to Yelp, Ruggy, and Peter D for opening a new door for us (we would be lost without you), and of course to Claw Daddy for letting us check out the new space.\n-----------\n* Aka the best way", "author": "Chuck C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "OH MY GOD !!!! \n I love Claw Daddy's. Their food is bomb. Their drinks are bomb. The ambience is great! 100%for sure. I would go to their LES location all the time, but I am so happy they are in Brooklyn now. \nAnd i don't get it why some peoples talk negative about this restaurant!!  ! Thanks claw daddy i always. Had good experience !!!  \nEverything was on point and perfect you won't REGRET !", "author": "Lolita C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "I attended the friends and family opening, and tried the oysters and fries, both of which were fantastic. The space itself is pretty spacious, and seemed to have an outdoor patio in the back (can't confirm for sure, though, as I was indoors the whole time). \n\nI didn't drink, but those who I was with did, and they said the cocktails (served in pouches, like adult Capri Suns!) were delicious. \n\nOverall, this is a great addition to the Barclays Center area. As a concert junkie, I can see myself popping by here for a pre-concert dinner and drink in future.", "author": "Lorelei Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-08", "description": "Update:\n\nI went back and dined here on a Thursday night 3/7. Reservation for four. 3/4 of us waited at the bar for our 4th person. Due to the fact that one of us was standing and there were no more bar stools, we eventually asked to go to the table. The hostess repeatedly said no because they only sit complete parties. Understandable. Where things started to not make sense however, was when I asked if we would be seated at the same table if our 4th person was no longer coming... and she said yes -_-. Trying to find the logic in why we could not sit I then asked \"okay, so would you be removing the fourth chair at this table if we only have three people\" and was told no. I started to wonder if she could hear herself talk at that point. It was more than sensible for us to be seated to move out of the bar area. It would have made room for other people waiting to buy drinks and we could have got a jump start and been out sooner. \n\nFast forward, after being seated the service was severely lacking. Nice waiter, but they need to hire more of them, as well as bartenders, cooks, and just staff all around. It took forever for everything to come out. The consensus was that the claims and oysters were good, as well as the wings... but the Mac n cheese and garlic noodles were totally off; thus they should seek out advice from the Orchard Street cook.\n______\nI love Claw Daddy's! I love even more that they came to Brooklyn. \n\nOne thing that should be written above their bar is:\nDon't underestimate the soju!\n\nTrust me, I have witnessed many first timers come in here, ask for something outside of the soju territory (like a rum \u0026 coke), frown when they're given the news about how Claw Daddy's doesn't have a liquor license and only serves soju \u0026 beer, then eventually, decide to order the greatness that is the adult caprisun ('just a dream' being my fav!), \u0026 then leave very tipsy eyed. \n\nAt this particular location, you can find the soju right above the bar fermenting and waiting to take on more victims when the time is right. \n\nNow that we have covered the most important need-to-know, you should also know that you can never go wrong with the $1 oysters \u0026 wings during Happy Hour!\n\nAlso, this location having a TV is what gives it the upper hand to the Orchard St location", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-20", "description": "For a while now I've been hearing about these adult capri suns so after a day of running behind karate practice and swim meets daddy needed a drink. I came here after learning of the new Brooklyn location figuring this is the opportunity I've been waiting for. Now I typically like my drink more \"manly\" but this was the perfect blend of libations and nostalgia. I had a couple needless to say and yes I'll be returning for a boil pretty soon", "author": "Areal F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-24", "description": "Only thing is they don't give you less than a pound.\n\nThe drinks were very good but the food Jesus!!\n\nThe shrimp, the corn, the crab legs and I don't even like crab legs.. all superb. Best seafood spot I've been to!", "author": "Cutty P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Attended their Pre-opening event. The decor is a very modern, and elegant. We had unlimited clams, shrimp, oysters on the half shell, it was delicious. The sauce I  had was perfectly spiced.. The seafood was very fresh as well. There was openbar, and everyone loved the drinks. You must visit!!!! If you truly love seafood, this place is it. Don't forget to wear your bib and gloves...", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-08", "description": "The drinks are on point the adult Capri sun is amazing. Will definitely come back again. The grilled oyster are a most have along with the grilled clams. Bartenders are the best big shot out to Crystal, Sharvon, and the young guy too", "author": "Ali B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "Recent review:\nOps, they did it again. Amazing service, food and drinks. We finally ate the dungeness crab with the spiciest level. Oh yeah, i felt like having botox on my lips with numbing sensation of the spiciness. This is no joke! \nHad some dislike but the shift leader fixed the issue and we truly thank him for his hospitality. \nPlease give me a bigger table because we always order a lot. Will be back soon! \n\nLast review:\nIt was an awesome experienced last we had. Dined on Monday with family. Greeted with friendly host and server was attentive and accommodating with our request. Unfortunately, they don't offer dungeness crab and the spiciest level option. Baked oysters and clams were so fresh and juicy.....the quality of the food were definitely worth the visit. This is a hidden gem and will be doing well once \"", "author": "Jasmine W."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}