{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-23", "description": "yum! \n\nI love seafood boil! \n\nfirst thing you have to know is that you should make a reservation. this place is crazy busy all the time, for a reason. \n\nThe last couple of times I've been here I got the 2lb combo - 1lb of shrimp and 1lb of king crab. I believe the shrimp is around $17 per pound and the crab is MP, in my case it was $35. (lobster is also MP and when I went it was $45 for 1.5 lbs) \nThey have a bunch of sauces you can choose from but I always go for the CD house special sauce, which is a mix of everything. I like to add extra sausage and potatoes to the boil. seriously delicious! The crab was juicy and tender and the shrimp was cooked perfectly.\n\nWe also tried their french fries which were actually really good and their mac and cheese \n\nand don't forget about the drinks! those are so good! Their adult capri sun drinks are strong and also available as part of the happy hour menu for $8 and $11 regular price. It's like juice honestly so be careful!\n\nThe service is fast and the servers are happy to help and give recommendations. Also the space is very tight and loud.\n\nI would say this is more expensive than what you would assume, so be prepared.", "author": "Ellie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-01", "description": "I seriously don't know where i want to begin with this review. I really don't want to give 2 stars but i have to give some credit to the server/bartender Cristal because she did do a good job in hindsight. \n\nWent on March 31, 2019. Random last minute outing. We got there at 10:00 pm and called from outside to see it we can be seated. Found out we could be seated at the bar because the dining area was closing and the kitchen was closing in 15 minutes. Not a problem. The young lady who answered the phone was also the person who greeted us at the door, seated us at the bar, and she was also very pleasant.\n\nNow we are seated and Cristal promptly hands us menus and informed us that she needed to take our orders right away because the kitchen was closing and she will take our drink order after if we wanted. Fine!! Cristal was literally a one man show!!! Cristal was handling the bar, handling food orders etc. at one point i had to ask for a rag to wipe off the counter because she did not have a chance to get to it and although other employees were around the area not one took the initiative to do it!!! \n\nFood arrived promptly. It was excellent!!! That was the best thing about the dining experience but the other shit that had to be endured was left to be desired. I'm paying for a complete dining experience. Everything matters. \n\nDiscretion is not exercised at this establishment AT ALL. While we are waiting for our food, another waitress comes over to the manager to complain very loudly and very obnoxiously about her table wanting some birthday dessert. Regardless of what the issue was -- whether they were right, wrong, etc we -- the customers did not need to here her profanity laced tirade. \n\nNow this part - another waitress gets into a domestic incident with her boyfriend. Another waiter intervenes and it was just a spiral down effect. The argument goes outside ... all her coworkers are sitting around discussing it while people are trying to eat another customer goes outside to intervene. It was just disgusting. Meanwhile not one of these employees decided to help Cristal when she needed it. But that's between them.  But when we inquired about why no one was doing anything - the manager said this happens at least once a week between the waitress and her boyfriend and another employee goes \"yea something is always going down in here.\"  Really????\n\nNeedless to say that was my first and my last time eating at the Brooklyn location. Some things just are meant to be. The Orchard Street location may be crowded and a long wait at times but I'll stick to that one. This Brooklyn location is horrible!!!!! And we voiced our displeasure there. We couldn't even pay our bill because of all the ratchet shit going on. I was literally begging someone to come get the payment so i could leave. \n\nI really hope the service and environment gets better but i will not return to find out.", "author": "Brittany J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "The food was great and so was the service. The lemon pepper sauce was good, a little spicy but good.  Worth the trip. Thanks for the recommendation Saravine.", "author": "C. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-26", "description": "I'm giving 3 stars because when I arrived I was unable to get a table and was told I can sit upstairs and be served appetizers and drinks, I didn't mind this however I wasn't really served. I had to keep getting up and going downstairs for the waitress whenever I wanted something. \nThe drinks were good the food was okay, nothing amazing.", "author": "Brittany J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-06", "description": "Food is mediocre and pretty pricey, but an absolute unprofessionalism of this place is when you want to order normal beer - this place does not have any.\nGTFO! YUCK!!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "Came back again for a friend's bday dinner. The food was awesome. There was no wait and our waitress was really nice. We had the shrimp and lobster boil. I came with corn and potatoes. We didn't need the extra potatoes because we also ordered the seafood nachos, grilled oysters and wings. We were stuffed. Also the Yours Truly drink was so delicious and tropical. Only for an additional $2 you can make it stronger. This drink had Prosecco and Soju. If you love seafood come check this out.", "author": "Geraldine E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-07", "description": "So I fell in love with claw Daddy's from the original location on orchard street in the city. I had to give the Brooklyn location a try! The first experience was great, our waitress was attentive and quick, we were so pleased went again a few days later, A COMPLETELY DIFFERENT EXPERIENCE! The restaurant was damn near empty and it was just two of us so we requested to sit at a booth because all the two seater tables where wobbly and really small (which we noticed on the first visit but it was sat nite and we were lucky to get a table at the last min) they made a HUGE deal about keeping the tables open for other parties larger than 2 and it blew my mind because they had just opened at 5 it was about 530 and no one was there and if the customer wants to sit elsewhere why not try and accommodate rather than create conflict. Also, as we were finishing our food the lying ass waitress said we couldn't order food to go from our table we had to close our tab and go to the bar...really?!? Because we did the same thing less than 3 days before and our waitress made it happen! \nLong story short- great food but the service is meh! The space is much better than the orchard street location but I'll truck to orchard street to avoid the the inconsistency in service", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "I love New Orleans and it's Cajun food so having claw daddy in the city brings me close to it. It's super worth the bang for you buck. All drinks and appetizer are good as well. Never had a problem with this place. Even more excited when they opened a location in BK", "author": "Shanelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-18", "description": "My best friend and I came on a Friday night around 6:30 and it it wasn't too packed. They had happy hr until 7:30 so we were happy we were able to catch it. We ordered the \"Just A Dream\" caprisun pouch ($7)  which was amazing (we had a few). We also ordered the grilled oysters (happy hr at $1.50 each) the seafood nachos and the Cajun wings ($1 a wing).\n\nThe nachos are def a must try when coming here it was just the right amount of seafood and the flavors were all on point. They come with jalapeños which you can opt to take off... but we love spice so we kept them on.\n\nThe wings on the other hand were a no go. If I wanted regular fired chicken I would have gone else where. There was no \"Cajun\". I was very disappointed so we sent them back.\n\nThe drinks are great!!", "author": "Brittany F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-06", "description": "Dope last minute meal and they did not disappoint soo much food don't think I finished", "author": "Kia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "I went to Claw Daddy's for a friend's birthday dinner and it was my first time eating Cajun cuisine. I've been to NOLA before but I never bothered trying their crawfish till I got back to New York. I knew this time of cuisine is and extremely popular and what perfect occasion to see what the hype is about. \n\nWe were seated fairly quickly since we made a reservation and were given our menus right away. Afterwards we were asked to order drinks and I got the typical adult Capri sun drink. We also decided to order two of the large combos and some fries to share. Overall, it was a great experience and I enjoyed the concept. It was family friendly, great for groups and you can really tell everyone was enjoying themselves.\n\nThe environment, atmosphere, people, amazing food and amazing service makes me want to come back! I have converted to a lover of Cajun food and crawfish.", "author": "Belle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "This place is in a great location with plenty of street parking.  The seafood is delicious! I had lobster and king crab, truly perfect. \nThe service was attentive,  They even looked downstairs for a lobster fork for me, and they found me one!", "author": "Karen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "This place put me in a strange, dazed state. It was pure food induced bliss. I love seafood, and the seasoning they use is killer. I got a pound of shrimp and a pound of king crab, mild,  with the garlic butter seasoning, which is the original Cajun, with garlic and butter. I didn't realize how much two pounds is, until I couldn't finish everything. The king crab was difficult to cut open on account of what I can only describe as its thorns, but it was worth the effort. There was corn on the cob and a few potatoes in the mix, and they were both fantastic, but if u were to get extras of something, it would be the corn. The Cajun fries which came complimentary with my check in were crispy on the outside, soft on the inside, and perfectly seasoned, and let's not forget the ingenious cocktail in a bag! Perfect for caprisun enthusiasts, the cocktails are sweet, yet sophisticated deliciousness. I tried the Mathilde, Sweet Georgia, and the blush. They were all incredible! Fruity, but not artificial. I would so come back here, a million times yes!", "author": "Celia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-13", "description": "My boyfriend and I came to claw daddy's for dinner last minute and the hostess did a great job to squeeze us in for a table in the bar area. The food was amazing - I am pretty sure we got the claw daddy's special sauce and it was the most perfect sauce to flavor the crab boil that we got", "author": "Robyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "IMO they have the best of what you can get for your money in terms of quality in the city of New York. No they don't compare to nan one of the finer seafood restaurants in NOLA, but it is what it is. \n\nAnyway, I've had their crab legs to go, right along with their seafood gumbo and both were pleasantly delicious. When I came to pick up my food, it did take some time, more time than was estimated.\n\nI've also eaten inside the restaurant, had the wings and sautéed spinach and Mac and cheese. All pretty decent. I love the drink pouches \"for kids,\" Capri Sun style.\n\nThe service was up to par and the decor pretty cool.", "author": "Shana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-30", "description": "When we first entered the restaurant we were seated right away. The waitress was very nice ;however, We had to wait awhile to order for some reason even though the restaurant was not busy. We came during happy hour so the oysters were one dollar each. We also ordered the lobster roll, the king crab legs and the shrimp ceviche. The lobster roll was okay. I usually like the toast on my lobster roll warm but it was cold. So if you are like me then I would not suggest this. Also I feel like I did not get enough lobster meat. On the positive side, the king crab legs and oysters were amazing. The shrimp ceviche was okay as well. The flavor was good but the shrimp felt rubbery. It was a good experience. I would recommend trying.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-18", "description": "nice\nPlace is clean and quite\nFood is fresh and delicious \nCashier are friendly and sweet\nIf they can make food faster, I would rate 4 stars", "author": "Hasmukhnayahangan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-21", "description": "1st time at this location and it was really just ok! The drink I ordered was called yours truly which was good I did enjoy it however the food ahhhh it wasn't that good I had the grilled oysters and they were so tiny not worth it al all and I also got the snow crab boil with corn the food came out quickly however it was cold and I mean like refrigerated cold it wasn't busy so who knows the reason but I didn't enjoy it.. \nMy server was nice she explained the menu well and checked on us but honestly my brother and I didn't want to complain but our food was cold how??? It's a boil!!!!", "author": "Billie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "Great ambiance, the crab legs and claw daddy sauce is very delicious and flavorful. Staff was attentive", "author": "Sasha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-21", "description": "Enjoyed my experience at Claw Daddy's. Will certainly recommend and return.\n\nWe came for happy hour. The specials including $1 wings and oysters and $7 adult caprisuns amongst a few other things. Definitely recommend the fairytale (extra shot for $2).\n\nPro: We ordered two lbs of the snow crab and king crab legs (for two people) in the Claw Daddy Special Sauce which is a combination of all the sauces on the menu also with a medium spice level. Also added in sausage. It was definitely tasty and filling.  \n\nCon: Only downside to this was they say if you order the 2 lb combination the potatoes and corn would be included, but we only received two mini potatoes and probably two mini pieces of corn. For the price of 2lbs of crab I definitely would have expected them to add more. \n\nCon: Weren't too impressed with this wings- think they needed to be marinated in seasoning longer before cooking.\n\nPro: But can't beat $1 wings. \n\nPro: Our servers were very attentive and helpful. It was my friends birthday and they gave us courtesy shots! \n\nCon: We asked for garlic butter dipping sauce on the side and was told it was $2 (which is fine if it's made fresh however the size is incredibly small. \n\nOverall great time!!!!  Can't wait to go back.", "author": "Anita S."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}