{"aggregateRating": {"reviewCount": 239, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-13", "description": "Where the hell do I start.... Okay well I guess I'll begin with the fact that it was mothers day and we arrived with a party of 4 ( myself, my mother, sister and brother) we were seated and our waitress only brought out 3 cups of water then stated she was waiting for more cups to come out of the dishwasher to give us the last cup of water. After returning with the last cup she said she would give us a minute to order and she'll be back to answer any questions or concerns , after about 5 minutes we realized she hadn't returned yet so we began looking around to see if she was coming from the kitchen or bar area but nothing...she had completely ghosted our table without any word . At this point we grabbed the attention of another server and asked if he could tell us where our waiter could've went and he replied he wasn't sure but he would be happy to take our order. He proceeded to take our orders and continued to apologize for our waiter ditching us. Meanwhile he's still has to focus on the two tables on both sides of us so halfway thru taking our orders he had to stop to walk off and make sure another server ( I'm assuming a new employee) was bringing the food to the proper table. When he came back he wrapped up our orders and then read it back to us before putting the orders in. Our appetizers come out and its great but now we're waiting for the entree but then a few moments later the same guy who took our orders asks us to reiterate our order one more time because for some reason the entree part of our orders weren't put in. We restated what we wanted and again he apologized for the inconvenience because its alot going on in the kitchen etc....we assured him that none of this was his fault because he wasn't assigned to our table and he was trying to accommodate us because our waiter ditched us while also staying on top of his already assigned tables. We then put in our drink orders and they all came back quickly but we all thought that they tasted horrible...the nice guy took them back and we asked for the homemade spiked ice teas instead which we've had in the Manhattan location so we knew what to expect with that choice. The iced teas came out and it tasted like someone boiled a tea bag and gave us unsweetened ice tea with ice in a pouch that wasnt sealed nor spiked as we ordered. The young man serving us took the drinks that weren't spiked off the bill but to be honest, collectively we were all exhausted from the constant fuck ups and apologies for the service to still be mediocre....the drinks were gross both times yet the food was AMAZING as expected but the service was ASS and I'm upset to say that because the young man who took care of us by no choice of his own was AWESOME and ATTENTIVE however because he had so much on his plate before taking on our table he had to be reminded of things quite a few times and a million apologies made the overall experience really messy and for this being my moms first time eating here it was kind of a let down because we had such an incredible experience at the Manhattan location. Oh yea and to top it all off our original waiter never showed her face for the remainder of the night, in fact upon us walking out (which was closing time due to us having late reservations) we saw her outside with her coat already on ready to leave which left us further confused and irritated.  BROOKLYN WILL NEVER SEE US AGAIN", "author": "Shanae Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "The raw oysters were great.  It was worth coming down on a sunday for the happy hour prices.", "author": "Denny T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-19", "description": "Claw Daddy's is a 3 star for me. I've been there numerous of times and they overcook my seafood all of the time and it makes me super upset, especially with shrimp because it makes the shrimp mushy. They're seasonings taste good and they're portion sizes are good as well. Also the servers I've had were pretty good also, this is why I give them 3 stars. They're drinks are boring and it doesn't taste good, I literally force myself one time so I wouldn't waste my money smh. Lastly, they're ok aka cool so if you want an ok seafood spot, go to Claw Daddy's", "author": "Sarafina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-12", "description": "Food is good but the environment isn't great. The restaurant is small n you feel like you're sitting with people you don't know, also the waiters aren't the nicest, they don't speak, just drop you're food off and go and he cleaned up my table without asking if I was finished and moved my personal belongings.. Other than this the food is amazing!!! maybe a new/bigger location would be nice ;)", "author": "Kasandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-04", "description": "It was SOOOO GOOOODDD !!! STEP ASIDE HOT N JUICY! I mean this place was so good. The crab was perfect and easy to crack although they bring u everything u need. Loved that they give u crayons for the table paper. It was fun. And when I tell u that juice pack is SO DANG GOODD! I felt it was pretty strong for a $7 specialty cocktail. And the bag is unbeatable. So cute. I got the one with coconut and it was amazing. I don't really like coconut but pinacoladas are great when done right. THEY know how to do it at Claw Daddys. Nice sweet strong and creamy but not too creamy that it interferes with all the spices and seafood. Food also came extremely fast (especially compared to hot n juicy) I personally feel like the vibe. The cleanliness of restaurant. The cost. The taste and options are better than HNJ but that just my opinion. No long wait time or anything. Fries were also super bomb. I was not feeling the fried wings tasted old barely any chicken on the bone and it was brown instead of white..would've sent them back but my date enjoyed them and was the one who ordered them lol. I ordered potatoes and they give u about 4/5. It was amazing. And no gross bag to deal with! They plate it for u right in front of you. Also. . Get this ... REAL LATEX GLOVES (I'm sure there's an option for non latex too ) I love that they don't give u those fake cheap plastic gloves because my hands STILL end up smelling like fish and seasonings soooo badly after for so long. But once I washed my hands the smell was instantly gone. No lemon wash needed. (That's how u get the smell out. Rub hands with fresh lemon/lemon juice) will def be back to try the fried oysters!", "author": "taylor b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-17", "description": "They got good drinks, the food it's like it had no flavor other then the one you choose. I think they should marinate the seafood more.", "author": "Manolo B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-02", "description": "I don't know what the hype is about! Came in for dinner with a couple family members and the wait was HORRIBLE although I called in advance to make reservations. The servers are not attentive at all (it was really busy so that may have contributed to it), the food is mediocre at best (I had crab legs and the sauce was weak and not flavorful). The coconut drink pouch I had was good! Really tasty and semi strong (in terms of liquor). Really nothing to right home about!", "author": "Kamryn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "I love claw daddy because of the decorations and vibe. The food is really good quality and the price is pretty high but ultimately I leave very satisfied.", "author": "Kelly Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-02", "description": "First time at the Brooklyn location. \nCool vibes, good music and great HH specials.\nAdult Capri Sun is good at HH prices. \nGrilled oysters were tasty.\nHad a pound of snow crab legs with a side of sausage in the Louisiana crab medium sauce. \nThe food came out quickly after placing the order.\nNOT GOOD.\nLack of flavor and seasoning. Crab legs and sausage tasted like water. \nWill return for the HH but will not eat seafood.", "author": "Tara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "This place is amazing. The adult Capri sun's are really refreshing. Please try for yourself. You will not regret it. I'm sorry that I don't have much photos to share.", "author": "Tamra G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-13", "description": "Love the setup and decor of the restaurant. The service was on point ! There was no wait to be seated even though I did not make a reservation. They have a happy hour on Sunday on their adult caprisuns which are cool. The mac and cheese needed work. I felt like it was made from box mac and chesse- Kraft. The shrimp appetizer was definitely good. The cajun seasoning was spicyyyy! I ordered the mild cajun and my lips were on fire. The snow crab legs were a decent size but they could have been marinated longer in the cajun seasoning.", "author": "Tay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-21", "description": "Had an amazing experience here. Food and drinks were really good. Our server Patrick was very attentive. Definitely will be returning.", "author": "Barrington M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Visited the Bklyn location because of a deal on Pulse for $45 for 2 people included 2lbs of shrimp, clams, corn, potato\u0026 2 drinks each w/a side so I chose my fave the garlic noodles. Our server Patrick was very nice. The food arrived quickly \u0026 was delicious.", "author": "Savarra J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "food was great. nice spice level. served hot asf. enjoyed my date night. thanks guys.", "author": "Brianna W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-06", "description": "This place was amazing. I was very excited to go there with one of my good friends. We had reservations and got our seats quickly. As we walked to our seats we can smell the delicious aroma. We got to our seat but it was very tight. There was not enough space to become comfortable. The servers were really nice and told us we had a time limit to eat our meal. We got our drinks in a timely manner and was able to order quickly. The food was absolutely delicious. I got the crab legs, they were huge. I would definitely go back but I wish it had more space and I didn't have a time limit.", "author": "Audra M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-01", "description": "I went to the Claw daddy in Manhattan and I have NOTHING BAD to say about it. Now this Claw Daddy in BK food was wayyy different!! The food was FLAVORLESS The shrimp and crab legs sauce was good but the meat taste like water! The corn on the Cobb and potato taste like water!! I had to keep dipping the food in the sauce!! My grilled oysters taste like the grill! NO FLAVOR NO SEASONING. I won't be coming to this location again! The bill was over $100 and I was upset!! I could've went to Stop and shop to have them steam the food and went home to eat!! I have 2 stars because we did have good customer service", "author": "Alexis P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "So Finally made it to the Brooklyn claw daddy's. I came on a Friday night and was seated in less than 10 minutes. There was a d.j there playing all the good tunes, everything from the 90's to 2018. The food was delicious!!!! Everything on point !!!! But the seating was way to close to me . No room to get down and dirty lol without people judging .", "author": "Stacee F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-12", "description": "I read the reviews about this location and I was hesitant about it at first with so many complaints about service, price and the food not being worth it. I was staying at a hotel very nearby, so I decided to go anyway. It was worth it. \nThe only bad part about my experience was with being seated. I had a 9:30 reservation for two, but the word reservation seems to have taken on a new meaning with many places as my 'reserved' table wasn't ready even though we were 10 minutes early. The hostess told us to wait at the bar and she'd come get us shortly. After waiting twenty minutes, we asked her how much longer we'd have to wait and she asked for my name and reservation time again (she forgot about us I assume), then sat us shortly there after. \nFrom there, it was smooth sailing. I'll start with the music since it made the wait more enjoyable. They had a live DJ, which I found to be a nice touch. He was playing a great variety of old and new rap and r\u0026b. It made the place very lively as a lot of people were feeling the tunes. \nOur waiter quickly attended to us once we sat down. We weren't ready to order, but as soon as we were, he was there to take our order which I appreciate because the place was really busy. \nOur food and drinks came out quickly. We got a pound of the snow crab legs and the shrimp with the crawdaddy sauce and mild spice. The mild packed a bit of a punch, so be careful if you're not into spicy food. The food was delicious. They provide you with a bib and gloves because it can get messy diving into the food with your hands and sauce dripping all over the place. They also have more conventional options for neater eating, but I highly recommend the crawfish boil. Our drinks were pretty good. They also packed a punch, but weren't too harsh on the taste buds. \nThere were no surprises with the bill. It wasn't the cheapest, but far from the most expensive. In total, the food, drinks and a decent tip came out to $85. I'd give this restaurant 4.5/5 stars.", "author": "Jude A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "I'm so glad they opened a location in Brooklyn. I went here on a spur of the moment. The atmosphere is soothing and the music was great. I ordered the snow crab legs with a variety of the adult caprisun flavors everything was excellent! My waiter, Sue was super busy but that didn't stop him from giving us his undivided attention. My fiancé and I liked everything about this restaurant it's the perfect date night or girls night spot. Will definitely be back.", "author": "Tee H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-28", "description": "Hey folks..I enjoyed myself at Claw Daddy's New Brooklyn location. My friends and myself enjoyed the decor, music, staff and cleanliness of this location however it doesn't measure up to the Orchard Street location. The food was just ok. It's like there was  some missing ingredient or something....womp, womp.  I'll visit again in a few months, hopefully by then the chef will have caught up to my expectations.", "author": "Lex G."}], "servesCuisine": "Cajun/Creole", "priceRange": "$11-30", "name": "Claw Daddy’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "31 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yHXnuAF__scHqWvsGVIzAg/ls.jpg", "@type": "Restaurant", "telephone": "+13473188893"}