{"aggregateRating": {"reviewCount": 23, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "A classic bagel/coffee shop. They have your traditional bagel/cream cheese situation (with some interesting cream cheese options) and some breakfast sandwiches. I think I got a sausage, egg, and cheese on a multigrain bagel, which was delicious (pretty hard to mess up.)\n\nThe other food offerings looked decent, too. They had a lot of salad bar options, plenty of drinks. It had a little bit of seating, too.", "author": "Herbie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "This place was definitely a surprise--in a good way. I work nearby and my coworkers and I eat lunch out regularly. We normally go to another bagel place but we were looking for a bit of a change to our routine so we gave Casella's a try thinking it would be a basic bagel store. It only has a few bagel options but it has so much more and it has a full sit down area with booths that we were not expecting where a waitress waited on us. They have a full menu ranging from breakfast staples of pancakes, French toast, eggs and waffles to Cuban sandwiches and gyros. I got one of the most expensive items, an avocado omelette with peppers, onions and cheese, and it was only $8.00 or something silly cheap.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "\"Bagel Coffee Shop\" may be a modest name, but we're talking full fledge diner status.  Featuring an easy order-out area, seating availability in the back with waitresses on deck, and more options than the joe shmoe Bagel Shop you're used to.... We're talking an entirely new twist on what a Bagel Coffee Shop can be.", "author": "Joe G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "Love it here.  Fantastic deals on the hot foods counter for lunch.  Food is delicious authentic and reasonably priced.  Give it a shot you won't be sorry.  I got for the chicken or the pork.  Also for your sides they include rice and beans as 1 side like the good lord intended.  Enjoy your meal, salute", "author": "Joe B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-13", "description": "I asked for everything bagel with egg and avocado and little cream cheese. Came up to $4 something. The bagel was dripping with cream cheese that didn't even taste good. So disappointed, was meh.", "author": "Achiaa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Hidden gem! We stopped in based on another Yelp! review stating that it was a full fledged diner, and it was, but without the diner feel. Our waitress was attentive and so friendly. The breakfast menu was massive and everything came pretty quickly. I would recommend it for anyone in the area looking for a delicious breakfast.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "This place wasn't good at all. The sandwich was tasteless and lacked spices and salt. The omelette and whatever weird white stuff was laying next to it wasn't better either. But the absolute worst was the coffee. It was so bad I couldn't drink more than a tiny sip of it.\nThe atmosphere was weird, too. I wish I never wasted a breakfast in New York in this place.", "author": "Sascha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Great - came here on a random cold Saturday with my partner for a quick breakfast bite {note, NOT brunch}. We ended up having \"brunch\" - omelettes and a sausage sandwich. The waitress was very attentive and the place was no frills - very Brooklyn diner, which I like. The prices also reflected the low-key nature of the establishment, and the clientele was not presumptive. Overall, it was great and if I need a low-key bite again when around the neighborhood, I know where I can count on to not pay $20 for eggs and mimosa.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "This is the way to go for some inexpensive lunch. The spot looks dingy because it's a small place but they have your average diner options in addition to Spanish food. I had no idea but i already ordered a chicken Caesar wrap. The staff is friendly and helpful. The wrap itself was big and tasty. The grilled chicken ACTUALLY has flavor. It was so big I only ate half. I cant wait to try the Caesar salad or even their Spanish food. Wrap was $7...not too bad for Dwntwn BK and for the size it was good. Oh they have breakfast options too.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-26", "description": "What can I say Casella ? This place is good.\n\nThe set up of Casella is pretty cool.\nMe and sis were walking around Jay St one morning and got pretty hungry. We didn't find anything that appealed to us then we saw Casella and settled on coming here.\n\nAs we chose a table to sit at, we ordered a Hazelnut Iced Coffee and Bacon, Egg \u0026 Cheese sandwich.\nThe food was prepared rather quickly.\nThe Iced Coffee had good flavor (dk which brand they use) but I liked it. As of the BEC sandwich, I've had plenty of those and enjoyed this one as well.\n\nThe staff here are friendly based on my experience so far.\n\nOverall, good place to sit down for a quick breakfast or lunch :)", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "Ehhhhh. Nice fancy looking store but thats about it. I ordered a everything bagel with cream cheese and bacon. If u like way too much cream cheese here's the place to go. If you like mushy bacon. Here's the place to go. And now that I think about it. I had one slice of bacon on my sandwich broken in half. Smh. Anyway your better off getting a bagel from the corner store. Save ya money.", "author": "Vizzy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-16", "description": "Worst Cuban Sandwhich Ever. Bread was not crispy but, kinda stale. Not really sure if they used pernil they made today or what kind of ham they used but, niether one had any flavor just very very salty. Pickles were mushy not crisp and had that tangy flavor of being opened weeks ago and sitting out. I asked for mustard and mayo and it was no lie, a thin coating. Just not a very good or well put together sandwhich. And the coffee was so murky you can taste that pot after pot was tossed into that pot continuously all day.\nPlease take your tastebuds and hard earned money elsewhere. DESERVES ABSOLUTELY NO STARS. Even the staff was dry and boring like the sandwhich which required a 101 ounce bottle of water with all the salt.", "author": "Papilindo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "I walk past this place on Friday mornings and I can't help but stop in! The breakfast food and friendly staff sets the workday start with smile! \nI typically get to-go orders but dine-in service seems to be quick and pleasant. \nGreat breakfast spot!!", "author": "Candice R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-23", "description": "The bagel was mediocre.  They only had regular creme cheese.  I could have easily went to the grocery store and made my own bagel.  Nothing special.  The coffee was equally as mediocre.  I had a Americano and it tasted like instant coffee.  Beware, it's a $5 credit card minimum.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-13", "description": "It's insane that they do not have menus?? Not even online?? Food is good, delivery guys are nice but, come on now with the menus.. we need to know prices..", "author": "frank g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-26", "description": "I asked for bacon and egg on a roll today. I got bacon and eggs with cheese. I'm allergic to milk products and bit into the sandwich.  I brought it back and tell them I'm allergic to cheese. They make me a new one, I'm out the door and check the sandwich outside, cheese again, unfucknbelievable. Now I'm sick.  I won't be back! If you have a food allergy do not eat here. No comprenden", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Arguably the best Cuban sandwich in Downtown Brooklyn. Very reasonably priced and friendly little diner.", "author": "Billy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "I stayed near this small diner for 5 days. I ate breakfast there almost every day. The ladies who work there are so polite and quick, and the food is really nicely prepared. It's much better quality food and service than anywhere else I tried in the last year in nyc!", "author": "Jay B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "Clean fast, overall a good experience. They had an affordable breakfast. 11 dollars for two breakfast sandwiches and 2 home fries.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Love this place! I don't know how long they have been open, but it cannot have been long-I've always looking for well priced healthful options in this corner of town. Go for their bagels; they are honestly the best I have ever tried. Very fresh, soft inside and crispy shell. I don't know how they do it.", "author": "Alexander R."}], "servesCuisine": "Cuban", "priceRange": "Under $10", "name": "Casella Bagel Coffee Shop", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "66 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Y5je6HSdyJdFkw34TkFU3Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185225641"}