{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-20", "description": "It's a shame when someone puts items on their menu, but falsely advertises based on their misunderstanding of the food. Where do they sell quesadillas without cheese? Please, someone tell me?? My coworker and I ordered quesadillas today. And guess what I was expecting based on that order? You guessed it-cheese!! Unfortunately that did not happen when we got our order. The only reason hers had cheese is that she requested \"extra cheese\" for an additional $.50. Mine came without any, and both had dry, over cooked chicken on a stale wheat wrap that was totally undesirable. When we called, they agreed to replace my quesadilla as I explained that it is false advertising to call something a quesadilla without all the proper ingredients. They asked me if I read the menu. Read the menu??? Did you ever read the standard list of ingredients of the item you're serving at your establishment? Apparently not.\n\nOh yeah, then the manager decided it was a \"waste\" to replace my order with cheese and offered to send cheese instead.  I declined because that is a slap in the face and a piss poor solution which shows their lack of customer service. Never ordering from them again.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "This is a delivery experience, not sure what they are like in the store. \n\nWhat I ordered: chicken club with no bacon\n\nWhat I received: chicken on bread. None of the tomatoes, lettuce or ranch dressing that was advertised :( \n\nPlus the food was cold\n\nSad!", "author": "Brianna J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "Disappointed with my choice to get a sandwich here, rather than a bodega. $6.50 for a vegetarian sandwich with VERY little cheese on a STALE roll.", "author": "Karen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Since this store opened it has changed my life for the better,  I get my dinner here,  I do my grocery shopping and if I'm lazy they deliver anything I want less then an hour.  A real game changer!", "author": "Omar H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Really love this place. It's become mine and my wife's go to place for a little of everything. The guys there are super nice and always wanting to help. \n\nCleanliness is key here. This place is always spotless. \n\nHad a few sandwiches here and I enjoyed them.", "author": "Deep S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "Waaaaay overpriced and their staff isn't friendly. There are other places to support including Blueberry Farm. The folks are much nicer there and the prices are better. Avoid.", "author": "Chris T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-01", "description": "Sometimes they have nice deals. Produce is pretty good and not too expensive. They also have lots of deli options for fresh made salads, sandwiches, etc   But two times now we've bought \"on sale\" chicken only to get home and realize it's rancid. They've also frequently over or under charged me for purchases and I've had to go back and get it fixed. A decent spot for groceries in the area, but pay attention to checkout and expiration dates!", "author": "Kat G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "-Exceptionally good and helpful staff (they went out of their way to help me out after a misfortune, for which I'm much  obliged)\n- Decent variety of organic goods, though limited fresh groceries.\n-very reasonable prices for an organic market, at times cheaper than foodtown etc.\n- Their sandwiches and salads are not mindblowing, but they're always made with fresh ingredients, and are decently priced.", "author": "Nuri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "This is my favorite deli to get food from the area. They have a large selection of food, pastas, salads, etc. My favorites are the California omelette platter and the beef burger! Delicious! Fresh. There is a bit of a wait but it doesn't even matter because you're getting delicious food. I think it's obvious with how busy it is at dinner time. They also have a great selection of ice cream, juices, and produce.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Ordered from here today and waited over two hours for my food. After the delivery window had passed, I called in and was told the food would be delivered in 5 minutes as the delivery person had already left the store with my order. A full hour later, the food still wasn't there and the store now refused to pick up the phone. When it finally arrived, I had already picked up food from somewhere else and the food they brought me was cold. Avoid and order somewhere else.", "author": "Amber M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "My go-to place for sandwiches. Whether I'm ordering at the counter or for delivery, they're fast, friendly, and the food always hits the spot. Their selection of cakes and cream pies seals the deal too. I love the triple decker turkey sandwich and the caprese sandwich. Burgers aren't their strong suit, though, and I've had both good (yum!) and bad (where's the cheese??) experiences with their quesadillas. Stick with the paninis/heroes/sandwiches and you can't go wrong. It should also be noted that their fries are surprisingly good for a deli.", "author": "Meghan W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "Nice to see the changing neighborhood allows for fresh \"wholesome\" produce as if we weren't deserving before becoming so cool, trendy and hip. Why not stop in, at least I don't have to travel all the way to manhattan anymore for almond milk and vegan ice cream, thanks hipsters...YEAH NO THANKS! Visually appealing store and I spent more than anticipated so I figured Id use my debit card. Mind you, I never use my card as I am a pay cash type of person. The one time I do I am bombarded with suspicious activity on the very card I used at the market the following morning. They took hundreds upon hundreds of dollars using my pin number. You have been WARNED. DO NOT SHOP HERE AND IF YOU DO, ONLY PAY CASH.", "author": "E A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "This is my go to place on Seamless since I moved to Bedstuy. I love their juices, great iced coffee, and create your own salads!", "author": "Timothy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Finally ! A place in the neighborhood that sells the cleaning products I use (Mrs Meyers), the stuff I love to drink like Kombucha, \u0026 Honeydrop brand drinks. They even have moichi ice cream bon bons (which I love), and Talenti. I purchased a magnificent grass fed steak here once, and often purchase the lump crab meat from here to put on my salad. Everything I've purchased has been delicious and fresh.", "author": "steph c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "A much needed addition to the neighborhood. Their hours are good and the selection is really solid too. It appears they don't sell any pork products, which is unfortunate for this bacon lover, but for that and beer I just go to Blueberry Farm across the street. I deducted a star because although they do sell a limited amount of poultry \u0026 meat, the brand of chicken breast they stock is absurdly overpriced. $20+ for 3 boneless skinless breasts is not how I get down. But a small gripe for an otherwise good shop.", "author": "Y R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "I ordered delivery from this place the other night. I was happy to see that they had several vegetarian and vegan options considering that many other locations in the area do not. The food arrived on time and everything was delicious. I highly suggest giving their food a try, especially if you're vegetarian or vegan.", "author": "Gina P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-25", "description": "I just left this market completely turned off!  I ordered the 2 egg platter with eggs over medium, beef sausage and hash browns.  When i receieved my order the person at the counter and gave me a side of hash browns.  I asked him why did he give me homefries and hashbrowns, the menu said either or and I selected hashbrowns.  I figured it was a honest mistake but I didnt want to be charged for that mistake.  The person took the container of food back, opened it, removed my eggs over medium and beef sausage with his barehands and placed it in another container.  The yoke broke and the eggs were now destroyed and smashed in the corner of the container.  I was completely grossed out by the fact that he didnt have on gloves and was cross contaminating food.  He then made someones sandwich without washing his hands.  I checked the hands of the others behind the counter and they had on gloves!  After he handed the container over to me, I proceeded to the counter...hungry as hell...but not hungry enough to ingest germs or bacteria!  I handed it over to the cashier and told him that I can not pay for the food and told him what had happened.  I walked home...sad...breakfastless....and now I am eating oatmeal.", "author": "Nia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "This is a wonderful store. Great selection of grocery items and produce. And the food counter has, among other things, great and reasonably priced wraps and sandwiches. The staff is always helpful and friendly.", "author": "Leslie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-18", "description": "They regularly have near expired or even actually expired products that they try to sell for a \"discount.\" A small can of Goya beans is $1.79. I enjoy watching the hipsters and gentrifiers get ripped off, but there are plenty of other stores nearby that are much better and don't try to bamboozle their customers.", "author": "A. H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-24", "description": "I have mixed feelings about this place; I want to like it so badly, the staff are lovely and their market selection is wonderful, but I've been ordering sandwiches there at least 3-4 times a week, sometimes every day, since the day they opened and they literally mess up my order 9/10 times.  When they do get it right, it's delicious.  I'm sympathetic to the fact that they have a huge deli menu, but even when I order a basic sandwich \u0026 they are not crowded, they mess something up.  Ordered a hero today, got a sandwich on a bagel, and I was one of two people ordering with 2 people behind the counter working.  I should have learned to check my order before I check out.  I've run out of excuses to make for them.  I hope this makes it to the right people behind the deli counter: I know you guys are new \u0026 I was hopeful that after a couple weeks you'd get into the swing of things and stop making mistakes, and I really want to keep supporting this business, but please respect customer's orders.  You're in a neighborhood where people pay a premium for everything and don't necessarily have a lot of disposable income to spend on food.  Sucks getting the wrong order 90% of the time!", "author": "Chelsea B."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Wholesome Farms Market", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Efz2CGcrujqPLqRFYJ1j0g/ls.jpg", "@type": "Restaurant", "telephone": "+17188726299"}