{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-22", "description": "Wholesome Farms Market is a new bodega that sits on the North-West corner of York and Jay, diagonally across from the York St. subway entrance. Hopefully this prime location will give them better business than the previous fast-casual tenant of this space--Dumbo Kitchen--as they inked a 15-year lease.\n\nI was one of the first inside after they opened this weekend and it is sparkling. This has never happened to me before, but the feeling of walking into a brand-new bodega is akin to putting on a pair of brand new socks. It brings the satisfaction of being in something 100% new, 100% clean, 100% perfect. I hope they can keep it feeling this way.\n\nWholesome Farms sits in-between a traditional NYC-bodega and a grocery store. For locals, it has better stuff than Bridge Fresh, and a broader selection than Foragers. However, it is also priced between the two. It is a good competitor to Peas \u0026 Pods, but with a much better location to take advantage of the subway commuters, and the residents of the new block-wide condos coming in across the street.\n\nI found that the aisles were better organized and arranged than Bridge Fresh. I found that the meat and produce was fresh, shelves fully stocked, and they had depth of choice in almost all selections. All this could go away in a week though, remember, I did visit on day 1. Time will tell.\n\nNo bodega cat as far as I can tell, which is a plus considering the rank smells coming from the produce aisle in Bridge Fresh.\n\nThe Deli / Juice / Salad bar seemed to have a great selection of pre-made, and available-to-order items, though I did not partake this time. Employees were a tad slow at the register, but again, it was Day 1. They give out nice big paper bags for groceries instead of plastic.\n\nI'm excited to continue going here over the next few months and see how it keeps up. If I haven't made an update to this review, you know they are still doing a great job.\n\nYou did lose a star because I couldn't find my $0.99 Arizona Green Tea haha", "author": "Matt C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-12", "description": "Wholesome Foods Market (not to be confused with the other WFM) has finally opened in DUMBO, taking over the space of the previous DUMBO Kitchen (which may or may not have been run by racists).\n\nWFM is your run of the mill fancy grocery store with a deli counter with hot sandwiches and a salad/juice. Basically Peas and Pickles, but closer to the F train.\n\nWent to get a sandwich at lunch, and it was a shitshow. You can order from anyone behind the counter. And then you just stand there like an idiot in everyone's way waiting for your order (not a lot of space to stand, plus it's right by where the lines are for the register).\n\nI got the Ghost Rider sandwich (chicken, bacon, cheddar, and bleu cheese dressing). It was fine, and they charged me $1 less than what was listed. Not sure if that was an error or they just wrote down the wrong price. They also didn't call out my sandwich when it was ready, so it was sitting on the counter for a bit (not sure how long).\n\nOther than that, it was a pretty solid sandwich, but nothing special. Scratched the itch for something hot and melty.\n\nOh, and they don't sell beer here.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-24", "description": "Overpriced. Larger portions can be found at Bridge Fresh for less the price. Waited ~5 minutes at the front of the line to pay, in that time, a line of about 10 people formed behind me. Meanwhile, a man walks in through the door, orders a coffee, and gets served first. The other two cashiers left their stations, leaving the 10 people waiting with only one cashier to serve them.", "author": "Jeffrey Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "If you want to get ripped off then by all means come shop here. I got charged almost 5 dollars each for a BEG, and 2.79 each for a jar of Earths Best Organic baby food. The men working here aren't even accommodating, or polite. The guy charged me a lesser price, then 3 dollars more the second time. \n\nEdit for the stupid people who can't read. Below is an updated review:\n\nI'm not sure why my husband chooses to order from here but this time is the LAST time I will step foot into this store. \n\nMy husband placed an order for pick up, and didn't finish up on the app so I put \"Do not forget the cheese\" since for whatever reason they always forget the cheese on his sandwiches. \n\nI went there at the time the notification said my order would be ready. My order wasn't ready, and when I walked up to the register to inquire about how long it'd take the younger guy at the register said \"That's the lady who put don't forget the cheese.\" When he said this everyone at the back looked at me with scowling faces. \n\nWhy would you be upset that a customer who ordered a cheeseburger would tell you not to forget the cheese? Is it because you guys purposely do not put the cheese on our sandwiches? Is it because you're having a cheese shortage? \n\nEither way I think this is some game they play with customers they do not like. Which is sad because this place could have some potential if other owners took it over. \n\nI think the people running this place should feel privileged to own such a shop in America. But it doesn't mean you can be rude, and play with people's money. Good riddance.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-31", "description": "I was in the area and wanted a quick bite for lunch. Saw thar the deli section looked pretty good and decided to try the wholesome breakfast wrap. It tasted good but very small for $5.99. I'd probably eaten 2 of them w/o a problem. The grocery sections look like they have everything you could need. I doubt the prices are though.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Friendly staff. Good food. I had the Italian tuna salad sandwich. Looked like everything in the deli was fresh and clean. Ice coffee was really good", "author": "Ana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "High quality offerings at reasonable prices. Salad was a great lunch choice + they have a ton of veg \u0026 vegan friendly options in their produce section.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-02", "description": "2nd time I've ordered from here. The food seems to be good. The only issue is the time for delivery. 20 minutes outside of the window. They delivered cold fries. Probably best to ordered during the day, when they're not overextended. Nightime ordering, was way too slow.\n\nI like the choices they have. Not many places, have many choices, in regards to variety. That's a reason for me to continue giving them business.", "author": "Michael Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "Horrible customer service. Ordered for my nearly 90 year old grandmother. They called her said they were coming and never showed. The doorman also said no one from this business showed up, let alone was buzzed up to her apartment. The store manager kept saying it was delivered, then spoke to the delivery person. This jerk continued to lie and the manager stood by his lying a** employee. No apology and a little belligerant. I told him what I thought of his service and immediately called Seamless for a refund. They deserve-5 stars", "author": "Dakeeta G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "love this place !  been ordering from them almost every day now . obsessed with the veggie reuben! fresh food and fast delivery", "author": "Liv C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Yay, free samples here!!! \n\nWhen we entered the deli, they were giving out free samples of panini (turkey pesto) and it was soooooooo good. I ended buying the panini along with a hearty sandwich of rye bread, honey roasted turkey, American cheese, tomato with mayo. The only issue I had was the prep cook used peppermill turkey instead of honey roasted turkey. He repeated my order when I told him so I was wondering why he kinda screwed it up. Oh well. The sandwich was pretty good so I didn't make it a big deal.\n\nThere is alot of nice food products in this store; it's really like a mini Whole Foods since they carry alot of organic, specialty name brand items and they're also expensive as hell too. \n\nUnfortunately, this place isn't really on my way home since I take a different route but if I can, I would definitely come through again.", "author": "Gail C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Definitely one of the cleanest place you can come in the neighborhood. It is relatively new to the Crown heights area. It is at a great location so you can drop in before you on the train. I would drop by for there breakfast and lunch. The food here is fresh and delicious.  They are staffed well where they are taking orders and getting you out quickly.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "We are in town for a few days and stumbled upon this walking back to our airbnb from a subway station. It was late and not much was open, so we stopped here for food. We were surprised to see the abundance of food here: snacks, breakfast, frozen meals, vegetarian meat alternatives, produce section, etc. There was a deli, salad station, and some desserts. We ordered a burger with fries and a falafel sandwich. The falafel was a little dry, but it was good for a late, quick bite.", "author": "Alexis P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "They are open late, Very convenient. I\nVisited the store and was impressed by the product selection and the friendly staff.", "author": "Adam W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-25", "description": "Go here if youre curious what the absolute worst bacon egg and cheese sandwich is like. Its arguably creative how it all turned out.", "author": "Angel R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "Pros: Produce is fresh and healthy.  Hot foods are usually put together well and the staff is very friendly.\n\nCons: Prices. Prices. Prices.  God damn is this place expensive, you can get the same thing at Key Foods down the street for a fraction of the price.  The deli counter is reasonably priced, but those guys are swamped back there with delivery orders, lunch orders, etc. and it takes FOREVER for them to make a sandwich.  Why am I standing here for 20 minutes waiting for one sandwich?\n\nI'd rather go to any other deli counter, get out quick, and pay less.\n\nHighly recommending that others in the area do the same.", "author": "Brendan D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "First I'll start by saying that I love the food. The chicken salad triple decker is to die for. Unfortunately that's overshadowed by the worst customer service in North America. To provide a bit of context, I'm a manager at a restaurant in Manhattan. I manage a staff of 150 with a daily forecast of about 25k. So I get dealing with people. I understand hospitality. I understand high volume. This place has none of those things. \n\nThe first time I ordered from them I ordered from their website. Waited an hour for my food. My card was charged. Then when I called, they said that website isn't active and they only take orders over the phone. So where's my money? How do I get it back. 25 bucks gone. Still to this day. \n\nThe second time I ordered was a few days ago. The guy answers the phone and says \"wholesome\". I said \"hey is this wholesome foods?\" He says \"yeah motherFUCKA!\" I say \"excuse me?\" And then the kid starts saying \"oh shit I thought you were my friend calling to prank!!!\". I then get a call from the manager and he tells me that it's his nephew and he's 15 and he's taken a day off of his schedule as punishment. Which I don't really care about. The kid is 15. He doesn't need this damn job. He doesn't care. More than anything I wanted an apology and I didn't get one. The manager said \"what else do you want? I told you I disciplined him\". I'm like \"idk maybe an actual apology. Maybe a free meal. Something to compensate\". He's like \"absolutely not\". \n\nSomehow. Tonight. I was desperate enough to order a third time. I ordered my chicken salad triple. The guy on the phone says he'll call back in a few minutes to collect my card info. An hour later I call him back and he's like \"oh shit okay I'll take your card info now\". Then when the food arrived I realize it's the wrong sandwich. So I call and ask for the correct one to be delivered. The guy says \"okay so you already got fries so I'll deliver just the sandwich\". I say \"uhh since I have to wait another hour for my food, please add fries to the new sandwich too\". He tells me NO!!! \n\nSo now I sit here waiting on my food. It probably will have saliva in it because they've shown what kind of people they are. I seriously do not recommend this awful place.", "author": "Gabriel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "The staff is friendly. Food is delicious \u0026 the store is well maintained. A lot of items are deff over priced but it's a great store to have in the neighborhood especially if your trying live a more organic \u0026 healthy lifestyle.", "author": "Shawn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-23", "description": "Nice looking store. Hard to feel like you're not in the way all the time, though. Prices on most items are exorbitant, as you might expect for a place with \"wholesome\" in the name, but deli prices are reasonable.\n\nPhilly cheesesteak was pretty good, perhaps a little light on meat. Fries are thicker than I prefer, but decent.", "author": "Meghan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-31", "description": "At first yes, totally yes. \nBut then the pomegranate seeds left..then they took away away the chocolate chip brioche, last was the strawberry lemonade. So  after basically the only good things I would go in for has left, now stands a basic overpriced store..you can literally find better quality right across the street, plus the crew across the street isn't nearly as dumb as the brainless bodies standing around this place, smh. Delivery is a complete waste of time. And if you're looking for NORMAL mustard, they don't have or know what that is.", "author": "Stefano G."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Wholesome Farms Market", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Efz2CGcrujqPLqRFYJ1j0g/ls.jpg", "@type": "Restaurant", "telephone": "+17188726299"}