{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-25", "description": "so incredibly disappointing. For anyone who went to the OG down on John Street, these are sad, sad, sad. Skip it, unless you're a tourist.", "author": "Jules S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "I was around the area and was craving some korean fried chicken . So i came to try this bonchon location.\nThis location is located right next to the train station and is newly open. \nOverall my craving was satisfied and they provided great service.\nReally liked their fries wing and coleslaw.\nThe wings has just right amount of crisp meat and sauce, just the way i like them.\nWill definitely be returning if im around the area.", "author": "Gina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-05", "description": "Nice new addition of Korean Fried Chicken to Downtown Brooklyn. The food is your typical Korean Fried Chicken but the fries were disappointing and the bibimbap was just average. I believe they are working on their bar license possibly which will definitely attract crowds from the nearby hotels. They do have a nice lunch special which i still need to try. One tip especially for the summer. Don't sit by the door cause you can barely feel the air conditioning. I was sweating while waiting...", "author": "David H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "Finally don't have to go to Manhattan or Queens to get me some Bonchon! This place looks brand new.  It looks like they are still waiting for their liquor license but in the mean time, water is just fine.  I would recommend getting the onion rings and seasoned fries.  The onion rings were fried to perfection and were some of the best I've ever had.  The seasoned fries were great as well.  They were thick enough so you had some mashed potato right in there.  The bonchon chicken was the main attraction.  The spicy wings were more flavorful than the soy garlic.  If you can handle spicy, these should be no issue.  Again, I recommend the spicy or the regular ones. \n\nPricing here is normal for bonchon so I can't complain.  I just know these are much better than getting wings at buffalo wild.  Service is quick and attentive.  I will be back here to fulfill my future bonchon cravings!", "author": "gary m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "I've never had Bonchon before but ever since they've opened near Metro Tech, they're overwhelming popular.  I had their Korean Fried Chicken which appears to be to popular go to for good reason!  \n\nTheir extra crispy chicken was absolutely amazing!  I had their lunch combo which included a mix of both soy garlic and spicy.  Both sauces were fantastic but the Soy Garlic was really the king.  The combo mixed wings and drumsticks and also included a side.  The drumsticks were huge and would probably exclusively order them next time.   \n\nMy buddy ordered the fried rice which looked great and he loved.  It was a huge porition of rice that was a made a great valued lunch.\n\nThey have an entire bar area with what appears to be a pending liquor license.  Would be very excited for when that goes through to come for a happy hour. \n\nGreat atmosphere, fantastic food, good service, and plenty of seating available at tables and bar.  I will certainly be back to Bonchon for some amazing Korean Fried chicken!!!", "author": "Joe G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-06", "description": "I was in the area and decided the yelp what was new and had great reviews. I was in the mood for a little japanese food so me and hubby decided to come here...i was so hungry i ordered the lunch special rice and chicken and spicy chicken slides and seasoned fries. Hubby got the chicken on the lunch special and a drink. The rice was not the best I've had it could've used some fresh lime juice but i didn't ask for any... the slides were ok, the fries were good. Bae hated his chicken, he didn't like the breading it reminded him of being in high school, i tried it and i didnt like it either..if i go back its to try the salads, the salads look really good.\n Personally the food was over priced (not worth the portion, especially the chicken)", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-20", "description": "Happy to have thus outpost open by the office. The lunch specials are reasonable and filling. Pictured here is the half soy half spicy chicken with Cole slaw. One of the better locations, hopefully it stays consistent.", "author": "Rivya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "Great service, great food, and excellent drinks. Definitely a go to spot for a cute date or lunch with friends. Very affordable, no alcohol type of joint but the food so good you don't even care about it.", "author": "Anastasia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "My coworkers and I came for lunch. We got there right when it opened at 11:30, so we didn't have to wait for a table, but the place was pretty much packed when we left - around 12:15. \n\nThey have a lunch special, which is a pretty good deal. We got two orders of the wing and drum combo with half and half sauce, the tteokbokki, and the seasoned fries. \n\nThe chicken is always made to order, so it was really juicy and fresh. The tteokbokki was good and the kimari on top was delicious, but I felt like the sauce was missing something (im not sure what though). The seasoned fries were perfectly seasoned, but I don't think it was worth the $5.", "author": "Claire Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Was running errands during my lunch break and happened upon Bonchon.  I remember seeing one when I worked in Manhattan, but I've never seen one in Brooklyn, so I stopped in to give it a try.  The spicy chicken wings and the cole slaw were delicious.  My only gripe would be the wait time.  I went in during lunch to place an order to go.  Took 20 minutes.  But it's worth it.  So good!  Next time I'll just place a phone order for pick up (no delivery).", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "I have a lovely time with my coworkers eating here.  The food were AMAZING.  The chicken wings and the drumsticks were flavorful and crispy.  However, the spiciness can be intense for people who aren't accustomed.  My favorite dishes are the avocado salmon and the kimchi bacon fried rice. . Just writing the review is making me drooling.\n\nThe decor is minimalistic and clean.  The lighting and the vibe gives a really comforting and cozy feeling.  Waiters are accommodating and friendly.  Definitely will come back!", "author": "Kathleen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Overall:\nThis is a good place to get quick and good Korean fried chicken, along with a good selection of other Korean dishes in a non-pretentious environment. It's located in a neighborhood that doesn't yet have a ton of good food options. \n\nDrinks:\nI think they have mostly beer, sake, and soju. \n\nFood:\nSo far I've tried the Chicken Wings, and the Kimchi Bacon Fried Rice, with a side of just kimchi. The kimchi is really good I recommend getting some if you like kimchi. \nThe Wings are really solid, classic Korean fried chicken wings. They come in either soy garlic, or spicy. I opted for half half. The size of the wings could be a bit bigger, but they're not bad. If you want bigger wings, Boka in the East Village has what you want, but Bonchon is a great alternative. Flavor is great, crispiness is good, and the spicy ones are actually spicy, which I loved. \nThe Kimchi Bacon Fried Rice was great. Big portion, and the flavor is awesome. Decent spiciness from the kimchi, and nice saltiness from the bacon. You can tell there's actually a good amount of both kimchi and bacon in here. \n\nService:\nService here is attentive and quick. Servers were all very nice. \n\nAtmosphere/ambiance:\nIt's a pretty decent sized space, which you can't really tell until you get inside. Pretty long bar, with tables lining the opposite wall. Can probably accommodate various party sizes.", "author": "Jerry W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "I'll start by saying that my review of Bonchon is probably gonna be biased because I looooove bonchon's fried chicken. Korean fried chicken are my favorite, there is no other kind of fried chicken that I love more. Whenever I get the urge to eat unhealthy I go to the Bonchon at Fulton street, Manhattan and binge on those chicken. Sadly they closed the place. So when I saw the \"opening soon\" board at Willoughby street, I walked by that place atleast once a week hoping that it will open one day. Few months passed and it finally opened but I was on a stupid diet so I went to the smoothie place near to it and had the healthy smoothie. Anyway, I finally decided to go to this place on a Friday night after a 2 hour workout (I convinced myself that I deserved it) since my plans got canceled. So there I was at 10.05pm, it was pretty empty because duh anybody but me would have plans on a friday night. I wasnt sad because IM GETTING BONCHON FRIED CHICKEN. I was gonna get my usual combo which has wings and drumsticks, half soy and half spicy and pickled radish. The woman by the cash register told me that they ran out of drums but I was still happy since they had wings. So I ordered that and waited for a looonnggg time for my order. There was three other people who were also waiting for stakeouts but other than that the place empty. Noone was dining in but it was almost closing time. In the end I went home and had delicious chicken. It tasted as expected, delicious, moist, yummy. I dont plan to have it frequently though cause it's over 800 calories so if you're not calorie conscious so ahead and start binging on these delicious chickem", "author": "Aishwarya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-22", "description": "Pros: Wings is what u would come for they are great. Fries are great too Service is great\nCons: No Alcohol seems like they are still waiting on license. The Setting and Location are", "author": "Manuel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-21", "description": "while in nyc I found this wing place it was so good the Hala chicken takes a little more time but it's worth it and fry different sauces. The lines can get long but be patient it well with it.", "author": "RICHARD J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "I live close by and thought I would give this a try for a quick dinner. For what it was - it was ok. Food was relatively inexpensive and also relatively bland. Very comparable to Applebee's. \n\nI likely won't be returning.", "author": "Derek S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-01", "description": "Update:\nYelp compliment from the employee:\n\"I see you Chinese students do not want to leave any tips, really ashamed, you ran out the door in, and even forget mobile phones, it is serves you right, your voice is very noisy, should go to eat no service fast food，An ugly boy!\"- Singsing W.\n\nIf this isn't a concrete example of rude or shady, I don't know what is.", "author": "JiYoung M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-26", "description": "Disappointing. Wanted to like this place as live close by but don't think we'll come back. Ordered wings: meat was dry, crust was too hard, and not enough sauce. Tasted like frozen chicken I would expect from a fast food place that costs 1/10 the price. Bibimbap was equally disappointing. Was extremely bland and almost flavorless. Only dish I liked was fried octopus balls topped with mayo and Bonita flakes, which is pretty hard to mess up but it was good. Atmosphere could be more inviting, was dead empty when we got there but service was fine. Overall, waay overpriced and quality of food was way subpar from what i was expecting. The area could use some good restaurants, this one just won't be if for us.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Korean Fried Chicken! Tried half/half, Spicy and Soy Chicken. Both were good in there own flavored way. Went back for the Pork Buns, was not a huge fan of it. Lot of more fat than meat on the pork. Seating is available. Customer service is good. Came for chicken and beer, but no liqueur yet. Its in down brooklyn, so you can shop and eat.", "author": "Joanne N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "3.5 stars. Manhattan bonchon prices. Ok paying $25.00 for fried chicken but should the wings and drumb stick be bigger? Looks like a lot but some of it were tiny. Ordered the half spicy and half soy. It was pretty good but beware the spicy has a kick which I like. Also had the Korean rice cake. It's not bad but think the cheese can melt a bit more. Overall the service was ok. Some were nicer than others. Pretty busy place on a sunday. Food can come out hotter temperature wise would be better. Also the music here could use some good old kpop.", "author": "S.H. L."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Bonchon - Willoughby", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Willoughby Street", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/bd6orAYStxK8ncc98jgLzQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185966078"}