{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "My friend and I came here on a Thursday evening as soon as they reopened at 5:30. The restaurant was pretty much empty except for one other patron. We were greeted and seated immediately and had one of the kindest waitress in New York. She literally was full of energy and ready to serve. \n\nI ordered the coconut ice tea which is definitely amazing and I would come back for that alone and of course for the main event I ordered the chicken in the soy garlic sauce/flavor. The chicken is well seasoned and well fried no complaints here. You get the option of cole slaw or a side of pickled radishes and because I hate mayonnaise I ordered the picked radishes and I have to admit it was really good. \n\nFor dessert we ordered vanilla and coconut mochi. Neither of us had it before and it was an interesting experience. Overall I really wouldn't rush back here because it's just chicken but if your craving crispy fried chicken I definitely recommend Bonchon.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-07", "description": "Food was good. No alcohol avails. Sad party of 10. \n\nCame here on the advice of a colleague. My fault for not doing my homework.", "author": "P F G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-30", "description": "Relax - Die Hard - BonChon fans!!!!  My blood is full of BonChon \u0026 ain't slowing down.  I want to say - this branch (understanding each Franchise may differ in techniques) has some work to do.  It's fairly new, and like all newly open shops, there are minor kinks to be worked out.  \n\nLove the decor, the openness, and the service, A+!  Unlike their sister branches in midtown, it always feel so jammmmmm... however, what those branches lack in service - they got their recipe down to the Z!  Total Perfection. Making those big a$$ crowded lines addicts. (As their slogan goes Addicted Yet?).  Perfect balance of texture - crispiness - soy garlic or spicy - moist tender wings; total euphoria!  \n\nBonChon Willoughby, needs to perfect the balance of seasoning and tender wings.  I ordered 30 wings + Ttoekbokki (this was OK) to go and ate 2 wings on the train, because I just couldn't resist. Don't worry, it was an otherwise empty car.  After just one bite, I knew my beloved soy-garlic isn't there. It was lacking the balance of sweet soy and the garlicky taste.  I would still rate (1) BonChon on 5th ave, (2) Midtown west BonChon on 38th and the rest about the same. \n\nI also tried their Salmon Avocado Ball, which is total goodness! Just yummy textures dancing in my mouth! And also tried their bulgogi bibimbap... it was OK. I've had better ones. Perhaps no runny egg? Idk. Something was amiss. \n\nOverall I had a very stuffed lunch, spent a pretty penny and made my fam happy when they saw the red \u0026 white bags. #chickenandbeernight", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-23", "description": "On a stroll home after work was hungry and in the mood for something good to eat I came upon this place being that it looked new and quite clean and had a sign saying they have the best wings I had to give it a try. \n\nThe place is quite spacious and has a really long bar which is great for anyone dining alone. I proceeded to look at the menu which as big as a photo album with everything well pictured which gives you a better idea of what you are ordering. \n\nBeing that I was starving I decided to order a variety of things from the menu I had the pork buns, steamed shumai, fried chicken in two different sauce and Cole slaw, french fries and chicken tacos.  I wanted more but was told that was more than enough food for two people.  \n\nMy friend and I didn't expect it to be so much food for two being that we were hungry. Well let me tell you I like everything except the steamed shumai I didn't like the sauce that was on it I rather mine with a brown sauce. The food was by far delicious the service was excellent and I can see me coming back  again to try something new off the menu.", "author": "Almaria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "I've been loving Bonchon for about 8 years \u0026 was so sad when the one on John Street in the financial district was closed. So imagine my excitement about when I noticed one opened in Brooklyn close to home. The food is always amazingly prepared \u0026 always taste delicious. I highly recommend this place.", "author": "Rosemarie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "You must get the spicy chicken: got the heat with the flavor. And the rice? Delicious! It's a great spot for an impromptu, casual night out with the boo or a small group of friends. They pack the food so neatly and perfectly so it would be great for take out as well. Will return", "author": "Lise-Ethlyn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Decisions, decisions, decisions.... sometimes it takes me some time to decide what I want to eat, but the wings are always on deck, as is the coconut ice tea.  It doesn't really matter because everything is always fresh and tasty! \n\nThe staff is very pleasant and accommodating, which is why I always enjoy coming here.", "author": "Lora R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-09", "description": "This Bonchon outlet in Brooklyn is really close to home so we thought we'd give it a try. \n\nWe came here for lunch on Sunday. The restaurant does not open till 1:00pm. It was very spacious just like any Bonchon restaurants. Note, they do not serve alcoholic beverages as of yet, but they serve mocktails if you are up for it.\n\nWe ordered KFC (Korean fried chicken) beef bulgogi and kimchi. Our orders came out in timely fashion and the chicken was tasty. We did however find ourselves grossed out by their bulgogi, it was covered with layers after layers of onions, we even have to shove the onions aside to find the beef (and this is not exaggeration as the picture proved it) we don't know what's the deal with that and when I mentioned it to the manager he simply said that they're just following the Bonchon recipe directives which was quite hard to believe.\n\nI guess I won't  order anything other than fried chicken next time, since that's really the only reason why we're there in the first place!", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-24", "description": "What happened to the chicken?? I've been to Bonchon in Allston and Harvard Square countless times during my years in Boston, and always felt that Bonchon was my favorite of all Korean Fried Chicken restaurants.\n\nI was thrilled that there was a Bonchon near me in Brooklyn, and came here for the lunch menu. I don't know what happened but the chicken tastes nothing like what I expect from Bonchon chicken. None of that flaky crunchy wet spicy savory chicken that I'm used to. It was a dry bready flat chicken nugget. It was as flat as a baked or reheated chicken nugget. As a Bonchon fan, I was utterly disappointed. I also ordered a bulgogi bibimbap, which I enjoyed at least. The fries are top-notch and brilliant. All I have to say is that this location's Bonchon chicken isn't up to par with their other more established locations. \n\nTheir liquor bar isn't ready yet, and the restaurant looks very aesthetically pleasing and clean on the inside. Still doesn't make up for their disappointing chicken.", "author": "Lychee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "People tell you that marriages need work. No, they just need fried chicken.\n\nBack when she was too young to know better, I took my now wife out to Bonchon (in Manhattan) and she somehow conflated her love of deliciously crisp Korean fried chicken with not completely being disgusted by me. \n\nSince Manhattan is insurmountably far now, the past few years she has seen me for what I am (not great). As such, we were both so happy to hear that Bonchon opened up dangerously close to our apartment. I give her soy garlic/hot chicken combos, and she remembers that she doesn't hate me after all. \n\nThe first couple visits we made the mistake of trying to eat \"balanced meals.\" We would order a salad, bibimbap, shumai, tacos...no. Just no. They drizzle honey mustard on the shumai, and I'm not into it.\n\nGet the KFC. That's what you're there for, that's what they do right. I'd roll with the pickled radish to go along with it, but my wife also likes the cole slaw. And as previously mentioned, she likes me again too. \n\nThanks Bonchon.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Before we lived to see Phil Collins tonight, we lived to eat at BonChon Brooklyn. Not disappointed at all in the food- it was absolutely perfect. Servers were nice and attentive. \n\nI ordered:\nCombo (wings and drumstick- small), steamed rice, kimchi\n\nI wonder if they're working on a liquor license? \n\nI wish they had Korean dramas playing instead of football... ;/", "author": "Ange C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-10", "description": "Pretty solid fried chicken, especially for the neighborhood, which has a dearth of good food options if you don't want to walk 10 minutes south.\n\nThe ingredients seem fresh and the chicken is crispy, but not overly breaded. Both of the basic flavors they offer are relatively light, so you're getting friend chicken with sauce, not sauce with a bit of chicken flavor. If you want a stronger sauce, ask for a side of the bibimbap sauce on the side.\n\nThe big menu is tempting, but stick to the fried chicken. The bulgogi is the blandest bulgogi I've ever had, and I say this as someone who doesn't like most bulgogi because of the overly sweet sauce. Here, the sauce has no flavor and the meat isn't good enough to stand on its own.\n\nThis place is pretty expensive for the neighborhood, but I guess I can't complain since it's in roughly the same range as Yaso Tangbao and it's aiming at a similar market.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "Very good chicken wings! I got their lunch special which they served between 11:30AM to 3:30PM Mondays through Fridays only, excluding holidays. I choose their combo of 4 wings and 2 drumsticks half and half (3 with soy garlic and 3 spicy). The spicy ones were no joke. I had to save the soy garlic for last to cool down my taste buds. This lunch special also came with a side and I chose coleslaw. All of this costed about $10 before tax and tip. Not too shabby!\n\nWill have to come back and try the other items on the menu as I've never been to a Bonchon chain and the wings impressed me.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "Bonchon is known for their korean fried chicken. If you've ever tried their other locations you'll know what it's all about. If not, they're extra extra crispy chicken in either soy garlic or spicy sauce. They have an option of getting wings or wings and drumstick combo. The side of radish is a perfect addition. I'm so excited that they opened a location in Downtown Brooklyn. \n\nThey also have bimbimbap, fried rice, etc. I've never tried it at bonchon because I always get the chicken, but it's a good option to have in the neighborhood.\n\nI recommend calling ahead to order for takeout because it takes a while for the chicken to fry so you'll be waiting for at least 15-20 min if you don't call ahead.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "This was actually my first time at a Bonchon Chicken joint. The edamame ($6.95) was good - hard to mess up edamame. The boneless wing platter ($13.95) came with two options for sauces - spicy or soy garlic (or a combo). It also comes with a side of either cole slaw or pickled radish. Portion was decent and the wings were crispy on the outside. They were light on the sauce, but I found it to be a good thing. I preferred the spicy sauce. \n\nThey apparently just had their soft opening, so the bar is not fully stocked yet (just soft drinks so far), but it seemed everything else was in place. The space is very clean, modern, and fairly spacious. There are some TV screens at the bar, so could be a good spot to watch games over wings and beer in the future. There are still some kinks to work through, but overall, they seem to be off to a good start!", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "A nice addition to downtown Brooklyn by opening Bon Chon here...Passed by the place several times during lunch hour and it has been packed between seating and a lot of take out orders.  The lunch special is definitely worth it as it includes a small side as well. \n\nIf planning to take out, order ahead and give yourself 20-30 minutes as that line is long. Surprisingly came here for lunch at 12:30pm last week as seating wasn't that packed nor had a wait. Lunch special bon chon was good. Also ordered japchae, which is good. However, the portion here is smaller than the locations in the Manhattan. \n\nOverall, service and food were good.  Will come back again and bring others to enjoy either lunch or dinner!", "author": "Winny L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-14", "description": "It's Bonchon! Expensive chicken wings but it's like crack. When they say spicy... they mean spicy. No joke. \n\nGarlic soy- all the way for me. It's a chain, so consistent. Chicken is slightly sweet- but Korean style chicken is a good variation on fried chicken.\n\nSides are good- their fries are great. Pickled daikon is also a great palate cleanser. \n\nThey have some odd fusion types dishes... I've never ordered. Come here for the chicken. Period.", "author": "Dan O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-01", "description": "Stopped by one day last week while keeping my sis company at the hair salon. Bon Chon in the city has always been one of my favorite places to go for wings. The flavors were perfect but it took a little longer than normal to get my order, also got fries and pork buns.... I would skip the fries next time. As for the pork buns the flavor was delicious, but the texture seemed all wrong, and there was a lot of fat on the pork pieces in the bun, not very enjoyable. The woman behind the counter was helpful and very nice. Waiting until they get their liquor license to go back so I can have to whole experience. very happy that they are in Brooklyn!!!", "author": "Cassandra S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "Finally! Bonchon in Brooklyn! Even better that it's only 3 stops from me hehehe. Now we can get our Korean fried chicken fix nearby instead of having to go to Manhattan.\n\nEver since I saw Bonchon pop up on Yelp, I've had it bookmarked and we finally went in tonight for dinner. We got the 10 wings, half and half - for those not versed in Bonchon/Korean fried chicken-speak, that means half soy-ginger and half spicy. We also got the fries, the takoyaki, and two sides - the pickled radish (a must have with Korean fried chicken) and the kimchi radish. The seasoned fries were crispy and a nice carb to eat alongside the fried chicken. The takoyaki was good too, nice to have something with a softer texture with all the crispy, crunchy fried stuff we ordered. The chicken was exactly as I'd expect from Bonchon: double fried, crispy, light batter, and those craveable flavors. I really liked the kimchi coleslaw too - it was crunchy and tangy and just a tiny bit spicy.\n\nWill definitely be back!", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "Finally, my first taste of Korean fried chicken. The soy garlic bone-in wings were good and the spicy wings were better. I'm already trying to look up the recipe to recreate at home!\n\nI went 20 mins before closing and received relatively fast and very polite service. I highly recommend this location.", "author": "Yasmin S."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Bonchon - Willoughby", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Willoughby Street", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/bd6orAYStxK8ncc98jgLzQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185966078"}