{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Fried chicken here is probably the best in NYC. It tastes very close to the ones I had in Korea. Even the takeout fried chicken are high quality. It becomes my fav spot now", "author": "Eva Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-25", "description": "This review is for lunch hour take out\n\nThe front is understaffed during the lunch rush with only one person taking orders, answering the phone, and distributing orders. The kitchen staff also missed my order. I get it, it happens, but I've flagged down 5 different employees who all claimed to have gone back to check on my order. I ended up waiting 45 minutes for my food. \n\nAdvice: Avoid coming during the lunch rush if you don't want to risk missing meetings because of inattentive staff. Customers are forced to actively ask about their orders before the cashier turns around to check if their order is there.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "We went there for lunch with bunch of friends, ordered fried chicken half soy garlic\u0026 half spicy, the soy garlic impressed me so much!!!!! Crispy and Juicy!!!!!!!  Definitely have to try! Also the kimchi fried rice, each single of the rice filled with taste!!!! I finished the whole bowl!!!!! Btw I love Beef Taco too!!!!!!! Can't wait to try  their bar which coming very soon!!!!!", "author": "Iris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "One of the best Korean chicken wing place in NY. Surprisingly, their fried rice and Tteockbboki (spicy rice cake) is good too. But definitely, chicken wings are the best. We ordered half half (Soy garlic and spicy). My favorite is Soy garlic. Tteockbboki is good but spicy, so if you like spicy food, you should try! The staff is kind and friendly as well.", "author": "Mee Jeong K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-20", "description": "I invited a friend for lunch after this place was recommended.  The place was empty and the waitress rushed us to order. After the 3rd time requesting our order,  I asked her if the bibimbob was in a hot bowl skillet with an egg on top and not in a regular bowl like in the photo. She nodded her head and said it was hot. I encouraged my friend to try  the bibimbob, I ordered the wings half spicy half soy garlic and the seasoned fries.  He ordered a lemonade and  they brought over lemonade in a can. The french fries was great, the bibimbob was served in a bowl not a hot skillet, the rice was cold and served with a chopped boiled egg and the wings, was wings. The waiter said they opened 45 days ago...maybe that's the excuse. I wished I had gone to a different location.", "author": "Juices2240 S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-03", "description": "I had seafood fried rice and both flavors of chicken wings.  They have absolutely perfected the crispiness of a chicken wing here.  Very flavorful too.  Wings are rated 10 of 10.  The fried rice was good but I would rate it 7 of 10.  Nothing mind blowing.  Great service, clean restaurant. I would come back again if I lived near here.", "author": "Daddy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Great place for lunch gathering we came at noon and and atmosphere in here was awesome love the wings here along with their music!  friendly place and the staff seems happy to work here! Great dining experience", "author": "Eddie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "First order wings and house fried rice was excellent. 2nd order boneless wings not so good; they were overrcooked and hard. I couldn't enjoy my meal. :(\nI'll try one more time and hope for a better meal.", "author": "Andrea B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-14", "description": "My first experience with Bon Chon is the on located at 329 5th Avenue. My experiences there are  simply amazing the wings are always outstanding fresh, flavorful and a nice size. Always served piping hot. Which made me a instant loyal fan. So much that to travel from Brooklyn to Manhattan wasn't a chore but part of the experience to pure wing HEAVEN. This location although its all shiny and new lacks in a few key things:\n1. Hands down the quality of the wings they serve is vastly different from the 5th Ave location. The wings are  noticeably smaller and of a lesser quality.\n2. The way the food is prepared needs improvement. The Soy Garlic wings I ordered tasted like wings that were fried and then refried. So yes they tasted old and stale. As well as being served at room temperature.The soy garlic that I associate with Bon Chon was definitely missing.There was definitely no wow factor . \n3.The friendly welcoming warm customer service that one receives at the 5th ave location was not present here. The staff is a lil stiff and jaded. No one even came to the table after the food was served to see if everything was ok.\nI went on a Tuesday night that way it wouldn't be crowded and the staff would be on point. However it seems like no matter when I went it wouldn't have made  a difference in the long run. \nSo back to the 5th Ave location I go.\nWhat a huge let down.", "author": "Salimah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "I missed the John Street location and the financial district. So, I was pleased to see that they are now in Brooklyn Heights.", "author": "Rafiq J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Run, don't walk ! First, the host is fantastically kind and should get a raise or free wings for life (let him pick). Double Fried Wings... No, I didn't stutter.  Double fried greatness in the form of tasty drumsticks ... The half spicy and soy garlic is the truth and will have you licking your fingers so this is not a 1st date spot. This is a fantastic addition to the area and will be receiving my business every time I'm on that side of the borough", "author": "Ron J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "We ordered the 10 wings and they gave us 8...in out take out order. The bf liked the kimchi bacon fried rice. The wings were ok. Had better ones at other locations.", "author": "Judy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-18", "description": "Inconsistent in that they will forget your sides, your rice, or even the glaze on your chicken. It's close enough to be convenient, but even convenience has its limit.", "author": "Matthew D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "Very disappointed of this Bonchon. Went with coworkers to have lunch here. \n\nWhen we entered, all 4 staffs up front did not acknowledge us. We had to find someone to get us a table, we were rushed to order....\n\nTall asian male waiter was very rude to us the whole time. When we were finished ordering, he asked us to hand him back the menus instead of collecting from us.....They immediately collected the plates and bowls from us, even asked my coworker who was still eating at the moment...(got asked twice to collect her bowl which was still full of food....) what kind of service is this???!!\n\nRushed us out....\n\nFood was not good, very small, very little meat, chicken doesn't taste like the other Bonchon....\n\n\nTL;DR:  Food and service sucks. Do not go, waste of time and money. Very unsatisfactory.", "author": "Wendi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "Bulgogi tacos are the way to go! Be careful the wings can get pretty spicy, pickled radish and cole slaw were both a hit. Loved the japechae, flavorful with nice pieces of beef. Kimchi bacon fried rice was not bad but definitely interested in trying other ingredients next time. Staff are lovely. Cant wait for them to receive their liquor license, they already are the neighborhood spot.", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Best Korean fried chicken in NY! Me and my wife live close to this place, it's a blessing and a curse. The chicken is amazing but it's incredibly addictive so we have to fight not to go here everyday. The chicken is perfectly fried, seasoned and not greasy at all. The service is exceptional and the place is spotless. A great spot for dinning with family or by yourself and the price is perfect. A MUST VISIT!", "author": "Charles A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Omg finally a korean fried chicken place around this area!! Wings are so crispy n juicy!!! They don't have their liquor license yet but that's okay cause I'm here for the chicken lol", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Love this Bonchon, so convenient with great service. The wings are amazing, as always", "author": "Pedro S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "I've been to a lot of Korean fried chicken places and this one was probably one of my favorites. Flushing queens is flooded with Korean restaurants and Korean fried chicken places but they're either really over priced or just super duper busy. I'd rather go to this Bonchon location in Brooklyn (mostly cause it's close to my job). They weren't  that busy (maybe cause they just opened) but service was really fast and waiters were really nice. I know it's a friend chicken place but their bacon kimchi fried rice was soooooooooo gooodddddd xD. I'll definitely come back next time, but maybe with my boyfriend. The design of the restaurant is also very fitting for a date. So if you're trying to go on a first date then I'd recommend this place too.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "I really enjoyed Bonchon. It reminded me of the Chinese food I ate when I was younger. The chicken was crispy and perfectly cooked. The chicken fried rice was good as well.  I would definitely go there to eat for dine in.", "author": "Phi C."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Bonchon - Willoughby", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Willoughby Street", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/bd6orAYStxK8ncc98jgLzQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185966078"}