{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Excellent eating experience! I had the classic chicken wings with soy garlic and spice sauce. Best fried chicken I have ever tried, Crispy and delicious, must have it! Meal was served hot and great taste. Server was friendly and helpful. Definitely will visit again!!!", "author": "Bihua L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "Food was overpriced and overcooked. I ordered \n\nboneless chicked - absolutely disgusting and over cooked. It tasted like it was frozen for way to long and just dumped in some oil.\n\nPopcorn chicken - way over priced entree which was the size of a appetizer. Also over cooked \n\nChicken and ricecakes (forgot the name of the dish)- they forgot to include the ricecakes once they did it was undercooked.\n\nOverall price did not match the quality. I have had better food in an airplan then this place.", "author": "Dave T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "This place really knows how to do fried chicken. We ordered their signature flavor for the chicken wings, soy garlic and spicy soy garlic as well as Parmesan fries, kimchi fried rice, beef tacos. The wings are fried perfectly! Kimchi fried rice is amazing. Service was great, portions are great for sharing, prices are fair!  I highly recommend this place for some Korean fired chicken and their great dining atmosphere", "author": "Fanglu K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Amazing food and lovely staffs. I went for lunch with my coworkers, we have great time there. The food came so fast than we expected. I love the avocado salmon bowl so much as appetizer, very special! The chickens are very crispy and juicy. Also I think this place will be a good place to hang out with coworkers after work when they get liquor!!! Chickens with bears, best combo ever!!", "author": "Na Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Just had a quick dinner here with my honey. Saturday of soft opening was sparse but fully staffed. Starter and KFC arrived quick, in just the right portion for us. Spicy means properly spicy, so a moderate combo portion of wings and drums and little pickled daikon side was satisfying and flavoful without a pool of sauce on the plate. I would just suggest adding a personal fave to the menu.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-13", "description": "I ordered the spicy fried rice and it was super sweet! I did not like the food but otherwise the ambience is good ! Wouldn't recommend anyone though.", "author": "Dhaksha K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-09", "description": "Maybe it is a fairly new location in the area, but there was only a few customers on a week night. Tried their large boneless chicken and I was not impressed at all. It was too much batter and very little chicken. The only highlight was the waiter coming over to constantly refilling our cups with water and I needed it too because the seasoning was way too salty. Hate to sound negative, but I left unimpressed and wishing I had gone to a Popeye's instead. Maybe ordering actual wings or drumsticks would have been a better choice.", "author": "Alan F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "I've been going to Bon Chon for years in the city and I've never had a worse experience than I did at this new location in Brooklyn. We placed a pick up order, and received only half our order. The food was cold and lacked any sauce or distinction in flavoring. Not only this, but when we contacted Bon Chon about our missing food, we received a very rude response and no assurances for a refund. Would 100% never recommend this location to anyone.", "author": "Krupa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-03", "description": "Should have gotten the chicken. The reviews for that look great. Got the spicy chicken dish, name escapes me right now. I don't get the heavy topping of mozzarella it is just strange. The fusion aspect maybe?? Would not go running back to this place but maybe if I do I'm trying the chicken!", "author": "Ivy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-10", "description": "Just had their Boneless Wings, and the flour was so thick that I could not taste the chicken.", "author": "Jamie J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-15", "description": "It's a pure ripoff Korean, the lunch special is expensive with very little food. There Korean daily that does way better job than this restaurant! Don't recommend going there at all", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "The food is really good. The spicy fried chicken was my favorite dish. I would definitely come again with friends.", "author": "Phoenix Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "First, I have to say I like their Soy Garlic wings a lot, also the drumsticks are so big so satisfied !!!! Big fan of it, then it's the Kimchi becon FR, should try more next time, will be back for sure!!!!!", "author": "宇晴"}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "I love Korean food, and although it is a quick snapshot of authentic, I was not disappointed. Great for a nice bite on a busy day. I ordered on the phone and my lunch was ready when I got there.", "author": "Mikila T."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Bonchon - Willoughby", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Willoughby Street", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/bd6orAYStxK8ncc98jgLzQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185966078"}