{"aggregateRating": {"reviewCount": 48, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-17", "description": "Daigo is located in the Dekalb market basement. It is quite pricey for what you get but I recommend the snow crab and ikura hand roll. I wasn't a fan of the toro or the yellowtail. It just tasted extremely bland.", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Best hidden secret in DeKalb market! \"hidden\" because it's the smallest booth in the middle aisle between all the food stalls. \n\nSpeedy, fresh, authentic handrolls. Sushi handrollls here are served the open style, not the \"cone\" style. Definitely go for the  Yellowtail Jalapeno and the Saba (Mackerel) rolls!", "author": "Wing C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Probably the best hand rolls next to KazuNori. Everything I've tried on the menu is solid. Only problem is my stomach is an endless pit and I can easily spend $40-$50 on just myself . This place is worth a try - you won't be sorry.", "author": "Jeanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "I hate to pile on, and I almost hate to post this review because it has gotten progressively more and more crowded since it's opened, but I'm pretty sure the secret is out.\n\nThese are my favorite hand rolls anywhere. The fish is consistently the freshest I've had (in Brooklyn), the ratio of rice to fish is perfect, and they are quick. Love the traditional stand and eat at the counter or order to go. My favorites are the toro and the salmon with wood ear mushroom.  \n\nI'm glad I don't live close by or there would be a sizeable hole in my pocket because this place aint cheap. But it's worth it.", "author": "Olga P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "I have to admit, I'm very particular about my Japanese food! This place is not bad at all! Highly recommend if you're looking for a quick bite!", "author": "David T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "I am not sure whether these are hand rolls or uncut sushi rolls, but they are a really solid very fresh option when you are looking for sushi in this neighborhood. As others have pointed out, these are really small (and zip code priced), but filled with fresh fish and toppings. What I really appreciated was that they were willing and able to customize to my food allergies and really listened to make sure they understood. That makes it all worth it.", "author": "Wendy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Came here with T.H. for a quick lunch and hadn't tried Daigo despite having come to the Dekalb market hall at least once a week since it's opening. I ordered the spicy tuna and the uni. T.H. ordered the salmon skin and then eel avocado. We stood at the counter to eat and the chef made our rolls one by one. He kept very good track of how quickly we were eating and made sure that there was less than a 5 minute gap between our first roll and our second. The fish itself was fresh, thanks to a good turnover rate and the rolls were surprisingly filling. Nothing completely out of the ordinary but simple, good food. Two plus a drink made me pleasantly full without being overly stuffed. The only drawback was that it was a tad expensive. For the speed and quality, though, it was worth it.", "author": "Caroline L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Delicious, fresh hand rolls. The prices have definitely gone up since this place first opened, but I would rather pay more than sacrifice quality of the fish. Love this place.", "author": "A L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-24", "description": "The Yellowtail is sliced into oblivion as is the Jalapeño which takes on a gross green look and squeezes through the seaweed indelicately. The shrimp was a little ripe and with so much spicy mayo it was easy to forget what I was eating. They won't cut rolls for you \"because we like to keep it original\", but why then give me chopsticks? I've definitely had better.", "author": "Sally C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "This is possibly my favorite restaurant in Brooklyn. It's simple with perfect execution. I really like the fact that they hand each roll to you. I've come here once a week for about 6 months. Ive tried every roll and they're all very delicious but I usually crave a spicy tuna and a jumbo shrimp and sometimes if I get a third I mix it up.", "author": "Enzo O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "As a frequent customer, I have been optimistic in the past that the service from the revolving staffs, sushi chefs would get better and better with each visit. Unfortunately, in this case, I fear it will never get any less gruff or less petty- I.e today's heat wave made Dekalb market the best solution for lunch.\nI arrived at the Daigo lunch counter a just little before 3pm, with my young daughter and a friend with his young daughter( we are all hand roll enthusiasts) We all decided to order the lunch specials with two hand rolls each which included a bottle of water- while we submitted our orders promptly at 3pm - they refused to honor the order as a lunch specials....and spent the next 5 mins telling us that they wouldn't take the order as a lunch special because it just turned 3pm!\nWouldn't it be more simple and cost effective just to honor the pricing \u0026 give bottles of water to two little girls on a really hot day, rather than to merit a negative comment towards their business? (given that there are a plethora of food choices in the nearby food stalls at Dekalb market, one would think that good business sense - would be to remain competitive and friendly to attract customers) This is the last time I shall be going to the Daigo Hand Bar.", "author": "Tati N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "I can never resist getting a handroll any time I'm at Dekalb Market Hall. It's just soooo satisfyingly delicious. A single handroll will cost you as low as $5.90. Dunk that goodness in your wasabi / soy sauce combo and wash it down with some pickled ginger. End the short journey with a cold bottle of green tea. Sooo good.", "author": "Jane N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "I'm actually very surprised by the reviews of this spot. I would certainly not ever recommend this spot for sushi. It's severely overpriced and lacking in every sense. You're much better off going to an actual sit down sushi spot in the neighboring areas.", "author": "Devan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "Fresh ingredients, $$ price, quick and clean service. Their lunch deal is any two hand rolls with a drink or miso soup is ~$12 is great! You can eat by standing at two short stations wrapping around the shop!", "author": "Danielle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "This is an example of why we need food halls today and that's to showcase the specialty skill this spot has...perfectly made sushi handrolls! These guys do one thing and one thing only, the glory of this spot is the set-up.  Quick and easy! In n Out! Sushi on the run but made fresh everytime.  Nothing here is pre-made, pre-packaged or made last night.  Everything is made - to -order.", "author": "Jj L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-16", "description": "Best sushi handrools in the city. But if the owner is there RUN. He's mean and nasty. Everyone else who works there is amazing but he is NOT. So just don't go if you see him!", "author": "Satah J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "Absolutely love this place. My favorite sushi spot in the entire 5 boroughs, the staff is great too", "author": "Eric R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "If your ever downtown, make this stop! Seriously good sushi! Authentic Japanese taste and atmosphere; I felt like I was back in Tokyo. I've visited three times in 1 week....", "author": "Mercedes C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Daigo is amazing. The ingredients are all of very high quality. The nori is crisp and crunchy, the rice is perfectly cooked and all the fish is fresh and delicious. This chef knows what he is doing and you can taste his years of experience. Great staff too. Love it.", "author": "Neil W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "This was a little gem in dekalb market. Initially, the hand rolls were super tasty and the nori was super crunchy! Since then I've been back a good 5-6 times and, more recently, there is a drastic change in the rice:nori:filling ratios. They have been training new staff into rolling their hand rolls and it's just not the same. They still taste great, however way too much rice and too beefy. My personal favorite is and always will be their Yuzu Hokkaido scallop.", "author": "Joey T."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Daigo Handroll Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ct9Wygj0S_K0-2o61PLu-g/ls.jpg", "@type": "Restaurant", "telephone": ""}