{"aggregateRating": {"reviewCount": 48, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Finally tried this place when I made my way back to Dekalb Market Hall and now it's a must stop every time I'm here.\n\nIt's quick, the fish is fresh and it's reasonably priced for quality hand rolls. I always get the scallop \u0026 yuzu - highly recommend. The toro is classic. And uni when they're not sold out. My friend always gets the snow crab \u0026 avocado and sweet shrimp and loves those. I've come for dinner only but their lunch special sounds like a deal if I was in the area.", "author": "Felicia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "Dreading the usual overwhelming crowd at Trader Joe's, I decided to postpone my grocery shopping responsibilities long enough to stop by Daigo Handroll Bar for a light lunch.\n\nThis is a modest, stand-and-eat bar with 15-20 handroll options and several types of sodas, sake, and beers. My boyfriend and I split four rolls between us. The spicy tuna, spicy salmon, and yellowtail handrolls were all tasty and simple enough - fish and warm rice wrapped in nori. My favorite handroll, however, was the seared salmon belly with fresh scallions, which was the special of the day. All the rolls were prepared quickly and handed to us directly - no plates, no silverware, no problem.\n\nThe price is the main reason I will not turn into a Daigo regular, although I would repeat this experience occasionally. At roughly $7 per roll, these price tags are a bit high for such small, simple rolls. With that said, this is an easy, delicious way to satisfy your sushi cravings and possibly my new favorite stand at the Dekalb Market.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-08", "description": "I've never been a big handroll guy. \n\nMy mom (and only my mom) will tell you I'm a handsome guy.\nNo one will tell you I'm a handy guy. \nI tried to be a handkerchief guy, but it didn't take.\nI'm becoming a Handmaid's Tale guy, sort of.\n\nBut I've never been a big handroll guy (nor a handcuffed guy...never been caught). Because you have to really love the nori to love the handroll, and it's never been my favorite aspect of sushi. \n\nDaigo (and KazuNori, if you've been) is changing my mind. When the fish is fresh and light, the rice properly seasoned, and the nori is crisp and perfect...I understand why people love the handroll. \n\nYou have to eat it instantly to get the full effect, and Daigo does it right.\n\nIt's a little on the steep side pricewise (more expensive even than KazuNori), but I love that you can come by and grab one roll, scarf it and go. It's a light, healthy-ish snack, and a good one.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-12", "description": "Pricey for sushi ($10 a roll more or less), but quality is there and the convenience of being able to hold it, is a nice concept. \n\nThey have a good amount of selection on their simple menu.\n\nFirst, was my toro roll for the testy taste buds!  Nom!  I can just eat the sashimi part of it, but the rice had complimenting rice vinegar to the whole treasure. \n\nSecond, Hokkaido scallop with yuzu, enhanced the flavor of the roll and made this my most favorite.\n\nLast, but not least, uni from Maine was a simple splurge of joy in my mouth.  The freshness, can be savored over entirely and playfully while swooning it in the mouth. \n\nFancy a splurge on hand rolls?  Go for it.", "author": "Tiffany D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "Just got the spicy tuna roll, which was simple but good. It was only the seaweed wrapper (which had a nice crisp), rice, and flavorful tuna.... no avocado, cucumbers or anything else inside, but yet it was still good (and fresh). \n\nI was surprised that no plates were given.  You just eat above the paper placemat in front of you. That said they do give you a dish of wasabi and ginger (but no plate). Less clean up for them. Anyway.... I enjoyed it.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-02", "description": "The concept of Daigo is a quick, convenient handball stand with fresh hand rolls by the sushi chef. I enjoyed the concept, and it satisfied my sushi craving during lunch. \n\nHowever, as far as convenience goes the quality of the sushi is sub-par and not worth the price (around $8-$10 for a single roll). The proportions were small - so I ordered two rolls and it was enough to satisfied my hunger that costed close to $20. I ordered this to go since I was running late heading back to work, along with several others that also ordered it in to go containers versus sitting at the bar stools next to the stand. The stand have high volume, which caused a longer wait time than I expected. Initially, there were only one sushi chef however once the line started getting longer a second support chef walked in. \n\nOverall, it is a good concept and worth trying once.", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "100/100 every time. This fresh cute little sushi bar inside Dekalb market is a favorite of mine. Every time I go to the grocery store or happen to be at Dekalb market I stop here. The spicy salmon hand roll is perfection. So fresh, so simple and that is how you know it is quality- there is nowhere to hide. Come here if you want a quick snack or if you want to have a fresh lunch. Specials at lunch are great too! Honestly a quick, fresh spot inside Dekalb -definitely worth a visit next time you are there!", "author": "Katherine K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Unique shop in dekalb market. It's a stand up bar that serves beer, sake, and hand rolls. They've got all of the usual sushi items such as salmon, tuna, and yellowtail plus some daily specials . The specials they were available when we dined were toro, uni, and seared salmon. I had the toro and uni. They're both great and I liked the unique experience.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "The hand rolls here are pretty good..at the least the shrimp rolls that I've eaten from here. They make it fresh on site and even cook it. The customer service was good enough for a take out restaurant. I'm looking forward to coming back here and try some more of the other rolls. I recommend this trying the rolls here. My shrimp rolls was very flavorful.", "author": "Seon B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "I loved this hand roll spot.\n\nLet's talk about price... The prices for scallop, tuna, yellowtail, and roe are priced right for the quality and cut of fish. There is a bit of a surcharge for Toro and uni but that was well worth the money. The uni was very creamy, fresh, and from Japan, nice!\n\nThe lunch specials are also a great value.\n\nHighly recommend.", "author": "Justin A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "I'm kind of impressed with the handrolls at Daigo. I've always detoured my way through Dekalb Market Hall to go to Trader Joe's but Daigo might just be the reason to make me make a pit stop each time (well...maybe only as an occasional treat because prices are a bit steep). Ordering and paying is simple as can be. You basically stand there and mark off on the simple order sheet what handrolls you want to eat and the chef makes them for you one at a time (he'll only give you your second one once he sees that you've finished your first). Once you've finished dining, you bring your order sheet to the cashier, pay, and go.\n\nThe rice was soft, sweet, warm, and fluffy. The eel and avocado were super fresh. My only complaint is the seaweed; I wish it was a bit crispier/crunchier!\n\nFYI, they offer raw, cooked, and vegetarian handrolls!", "author": "Lisa Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Be prepared for the best hand rolls you will ever taste.\n\nCustomer survive is superb, they hand you the roll immediately once it's finished.. and the fish is so fresh!!!\n\nI have been here numerous times for a snack at Dekalb Market. It is my favorite food stand. Always fast, always fresh, always greeted by a friendly face.\n\nYou can seriously never go wrong. The toro tuna is amazing, the uni is creamy, the roe is poppin' and the scallops are amazingly fresh. Prices are good as well, not too expensive, and very appropriate for the quality of fish. \n\nMake sure you eat there on the spot at the bar, hand rolls are best when eaten fresh.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "Good, not great.\n\nStopped by on a Sunday afternoon and the stall was in Dekalb market was empty.  Staff was very friendly and helpful.\n\nI ordered two hand rolls - snow crab + avocado, and a braised octopus.  Both were tasty and fresh, but nothing amazing to write home about.  If I were in a pinch, needing some sushi, and were in the area, I would stop, but by no means would I seek this out for a go-to sushi spot.\n\nPrice point is probably fair to a bit high.", "author": "Ignatius L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "It's so many cool spots at dekalb market, and daigo, was I think one of the main spot that I waned to try (being big Japanese food lover). I ordered spicy salmon roll to go. Everything was ready in like 3 min. Roll was very fresh and it was perfect combination of rice and fish (more fish and less rice, how I like!). And I was really full and super satisfied only from one roll (even it wasn't that big like on their pictures). Can't wait to try all things from their menu.", "author": "Shev O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "Came here as a result of reading the article from the Times By Ligaya Mishan\npublished July 26, 2018 \n\"At Daigo Hand Roll Bar, Sushi Looks to Its Humble, Glorious Roots\"\n\nThe restaurant is located in the food court in the basement of DeKalb Market Hall in downtown Brooklyn. \n\nThe chef Ishikura-san was not at the premise, the young working chef was not Japanese but made hand roll expeditiously. \n\nUni $12 MP, Saba Gari  and Yellowtail with roasted jalapeño $6.4, and Toro $9.9 were quite good. The jalapeño was not spicy at all, the chef should offer a more piquant option. The toro was chopped and of low grade. \n\nThe Hokkaido scallop and the scorched eel with avocado $7.4 were average. The scallop did not taste as good as the one in Tokyo.\n\nThe nori was excellent. \n\nThe Handrolls had too much rice, even though the rice was well prepared. \n\nWill give another try if  the chef Ishikura-san himself is present and makes the Handrolls. \n\nIncidentally the Katz Reuben here is not as good as the one in NYC.", "author": "Ocean P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "This place is AMAZING. I go here almost everytime I'm in Brooklyn. The service is great and friendly and you get your own little section at the standing bar area. The fish is so fresh! I've gotten many different things here and all were delicious - Salmon and avocado, scallop, eel and sweet shrimp. Its a little pricey for a hand roll, but I think it's well worth the price for the quality of the fish you get. We've taken different friends here and they all have fallen in love with this little sushi shack inside Dekalb Market too!", "author": "Christine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Warm rice, cool flavorful fish and fragrant seaweed wraps. Yummy. \nMy only complaint is that there lunch special includes a free bottle of water. No need to support disposable water bottle culture.", "author": "Eli B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "If you ever find yourself in downtown Brooklyn craving some sushi, do yourself a favor and make your way to the Daigo hand roll bar at the Dekalb Market Hall. \nFresh delicious fish and inexpensive.\nThe fresh water eel roll with avocado was my favorite. Another plus, a good selection of Japanese beer too.", "author": "Martin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "Great sushi option in Brooklyn! Standing sushi bar where you check off what you'd like. The rolls range from like 5 to 10 each. They include a good amount of rice compared to the fish and the seaweed could be crisper but other than that I thought the fish was fresh and tasty! If I crave sushi but don't want to splurge on an omakase meal I would definitely come back to satisfy my craving. Also their miso soup was one of the best I've ever had--they use the botan ebi heads for the stock so it's very yummy. The rolls are prepared really fast too!", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "My wife and I are blessed to live near an actual Japanese run restaurant on Long Island that is wonderful, so when we were walking through the market and saw Daigo Handroll Bar we had to stop by...\n\nThe Hokkaido Scallop Handroll was so fresh, sweet, and just perfect...as was the Uni handroll...honestly it may have been the freshest Uni we've had anywhere, and we've had it anywhere we can get it.  We were just looking at each other in surprise and amazement of how great these rolls were...next time in the market we might just be standing here most of the time!", "author": "Christopher M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Daigo Handroll Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ct9Wygj0S_K0-2o61PLu-g/ls.jpg", "@type": "Restaurant", "telephone": ""}