{"aggregateRating": {"reviewCount": 48, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Simple menu (handrolls and some sashimi) but the quality of the fish is excellent and the attention to the sushi rice was spot-on. The two times I have eaten here the rice was perfect temperature and not tightly-packed like westernized sushi often is. Small selection of Japanese beers to choose from. Great spot.", "author": "Ty F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "This place is great! The fish is really fresh, the hand roll comes out crispy. It's a quick eat with the bar style seating. A little pricey. Overall really great and convenient to go to.", "author": "Isabela F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "First off, I love sashimi. I don't want anything getting between my taste buds and the fish except maybe a little ponzu sauce. I didn't realize it was hand rolls only until I had already ordered sake. That said, I really enjoyed the scallop roll. The yuzu really made that one. The eel/avocado was very tasty but to be fair, I never had a bad eel/avocado roll in the history of my sushi eating life! Braised octopus was pretty good as well. They did not have ponzu sauce but their soy sauce is their own blend. Still tasted like soy sauce to me. But the sushi rice was sweet and vinegary.  It was like ponzu hints in every roll. A definite plus for me. Very simple small rolls, with one to two ingredients. Kind of pricey if you take into account the size. No chairs, standing bar only with very limited space. This is a quick bite not a leisurely meal spot. Honestly I would give it 3 1/2 stars if I could but I rather over rate than under.", "author": "Me 2."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-30", "description": "There's no question around quality here ... the fish is fresh and delicious, the seaweed paper is light and crunchy, but the price is a little high ... $75 for a few hand rolls eaten over 15 mins, with paper for plates, standing up at the bar ...", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "While shopping with my mom, (05/27/2018)  searching for some food, we ran into this sushi stand. I ordered jumbo shrimp roll for my mom and I.\n I must say their customer service is great, as a diabetic my sugar was dropping while is was ordering my food, the workers were so helpful and patient in assisting me in what I needed, they made sure I had water, while my roll was being prepared; and was followed by a coke; my mom suffers from acid reflux and ate the ginger from the sushi and it went away.\nI wanna give special thanks to the following workers that helped me\nAnne, Sergio and Thomas, you rock and never change.", "author": "Syreeta M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Absolutely delicious.  We had the toro roll and yellowtail jalapeño roll both were quite good and decent size for the price.  Will definitely be back.", "author": "Ally W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Daigo Handroll Bar has become a part of my Sunday rituals routine. Many times, the promise of a visit to DHB is what actually gets me out of bed on Sunday mornings...it's that good!!! Everything is always so fresh and treated with such care and detail, and that all comes out in the actual flavor, taste, and experience of the food. The staff is super nice and helpful, too! And the Chef is very talented and sweet...today he showed me and another patron the shiso leaves that come in the mackerel handrolll that adds some citrus, punch, and freshness to the roll (gotta try that next time). Every shiso leaf was being rinsed and patted dry--everything is so thought out and I love it! My go-to's are the Crab w/ Avocado and the Crunchy Shrimp, then I usually jump around the menu for a third handroll. Also, the seafood is of the highest quality. I usually get a little weirded out about seafood since it seems to be used my the masses in this city...but at DHB I never question the product, it's always the best grade. DHB is the perfect Sunday lunch before grocery shopping at Trader Joe's too! Highly recommend stopping by Daigo whenever you're at DeKalb Market!", "author": "Stef F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "The best handrolls I've ever had! Fresh ingredients \u0026 amazing customer service!", "author": "Ashley P."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Daigo Handroll Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ct9Wygj0S_K0-2o61PLu-g/ls.jpg", "@type": "Restaurant", "telephone": ""}