{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "I am a fan of vineapple.  It's an excellent spot to study or get work done, however it is a bit quiet if you desire more boisterousness.  The coffee is uniformly excellent, as expected for a venue which serves Stumptown. Always courteous staff, coffee served with a smile and promptly.", "author": "Owen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-20", "description": "Bland cold brew, and making an iced mocha with Hershey's syrup? Ew.", "author": "William C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "This is a very solid place. They sell Stumptown coffee--much better than the stuff they sell at Starbucks--at an affordable price. I know people complain about the brewing process they use, but you're not going to find a much better mix of quality/price elsewhere, and these ratings are all relative.\n\nAlso, I disagree with the comments about the unfriendly baristas. They are mostly young people and some of them are probably shy. Try actually saying hello to them (when it's slow, of course) rather than complaining about their work and maybe your impressions of them will improve. I've had very pleasant interactions with several of them.\n\nI agree with the comments that this place is better for studying than for hanging out with friends, but there are a lot of students in the area and we need a place like this (at least those of us who would rather not be in a stuffy library all day).", "author": "Greg S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-13", "description": "This place has the potential to be a great spot because it's spacious and has a bar to sit at. They don't have enough food offerings and the vibe can use a lift. Their main issue is that they open at 8am during the week and 9am on weekends. People want coffee way before that.", "author": "Nataly A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-27", "description": "I received several emails about my initial review from the owner (?), a manager (?), random Vineapple patrons (?)-- they didn't specify-- claiming that my review was in error and requesting I come back and give their place another try.  Sorry, no.", "author": "Amber P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "I've been coming to Vineapple since it opened and have had only awesome friendly service and great lattes every time (and I'm a total coffee snob).  I live closer to Cafe Pedlar but usually walk up to the Heights because the space is so much nicer, the vibe is more relaxed and the coffee is the same. Sure, new businesses always have growing pains and I'm psyched to see how they expand their food selection, but even as is it's pretty great.  \n\nSuper spacious and comfy, chill place to work or meet people, free WiFi, Stumptown, and there's consistently great music on. My teenage daughter loves it and actually wants to go there with me! What's not to like?", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "Plenty of table space and a quiet, warm atmosphere make this an ideal place to study or get work done. Don't expect to be wowed by the coffee but if you need to get work done this is your place.", "author": "Evan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "My go-to spot for a cup of coffee in BK Heights. The atmosphere is what you dream a coffee shop in BK should be, but what so many aren't--great music, relaxed, SPACIOUS, generous with the wifi and versatile in its function.   Sometimes there are kids' birthday parties here and sometimes people are drinking wine.\n\nI'm so over slow drip places that take 10 minutes to make your coffee and give you nowhere to sit... just give me a great cup of coffee and a place to drink it.  \n\nLove me some Vineapple.", "author": "Nell S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-30", "description": "Went here for a friend's book swap during the Brooklyn book festival.  It's a lovely little cafe with friendly people, good coffee, and nice drinks.  The first beer I got was flat and they swapped it out without complaint.  I love the games they have available for the guests to play, and the overall vibe is very relaxed.  Worth a trip if you're in the neighborhood.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Love this place!  It's sort of a hidden secret.  Not overly crowded like most cafes and is very cozy with tons of outlets for all your electronics. The location is very quaint and the patrons are respectful, polite and QUIET.  Everyone seems to respect the work/study scene. It's a great place for me to go when I need to concentrate and be productive. There's plenty of space and everyone politely makes room.  I've never had to leave because I couldn't find a spot. The coffee however isn't anything special - it's just ok, but I'm not there for the coffee.", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "Large and roomy compared to other brooklyn cafes. Their drink and food selection is subpar, but it is a nice place to work from for the day!", "author": "Alice L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Excellent addition to the neighborhood.   Comfortable place to go and relax, read a book, surf the web, people watch.   Free WiFi, hot cups of coffee along with tables, sofas and a bar area to choose from to sit.   I'm happy that such a place exists.", "author": "Dean D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-12", "description": "Amazing coffee-study-work-lounge spot. Very limited food and what they have beyond grilled cheese (which is stellar) isn't great (lots of bready things). There is a quiet understanding among those who work in the back that it's a quiet zone, and the music is generally quite mellow, so it's quite nice. Families with kids tend to hang up front.  Phone reecption is bad, which makes for bad calls...  and a great quiet area.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "This is a really nice, low key coffee shop.  It's got a great atmosphere.  This place is totally underrated.", "author": "Ardashir M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-09", "description": "Relaxing, comforting, awesome!!! \n\nGreat place to sit alone and read a book, or play apples to apples with friends, or have a meeting (in person or online) ... I love everything about this place.\n\nFeels like three different experiences ... intimate seating for two, communal tables for gatherings or sit for hours and work, or comfy couches to lounge and play games.\n\nGreat coffee and tea selection, wine and beer coming soon!!!", "author": "Frances G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "I love coming here and it usually is very quiet on the weekdays (even though most seats are filled) which allows for me to get a lot of work done! The space gets lots of light and each time I've gone staff have been very friendly, I usually just order tea so I can't comment on the coffee.", "author": "Alanna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "LOVE this place. Quiet, good coffee, cool vibe, cool couches. Need to get their wi-fi straightened out though. It goes in and out constantly, which makes getting anything done difficult. Other than that this place rocks", "author": "Abbie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-19", "description": "Coffee is just okay. They have Stumptown beans, so why is the coffee bitter tasting and over-roasted? I don't get it. It's one of the few coffee places in Brooklyn Heights, so I guess they don't have an incentive to get better.", "author": "Nan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "Not sure why my other review got filtered.\n\nThis is a great establishment, but I have a few complaints.\n\nFirst of all, please put the couches back.\n\nSecondly, please kick the freeloaders out, too many people just come and \"set up shop\" for the entire day without buying anything.  these losers need to go!\n\nThirdly, bathroom does need a cleaning.\n\nOther than these things this is my fav coffee shop, albeit it is starting to get annoyingly crowded with guys, more girls please!", "author": "Dexter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "I've been here twice \u0026 I don't see any of the things mentioned in the one or two-star reviews. Confession: I may drink a lot of coffee but I don't have a refined palate for it. It may or may not be the brand advertised, I wouldn't know, the coffee's fine. What I do know is that this place is your living room: Come one, come all, stay as long as you like, read a book, do some work, have some Joe \u0026 enjoy the free WiFi. It's mellow, filled with students and other people [doing work during the day. . . I think]. There are board games and books laid out on bookshelves along the couches and tables. The tables are big enough to fit your books, laptop, and paperwork (huge plus). The place is quiet but there's a bathroom with chalkboard walls where you can voice any rants. It works.", "author": "Nina S."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}