{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "I am a regular at this comfy little cafe. I love it.\n\nI have been a degenerate Starbucks and Marlboro connoisseur for quite a while, but I decided to put a stop to that and experience the greatness that is local coffee. \n\nVineapple is a lovely choice if you need to read, write, or need to just chill out after a long day. They make a good latte and their pastries are good. They do tend to run out of certain pastries as the day goes on, but what can you do? There are comfortable couches, plush chairs, and 3 long tables so finding a seat and workspace is never difficult. The bar is large for a place like this. They serve some beers like Shocktop and a couple other smaller brew company's beer ON TAP! They also have wine for us vino lovers. \n\nThe WiFi is runs like lightning and I haven't ever had a problem with it. \n\nThe decor is very mellow and homey. Management has done what they could to spruce the place up from what I've seen in previous reviews of this place. The employees are kind and generous with their time. They move as fast as you do and don't rush you. They know what they are doing which is nice. It seems they've attempted to create an environment where customer service can take shape and the customer feels instantaneous relaxation once they enter the door. \n\nThe prices are reasonable. This place is worth it!", "author": "Hunter M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-11", "description": "Everything here is at least $1 more than it should be (although I'm sure the rent is absurdly high, to be fair). The food selection is paltry and they were out of many of the items when I went. This makes the $8 card minimum even sillier than it already is. The staff is unfriendly. Seating is plentiful but outlet density is low. The place is full of people who look like they were sent by Central Casting to play trust-fund hipsters, and they are just as unfriendly as the staff.", "author": "Shane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Yummy! Better each time I go. The Iced 1/2 decaf latte hit the spot on this 1st warm Spring day. Good service, quick in \u0026 out!", "author": "Karen T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "I've come back to Vineapple a bunch of times now since I live so close and it is a cool mellow place to hang out. I've come with my wife to just hang out as well as with friends to play board games and on my own with my laptop to do work. I've always enjoyed the time spent. Its quiet and comfortable. The music seems to be lower than when I was first here and they've always seemed quite busy so I'm guessing I'm not the only one who likes coming here.\n\nI still don't get coffee from them as I think its too expensive but there other offerings - beverages and food - are well priced.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Great place. Service was good, good was way better than I thought for a cafe. Very cozy and quiet area. Great for studying or just hanging out. Definitely would recommend it.", "author": "BoAnthony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "I've been coming here regularly and it's possibly one of the best coffee shops in downtown Brooklyn. I love its laid back demeanor and their staff is always friendly.", "author": "Annie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-15", "description": "Vineapple is a cute place that has a very nice cozy ambience especially when you walk to the back of the room. You can sit here literally all day and nobody will bother you. If you want to work on your novel away from your apartment, this could be the place to do it.  BUT, and it's a significant but:  if you're relying on Vineapple to supply you with coffee, you may be frustrated because the coffee isn't good. Even though you've watched the barista make it right in front of you, it tastes old and sour. One time I ordered plain black coffee and another time macchiato, and in both cases the quality was terrible in that same sour way. I love coffee and was unable to finish either cup.\n\nI can't comment on the food so my 3-star rating doesn't take that into account.\n\nIt's been a nice spot to meet people I've connected with through online dating sites. If the coffee were good I'd give it five stars, but coffee is so important to this kind of place that I just can't.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "One of my favorite coffee shops. This is always my choice if I want a place to hang around for hours as they have good coffee, cheap refills, a good variety of seating (couches, bar tables, low tables etc) and free Wi-FI and a cosy atmosphere.\n\nThe grilled cheese is pretty decent too!", "author": "Chris D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-21", "description": "The women who work behind the counter are, like the other Yelpers pointed out, surly. I paid for my coffee and was owed something like 10 cents back but the cashier just kept it in the register. Whatever. \nThe sign detailing \"our rent is not free,\" is a little tacky.\nMy coffee was pretty standard though. \nWhile roomy, this cafe lacks good customer service.\nMeh.", "author": "Jenna R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "All right. So, I've been coming here pretty much since this place has opened and, honestly, they've encountered a lot of growing pains. But, unlike some of the other reviewers on here, I think I've tempered my expectations to account for the normal idiosyncrasies of a new business venture. \n\nThis place a fantastic addition to the neighborhood. It's parent, student, and meeting friendly. Wifi is great (and, yeah, the sign stating that their \"rent isn't free\" might be tacky, but it's better than no wifi at all). Prices are, for the area, reasonable (but what passes for reasonable in Brooklyn Heights is kind of ridiculous).\n\nCoffee is Stumptown, and prepared adequately (I'm trying to keep my coffee-snobbery in check, here). Espresso is nothing to write home about, but it's better than the other coffee vendors in the vicinity. Pastries are fresh and the variety is decent (though I wish they had more in the way of sandwiches or other, hearty, snacks).\n\nAlso, they serve alcohol.\n\nOverall, service is great. The only time I've ever had issues is during the mid-morning rush (but that, I think, has more to do with understaffing than any failure on the part of the staff themselves). \n\nSo, the place isn't perfect, and maybe (for once) I'm being needlessly optimistic, but I genuinely like the vibe (casual, laid-back, but not standoffish). It's a valuable addition to the neighborhood and I think, with time, it has the potential to become one of the best little coffeeshops in the downtown Brooklyn area.", "author": "christopher b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-11", "description": "EDITED TO ADD -- shortly after I posted this, I got a nice email from the owner. I felt bad, and even considered giving them another chance (although bad coffee is still bad coffee, nice owner or not). Then I noticed that the \"owner,\" Brooklyn L., had posted multiple fake reviews claiming to be a student who had just \"discovered\" the place, making fun of people who have nothing to do but post reviews on the internet, and calling customers \"selfish.\" \n\nI really, really hate the idea of owners abusing Yelp in this way. You shouldn't need to cheat the system and lie about who you are to promote your business.\n\n---\n\nI can't believe all the other reviews saying EXACTLY what my friends and I have said about this place. \n\n1. They have a C from the Health Department. That's enough for me. But I'll go on, for those who realize this is New York City and lots of things are kind of gross.\n\n2. My friends have joked about calling the \"Stumptown police\" to report them for denigrating Stumptown's name with their inconsistent and undrinkable coffee. I have only gotten drip coffee there, and that is so bad I don't have any faith that they could properly use an espresso machine. \n\n3. We have also wondered why they are so aggressive about how much you have to buy in order to use their wireless (\"our rent isn't free,\" the sign defensively notes, which, by the way, is that even true?). This would be an awesome problem for you to have. This is a problem that the Starbucks on Montague has -- people camping out mooching off their wireless at the expense of other customers who would like to sit. This is not a problem that you have. Until you have that problem, you just seem unfriendly.\n\n4. Speaking of unfriendly, I see I'm not the only one SO creeped out at the owner staring at me from behind her computer at the bar whenever I've gone in. It's really weird to be greeted like that by a small business owner in your own neighborhood when you try to support her business. This place could not be closer to my apartment, and I have tried SO hard to like it. But the glares from the owner are the main reason I won't go in anymore. (Also? It looks bad when the line is super long, there is one person behind the counter making food / drinks / etc., people are waiting so long that they're getting out of line and leaving without making a purchase, and you won't get out of your chair to help!)\n\n5. The staff is almost, but not quite, as surly as the owner. They also don't seem to know what they're doing and move super slowly. If you are actually in a rush grabbing your morning coffee before heading for the subway, this isn't the place for you. If you don't want to help the person behind the counter make your order, this isn't the place for you. \n\nI really, really want to like this place. I've gone in many times hoping that the problems were just \"growing pains.\" But how many reviews of people who REALLY WANT to like this place and can't do you need before the management sees there's a problem?", "author": "Lynn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "My favorite little coffee shop in Brooklyn. Very cozy and relaxed environment. Great place for doing work or studying. There are large tables in addition to couches. Plenty of outlets. Books. Board games. Free WiFi. Good music. Nice people. Stumptown coffee. Wine. Beer. What's not to love? \n\nMy only complaint is that they have a rather limited food menu and run out of stuff occasionally. They also close the shop abruptly for \"private parties\" from time to time.\nRegardless, this place is my second home.", "author": "Annie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-15", "description": "After brunch at Siggy's or another restaurant in the area, my boyfriend and I usually stop by here to pick up a latte or capucinno before taking a walk.  There's never a line and we're typically in and out of there within a few minutes.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-12", "description": "I found Vineapple on Foursquare, where people are much more positive about this place... I was surprised by the reviews on Yelp. It seems Vineapple may of had a rough start, but I've found it to be a great place to get some decent (not amazing) coffee, sit with power, and receive GOOD wifi... all while not feeling overcrowded.\n\nThere's lots of room, couches, and big tables to relax/work/socialize. I have found the staff to be very friendly durring my visits (not many). I have heard the barista call out frequent customers everyday orders by heart, which is always nice to see.\n\nOverall, Vineapple is probably not going to make you your favorite coffee, but if you're looking for more than just coffee, this may just be the place.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "Cute, quiet, and quaint. Brought my friends son and thought we may be too loud bc there were so many people on their laptops. I would say it's a good spot to work or study, not bring a group of people.", "author": "Kris O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "Decent coffee but the girl at the register had a bad attitude. Place was packed, so we couldn't sit and enjoy our drinks. Also noticed that everyone was plugged into their laptops or iPhones so the place was like a library and I wouldn't have felt comfortable sitting and having a conversation there. I'll come by and check it out again, but initially I'm not impressed.", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "you are so cute, vineapple. \n\ni love your ambiance, chalk in the bathrooms, wooden tables, well-brewed coffee, and reliable wifi. \n\nGreat spot for getting some casual work accomplished or just killing time over coffee.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "This has become my goto productivity spot. It's a bit out the way but near express subway lines and nicely quiet. They have a decent selection of coffee, tea and pastries. It's one of the few places where I can let the hours quietly slip away while reading on any one of the couches or crunching on work/studying at the laptop/work tables. Think of it as a cross between a library and your living room.", "author": "Ebi B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-04", "description": "Cute\nCafe\nWith stumptown\nAnd open space.\nBoard games and wifi good for work or chats.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Stopped by Vineapple to grab a cappuccino, it was really good! It is nicely decorated and they play decent rock music (Led Zeppelin, Lou Reed, etc.). What I found cool was the bathroom (random, I know), it has chalk so you can write on the wall like a quote, your name, or even your Instagram username. It's a pretty cool place to hang out, chat a little bit at a decent noise level, or study while you grab something light to eat. Somewhat like a Starbucks. Since being a college student myself, I feel as this is an alternative place where students from Brooklyn can go and do their homework.", "author": "Kelvin M."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}