{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-17", "description": "Basically if you like working at cafes with your laptop, this place is perfect. It's big, airy, and relatively quiet, the internet works perfectly, and they really don't care if you camp out for hours. The coffee is decent and the chocolate chip cookies are absolutely fantastic.", "author": "M S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-26", "description": "Comfortable place to work. Good lighting at the communal tables. Lots of people on their laptops. they give you ceramic mugs if you are dining in.", "author": "G M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Best Coffee house in Brooklyn Heights!!! Free Wifi, great decor, amazing coffee, and super nice staff. I don't go anywhere else.", "author": "Chelsey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "I love Vineapple.    I like the internet.  I like the tea selection.  I love that it feels like my living room.  The coffee's pretty good, and I like that the staff recognizes me, even though I only go there a few times a month.  Also, the blackboard in the bathroom is super entertaining.", "author": "Gabrielle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "Love this place.  Chill, quiet, friendly.  Nice big tables; free WiFi.", "author": "J C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-03", "description": "But they have nothing to eat! Just pastry and coffee, wine and beer, and they close at 6 PM! It's a nice place but if they want to survive, at least have the option of yogurt, cereal for breakfast, an egg would be nice, fruit, SOMETHING! When I get home from work they are closed, too.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-30", "description": "My husband and I rented out the Vineapple for our wedding this Spring.  It was an all around perfect experience.  The staff could not have been more helpful, they were really amazing.  The owner Pooja went out of her way to make the whole experience easy, pleasant and fun. She also enlisted 2 member of her staff to work at the event and they were completely fantastic.  They allowed me to transform the space for the day of, and also worked with me leading up to the event to make everything perfect.  I would highly recommend renting out the Vineapple for private parties, and of course for your afternoon coffee.  They're great!", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "I walk about a mile to come to Vineapple. I like it because the owner and staff take music requests and the place moves seemlessly into a bar right when i'm ready to stop working. (I work from home so I'm always looking for places to go). I like coffee, I like wine and this place fits the bill. It's not sterile like Starbucks; there are books and games. I highly recommend it.", "author": "Meg R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-20", "description": "What's not to love about Vineapple? Location in a pretty section of one of NY loveliest neighborhoods, but not the super-rarified, super-expensive area of Brooklyn Heights.  Excellent coffee (Stumptown!), always my most important criteria in a coffee joint. Really nice interior with lots of different seating options from benches to sofas to a counter to picnic-type tables, all overlooking the rear yards. Pleasant friendly staff - in fact, maybe a little too relaxed as I forgot to pay for my espresso and they didn't even notice (I came back about 15 minutes later). For my sake, I hope Vineapple stays its uncrowded, unpretentious self - for the sake of the owners I hope that it's a rousing success. Can we somehow get both?", "author": "Steve N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-09", "description": "This place is rad.  It is not fully up to spec yet (no beer or wine yet), but keep your eye on this place.", "author": "Greg M."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}