{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Lovely space, free wi-fi, enough room to work. Latte was good, though not hot enough. And the care is a bit too kid-heavy for my liking. But great place in general.", "author": "Laura E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-17", "description": "I keep coming back to this because I loathe the Taza on Clark St. but I honestly am disappointed every time. How you guys manage to ruin Stumptown coffee is beyond me, but you do, you really do. And the pastries? Yuck. Grease bomb muffins and dried up croissants that taste like they were bought from Costco.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-05", "description": "Regular american coffee shop. Cappuccino was similar to one that you can get at Starbucks.\nBlueberries muffins were good.", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-23", "description": "Asked for a large, got charged for a large got a small. Asked for soy in one, got soy in both. Hey, at least the eye role was\nFree!", "author": "stine m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-23", "description": "Yea owner is totally creepy. Very uninviting fake feeling", "author": "Jerome G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-22", "description": "This is a good coffee shop that I used to really enjoy. They serve Stumptown coffee, as well as wine and beer.  The vibe is very relaxed but quiet.  This is a place to work or read, not a place to have a conversation.  \n\nMy gripe as of late is that I can never get a seat.  People tend to park themselves here - more so than at other coffee shops in the area.  I would be more inclined to come here, if I could find a spot.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "Man, the baristas here are surly as hell. But the coffee is really good (can't go wrong with Stumptown) and there is ample seating. It's a goto when I have to kill time, but I don't look forward to ordering my drink.", "author": "Coupe Et C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-11", "description": "Good coffee, good beer choice, good cookies, good wifi, respectful patrons ... some service is awesome ...some is indifferent ... and some of them act  as if you just foreclosed on their home ... hit or miss depending on the barista you get.  caution: music plays most of the time ... its the barista's choice ... some of it is consistent with the otherwise peaceful environment of the place and some is garish (and loud).", "author": "t w."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-07", "description": "Stars are for the coffee and the ambience. Minus stars are for the poor customer service. Forgetting an order for drip coffee when there is hardly anyone here is poor.", "author": "Peta C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "Good coffee, friendly service, chill atmosphere.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "Like most reviewers here, when this place first opened the lack of service, inventory and Stumptown brewing skills was pretty evident. But the last 3-4 months, the coffee has been good, the baristas are friendly, inventory hasn't been disappointing (amazing chocolate chip cookies!). I don't think they're overpriced for the coffee or baked goods. Its similar if not cheaper than Tazza 2 blocks down. You don't come here for \"deli\" coffee anyway. Ambience is relaxing and a good 'coffice' for many. I haven't been there at nite, mainly on the weekend days.", "author": "Clarita H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "My favorite escape in the city. This is the one public space I can go to study or just unwind. The atmosphere is unparalleled, it feels like someone's living room. Spacious yet cozy, it's easy to wile away the day here.", "author": "Breanna D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-05", "description": "I'm still hoping that this place improves. The location is AMAZINGLY convenient for me, and it's a nicely set up cafe, quiet and perfect for studying.\n\nSo why two stars? This place is, as far as I can tell, the owner's first attempt at a coffee shop and there are a LOT of kinks that she needs to figure out. Here is some advice to the management:\n\n1) Have sizes. And on the few occasions when you have cups in different sizes, let the person ordering know rather than guessing. Listing prices for those sizes would be nice too.\n\n2) Have consistent working wifi and more than two customers in the shop at any given time before you try putting up signs that say \"2 hours of wifi per drink ordered\". It's stupid and off-putting.\n\n3) Don't argue with the ONE person working the cash register and making the coffee to go get shit out of the basement when a customer is trying to order. Do it yourself because (surprise) often people ordering coffee are on their way somewhere and don't have time for you to have a ten minute discussion about how you hired people so that you didn't have to move. Seriously.\n\n4) Make sure you have cups/lids/straws in stock. Also, the cups and straws you have for iced drinks are so cheap that the lids leak, the cup feels like it's going to collapse in on itself and the straw bends closed under the force of the lid opening so that you can't drink out of it.\n\n5) If you could teach your staff to make drinks in less than ten minutes that would be wonderful. My latte to go doesn't need a heart design in it.\n\n6) CONSISTENCY. Every employee has a different idea about what to do when someone asks for an extra shot of espresso, or what cup sizes are available, etc. It's really frustrating.\n\n7) The ability to use my credit card in your cafe more than once a week would be great. \n\n8) Finally, stop sitting at the bar and glaring at customers when they come in. It's creepy.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-23", "description": "Not giving Vineapple 5 stars PAINS me.  Due to the lack of options in the neighborhood, I will be back \u0026 hope to update.  However, as of now, Vineapple is the perfect example of wonderful location \u0026 space with poor execution.  \n\nThe space is unbelievable!  It's huge, with separate spaces perfect for spending a few hours working.  You truly feel like you are in your own living room... which is wonderful. The coffee BRAND (Stumptown) is one of the best.  Service is friendly.\n\nOk, ok, why not 5 stars?  I've been about 5 times and every time I'm disappointed in some way:\n-not having lids for small iced coffee for about a week, (nope, I don't really want my iced coffee in a hot cup)\n-running out of ice on a hot day (seriously, just go buy more), \n-putting WAY too much milk in my coffee (when I ask for a very small amount),\n-(on that note) not allowing people to put their own milk in their coffee, \n-no discount for bringing your own cup, \n-no punch cards to reward loyal customers, \n-$3.00 for small iced coffee which is about 6 oz less than other Stumptown houses, (come on, you charge the same as TrIBeCa RBC iced coffee voted best in the city but give me a dinky little cup), \n-selling (cold brewed) iced coffee which clearly was not brewed long enough (I actually had to ask if it was iced tea by mistake), \n-and most recently, running out of regular sugar (seriously, I'm not kidding). \n\nThat's the list for now. I have a strong feeling that many of these issues are just bumps needing to get worked out... however, I can't help but feel like they are cutting corners everywhere without consideration of future customers.  And If you run out of sugar/ice/lids/etc, go buy some next door.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "good chill spot to hang. \n\njust please..please..get someone to clean the place once in awhile. \n\nespecially, the bathroom is...let's not even talk about it.", "author": "d l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "Cute cafe close to the Brooklyn Heights Promenade. I loved all the seating options though finding a plug seemed a bit tricky. I also appreciated the fact that they use Stumptown beans though my latte was pretty unremarkable.", "author": "phil h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-27", "description": "This place is the best. It has a lot of space and is located right around the corner from the 2 and 3 train. Plus free wifi and the lattes are the best. Before you leave don't forget to tag the wall in the bathroom.", "author": "Felicia O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "Brooklyn Heights is sorely lacking in comfortable places just to hang out. Vineapple does an excellent job of filling that need. It's a comfortable environment with couches,  comfy chairs, books, board games, and some long tables that feel a lot like a college library. That makes sense, since the crowd there when I visited on Saturday seemed to be mostly students who live in the dormitory housing around the corner. \n\nI went there to do some studying myself, over a perfectly reasonable cup of Stumptown, and I was very pleased. It was quiet but not deadly -- enough buzz to keep it from feeling sleepy. The music was low, mellow and tasteful: Gillian Welch and Beck, that sort of thing. I just had a cup of coffee, so I can't really comment on the limited food offerings or the espresso drinks, but it seems to me that much of the point of a place like Vineapple is that you can spend time there studying, chatting or relaxing. For that, it's ideal. \n\nWhen I need to get out of my apartment and study somewhere else, Vineapple is great to have, especially considering that there's really nothing much like it in the neighborhood. Every 'hood should have a mellow cafe you can pass the time in, and now Brooklyn Heights has one.", "author": "Joshua R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "FINALLY. Oh how much this neighborhood was yearning for a place such as this. What I love about Vineapple the most is that it is such a versatile space. Props to the designer who made it welcoming for individuals of a diversity of tastes and purposes. Whether you're looking for a place to work on your laptop, read a book or journal, hold a work meeting, or catch up with an old chum, you won't be disappointed. My one complaint would be that on my 2nd visit, I was given my latte in a disposable cup without a lid when I had expected a mug (and saw plenty of clean ones on the shelf). Luckily for them, this is not a dealbreaker for me (and honestly with the dearth of such cafes in the area, I shan't be so picky)!", "author": "Esther C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "This place is my go to coffee spot in the neighborhood. I love the atmosphere, free Wifi,stumptown coffee, oh and  six draft beers. My only complaints were the quality of the coffee as hit or miss at first and the early closing time. These things have been fixed. They now close at 8. 10 on Thursday, Friday, and Saturday. Also the coffee is great! I recommend trying it again if you gave it a bad rating due to those two reasons. Also, I can't blame them for wanting people to buy more if they stay past 2 hours. Honestly, I've seen people buy a soda and camp in there for over 3 hours. Seriously, this is a business!! They need to make some money. Overall, I can't recommend this place enough. It's just what this neighborhood needed.", "author": "Joseph L."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}