{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "This is a cozy, spacious cafe with good coffee. \n\nThe atmosphere is low key and focused. Mismatched mugs and couches make you simultaneously feel as though you are at home while also escaping the confines your apartment. Most people come here to do work, the only issue with this is that the wifi is a little slow. \n\nI came on a Saturday afternoon around 2pm and to my surprise, it was hard to find a seat, despite the bar and ample seating areas. Nevertheless, I found a cozy couch spot and there are a lot of places to plug in so you won't have to ask the person next to you if you can unplug their device (awkward, but it happens). \n\nThe service was quick and the baristas are super sweet, striking up small talk while waiting for my coffee.\n\nThe thing is, there aren't too many cafes in this area that will reliably have a place to sit, hang and accomplish something.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "Quiet. It has WiFi and large tables. A good place to get some work done without the owners trying to kick you out (like in the city). \n\nThe music is shitty though with mostly top 40 pops.", "author": "Patrick N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "When I mentioned this charming location with its cute interior decorations, friendly baristas, and groovy tunes to my (local) sister, she told me she writes here all the time and that everybody here is \"working on the next big thing.\" \n\nAnd that's exactly what this eclectic café feels like. This is a place to write. The majority of its patrons are studying and writing, silent and laptop-engrossed. So it's a great discovery for a Yelper who usually reviews cafes for their value as writing spaces.\n\nOn this particular afternoon in Brooklyn, though, I came in for a relaxed glass of wine and a chat. No worries. My wife and I sipped our passable wine, nibbled our very good grilled cheese sandwiches, and kept our conversation at a low, library tone, and we fit in just fine.", "author": "Kristy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-08", "description": "Vineapple is one of my favorite places in Brooklyn Heights. However, there is NEVER any seating. Literally people will take up spots for the entire day to work. I haven't been able to find a seat the last four times I've stopped in. I wish it wasn't like this because it is one of my favorite places!", "author": "Annie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Friendly place, a cool place to hang with a beverage + laptop.", "author": "George M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "I really enjoyed sipping coffee here while Im studying. Lovely atmosphere, furnitures and study desks. Coffee tasts a bit sour. Fruity acidity comes first.", "author": "Flora Yerin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "An excellent place to work, like a communal living room. There are several big tables and couches in the back, full of students, freelancers, writers, and independent professionals.  I have worked at many, many cafes across manhatten and brooklyn and this is one of the best ones. There is an air of seriousness here that some people seem to mistake for unfriendliness. Their loss.", "author": "Arthur D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Perfectly respectable little quiet coffee joint.  None of the furor of a high volume S-bucks,  just people on their electronics and some good elevator+ music.\nGlad I stopped in.", "author": "Al M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "Things that are great: the space, atmosphere, and location. It's quiet, and a great place to do work.\n\nThings that are not good: the staff; they're quite unfriendly", "author": "Tom F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Such a cute place. The layout is very warm and friendly, I've never seen anything like it. Appreciate the music, lots of Bob Dylan. It's not a \"breakfast/brunch\" cafe. It's more of a \"studious\" cafe if you're looking to get some work done. Great coffee, I tried their iced mocha. Would definitely come back again!", "author": "Jazmin Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-19", "description": "The Grilled Cheese Pesto came with a salad (a pleasant surprise) and made for a decent snack. The staff was nice and this definitely has an enjoyable neighborhood vibe, but I didn't find this to be cleanest of places as no part of the crumb-/coffee-ring-covered bar counter was ever wiped down during the entirety of my visit.", "author": "Kristin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Excellent staff making some of the best espresso in the city. There's also tons of space to stretch out and relax. It's like grabbing (really good) coffee in someone's cute living room.", "author": "Annoyed T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-09", "description": "I want to preface this with that I live in the neighborhood and I use to love Vineapple. But I just had such a bad experience with the Barista who was working on May 9th at 11:30 am, that I will never return and I will tell my friends to avoid the place as well. \n\nI just went in with my 11 week old puppy to get coffee and sit outside. My puppy was in a bag and I was just waiting for my coffee to be finished. The woman yelled at me while I was sitting on the bench \"IS THAT A SERVICE DOG?!\" and then continued to humiliate me and my pup while I was waiting for my coffee to be finished. I was not going to stay in the shop with the dog. I had just ordered a coffee with the dog in a bag. If she was concerned, she simply could have come over and asked me to leave instead of yell across the restaurant. \n\nI will NEVER return and I will actively tell my neighborhood friends to avoid. I am very angry.", "author": "Catharine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "Vibe: Hip, comfy, relaxing. Felt like we were in someone's living room, having a Lazy Sunday.   \n\nVery cute spot in the neighborhood! It had exposed brick and felt very laid back. This was one of the more quiet coffee shops I've been to, with most people occupying the space to read or do work. Not really somewhere you'd want to be in a group or to have a loud conversation. People weren't being rushed or hustled out of the space, which is hard to come across. They had wi-fi and a lot of outlets as well! \n\nVarious types of seating available - seats at the bar, or communal table seating if you want to plug in to use your laptop, and some couches for reading (they have bookshelves littered with books also), or loose chairs for casual chatting. \n\nCoffee was decent and they had pastries that looked pretty good. The credit card minimum was $8, so if you're just stopping by for a quick cup of coffee (~$3-5 depending on what you get), be sure to bring cash! \n\nWhat I'd come back for: the vibe - the space to read/work, the local wine/beer offerings (with a full bar soon to come)", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "This cute little cafe/wine bar is amazing. The front entrance fools you but there is plenty of space in the back with cozy couches. There was a young man today with a head scarf that gave stellar customer service. The line was almost to the door and he kept a smile and had such a warm spirit! He made my latte just the way I like it. Great place to read, do some work, and relax.", "author": "Martha R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-12", "description": "Cozy cafe with free wifi and nice coffee. Decoration of the cafe is like a home library.", "author": "Nicole Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "Wow does customer service not mean anything anymore?? It was practically empty when I came in this morning and the staff was still unbelievably rude and brash. They laughed in my friend's face when he asked to use their restroom (after I had ordered something). What is this, middle school? \nAnd then their $8 card minimum  \nIt seems to service the neighborhood hipster families, and yes their mocha was delicious, but still. I chose to come here over Starbucks in order to support a local small business but would have had a better experience at the 'bucks. Tisk tisk.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "I'm here on a Wednesday evening. Parking around the neighborhood naturally sucks but on Tuesdays and Wrdnesdays they're especially annoying. Tip: come here around 5:30pm, park, and wait til 6:00pm so you won't get a ticket, that's what I had to do. Kind of confusing but you'll understand when you get here! \n\nPlenty of seating: about 7 at the bar, 2 communal tables, some individual seating and maybe 2 conversation pits on couches! Front area seems kind of awkwardly open, probably because the lines get long in here?! Idunno im just guessing, otherwise it should be filled up with more seating. Front sitting area has a couple of outlets, one actual conventional ones and 2 in really awkward spots/no tables/chairs so? Hopefully next time the back won't be as crowded so I could let you know if there are outlets back there, lol. But can tell that there are lots of windows, lots of light! \n\nMenu lacks options but serves Stumptown coffee, and you can buy bags off the wall, $13. Offers beer and wine as well, never tried. Cream cheese bagel was $2.75, medium latte was $3.50. Average. \n\nAlso, made note at the door that it had a very progressive \"breastfeeding welcomed here\" which made me happy!!!\n\nAnd no one ever reviews bathrooms, do they? But I would love to hear abt the bathrooms so LOL! But it was an okay bathroom, not dirt gross but not too clean. Had chalk so you may write on the black walls before you leave. Hand drier, but no paper towels. Irks me when I have to touch the doorknob right after I washed my hands :/:///// \n\nOverall lovely place, would come all the time if it wasn't so far from me!", "author": "Diane F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-08", "description": "For the price of the coffee (and they charge for ice in the ice coffee!) it really isn't all that great. Its definitely the best place for proper coffee on that block but that's about it. The staff aren't too friendly either. Has so much potential and could be so much better", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "Vineapple is truly a comfy place to bring your laptop \u0026 work and enjoy some caffeinated libations at the same time! Also, it doesn't hurt that I live 3 - 4 buildings down from this place, which is super convenient for me! \n\nI go to this spot quite often, and, by now, the barristas know my coffee order by heart... and the owner is all smiles when I speak to her. How awesome! Sure, sometimes the lines are long in the a.m. while the barristas are working their magic, but the wait is never too long.\n\nBtw, just so you know, this coffee joint features more than just great coffee, awesome snacks, and great service.... they have long picnic style tables and comfy chairs for unloading your laptop and doing some work. In fact, I often find myself packing up my computer and walking down the road to do some co-working at Vineapple. \n\nI do have one final note about the pastries they serve--they are utterly amazing. They get their pastries from Colson Patisserie, and they are top-notch. My favorite is the Everything Bagel, which is your typical New York-style bagel but baked and flavored to perfection. Mmmmmm, my mouth is watering right now. In fact, the first thing I'm gonna do when I wake up is go downstairs and get one of those bagels, bring it home, toast it, and slap plenty of cream cheese and lox on top! Nom!!!!\n\nP.S. They have wine (hence the name Vineapple) \u0026 beer, which can be purchased in a bar-like area of their establishment. So, if you're nearby and wanting to have a relaxing glass of wine later in the evening, check this place out.", "author": "Scott B."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}