{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "So, overall, this is a great place to study and get work done. I have enjoyed working here and find that I'm pretty insanely productive when I camp out at Vineapple.\n\nBefore I get to the ways in which Vineapple is great, here are some things that are... not so great. There's one slightly grimy bathroom, the lighting is a bit dim toward the back where there are the most seats and tables, and the heat is turned up a bit too high in the winter. Also, the outlets are not super transparent and therefore a bit difficult to find.\n\nOn the other hand, Vineapple has super fast WiFi that doesn't crash even if there's lots of people in the cafe (could probably seat 40-50 people in the whole place), they have delicious food and excellent coffee, and it's generally pretty quiet if you're in the back (though sometimes the staff will play quirky music but I usually rock on with headphones while working). Best of all, it's right off the Clark St stop or a 10 min walk from Borough Hall!", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "Overall solid cafe, located pretty conveniently since for some reason there aren't that many coffee shops in the area (in Brooklyn, can you imagine?). The interior is a bit dark but very quiet. There is a lot of space but they don't have that much seating in the front, only the back, which kind of contributes to a cramped feeling despite being decent square footage. The music they were playing was some weird high energy stuff which didn't quite match with the ambiance. There is wifi, and quite a few people camped out in the back with their laptops. Fairly busy but not crowded at all on a Sunday morning.\n\nThey sell some packaged coffee here, as well as espresso drinks. Packaged coffee come with a free small coffee. Staff were a little confused as they seemed kinda forgetful and a little haphazard. For example they incorrectly charged the free small coffee w/ the pound of ground coffee and didn't realize until after we swiped, and couldn't figure out how to undo it. They had broken their matcha brush so was stirring mine with a coffee stick. \n\nOverall I liked the ambiance and the cozy indie vibe. Service was a bit haphazard but everyone was very nice. Pricing is reasonable and they have a pretty wide menu of food and drink options.", "author": "Pam C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-12", "description": "Reviewers are not kidding about the vibe. You can feel the focus and concentration when you walk through the door, everyone is hard at work on laptops/tablets/etc, no one even looks up when cold air blasts through the open door. It's kind of depressing how there's no conversation, despite the incongruously pumping music. I guess it's a good place to work, if not a great place to socialize.\nThe espresso coffee is good, prices are on the cheaper side for Brooklyn Heights, and they have non-dairy alternatives (soy, almond, oat). Sweet pastries and bagels if you're hungry. Great location on the way to the 2/3.", "author": "Suri M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "This is a cute coffee and bakery joint that is quiet with couches, communal tables and a coffee bar. The vibe is chill and laptops welcome. \n\nI love their soy chai latte,personally but they have a bunch of yummy things.", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "It's a fine coffee shop. There aren't many other options in the nearby proximity. Their cold brew is okay. Not great. Passable at $4.\n\nThe space is nice. Pretty big seating area in the back, and some small tables in the front with great lighting and awesome artwork on the walls.\n\nThey also serve food (sandwiches and such), so bring your laptop and stay all day.\n\nOr don't. Whatever, I'm not your mom.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-18", "description": "Vineapple is a cozy coffee shop with indie vibes located on Pineapple street in Dumbo. It is a FANTASTIC place to work and is therefore, almost always packed with folks hammering away on their computers. The people are quiet and focused; the wifi is fast. It's a good environment to get shit done. \n\nIn the front, they have a few tables and a comfy couch corner near the windows. You can talk, catch up with friends, and host meetings here. In the back, they have two long tables for working and several couches on the sides. If you talk in the back, YOU WILL GET DIRTY LOOKS - I will also be giving you major side-eye. There's also a middle bar area you can also work on with good lighting.\n\nWish they had more food options, as there are only pastries, bagels (gone by 2pm) and grilled cheese with salad.", "author": "Melanie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "I love the ambiance here. I was craving a chai latte and came across Vineapple while strolling around the neighborhood. The cafe has plenty of seating ranging from pillowed window benches to sofas and coffee tables. I stopped by on a Thursday morning and it was full but not crowded - plenty of seating if you're looking for a private work station.\n\nMost of the people there seemed to be working (an assumption based on the abundance of scattered MacBooks and heavy looks of concentration). The latte was pretty good and tasted even better paired with a massive almond croissant, one of the many breakfast pastries on display.", "author": "Hillary H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-06", "description": "I have been coming here for years frequently and I never experienced the disrespect I did this morning. I don't know her name but she's heavy set with blue hair. She gave me a nasty attitude when I gave her three Punch cards and proceeded with a nasty comment about the amount of cards I had and she ripped them all apart when I had a card left over with two punches.I have spoken to the others about bringing my dog in and they all said it was fine, apparently this woman had a vendetta on me and interrupted me while I was eating to say I needed to leave because I had my dog with me. Keep in mind my dog was on his best behavior and I've been told by multiple employee's that it's ok to have my dog in the front of the cafe.. I didn't wake up to PAY to be disrespected by an overweight, unstable, insecure woman who works on a low vibration. I could have made my coffee at home or went to Joe's coffee for a better price. If you are like me and do not appreciate disrespect first thing in the morning or at all, do yourself a favor and avoid this place... The cafe does not have a high vibration almost all workers are clearly unhappy and have an attitude. If any business is to be successful the employees need to be respectful towards those supporting the business. As a long standing customer I will not be coming back.  I am highly disappointed in a business who would allow this to occur with customer who has spent a good amount of money towards the business. When I called to speak to the manager she lied and said she was the owner and again proceeded to be disrespectful. This was yet another very bad business move. I will be back on Wednesday to speak with the manager in person about this inconvenience. On a lighter note the man who is there on occasion with the red long hair has great high energy and he has never been disrespectful along with the man who always wears owls he is always nice.", "author": "Kyle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-20", "description": "I love this coffee shop. It's on the more spacious side which makes it cozy. The staff is friendly and the coffee is great too. It's nice for a Sunday coffee or just taking a stroll. Highly recommend this place.", "author": "World U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "The seating area in the back is the highlight of Vineapple. I agree with another reviewer that the music can be problematic. The day I was there it was hip-hop (the quality kind) BUT there was still cursing in it. It's also hard to read or work when hip-hop is playing in the background- and most people there are working or reading. Loved that they had a vegan sandwich as an option!", "author": "Aly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "Really cute cafe where to just relax, read or write and enjoy a beverage with other quiet types. The staff is super nice and friendly. There is free wifi for the guests.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "I like this little wine bar/coffee shop. It is the perfect place to meet friends and catch up.\n\nIt can sometimes get noisy, with many writers, freelancers, students, and moms with kids who frequent this spot. However it has a wonderful quirky community charm that makes it well worth the stay.\n\nIt's the perfect spot for a pick me up after a rough week: grab a cup, have a cookie, and catch up with a friend.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "Dear Vineapple General Manager, please consider a curated music playlist for your business, and do not leave us at the mercy of your baristas' musical fancies! My only complaints with your establishment are the inconsistent sh*tty music and climate control. The music today is Czarface Meets Metal Face. I'd take mind-numbing drum and bass over this! The temperature is often very inconsistent here also, usually stuffy and warm. This evening, I can feel my underarms brewing!  Otherwise, Vineapple is a great place to work and read, if you can get past the tunes and temperature. The coffee and pastries aren't bad either.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-27", "description": "Dropped in with family for tea, coffee, party.  Music was unnecessarily offensive.  F \u0026 N constantly.  Is that the cool thing for white people now, to listen to N bomb dropping music?  Supporting the artist who spews it, I guess.  Consider all your patrons.  There are children in here.", "author": "Susie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "Quirky little coffee shop/wine bar which treads a fine line between \"charmingly ramshackle\" and \"wait, I think maybe it's just dirty.\"\n \nGood coffee (Stumptown) and a spacious interior - areas for laptop warriors (with free wi-fi) as well as your average sit with coffee and book person, like me. However, as noted, the cafe seemed messy, crumb-laden and a touch unclean to me, not to mention painfully warm inside. The space has potential and this area badly needs an indy cafe and hang-out spot along these lines.  I hold out hope they can turn it into more of a spot where you're happy to linger over that nice cup of joe.", "author": "Rob W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "I was looking for a place in the neighborhood that offers Matcha Lattes. Vineapple does and it was perfectly made and delicious and not terribly sweet because their Matcha is sugar free. Nice and quiet with interesting spaces to sit and be quiet with yourself which is a good thing. I would visit again.", "author": "Trisha Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "Fantastic, chill, lovely space to be productive and have a coffee or tea.. and maybe transition to a glass of wine in the evening :) They have some sandwiches and a wide variety of locally made pastries, including gluten free and vegan options too. Baristas are all delightful and the place just has a great feel to it. My drink recommendation is the espresso macchiato - they do it just right here.", "author": "Mariah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "Love this place, one of my top spots for studying or working. Drinks are great and fairly priced. The WiFi works fantastic. The only downside is depending on where you sit, the AC might be blasting straight into your face.", "author": "Danial A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "After being battered by the blistering strong wind and utter cold of Hurricane Joaquin October 2015, my party of two trekked to Vineapple on Pineapple Street in Brooklyn, NY for warmth of a local coffee house.  Cozy atmosphere with chairs, couch, bar stools, tables and bar counter equipped for patrons seeking stillness of inner peace, power and WiFi signal for tech gadgets, reading newspapers or engaging in a book for solitude.  Modern and clean with a simple look.  The staff allow patrons to sit for hours or at least when it gets busy.\n\nWith great disappoint, no more chocolate chip cookies.  No classic chocolate pastries as chocolate croissant, or chocolate donut, or chocolate brownie.  I opt for a hot Jasmine Green Tea.  All teas are from Harney \u0026 Sons.  Teas and coffee are served in disposable paper cups rather than actual china when dinning in fending a cheap quality atmosphere of this business.  Servers are average robots who appears apathetic and extremely STOLID without compassion for my great abiding passion for my favorite sweet:  chocolate chip cookie (without nuts).  The absence of chocolate chip cookies with a cup of tea or coffee in a coffee house drains the mood and brings darkness to one's spirit.  Despite the horrible weather I made my trek to my local pharmacy to attain chocolate chip cookies for enjoyment in the comfort of my own home.\n\nNote:  Credit card purchase is $8.00 minimum.  MEH!  Their business card also serves as a loyalty card for the tenth drink is free.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Cozy and spacious coffeeshop for work+study. They have bunch of outlets and the inside is quite quiet, although music is played all along. Fabric sofa doesn't feel super clean and the drinks are not the best, but I love hanging out there by myself. Also I just love being there as a pineapple fan.", "author": "Hyo Jung K."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}