{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Outlets are abundant, so you will never run out of juice, but wi-fi can be a bit spotty, and I've had better coffee. Still, Vineapple won my heart a long time ago with its concert photography-covered exposed brick walls, tons of comfortable seating, fresh almond croissants and grilled cheese sandwiches. \n\nOn one hand, the employees won't look at you sideways if you camp out with your laptop and do your work. On the other hand, getting things done will probably take longer than usual because you will be distracted Shazam-ing all the awesome tunes from Vineapples' rock- and indie-heavy playlist. Luckily, if you do end up working past afternoon, you can seamlessly transition from coffee to (generously poured) wine and local brews on tap.", "author": "Olga F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "nice, relaxed place. \nTables and couches are available for a quick stop or a long break. Full of local students studying or chatting but overall it's really quiet. The employees are friendly and attentive. Didn't try the food, but the coffee was great.", "author": "Giuseppe T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Came here to study. It's a big place with lots of tables/couches and very cool vibe. Outlet space was a little limited and lighting is okay but not ideal, although they have little lamps at some tables if you do happen to have outlet space.", "author": "Theresa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Vineapple is my favorite place to do my work! They have an incredible, homey ambiance that makes it super easy to get some work done. The coffee is delicious as well, as I especially love their iced mocha, one of the best! The baristas are all very friendly as well, and I have enjoyed some wonderful conversations with them. Definitely check Vineapple out if you are in the area.", "author": "Luke P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "I LOVE VINEAPPLE. This is such a cozy place and the drinks are very good. Mitchie is my absolute favorite barista. She's very friendly and she's very patient and kind. I love coming on days that she works because she never fails to make me laugh.   Absolutely amazing smile.  Nathan is a very friendly guy too. I'm sure I've gotten on his nerves with my specific orders in the past but he's always patient anyways. It's really quiet so great when I go to study. I've never had such a good experience at any other coffee shop. I've recently moved to Williamsburg and I still travel to Brooklyn heights for the Vine's grilled cheese.  I love that you can order wine and cozy up on the couches or even that you can tag the walls in the bathroom with chalk. \n\nAs long As Mitchie and Nathan are there, I'll remain a valuable customer!", "author": "Kathy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-27", "description": "I was excited about the prospect of finding a good coffee shop in DUMBO, but Vineapple is not it. Latte was luck warm, lacking foam, and not great flavor. There is an $8 minimum for a coffee shop that sells nothing but coffee and pastries, which seems a little ridiculous, and the staff was not overly friendly. I considered grabbing a loyalty card, but realistically, I'll never be back.", "author": "Holly L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-13", "description": "Good place to go w/ laptop to chill and get work done, coffee is ok, like there iced mocha's, the grill cheese pesto w/ salad good but don't except a large selection of food menu here, It's the roll of the dice when it comes to staff behind the counter, most are just indifferent and seem to lack in caring about customer service.", "author": "DW W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "Went here on a recent trip to NY to fuel ourselves before we walked on the Brooklyn bridge to Manhattan. \n\nThe latte was fantastic. I loved the fact that they served coffee in such cute mugs. The place has a super nice cozy feel to it. We ordered the croissant (which came with a large dollop of butter), the bagel with nutella (yum) and the grill cheese panini. All the food was yummy and was served beautifully!", "author": "Anju J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Vineapple is one of my favorite coffeeshops. I rarely have trouble finding a seat and the atmosphere is great for reading/getting work done (especially the communal table near the outlets), as well as for hanging out with friends. The staff is friendly and the coffee does the job. My only complaints are about the $8 card minimum and the early closing times.", "author": "Menna E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "This is a nice little gem in the middle of Brooklyn Heights. Quiet, soothing music adds to the appeal of this joint. It was a great spot to sit down and read my book while most of the patrons here are quieting banging away at their laptops. I love just how many couches they have here. AND beer on tap at their bar! Coffee isn't anything special though.", "author": "Jay Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Very cozy lovely place. it feels like you are at home. Their bagels are amazing and i love the coffee! I love the interior design", "author": "Aida G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Cozy atmosphere, reliable wifi, good place to work/study!", "author": "Kati E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "Quite good coffee. This would be a good laptop spot if it weren't for the music: the \"most annoying songs of the 80s and 90s\" soundtrack is played just a little too loud for you to be able to enjoy an alternative on your headphones. Take earplugs or get your coffee to go.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "Great spot for getting work done. Friendly baristas and clean environment. Tons of outlets to plug in :)", "author": "KerryLyn K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "The place is confy and quiet so you can work, study, read a book or simply chat quietly. \nIt's big enough so you enjoy a table or a sofa or a spot near the baristas. \nHad the iced latte and a chocolate chip cookie. Perfect.", "author": "Celine A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Good vibes and the staff is really friendly and nice. The coffee and treats that can be purchased are fairly priced and delicious", "author": "Nancy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "I would give this place 3 1/2 stars if I could.\n\nPros:\nGreat spot to do work (free wifi, couches, tables)\nCute, comfy atmosphere \nGrilled cheese sandwiches\nCaffeine \nEscape from my apartment while studying for the bar exam\nGood music/noise level\n\nCons:\nUnfriendly baristas \nUnderwhelming pastries (I do not recommend the blueberry muffin)\n\nAt the end of the day, it really is a good place to get work done: far more pleasant than Connecticut Muffin on Montague St. (not cute) and a much more tolerable noise level than Konditori on Smith St. (although their cookies are delish). I will say the biggest con here is the staff. Don't get me wrong -- I have never had a \"bad\" encounter with any of the baristas per se. They're just unfriendly. That being said, as long as someone will take my money and hand me an americano without hurling expletives at me, I am satisfied enough.\n\nFinal note: This probably isn't the place to go if you're looking to have a boisterous conversation with your long lost friend. Most people here are doing work or reading quietly (there is a well-stocked bookshelf to choose from, as well). Talk too loud and you might get some dirty looks -- not from me of course :-o ::sobs into bar review outline::", "author": "Rebecca N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Frothy, delicious hot chocolate. Great vibe. Good for doing work with a laptop or reading a book on one of their couches. Not too hip, not too mainstream.", "author": "Jansyn T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-05", "description": "Why is this place always randomly closed? I come here because it's one of the only places in my neighborhood that serves Stumptown coffee, which I love. A few times I've tried to go and grab a coffee and it's been closed, once for a private event and a couple of other times for different reasons. \n\nAlso, the service could use some improvement. The people who work there never smile and don't seem to like working there. One time I tried to get a cold brew and they obviously had forgotten to make it and they just served me hot coffee on ice and still charged me the full price! I can understand paying $4 for a delicious, rich glass of cold brew but not for hot coffee over ice, even if it is Stumptown. \n\nI'll be back only because it's in my neighborhood but I've come to expect crappy service and unpredictable hours...", "author": "Gabriela M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-26", "description": "So conducive to work, it's almost more like an office than a coffee spot.\n\nThis is a nice spot with lots of light, good food, and a smart staff. It also offers a great office away from the office (or the home office), with lots of space to park a laptop, lots of outlets, and a pretty quiet environment. Their grilled cheese sandwiches are a treat, but even if you don't get one, the smell of them being prepared here lays the ground for a good mood. \n\nIf you're looking to work, this is a great spot to pop in to, and unique in this part of town. But if you're looking for a more relaxed coffee spot to meet friends and have a conversation, you might find it's not best suited for your needs.", "author": "John S."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}