{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "I love Vineapple. I live in a cafe-infested nabe and will choose trekking to Vineapple every time. The baristas are friendly and the drinks are pretty good but the ambiance is what makes it for me. There's couches everywhere, they're always playing good \"coffee house\" music, the patrons are also generally pretty nice and will make room for you on the couch/not spill their life's belongings into your lap. It's quiet. For me, it's my perfect place to do work and get a few soy lattes.\n\nOh, should mention- It's a laptop heavy cafe. If people working around you ruins your vibe, this is probably not the place for you.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-14", "description": "I've been here a few times to get a quick espresso and I've been pleasantly surprised only once. The staff are unresponsive and don't seem to want to be there. The coffee, which is the most important part to me, is good but tends to be made poorly. My espresso is too hot with poor creme (except once when it was near perfect), my mocha was bland with care given to properly foaming the milk, and my experience has yet to be a good one. \n\nSitting down here for the first time, I have to say the space is excellent. Great space to work. I would definitely come back to sit here. \n\nIn the end, I'd say this place is good enough.", "author": "Oren C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "Upon walking in you think this place is gold. Until your first interactions began with rude customer service, a whopping 8 dollar card min (and no atm), followed by the inevitable intrusion of some hipsters awful kids. The coffee is good- but over priced. The layout is awesome providing plenty of room and charging spots. Too bad their employees and the bulk of their clientele are almost too much to handle.", "author": "Melissa A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-19", "description": "'Schleppy' best describes my overall impression of Vineapple.  If you can resist thinking of what Vineapple could be (with more attention to the details or even desire to improve?), then go on in. I do.\n\nPros:\n(1)Laptop working space with OK WiFi.\nVineapple is the only space in the nabe that provides an indoor working space with WiFi.  The LAN suffers badly however when lots of people are online, probably due to the use of residential vs commercial network equipment.\n\n(2)Lots of natural light in the workspace area from the many large bare windows.\n\nCons:\n\n(1)Inconsistent quality espresso drinks - from terrible to decent, depending on the employee and time of day.\n\n(2)Schleppy appearance.\nThe counter you face you as you sit behind the bar serves as the food prep area, business office, and employee 'lockers'. A big ask for a small space, and unsurprisingly, it becomes very disorganized. All of the couches and throw pillows have slip covers (a great idea!) but they don't appear to have been either washed or replaced since purchase. The piston arm on the front door has been broken for close to a year.  There are lots of little details like these that add up to an overall sense of 'schlep'.\n\n(3)Very limited food options at lunchtime. Though there is no kitchen, perhaps Vineapple can expand their offerings by purchasing a coupe of those 'Turbo Chef' high speed ovens and offer hot pre-made food.\n\nFor lack of any options in the nabe, I have returned to Vineapple over the years, with one eye closed. Meh. (and weep)", "author": "andre p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Fantastic place to grab a cup of coffee and a pastry-- would love to cozy up to a book or my laptop and get a few hours of wifi work accomplished. Great selection of books and I like the community vibe. The staff was friendly, too.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "This place is amazing. One of my favorite places to work. Everyone is working on their computers and being quiet. Its all the conduciveness of a library without the bleakness. great, cool music at perfect volume, and coffee and treats on hand. A separate place for people who want to meet to chat on cozy couches or by the front, and bar tables for options of seating. um, here's my gripe. freakin' people who sit at the quiet tables (not so designated, but come on, pretty much tacitly agreed to be so) and talk loudly on their phones or earphones or to each other, especially when there are other options. It's totally obnoxious and insensitive. I come here particularly because it is such an awesome work space unlike most other cafes. except when this happens! \n\nNOTICE to all who plan to come to chat or be on your phones -- have some common sense respect! I always leave the tables and walk to the front when I have a phone call... you can do the same, no? \n\nNow that I'm done my rant, I'll continue... I heart the baristas, all very nice and accommodating... (and I could go on and on about the atmosphere and music and hours and solid wifi:))", "author": "Sarah Jo M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-07", "description": "We popped into this place while on vacation over the New Year. \n\nMy takeaway was that this local hangout was an internet cafe that will cost you a cup of coffee. Long tables with benches and bar seating filled with people using their laptops. There is conversation seating but the sofas are broken down and have filthy slipcovers.\n\nWe ordered a drip coffee with cream and a cafe mocha. What we received was a coffee with milk foam and a cafe mocha latte (with a heart no less in the latte we didn't order). The coffee was not good and the last straw was that I could smell and taste honey in the cup I was served, apparent residue from a previous customer's coffee. \n\nIf Stumptown has good coffee as previous reviewers have stated then I would guess that the cleanliness of this establishment is effecting the taste.", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-28", "description": "Another example of the sad paradox that is Brooklyn Heights coffee scene: it's so limited, and yet the venues that survive are so underwhelming. Don't come here looking for \"baristas\" who know how to pull espresso shots. The coffee is perhaps a notch above Dukin Donut's, but at least the latter doesn't pretend to be real coffee. These guys do. They pull over-brewed, bitter shots that can only be saved by copious amounts of scalding hot milk. When I asked for a cortado, she looked at me like I'm from Mars. \n\nSorry, but this is NYC: step up your game or get out of here. There are enough mediocre coffee shops to go around (right, Starbucks?)", "author": "Nicolay S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "It's ok.\n\n2 blocks from my apartment, very quiet, free wifi. A good atmosphere to do work in if I am going stir crazy in my apartment. However. They do something funky to their coffee. Stumptown should be delicious but theirs tastes...off. The pastries are fine. The chocolate croissant is passable, but too limp. Go here for a nice place to study. Do not go here expecting culinary greatness.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "This is my all time fave coffeeshop! Good for getting work done or conversation. So much space and the staff is friendly. Bc so many ppl treat it like an office, it's also safe and collegial among patrons. All in all, an atypically pleasant ny experience.", "author": "Hilary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Good coffee made in the spot. Pastries so very fresh and bran muffins that are moist!   Large comfortable seating with comfy chairs. Quiet enough to concentrate on work    Friendly group works at counter", "author": "P G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-13", "description": "Quiet, spacious, comfy, well-decorated and softly lit (with enough to read a magazine or work), this is a little gem of a coffee shop.  Wine and beer available too!  Closes early, which is the only reason it's not 5 stars.", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-01", "description": "OK coffee, but a good place to hang out. Cozy and dim with plenty of space. Relaxed music. Staff is a bit haughty.", "author": "Robert B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "This is easily my favorite coffee/tea hangout in NYC. Wedged onto alley-esque Pineapple Street in Brooklyn Heights, this place comes closest to resembling the bookish, hip and chill coffeehouses of the west coast. Solid coffee drinks, big tea selection, a sizable offering of cafe food including grilled cheese and other sandos, hip music streaming over the stereo, and best of all a bunch of table, counter and couch seating in a living room like environment for those who want to study, read or just chill over their coffee and food for a while. This is one of my favorite NYC places to go hide and relax over coffee/tea for a while.", "author": "Steven G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-15", "description": "like a cozy living room. good for working and reading. they have little library and some boardgames", "author": "Danah A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-10", "description": "I give this place four stars for atmosphere. It's cozy, laid back, spacious, and quiet. The staff are relatively friendly. \n\nI give the coffee 3.5-4 stars. They serve great beans. Not the greatest cup I've ever had, it's good-great.  That's not what they are aiming for either so they meet your expectations.  \n\n\nI wish they had better food options.  I would give them 3 stars.  Not sure why they are so limited in the quantity and quality of their food, but I'd probably go there more often if I could count on a more robust menu of higher quality hot and cold plated food. \n\nI'd give it 3.5 stars if I could.", "author": "Navin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "It is a nice cozy place. It's only maybe 3 blocks from Brooklyn Bridge Park. Visited the place around 7pm on a Friday. \n\nIt's quiet and perfect if you want to work or concentrate. Yes, free wifi people!!! Plus, they have outlets too. Don't want to work? You can relax and read a book from their selection. \n\nIt has a casual, very chill vibe. It's very spacious - has chairs, couches, and a bar. I like how they decorated the place. The bathroom is clean and the walls are chalkboard so you can write whatever. The service is great and very friendly. \n\nCoffee is good. They only have hot and iced coffee. They have sodas too and some snacks. Overall, I recommend this place if you just want to be on your own and have some down time.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "I love living in this big, bad city. I relish my subway trips, even if they involve loud or crazy passengers; I don't always mind the stiff, cold breezes barreling down the canyons of the city's skyscrapers; I've even gotten used to being surrounded by at least a hundred people at all times. \n\nBut on certain days, when it all starts to get to me, I go and hide inside Vineapple.\n\nThis place is a find. It's hidden off a main thoroughfare, so it feels like a secret, yet it's also located near several subway stops, so it's convenient. It's always warm. There are comfy couches and long communal tables. There's a bar where you can sit and have your coffee brought to you while you work. There are affordable-ish snacks in case you get hungry. You don't feel guilty spreading out the paper or reading a book. And the people who work here are always so friendly. \n\nThe one downside is that it's almost too hushed, like a library. People are reading and resting and relaxing in here, so there's no hum of conversation to envelop you and a companion in privacy. It's not a great place to catch up on a scandalous story, or to meet for a lesson. So ironically, the result of sitting in Vineapple for too long is that you begin to pine for the noise of the city outside again, and for a little more hubbub in your life. But the fact that a visit to Vineapple has the power to restore this balance in my life is ultimately a good thing.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "Awesome and cozy. Good coffee, reasonably priced. Muffin was moist and soft. They have couches and comfy chairs plus lots of big tables to do work at.  Wasn't even pretentious!   They also have a bar if you want some booze.  If only I had found this place sooner.\n\nIt closes at 10 which isn't that unreasonable I guess", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "If you're looking for a great space with stumptown coffee, this is it! The best part about this cafe is the varying levels of volume-- there are tables people use for studying or working quietly, and couches for chatting with friends. I live local, so sometimes I'll meet a friend here to grab a beer and hang out for a laid back evening.", "author": "Erin C."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}