{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-30", "description": "A few weeks ago I was walking around the neighborhood and was perusing Yelp for a coffee shop nearby. From the photos and reviews, this place looked like it'd be a great choice -- and I do think it was a good choice. Just a few things weren't that fabulous. :/\n\nI really only wanted coffee, but I only had my debit card on me, so I unfortunately had to spend at least $8 to meet the minimum. I ordered a sandwich with my coffee, which I suppose I made myself get excited for, since I paid for it.\n\nI'm not sure if sandwiches usually take a long time or if it was because the woman behind the counter was texting without looking up once for -- and I am truly not exaggerating -- about 10-15 minutes, but since I wasn't told where to wait or when it'd come out, I found myself kind of staring at the counter for that period of time. \n\nMaybe she was being lax because I wasn't asked if I was taking it to go, even though my coffee had been given to me in a to-go container. Maybe she thought I was gonna be hanging out there for awhile and I wouldn't mind waiting. If you're in a hurry and just want coffee, I'd say go for it and visit this place, but if you're in a hurry for food, I'd say probably go somewhere nearby.\n\nMaybe the food doesn't normally take that long and I wasn't very important. Maybe she wasn't in the best mood. Maybe she was dealing with a family crisis. I like to give people the benefit of the doubt, but still, it seemed like maybe she just didn't care.\n\nThe sandwich was delicious and the coffee was great, too. But the service wasn't fabulous and I felt a little bit of coldness from the lady behind the counter.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "I don't write many reviews--maybe like two in my life... but this is my favorite coffee shop in the city (and they have the best music) so I decided to send love. It gets crowded sometimes but its cuz everybody loves it so much", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "The quiet and cozy atmosphere coupled with steady wifi, makes this a perfect place for studying and getting work done. \n\nAlternatively, it's a great place to escape the bustle of smorgasburg.", "author": "Eric T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "The place has a nice calm vibe to sit at but the employees don't smile nor do they respond after saying thank you. The guy that works there (red cap?) was beyond rude. Great coffee and pastries. Horrible service.", "author": "Fatimeh A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "I live in the neighborhood and this is a good place to meet people for art-business related meetings. Although it's often crowded.", "author": "K K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-23", "description": "Ugh, where to start? \n\nVineapple is close to work and they brew Stumptown. So, naturally, the coffee is very good. The staff and people who bogart the space leave a lot to be desired. \n\nI don't understand the staff rudeness. Cafe Pedlar makes superior coffee and everyone there is wonderful. But at Vineapple, I'm apparently making their lives difficult by ordering coffee. \n\nSo, to all those who go there and are annoyed by the staff, here's a tip: out-snob them. If you get nastiness from them, try this: ask if they do pourovers. When they say \"No\", respond with \"Oh\" in the most condescending way possible. \n\nThe best way to beat a rude, hipster barista? Out-hipster them. Suck it, squares.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "This place is extremely spacious with plenty of outlets. Quiet atmosphere, definitely not the place to have a loud conversation (at least in the morning/midday). However the cafe itself was uncomfortably cold. The coffee was great since they serve Brooklyn Roasting Company, but the lack of variety in the menu was disappointing. \n\nOne star off simply for an $8 minimum to use a credit card.", "author": "Pearl S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "I dont live in the area and Came here to work on a weekday. Its pretty packed, tables were full so i got to sit by the counter. atmosphere was very chill. Music in the background wasn't obnoxiously loud but just right to still be able to concentrate.  The staff was friendly. I had the hot chocolate which was yummy and paired it with a lovely chocolate croissant. Would cone back if i come back to the area.", "author": "Stef Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "This used to be a gay bar called \"Whatever\" in the 90's and I used to work there. Feeling nostalgic, I searched for Whatever and found no trace of the gay bar. I was 17 years old. It was my first job. I was a 90's goth and it changed my life. I used to powder up and tape down drag queens. I used to do their makeup. I never used to think I had any talent at all, but one night, someone said to me, \" Your makeup is gorgeous. Can you do my makeup?\" I became a makeup artist.", "author": "Rachael W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "Don't go. After being one of my favorite spots, today was unfortunately my last visit. It used to have amazing lattes and a great atmosphere. Unfortunately the service is poor and the place is not being kept up. \n\nMost people write bad reviews based on a service experience. I'll admit, the service experience is mediocre at best. However, that's not why I go to a coffee house. I go for an amazing latte. I don't know what changed but my favorite bean, Stumptown's, is getting ruined. They might a well be microwaving the milk and pouring shots in it. It's that bad. \n\nThe food prep counters have the workers personal effects on them. Gross. Food prep counters, not the worker's coat and laptop storage.\n\nIt's third time I've had my weekend Stumptown latte ruined and to me, it's worth the walk over the bridge to Columbe to get a better one.\n\nThe management has checked out and you'd be better served to check out something else.", "author": "Monica E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-07", "description": "I was in the area for Jury Duty and had a long lunch break so I headed here to get some much needed coffee and to get some work done on my laptop. \n\nWalking in, its a pretty cozy atmosphere with dim lots and various seating throughout the space. When I was there around noon on a Wednesday, it was pretty crowded but I managed to snag the only spot left which was at the bar. I thought the music was at a decent volume since I didn't pay much attention to it and can't remember what kind of music they were playing.\n\nI only ordered the cold brew and it was bad. It was extremely sour and I was disappointed since I was expecting good Stumptown coffee. Maybe I ordered the wrong thing, but just don't get the cold brew, or at least add milk and sugar if you do (which i didn't because I drink my coffee black).", "author": "Ivy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Phenomenal cappuccino, chill vibes, a relaxing place to work. \nSmells amazing with the food they cook. \n\nI could live here.", "author": "Alistair S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "This is my favorite coffee spot in the neighborhood. With its well-made coffee served in mismatched cups, nice selection of baked goods with gluten-free options, variety of draft beers and wines, and photo of Bernie Sanders actually at Vineapple perched against the Chardonney, it's as Brooklyn as Brooklyn can be.\n\nI spent more time here as a student; its great for a change of scenery when one gets stir crazy being locked up in a studio writing a thesis. I have fond memories of banging out a final paper while seated at the bar, hopped up on Stumptown cold brewed coffee. This is one of those coffee shops where you actually CAN do work because the other patrons are quietly doing the same. Far better environment than Bobst at NYU, in my opinion.\n\nAs a full-fledged adult, this is also a great spot to escape to while brokers show your aforementioned studio to potential renters. I will miss this spot dearly when I move out of the neighborhood.", "author": "Celine N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Lovely space, friendly staff. Love that they started donating their leftovers through their partnership with Rescuing Leftover Cuisine! Will definitely make this a regular spot.", "author": "Melinda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "Such a nice and cozy cafe in Brooklyn Heights. Ample space for working or just reading a book.", "author": "Playa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "If you have been looking for a coffee shop with couches, this is the spot for you.\n\nGreat vibe, good music and a nice collection of books.\n\nThey also serve wine if coffee is not hitting the spot.", "author": "Elias K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "Upon walking in I thought to myself, \"this place is nice, clean and quiet- it's perfect.\" I even started to question people\"s negative reviews. But it is clear now why they have terrible reviews. \n\nThey have a $8 minimum!??? That doesn't even make sense. People go to coffee shops mainly for a cup of coffee, why would anyone want to spend $8 every time, hardly anyone carries cash these days. It's ridiculous. When I told the cashier I didn't want anything else because I wasn't hungry and that I just wanted a cappuccino her co worker had the audacity to suggest that I put the rest as tip so that I would reach the minimum. (Excuse me) Not only was I feeling forced to spend $8 but now I was being forced to tip. I was going to tip them anyway but that's just rude. I wash I had asked for their name but it really doesn't matter because I will never return.\n\nAnyway, I ended up buying a cappuccino and a chocolate croissant which by the way tasted like the croissants that come in a plastic wrapper you find at a corner deli. Never again.", "author": "Annabel V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Cozy, hip coffee shop with nice coffee/tea selection and comfortable seating. Great atmosphere to relax and do work in.", "author": "Ava A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Went between two and three stars - delicious coffee, awesome gf macaroon, good space but maybe some of the grumpiest staff I've come across in awhile. With so many great spots in the area, hard to justify supporting a place where staff is so negative. Crummy vibes!", "author": "Laura F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "I am never going back to this place again. I have been looking for a cozy cafe in the area since Connecticut Muffin closed down. Walked into this place but....I should have read the reviews first. \n\nMy gosh the staff is horrendous. No warm or welcoming smiles. No attempts at even making friendly small talk. I ordered an OJ and the woman gives me a glass cup and hands me a... carton of OJ. Didn't even have the decency to put it in the cup for me. I sat for a few minutes to get the vibe, then I took my carton of OJ and walked out of the place. Never, ever going back to this place again.", "author": "Soraya B."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}