{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "Good coffee, decent wifi, and both comfy couches and long tables, so a good place to work. Music selection isn't great and the staff can be hit or miss. They serve alcohol too, but close pretty early, so definitely more of a place to hang out during the day than late at night.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Good coffee. Lovely space, and just the place to bring a book or work. Dread interacting with any of the baristas, and they make it clear the feeling is mutual.", "author": "Una H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "What a beautiful new addition to this beautiful part of Brooklyn Heights. Just steps off Henry St on Pineapple St. Today is Vineapple's grand opening!\n\nDelicious Stumptown Coffee, Harney \u0026 Sons Teas and fabulous sweet and savory pastries from Pickle Petunia! Full bar and food menu to come according to Vineapple's hospitable hostess. \n\nA seat for whatever mood you are in... Comfy couches in the back, big communal country tables in the middle, a long bright bar or a cozy front sitting area. What's my mood today? The bar!\n\nFREE WIFI... stay as long as you like, write your next screenplay here. Great for groups and get-togethers. Wow, this place rules! Great music playing on the PA. I don't think there's a better place for coffee in all of Brooklyn... Maybe all of Manhattan!\n\nCome and stay the day, relaxing, bright, airy... and can I tell you, the A/C feels refreshing especially in today's 98 degree heat wave!", "author": "Monica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "I write this review with trepidation. Why? Because Vineapple is a gem and when everyone finds a gem, it loses its value. Still though...it's too nice not to share.\n\nVineapple is a really inconspicuous place from the outside (see my photo). However, once you step in, a really large space opens up. There's an L-shaped set of benches with throw pillows right as you enter on your left. Bar stools on your right and further down along the counter. Continue further back and you'll see some picnic-style tables, and beyond that, comfy couches, a bookshelf full of books, and board games.\n\nThere are baked goods, coffee, wine and beer. The staff that I've encountered here have been friendly, even most recently when I walked in with a friend 15 minutes to closing. \n\nWhen I was here, I had a whoopie pie, and an iced mocha. They were both delicious. \n\nThere's free wifi, but I really couldn't tell you what kind of outlet setup there is. Sorry, laptop toters!\n\nThe main attraction of this place is really the atmosphere. It's quiet. When they have music playing, it doesn't distract, and it seems like it was designed to be a place where you could actually get some work done, and not just look like you're working.\n\nI look forward to repeat visits. If I had to knock one thing, it would be that they close at 6pm. If you're coming here after work, you won't have much time. Hopefully they extend the hours as the weather continues to get nicer.", "author": "DeShaun C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "Super pretentious and high credit card minimum which is ridiculous because they are already padding their costs so much", "author": "Emily S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "This place is really cute! I often find time to have coffee with my girlfriends here. The food selection is great and I really enjoy their lattes. \n\nThe ambiance is very sweet and had a very comfortable feel and there is  plenty of space to sit. \n\nSometimes service is a little suspect - I asked for my latte in a to-go cup, but got it in a stay cup and the time before that my friend's latte wasn't even made. She had to remind the young girl working that she had ordered it. \n\nI wouldn't recommend this place to you if you were in a hurry and needed your coffee fast on the go, but definitely go if you want a relaxing comfortable place for coffee.", "author": "Beverley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "coffee sippers and laptop lovers like me love Vineapple a cozy community café .\nBrooklyn Heights is far for me to come for my caffeine  fix,  but its option that is a subway ride away to the otherwise sleepy area.", "author": "Sandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "my favorite little Brooklyn heights coffee place. wonderful for working. the coffee is wonderful and they are very generous with the bathroom. there are often lots of students and they sometimes have cool events there. grab coffee here before going to the promenade!", "author": "Kelsey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "Great coffee. Cool atmosphere. Unfriendly baristas. This place would be infinitely better if the people working here would treat customers like people instead of inconveniences. You're getting PAID to make COFFEE, people! Life could be worse!", "author": "Carly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-12", "description": "I've been here a bunch of times and I keep coming back in the hopes that it will get better. But alas I am finally throwing in the towel. Bad customer service. Like bottom of the barrel bad. I wish this spot was more than it is. But it's not.", "author": "Tara S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "Lots of good seating, couches and table and bar space. Free wifi. Drink (decaf Americano) was fine, probably 3.5 of 5. I'm not sure that the space has A/C though. And staff seemed grumpy. I'll definitely go back if I need a study spot, but not my first choice.", "author": "Audrey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "When I used to live in BK Heights, that was my favorite place. I have really good memories of this place.", "author": "Thalie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "SUPER cute cafe to get some work done in ! On this small street called Pineapple Street (!!), built to look like a cozy living room. Choice of sitting in chairs \u0026 table or comfy couches. Fast wifi and lots of outlets. They do have a $8 minimum for credit card though which is a little inconvenient but not a huge problem. Ordered a macchiato for $3 which is pretty standard in the area.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "Nice atmosphere and brewing Stumptown is a plus but the staff- not so great. If you need a place to do some work or catch up with a friend, this is your spot, but as you order, be prepared for some impatient staff members.", "author": "Shveta D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Our first ever visit to Brooklyn and we found this little but very nice and relaxing place, great for a slow morning to chill with a coffee and some breakfast whilst reading the paper, checking emails or browsing the net. My fiancé and I had a whole wheat bagel with butter and jam and an almond croissant, both were very tasty.", "author": "Anna V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-16", "description": "Their blueberry muffins are best warmed a little in the microwave with better and the chai is good. But they always have new people and those new people are always learning so I usually don't go in and get someone who does the same thing. The turnover is so much that everyone is always learning", "author": "Mia Rose L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-12", "description": "Coffee tasted like the beans burnt while being roasted. The staff did not seem very knowledgeable and was not overly helpful although friendly. Atmosphere is ok and seemed acceptable to work.", "author": "Antoine T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-10", "description": "My first Vineapple experience was truly disappointing. \n\nI live just around the corner and have been meaning to try this coffee shop for awhile now. I went around 8am on a Tuesday morning, enticed by a sign out front offering Bloody Marys and Mimosas starting at 7am. I thought it odd, but fun, to have a mimosa on a random Tuesday when I was working from home. I walked in...the place was dead...only one other customer and two employees behind the counter. I placed my order, a mimosa and a chocolate chip muffin. Employee A rang me up but couldn't find the \"mimosa\" price on the cash register, so Employee B comes over and tells me that they don't serve alcohol before noon. How did Employee A not know this? I pointed out the sign and Employee B said that was from the weekend.  Note: the sign didn't say weekends only.  When I mentioned that it's Tuesday (thus, was the sign up all day Monday? or did the employees put the sign out with misinformation TWO days in a row?), they said they'd remove the sign. Forty minutes later when I left, the sign was still outside, unchanged. Sigh.  \n\nThen Employee B said they didn't have chocolate chip muffins, which means the sign on the muffin cabinet was also incorrect...and again, Employee A didn't know this when he rang me up? What?\n\nCan you say \"unprofessional? \"\n\nWhen I FINALLY got a blueberry muffin and some hot tea, and sat down in the back, I did find the space really cool.  Lots of comfy couches and chairs, and some long tables are in the loft-like space.  The lighting is a bit low, but the AC was very generous, and the music was very relaxing.  From other reviews, and from friends, I understand that you can chill at Vineapple all day, reading, writing, working. A few other people trickled in and out, and a large group came to one of the tables in the back to work together. \n\nI'm hoping Vineapple may be like one of those boyfriends you don't really like the first few times you meet...like, AT ALL. But after a few dates you realize they're \"the one.\"", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "Why does this place have only 3 stars? I LOVE them! The space is excellent, the barista was fantastic (and really informative too - apparently the owner's hubby is in the current Grateful Dead band, hence all the concerty pics on the wall!), and the dirty chai was perfect (not as good as Joe, but still pretty phenome). It seems that they also turn into a beer/wine bar at night as well, which I love when cafes do this to appeal to a wider audience!\n\nI just have to harp on the seating area once more - the space is HUGE. We sat int he front and it was bench-style seating, with the sunlight streaming in and not a lot of people were coming in and out so it was really cozy. The ambience is just awesome here, and if I didn't live so far away (aka in Harlem) I would come so much more often! Though it is off the 2/3 so maybe I'll just come by myself and read one cheerful afternoon :)", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "Hidden coffee bar in Brooklyn Heights. Great atmosphere with a combination of tables, couches and a bar area.  Cons include only one person staffing the place during a busy Saturday morning. Made for warm lattes and a bit cool toasted bagel. The biggest down for me was the minimum required for a credit card. Especially when my understanding is that it is illegal to require a minimum. Next time I will hav cash.", "author": "Ronni R."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}