{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-24", "description": "Pros: \n-Huge space. \n-Wifi. \n-Nice location near the Clark St. subway station\n\nCons: \n-Very inconsistent espresso drinks - sometimes my latte is great, other times it's sloppily made. Definitely does not match the quality of other Stumptown cafes.\n-Not enough food choices (just poorly displayed bagels and muffins most of the time). I've had to leave and seek out food elsewhere when I get hungry. With such a huge space I'd think they could have some other options...yogurt/granola, oatmeal, sandwiches, chips, fruit, etc... \n-Bad coffee bar (no variety of sugars, no self-serve milk canisters, sometimes no napkins, etc.)\n\nOverall, I'll keep coming back cause the space and wifi are good. But every time I go here I end up feeling like they're cutting corners to save money. If I'm going to pay 4 dollars or more for a drink, I like it to be a nice experience like you get at Cafe Pedlar, Iris Cafe, Bien Cuit, and others....", "author": "Anna N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "A beautiful cosy niche in the heart of Brooklyn Heights, offers a sanctuary like space with a nice selection of tea, pastries, wine \u0026 beer.", "author": "Pj S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-17", "description": "Ok, it's finally time to write a review.  I've been here many times.  I live around the corner and was so happy to see this renaissance-like coffee shop sprout up.  Just what we needed!  And Stumptown, known for their rigorous standards when it comes to who brews their magic beans!  So, i wanted to love this joint.  The atmosphere is cozy and appealing.  However.....\n-the espresso and espresso drinks are made indifferently, with no attention to detail.  Espresso has no crema, is watery, and dull.  Macchiatos are not made correctly.  This would not be any of my concern if they were not representing Stumptown.  Has Stumptown paid them a visit lately?  Maybe it's overdue.\n-some of the staff seem to think they should be doing something better.  Passion for coffee they do not have.  Some are sweet, some not, but it seems like a job they do not enjoy.  Maybe they could benefit from some time with the employees at Cafe Pedlar, Joe, Brooklyn Roasting Company, or Grumpy's.  Or maybe they are rendered uncomfortable by the...\n-owner, sitting perched in corners, glaring like a feral cat at customers and staff.  Ugh!\nPlease improve Vineapple.  We want to love you for years to come.", "author": "Joe P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "My wife and I really like Vineapple. It's a nice place to chill after a long week...or a place to get some work done away from home. Do not, however, spend $6 on a Naragansett beer (which tastes like it's worth fiddy cents).", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-22", "description": "I agree with so many of the poor reviews here.  My husband and I live around the corner and would love a cute place to hang but after our supposed happy hour last eve I said to my husband, I think I am about done with this place.  STEP IT UP!  Contact me and I'll give you some great ideas.  Don't see how Vineapple will survive if  Vineapple continues on their current path...........  Too bad", "author": "Pamela K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Vineapple serves as the area's best coffee shop.  I love it not only because of the little touches (like offering Almond Milk) and the great artwork, but because I come back time and time again for meetings and lunch dates. The exposed brick back room is super cozy, and there are plenty of plugs and free wifi for those who want to get some work done.  A definite bonus addition to Henry St!", "author": "k m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-06", "description": "I don't know enough about coffee to know exactly what they're doing wrong, but I do know that the Stumptown coffee they \"proudly brew\" is significantly grosser than ay other Stumptown coffee I've ever had. I don't know if it's over-brewed, or burned, or watered down, or what. I do know that it doesn't taste like it's supposed to. The general vibe in the coffee shop seems to be that the owner has no idea what she's doing. Once they were out of orange juice and tried to sell me the sample from the (unrefrigerated) display, and then stood around debating among themselves whether or not orange juice needs to be refrigerated. Seriously? \n\nThey are always out of something when I've gone in, and I've gone in many times -- I want this place to be awesome and laid back and a good place for me to get my morning coffee. I've tried. I give up.\n\nIf they're out of lids (they usually are), whoever is working the register will hand you a stack and ask you to set them out for the other patrons. If they're out of milk (all milk containers are generally empty), they'll do the same. Every time I've gone in, I've felt like I was in some way interrupting the owner from hanging out in her house and putting her out for asking for coffee.\n\nThey got a lot of press for having a wireless policy requiring you to buy x amount of drinks for an hour of wireless. This would be fine in general, but there is never ANYONE in the place. People overstaying their welcome in your space would be a good thing at this point -- the place would look less deserted and empty, and you'd build up a good atmosphere with your neighbors. Instead, I walk into a totally empty place and the first thing I see is a lecture about how you're going to kick me out if I don't buy enough. A restrictive policy like the one you have is for a place that's overcrowded and tables need to be turned over for waiting patrons.", "author": "Mitchell G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-22", "description": "Great coffee, awesome layout!! Love the board games and the free wi-fi! Always playing great music. Wish I lived closer.", "author": "Joe R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "This is a hidden gem in Brooklyn Heights.  My girlfriend recently spent a day in this cozy coffee shop studying for her certification exam.  The atmosphere was quiet with many people getting work done or studying (college kids from the nearby dorms).  My gf also had wonderful coffee throughout the day with a pastry and grilled cheese to help fill in the day.  She and I will definitely be returning.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-15", "description": "Finally a good coffee shop in the BK Heights/DUMBO area! Good coffee, friendly staff, lots of seating/tables and a welcoming vibe that will make you want to stay all day. They also serve wine and beer so I'll have to swing by after work one night to see how that is. If you're in the area and need a drink definitely check this place out.", "author": "Ryan H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-07", "description": "Great coffee and comfortable atmosphere. But microwave popcorn and pb\u0026j? Seriously?", "author": "S G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "I continue to come here but, SERIOUSLY, it has consistently the most vapid and insincere service anywhere.  Or actually, maybe it's entirely sincere.   Just saw a friendly woman come in, smile, and say \"hi\" to the owner who was shoving napkins into a box.  She didn't look up, said a mousy hi, sighed, and walked away.  I'm amazed how the staff here can be so consistently unpleasant.  Consistently...mostly everybody.  I love this place but if karma exists, I fear for its future!  it's not hard to speak with a friendly tone or try to a fake a minor, half-baked smile.  Like, even once.", "author": "s s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "I worked in DUMBO walking distance from vinapple last summer, and I just went back.  I can see where a lot of the negative reviews come from, but I also just attribute it to the growing pains of a new place.  I have been back three times in the past couple weeks, and they have noticeably stepped up their game.  The service is satisfactory, the space is amazing and the coffee is great.", "author": "Greg H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "I was surprised to see so much agro towards Vineapple. It's a great space: it's large, has couches, super chill vibe, plays good yet unobtrusive music, and nice architecture.  The coffee (I always get a cappuccino) is solid.  But I don't mind folks  whining on here -- more couch-space for me.", "author": "NY E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "On a scale of zero to awesome, Vineapple is out of this world.\n\nDelicious coffee, cold beer on tap, a wonderful \u0026 relaxing atmosphere, changing art on every wall, free internet, AWESOME apple turnovers, good tunes, simple snacks, cozy couches and Connect Four....what else do you need?\n\nNutella Hot Chocolate on the first cool Fall day makes me excited for the prospect of what's in store this winter and, I'm excited to have such a welcoming and versatile place around the corner to hunker down in and sip AMAZING cinnamon Tea as the days get shorter.   I caught one of their trivia nights which was super fun and will bring some friends next time...\n\nThis is a perfect spot to get a little work done, do a little reading, catch up with friends over a glass of wine after work or just grab a coffee on your way somewhere...though there are a lot of options as to where to chill out at Vineapple, I find myself in the back room on a couch most often.\n\nCongrats to the creator of this cool and unexpected spot and welcome to the neighborhood....we're so glad you're here!", "author": "Kristina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "Vineapple is a great place to read a book or to do some work on the laptop. The coffee is decent, but I think its biggest selling point is that it has a comtable, home-y vibe that makes it the perfect office away from home. The two communal tables in the back (and the couches) are generally pretty quiet. I'm a fan!", "author": "LittleBoat H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-14", "description": "Love this place! I won't repeat what the other reviewers said, but this is exactly what the neighborhhood needed! If they can complete the cafe with food as good as Iris Cafe then it would literally be perfect.", "author": "Becky G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "I don't understand why there are such negative reviews. I live in the neighborhood and I come to Vineapple every weekend for my SAT tutoring and the servers are great people. I've never experienced them as \"surly\" or \"rude\". In fact they are very welcoming, and often broach conversations with customers. \nSomeone said that they got a C in health inspection - That is false. I quite literally live right beside them and pass them every morning on my way to the city and all I've ever seen is an A, and trust me, I've got the eagle eye when it comes to health inspection grades. \nAs for the \"we have a rent to pay sign\"- it is completely reasonable. This is a small business run by a young woman, they offer you free WiFi and in exchange all they as you to do is buy ONE thing every two hours. Honestly, in my book that's not asking a lot at all.\nOne reviewer said they have no \"flavors\" or sugar, just Splenda - Maybe you didn't look hard enough but they offer honey and Sugar In The Raw (which I think was such a great move on their part). It's possible they didn't have it when you went, but jesus people, give them a second to gain their footing!\nI think Vineapple is wonderful, the space is amazing and when you go there, you really feel as if you're snuggling in at home.", "author": "Fatima H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "What a find! This place is wonderful. Big, spacious tables, charming yet not overbearing decor, friendly staff that don't give you a hard time about anything. Good music! Free wifi! Very comfortable space. What more could you possibly want? A freelancer's dream come true.", "author": "Norah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Awesome place. Great coffee, tea, local pastries, and wine and beer coming. The space is fantastic - really big in the back with big tables and couches, books and board games. A/C is great, as is the music.\n\nAwesome for groups, and a great vibe for both dates and friendly hanging.\n\nIf I lived nearby, I'd hang there all day (free wi-fi too)!", "author": "Jeffrey K."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Vineapple", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Pineapple St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2wsna3BnTrRp9nnyp0VnOA/ls.jpg", "@type": "Restaurant", "telephone": "+13477991701"}