{"aggregateRating": {"reviewCount": 7, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "My office moved a block from this deli a few months ago. Between my co-workers and I, we've probably ordered three dozen sandwiches/burgers/breakfasts from this place and they have all been fresh and tasty. \n\nThe place looks clean, the staff is friendly and the prices are good. Around six bucks for a good sized sandwich.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "I don't know who decided to call this a gourmet deli, nothing could be further from the truth, it's the corner store bodega and it has incredible sandwiches and addicting curly fries. Just make sure they make the fries fresh for you. They are crispy on the outside and pillowy on the inside and deliciously over salted, the perfect drunk food. Their sandwiches are protection from hangovers. I am super loyal to my corner store, but let's all call a spade a spade. This is not gourmet. This is a place you buy condoms and then return them because they were expired. It's where you go in your pajamas because it's close enough you probably won't run into anyone. It's your friendly local does-not-give-a-shit corner store. Thank god it's not actually gourmet.", "author": "William J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "This is a disgusting place. You can tell from the way the trash overflows the bin on the sidewalk in front of the store that they don't give a shit. I have occasionally broken down and bought a juice or bag of nuts there but I wouldn't dream of eating anything prepared by them. . I own a building nearby and the way they (don't) deal with their garbage has been a vexing issue for years. They do not ring up purchases and should be investigated on a number of levels.", "author": "Cara G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "These people take way too long to take care of people \u0026 every 5 mins they restock things it doesn't make any sense at all", "author": "Jason Anthony P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-06", "description": "If you. Like rats, running over your food this is the place for you.\nThey never give a reciept, because they never ring up a purchase.  I wonder why????", "author": "Sonja G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "I guess this place in under new management. This was a mess a few months back. Figured I'll stop in to give them another chance. Amazing customer service. Very clean and great food. Keep up the good work sonny. You'll be seeing me more often", "author": "Andy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-18", "description": "While the gentlemen who work here are incredibly nice, buy food here with caution!  About 50% of the time we have bought food here we took it home to find it was spoiled or damaged.  We have purchased spoiled milk, roten eggs, pasta with maggots (which we took back to have exchanged and the new box also had maggots), and severely freezer burned ice cream. \nAs this is the closest deli to our house it's hard to acknowledge how unsafe it is to buy here.  But at this point we realize they must be buying old food at discount prices to sell at a huge markup.  \n\nIf you don't want to get food poisoning, I strongly recommend you don't shop here!", "author": "Ruth D."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "State Street Gourmet Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "25 3rd Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/56bGI_I9nRWxo-bFXb3KOA/ls.jpg", "@type": "Restaurant", "telephone": "+17188550961"}