{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "This place is really cute and there are so many good options. Definitely the best place to eat in this area if you need something good and quick. The hot chicken sandwich is delicious. \n\nAlso, big shout out to Letty! She is so nice and her personality makes coming to Hill Country a treat!! You can tell she really cares about her staff and the customers.", "author": "Janna Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-18", "description": "I figured since Hill Country is a chain in NYC, this had to be decent despite the reviews.\n\nThe facilities are clean and this place in theory sounds great. However, the food just lacks flavor. I had a chicken sandwich, where could it go wrong? The bread was old from what I tasted. 2 out of 5 drink options were out. The chicken tasted bland and there was barely any mayo/sauce. I would have loved for this place to serve actually good food. Shake Shack across the street is a dump, but at least a busy dump bc the food is great there.", "author": "Michelle V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "I tried the BBQ and Fried Chicken tender. \n\nThe brisket (moist) was pretty good. I moved from TX last year to NY and was not expecting much, but this was surprisingly good. \n\nThe fried chicken tenders are OK. They are pretty cheap. \n\n\nThe coffee is definitely overpriced. But overall the price and portions are great, the service is nice, so I will definitely visit again.", "author": "Mira C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-03", "description": "HCFP is a good idea in theory, but the execution is a bit lacking. They basically gutted the original Hill Country and made it a food court. They kept some seating upstairs as well as the bar with the stage for live music (future Hank's?).\n\nThe food vendors are:\n-Austino's pizza\n-Bluebonnet (salads and veggie options)\n-HC BBQ\n-Nickie's tacos\n-HC Fried Chicken\n-South Congress (with City of Saints coffee, Du's Donuts, breakfast including King David Tacos, and Van Leeuwen ice cream)\n\nI tried Nickie's tacos and Austino's pizza. Nickie's was alright. They're just using BBQ meats, but the tacos are pretty big. They misspelled \"al\" pastor though. It's absolutely not as good as the food truck tacos in Austin, but it was good enough.\n\nAustino's pizza, however, was really disappointing. And dare I say, bad. I got the Skye sausage slice, and it was burnt to shit and barely edible. Not worth the calories or the $5+ price tag for the smaller slice.\n\nThe place also closes super early (8pm), but there wasn't much traffic, so maybe that's a smart decision on their part. It's super casual. The kind of place you roll into on a weekend afternoon wearing sweatpants because you live in the area. Definitely not a destination spot.\n\nAlso, the time I went, they had construction guys putting up the signs by the front and not letting people in the front door. They said to use the side door, but it was closed and literally didn't even have a handle. Maybe don't do construction on Saturday night?\n\nThey don't take cash. Credit or debit only!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Omg this food is amazing. On a cold, rainy night, this food hit the spot. I had the chicken and baked macaroni and cheese. Ir was amazing. For your comfort food craving, this is the place", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Have had their food before when it first open and they were partnered up with UberEats! Can i just say amazing! The fry chicken tastes as if it was your grandmother cooking. And the BBQ station the food taste like you're at cook out eating from the grill. I will definitely be going again this week for lunch! Do make sure that you have a card with you, it's a only card food court.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-27", "description": "In order to get my hubby to run errands, I need to bribe him--specifically, with food. Sometimes I bribe him with burgers, sometimes with brownies. It depends on what food options are in the area in question. On this particular day, I needed to buy eye glasses at Warby Parker in Brooklyn, so I promised my hubby we could have lunch at Hill Country's new food park. Of the half dozen options available, we opted for Austino's. We shared a slice of El Original and Ill Pastore. If the pizza had an ingredient breakdown, it would likely look like this: 40% flour, 40% oil, 10% sauce, 10% everything else. There was precious little brisket, mozzarella, green onion, and pickled jalapeno on the El Original slice; ditto for the pulled pork, bacon, and mozzarella on the Ill Pastore. If you need to placate a child (or husband), Austino's pizza will do the trick but it is not destination-worthy.\n\nOn another day, my hubby and I were in the area and I suggested we return to Hill Country Food Park and try the fried chicken. We shared the chickwich, clubwich, and one order of fries. Our food was so bad I actually apologized to my hubby. The chicken was dry and bland; the only decent part was the bun, and unless I'm mistaken Hill Country Chicken doesn't make the bread so they can't take credit for it. Only  children with limited palates (and their exhausted parents) will appreciate this sort of fare.", "author": "Marcela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "The Hill Country team just flipped their Brooklyn location into an entire food hall with all different concepts that they run themselves.\n\nThey still have the tried and true BBQ and Fried Chicken spots, but have some interesting new stuff like Austino's, a pizza stand, and Nickie's, a Tex Mex stall.\n\n\nIt's a nice and open, bright layout, which sounds simple, but is something a lot of food halls get wrong. The pizza is surprisingly good for a food hall, especially the Skye Pie with Kreuz Sausage. It's literally the first day so some pies are inconsistent, but the slice of this I tried was excellent.\n\nThey also have King David Tacos and Du's Donuts for breakfast, which are major wins, as well as Van Leeuwen Ice Cream for dessert. All of the stalls close at 8, so come for a great quick breakfast, a satisfying lunch, or an early dinner.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "Austin inspired food park rocks out in the former downtown Brooklyn hill country location. \nHomey seating and time to chow down\nGrub includes:\nAugustino's- Texas style pizza\nHill country bbq and chicken\nBlue Bonnets if arm to table\nNickies tamales\nSouth Congress coffee and donuts\nHanks- coming soon\nI tried the pizza and that is a flavor bomb! Skee ball upstairs- love it!", "author": "Franny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-29", "description": "Yet another food hall hits new York, just minutes away from the Dekalb Market Hall at City Point. The Hill Country Food Park is located in the old Hill Country space. What used to be one massive BBQ restaurant is now a selection of 6 or so stalls, ranging from salads to tacos to pizza.\n\nThe food hall has only been open a few days, so they may still be figuring out some growing pains. We stopped in for a weekday lunch and found the place relatively empty at first, though it quickly filled up soon. Most of the stalls (coffee, pizza, ice cream) had no lines, but the fried chicken and bbq stalls were both slammed.\n\nI went with The Hill Country Barbecue Market and ordered a platter of pulled pork, collard greens, and sweet potatoes. The platters are definitely the best value at this location, and the portion sizes were huge. But basically everything I tasted was flat. The pulled pork was super dry and chewy, while the accompanying BBQ sauce was way too sweet. I enjoyed the sweet potatoes and the collard greens (which were spicy), but the cornbread was dry as well and the accompanying butter had a taste that none of us could figure out. Other members of my party tried the brisket platter, brisket sandwich, and baked beans, but the overall consensus was just \"meh.\" The staff at least were friendly, and it only took a few minutes to receive my order after getting through that massive line.\n\nAnother random complaint: they have water cups at the soda fountain, but no water. I mean, I could just be one of those people who asks for a water cup and then fills their cup with soda, but I'm not a monster. \n\nI think I would come back to try some of the other stalls (the pizza looked interesting) and it's a decent option in the Downtown Brooklyn area, but otherwise I wouldn't come out of my way to come here just yet!", "author": "Marina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-18", "description": "I came here on Wednesday afternoon and there were about 4 other people on line.. so not too crowded during lunch time. I decided to try a healthier option (1/2lb lean brisket) and one corn bread. It was hard not to order the ribs. Both the brisket and corn bread were so good and tasted like smokey bbq.. total was $15. I would definitely like to try other options on the menu.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "I love this place! What a hidden gem in downtown Brooklyn. I've literally walked beside this place hundreds of times, but it wasn't I started trying Mealpal that I first gave this place a try. Now I literally come here everyday for lunch. The food is so underrated - both of the chicken and BBQ place have both amazing service and food. The fried chicken is so moist and out of this world. Also love the chicken sandwich and pulled pork sandwich, as well as the salads. The service is always surprisingly friendly, given how service at fast food places usually go. Highly worth a try if your in the neighorhood!", "author": "Ning M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-03", "description": "Been to South Congress for coffee, donuts and the tacos. Coffee was ok. Donuts were from Du's Donuts, they were good. Tacos was small for the price. I used to love Hill Country Chicken, but unfortunately it didn't cut it for me since they reopened. I ordered the chicken and waffles. The chicken tenders was so dry. The waffles were soft and just ok, nothing special. I regretted spending $8.50 on a lunch that I barely ate.", "author": "Mimee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-06", "description": "Hill Country Chicken is back! I was pissed when the original next door closed, so when I heard the long awaited food hall reopened, I was excited. Along with Hill Country Chicken and Hill Country BBQ, there is tex-mex, pizza, salad and a dessert-y type place.\n\nThat chickwich hit the spot.", "author": "Heather C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-31", "description": "Admittedly, I was a fan of the previous setup, prior to them shutting down and renovating - it was spacious, great food, and a cool vibe both upstairs and downstairs. They've now changed it up to resemble the food truck parks of Austin, TX... they still have Hill Country BBQ, but now offer a bunch of other options (sandwiches, coffee, donuts, pizza, tacos). The space is a little tighter than before, but pretty cool what they've done with the place. I'm a fan, I'll be back.", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "Wanted to like this place, but dayum.. Hands down worst taco I've ever had - ingredients were all cold \u0026 wet atop a single tortilla ripping at the seams. I think someone else also mentioned they spelled \"al pastor\" wrong on the menu... like c'mon?! Get it together.\n\nThe fried chicken sandwich would've fit better in a middle school cafeteria - about the right size too. I feel genuinely sad after eating here. I have to believe the bbq is better, but will probably never find out because there's a 0% chance I'm coming back. lol \n\nSuch a waste of a gorgeous space. \n\n2 stars for ambiance \u0026 the friendly staff.", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-30", "description": "Let me start off with I didn't not come in with an open mind - right from learning about this place it seemed like a parody. Coincidently after reading about it the night before, I was looking for lunch and this place was directly behind me. It felt like fate and after a little pressure from my Austinite friend, I had to try it. The parody aspect didn't disappoint from the names \"Bluebonnets\", \"South Congress\" (aprons that say SoCo - eyeroll) etc. There is a way to honor a place and not make a mockery of it. Rockabilly and Lonestar really? \n\nNow on to the food. I went in thinking I'd go for the breakfast tacos since as a former Texas resident it's high up on the foods I miss list. They sell them out of the coffee place and it turns out they are King David's and not made fresh but sit around in a warmer. Glad they turned out to be out.\n\nI turned my sights on the regular tacos. I got an AL Pastor (menu says EL pastor - palm to face!) and a brisket taco. The corn tortilla was too thick and also totally cold which makes for a really terrible experience to start. The fillings were also mildly cold. Not one thing redeeming about these tacos. If I had to rank them brisket above AL Pastor since the AL pastor was super sweet and saucy. I debated going back and asking for my money but I didn't (cause I don't do that) and instead ate my crappy tacos because I was the only one to blame for trying out this place since I should have known better. \n\nCoffee bar though - awesome people and great chai. Credit where it's due.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-28", "description": "In a city saturated with food halls, this one doesn't stand out. Sure they have tacos, pizza, brisket and ice cream, but the concept didn't really hit home for me. I'm from Memphis and can't speak to the authenticity of the Texas cuisine, but I can speak to the two Nickie's tacos I had - one brisket and one smoked chicken. They were out of pork and tamales. For $3.50 and $3.75 respectively, you do get a lot of meat on the tacos. Both were topped with a green sauce, pickled red onions, cilantro and cotija cheese, but the flavors just weren't there for me. I wanted more of the above said. I still may come back to try the breakfast tacos at the South Congress stall and the upstairs Hank's Saloon bar, but overall I was underwhelmed. I liked the food and space much better when it was just Hill Country.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-14", "description": "I like how they changed the format of the restaurant but kept the BBQ. I liked how there are different options for lunch and even breakfast. I cam in just a few days shy of when Hanks was to reopen upstairs. I'll be back again soon.", "author": "Sandra B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-15", "description": "Being a Saint Francis College Alumni and since i work in the area, i come here a lot i have tried all of the food. I love the Salad stall by far my favorite, a couple of workers in there are great, I believe Dorsay is her name she's awesome and i believe Rose may be the other worker both of them is Hill Countries best worker.\nEverone else in there stalls are too loud and talk very inappropriate, I think Managers should be Monitoring that, and sometime I monitor Managers talking the same way, this is not Hill Country I know i guess this is what they closed that for. BlueBonnet is where u should go, they got the best turkey sandwich which is better then Barbecue station and more for your money.", "author": "Timmothy M."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Hill Country Food Park", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/leusiwMUxeYu2_F-aAGVeQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188854608"}