{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-31", "description": "This is for the South Congress coffee \u0026 donut. If I could give it 0 stars I would. Horrible service and rude remark from the person who works there taking my order. Went there yesterday around 1pm and order two donuts. I asked her to give me a different donut, because the one she gave me was deformed and missing chocolate at one side. Instead of giving me what I want, she made a rude comment saying they are all the same and short temper. As a paid customer why don't you give me what I want and why would you even display or give a customer a smash or ugly looking donut? Imagine me giving that donut to someone and it would be embarrassing as hell. Looks like she needs training in her attitude and better customer service. On top of that, the donuts wasn't all that great to endure abuse from this place. Taste like diner quality pastry. Never going back.", "author": "min c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-13", "description": "Decent atmosphere but the food is terrible. The tacos at Nickie's have a strong taste of fresh plastic and the nachos taste as if someone spilled a beer in them. Overpriced and extremely lacking in quality.", "author": "Raymond M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Recently had lunch there, it was great! Enjoyed tender brisket \u0026 sweet potatoes with collards and corn bread. The staff was very friendly, even offered me a fountain drink on the house - so sweet. I also ended with a latte from the coffee stall by the entrance, along with a donut to take home. Will definitely be back. :)", "author": "Sara R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "Poor example of food from Austin. The tacos were cold and the queso was lumpy and sour. The best thing were the donuts, which are from Brooklyn.", "author": "Lindsay A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "Hill Country remodeled their Brooklyn location in to a beautiful multi-outlet food hall!  The barbecue is outstanding, following the standards set forth by their Chelsea location, and their other offerings include burgers, tacos, pizza, and a plethora of others. Their fried chicken restaurant is featured as well, keeping my desire for tenders well tended. Outstanding decor, and I can't wait for Hank's Saloon to open upstairs!", "author": "Chris S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "I had many dinners at Hill Country BBQ before, I was very excited to visit Hill Country Food park when they opened. As usually, Hill country never disappoint their customers, my friends and I had great time, the food delicious and we had the best customer service. Felt like home!!! Loved it :)", "author": "Zhima Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-22", "description": "Yesterday evening I was at Hill Country chicken, and had a very unpleasant service by an employee. Light skin, slim I would say with glasses. She was being very disrespectful, and rude, and yelling at me. As I am reading some of the reviews also, I thought I would have experienced something different. But she was staring me down, I guess she was trying to intimidate me, I was scared after she yelled at me. I told the Manager, a guy  he was, and he was very nonchalant about the situation. Wouldn't ever try this at all.", "author": "Susan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "Hill Country's booth serves a wonderful turkey platter with two sides and cornbread.  The turkey was moist and so tender.  It's a bit stressful ordering by a computer.  Most first-time patrons got messed up, so ordering took time.  It's impersonal.  Nice atmosphere for a quick lunch in downtown Brooklyn.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "I frequent Hill Country frequently, and I am very excited for this new concept. A food hall with Pizza, donuts, fried chicken, sandwiches, tacos and their signature BBQ. They hit it right on the head - It's a fat boys happy place! Great space, hospitality, and food! Aside from their already well executed BBQ and Fried chicken, there are many more \"stalls\" to choose from. SoCo, their sweets and coffee stall is my favorite, double espresso and passion fruit donuts - no wrong doing there. 'Veg out' pizza from Austino's is great, made with zucchini, ricotta, lemon zest and arugula. Nickie's, their Tex-Mex stall has tamales and margaritas, my favorite! I had the vegetable 'rajas' daily special with cheese \u0026 spicy peppers - it was the bomb! As you can see, I've made my rounds. If you are in the downtown Brooklyn area, definitely worth a trip - you will not be disappointed. P.S, don't forget skee-ball on the second floor!", "author": "David V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-28", "description": "Compared to the prior location, the space itself has been cut in half. Nonetheless, it's still a nice open cafeteria style ambiance. The food however was a major disappointment. The Hill Country Barbecue Market menu has been modified and the quality of meat is not the same as before. In addition to running out of brisket, it was extremely dry. The chicken from Hill Country Chicken had mediocre flavoring. Probably had better chicken from KFC...Compared to the Hill Country franchise...NOTHING TASTES THE SAME. They still haven't gotten their liquor license so they sell two/three variations of beer. A bit disappointed and underwhelmed over the re-opening and new concept especially since they have been renovating for almost a year. The staff however was extremely friendly which is why I added an extra star.", "author": "Juma B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "I had to be in Downtown Brooklyn for a meeting the other day and saw a great new spot. I was first thinking about going to shake shack and when I approached I saw a new spot had opened so went in to try it out. Long story short I made my way through 4 of the 6 stalls they have in this spacious dinning space that they are calling a food park. What a great concept and the food was delish. Staff very friendly and the space is fun with great vibes and music. A manager told me that hanks an old time favorite watering hole of mine will opening next month upstairs. Wait a minute I thought to myself. I can go to hanks, eat great food and play ski ball... Win!!!!!!! Cant wait to go back and try some more tasty offerings.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "Overall, I think this is a great addition to the neighborhood. I think there are still some things to figure out, it was a little slow moving. I haven't had everything yet, only the el original slice and the ribs but both were amazing and the staff was very nice. Can't wait to go back.", "author": "Brian S."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Hill Country Food Park", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/leusiwMUxeYu2_F-aAGVeQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188854608"}