{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-07", "description": "Not super big but sure to be a more successful use of the space than the BBQ alone was.  Half a dozen choices ranging from pastries and coffee to sandwiches and tacos. Probably a busy weekday lunch crowd with the nearby law school and court buildings.  Hanks Saloon ( formerly on Atlantic ) is set to open on the upper floor!!", "author": "Laura P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-29", "description": "It's a cool concept of what they decided to do with the entire place after closing down both their BBQ and Chicken spot to make it into a food court where now you can have not only the BBQ, Chicken, but also breakfast, tacos, dessert, and coffee as well. With that comes with a price I guess as the menus of what they have previously offered before for Chicken and BBQ has now shrank drastically. I'm for trying new things, but I'd like to be able to go back to certain items I once have enjoyed coming here for. I'm a little disappointed in that part.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-11", "description": "If you are looking for nachos, do not go here. Cheese is not real. \nIf you are looking for good pizza, the pizza they have here is pretty good. Cheese is real.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-06", "description": "I feel really bad giving this place one star.  Can I give a half star?  If I can I will. Not because it doesn't deserve one star or a half star. - it does. But because when everyone realizes how bad the food is here all of the nice people who work here will be out of a job. \n\nWe've been here twice. Once for the Austino pizza and once for the chicken. \n\nThe pizza was 50% dough 40% oil and 10% the rest. And the rest, supposedly beef eat. al. , was.just awful. \n\nThe chicken sandwich at HC Chicken was just plain hideous. Dried out tasteless chicken on a dry bun with four pickles. \n\nWhen I lifted the bun to add hot sauce, (I don't normally add hot sauce but I figured I'd try anything to spice this thing up. ) it was an ugly sight. \n\nCardboard I said to my wife. What she replied?  I took another bite of my chicken sandwich. This must be what cardboard tastes like. Like filler. Like filler for my stomach. Tasteless chewy filler. \n\nUGH. \n\nForty five minutes since we ate and that chicken sandwich is sitting undigested in my stomach. Well is January I guess I can burn the cardboard chicken to keep warm. \n\nWe won't be back.", "author": "Elliot P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-27", "description": "Namesake BBQ is very promising but not as good as it looks. The large portion of brisket on the platter was blackened on the outside, with a nice smoke ring, and was moist and extremely tender. But other than a hint of smoke, it was noticeably under-seasoned, at least compared with Mighty Quinn's. Served cold too. Sauce was of the sweet variety but not as interesting as Baby Ray's, for one. Sweet potato mash was indeed sweet but with no bells and whistles like candied pecans was pretty plain. It was also stringy -- these days I'm preferring the white Japanese yam for smoother consistency. Beans were tasteless, needing some sort of bacon in addition to the ample burnt ends. Corn muffin was dry and crumbly. Not cheap (no cash, until they pass a law), but justified more by quantity than flavor.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "It's been a long time since I've written a review...but I'm compelled. I've worked in the neighborhood for almost a year, waiting impatiently the whole time for Hill Country to reopen (I've been a Chelsea die-hard for a decade while working near that location). The last 3 work lunches I've had have been BBQ (brisket) chicken, chicken (sandwich 2x). Not saying it was worth the wait, cause that part sucked...just saying happy it's back!\n\nNow let's get that bar open!", "author": "Jeremy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-30", "description": "In a word, the new food park is disappointing.  The HC Chicken stall doesn't sell their signature Mama El's chicken and their once delish mash potatoes are runny and just blah.  Not even the biscuit is good anymore.  The BBQ stand doesn't seem that much better either.  Also, the park doesn't offer many options for vegans. My friend was able to find a taco he could eat. The vibe is also pretty dull. I can't imagine this place will stay open that long.", "author": "Summer R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-28", "description": "Ugh- had lunch today at the taco stand. The Al Pastor taco was fine but the brisket one (El Rey) was terrible. The meat was burnt and tough to chew. It was like eating mulch. The nachos were also a disappointment- as much as I like a good queso sauce, there was nothing that great about the nachos and we even paid extra for fresh salsa and guacamole. Perhaps the other stalls are better but the taco place is a definite pass.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-16", "description": "I've been back 2days ago and I'm honestly upset. I've tried to try the BBQ but was wayyyyy overcharged so I couldn't even get to eat......\nThis RUDE Manager Act As If I Was In The Wrong , I forgot his name something with a D though. All I know is that within 7days I had better gotten my refund or I will be involving the police.\nThis One Star Isn't Accurate", "author": "Channelle B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-03", "description": "A shadow of what was once there. I'm glad that The chicken place survived in some form. I've tried to give the food park a chance, visiting on 3 occasions. 2 times they were out of what I wanted (the chicken place was out of chicken and the bbq place didn't have brisket). Even though the concept was to add more options, the choices seem limited. The pizza place is always closed in the evening so I haven't had a chance to try it. The bbq and chicken places have smaller menus. The space feels empty and unfriendly, and the workers at the stations don't help that. The old concept worked better, and I hope they keep that going at the Manhattan location. I hope the owners fix their errors, because they do know how to run a good restaurant, but this concept is a huge misfire.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-13", "description": "Ordered from Nickies and the Chicken stand next to it, and the food was highly priced and not great. Couldnt tell the different between el pastor and chicken tacos. Nachos had cheese which tasted like beer, and wasn't appealing at all if you got a a lot on a nacho. Ended up throwing about 3/4 out after my boyfriend and I couldn't stomach the rest. The Chicken stand next to them gave us noticeably microwaved \"hotwich\", although this was tasty. Total from \"Chicken\" was 16$ for one sandwich and 2 sweet teas. I was really excited to see this place because I love food cafeterias/parks but I definitely wouldn't come back!", "author": "Korinne K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-12", "description": "Went last weekend.  Hoping it's still fining it's footing. Chicken was dry and definitely not fried on premises.  Feels like they are sorta forcing a concept to deal with a lease they can't get out of.", "author": "Bob H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "Who doesn't love the Austin Food Truck Scene concept condensed into one awesome space? BBQ on Pizza?! Yes, please. Texas-sized slices? I'm in! Donuts, tacos, fried chicken, salads,  the classic Hill Country Barbecue and even more- how can you not indulge a little? I've been a big fan of Hill Country's fried chicken for about 6 years now and so thankful it is available now to downtown Brooklyn! The Chick-Wich (or Spicy-Witch!) Puts the 'Chic-fil-A Chik'N Sandwich' down rather politely- it's a whole 'nother level of yum! (As a Southerner I feel ok saying this!) The bar upstairs is supposed to be opening very soon. Can't wait to hear who else is going to join this place as part of the new food park! I'll be back often! What will be next?", "author": "Carrie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-06", "description": "I ordered pizza; wife ordered a sandwich. The individuals behind the counter were unhappy. They started fighting. The manager pulled one of them away to talk in the back. I eventually got my pizza (it was fine, but not worth coming back for in NYC). My wife's sandwich got left in the toaster and burned while the only sandwich attendant was in the back with the manager. We asked for our money back. We won't be back :(", "author": "JD M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "Great place!!!! Try the brisket! And when you're thirsty after, Maria makes the best coffee and is super friendly", "author": "Luke F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "Please excuse my language, but the \"Hill of Nachos\" with brisket at Nickie's are the best GD nachos I've ever had in my life. Run. Don't walk.", "author": "Eboni T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-01", "description": "Being such a big fan of hill country chicken prior to the closing of the previous Brooklyn location, and being a fan of the one in the city, this new hill country chicken has no lived up to my expectations. The chicken sandwich bread was toasted to long and it was like a rock, the bbq sauce has changed as well, and the chicken tenders where super dry. The fries were seasoned like honey bbq chips which was strange in my opinion. The Mac and cheese was good but not the same. Overall disappointed. The location and atmosphere is very nice.", "author": "Evan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-19", "description": "Hey everyone visiting hill country today time now is 2:12 i was looking for a manager and i could not find one employees did not know where any managers were, there were no chefs to be found also. This is ridiculous, management is bad, the chicken was undercook and rubber", "author": "Carine T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-01", "description": "Great new, upscale, food court in Brooklyn new the courts and metro tech. Well known Hill Country Barbecue and Chicken take the lead but there is so much more for everyone including breakfast and salads and pizza and tacos. Wow!  We could eat here every day for lunch and have something different.  Try and enjoy!!!", "author": "Steven M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "Really cool concept with all the different \"restaurants\" from Texas under one roof! Try the pizza!!", "author": "Rick S."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Hill Country Food Park", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/leusiwMUxeYu2_F-aAGVeQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188854608"}