{"aggregateRating": {"reviewCount": 4, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Whatever you're hungry for late at night, these guys will take care of you.\n\nIf Omar is there, get the pastrami special.  I can't stop thinking about it for days.", "author": "Rahat A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Went in today for a honey Turkey hero with lettuce, tomatoes, onions and \"all at\" Dude was fr appreciating his work. While I waited, I heard him say it was looking fire. I asked if he blessed me on the hero, then he said you asked for \"all at\" and that's what you getting. Let me tell you, it was, and a bag of chips (bbq). To anybody stopping by, Raider will hook you up.", "author": "Terhon L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-12", "description": "At least they gave me good portions. But when I got to the counter to pay, I was shocked. What I thought was a $5.50 for big Ham meat on my hero, I was shocked to find it was $7. I saw on fine prints in the board that they charged extra for condiments. That is utterly disgusting and deceptive. \n\nThe sandwich bread length is not big, and definitely not a footlong. It is a small hero. The meat size is okay, but does not warrant $5. The lady said the meat was $5. Extra condiments like lettuce and tomato was $1. And pickles and spinach were $1 each. Don't fall for these scams. Just walk out of these stores and go to a subways or a burger king.", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "The only thing I ever buy late at night is ice cream. \n\nWait, that isn't even remotely true, unless we're not counting alcohol, pizza, cab rides, moustache rides, ninja swords, tacos, drugs* and \"company.\"\n\nWhat I meant to say is that the only thing I ever buy AT BODEGAS late at night is ice cream. (And beer, I suppose.) And Downtown Gourmet Deli is extremely close to the place where my head rests, and has never once failed me in my search for ice cream goodness. They have an excellent selection of Ben \u0026 Jerry's, including the extremely fitting Late Night Snack. \n\nWhich is THE BEST ICE CREAM FLAVOR EVER. \n\nI used to be an Americone Dream guy, but for some reason, Stephen Colbert no longer loves me, and the bits of crispy chocolate-covered cone are no longer crispy. \n\nLate Night Snack is Jimmy Fallon's** new flavor: vanilla bean ice cream with a salty caramel swirl and fudge covered potato chip clusters. Believe me when I say the latter are deliciously crispy and provide me with the wonderful salty/sweet combo that makes life worth living.\n\nDowntown Gourmet Deli also has beer and other things, if for some strange reason your every need is not satisfied by the Late Night Snack.\n___________\n\n*Strictly of the legal variety, of course.\n**Apparently I only like ice cream endorsed by men with talk shows.", "author": "Peter D."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Downtown Gourmet Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "68 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Tw1L2-qsKKv-asgSL-FqiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188551523"}