{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "Luzzo's has become my go to pizza spot in BK Heights! The menu selection has grown and the pizza has gotten more delicious since they opened. Now, foccacia bread sticks are served before the meal as well. \n\nThe non-pizza items are also solid. I've tried the arancini - good size, moist, fresh cheese - and desserts like the zeppole - fried and not too oily. For pizza, still love the classic Luzzo's BK. The fresh ricotta is such a nice touch with the combination of the prosciutto and truffle pate. The spicy oil is my new obsession. \n\nService is fast, friendly, and fun.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "Amazing, amazing!\n\nSat window-side on a gorgeous evening with all the doors open. Beautiful ambiance. Prompt service, our dishes were delivered to the table just slightly quicker than timely. Wonderful presentation. \n\nEnjoyed the porcini ravioli; I must say this dish is a steal. Black truffles in a decadent cream sauce with homemade porcini ravs. Perfectly cooked pasta; a little al dente.. had a nice bite to it... flavorful... and the filling was on point. You'd expect to pay at least $32 for this dish anywhere else, but it's a steal at $20. \n\nDiavolo pizza was an authentic take on a classic but with a delicious twist. The soppresata it came with as a topping was paired to a T. I'd expect nothing less in Brooklyn. \n\nPS I almost took an order of porcini ravioli to go. Yeah, it was that good.", "author": "Mellisa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-06-01", "description": "Very reliable, great pizza!\n\nI like the garlic pizza also the sausage. Back porch is nice! Great to dine in or takeout.", "author": "William H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "See photo of the Nutella pizza. \n\nGranted, this was delivery - I probably should know better than to order a nutella pizza delivered... but then again, maybe so should Luzzo's. It took over an hour to arrive. Why would you let this leave your front door? Disgusting.\n\nI'm sure eating in is much better (I sure hope so).", "author": "Ben C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "Make love, eat pizza! My favourite motto of all time. And that's what Luzzos stands for. \n\nPizza to die for, pasta to die for, food to die for, dessert to die for. Should I go on?\n\nI love the cozy, European vibe going on when you step foot into Luzzos. The authenticity is beholden by the awesome staff greeting you in heavy Italian accents. It makes you want to do a jiggle and dance. \n\nWe were seated immediately (we did not have reservations and they were pretty full). Menus and water were brought to the table right away and of course the menu was in Italian ha. Our waiter was very helpful in us deciding what to order. We got the Eggplant Parm, Rigatoni Ragu, and Tartuffo off the dinner menu. (We also came here for brunch and it was nothing short of delicious).\n\nEverything we ordered was delightful, tasty and fresh. We polished our plates before anyone could say boo. The drinks were pretty good too. I got wine and my husband got a couple cocktails that were super delicious. \n\nThe bill was quite decent and worth every penny. I will totally be back for more of that divine pizza. Parking was also a breeze (super helpful).", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "The pizza were amazing, Same thing as what you get in Italy for real! We went there on a Friday night without a reservation and we only had to\nWait 25 minutes to get seated. In addition, they offered us two glasses of Champagne while we were waiting for our table. The service was amazing from start to finish!\nWe took one pizza (the large size) that we share for the both of us and for the dessert we tried the Nutella Pizza which was amazing. However, A little pricey at $18 just for the Nutella pizza. I had nutella pizza in the past and the price was around $8-12 maximum.\n\nI highly recommend this place to anyone.", "author": "Alexandre G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Made a day of res on opentable and the restaurant \"wasn't notified\" but after showing my confimation, we were seated immediately. \n\nThe service was quick and the food was delish!  Complimentary bread is soft and delish dipped in EVOO. Started with the calamari which was perfectly warm, crispy, and the perfect portion to save room for pizza!  The farro salad is also perfect portions of farro, halved baby tomatoes, arugula, and bits of asparagus. \n\nI have to talk about the pizza crust: I never eat it all bc it wastes space for the crust with toppings but this one, crispy on the outside and chewy on the inside.  I ate the whole slice of each slice!  We got the tartufata which had red sauce, mozzarella and truffle pate - hubby loved it. I liked the quattro formaggio with Gorgonzola as one of the cheeses!  Love the spicy oil they have.", "author": "Thy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-16", "description": "What a lovely meal we had here the other night. Delicious salad, pizza, wine, excellent music and vibe. Our server was super cool and polite, the  service all around excellent. We dig the neighborhood vibe and good food, will certainly return in the future!", "author": "Julia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Best pizza best service best restaurant Love luzzos bk youll never be disappointed get the carciofi alla romana or the polpo to start! Pizzas and pastas are all amazing and plenty of vegan and gluten free options. Great place!", "author": "Grace D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "I've been meaning to check this place out for the longest time and boy, it did not disappoint.\n\nThe spot is a little small and it gets packed quickly, so if you've got a large party, I'd suggest making a reservation beforehand. It's super dimly lit, so if you were anticipating being able to take lots of pretty pictures without heavily filtering, you're out of luck - that or you need to trust that the hot wax from the candle you're gonna have to hold up to all your food doesn't drip onto your delicious, delicious meal.\n\nTheir cocktails are a bit pricey off the happy hour ($13) but they do have a wide selection of drinks.\n\nMy friends and I shared the arancini, these decadent and flavorful cheesy rice balls, which were the perfect appetizer. Then the three of us split two 16\" pizzas - and we had plenty to take home, so go hard AND go home, y'all. I highly recommend the sausage and broccoli rabe pizza. The speck pizza was good but not unbelievable.\n\nService was a little on the slow side in terms of taking orders but the food came out pretty quickly and piping hot. Looking forward to coming back!", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Such good Neapolitan style pizza! The Aglietta pizza with roasted garlic was seriously AMAZING - some of the best pizza I've ever had. Bonus points for the warm and casual atmosphere. I could tell the staff enjoyed working there which is always a good sign. Overall a great spot in Brooklyn for anytime! We went before hitting a movie at UA Court Street around the corner and it really hit the spot on all counts", "author": "Jacqui J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Best Napolitano pizza hands down in the New York metro area. Please, I beg you, start delivering to FiDi so we don't have to take a subway to get your pizza gold. \n\nWe travel from FiDi to Luzzo's at least once a month because it is that fucking good. We usually end up taking a cab back which in total ends up around $20 bucks. That should tell you how amazing this pizza is. Again we beg you start to increase your delivery radius to include FiDi I promise people would pay $5 extra for that feature! I know I sure would.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "This is my favorite spot so far in NY. Food and ambient are great and every body is nice and helpful. Their pizza is amazing, thin, crispy in the bottom and soft on top, premium mozzarella, fresh tomato sauce, all the ingredients taste fresh and premium.  The pasta is also good but not crazy about it. The risotto balls are sooo tasty, my boyfriend gets the octopus every time as well and love it. Don't leave that place without trying the Nutella pastries OMG thats to die for. My very favorite dessert in the world, crispy and warm filled with Nutella....", "author": "Giselle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "Friendly service, fast and enjoyable. Overall, a nice experience in a calm, cozy atmosphere.\n\nExceptionally tasty pizza but without the hassle of long lines, ridiculously late and rushed meals, or any of the typical nonsense other popular Brooklyn pizza places intentionally create to keep they hype machine working in their favor.\n\nPrices (I guess) are slightly on the higher side... but they accept credit cards unlike other (even more expensive) overhyped neighborhood restaurants; Another plus for Luzzo's. Glad to have this place nearby.\n\nIf you're looking for some good pizza without the nonsense, in a nice cozy place, try this place out. They're legit \"Brooklyn pizza\", so take note you wacky tourists, you don't have to deal with the other bs to claim bragging over your friends about having some of the best pizza in Brooklyn.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Came here three different times and have not been disappointed. The pizza is just right! I can't resist the Tartufata. They have a cute little backyard in the back if you wish to dine outside. The staff is very nice and friendly. They just opened up another location in Park Slope LBK but the menus are slightly different. Either way both places are a great choice for a pizza outdoor summer dinner!", "author": "Tai M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-07", "description": "The pies here are ok at best when in the neighborhood but not worth a special trip here.  However the spicy olive oil that's available that is the difference maker.  A few drizzles of it over any of the pies elevates the flavor and makes them much better.", "author": "Ben D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "The pizza is very good, pricey, but good. But a word to the wise:\nUsing the Slice app meant making numerous phone calls to Slice and Luzzo's before finally getting a warmish pizza, ninety minutes later. I deleted the app and it'll be a long time before the memory of the taste of the pizza overrides the memory of waiting for an hour and a half to get the pizza and order another, using a different app.", "author": "nick h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "I've had pizza from the best in the city and in Tuscany, and this place has FANTASTIC pies. Also the main man there is this charming man from Naples. Try anything from there, you'll come away satisfied.\nThe only thing they're missing is Moretti Rossa", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "Three stars for the amazing ambience and wonderful/friendly staff/service at Luzzo's!!! However, only three stars because the food did not blow us away and no happy hour!\n\nIt may be that we ordered the wrong things, but the entire meal was just subpar. We started off with the indivia salad which was drenched in this salty lemon dressing. It was SO salty and tangy. I could see how some would enjoy that taste but it wasn't in any of our favors. We ordered the garlic Margherita pizza and spaghetti pomodero for our entrees. The pizza is a classic thin crust and there was not enough garlic on our pizza in our opinion. The spaghetti looked like something served at a school cafeteria, but the taste was definitely a few grades better. \n\nNonetheless, we devoured our food because we were so starving but probably won't be back. Thank you to our wonderful server, she was so friendly and attentive. She gave us limoncello after our meal and it was our favorite part!", "author": "Izzy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-22", "description": "A solid 3 1/2 \nCute little italian place on Atlantic Ave. Great pizza and full bar. Service was great. We had the margarita pizza and the salciccia, both really good in taste and freshly made. My only complaint is they were both burnt at the bottom and not a little, one side was completely black. We also had a salad (forgot the name). It was arugula with baby tomatoes top with parmesan. It was delicious but a bit too oily. \nDrinks: margarita on the rocks with salt. Too much ice, was drink was good with enough salt. \nDessert: chocolate truffle. It was delicious and i don't really like chocolate. It was vanilla ice cream inside chocolate ice cream covered in peanuts and chocolate powder. Very unique!\nThe tiramisu was disappointing. It was served in a bowl for soup. I think because it was very watery. It had a lot of liquid and too much cream. \nLove the atmosphere, casual enough for drinks with coworkers and dinner with friends. I found it a bit pricey for pizza. No happy hour special either.", "author": "Alicia C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}