{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "Funky little spot.  Split a house salad and large pizza with fried eggplant.  The salad was fine, nothing spectacular.  For reasons unknown, the pizza came out kind of cold which I did not understand.  I like the Neopolitan style and appreciate not feeling too stuffed after indulging in pizza.  However, the minimal amount of cheese and eggplant (which cost about $2 per lb. at the local farmers' market) did not justify the $25 price.   All in, the salad, pizza and tax were $40.   I feel like I can do better at $20 pp for pizza before drinks and a tip.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "I wandered in one day before they were even open and co-owner Antonio bought me a glass of Barolo; that wasn't even on the menu!  The place is generally excellent.  Good crew, good food, reasonable prices and they now have a full bar.  I had my wedding rehearsal dinner there and they did a phenomenal job.  I highly recommend the arugula pizza!  Say hi to Antonio - he's awesome.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Stopped by last night for Sat dinner with my wife, what a tremendous experience. Nice lively buzz, Antonio the manager/owner (not sure) was a pleasure. The food is great, Pizza is better than all I have had in the area. I will be back and often!", "author": "Darrell G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Amazing little restaurant. Very friendly staff and the food couldn't be beat! Loved my Caprese salad. The presentation was beautiful. We also ordered the pizza with sausage and added mushrooms. WOW! Probably one of the best pizzas I've ever had! Perfect crust and just the right amount of everything.", "author": "Vince T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "I've lived in NY all my life and have tried many different authentic italian restaurants but Luzzo's BK definitely surpasses them all - you only get pizza this delicious in Italy, and at Luzzo's! Not just great pizza, all the dishes are excellent. Friendly, exceptional service, great atmosphere, great drinks, and reasonably priced.", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "A great substitute to whenever I am dreaming of going back to Italy.  The staff is extremely friendly and they even remembered me after only have been there once before.  I always get the carbonara which is perfectly al dente and incredibly tasty.  The pizza is also very good.  The crust has a great crispy but still chewy texture and my husband loves anything with the truffle pate.  This really feels and tastes like an authentic Italian restaurant.", "author": "Sara Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-11", "description": "Really good. Nice thin crust, fresh ingredients. Probably my favorite pizza to be delivered in the nabe.", "author": "Roberta S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}