{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Returned to this restaurant after a couple of years absence to find it's gotten more delicious! After a date with my husband, we stopped in here for dinner and ended up having an awesome time. The waiters were so nice, they made great wine recos and gave us complimentary rounds of Sambuca after dinner. Our pizzas were so good we were still talking about them two days later. Cozy, cute, great atmosphere. Later we asked my stepdaughter if she's been in there and she told us it's her favorite pizzeria. Approved by the whole extended family apparently! Highly recommend for wine, salads and pizza.", "author": "Vanessa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "I usually go to the Luzzo's located on 1st Ave in the city (seriously, I'm probably they're #1 customer). Like a true fan, I had to check out the new Brooklyn location. I'm so glad I did!!\n\nThe decor in Luzzo's BK is awesome. If had a very \"homey\" type of feel. The staff was super friendly and really attentive. The pizza? Nothing short of amazing. Luzzo's never let's me down. We had the rice balls which were delicious, the Tartufata which was spectacular, and he Montanara which was also \"lick your fingers\" good.\n\nOverall, my experience at Luzzo's Bk was awesome and I will be going back (probably quite frequently). They get a thumbs up from me :D", "author": "Lissett L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "Great little pizza place. Most recently ordered a large truffle pizza, which was the perfect balance of truffle, cheese and sauce. The arugula salad wasn't anything to write about, but the nice ambiance, service and prices more than made up for it. Would return a third time.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "My favorite neighborhood spot!  Fantastic pizza, relaxed ambience, and great service.  The staff is so friendly, and I think this is the best pizza in the area.", "author": "Dee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "Very nice ambiance, and friendly staff. The pizza was really, really good, but that's what my friend ordered. I got the pasta with roasted cauliflower, and brussel sprouts. Not roasted. Never near an oven. No char.", "author": "Stephen V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-25", "description": "Awful experience ordering this evening thru Seamless.  Was supposed to be about 40 minute turn around which is too long, but was not delivered for 11/2 hrs.  Delivery guy said, \"we're busy.\"  Sadly, it was not even worth the wait.  Floppy, limp crust. We paid $3.00 for extra,sausage ( where??), really not a quality pizza.  We feel very cheated.", "author": "Linda L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "If the pizza were as salty as the people who work here, the pizza would be VERY SALTY!!!\n\nI placed an order for one large pizza at 7:35 on a Friday evening and I was quoted the pizza would arrive in 45-60 minutes.  At 60 minutes I called:  \"The pizza is leaving right now\"  No.  It was not.  The entire pizza eating world understands that it takes no more than THIRTEEN MINUTES to cook a pizza.  Was this a magic pizza?  Did somebody buy this pizza from the same guy who sold Jack his beanstalk beans????? \n\nAt 1hr, 15min, I called again:  \"the pizza is going into the oven\"  \n\nAgain, no es verdad.   Es falso.   \n\nWe wait for le pizze.  All is lost.", "author": "Angela C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "I was looking for someplace a little more low key for my birthday dinner and decided to check Luzzo's out since I live nearby. The entire planning process and offering was great from start to finish! I reached out to them about making a reservation for a rather large party (as noted on their website), and they got back to me in a very timely manner and worked with me to plan on a tight turnaround. They also offered a pre fixe menu that made the experience dining and even paying at the end of the night (no complicated check splitting!) amazing. They even worked with me to suit the dietary needs of the party and were super flexible. We were able to have a long, relaxed meal from appetizers through dessert. The ambiance was great and it wasn't too loud so I could still chat with nearly everyone at the table. We had a great time, I would definitely recommend for a stress-free group dining experience!", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "I've relied on their Charlie pizza to impress visiting friends and family about how good NY pizza can be in Brooklyn. I've relied on their meatballs to calm me into a vegetative state so I can deal with said visiting friends and family. I've relied on picking randomly from their menu without ever having the burnt-but-soggy \"artisanal\" mess experience I've had elsewhere. And I've relied on their delivery to come in 45 mins or less every time, so far (knock on wood). Luzzo's BK, you are a neighborhood hero.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-12", "description": "I went there with some Italian friends, the place looks nice and cozy, small place very well decored, unfortunately the pizza was terrible, \nthe dough was sweet!!! mozzarella is not milky but  rubbery, the crust was over cooked and hard like bread need a steak knife to cut it, we shared 3 large pies one after the otherl had the same hard dark over cooked crust, so I guess is the way they make it, service: bad, the Italian pizza chef was busy with his smartphone and the other co-workers chatting, the two spanish guys, one making the pizzas and one bussing the tables where the only one working, \noverall bad, thumbs down.  \nWe wont go back.", "author": "Robi T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "Everything is RIGHT. The food is spot on, the service is FANTASTIC. The experience is FUN/ GREAT. Luzon's on Atlantic never lets you down. We'll be back.\n\na LOT.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "My favorite local spot for fancy pizza.\n\nWhen the lady and I came here a few months back, the store had recently opened and thus was relatively unpacked for a weekend. Perhaps that played a role in how great this place was, but it's awesome regardless . \n\n\nService 5/5\nI truly felt that I had stepped into a restaurant in the old world with the level of attentiveness we received from our server. He was unabashedly and delightfully Italian in his mannerisms and speech, and treated us like royalty. He took our order and returned with it very fast.\n\nFood 4/5\nMy favorite pizza is the mikele- a decadent pizza laced with prosciutto and dipped in truffle oil. How can you not??\n\nI've tried some other menu items but mikele just dominates for me every time. One issue is the inconsistency though- sometimes ( maybe when it's really busy) it doesn't come out as delicious.\n\nDecor 4/5\n\nIt's quite cozy inside and the tables are small- but that's part of the charm. \n\nI dislike the positioning of the bar as it adds to the crowded feel of the place.", "author": "Edward Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Luzzo's is my go-to place in the neighborhood. I love coming here - the pizzas are great and so are the pastas.  Good food. Good wine. Can't go wrong here.", "author": "Jaymie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "If you're looking for authentic pizza this is the spot. The Italian gentlemen running thr joint are kind, knowledgeable, and on point with their ingredients.  With a warm, rustic feel, this is the perfect place to cozy up with carbs.", "author": "Carla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "We had our post Brooklyn City Hall wedding lunch at Luzzo's BK and it was perfect.  The food and service were both amazing, and all our various family members were happy with our choice.\n\nWe squeezed about 25 people in their cute backyard, and they kept the antipasta, pizza, and wine flowing until everyone was stuffed.  Our families are full of pizza fans and chefs and everyone was impressed.\n\nI would definitely recommend them for small-medium sized special events like ours, and I expect to return again and again for regular meals.", "author": "sarahoc .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "We came to watch the WC!  They had 1 TV in the back and it was perfect for the whole room.  (We started at Chip Shop a few doors up where there were 5 TV's but difficult to look at, and we left because the service was insulting)\n\nThere were 2 guys running the room, which was full, and they were AWESOME.  Friendly, fast, fun and handsome!  \n\nThe food was amazing (it took awhile but I didn't mind), you can smell the delicious olive oil in the air (i thought it might have been truffle oil but perhaps it was just high quality olive oil).  Had the carbonara, the rose bubbles and then the regular prosecco.  My friends had a pizza and a pannini, sangria and a bellini. \n\nWe weren't planning on having fancy food to accompany a futbol match but it turned out to be absolutely perfect and so fun.\n\nI look forward to checking out the East Village space and having a pizza.", "author": "Rrrona 7."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "A perfectly lovely low-end (sorry - this is NYC and competition is fierce) restaurant with abhorrent service (although gosh, they're trying) trying its best to become a respectable two star.\n\nWent there with my 41 week pregnant wife - we were greeted by 3 different people telling us they would 'be right with us'. None of them 'right' were. Further, none of them offered us water or a drink. Did they mysteriously lower the cost of rent in NYC for restaurants? Wouldn't you want to sell something to those who just arrived? I probably would have paid good money just for a cold beer on this hot night. \n\nWhen we were finally seated, I had to ask three times to get water. Then I had to ask twice to get ice - because clearly either their A/C was broken or just not strong enough to share a room with their brick oven but serving room temp water is just not a good idea. We were then asked three times if we were ready to order when we clearly were still reviewing the menu. \n\nThen when we put the menus down, the international symbol for 'ready to order', we waited five minutes watching our waiter walk past us repeatedly before I flagged the poor fellow down.\n\nFood came and honestly - decent at best. If you're going to charge $19 for pasta, it should be amazing. It wasn't. The pizza was ok - not amazing. Kind of doughy - and to the guy who says their pizza 'can't be beat' - um, yes, yes it can. Early and often. \n\nHere you go:\nCo\nKeste\nLucali\nJulianne's\nMotorino\n\nThere's 5 off the top of my head.\n\nFelt sorry for them though - the waiter was perfectly lovely, just kind of hapless. I still tipped him 16% - what is wrong with me? \n\nI am giving myself two stars too - shame on me.", "author": "Sean K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "I never really had a favorite pizza place, maybe because I worked at one and started to get sick of pizza, but I can finally say that Luzzo's bk is my favorite pizza.   The staff is awesome, the place is comfortable, and the food is phenomenal.   Outrageously good pizza, creative fresh salads, and heart shaped zeppoles that will help you seal the deal on any date.", "author": "Ante P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "Very tasty pizza pies, and great service. \n\nHad the artichokes and they were A-OK, a little too greasy for my taste. \n\nGood wine and plenty of it.\n\nI almost gave Luzzo's BK 3 stars because I feel that the pizza pies are a little skimpy on the cheese, or at least ours was, but decided on four because 1. I want to put out good things into the world and since I'm on the fence might as well err on the side of nice and 2. other than that the pizza really was tasty. Still, they ARE skimpy on the cheese, which stops the pizza from going to the next level AND makes it not that filling.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "We came around 6:30pm on a Sunday. It was just getting crowded. Very very hipsterish place. Gnocci pasta was very good! The \"mista\" salad was just okay- lack of ingredients. Tasty drinks.", "author": "Guzal R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}