{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Great vibe and the food is always awesome! More seating in the back, don't let the narrowness of the joint fool yay!", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Great service and yummy pizza. A and I came here for our Friday date night and had a nice time here. The pizza is solid but the meatballs were only ok in our opinion. I'd come again if I were in the area. :)", "author": "Brietta Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "A cute but small place that just opened up in BK! I came here for their opening party - which is pretty amazing as I am known to not leave my Manhattan comfort zone. Granted I did get lost for a good 5 mins getting out of the 4/5 stop at Borough Hall...it was worth the adventure.\n\nThe pizza they served was delicious and I really enjoyed the olive crostinis...I def think the food is where it's at. The pizza dough was thin but fluffy and the sauce was spectacular. The staff was also super friendly...even when a guest almost set the place on fire....(I SWEAR it wasn't meee)\n\nWill have to check this place out again - this time for a proper meal!", "author": "Diana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "The night we arrived we were greeted with a complimentary glass of Prosecco.  The staff was friendly and food was authentic Italian.  Order the fried artichokes, the Amalfi salad and the spek pizza (the highlight of the meal).  Also a friend ordered the pasta with eggplant which was also very good.  To top the night off we had the zeppoles with Nutella.  I would recommend highly and will be going back!", "author": "Melody M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "The Eggplant Parmigiana simply melts in your mouth. \nDo try the pizza as well, we had the Margherita ( classic, light, and superbly fresh). Do skip the seafood linguine - not as flavorful as one would expect.   Good experience overall, would come back for more pizza.", "author": "Kamilla M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "A real Italian place with Italian chef and management. Everyone is professional and friendly, their Bufala pizza and Truffle pizza are amazing as well as the Puttanesca and Pasta alla Norma! Very nice selection of Italian wines and great Zeppole with Nutella. I would definitely suggest it to friends!!!", "author": "Valeria L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-01", "description": "A-OK and I'm a fan. Three vs Four stars is hard here, because this is the kind of place you want to go back to, but I don't want to overate the pizza as that was the weakest part of the night. When we go back, and we will, I'll update this. But we're from Brooklyn, dude, and you don't find better pizza anywhere than BKLYN so it's a tough market. \n\nThe service was wonderful, the ambiance was perfect, noisy, intimate, dimly lit. You could have a safe date here, a sexy date, or a gathering of clucking friends and it will work out. The manager/owner types are everywhere making sure you're happy. The wines are perfectly acceptable. \n\nThe Antipasti we had were the fried Artichokes with Arugula. Really delicious - NOTE TO WAITER - Don't take my plate until you ask, we still had arugula on there! Grrrr.\n\nWe had the Capricciosa pizza. It was nothing special, red sauce non distinctive, cheese was sparse, and the olives seemed from a can. Maybe they weren't. But they seemed like it. All in all bland. The crust was a little on the chewy side but some people like that so I can't complain. It was just a disappointment considering all we'd heard about this place.\n\nI feel like we had an off night. We'll go back and try something else, like I said, and see what happens.", "author": "C D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "Very very very good pizza. Unique to other pizza in the neighborhood. Love the crust- crispy, chewy-- Devine!!!\nGreat quality- salads amazing and delicious wines.\nWill be back many more times!!", "author": "cory h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "Best pizza ever. They gave a free glass of champagne with our meal because of the new year. And honestly the service was amazing. They were literally the most attentive staff I've ever experienced. They would walk by and carefully (without being disruptive) observe where you were in your meal. They were running around but somehow made it seem effortless. I would recommend this to anyone looking for delicious and authentic pizza!", "author": "Jordan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "Great neighborhood pizza option without the wait that you would see in front of Grimaldi's or Lucali's.  The pastas are good as well.  I'd stay away from the fried calamari, which tends toward overdone chewiness.  Stick with the pizza.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-05", "description": "Good pizza with very thin crust.  the service was friendly and  unhurried on a recent Sunday afternoon.  I thought that it was  a bit pricey but the there is  a place for this restaurant ion the list of upscale Brooklyn pizza venues.\n\nI can't  say anything bad since they we completely accommodating to the accompanying  5 month old.  He even got a big \"ciao\" when we left.", "author": "jim r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "Great date spot. Nice in a pinch. Familiar and fun, casual and yummy. Very Italian staff (read attractive) Efficient service. Not too fussy. Like the ambience. Did I mention front of house was easy on the eyes? Just very attractive humans working here... Warm in an Italian sort of way. \n\nThe pizza is good, the crust being its winning element. Maybe the best crust in the neighborhood. Some pasta dishes are better than others. Pizza and antipasti is what I usually order. \n\nI'm a big fan of their brunch pie. Wow. As a whole, the pies are not too cheesy, definitely an old world, brick oven style pizza.", "author": "Devin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-30", "description": "I wanted a nice intimate dinner with my girlfriend that had a extensive wine collection. I came upon this place, which wasn't far from my apartment. It's nicely decorated, and the oven in the back is very picturesque. The place has a nice rustic feel to it, with Italian sayings all over the walls. \n\nI ordered a Pizza Arugula, (Arugula, with Prosciutto de Parma) Zepoles, and the 4 cheese rice balls. The rice balls were a little under cooked, but good. The Zepoles were delicious, (according to my girlfriend). Fried dough with Nutella stuffed on the inside. The pizza itself was ok. I personally don't like it when they drown the pizza with arugula. However, it was pretty good. \n\n   I had a glass of wine like I originally wanted. The first one, the Supertuscan, ($16 a glass) they were out of. The second one I ordered was Rosso Di Montalcino. It was pretty good. But not worth $15 a glass. I understand it's a small place, probably with a big rent, but the prices on wine were ridiculous. The bill came to $57. As I've said, I don't mind spending when the food is good, but this food wasn't that superb to begin with. \n\n   I would say if you like the environment, and are looking for a decent/good pie. Go here, however, be prepared to spend. I personally don't think it's worth the money, but someone else might think so.", "author": "Frank B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Yep. These guys have put in a serious bid to be my favorite Cobble Hill slash Carroll Gardens slash BK Heights pizza joint. Yes there's another great one down Henry, but I think Luzzo's may have snuck ahead. \n\nThe atmosphere is nice. The staff are uber friendly. The pizza and apps and wine hit the spot every time. What's not to love?\n\nThe final test will be when I order delivery (have only dined in). I'm expecting that day to seal the deal.", "author": "Nathan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Very romantic! Super cozy! Good vibe and music. Pizza  was delicious and they also have gluten free option for pizza and pasta! Authentic Italian as it can  get! I will definitely be back for more", "author": "Greta P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Fantastic pizza, great wine and an amazing atmosphere. Good for a romantic dinner or a trendy spot to stop in while hopping.", "author": "Sean W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Fantastic pizza! Had the arugula pizza which was delicious. Great service, very friendly staff. Little pricey but highly recommend! \n\n4 stars because of the price", "author": "Alessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Had my fiance's birthday dinner here with 10 friends and Antonio the manager was so gracious and accommodating.  We ordered about 5 pies and some appetizers and wine.  Everything was wonderful.  Many people in our party said the pizza was the best they ever had.  Will be back for sure, maybe a birthday tradition is in the works!", "author": "Allison H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "Everything is better in Italy, except maybe the pizza.  Luzzo's BK pizza cannot be beat. The thin crust pizza is cooked to perfection in a wood burning oven.   \n\nThe service was friendly, attentive and largely Italian-accented.  Who could ask for more?\n\nThe room is small, but inviting.  The night I was there, there was world-class soccer playing on the big screen.  La Vita e' bella.", "author": "Joe F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Luzzo's was amazing. The energy, food, decor, the people and service were all great. Atop that... my fave sign 'drink wine - eat pizza - make love' made it even better. \n\nThey made a special pizza just for us with anchovies, yum. The lobster ravioli was excellent and the house Mixologist Armando, whipped us up several tasty drinks! A great place to checkout or become a regular.", "author": "Charnell A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}