{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "It took me a number of years in the neighborhood to finally make it out to Luzzo's, I think it had mostly to do with their prices and the fact that I'm actually closer to Lucali's. I'm glad I finally make it out because Luzzo's makes fantastic pizza (I'm sure their pasta is good too). Their wood burning brick oven is in full view unless you're sitting in their back patio, the ambience is nice and a good date night place. My fiance and I split a couple of their personal sized (12\") pizzas. Prices for the 12\" pizzas are shockingly high at mostly $18-21. $7 for a bottle of Peroni (the least expensive of the few beer options) was no bargain either. \n\nWe split a sausage and their signature option which comes with \"tomato sauce, mozzarella, speck, fresh ricotta, truffle paté\". Both pizzas had the ideal light and chew to the dough with the proper charring and delicate crust to it. There was no truffles or pate visable on the second pizza but there was a definite truffle oil flavor, there was a bit of brown speckling to the pizza, not sure if this was some sort of pate dust. Regardless the spec and ricotta was excellent. The sauce wasn't as bright and fresh as I like but it wasn't a distraction. Overall we were both very pleased with the pizzas.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-04", "description": "The decor is nice and service was also really good. We ordered mussels for appetizer and a large pizza. The mussels were the largest mussles I've ever seen and a few them tasted very sandy, and one of them I couldn't chew and had to spit out. We ordered the Charlie pizza, which was good \u0026 tasty but a bit too oily and the cheese was a bit too much. The drinks were good, we got a wine and mixed cocktail - but they charged me 2.00 extra for 3 olives, which is ridiculous and I have never experienced that before. Good but won't be coming back.", "author": "priya s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "Hands down the best pizza in BK Heights, love the thin crust and the ease of ordering. It only takes 20 mins for pick-up whenever we order!\n\nClassic pizza place, I wouldn't order the pasta, just stick to the basics.", "author": "Emily E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "Every New Yorker has an opinion on good pizza. And every New Yorker loves to talk about their favorite pizza joint. Yes, Di Fara, go there. Yes, Lombardi's, go there. Yes, Grimaldi's, go there. Yes, Paulie Gee, go there. Yes, Roberta's, go there. Yes, Totonno's, go there. Yes, Lucali, go there. Yes, Luzzo's BK, go there. \n\nLuzzo's is among the top pizza places in New York. A good pizza, is well like ecstasy. All the endorphins that are released is equivalent to a really good stretchy bendy yoga class. Sorry, I know, I am hippie like that. \n\nMy date and I came here on a cold weeknight around 9pm. We got a table immediately and they let us sit at a 4-top booth even though there was only 2 of us. Good sales move. \n\nWe opted to get some house wines ($8/glass), be warned they are not DOC or IFT-certified. \n\nWe ordered the arugula, candied walnuts, blue cheese salad for starters. Excellent. It helped to whet the appetite for the main course. We shared a 16 inch fungi pizza. You can get pizzas that are either 12 or 16 inches. Since we were hungry, we got the bigger one. The pizza was perfect. Nice, chewy crust and just plain good. \n\nI recommend stopping by if you are in this neck of the woods. You will not be disappointed. I know we were not and we went out into the cold, belly full, inebriated and immensely satisfied.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "I owed Luzzo's a review so long ago! The people are awesome, the happy hour drinks with free nibbles of pizza is great. I like people watching the street while having a glass or two of wine. But the Luzzo's BK pizza, with mozz, speck prosciutto, fresh ricotta, and truffle pate is INSANEEEEE!!!! My mouth just went into wet drool mode. Yea. It's that good. My favorite pizza in Brooklyn to date. BAM!", "author": "Mike S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-10", "description": "A pizza and two bacardi and cokes was 52.00 without a tip. Wild. Nah, b. Also my crust was burnt af and they don't even use real coke.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Pretty nice place to spend a night out. They have multiple choice of pizza,main dishes and beverages. They make you feel like you are really in Italy.", "author": "Diana O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Been here 30 times! Pizza does not get better than this!!! This is pizza. There is no argument the pizza is out of this world. Eat Pizza Make Love!!!!! If you think you know pizza, you don't really know anything until you've been here. Order the Luzzo BK it will change your life. The rice balls are great too", "author": "Martin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Excellent Service Wayne is the best.   Food  is amazing Ragu is perfection.  Love the pizza.    I've smallmquaibt spit with spit on food.  Try Wayne's Sambuca mojito", "author": "Robert S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "How can one not love a brunch menu featuring pizza and pasta in an adorable little restaurant with summertime backyard seating? For a table of six, we ordered two large pizzas, the Tartufata and Arugola, and two pastas, the Carbonara and Vegetable. Much to our surprise, the Vegetable pasta unanimously beat out the Carbonara at a table of bonafide carnivores. Seriously, my friends are cavemen who laugh at veggies or use them decoratively at best. \n\nWe saw at least two infants while party brunching on a Sunday, so beware of your language, boisterousness and behave! The food is worth it. So is the cocktail list.", "author": "Malificent G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Nothing beats Brooklyn pizza! We moved out of the city and always find ourselves craving pizza when we come back to visit. This place is great!", "author": "Jacqui S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "After recently moving to Brooklyn Heights I knew I had to make a stop for dinner at Luzzo's BK after hearing such great things about it. \n\nThe space is super cute and nicely decorated. The salad appetizer was so yummy, with arugula and Parmesan cheese. Then for the main reason we stopped in-- the pizza, very tasty, you could definitely taste the quality of the cheese and olive oils that were used. \n\nThe owner even greeted us and welcomed us to the neighborhood which was so sweet, even carried on a nice conversation. We will definitely go back or even order in, they have many delivery guys/bikes that we see all over town!", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "So perfect.\n\nI don't usually rave about service but I have to say I was pleasantly surprised with how personable the staff here is. And bonus for them being real Italians! We felt like we were just at home. \n\nService was quick, our pizza came out piping hot and fast.\n\nThe two of us shared a 12\" Luzzo BK pizza and it was perfectly proportioned for two, perfectly crisp yet fluffy, and perfectly seasoned with truffle oil. \n\nI will definitely be back!", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Amazing experience tonight at Luzzo's BK. We had a birthday dinner party for 10 people. \n\nWhen I called to inquire about the possibility of accommodating a party the owner was incredibly responsive and immediately gave us options for a prefix. He was very courteous and communicative in the email exchange.\n\nThe chef and hostess came out to greet us upon arrival, and the hostess could not have been more graceful and attentive when assisting us in setting up the table with flowers and balloons. Service was excellent and we were very well taken care of throughout the meal.\n\nThe food was fresh, made with excellent ingredients and tasted delicious. There was ample food for each person and everyone in the party had a wonderful time.\n\nThis restaurant is clearly being run with a lot of pride, passion, and love.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "This is a really cute neighborhood pizza place. It's got brick walls and high top tables in the front, along with a small but quite well stocked bar.  We came here for lunch on a Sunday, and it was my first time having pizza in Brooklyn. \n\nWe started with a spinach salad to feel less guilty about the pizzas.\n\nPizzas:\n1. Nonna luisa: tuna sounded a bit odd, but it worked well with the pickled peppers, which were the highlight. This is a very interesting pizza\n2. Luzzo's BK: more traditionally what I would order - truffle, proscuitto. The crust was super thin but held up nicely and was perfect for folding\n3. Battilocchio: a more interested oval shaped, thicker crust breakfast pizza topped with two eggs.  This one was very rich but interesting to try at brunch\n\nService was friendly, and I appreciate that they have lots of coat and purse hooks for the high top tables.", "author": "Marilyn T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "Stopped in with a friend who recently moved to the area on a Sunday afternoon for some high quality NYC pizza. The Brooklyn location is smaller than the East Village spot and has a rustic, yet modern feel to it. The front of the restaurant has a little bar and is situated better than the small bar at the Manhattan location. Our fashionable server came by and we decided to order two 16\" pizzas, the Arugula and the Luzzo's BK. Fortunately, she warned us that for two people, the 16\" pizzas would be a lot food and a challenge to finish. We decided to take her advice and down shift to 12\" pies instead. Thank you Martina, we owe you one. \n\nBoth pizzas arrived at the same time and looked amazing. They both had a nice thin crust, not too crisp with just the right about of chewiness. The Arugula was crisp and bright green, with ample amounts of shaved parmigiano on top and the prosciutto with mozzarella underneath was delicious. Think of this pie as a way to get your vegetables in for the day. \n\nThe Luzzo's BK had nice strips of Speck (another type of prosciutto), ricotta, mozzarella and truffle pate. The truffle pate is more like a oil based spread than chilled hunk of pate. The ricotta, combines with the speck and truffle to create a delicious, savory bite. \n\nYou'll notice Luzzo's has placed the letters D.O.P next to some food items on its menu. The DOP in the case of the prosciutto means that the pork was raised within a designated geographical region in Italy and the prosciutto was produced only from a certain provence. I'm not sure where this prosciutto was created but the D.O.P means that the European Union has given it a protected designation of origin. I'll just have to go back and ask next time. \n\nService was good, our waters were constantly filled and our empty dishes/trays were quickly cleared away. i definitely recommend visiting this outpost if you're in this part of town.", "author": "Steve S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "I stopped in for a quick dinner with the kids, first choice was Hibino, but the wait was too long.  SO pleasantly surprised! I had a moment of panic when we waited for what felt like forever for the waiter to come take our order (with two kids and bedtime fast approaching- 2 minutes can feel like an eternity) \nBUT, the food came out so quickly and was delicious- the pizza, pasta and quinoa salad were all so tasty. We had a great meal! There are a lot of pizza joints on Atlantic, I hope this one stays...", "author": "Lulu B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-20", "description": "Cozy spot to grab a high-quality pizza.  We ordered the Luzzo's BK.  It was good - although I think the truffle made it oily so I felt like I had oil all over my face/hands. We also ordered a side of broccoli rabe, which I just added to my Luzzo BK - yum!  Plus, we finished the evening with tiramisu - definite yum!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Particularly recommend the $8 house chianti, the ragu and the nutella filled donuts.  Delicious and laid back!!!!", "author": "Dee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "This place is my fav. It's my go-to pizza when I order in and feel like spoiling myself. The pizza never fails here. I could order their tomato sauce as a side dish.\nEven most appetizers are amazing. \nThe place is tiny, in the summer it has a cute backyard.\nIt's a little pricy, which maybe it's good so I don't order it every night.", "author": "Ilaria T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}