{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-06", "description": "We were very disappointed after expecting much more from the decor and menu.  We ordered a brunch pizza which was ultimately bland and lacked flavor.  The crust was ok but the toppings were lacking a lot.  The omelet was over cooked and the seasonings did not mesh.  When we asked for a side of pizza sauce to give the pizza some texture and flavor it took 10 minutes to deliver.  They said they had to make it fresh but isn't this a pizza place?  No sauce available?  Lastly the salad was saturated with vinegar.  Very disappointing... Maybe their dinner/pizzas are better, but the brunch is not up to par.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-21", "description": "Luzzo deserves a 5 for its service, enthusiasm, cheeriness, and overall desire to please. The food was good too, but I have had better pizza at Table 87, Julianna's and John's on Bleecker St.  I just found the Luzzo tomato sauce unappealing and I kept adding an irrational amount of salt trying to get the flavor I yearned.   The meatballs were a great texture (3 to an order)  but the sauce, meh.  Two of us scarfed down the large pizza, no problem.  Terrific crust.  Nice Italian wine list and Alessandro let me have a taste before I committed.  Nice seating in the front, crowded in the back, but definitely more upscale than Table 87 nearby.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "Really good pizza. Great service and delightful staff. Small-ish place-party of 20 max. Try the salsiccia or aglietta pizza. Armando and Martina were fantastic! \nVery quick when not busy. Great value!", "author": "BK D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "LOVE LOVE LOVE this place. Went for the first time yesterday and I was back again today. The pizza is absolutely amazing and the service is great. They even have a (very small) outdoor area that I can't wait to try!", "author": "Raven C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "V. good pizza. Delicious in fact. Fried artichokes were tasty but could have done with more, longer, crispier leaves. But then we are splitting hairs. Waiters could do with loosing the heavily affected Italian niceties.", "author": "Domenic V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "Favorite pizza in Brooklyn. Apps and salads also delicious. \n\nNice to  sit outside in the garden when its warm.", "author": "Vix C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Such a wonderful neighborhood joint. wonderful pizza . We love all of them especially the Diavola...and also a great brunch on the weekends. In the summer have a drink in their lovely backyard. The staff is the best and make you feel like familia. Luzzos where would we be without you? Thanks for making Atlantic Ave special.", "author": "BQE i."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "Food and service is amazing! The bartender is so amazingly funny the wait staff are very energetic and sweet. I have not one complaint besides I wish the place was bigger they deserve a huge space.", "author": "Tiana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "I used to live in this neighborhood years ago, and I wish I found this place earlier. The atmosphere is great, intimate and friendly. Appetizers were delicious (I suggest their rice balls!), the pizza is an authentic neapolitan style masterpiece and we also appreciate a glass of Chianti with it. The place is a little small but totally worth a visit!", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "Umm, yes I will have more salad, more diavolo pizza and....sweet Lord, more Nutella-filled zeppoli please. I won't have another iced tea though because you charge for it. But otherwise, perfecto.", "author": "Tommy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-07", "description": "Pizza was not hot. Pasta portion very small but plate was very large.  No one in charge.  Definitely my last visit.", "author": "Gerald L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Hands down some of the best pizza in the city. Great atmosphere too.  Calamari is outstanding.", "author": "Navin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Love this place, been there with my wife for a romantic dinner as well as with the baby and also with buddies. This place is a hit every time. Food is excellent and service is outstanding. Very authentic. Going to be my neighborhood go to spot.", "author": "Darolyn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "yummy yummy in my tummy piiizzaaaa. this is one of the best sicilian pizza slices in bk! so good.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Great service, and the best pizza I've had outside of Italy. Relaxed and friendly atmosphere and they always seem to have great music too! Bravo Luzzo!", "author": "Yadu K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-02", "description": "Terrible service, terrible food for the price. The waitress was so bad. It took her 15 minutes to even approach our table even though there were only 5 tables. Then she tried to talk us out of every plate we wanted to order - even the ones she recommended! Finally ordered the Penne Zucchine e Provolone Pasta and she asked if I'd be ok with all the cheese. I said 'yes' (who doesn't love cheese?!) When the dish came there was barely any cheese - just a bowl of penne pasta and some steamed zucchini (for $17!) and completely bland. The appetizer bread was cold and stale tasting. Maybe the pizza would have been better...", "author": "Laura R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Stumbled across this place walking through the neighborhood and very happy we found it. Great brunch. We had the special and the goat cheese and spinach salad, which were both very delicious. Nice staff as well. Definitely coming back.", "author": "Krystal B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "i am a old lady on 24-7 oxygen in a power chair, this place made me feel very welcome. the staff was awesome. i had the best all time pizza ever. its not pizza,its an experience .if i had to pick my last meal ever it would be at luzzo's. i have not ever in my life time of pizza , ever had a better one. ps and  the dessert was a very welcome surprise.,just YUM.", "author": "pat g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "The pizza is good, but the service is pretty crappy. The waitress failed to ask for my drink order, even though she asked my husband and father for theirs. I had to flag her down twice and them she still failed to bring my drink order. I ordered a salad and she also forgot to bring it. There were maybe two other tables taken in the whole place while we were there, so it's not like they were busy. I wish the service matched up to the food, but it was a really annoying experience and I don't think I will go back.", "author": "Liz A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-26", "description": "Terrible, possibly one of the worst pizza's I have ever encountered. I have had my fair share of nice wood oven pizzas as well as cheap dollar slices and nothing has been as bad as this. We ordered delivery and the pizza came with basically two pieces of basil and very little cheese. If you called it bread with tomato sauce then I would concur, pizza I think not. A lot of these reviews appear to be friends who do not live in the area.", "author": "L N."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}