{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Great restaurant with super friendly staff. Loved the burrata and bread sticks to start. The chicken dish was like chicken tenders adult style ftw. \n\nWould definitely come back if in the neighborhood!", "author": "Sara F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Luzzo, you astound me.\n\nThe carbonara was rich, filling, al dente, creamy (from the cracked egg). I could have had this all for myself. \nI bet they make a killer cacio de pepe. (I will have to try and let you know).\n\nThe pizza had a light crispy Rome-pizza-like crust. The toppings of cheese and truffle pate were delightful.\n\nAnd we suspect we saw Ebon Moss-Bachrach chilling with the owner and Ebon's two girls. \nEveryone was watching the football game on the tube. \n\nGood times.", "author": "Doreen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Seriously, stop looking for a great pizza joint. At least in Brooklyn, this is the place. Great atmosphere, great service and unbelievable pizza. The speck is especially good.", "author": "Jorge M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "I think this is going to my new favorite spot in Brooklyn. Just walking by and decided to try it out. Amazing experience from beginning to start. Started with the small margarita pizza and salad to start main entree was the rigatoni with short rib and meatballs in tomato sauce. Everything is homemade by the way. Customer service was excellent. It a small place not great for large parties but very cozy. Ended the night with chocolate mousse as if I wasn't stuffed already but it was a necessity. Will definitely be coming back here in the near future to try some other menu options. No complaints over here just a quality restaurant selling quality homemade food.", "author": "King N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "There are several of things I like about this Luzzo's:\n\nThey make a decent Sazerac.\nThe atmosphere is pleasant, and even romantic.\nThe pizza is excellent (love the tartufata, the margherita, and the diavola).*\nThis location is far closer to my apartment than the one in Manhattan. \n\nWhat I really loved about this joint was the happy hour. Unfortunately, they discontinued it for now, but they've still got well above average pies with their signature thin and chewy crust. This makes me happy.\n_____________\n\n*Although, it might not even be the best pizza on this stretch of Atlantic.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Went to Luzzo's based on the suggestion of our pasta maker, Un Posto Italiano.  Amazing recommendation. Pizza was some of the best we've ever had (lifelong NY'ers). Meatballs were outstanding.  And a pleasant surprise was how great the cocktails were. Don't hesitate going to Luzzo's for date night or a casual night out for great pizza.", "author": "Jase M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Return? Absolutely, great food, service, vibe\nAtmosphere (4) stool tables up front, dinner tables in back\nFood (4+) - beet sakad (4 but needs more goat cheese and pistachios), small diavola (4 - chewy crust), sm margherita pizzas (4). Much better than Brado next door, on par w/ Table 87 down the street but much nicer eat-in atmosphere. \nDrinks: $15 glass white\nService (4) Very friendly\nCost = Total tab w/ 2 wines before tax/tip typically $65-$75", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "After a pleasant but not particularly satisfying couple of pies at Fornino in Brooklyn Bridge Park, we thought it would be a good idea to do a Pizza/Pizza Bang-Bang (Louis CK anyone?) to end the night on a good note.\n\nI'm glad we did it, because Luzzo's makes some of the best pies in the city. I'm not so sure it should've won that Best Pizza bracket on Eater last year (as they proudly display), but it sure is excellent.\n\nTo cleanse our palates from the previous pizzas, we started with the Polpettine ($11 for 3). These were pretty delicious, and were a welcome way to start the meal over the usual salads and charcuterie. Since we already had two pies, we also figured we would switch it up a bit and tried the Orecchiette with Sausage and Broccoli Rabe ($17). This is a really delicious version of the classic pasta dish and is a great mid-course before the pizza main event.\n\nFor the pizza, we went the small Diavola (12 inch pie for $18), and it was amazing. Piping hot, it was some of the best Neapolitan style pizza you could ask for in NY. The crust was nice and chewy, with a bit of crispiness. It was fluffy and had some real substance and made you make sure you finished every last bite of the sometimes passable crust.\n\nThe place itself is very nice too, with excellent service from the waitstaff and the efficient busboys. The menu is extensive with tons of great choices - I would definitely return to try one of the great \"A Frusta\" items that I had at the Manhattan location, which are amazing.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "The service is certainly warm and friendly. However, the pizza is subpar and there is definitely better to be had in the neighborhood. Had the signature pizza and the crust was watery and soggy, with sparse, unappetizing toppings. The pizza is overpriced and underwhelming, save your money and go elsewhere.", "author": "Anna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Our first time there last weekend for lunch. We had aimed for Brado's but walked in to sadly see a neighborhood acquaintance drunk on the floor at 2pm. We decided to find an alternative. OMG, it was practically next door and we had not tried it. Luzzo's pizza, decor and service were fabulous. This is out new neighborhood pizza joint. Highly recommend it--truly delightful people and owner.", "author": "James O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Cute spot on Atlantic. Cozy and warm by the oven in the back! \n\nWasn't crazy about the pizza (sagged a bit, flavors didn't meld well) which is surprising bc I like the pizza at some of their other restaurants. In any case, lots of other great things to eat - fried artichokes, burrata, and pasta alla Norma. Service was friendly in that Italian way. And, it seemed like they knew everyone coming in to eat.\nMade me miss Italy!", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Yes, you can throw a stone and hit a coal/wood/gas/artisanal pizza joint in the Greater Carroll-Cobble-Boerum-Park Metropolitan area.\n\nAnd while I still think Lucali wins the food competition, Luzzo's is the place to go.  No attitude. Friendly, warm, welcoming, hip, dark and intimate. Great pizza. Crispy, cheesy, and substantial. \n\nGo now!", "author": "Julio R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Consistently perfect dough, sauce, and brick oven-ness. Capricciosa and Brutta ma Buona are our go-tos.", "author": "Ori B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-17", "description": "I ordered delivery here and thought it was just okay, and very overpriced. My sausage, mozzarella, and basil pizza had very little mozzarella or basil on it and was overall kind of bland. The truffle, mushroom and speck was better but still, nothing that blew me away. At these prices I'd much rather go to Emily in Clinton Hill.", "author": "Mary E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "Luzzo special pizza with Spek. Awesome. Two salads. Beet and endive. So so. \n\nNo beer on draft. \n\nPlenty of better alternatives in the area.", "author": "A B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-13", "description": "We had a 7:15 reservation for two last Friday and we were seated promptly. We ordered and our food (which was delicious) came quickly. At 8:10 after our plates had been cleared, the waiter asked if we wanted to see a dessert menu and we said we would like to. Two minutes later, the waiter came back and said \"I am sorry but there are a lot of people waiting for tables so we won't be able to serve you dessert tonight.\" He then placed our bill on the table and walked away. We hadn't even been there for 1 hour and we were told we couldn't have dessert. When you make a reservation at a restaurant, you should at least be given 90 minutes, if not longer, for your meal. This was unacceptable and rude and should not have happened. Even the people at the table next to us who overheard this happen were outraged. I will never dine here again.", "author": "Chloe J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-04", "description": "If you're like me and have never had truffle pate on pizza before, it's basically life-changing. Okay, maybe that's a bit of an exaggeration, but it's damn good.\n\nI ordered 4 pizzas to go (because I'm fat). Service was quick (15 minutes to be ready on a Saturday night).\n\nThe Luzzo's BK pizza was by far the best. Spec, truffle pate and ricotta.  Yummy.\n\nWas also a fan of the sauceless Salsiccia e Friarielli (ground sausage and broccoli rabe) and the Capricciosa (mushrooms, artichokes and olives). The Bufala was okay, just standard stuff. But I highly recommend the rest.\n\nTheir pizza menu has a pretty big selection, for both vegetarians and meat-lovers.\n\nI didn't realize until we went to pick up the pies that it was the old Sosta space. Luzzo's pizza is much better, but they've added a bar in the middle of the restaurant, which takes up a lot of the previous seating space. It just kinda juts out and is awkward to maneuver around. The place didn't seem too busy though, but I imagine if it gets more popular, it might be.\n\nAll in all, a very welcome addition to the neighborhood.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "A dream into Italy! An Authentic and Beautiful Atmosphere! Quaint, little Italian Gem! Wonderful service and  fantastic with allergies, especially my sever milk allergy! Their pasta dishes are to die for!", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "My friend and I were looking for some pizza on a Monday night, and when Fornino in Brooklyn Bridge Park happened to be closed, we walked up Atlantic Avenue to Luzzo's BK. \n\nIt was a gorgeous, warm pre-summer night around 6:30pm, and though the restaurant was empty when we walked in, we were excited by the menu and the table in the open front window. It seems we started something, because about ten other groups of people walked in during our meal.\n\nThere were some issues with the restaurant's refrigerator that night, so the only items available were the pastas and pizzas, which was fine with us. We started with some cocktails and enjoyed the people watching on Atlantic while eating. I loved the Mushroom Ravioli ($18) in a light cream sauce. And my friend really liked the Margharita pizza ($16). \n\nThis will become a new neighborhood standby in my book!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "This was a surprisingly fantastic Pizza place.  It's coal oven pizza with real authentic Napolese style. \n\nWe came and had the Saturday Brunch menu and tried the Pizza Uova E Tartufo.  It has Mozzarella, Eggs Sunny-Side Up and Black Truffle Pate.  Mmm it hit the spot after coming out of a long move.  Everything was fresh made to order.\n\nWe also tired the Carbonara which was Spaghetti with Pancetta, Eggs, Pecorino and Fresh Black Pepper.  I love the texture of a properly made pasta dish and this was pretty well up there with any I've had.\n\nWill have to come back.", "author": "Kwai L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}