{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Excellent pizza. I ordered a diavola pizza to go and it was one of the best pizzas I've had. I want to come back and try one fresh in the restaurant now.", "author": "Kyle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "This was one of the most romantical dinners I've ever been taken on. . . . . . with my two gal pals for something I'm even too embarrassed to admit this phrase exists (Galentine's day)? Awkward pause. Okay, I got through it. The cocktails here are phenomenal. Freaking phenomenal. I started with a cocktail with red bell pepper and I believe vodka or gin. The names escape me but it was different and went well with pizza and Italian food and then everything shut down and changed when I tried my friend's Brandy drink which also tasted incidently phenomenal made the exact same way but replaced with Jameson. Creative and well balanced cocktail menu. I should have taken a photo because I never remember fancy names!\n\nFor food we generally ordered off of a pre-set romantical Valentine's special menu. But added a few things on to it for three people. The fresh burrata mozz with prosciutto, tomatoes, and evoo. So creamy. The meatballs made of beef, pork, and spinach in a rich and hearty tomato sauce. The bread to accompany it all was also super fresh and outstanding tasting. Margherita pizza was traditional and heart-shaped. THE ROMANCE. Only complaint on the pizza is that it could have used a little more seasoning. I drizzled some olive oil on it and salt and pepper and it tasted top notch. But I liked the crust, sauce, cheese ratio. Overall - decent and would definitely be intrigued to come back and try some of their fancier pizzas. \n\nWe split two different pasta entrees - The fusilli alla puttanesca - olives, capers, anchovies, tomato sauce. I was iffy on this dish mostly because I don't like olives, capers, or anchovies. Lol. But the corkscrew pasta was different and cooked perfectly aldente The sauce was definitely interesting and rich. The other pasta dish I liked a bit more. Orcchette (ear shaped pasta) with a broccoli rabe pesto and fresh burrata cheese in the middle. Really beautiful and fragrant dish that was really bright green.\n\nTopped the evening off with some really romantical heart-shaped nutella donuts. These were bomb. Oozing with the perfect amount of sweetness. Just like my galentine's dates. Ew. That came out wrong. Anyway, solid place to have dinner, happy hour, exploration of brooklyn pizza, date night, girl night, bro night. Two thumbs up.", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Great pizza! Came here on a Friday night with no rsvp and immediately got a booth. There's only 2 pizza sizes, 12\" or 16\", so we ordered 2 large for 4 ppl. Pizzas all begin at $20. The Arugola ($27) was generously topped with plenty of arugula and prosciutto. Luzzo's BK was perfect - tomato based, speckled black with rich truffle and spiced speck. This is definitely my favorite pizza here. The dough was beautifully thin,crispy, and tasty. If you do want anything spicy, they have red pepper flakes and chili oil, not that the pizzas need it.", "author": "Jamie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-21", "description": "My friend and I were looking for a place to eat before seeing a movie at the nearby Court St theater. After deciding we wanted pizza we then decided to try Luzzo's. \n\nNo one greeted us at the door so we just sat where we wanted which was at one of the high tables by the front windows. For a cocktail I settled on the Brooklyn Mojitio which was very delicious. After ordering our drinks, we took a long glance at the menu. I don't remember the name of the particular pie but it had mozzarella and sausage. It was very good but I've definitely had better. The spicy oil that was brought to the table added some necessary flavor. \n\nOverall, it was a nice experience and our server was friendly but I definitely think there is better pizza to be had on Atlantic Avenue.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "My go to pizza place....\n\nThe service here is top notch!! Gennaro and the team go out of their way to make sure you have a great experience and that alone, makes this a place to visit (regularly) \n\nThe pizza selections are also top notch and different from other pizza establishments. The Luzzo BK is not to be missed, especially if you like truffle oil. Their selection is creative so if you are looking for a traditional margherita pie, this might not be the place for you! Be bold -- try something new; you will not be disappointed. \n\nFor dessert, try the nutella zeppole -- decadent and can be easily shared....\n\nI am a regular here and will continue to visit my favorite pizza place at least a few times a month.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Came here one night for dinner (pizza and salad). It was very good but nothing special over other napoletana pizzas in the area. Service was fine. However, they have a number of other traditional Italian dishes on the menu beside pizza. So would definitely return if with a group.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "The \"Eat pizza make love\" sign has always caught my eye and I finally had dinner here with my boyfriend. There is a rustic Italian trattoria feel to the place. The first thing I heard when I walked in was an Italian woman chatting with the bartender in Italian, and right after I notice a group of Italians sitting at a table and chatting. Speaks to the authenticity of the place. I chatted with our server and he himself is from Napoli, the land of pizza!\n\nI was going to go for the mozzarella di bufala DOP pizza (I've been craving real buffalo cheese since my trip to Italy), but the server recommended a few of their bests, and we picked Luzzo's BK instead. Tomato, mozzarella, speck and truffle pate made a delicious pizza (although I still want to try the buffalo cheese next time). Toppings were fresh, although not the best I've had, and I wish the truffle was a little more pronounced, but the PIE! Just thin enough to hold the juicy toppings without becoming soggy, and just crunchy enough to not be crispy and dry. Definitely the best dough I've had in the city. \n\nI though about a healthier option for antipasti, but the server recommended the calamari to go with the Luzzo. Glad we went for it - one of the best calamari I've had in my life. The crunch is light and thin (not too floury) and the calamari was so tender. The marinara sauce that went with it was so good (not too salty, herby or tomato-y, perfectly balanced) that we had to ask for seconds.\n\nP.S. The two of us ordered a 16 inch but only finished half. The leftover reheated beautifully in the oven after two nights (so it was worthwhile to spend a couple more bucks on a bigger pizza). The speck became cooked, but tasted just as great.", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Stumbled in to this place and we are so glad we did. The atmosphere was so warm and welcoming. A mixture of young families and couples on dates. The staff looked like they enjoyed working there and were genuinely happy. We had the ravioli stuffed with mushrooms and truffle oil, arugula salad and the margarita pizza and all three were equally delicious. I have to give a big shot out to the bartender. The jalapeño margarita was the best I've had. Perfectly spicy and balance. For desert we had the zeppolis we so fresh they melted in our mouth. Lovely little spot!!", "author": "Evelyn T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "I've been a patron at Luzzo's BK since it opened and decided to host my birthday dinner there on Saturday night. I'm so glad that I did! My guests and I had an amazing time, and everything was spot on, from the accommodating management and wait staff to the food and ambiance.  \n\nThe food is consistently delicious, and the pizza is by far the BEST I've ever had... and I've been to its birthplace, Napoli, frequently. Make sure to try one of the desserts such as the Nutella pizza... you won't be sorry you did. The restaurant, although small, is very comfortable with a full bar in front and a small outdoor patio in the back. The vibe is unpretentious and lively with a rustic yet modern décor. \n\nIf you're looking for a great meal at a reasonable price in a fun neighborhood, then you should definitely head to Luzzo's BK.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Try the pizza at Luzzo's BK if you're in the hood; you won't be sorry! It's pretty spectacular! I'm a sausage and ricotta cheese guy, so I typically go for pizzas with both of those ingredients. On my last visit, I was in the mood some hearty Italian sausage, so I got the Luzzo's BK, which features a tomato base, both mozarella and ricotta, truffle paté and speck (an Italian cured ham)... but, I had the chef add Italian sausage to the pizza. OMG! What a treat. My mouth is watering just thinking back to that amazing pizza.\n\nI've also tried both appetizers and pastas at Luzzo's, and all are on point. Most recently, I tried the salami \u0026 cheese plate (small size) appetizer, which was actually pretty big for a small size. [Note I was super pleased by this because I'm a big eater.] This appetizer came with a variety of cured Italian meats and both hard and soft Italian cheeses--all yummy! On this same visit, we also tried the Pappardelle Rustich pasta, which featured a light white wine sauce with artichokes and pancetta. The pancetta was melt-in-your-mouth good as was the freshly made pappardelle past! I highly recommend this dish if you're hankering for pasta.\n\nAs for the interior of Luzo's BK, it is kinda small-sh. However, this just makes the restaurant more intimate... and a great place to take a date for date night!", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "This is really amazing pizza.  The dough is incredible -- nicely charred by the brick oven but still somehow moist and very light, almost flaky.  Good quality ingredients overall (we had the arugula-prosciutto pie).  Service was friendly and attentive.  Free bellinis for brunch doesn't hurt, either!", "author": "Tessa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Luzzo's delivery is super fast and reliably delicious.  I'm addicted to their  Luzzo's BK pizza, with mozzarella, speck, ricotta, and truffle.  Heaven on a plate.", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "The food was absolutely perfect, got the margherita pizza and the argula with pate one, and a glass of rose to top it off. Service was spot on, impeccable, everyone was so lovely and friendly! \n\nWent Friday around 1pm, where nobody was hardly there, got the front seat, where it was so sunny and nice, had our water sipping in mason jars, chic, as well as our rose!\n\nThe ambiance is great! No hangups, just eat pizza, make love.\n\nThat middle bar is such an instagram tempting picture to take! :D", "author": "Kath B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "Update: still fantastic! We've been gone from the neighborhood for a little while now, but made the pilgrimage tonight and were not disappointed. The sauce remains exceptionally good - so fresh! - but it's the friendly staff and festive atmosphere that make's Luzzo's a quintessential neighborhood pizza spot.", "author": "Matthew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Great coal oven pizza! I tried the Bufala. What stood out to me were the sauce and the crust. Luzzo's clearly knows its bread. The pizza crust is crisp, chewy, and light, and has a nice char without overdoing it (that's up to personal preference, though). The only slight is that the crust is a bit bland, which doesn't bode as well for a simpler pizza devoid of salty meats. I'll definitely consider coming back to try the Quadrata, which has been recommended to me, and a pizza that has salty toppings.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Yeah, Brooklyn has the best pizza. You already know this. You probably know the \"named\" locations too. You can probably get into them if you know someone or wait a few hours. \n\nThankfully you can experience amazing pizza and overall Italian fare, in a great and friendly environment without that type of hassle. Enter Luzzos BK. \n\nThere is a dimly lit dining room in the front and a small 'hidden' open air, but covered from the rain, backyard. We always go out back with the family and the staff is so friendly and super attentive. It doesn't hurt that they give you some yummy breadsticks (think Cosi-like) while you're waiting for your meal. It certainly is a hit with the kids! \n\nThe speciality cocktails are excellent and a decent size - serious skills at the bar! I love tequila so the fast break is a lightly spicy treat (served up). \n\nYou're in for a treat, though not inexpensive, certainly a note worthy and consistent meal! The staff and the pizza will keep us coming back for more.", "author": "anthony r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Boyfriend and I checked out Luzzo's for a date last night, and we'll definitely be returning.  Staff was incredibly polite and friendly...watching their warm and intimate atmosphere.  Rarely do I notice the music in restaurants, but they had some really good jazz covers playing, and it totally lended itself to the space.  We started with drinks, Do the Right Thing and the Vesper...both were wonderfully class \"adult\" drinks.  If you like grapefruit (but not too sweet) I highly recommend Do The Right Thing.\n\nFood was tasty, and perfect on a rainy day...the gnocchi special and pappardelle with shallots and wine sauce was super delicious.  But the star of the show was the tiramisu I got to share with my love...it was creamy and yummy and I instantly wanted another.  Luzzo's will be highly prioritized in our date-night repertoire.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "A strange place. The manager is uncouth. The place has a touristy vibe altogether. It is cold by the entrance so don't forget to bring a winter coat, but make sure that it does not get stolen by friends of the management. It so happened in at my last visit and has left a disturbing impression.", "author": "Lars H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Fantastic and absolutely authentic dinning experience. Transformed us straight to Italy with flavor and outside ambience - Eros Ramazzotti and Gianna Nannini included. Pizza is Amazing and only one with Tuna we've found in the US. You won't regret going here for an amazing meal", "author": "Chadwick M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-20", "description": "I've been dying to experience Luzzo's for so long. We used to frequent their sister restaurant the Da'mikele in Tribeca until the manager started treating us horribly. \n\nWe were in Brooklyn so we decided to check this place out. The service was very nice however the appetizers were mediocre at best, specifically eggplant Parmesan and the meatballs. The arancini wasn't bad. The pizza with sausage was good the crust was in but overall I would say that the pizza it was the best part of this meal. The wines were horrible!!! Seriously what self-respecting Italian could actually serve the crap that they do? To be fair it's actually not crap wine, they do have a SMALL but decent wine list. However, they don't store their wines properly so shame on them for wasting good wine. \nAnd shame on me for coming here.", "author": "Sara D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}