{"aggregateRating": {"reviewCount": 167, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-27", "description": "This is the first time I've felt the need to write a review but this time it's necessary. I ordered a Margherita pizza for my grandchildren and half of it was burnt. Not scorched but burnt.  The seafood in my seafood pasta was full of grit  and not done no flavor at all. Never returning.  I live in this area and this was truly a disappointment.", "author": "Tracey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "Pizza - thin crust, delicious sauce, nice fresh ingredients, really tasty.\nPasta - also delicious,\nAmbience - romantic rustic Italian decor, with a nice garden at the back \nValue - I took one star off because it's a bit on a pricey side for Brooklyn, be prepared to spend some $$$ but for a romantic night out its worth it", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-20", "description": "The food was great, they make one great sauce but one of their waiters needs to take a hike. He jokes with customers about pronouncing the Italian dishes but takes everything too far. He came by and asked my girlfriend and her friends several times how to spell the dishes that they ordered and laughed and made fun of them in Spanish. He even asked a co-worker to come by and listen. So be aware of this guy.", "author": "Dan Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-29", "description": "Just went here for dinner. It was delicious! We had two pies, one with mushrooms and the other with fried eggplant. Both were great, thin crust that held up in the middle, light char on the edges, and a nice chew to the dough. We also got two salads, that were fine but nothing too exciting. I'd stick with their pies.\n\nThey had an interesting layout. The space is divided into two, separated by a bar. The front of the restaurant has tall standing/stool tables, while the back is a sit down restaurant. I guess you could go for a drink and quick snack if you prefer to stand at the front.\n\nService was great, attentive, and food came out quickly. All-round really exciting addition to the neighborhood!", "author": "Viv C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Great pizza,  great place,  great people.  Had the pleasure to eat here a few weeks ago.  The food was good,  the drinks were good.  The brick oven pizza is on of the best I have ever had.  I am from Brooklyn born and raised.  I would have to say best brick oven pizza in Brooklyn", "author": "Robert L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "So much good pizza in one hood'. Luzzos is right at the top. There is Lucali, south brooklyn, table 87 just to name a few but Luzzos gives you a top quality pie and the waitstaff is by far and away the best. \n\nClassic Margarita is my fav with the crust perfectly burnt. Perfectly paired with an ice cold beer. My second fav pie(yes I have two ) is the Diavolo pie nice and spicy", "author": "Margo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "The best Pizza In NYC!!!!\nI'm Italian and I can confirm that It doesn't get better than this.\nThin crust, super fresh sauce and Mozzarella, great topping selection.\nWine list has a lot of options of different Italian grape variates. \nExtensive cocktail list, even though we haven't tried any of the drinks, they seem solid.\nAmazing  Zeppole stuffed with Nutella and coated with sugar. Top notch Illy espresso and Capuccino. Overall good friendly service. The space it's cozy but small so you better get a reservation especially during the weekend.", "author": "Gianluigi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Had a bad outing, but after multiple returns need to update.  They really make a great pizza and the place is really nice for a quiet meal with the family.  I'd be careful on the delivery, but three trips to the restaurant have all been great.  Perfect neighborhood spot.", "author": "chuck s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "I've ordered delivery any times since Luzzo's opened, and the pizza has always come very quickly and in a delicious condition. I say delicious condition because often times this type of pizza does not travel well and can be a cold mess by the time it arrives. \n\nI go for the plain old margherita pizza every time, and it get me in my happy stomach spot every time. I will indeed branch out soon to some different pies, but not yet. \n\nThe salads aren't bad, but they are a bit pricey. I'm anxious to try the pasta!", "author": "Jamie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-09", "description": "Sweet and burnt pizza! Staff: 3 friendly ITALIAN guys and a terrible pizza maker... (italian also but absolutely unprofessional! !!! ) all the time with the phone in the hands... !! only be saved ... the \"hispanic\" guy never stop a moment and that made us pizza!!! My first and last time here!", "author": "Francesco C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "What a cute spot! Perfect for a nice day like yesterday and today. The owner is a friendly guy and his staff is laid back, yet knows their business. Great place to kick back and have a glass of wine or champagne while shooting the breeze for a few hours. I am looking forward to trying their patio the next time I go back.", "author": "William C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "This casual spot has terrific servers who don't wilt from the heat of the wood fired oven. Starting with artichoke hearts., a great arugula salad and inspired pasta dishes, a solid choice on Atlantic's restaurant row !", "author": "Diane B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "Stopped by last night for dinner. Ordered Linguine and it was sub-par. Pasta had no flavor, mussels/shrimp/squid weren't incorporating into the dish well. Tiny portion. Wish I had ordered pizza... it smelled great. Maybe I'll try that next time...", "author": "Bogdan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Delicious pizza! Fresh ingredients, thin but crispy crust, knowledgable staff, and great location. I will be going back often!", "author": "V P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-30", "description": "For $56 we had one pizza and one single chicken cutlet with a sliced tomato and few pieces of lettuce and the pizza was slightly burned. I've been here before but kept thinking I must be missing something. Stick to Grimaldi's, Juliana's or Dellarocco's on this end of Brooklyn, or go to Peppino's, Vesuvio's or Totonno's.", "author": "Jj D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "LOVE Luzzo's! I'm never disappointed when I visit this spot for lunch or dinner. The only complaint I have is that I wish the place were bigger! Does feel a bit boxy. Nonetheless, if you are looking for a delicious brick oven pizza, give this place a shot!", "author": "Elle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Great pizza.  Great nighttime view from front high top table.  Smooth music.  Reasonably priced for a nice place.   Really enjoyed it.  Thanks!", "author": "James E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Ordered from the pasta menu.  Excellent authentic Italian food.  The best part of the whole experience was the adorable woman whom I assume is an owner.", "author": "Linda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "THE best Italian food in Cobble Hill!  I've been here twice - each time I ordered the eggplant parmesan as an appetizer, and adored it each time.  The staff is really nice and attentive.  Five stars to this place!", "author": "Whitney W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "One of the best dinners I've had in a lonnnnnng time. The meatballs were incredible and the bufala mozzarella pizza was equally delicious. The tiramisu was great. Super friendly service and they even gave us free glasses of moscato as a lovely surprise. Highly recommend.", "author": "Alyssa G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Luzzo’s BK", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ahFz3QuNrUGFFusG7NNpSQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188556400"}