{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "We must have come at the wrong time, because we got an exceptionally rude server. He barked, complained that he was waiting for people to decide what they wanted, and whined to his fellow co-worker. The best part? He messed up my friend's order - gave her a bowl instead of a burrito - which she clearly ordered, if he was paying attention to said order and not being an all around jerk. She was so over the experience, that she didn't even correct him.\n\nIt wasn't even that packed when we were there, but that's not the point. Being overtly rude TO THE FACE of your customer and then messing up the order to top it off? I'm sorry, good food is not worth that treatment. Anywhere.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-25", "description": "This place CANNOT fulfill takeout orders correctly. I have ordered lunch here for my office many times (the food is good), and almost every time there is a forgotten item or incorrect order. I would estimate they prepared the order correctly ONE out of TEN times I have ordered. Really frustrating and annoying, can you get it together?", "author": "Robert L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Heard of Dos Toros for a long time and had a food itch one late Sunday night. I drove down town Brooklyn and caught this spot just before closing, and I gotta say it was worth it, more food and way more flavor that the other guy. Definitely must try.", "author": "Kerron S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "It looks like as Chipotle goes down, Dos Toros is continuing to grow. I saw an advertisement on the subway for this place and decided to check it out seeing that it was on the same block. \n\nWhen I went in, the staff greeted me and were ready to take my order. I couldn't decide what I wanted, so one of the servers offered me a sample of the steak. Since it was so good I ordered a burrito with steak, peppers, onions, corn, cheese, salsa verde, rice and pinto beans. All so delicious and yummy, definitely filling too.\n\nOverall the service was by far amazing and the staff is super friendly. I can't wait to return. Dos Toros you are a winner :)", "author": "Jelani R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "This is by far my favorite place to get lunch at while I'm at work. My go to is a chicken burrito with chips and guacamole on the side the only downside is that they no longer do cash which is kind of a bummer since not everyone that goes in has a card to use. They also don't have many seats to sit at and most of the times people sit there long after they're done eating( which is highly annoying) this location is most definitely a grab and go kinda spot.", "author": "Kayla S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Delish! I am a pretty devoted Chipotle fan but I think I may be changing my allegiance to Dos Toros now. All the food looked super fresh in the prep line. I had a combo burrito bowl/ salad. I love how they have FARRO as an option instead of rice. \nOverall tasty, fresh, and flavorful!", "author": "Bridget G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "A great alternative to Chipotle if you're feeling up for something different. Also props for going cashless -- it makes the line so much quicker.", "author": "Ben M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-02", "description": "I recently tried Dos Toros when I was in the area for business. The place is nice, clean and user friendly. There is not a lot of seating, but I was able to find a seat by the window to eat. The staff was nice and friendly and it had the feel and vibe of another popular mexican fast casual spot. \n\nI had the chicken burrito, and unfortunately, as I write this review, I cannot recall anything spectacular or memorable about the burrito. I guess that's the problem. While there were a lot of components to the burrito, it didn't really have any discernible flavor, it was like everything was a mixed up bag of flavors, without any standouts. I found the chicken to be dry and lacking flavor, which is likely why the sum of the parts was just not great.\n\nI did go late in the day so perhaps the food is better when it is busier, I would try it again, but with hesitation.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "Another well-executed* Dos Toros grand opening at yet another location, this one in the heart of Downtown BK in a spot that will likely do even before the scaffolding disappears. Staff was friendly and generous with the carne asada for the salad (oddly skimping on the much cheaper black beans and pico de gallo), but the guac was somehow already brown at 5:15 (folks likely assumed it wasn't part of the $1 promo) and their smoky salsa is just too tame/subtle to ever enhance the dish.\n\n*Two separate lines that helped with the abusers like the high schoolers in front of us who were eating their Dos Toros leftovers from visiting during the lunch promo window.", "author": "George C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "Stopped by on a Tuesday night to pick up some dinner to go. I'd never been inside a Dos Toros before, but had heard good things. \n\nVERY similar set up and menu to Chipotle. I like how they melt cheese directly onto your burrito. However, where Dos Toros fell short is their lack of corn . . I LOVE the corn that I can add to my Chipotle burrito and I mourned it's absence in this otherwise very good, very generous burrito.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "Good food and prices. The place is clean. The food is delicious better than chipotle.", "author": "Jocelyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Taiesha \u0026 Jeremy were so friendly and gave great service. Junior the manager has a great staff on his hands. This was my first time here and it's even better than Chipotle! I would definitely come back!", "author": "Estela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-05", "description": "My friend has been ranting and raving about how swell this place is. So given the opportunity I stopped in to buy a bowl. The food didn't change my life but it was just fine. I ate farro for the first time which was quite chewy but it grew on me. I can see me eating farro long term. The pork was way to salty for my liking. Overall, I would probably chose this place over Chipotle because it felt healthier. Though that could be due to my preconceived notions. Price wise its similar to its competition so I guess its personal preference.", "author": "Kirkland G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Let me start by saying that I can eat Mexican/Tex-Mex everyday. So when my coworker told me about this place I was immediately eager to try it. She described it as a higher quality version of chipotle and she was exactly right! \n\nThe ingredients were fresh and tasty. \nAlthough the lunch line was out of the door long, the service was quick and friendly.\nThe prices weren't cheap, yet affordable.\n\nI wish they had one closer to me in Brooklyn (Chipotle's around the corner, really every corner). Regardless, I'd definitely go again.", "author": "Toni B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-11", "description": "It's pretty much like a vaguely hipster Chipotle with slightly better tasting chicken and slightly higher prices, but also I didn't get norovirus!", "author": "Phebe H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "I haven't made any resolutions for the new year, but I am certain that if I did, getting E. Coli would NOT be on that list.  Because of this, I've had to bid adieu to my beloved Chipotle. Let's call a thing a thing.  Concept wise and aesthetically they basically bit off Chipotle's style so I might as well do a direct comparison based on the salad I ordered.\n\nEase of ordering: Equal\n\nSize of salad: Relatively equal.  \n\nPork: Softer and more flavorful than C\n\nChicken: A little dry. C is packed with more flavor\n\nLettuce: Not as fresh and crisp as C\n\nSalad dressing: More creamy and a bit tart. C's \n\nPrice Tag: D is a little less expensive\n\nAll in all, this is a pretty good option until my true love gets their act together.", "author": "Donna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "I have never been disappointed when I come here to order a burrito or a bowl. Everything is fresh, they don't cheap out on you, and you are greeted by awesome staffs that look like they paid above average salaries and they deserve it if they do. Probably better than Chipotle overall by staff, atmosphere, and the food quality itself. I'll be coming here more often when I get the chance over Chipotle.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "Cute spot , medium sized but not many seats . The staff is very nice . I ordered a \"Plato\" equivalent to a burrito bowl . It  was good but I've had better. The guacamole container is small , half the size of the chipotle one and about the same price I think . The \"Plato \" or \"bowl\" (the container ) the food is in is big but the servings of food is small , you can see from picture I posted . They serve yellow rice , it was pretty good. The food overall was a tad salty. But I would love to try the quesadillas next time !", "author": "Meka S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "I ordered a burrito(chicken) with everything that doesn't cost extra on it. The total after tax came out to be $9.75. It was HUGE, it was so big that I decided to weight it. It was almost two pounds.  The hot sauce was HOT( I had the extreme spicy sauce ) . My stomach is burning,  I am sweating,  and having a heart burn. But it was all so worth it.  The cashier was very nice, she smiled and asked me about my day.  I don't know how she managed to roll everything in to the tortilla, but she worked her magic and it came together nicely.", "author": "Angela J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-30", "description": "1/30/16 - So some time has passed and this dos toros looks to have finally got their set up together. 1 person making the order 1 person taking in the money so simple so brilliant finally!\n\nThe pound of beans they toss onto your order stopped by the person actually listening when I asked for less beans. Again amazing!\n\nLittle salty, but otherwise fine. I'll come back especially with chipotle having some issues.", "author": "Raymond T."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Dos Toros Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/tLxPTW0BKe7NxUAa9ztN_w/ls.jpg", "@type": "Restaurant", "telephone": "+13474973339"}