{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "In my opinion, and this to a lot of people is a BOLD statement, Dos Toros is better than Chipotle. There I said it. Why?\n1) Consistency: The food quality is there, the rice is never dry, the lettuce seems to be always fresh. At Chipotle, I have had inconsistency where the rice is dry and not the texture you want and the lettuce is rotten in the batch and was served to me.\n2) Value: You get larger portions than Chipotle does since it is not a publicly trading company and is only a NYC chain. Guac is extra? No problem, it's only 94 cents compared to a whooping $2.30 at Chipotle.\n3) Atmosphere: The employees are much friendlier and not trying to rush to make your order and get you out of the place. If you got questions, they'll help without the attitude.\n\nA plus: they serve quesadillas! And I'm a huge fan of quesadillas. Chipotle: kids menu?", "author": "Jian Cai Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "This is my go to place to grab a bite when I'm undecided on what to eat for lunch, especially since is close to work. The food has a fast turnaround, so you're guaranteed to have a fresh meal of each time you go regardless of the time of day. My favorite dish is the vegetarian plato.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-02", "description": "They are way overpriced and they are a little stingy on the amount of food that they give you and personality of a door knob.", "author": "Brigitte B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-20", "description": "The quality of the beef definitely seems better than Chipotle's, but the flavors aren't all there. \nThe rice lacks flavor, the corn lacks flavor and the meat lacks flavor. Even the guac tastes better at Chipotle :( Chipotle definitely beats Dos Toros in the flavor and price category. Dos Toros beats Chipotle in quality of beef.", "author": "Anita W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "First time here and omg...the burrito bowl is truly bangin...i will come back for sure. Just wished it had more searing", "author": "JBella P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "The chicken bowl is yummy with guacamole on the side. The style is similar to chipotle but better. I'd recommend.", "author": "Helen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-16", "description": "I thought queso meant cheese in Spanish.  This thing had two paper thin slices of cheese.  And I asked...\"is that all the cheese you get?\"  Yes was the answer.  Not happy.", "author": "Patrick O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "i just had a huge chicken burrito! i loved the flavor its light and healthy, you dont get that heavy feeling like other places.\nso good! will definitely come back for the salad :) \nthe guac is delicious!", "author": "Saba J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Grand Opening, the food was tasty and fresh. The burritos are tightly packed and enough for one person. The decor is rustic, with exposed brick and wood. Great service for the first day, even with a line out the door and down the block.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "Was in the neighborhood doing some shopping and passed by the restaurant and was told that Dos Toros served good food and was comparable to Chipotle. The one in the city is always packed with a line out of the door, so this was an opportunity to try the food in an empty restaurant. \n\nService was great. Asked what items and how much did I want in my burrito. This burrito was huge when I got it. Actually it was too much for me to eat. \n\nThe taste was decent maybe because I don't do spicy. All in all I enjoyed the meal and would recommend Dos Toros.", "author": "Elgin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "The baritone is excellent. They offer huge portions. The food is delicious and very filling. This place is great.", "author": "Sanayia N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "I stopped in after a dental appointment for a quick bite. I ordered a chicken burrito which was good. I had pinto beans, chicken, corn, crushed tomatoes, green peppers and guacamole for a extra 99 cents and shredded cheese. It was delicious and I finished the remainder the following day. I will definitely be going back.", "author": "T H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "I love the food here. It's cooked properly and they don't try to give you hypertension with the salt. My new favorite spot and they're way better than chipotle.", "author": "C C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "Not a lot of options available for vegetarians or non-meat eaters. would be nice if they offered a fish or shrimp option. if you love spicy, tell em, they will throw in habaneros or some really spicy peppers. i was blown away by the spiciness and loved every bite even though it left my mouth completely burnt lol", "author": "Mohammad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "I love this place I've been here a few times and it's awesome. Staff is friendly and the setting brings out the best in this place. I find the food better than chipotle too", "author": "Alex H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "OMG!!! I had this for the first time yesterday. It was excellent! My burrito fillings were layered nice and neatly so in every bite I tasted fresh deliciousness and had happy thoughts as I enjoyed my lunch! I took home guacamole and chips for my lil one and he loved loved it!", "author": "Isis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "They are not messin' around! The real deal. I was skeptical but damn they surprised me. Delicious. The staff at this location didn't seem se friendly. So no tip. Food is great! Their carne asada is killin'", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Do yourself a favor. EAT HERE! The serving lines at super quick. Even at lunch hour. They food is fresh and tasty. They don't nickel and dime so if you request extra rice more cheese etc. it's no big deal. They don't have it listed, but you can actually buy Dos Toros delicious rice as a side order. I like to get a quesadilla and side of rice to go. It's like having your favorite Tex mex meal but to-go. I wish they served margaritas. That would earn them 6 stars. Lol.", "author": "D B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-21", "description": "Got a burrito and it was good but damn they have no bathroom. What kind of bonafide restaurant doesn't have a restroom??", "author": "Mos M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-01", "description": "Dos Toros' story claims they are from SF, but it's hard to believe it when their burritos are small and it costs an extra $1 for a side of salsa/hot sauce. Taste is no different than Chipotle's burritos.", "author": "Scott G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Dos Toros Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/tLxPTW0BKe7NxUAa9ztN_w/ls.jpg", "@type": "Restaurant", "telephone": "+13474973339"}