{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Friendly staff providing timely, on-point customer service. The place is new and there is a lot of energy here. I've experienced attentive service every time I've been in, and, thanks to having an additional station available for rush hours, I've never seen a wait-on-line situation like we're all used to at certain taco/burrito places. \n\n* Great location: Court Street is convenient for a lot of people in range of the courthouse for lunch hour, or who go to the gym or attend school in Brooklyn Heights. Also a busy area on the weekends (grab a burrito after a movie at United Artists a few blocks away, or while shopping the Fulton Mall, or en route to Atlantic Terminal). \n* The burrito is neat, delicious, filling and not ridiculously oversized. Hard-to-beat $10 meal. \n** Also, a few bottled beer options available. Cheers", "author": "Abbi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "I've only had the carnitas quesadilla but it's amazing. I put so much stuff in it. It's basically a burrito. Even then it doesn't merit a 5 star rating what does is the service. The past three times I went the staff was so friendly. They always seem like they're having a good time and it makes the experience so much better.", "author": "Kathy W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "The chicken burrito was dry. The meat was dry, The black beans were hard and lacked seasoning. The corn chips were super, super salty. The guacamole was OK. Service was swift and efficient.", "author": "Ellis S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-28", "description": "The setup when you order at this new place is kind of weird. Starts in the middle and ends on the sides which made it kind of awkward not knowing where the line starts as there were two separate lines. Had the burrito \"bowl\" kind of wanted it to better than chipotle so it could be my new go to burrito bowl spot but what a disappointment. The rice tasted cold and texture was kind of hard, had the steak but there was nothing to rave about there. Didn't taste any of the smoky medium sauce. Overall the decor of the place was alright but the food is not on par.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "For a few months been seeing that Dos Toros was coming the area and was very excited to see the fast casual mexican open in downtown Brooklyn/Brooklyn Heights. If your familiar with BK Heights anyone knows there is a lack of flavorful food, its all boring dull Italian. Dos Toros has definitely filled my complaint for lack of good mexican in the area.\n\nI stopped in after the gym for a quick bite and quite impressed quality food, tasty, and great staff. Would be nice if Dos Toros would add Margarita or Sangria to their menu.", "author": "L J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "The food was fresh and delicious! A step better than Chipotle. It has this homemade taste to it. I always felt that Chipotle had this weird unnatural taste to it. I will go back and introduce this to my husband. The price is pretty decent. The place was clean and bright as well. The employees were pleasant to engage with. They were attentive and friendly.", "author": "Amy L."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Dos Toros Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/tLxPTW0BKe7NxUAa9ztN_w/ls.jpg", "@type": "Restaurant", "telephone": "+13474973339"}