{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "Being a taco lover I was excited to try this place but after trying I was very disappointed. I was charged nearly $7 for a steak taco which is nearly twice as expensive as the best taco spots in NYC and it was mostly filled lettuce and tomato and hardly any meat. My second taco which was one of their veggie tacos was supposed to include lots of veggies and mushrooms yet was filled mostly with lettuce and tomatoes and tiny diced pieces of and zucchini and no mushrooms whatsoever! The pork burrito my son had was better; the pork was flavorful but mostly filled with rice. I doubt I will bother trying this place again.", "author": "Ivelis P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "For years I never imagined I would find a place to compare to Chipotle.  I don't know what it is about that place but you can't help but love their burrito bowls and freshly made guac, right?  But then Dos Toros Taqueria opened up on Court St and the lunchtime game changed for me.\n\nHere's what I like about Dos Toros - they offer up really good portions of food full of flavor but somehow they keep it light feeling.  I don't know how they do that!  I felt good after stuffing a chicken salad with black beans, rice and a massive handful of cheese in my face at lunch the other day.  I went back to the office not worried that I'd be spending my afternoon popping Tums in order to ward off inevitable heartburn.  My salad from Dos Toros was light and fulfilling and just overall SO GOOD!  \n\nAnd you know what pushed them a step ahead of Chipotle in my book - their salsa's.  That verde is absolutely lovely.  And the smokey sauce, which I think is their mild salsa, I don't even have words for.  Give me an extra container of that to go and I'll be oh so happy.  The chips were really good too.  Chipotle totally has competition, y'all.\n\n\nA few random notes about this location specifically: \n+ Easy to get to from the 2/3/4/5 subways.\n+ Nice, bright space.\n+ Quick moving line, and it looks like they open two lines if/when its really crowded.\n+ Friendly staff behind the counter.\n+ Free water cups.\n+ Multiple seating options in the form of high top tables for 2, window seats for single diners, low tables that could probably be pushed together for a group of 4.", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-22", "description": "My experience was neither phenomenal nor terrible at Dos Toros. I was in the area completing a training for work and stopped in for lunch.  There aren't many burrito bars you can frequent in this area, so I took a chance. \n\nThe lunch hour brought many employees however,  the line moved fast. The staff moved fast but they did a poor job of helping explain options and offerings on the menu. Asking me \" U want cheese?\" Is not sufficient. I don't love my job but I try my best to be helpful and with a positive attitude. While food service isn't at the top of my list of careers, at least be polite without the overt SHADE sir. \n\nI sat near the door for 5 minutes and got up to leave because of the stupid fan blowing automatic air everytime someone walked in the door. Annoying!  \n\nThe burrito was packed to capacity with black beans, guacamole, a nice flavorful grilled chicken,  cheese and the works. You are asked if u like your sauce mild, medium or spicy. My chicken burrito kept me full the entire day and I enjoyed it. Nothing spectacular to mention about the overall experience.  Better than Chipotle yes, would I come back? No.", "author": "Marissa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-20", "description": "I eat at this place 3 times a week and all the employees at this location are very rude! The last time I went there I was thinking about what to get and was taking my time and the girl starts making faces at me ( so rude)  today I went there and the worker starts laughing at me I asked if there's a problem I wanted to leave the wrap and go. I don't recommend this location at all!", "author": "Kevin E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-15", "description": "Dos Toros does what chipotle does. They just do it with more aggressive flavors. For better or worse. Sometimes the flavors dont mesh. Other times they blow chipotle out the water. I would suggest guac because of this; it helps mesh all the flavors. What I really appreciate is their sauces. They are really good and the spicy sauce is ...wait for it... actually spicy. \n\nDefinitely worth a visit if you dont want to wait on chipotle lines or want a slightly different take on fast casual mexican", "author": "Charles K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-12", "description": "Funny that so many people are comparing Dos Toros to Chipotle) I never liked Chipotle and have always been a big fan of Dos. I've been going to the one on 14 st. for years and it's always been a solid 5 star. \nNow this guy.. Sadly this is the closest one to where I live. This location has always been fairly mediocre but my last visit deserved 1 star though. The service was fine btw - it's the food. I got two burritos, one steak and one veggie. Both were INSANELY oversalted. Sadly that's the only thing that comes to mind. The great taste that I'm used to wasn't there at all. \nI'm not sure who's in charge of controlling this, but they need to do some work for a change as this location is progressively getting worse. I know that Dos Toros has everything to be amazing, so this is just unacceptable. Taco Bell is better and it costs about half. \n\nSeriously, get your beans together.", "author": "Alexander K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "I really wanted to try their $1 burrito at the new location that opened on March 7th but the line was way too long so I didn't venture into Manhattan for that. Instead, I went to this one. The inside of the restaurant is clean, new and bright. The menu design is similar to Chipotle and you line up telling the workers how you would like to customize your burrito, bowl, etc. \n\nHonestly, I thought the ingredients and fillings for the burrito was a little salty. The meat I chose was chicken and I added guac. I couldn't taste the smokey sauce in the burrito. Overall, the burrito was alright and tasted fresh. You're better off going to a real Mexican restaurant for an authentic burrito.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "I am a firm Chipotle lover but after having lunch with a coworker here my allegiance has changed. \n\nI got the chicken bowl, first thing i noticed was the tasty Yellow rice, the chicken was perfectly grilled and not spicy, I like a bit of smokiness every now and then an their mild sauce is perfectly smoky. I did think they short you a bit on the sour cream and cheese but if you ask kindly for a bit more they will get it for you. \n\nWhile I would say my bowl was a little on the pricier side I understood why, my meal was perfect from first bite to last, i didn't feel gross and overly full after eating, all the ingredients tasted fresh and i was very satisfied with my meal.", "author": "Denise R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "Went for the first time after work and it was great.  Food was good.  Some of the nicest and most helpful service I've gotten at a fast food burrito place.", "author": "Kat K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-21", "description": "So I've gone to the Dos Toros location in the Upper Eastside before and because I had such a delicious experience there I decided to make my way over to the location in Brooklyn since it's closer to home. I'm fall into one of those weird categories where I'll go to a burrito shop but I really don't eat burritos (aka I can do without the essentials - rice \u0026 beans). \nI ordered a Chicken Burrito that came with: chicken, cheese, lettuce, tomatoes, sour cream and guac all wrapped up with some mild salsa on top. \n\nThe burrito as a whole was alright -- nothing too spectacular about it to be honest. But one thing that did stick out to me was the fact that the chicken was very chewy and I did not like that at all.  I've decided to give this location 3 stars solely off the strength of my palettes experience in the city and the customer service I received was A1.", "author": "Tabitha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "So happy that I stumbled upon Dos Toros. I've been to another location (on 4th avenue) so I'm familiar with the food. I decided to order the salad bowl with carnitas. They have farro now, so I decided to add that as well. I decided to get the medium spicy hot sauce (hot sauce spice level at Dos Toros is pretty true). The food was good but my carnitas were too salty (just like the carnitas I had at the other location). When I finished my meal, I didn't feel uncomfortably stuffed, just satisfied. Also, they give free cups of water--which you'll need after eating salty carnitas. They had a decent amount of seats available and I wasn't crowded (I came in around 5:15), perhaps it would get more crowded at around 7:00 pm. The staff was very cordial and they do a good job keeping this place clean. I think the next time I'm home, I'll either try a chicken or veggie salad bowl.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "Better than expected.  Burrito was very filling and tasty. Chicken was nicely seasoned and cooked. They also havd farro, if you want some carbs but don't want rice", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "The food here is fine.. I just think they're overly stingy about the guac.. I think they give only half a scoop of the guac instead of a full scoop. They're also very stingy about everything else such as the corn and peppers, they five like some what a okay amount of corn but the peppers... Normally I would say 5 pieces of the peppers and onions (this is 5 pieces all together ). They're also very expensive a steak salad with guac totals to about $13.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-24", "description": "As i entered this Fine establishment i noticed the menu at the top of the counter. i honestly didn't enjoy the food but the hospitality was amazing and service On point.. i'd take someone who loves burritos to Dos Toros..", "author": "Jayy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Dos Toros is my favorite place to grab quick Mexican food in the entire city. They don't cheap out on ingredients and the food is always fresh. The staff at the Brooklyn Heights location is super friendly too.\n\nI try to make it here once a week.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "Welcome to the neighborhood my beloved Mexican go-to!\n\nHow to order the most ideal meal:\n\nTacos: \nGet it crispy (they melt the cheese directly into the tortilla as it crisps. I'm melting just thinking about it)\nCarne asada\nToppings\nHot Sauce\nAdd the extra guacamole \n\nBurrito:\nRice (not vegetarian fyi)\nBlack beans\nCarne asada\nToppings\nHot Sauce\nAdd the extra guacamole \n\nPlato:\nRice\nBlack beans\nCarne asada\nSee if you can get some fajita for free by smiling\nToppings\nHot Sauce\nAdd the extra guacamole \n\nDo you see a trend? \nCarne asada is the best meat, always order guac, always smile.", "author": "Gina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Very good, pretty cheap tacos. The staff was very friendly and seemed to work hard to clean the establishment. I appreciate the multiple areas to sort for garbage, recycling, and compost. Additionally, there is a jug of water with cups and a bottle of hand sanitizer near the the napkin dispenser. I would just say the chips for the chips 'n guac are just a bit too salty.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Dos Toros is vastly superior to their brainless competitor by the name of Chipotle. I love this location especially. The decor is on point and the food is high quality at a fair price (as usual) \n\nDid I mention that everyone at any Dos Toros actually KNOW how to wrap a burrito! I know its amazing! They actually know how to wrap a burrito without breaking it! Here are three words I never hear: \"NEED A REWRAP!\"", "author": "Richard S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Hands down, the best vegetarian burrito in downtown Brooklyn.  The ingredients are fresh, the staff is courteous and they know how to wrap a burrito. Chipotle, who?", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-13", "description": "This place absolutely does not live up to it's hype. I got the veggie burrito. It was overall flavorless \u0026 tasted like fake cultural food. The only good thing was the guacamole hence why they got two stars. Granted, I am a vegetarian and there might be good meat and that could bring the meal together but for a place without a substitute the meatless meal should still be good. Will be paying the extra dollar at Chipotle next time.", "author": "Dyquan W."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Dos Toros Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/tLxPTW0BKe7NxUAa9ztN_w/ls.jpg", "@type": "Restaurant", "telephone": "+13474973339"}