{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "I don't believe I've ever had a bad experience here. For the most part they are consistent. There are times where they may skimp on the food, which is why I avoid when it's very busy. \n\nTheir burritos are some of the best in NYC. I'm sure there are other amazing burrito places, but considering this is a chain restaurant, the food is always fresh. You can't go wrong with Dos Toros. Even their chips are great.\n\nPlus they have free water and hand sanitizer.", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-06", "description": "So I was sooo disappointed by my meal. I didn't feel like walking to chipotle and I've never tried the food from here before, so I took a leap of faith. All I can say was never again. The food tastes like nothing. They say grilled food so I'm expecting to taste charred well seasoned food. Yea no not the case. I got a bowl and the girl was SO STINGY with the rice. She put half a spoon, I was like umm can I get more rice please!?!? I got it with steak, and everything on top and I got guac. When I got to my office and sat down to eat I could cry. The corn is boiled the fajita is sautéd in oil and the rice wouldn't know what flavor was if it got smacked across the face. I got full because the food was so bland. It wasn't even ok. This place makes chipotle taste like gourmet Mexican food  the steak didn't even have salt on it. I've never had such bad/ bland Mexican in my life. And the owners said this is based off their love of Cali Mexican food? No shade but this ain't it chief. And the guac isn't good.... it's just avocados with salt!?!?!? Also I think it's really sus that only elite yelpers left good reviews, and all the pics on the yelp page are of influencers not people taking pics of their means . Maybe it was a bad day but y'all decide if you wanna go. Ok I'm done ranting\n\n\nUPDATE: I now have food poisoning. After I ate I had a horrible upset stomach and have been stuck in the bathroom ever since", "author": "Efa O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-13", "description": "I usually come to this location for lunch with my friends.  \n1. In occasion we came here, 2 people were taking up seats and eating food from subways. I dont understand why the staff didnt tell these ladies to leave as many restaurant owners/staff would. \n\n2. Yesterday 12/12/2018, and it was just an annoying experience. I'm the type of person who usually speaks up specially when theres bullshit given. I ordered a no cheese quesadilla and TWICE I asked the lady to add extra steak id obviously pay for it but she tells me \"its portion control\" as if I give two fucks. My friend said she'd be offended but I had no time to waste. One of my friends got the platter with rice and it had a smell. Like if the rice was expired.  She feels sick today. I usually let things slide but this really bothered me.  We're not coming back to this location again.", "author": "C R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-29", "description": "So, although my first experience wasn't exactly what I would've liked \u0026 I said I wouldn't return, since it's so close to me \u0026 I didn't feel like walking to Chipotle which is further, I came here. Unfortunately, nothing has changed except now they've gotten creative with the distribution of the guacamole \u0026 sour cream. Instead of putting the spoon a quarter inch in, they now dip it in a quarter inch, but tap the spoon down the bowl to make it seem like it's more than it is lol I can't make this stuff up. Stick a fork in me, I'm done!", "author": "Felicia I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-16", "description": "Hmm I have a love/hate relationship with this place. When I first started work around the area about 2.5 years ago this was my favorite spot to go to and I would come here to really treat myself. The portions use to be generous and the size of the bowls were a good size. What really makes this place good is the habanero sauce which has a really strong quick and very tasty. I witnessed this place kind of go down hill for multiple reasons. I think they changed the size of the bowl ? Also past couple times I came they really were less than generous on the meat scoops. Also they don't take cash ? I never heard of a establishment that does that lol. I use to rave about this place to all my friend that didn't work in the city but now I feel like it's noting to rave about and is on the same level as chipotle.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "Immediately as i started ordering i was wondering if it was too late to find the nearest chipotle.. these guys have smaller bowls, less options and just no... Then to top it all off they dont take cash.. everything from the moment this guy asked me what am i having just went down hill.. \n\nEmployee: Hi what would u like rice or farro.. (wateva the fuck farro is)\n\nMe: rice or what? What is that? As i look for brown rice\n\nEmployee: rice or farro sir?\n\nMe: just give me that stuff \n\nEmployee: black or pinto?\n\nMe: black beans, with chicken do you guys have fajita veggies? (I assumed it was in supposed to be inone of the 3 empty spots)\n\nEmployee: what?! No i dont even know what that is.. you want any hotsauce?\n\nMe: no just guac\n\nEmployee: thats extra\n\nMe: thats fine\n\nCashier: $11.15\n\nMe: *takes out a bunch of cash finds a 10 finds a 5.. folds cash puts the rest in wallet, hands cashier cash*\n\nCashier: we dont take cash\n\nMe:....................*hands debit card*...............is there a chipotle nearby?\n\nThe bowl was probably better than i will gice it credit for butbi couldnt enjoy it how i wanted to because of the process getting it. Last time here for me. #ImGoodLuvEnjoy", "author": "Delando W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "I love Dos Toros Taqueria because they serve massive burritos!  omg the best option food when you're reallyyyy hungry. Honestly is so stuffed that the burrito is heavy. \n\nSuper yummy! \n\nI came at 11 am and the location was empty, nice and easy haha, will come again!", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "New Tex Mex place by work that the guys wanted to try out so I left my lunch I brought in the fridge and headed there. Walking in here and all you see is a line a long line. But the line moves quick and I am at the counter already. I order the bowl add rice and off to the meat selection. The steak looked the best so that's what I went with. Next line over I add lettuce , pico, cheese, guacamole and sour cream. Next station is to pay and asks if I want chips. So of course I get the chips and quac. When I went to pay they said they don't accept cash - what??!!?! It's crazy how many places are cashless these days. \nI grab my food and head back to work, everything is pretty good and on par with chipotle but this place has better quac by far. Not a bad meal overall but it lost a punt for not accepting cash.", "author": "Nick C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Always a delicious option.  I'm so happy I stopped in. This is my 2nd or 3rd time at this location and great.", "author": "Doris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Chipotle without the copious amounts of salt! Now if only we could get a Qdoba that doesn't charge extra for guac...but I digress.\n\nI think I prefer the rice here because it has more flavor than cilantro lime rice.\n\nI stopped in while in the area. It's a shame there's no locations near me because I really do like Dos Toros better! (come uptown to Riverdale and give the Chipotle on 238th Street some competition!)\n\nSome more salsa variety would be nice but overall there's not much to complain about with my standard carnitas bowl!", "author": "Heather C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-14", "description": "Food good, staff is dope, ambience is cool and Place is clean can't complain  now I see what my lady love to go here for lunch", "author": "Flī G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "I am probably the odd ball out in the smashing reviews, buhhhh I don't think the food is that good. I have tried the burritos on two occasions and I personally feel the food lacks seasoning, it's just \"okay\". The service is pretty basic nothing to write home about, the layout is similar to that of chipotle you choose your base, your meat, beans etc.... and there you have it a Burrito, Salad, Taco etc. I can't say I recommend this place but give it a try all of our taste buds are different !", "author": "Andria A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "I like you, Dos Toros. \n\nYou cook tasty Mexican food, and allow me to purchase it at an affordable price. All your meat is 100% naturally raised (it says so on your signs). I'm not sure what the regulations are in order for you to say that, but the fact that you care at least a little bit...that's a step in the right direction. And even if you run out of pork later in the evening, I'm glad you're here on Court for me to stop and stuff my face after a soccer game.\n\nAll that said, I have a specific bone to pick with you, and it's that we have different definitions of quesadillas. \n\nMine are very cheesy affairs that you load up with a bunch of stuff and then press on the grill. Yours are slightly cheesy tortillas that you grill, and THEN load up with a bunch of stuff and fold over. I'm not sure which one of us is right (I'm right, because more cheese is always right), but luckily, both taste good. \n\nSo I'll see you soon.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-14", "description": "Love Mexican food, but these place is not so Mexican, often really salty food and uncooked meat  is what I see when I order the food. Also the hot sauce they use often give me a bad heartburn.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "I think I might have cheated on Chipotle... and I think I like it...\nNo no no. Chipotle will always have a place in my heart but Dos Toros is sooo damn good!!!\n\nI think if you want Americanized Mexican fast food, you get Chipotle which is great! But if you want authentic Mexican fast food, you have to get Dos Toros. The rice is super soft and flavorful, the toppings are all fresh and flavored. The steak here is actually tender and quite juicy. The hot sauce is actually spicy(good thing). Also!!! the guac is only $1 extra!!! Can't go wrong with guac. \n\nI don't think I'll ever stop eating chipotle but I think my life just got exponentially harder after trying Dos Toros.", "author": "John T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "Waaaayyy better than Chipotle. Fresh ingredients and delicious food without a chemical taste. \n\nI visit Dos Toros at least once a week for lunch and I have yet to be disappointed. It can get crowded around lunch time but the line moves fast. \n\nI wish this location and more seating but overall, I had a great experience.", "author": "R C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Tried their tacos, which were delicious. Saw the burritos, which looked awesome, so will probably try next time.  Good choice for a fast-casual taco place and a quick lunch.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-10", "description": "Raise prices and give me less meat? Honestly I don't know what's wrong with this location. They're extremely stingy. Probably not coming to this location again. The food is good though, if they actually give you any.", "author": "Anton D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "I had ordered here via Grubhub a few months ago and the burritos were mediocre. I came in today (Sunday) to give it a second chance, but they had a huge sign stating that they dont accept cash. WHY WOULD YOU TURN DOWN MONEY DURING OPERATING HOURS?!?! I'm definitely never coming back here, nor would I ever recommend this restaurant to anyone.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Maybe I was just hungry but that was a really great burrito. I couldn't really taste the guac so it wasn't really worth the extra $1.85 but the burrito was still great! It wasn't dry at all and was very filling! I'd come here again.", "author": "Dina H."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Dos Toros Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "64 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/tLxPTW0BKe7NxUAa9ztN_w/ls.jpg", "@type": "Restaurant", "telephone": "+13474973339"}