{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Definitely lives up to the hype. I'm not a huge pizza person but I thought it was maybe the best I had. Will return, even with the line and limited seating.", "author": "Navid V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Eggcelent pizza!!!  Must try egg topping if you order No.1.  It's 18 inch pizza, good for 2 people.  Very delicious and wanna come back again when I visit NY.", "author": "Ak S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-28", "description": "Coming from the West Coast, where a good pizza is hard to come by, I was very excited to try Juliana's so that I could say I've eaten the best pizza in the world.  As you can tell by my two stars, I didn't find it that day.  \nFirst, we waited in line on a Sunday around 5PM.  It started to rain while we were in line and I think all the guests inside therefore lingered. It was almost 6:00 before we were seated.  I ordered an Arnold Palmer for my drink and it had a very bizarre taste to it - almost like there was celery salt in it.  Then came our caesar salad - what was that dressing??? It was vinegary and not at all creamy.  Everyone at our table gave it the thumbs down.  My husband and I had sausage and mushroom pizza.  It came out hot and the first piece was fine, but wasn't the mind-blowing slice I was looking for.  By the time I got to the second piece and it had been sitting on the tin plate, the crust was now soft, not crispy.  Our kids ordered half pepperoni/half cheese.  We told the waiter to put a full amount of pepperoni on the one half and to charge us accordingly.  What a joke - the side with the pepperoni was so skimpy.  There is no way they  followed our request.   \nLastly, super loud in there.  After standing outside in the rain for almost an hour, it was not the atmosphere I was in the mood for.  \nDON'T FALL PREY TO THE HYPE!!", "author": "Sydney C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "The OG Grimaldi! \n\nDidn't know at first until I walked into Grimaldi. The guy greeting the guests happened to be an a**hole. Then we walked next door to Juliana's to find out this is THE SPOT.", "author": "Mitchell P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Wow what an experience. Worth the wait. We had the margarita pizza and the #6. Davids service was amazing. Thank you for all the great advice your genuine help. Loved this place. Oh by the way have to have the ice cream.", "author": "Indio U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Their pizza was tasty, especially when you added prosciutto, garlic and mushroom on top. The service was very friendly and fast. Will come back for more!", "author": "Hoa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "Very few people love pizza more than me so I feel that I'm well qualified with rating Juliana's Pizzeria a solid 4.5/5 stars. We ordered a half margehrita and half pepperoni pizza so that we enrich our taste buds with a wider taste pallette and boy it didn't disappoint. We paired it with a couple of Brooklyn Lager brews (wish we had these beers in SoCal) for even a more fulfilling experience. \n\nHighly recommend this place but I suggest you get there either before 5 PM or after 7:30PM to beat the long wait times.", "author": "Julian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "All in all the pizza was really good. I thought the sauce was a tad bit too acidic, but other than that I enjoyed it.", "author": "Nick W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-29", "description": "I was really excited to try Juliana's Pizza - \"original grimaldis?\"  Anyway, the experience I had here was awful!  Right off the bat, the server was pretty rude and it didn't seemed like he liked working there, but hobbled around doing his job.  I was asking about the menu but he was totally not helpful at all!  The pizza we ordered was good right when it came out, but after the first slice it was completely soggy!  Not sure if everyone else was experiencing the same thing, but it was awful!  I would not be back after being treated like that and with a soggy pizza, that made everything worse.", "author": "Betty H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Loved it. Super tasty pizza, pretty classical but with a light base. Fresh tasty toppings - try the sausage with fennel. Queued but moved pretty quick. Friendly staff. Be aware that they close at 3:15pm for 45mins to re-stoke the coal oven!", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Their pizza is delicious. I could just leave it at that but I can't. We ordered a number one, their best seller. Man the taste explosion alone was worth the 40 minute wait in line to get in. The pizza is clean and light (hard to usually say about pizza) and tastes great. Big fan of the green onion accent on the pizza.\n\nI should say though, now that I've eaten in, next time I might order take out if the line was as long as it was. The dine in experience good, but not anything special. The wait staff was very nice and quick.", "author": "Matt N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "I'm slightly disappointed that I couldn't give a 5 star rating. This used to be my favorite pizza spot in NY, but now I'm not too sure.\n\nI ordered the meatballs as a side dish and was very disappointed. It came VERY quickly, I'm talking 2 mins after ordering quick! It was dry inside and barely lukewarm. My husband tasted it and told me that my meatball recipe was better!\n\nFor pizza, I ordered the Special No.4. It was great, I'm glad they still can still whip out flavorful pies. However, it was also a bit on the cold side, and thicker than I remember. \n\nI came during lunch on a weekday when there were no lines, maybe that explains why the food was not as great? In any case, still great pizza, still fantastic service, so overall I'm happy. Now to check out the new Grimaldi's and compare!", "author": "Irene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Ordered a large Margherita pizza, with mushroom, garlic, and anchovies. I personally thought the pizza was really good. It came in thin crusted, and maybe burnt a little bit. My sisters thought it was alright.", "author": "Eric C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "Being hungover from the night before, and felt too sick to eat anything at Smorgasburg. But then, of course, right after we left, I started to work up an appetite. On heading back towards the Brooklyn Bridge, we passed by Julianna's Pizza. This was one of the places on our NYC hit list, but was eventually slashed since we had too little time. But I hadn't eaten yet, and the pizza place was right there...\n\nGrimaldi's was first located in the current Julianna's restaurant. In 2011 it became Julianna's. I haven't been to Grimaldi's yet, but it's the same people that own it. If there were no line at Julianna's, I would definitely take the opportunity to eat here than wait eternity at Grimaldi's. \n\nWe walked in around 11:30 and the restaurant was full. We asked how long the wait would be for two people, and they said we could be seated right away. How about that! Perfect timing. We ended up ordering the Margherita pizza. We kind of didn't want anything big, since I wasn't sure how much I could eat, and my bf had just eaten.\n\nWaiter: (holding out notepad) What can I get for you?\nMe: A small margherita pizza.\nWaiter: (puts down notepad) You're not going to get any toppings?\nMe: Should we get toppings? What should we put on top?\nWaiter: Housemade Meatballs are popular here.\n\nPretty funny...the waiter was in disbelief when we were going to order a \"gasp\" plain margherita pizza!!  His suggestion was wonderful though - housemade meatballs were a hit. But the pizza sauce and crust was amazing too. The sauce was very sweet, the perfect combo with the mozzarella cheese and basil sprinkled on top. The cheese was so yummy...just very fresh since it was housemade. You could really taste the difference between this and any old regular mozzarella from another pizza joint. We ended up eating almost the whole pizza, leaving 1-2 slices. Not bad for one girl and one guy who wasn't hungry! The small pizza was HUGE - we thought it was a mistake when it came to our table, but it was indeed a small!\n\nService here was so nice. They made us feel at home, treated us like family, even though we were from SF! Not sure where the rude New Yorker stereotype comes from. Also, at end of our meal, we wanted to walk on the Brooklyn Bridge. We asked our waiter for directions, and he actually walked outside the restaurant with us, and pointed specifically where to go. All of the workers did that, actually, very sweet! I'm guessing they get a lot of tourists.\n\nA line formed by the time we walked out the door. Get there early!!!", "author": "Jocelyn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "Quite delicious! I came with two others and we ordered a margherita pizza and it was great! Good sauce flavor, not too much cheese, but the middle was a tad soggy. Quite good though, and friendly service too. The line was maybe 10-15 minutes but it's worth the wait! Pizzas come out pretty fast and we could actually see them making it! Definitely recommend; post-tax for the pizza was about $18 which is too bad for the size and quality!", "author": "Andrea W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Had a great day with the wife and kids\nTook the east river ferry from the city to the Brooklyn bridge \n\nHad a couple of beers and ice cream for the kids under the bridge \n\nWalked up the block to Julianna's got right in---not always the case\n\nHad the large pie with prosciutto and arugula---to die for \n\nHad 2 cold blue moons hit the spot \n\nLastly we ordered the Brookie ice cream sandwich it was awesome \n\nOur waiter was great friendly and very attentive", "author": "Bobby D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Hands down the most delicious pizza I've ever had the chance to eat. I've been here a couple of times and can't wait to go back in the future. All of the specialty pizzas are great! I'm sure you can't go wrong with anything on the menu. The service is also very friendly and welcoming. You can also get a pretty awesome view of the Brooklyn Bridge and lower Manhattan after enjoying a pie at this wonderful place.", "author": "Jess M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Hands down-best coal oven pizza. Everything from the dough to the sauce to the cheese just works. If you watch the pizzaiolos working you can see they love their job as well, \u0026 this translates into their pies! We visited 12 pizzerias in 3 days, \u0026 once we ate here we knew we were done. This one was the best! Oh so goo!", "author": "Amy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "Got there just after noon on a recent Saturday.  Waited 5 minutes for a table for two.  Big line by the time we left.  The Caesar Salad was better than it had to be next to some of the best pizza you can find in New York City.  Definitely add pepperoni to your pie if you're a fan.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Highly recommend this place! Worth the mini trek over to Brooklyn for Patsy Grimaldi's pizza. No one does NY pizza like this place. It was amazing! My friend and I devoured their margherita pizza and spaghetti and meatballs in one sitting. You can see them make and bake the pizzas inside. The downside to this place is they don't take reservations and it's hard to come here with a large group, or more than 3 people. You need to get here early to avoid the long lines.", "author": "Julianne H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}