{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "Great Pizza. Great service. They pay attention to the details. The Draft Beer is cold and served in the proper branded glass. The pizza was great. We had Margarita pizza with meatballs and mushrooms. Crispy crust and delicious sauce. Good job. If you are in the area, well worth it. And the service is pleasant and professional .", "author": "Kenneth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "A bit pricey, but you get what you pay for! We got here at 11:25am (5 minutes before they opened on a Saturday) and there was no line yet which was nice. Even better than the Grimaldi's at this location, the pizza was super tasty and service was friendly and prompt. We shared a small pepperoni, sausage and onion pizza and everything about it was wonderful. The meat was plentiful and the onions still had a bit of firmness that you could still get a bit of bite to it. Sauce was tasty and the crust was perfectly cooked and flavorful on its own. I definitely recommend!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "Amazing pizzas, Great salads, great welcome :) Everything could have been perfect but what is this sparkling water at $8? Too agressive and not tasty, that could take away the flavor of the amazing food.\nThanks :)", "author": "Elliott R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-09", "description": "Had to eat here after an adjoining pizza place was incredibly busy. Disappointment reigns as our margarita pie was just ok. There was some spicy thing going on in the sauce that I did not like. The crust was just a tad dry. Overall taste was also just ok.   My 2 stars is harsh as it's way better than your average pizza place.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Ah Juliana!. We shared a peperoni pie recently, and it was the real deal. Fabulous! Can't wait to get back. In the meantime, where I live, nobody is really any better than Little Caesar's.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Delicious. No. 4 pizza was great. You will clear your plate. Service was good. Great place to stop after walking across the bridge.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "After trekking across the Brooklyn Bridge we were hungry and figured we might as well continue the tourist experience and grab some pizza. I grew up in Chicago, lived in NYC for 5 years and now am in DC where the pizza is generally below average, so I was excited to get some real Italian pizza. Even at 2:30pm the lines at both Grimaldi's and Juliana's were long, so we committed to Juliana's since the reviews were slightly better. After waiting about 10 minutes in line, an employee popped outside to let everyone know they stop seating tables at 3:15pm to reheat the ovens. I really appreciated the heads up instead of waiting in line and getting turned away later. It was such a beautiful day we opted to place a to-go order and snagged a table outside in the pedestrian area on the street. The pizza was ready after only 15 minutes and it was amazing. Seriously, I haven't been able to get good Italian sausage with fennel in years! The mozzarella was fresh, the tomatoes sauce actually tasted like tomatoes and there was the perfect amount of crust (about 3/4\"). I would go back in a heart beat next time I'm visiting NY.", "author": "Sydney L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-21", "description": "Below expectations. Margherita pizza is nice everything else wasn't worth the wait or price.", "author": "Vaibhav S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Went at 11:30 on a Monday and didn't have to wait outside at all. Got a Margherita Pie and it was amazing.", "author": "Tom F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-08", "description": "I am biased because I just love a normal regular slice from most NY pizzerias.  Dropped by here because of all the hype.  Waited for 30 minutes among other tourists and finally got seated.  We ordered a specialty pizza with bacon on it.  The pizza was just ok for me, with an overwhelming bacon taste.  I wasn't a fan of the dough...could've been more crunchy.", "author": "Annie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-07", "description": "Nickle and dimed... And the tomato sauce was watery (see other reviews). Re the nickel and diming....Wife is allergic to cheese. Wanted to get Margarita pizza with cheese on half or light cheese on half for $16. Instead, server insisted we do marinara pizza and add cheese on half but pay for full price to add cheese to entire pizza to make grand total $22. Not a big deal but kinda a dumb solution.  I specifically asked why and showed her the numbers (Paying way more and getting way less) and she said \"that's how we have to do it\". Good food but that's lame service. Would've been 3 star review without this issue anyway. Try grimaldis next door", "author": "Jon T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "We have been here two times and really enjoy the friendly service we got. We live in the neighborhood and have always wondered how Grimaldi's survived with the extremely rude service. The pizza was really good at Juliana's. The crust is a little thicker than Grimaldi's. The atmosphere is much cozier too. I love the jukebox. We will be back! Keep it up Patsy!", "author": "Megan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "I love this place great menu and fresh ingredients!! Wish the staff were alittle more attentive considering we barely had water during our meal", "author": "Ida F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "Owned by the original Patsy Grimaldi (who founded and then sold Grimaldi's), this is the real deal and as good as pizza gets. It reminds me of Grimaldi's back when Pasty ran the joint: the best crust and sauce on any pizza anywhere, and a genuine welcome when you eat there. Skip the lines at Grimaldi's, where they treat you like you're lucky to get in, and stick with the original, where Patsy and Carol will welcome you and serve you amazing pizza.", "author": "Heidi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Great Pizza and staff except for manager. Place was cold. Asked for ac to be turned down but was refused. Pizza got cold real quick. Saw Patsy outside later. Was real nice and told his manager outside who had a real attitude and just said \" yea right\"  So even though pizza is good I wont be back as I like my pizza hot and don't like nasty managers\nO yea the place wrote on my FB review that NY summers are really hot. Well I am from NY and there is a thing on ACs now called climate control", "author": "Saul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "I went here with a friend last night (after learning that the original Grimaldi's owners opened Juliana's in the old location and the current owners of the \"Grimaldi's\" chain aren't the same).  So I was expecting the delicious thin crust brick oven pizza that made Grimaldi's famous as one of the best pizzas in the city, and Juliana's did not disappoint!  We finished off our two small pies and salad with a cannoli and a brookie to share (a brownie cookie - who can argue with that)!  The service was great, there was a bit of a wait since there were a few tables seated right before us but the pizza was worth waiting for!  If you're looking for authentic pizza made by the original Grimaldi family, skip the line at the chain on the corner and come here!", "author": "melissa z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "Oh my. Perfection. We came here one evening since we were in the area.  We were going to go to Grimaldis, but it was a gorgeous night and there was a long line. Juliana's had 2 people waiting for a table so we were in there. We were seated very quickly at a 2 seater table.  It was small but enough for us to have all our food and drinks and not be squished. We order a small margarita pizza and 2 sodas. We did wait about 20 minutes or so for the pizza to be made and we ordered 2 Ommegang witte beers while we were waiting. So yummy! There was a hint of orange in this beer, but not enough to be overwhelming. When the pizza arrived it was everything I wanted and was totally worth the wait.  The slices were huge for a small pizza but we still managed to finish the whole pie. It was delicious! If I had to compare it is slight better than Grimaldis.  The crust was crisp but not burnt and the flavors of the sauce, cheese, and basil melded together perfectly.  Our waitress was super sweet and funny, and checked in with us enough while we were waiting for our food.  Overall it was a first class experience with amazing pizza and I can't wait to go back.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "Like many have mentioned before me Patsy, the original owner of Grimaldi's who got muscled out, is the owner of Juliana's and he came out and greeted us after we had our pizza. Such a nice guy and a really great staff. However, what really matters is the pizza and it was amazing! Best pizza we had while in NY. Skip the line at Grimaldi's and get the original at Juliana's.", "author": "Zastruga Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "I wish I could give this place 5 stars, but my girlfriend and I just encountered too service issues when we went for lunch Sunday.\n\nWe walked into the restaurant that afternoon and were rudely hushed out by the hostess who said the line was outside.  She was extremely condescending in explaining to wait process to us.  Even the couple next to us was shocked at how rude she was.  When we were finally seated and ordered, it took forever to receive our food!  The couple next to us were seated about 10 minutes after us and they received their food, finished, paid, and left the restaurant before we received our food!  Maybe there was a mishap in this kitchen.  No big deal, at least some acknowledgment from the waitress would have been nice though.  She clearly saw me looking impatient after about 40 minutes but never came over.\n\nThe pizza was amazing and some of the best I have had in NYC.  I will definitely be back because of the pizza.", "author": "Eddie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "Awesome Pizza!! White pie is great with lots of garlic. Yum~~getting hungry just thinking about it!", "author": "Sophia T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}