{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "On our first night in NY we decided we wanted to go for a walk and stretch our legs. We ended up crossing the Brooklyn Bridge and decided to try Juliana's. We were always told there was generally a long wait, however as it was later on in the evening on a Tuesday we were able to walk right in. We had great service and felt very comfortable. We weren't overly hungry and ordered a small pizza with meatballs and onions. Turns out the \"small\" is 16\". We figured most would go to waste but boy were we wrong! After our first bites we inhaled the rest of the pizza. I've read a few complaints on here but our pizza was nothing like they describe - it was juicy, full of flavor and hot with a perfect amount of toppings. We talked about this pizza the rest of the trip!", "author": "Tammy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Good Pie, still stay true to my slice back in Boston but this place was good. Nice atmosphere and nice little area by the bridge. Would definitely go back for a slice when back in the area.", "author": "Josh W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Juliana's was everything I expected from NY pizza. We ordered to go and ate on the pier just a few feet from the restaurant. I was expecting a delicious pizza based on these Yelp reviews and was not disappointed. We ordered a margharita with sausage and it was superb. The small fed three of us to the point in which we were all full and had to walk it off. Highly recommend ordering to go in advance as the line can get really long during peak hours.", "author": "Kayla N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "I had been waiting for months for Juliana's to open-- dying to see how The Patsy Grimaldi made his pies in the original coal oven! I came during their first week for lunch and at first was nervous when I saw a line down the block (phew, it was just for Grimaldis)! We went in and were seated immediately. \n\nThe place itself was completely redone and no longer even slightly resembles how it used to look when Grimaldis was here. It's much more open/spacious and has a more upscale feel. I love that I don't have to rub elbows with my neighbor and can actually hear my dining partner! I must admit, it does feel a little cold-- I guess I had been expecting a more \"homey feel\" but that's just a personal preference. They do accept plastic = AWESOME!\n\nThe waitstaff were all friendly, but it was the first week so I won't critique the service just yet. Once seated, Patsy  came over to the table to introduce himself and told us he couldn't wait to see how we enjoyed his pies! I was very impressed that he took the time to talk and seemed to generally care about the community's opinion of the restaurant which is in stark contrast to the other restaurants in the area that just move you in and out and only care about tourists (cough, Grimaldis). \n\nWe went with the small margherita pizza (it was the perfect size to be split with two)-- I always like to try the classic when trying out a new pizza joint. Patsy Grimaldi delivered! The pizza was amazing-- the crust was a bit thicker/more doughy than I had expected but was still light and airy with the perfect amount of charred crust (coal oven, how I love you so!), the sauce was perfect and fresh, the mozzarella was placed in perfect portions. Basically, it was perfect! So perfect, in fact, that I couldn't resist getting another pie to go the next night on my way home for dinner!  \n\nTourists can keep waiting in line for Grimaldis, I'll take the better option at Julianas any day of the week.", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Simply the fantastic pizza. Had to wait a while as there was was a queue but well worth it.\n\nServers were all really friendly and did everything they could to make the experience good. \n\nWill definitely come again when in the city.", "author": "Shane O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "After a damn long time, I finally made it to this place. The pizza was great, our server was wonderful, I loved the music, and was overall very pleased. Having gone to Grimaldi's for so long, I figured I'd give Patsy's own place a chance too. Well worth it, to the point where I think I prefer this place to Grimaldi's now. The prices are a little higher from what my memory recalls, but it's nothing bank breaking, and well worth it. The place was packed when we went (I think it was a Friday or Saturday) and we waited about 20 minutes, but that's typical for a joint like this. Will be back again.", "author": "Kseniya U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "There are the best pizza I've eaten in NY. There is a line to get a table, but it's not too long and the waiting worth it !!", "author": "Alicia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "First time in NY, just popped in cause we were hungry. Fed 5 people for 20 bucks!! Delicious Margaretta pizza!! Cute place, but very crowded in a Tuesday night!!", "author": "Cassie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-15", "description": "Great pizza but unfortunately they don't sell by the slice which is what you would expect to find in Brooklyn?? So .. but I've had better pizza in brooklyn", "author": "Alanna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "You can read about the history of Juliana's from the other reviews or you can Google it but simply put, this was the best pizza I've ever had. Me and my girlfriend split the large #1 and it was an incredible pizza. It was really filling and we had a slice left over for breakfast the next morning (still delicious of course). If your're looking for the best NYC pizza, make the trip to Brooklyn and try Juliana's. As a bonus, the line for JuliIana's was much shorter than the one for Grimaldi's next to it.", "author": "Steven N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "I came to Julianna's because of the Yelp reviews saying that their pizza was the original Grimaldi's. Patsy Grimaldi was at the front of the restaurant and greeted us. The whole experience was great. We ordered a Margherita with prosciutto on top. Simply amazing. Patsy came to talk to us and was ecstatic to know that we came there because other people had referred us to his place. I definitely recommend it.", "author": "Rafael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Nearly the most perfect mozzarella pizza outside of Italy. \n\nAs a traveler to Rome about 3 times a year of the past 10 years I have to say that Juliana's Mozzarella pizza would stand up on it's own.  \n\nNow they just need to start delivering like they said they were going to doing last year...!", "author": "Robert C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "Why wait on line for Grimaldi's when Juliana's is right around the corner? The pizza here is on point, arguably just as good as Grimaldi's (if not better). The crust is killer and their specialty pies sound heavenly. I tried the specialty pie with pancetta and it did not disappoint - fresh cheese and truffle oil, what's not to love? Good service and friendly owners were a bonus. I hope this secret stays under wraps, for my sake.", "author": "Kristen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "From the West Coast and this pizza was everything you dream about when visiting NYC. Will make it to Brooklyn every trip just to eat here. Well done Patsy.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Greeted by the THE Pizza Legend himself, we were seated at our table and ready to take in the authentic pizza of New York. We had the Margherita Pizza and added meatballs and a No. 6. Each large and fed 5 people perfectly! The No. 6 was absolutely amazing, the guacamole on the pizza was refreshing and a great addition with the grilled chicken. To finish we had the vanilla egg cream and a Carol's Cannoli. Each were delightful, especially the cannoli! Easily the best pizza I have ever had in New York and it lives up to its expectation!", "author": "George H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "Awesome pizza! The Margherita was perfect! This is the real Grimaldis. I've been here a few times and it never lets me down. Great service and quality atmosphere. I'll keep coming back every time I'm in Brooklyn!", "author": "Andre M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-03", "description": "I just left this place with disappointment. We ordered 2 pizzas, number 1 was extremely salty and we couldn't eat even 1 piece, the manager was so rude and he told us he doesn't care if we liked it or not and couldn't refund us. Margharita pizza was good and we finished it. But they didn't take the pizza we didn't eat off the check. DISSAPPOINTED!", "author": "Elena D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "The experience was better than the pizza. And the pizza was quite good. \nOur waiter was a crack-up, full of NYC character. He'd wander away after chatting with us for a few minutes, and then swing back around, picking up mid-conversation into a topic we hadn't yet touched. \nAnd then Patsy Grimaldi hit on my date, telling her that she should just move into his house and help keep it tidy. We looked up his house on Zillow, the technology blowing his mind and leading to quite a few good laughs. Patsy lives quite well, I will have you know. Pizza pays. Patsy was a riot, casually tossing hand-tossed doughs across the restaurant into the kitchen to be baked. \nPatsy readily answered our questions on how to master better home-baked pizzas, and before we knew it, we were in the kitchen rolling out pies. \nPatsy even offered to go into business with us, if we opened a restaurant in NY. He wasn't interested in relocating to Seattle, unfortunately.\nFor those that don't know, Patsy owned Grimaldi's next door for 20 years before selling the restaurant and the Grimaldi's name to a \"deadbeat\" in 2000. That guy, who takes cash only, has dodged paying his taxes and has been busted multiple times. So if you want Grimaldi's pizza from Grimaldi himself, and you want to ensure that taxes are going where they are due, visit Juliana's", "author": "Adam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Came to Julianas to taste what trip advisor rated as the best pizza in the country. After waiting in line for about 30 minutes we were seated close to the brick ovens. Every time a pie would come out the aroma of the fresh ingredients was incredible. We ordered the #1 and a large margarita. When they arrived we first took a photo then bit into the freshest, tastiest pizzas we've ever tasted. The crust was perfect and the flavors combined to make for one of the most memorable meals of our lives. The ratings were truly justified and we'll be repeat customers.", "author": "Ted F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "This review is going to be frank.  The pizza here is better than Grimaldi's.  In particular, the dough tastes much better, there are more generous amounts of cheese, and, oh, that char, so delicious.  You'll burn through your first slices, but save your last bites to savor.  Lastly, the wait staff is incomparably better.  Incomparably.  It had to be spelled with a capital \"i\" given how awful   There is no debate here.\n\nDon't wait on line next-door.  Put your name in for a table at Juliana's and eat a better pie.  You're already in the neighborhood, why go for second best?  I would award six stars if it were possible, and how many reviews say that?", "author": "Ryan W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}