{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "Juliana pizza Should be 10 stars ! Best pizza in New York. Honestly best pizza I have ever had! This is the original Grimaldi. This place has BRICK OVEN \"COAL\" fire which is hottest, so pizza comes out nice and crispy crust and all and most freshest ingredients used fresh Mozz, sauce, toppings just cut.  great service by all the staff. Can be crowded at times but 100% worth the wait.  You will not be disappointed!! Go here !!", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Ordered the #1 pizza-the best pizza I've ever had.  Thin crust, cheese was top notch, green onions, pancetta.  Wow.", "author": "Joeblow L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Absolutely delicious! My friend and I were apprehensive about the long line during Sunday lunch hours, but we waited only about 10 minutes. The manager was extremely accommodating and friendly as was our server. We ordered the small margarita with half sausage. The crust, the cheese, the sauce were all amazing. The restaurant is tastefully decorated, air conditioned, and has relatively quick service. I'd come back hands down over Grimaldi's next door.", "author": "A P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-23", "description": "Pizza is really good but not amazing. Price is good for the amount of pizza you get.\n\nBut be prepared to get overcharged for the extras.  A small 8 oz pellegrino-- that will be $4! Be prepared to really nurse that drink so you can get your money's worth. Add on a few extra toppings and that'll be another $10+. And even if you want that topping on half of the pizza? Too bad. That'll still be $10. I hate places that overcharge for the little things that could really make the difference between a 3 star ann 5 star rating.", "author": "Fam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "THIS is the real Grimaldi's. Patsy and Carol Grimaldi are back and showing Ciolli (owner of Grimaldi's on 1 Front) what it means to be a true historic NY pizza place - by focusing on personalized service and quality pizza. I miss the original look (a little grime and checkered table cloths), but I support whatever it takes for Patsy and Carol to reclaim their place as the First Family of Pizza. \nhttp://blogs.villagevoice.com/forkintheroad/2013/06/julianas_and_gr.php", "author": "Alis H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Is this the best pizza in the nation? I don't know. I haven't eaten at all the pizza joints in the nation. Some part of me feels like there is some hole in the wall pizza place in some unknown American town that is probably better but maybe not by much. 4 stars because they hadn't figured out how to manage the flood of people coming after they were named best pizza by CNN. We had to wait a few hours for them to go get more stuff to cook with. When we finally got our pizzas...they were really really good and really large. Pep+blk olives and mushrooms. It was interesting to watch the pizza owner next door stand on his front porch and scowl at the line. Apparently there has been a long standing debate about who's pizza is better. Looks like CNN made that decision. Out of pure principal we ate more than we should have and rolled our way back to Manhattan. Gave the doggy bag to a man on the street. Hope he liked it as much as we did.", "author": "MJ A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Went on a weekday and there was no wait for a table\nGreat meatballs!\nGood pizza, the first few slices that were fresh and hot were great!\nDelicious pepperoni! \nDon't wait to long to eat the pizza because it may become soggy\nHot chocolate drink was ok, it tasted a bit bitter or lacking any sweetness", "author": "Ava A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Great atmosphere we waited in a bit of a line but it's well worth it. Pizza is amazing and the local Brooklyn beers are great.", "author": "Carl H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Nice location. Definition of real pizza. Friendly staff, extremely busy on a very cold Sunday. We had pizza with sausage, pepperoni and peppers, and also their spaghetti and meatballs, everything was very yummy. We will return soon.", "author": "Bryan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Best Pizza Ever! I have never tasted pizza this good anywhere else: Toronto, British Colombia, San Francisco, Chicago (yes even Chicago).\n\nThe Margarita with Sausage was INSANE!!\n\nSomewhat of a long line, but worth the wait. \n\nThe only small complaint I have is with one of the waiters. Asked him about eggs in the Cannoli (for an allergy), and he came back quickly without actually checking with the Chefs claiming that there is eggs in there. Noticing this, I asked another waiter to check for eggs, and he came back saying no. He assured me no eggs. I tried out the Cannoli, no allergic reaction!!\n\n\nBut the Pizza was soo good.", "author": "Reza N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "No Pizza Til' Brooklyn!\n\nThis place ruined pizza for this California boy.  In other words, after Juliana's, I'm now angry at all the crappy pizza I've eaten in the four decades of my life. And I now notice I have utter disdain for the bland \"pizza\" being served up back at home. \n\nIt was my first trip to New York, on business from San Francisco, October this year.  I walked over the Brooklyn Bridge in search of famous NY pizza and Juliana's delivered.  I had the margarita, add meatballs with a cold Moretti beer on the side.  I sat at bar table overlooking the kitchen and watched them prepare the goodness.  The colors, aromas, textures, and flavors of my pie were amazing and totally balanced.\n\nThe place was clean, service was friendly and fast, and the vibe, ambiance, and restaurant design/layout were perfect. I chatted up the owner and made an attempt to get him to franchise in California, not sure it worked.\n\nAfter I ate half the pie and got the rest to go, I had some delicious ice cream next door on the pier, then rented a Citi Bike and road back to Manhattan, riding all over, soaking in the sites. It was one the most enjoyable days I've ever had really. \n\nI love you NYC!", "author": "Bababoo E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Before eating-Juliana's needs to say on their website that they close in the middle of the afternoon to reset the ovens. They said they would reopen at 4, then 4:15, now 4:30 and nothing. I don't mind waiting for a table but if you don't even let people know you close when the hours clearly say open, then you should disclose the real facts. #wastedtime\n\nAfter eating-as expected, the pizza was fantastic and deserving of the high praise we read about. 4 stars because of the unexpected wait time that was out of the ordinary. We would return for sure, just not and mid afternoon closing time.", "author": "Brett K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "The first time I went to NYC a few months ago, I was told I had to try Grimaldi's.  So my host and I made the trip to Grimaldi's on a Saturday morning/early afternoon.  We got there, and of course, the line was already down the sidewalk, almost past Juliana's.  \n\nI noticed a big poster article in Juliana's window mentioning that it was owned by the Patsy Grimaldi's and faced with an hour-long wait next door at Grimaldi's, we decided to chance it on Juliana's (where there was no line, no wait).  Luckily, the gamble paid off.  The pizza was excellent.  Thin, crispy crust, nice sauce. AND they take cards unlike their friends next door.\n\nBy the time I got out, there was a line out the door for Juliana's so I guess the secret got out.  If you want to try Grimaldi's without waiting Grimaldi times and/or you want the convenience of being able to use your credit card, just go to Juliana's next door.\n\nI'd also like to add that I ended up trying Grimaldi's this week, and while it was good, I recall that Juliana's was great.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "We had margherita pizza with pepperoni which was excellent. I had Matt's salad and the pasta Pasilli soup was like a thick pea/bean stew- perfect for a wintry day. Staff was efficient and friendly. Only downside was the Diet Coke I ordered was a tiny 8 ounce bottle. Not even a glass. My husband liked the chianti. Still a very favorable experience.", "author": "Jodie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Yum! Probably the best pizza place I've tried in NY. Beware, you'll probably have to wait but the staff was super friendly and the food was delicious! We had the margherita pizza with meatball and No. 4.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "If I could give 10 stars I would. The pizza is always absolutely delicious!!  The best pizza in Brooklyn. Will you wait over an hour to get in? Yes, but not always. There were times I only waited 15-30 minutes. Once you dig your teeth into their pizza, you will forget the long wait time. Once you take a bite of this pizza it will be hard to eat any other pizza. Lucali's and Grimaldi's are good too, but they are not as good as Juliana's.  This is the real Grimaldi's anyway.", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "5 for the pizza.  We lose a star for the standard wait.\n\nI guess the secret is out.  It's pretty awesome that GRIMALDI is still working and doing an amazing job.  It is the best pizza in the area, but I'm not a fan of the waiting 40+ mins in line for the pizza.  Prices are similar to Grimaldi's, and the quality is slightly better in the sample size of 1 at Juliana's vs 5 at Grimaldi's.  \n\nGiven a choice, I'd eat here over Grimaldi's, but I would try to come early to avoid the lines.  There's a reason this isn't my go to pizza place.  It's because too many people are here, and it's not THAT much better than the other great pizzas you can get around the area...", "author": "Simon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Stated with a arugula and goat cheese salad that was fantastic. It was fresh and lightly dressed. Had a great cappuccino. We got the margarita and added meatballs, bufala mozzarella and pepperoni. It was great. My wife said it was the best pizza of her life. I'm not sure it was that good, but it was close.", "author": "Dick W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-10", "description": "So I've now tried Juliana's twice..........  \n\nLast night we went for the second time, after waiting outside for a table for 20 minutes (not complaining, I knew what we were in for) we were seated inside.  We were a party of 4, and ordered a plain margarita pizza and calzone, no toppings, easy order, right?  Then the wait really started.  45 minutes go by and no food, we start to see parties seated after us getting their food, and confused waiters trying to serve food to the wrong tables.  We finally mention this to our waiter and he goes to check and says they just put the pizza's in the oven......  no apologies for the wait at all............\n\nThe calzone arrives first, two of us grab the ends and dig in, we are starving.  My husband grabs a middle piece and discovers cold ricotta and basically no melted cheese at all.  When the waiter bring the pizza over, my husband mentions the cold calzone and they say they'll remake us a small one, not a large like we ordered, since we've already eaten some......  whatever.  Now to the pizza, not pipping hot (what is that 900 degree oven doing?) and dense crust with acidic sauce..........  Major letdown, but starvation takes over and we chip away at the pizza........\n\nCalzone #2 arrives and it's the same cold ricotta, we mention this to a different waiter and he says that is strange, and gets a manager to walk over.  The manager very rudely says that they've now made it twice, they're not doing it again and he'll ask the pizza guys if that is how it's supposed to be (shouldn't you know this?  and who serves cold cheese calzone??).  He comes back to say that this is how it is supposed to be and they don't get any complaints, they take it off of our bill, but still no apology.  \n\nWe finally get the check and quickly pay, and as we're walking out, we get a sarcastic sorry from the hostess (who I believe is one of the owners).  Needless to say, we won't be back, and feel like this place is taking advantage of the fact they are in tourist central and can afford to serve bad food with bad service.  Sad that the pizza destination in tourist brooklyn is a sad excuse for food.  Do yourself a favor and go ANYWHERE else!!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "You just can't beat authentic New York pizza. This place ticks all the boxes. First it's owned by the real Grimaldi, in the original Grimaldi space. Ignore all the tourists lined up to go to a place that used to be a vodka lounge next door. It might have the name and the pizza is good but it's not the original. Thats Juliana. They have a fantastic selection. I love the white pizza selection they have. Its a must try, even if you don't normally get white pizza. You can also order beer and wine. What I thought was really cool was that sometime's Grimaldi himself will walk around tossing pizza dough In the air. Makes for an awesome photo.", "author": "Joseph L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}