{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "I feel like I'm cheating them, giving them only 5 stars, but WHATCHAGONNADO?? OMG Best pizza of my life. RUN, do not WALK to Juliana's. Wait in line (and you'll have to) all day if necessary. You will not be disappointed. I am not even a big pizza person, but I ate my weight at this place. We got the #1 and #6. A pizza with chicken and guacamole? WHAT THE NUT? But yes, God makes plans for you that you can't even imagine... and this is one. Now, stop reading and GO get in line!", "author": "Maureen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Love Grimaldi's but didn't want to stand in that damned long line! Luckily his daughter built a place right next door and the pizza there is just the same - but without the damned long line!  It is expensive: 3 pizzas, 2 beers, and 1 soda cost us $100. But we had plenty to bring back to our hotel for late night snacking! They even packed our pizza to it would fit in the hotel refrigerator. \nThey DO NOT OFFER A GLUTEN-FREE OPTION so only got four stars.", "author": "Donna Blue H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "The line was long and we stood for about 45 minutes, but once we got in the service was fast and friendly and the pizza was amazing. We also got two cannolis and they were really good. The filling was perfect.", "author": "Victoria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "My boyfriend and I love this place. We came to BK bridge when I first moved to NYC and tried Grimaldi's next door because of all the hype, we weren't impress until we tried Julianna's. I love the story behind it and the pizza is delicious. The lines are long ! On a Sunday evening we waited about 1 hour to go in then probably another 30 mins for the food to actually come out. I suggest coming on an off day or later at night cause the lines are usually a little shorter. I ordered the pepperoni pizza which is essentially a margarita pizza with pepperoni on top. It came out fresh from the coal fired oven and piping hot. The mozzarella was fresh and the dough is cooked to perfection. It's one of my favorite pizzas in the city. I highly recommend this place over any other pizza in the Brooklyn bridge area. And customer service is Always on point ! Even when it is very busy my water is refilled and the servers are very friendly.", "author": "Djerica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Absolutely the Best Margarita Pizza I've ever had! Located under the Brooklyn bridge they pride themselves on a truly \"Authentic Italian Pizza\" and that's exactly what I would imagine it was designed to taste.\n\nI'm not kidding when I say their Pizza is a treat to all the senses... The Look, the Smell and The Amazing Taste!\n\nA must Try and Yes, I'll be Back!!! :)", "author": "Barry A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Awesome pizza!! Hope you enjoy the people your sitting next to cause you can't have a private conversation.", "author": "Eric N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "So I came to this location in 2010 and it was a completely different restaurant - a grimaldi's. \n\nFast forward to a few weeks ago. Some friends and I were on vacation in NYC. We decided to walk across Brooklyn bridge and grab Grimaldi's afterward. We told one of our local friends about it and she suggested we go to Juliana's instead. After looking up reviews on yelp, we decided to give it a try.\n\nWe walked past the new Grimaldi's location and to where Grimaldi's used to be. I was shocked at how different it looked! It seemed much more spacious and it had a very sleek style. The iconic pizza oven was back there. \n\nWe were quickly seated and ordered a small margarita pizza and a small number 1. We also had a chianti and 2 beers (total bill came out to $71).  While waiting for our food, we did a little research about Grimaldi's vs. Juliana's and it turns out that there is some bad blood there. \n\nI remember eating at Grimaldi's years ago and I remember the pie being good, but a bit soggy. Juliana's pizza was not soggy at all. It had a nice crust. Very tasty sauce. Delicious cheese. It was an excellent pizza. I would go here over Grimaldi's every time.", "author": "Angela D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "*review is based upon my pick-up order experience \n\nI ordered a large margherita pizza with pepperoni for a pick-up to share with my roommates. I arrived on time to pick it up but it was already pretty cold. We had to heat it up in the microwave by the time we ate it. Considering that it was cold pizza, it was still delicious. But it wasn't surpassing my expectations as one of top joints for pizza here in nyc.", "author": "Haena Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "We LOVED Juliana's Pizza! \n\nI had read about the opening and the related drama back several years ago when NY Mag did several stories about the unfolding drama between Patsy and the folks who now had the naming rights to \"Grimaldi's\", and knew we just HAD to try Juliana's and taste the original Pasty Grimaldi's pizza!\n\nWe finally had the opportunity to do on a brisk Sunday afternoon. There was a line snaking out of Grimaldi's, but we were seated immediately at Juliana's by the legend himself, Patsy. Our server warned us that the oven was being stoked, so it would take several minutes for them to start firing up pizzas, but we were totally fine with the wait. And why not, when our pizzas were going to be made in a real brick oven??\n\nWe had the arugula salad, which was DELICIOUS. We were also so hungry we ended up ordering another arugula salad when we had devoured the first one. We also had the pie #1, a white pizza with sopressa, some truffles, pancetta, and green onions. Our friends LOVED the #1, while I was head over heels for the margherita with garlic! It was everything a pizza should be - crisp yet chewy crust, perfect sauce, fresh mozz, and we also added garlic which threw the whole pie into another realm.\n\nOur service was friendly and attentive and didn't rush us out of the door when we were finished. Patsy was working the floor making sure everyone was happy (which we were!!), and we left extremely full and happy. Why go to the place next door when you can get the original at Juliana's?? We will definitely be back!", "author": "Joanna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "This place rocks and is located next to the River Cafe with the best views of the bridge and Lower Manhattan.  Only thing better than the location is the food and service.  We live in Newport Beach, CA but go back every time we're in town - most recently this week.  Food still delicious and the service is fantastic.  Worth the wait.  Shout out to our regular waiter, David DaGosta, who's been serving there for years and who provides a high level of service.  I wish we could get them out here to CA but look forward to our visits to NYC - and we always make a visit to Juliana's a part of every trip.", "author": "Neil S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "On the 8th day God made pizza. It was at this restaurant. And it was good. God had known that he had done good. And God was happy.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Fabulous Pizza! One of the best in NYC, if not THE best. We went for a half \u0026 half margarita \u0026 while, which was really good (can't say I haven't had anything better than this). We were so impressed that we went for the grilled chicken (special no 6), which is downright the best grilled chicken pizza I ever had. Certainly will try to stop by in future when I'm in the city. But be prepared for long queue to get seated :-)", "author": "M Iftekharul A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Excellent pizza! Nice atmosphere for both children and adults. I was here with my two boys and we all split a large pie, which was more than enough to go around.", "author": "Max B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-30", "description": "We had the margarita pizza...yeah, it was good, but why do I think Grimaldi's  was better?  The service here is definitely better than Grimaldi's.  Did I turn into a girl that loves bad guys (aka restaurant that treats you with no respect).\nNo!  I am not a tourist!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "Came here because of the great reviews and because we wanted pizza. Unfortunately, when we arrived they were having issues with the oven so they opened later than expected. Took a stroll around the neighborhood and stopped by shake shack because I was famished and I needed something small to hold me off. We came back earlier then the time they had given us (thank goodness for that)  or else we would have had to wait for a table to open. Got seated right away and ordered 2 of the classics. The food and service was great but really didn't appreciate the attitude by the manager (minus one star for him).", "author": "Esther L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Arrived around 2:00 in the afternoon. Probably waited for 20 minutes before we were seated. The dining area is tight, but not unreasonable. It was very clean and cool (which was nice because it was hot and humid out).\n\nI can't use enough adjectives to describe how amazing our meal was. My wife and I ordered the Matt's Mix salad and a small margharita pizza with pepperoni. Mind blowing. The pepperoni's were delicious. It was just enough food to give us some room for dessert. The host talked us into the cheesecake... thank god we listened. Easily the best piece of cheesecake i've ever had (compared to California cheesecakes for those who disagree). I ordered a chocolate egg cream to go since I've never tried one. It was also delicious. Kinda of a unique twist on a chocolate shake.\n\nDefinitely worthy of being on anyone's bucket list.", "author": "Trevor C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "As you know, I've already been to Grimaldi's. How did Juliana's (which is located right next door) compare? Well, bubs - it was EONS better and easily one of the best pizza places in New York. \n\nWhy's it so good?\n\n1. The pepperoni is tiny and thick cut (ie. GOOD pepperoni)\n2. Service was great and fast as hell\n3. Wait time wasn't ludicrous\n\nIf you don't know the story behind Juliana's and Grimaldi's, well, it's a long one. But this article sums it up pretty well. And I don't care what the tourist guidebooks tell you, this place is ridiculously better than Grimaldi's next door. Go. Eat.", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "This is the best pizza I have ever had. We waited for 20-30 mins and it's totally worth it. Ordered a red and white sauce half and half, with lots of meats on there. It's sooooo good! They got the first order wrong, and they gave us another one for free. It's so nice of them, but there is no way we can finish both of them. Thanks though, really appreciated.", "author": "Gina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "\"Why is this line of people wandering down the block?\"\n\nIf you're on Fulton Street in Brooklyn, it's probably because of Juliana's Pizza or its neighboring rival. Rather than motivating me to move on and find somewhere else to carb load for the next morning's race, I was intrigued to see what the long wait and hype was all about. That, and I was craving pizza anyway.\n\nSince it was just me, I walked up to the entrance and asked the kind gentlemen directing traffic into the very small restaurant if they had a bar. Yes, they do, but it only accommodates about 6-8 people. He said I could wait for something to open up, so I did. I started chatting with another guy, (also a runner, up from Long Island), who was in the exact same boat I was. Rather than wait for another hour or so to eat, we teamed up and decided to share a table at the hostess' subtle suggestion. \n\nYeah, it sounds kinda weird and certainly had the potential to turn out to be very strange and awkward, but thankfully it was anything but. In fact, we decided to split a Margherita pie, knowing neither of us wanted to lug around a pizza box of leftovers after eating. In hindsight, this would not have been a problem at all because this pizza was so freakin' awesome! \n\nThis beauty was a perfectly baked Neapolitan style crust from a coal fire oven, topped with tasty tomato sauce and plenty of cheese. Yeah, it quickly disappeared after we each inhaled four slices while chatting about the next morning's Brooklyn Half Marathon and enjoying a local micro-brew. I'm seriously craving it again just thinking and writing about it!\n\nAlthough this was not at all how I envisioned my late dinner playing out, it turned out to be a pleasant, convenient surprise and certainly a humorous memory in hindsight. And all of that at only half the cost!", "author": "Benjamin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Nice nice nice, me and my wife just dropped by, we never have pizza so we desited to try this ones, it was crowded and people where happy in there, and it is populer for a reason the pizza was outstanding, servic was nice and the bill was more than fair.", "author": "Kristofer H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}