{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "I couldn't wait to find the restaurant founded by Patsy Grimaldi and found it at... The location where Grimaldi's was. The space is renovated which sheds some of the charm but makes for a very nice decor. The service was friendly and the pizza was divine.  I went midday during the week. I am holding off 5 stars until I go during a busier time and see I'd the pizza and service hold up.", "author": "Paul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "I live around the corner, for what its worth.  We have some pretty great pizza options and I love the guys at Front St and Ignazio's has a good pie, but Juliana's is by far the best.  Quality of the pizza is perfect!  The staff is awesome and treat you like royalty.  Last time I was there, I took my daughter and we had the best lunch ever.. down to the manager running down the street to give us our doggy bag we left behind!  Love these guys!  I hope no one reads this so the lines don't get too long!", "author": "Mike D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "I returned to Juliana's again, only this time there was a bit of a wait in line.   We ordered a large #4, tomato, mozzarella, arugula and prosciutto.  5 stars, need I say more?  It was good to know that the quality of the pizza and service was still top notch, despite the long line out the door.  Unfortunately Patsy was not around this time, apparently under the weather.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "The wait staff was incredibly friendly when I went on a Friday afternoon.\n\nMore importantly: Juliana's pizza is better than Grimaldi's pizza. It's most apparent in the dough.\n\nWhy? ...because it just is. So do yourself a favor and skip that line at Grimaldi's and head here. You're welcome.", "author": "Chris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Best pizza in DUMBO, hands down. We have never eaten inside but had their pies to-go several times and they've never disappointed us.", "author": "J W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "This place is great. My brother took me here while visiting him in New York. Really enjoyed the home feel and good service. Would definitely come back on my next visit.", "author": "alexandria f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "This place is amazing. The pizza is delicious. I had the marinara and I ate it all. The staff is super nice and accommodating. The owners are friendly and the place has a great vibe. It was a fantastic evening out and I can't wait to do it again! A+!", "author": "Frank B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "I am staying at the Sheraton Brooklyn and wanted to eat a great pizza. Yelpers said to get a pizza from this place and it was a fantastic choice. The walk to and from this place was worth it. I carried back the prosciutto pizza. It was cooked to perfection. It was far better than anything I could get back home.", "author": "Michael  C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-23", "description": "Lunch was good here but I felt like I've had better. We ordered a Margarita pizza served fresh and an arugula walnut goat cheese salad appetizer. The salad was amazing, but the pizza wasn't as impressive. It was scorching hot outside, the third heat wave in NY apparently, so it was nice to come inside. The decor was cute with a nice view of the pizza chefs at work. If I recall correctly this was where Grimaldi used to be.", "author": "Annie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "I love the pizza here. Best one in NYC period. Thank god all the tourists go to Grimaldi's the wait is not that bad anymore at Juliana's.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-04", "description": "as blasphemous as it may sound, this place is better than grimaldi's. this is what NY pizza is all about!", "author": "Yaz D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "Best pizza I've had in NY. Took a 5 minute ferry over to Brooklyn, walked a few yards and had a NY style pizza with great ingredients. Very tasty. Walked it off by crossing the Brooklyn Bridge by foot.", "author": "Daryl G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "Great location. Go see the skyline of New York at sunset and then head over for a great pizza! Great food and the staff was really nice.", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "The pizza is authentic and the pepperoni and meatballs were a good choice for toppings.  Service was as good as the food which came out in a timely fashion.  I'd go back if I was ever in Brooklyn again.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "This is my second time at Juliana's, the first being a while back when they first opened. I had friends in town from New Orleans who were desperate for great pizza and while there is no shortage in New York, we decided Juliana's was the best choice in terms of location, ambiance, experience, and most of all, taste. Needless to say, no one in our group was disappointed. It was a Sunday night and while there was (of course) a line, it was reasonable (wait time approx. 15 minutes, and never once did we feel forgotten or that we were languishing on line with no end in sight). Patsy came out frequently and, in his usual fashion, talked to everyone waiting and updated us on what we could expect in terms of timing for a group of four. \n\nOnce we were seated we were impressed by the service (friendly, attentive waiter and staff) the spacing out of the tables (if you've visited the location before it changed over the fact that our table was not touching anyone else's is a real treat), and the atmosphere (clean, minimal black and white décor, great view of the oven). Once our food arrived, none of the above would have mattered one bit because the pizza was so good. Arguably we over-ordered (two large pies for a party of four) but we wanted lots of variety and two slices per person was not going to cut it. We had one regular margherita pie and one with half peperoni half cremini mushrooms. Everything was delicious, perfectly cooked, and tasted so fresh that in the end there was only a slice and half left, AND we had dessert (both the cannoli (his late wife's specialty) and the cheesecake were delicious. We will be sure to try the Brookie Bridge next time. Overall, everything was fantastic and so deserving of 5-stars.\n\nI wish I could get through this review without mentioning Grimaldi's but given the history it's nearly impossible. I will, however, be brief. Grimaldi's in now a chain, not an authentic NYC pizza experience. If we can agree Grimaldi's is now resting on its laurels, we should acknowledge that Juliana's epitomizes everything that once made that place famous.", "author": "Dana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Awesome but hard to get to from Manhattan unless you take ferry-then super easy. Pizza was amazing and the brookies were yummy. Will definitely return. We walked over Brooklyn bridge, not realizing there are barricades quite a way down that prevent you from getting to Dumbo area. No big deal, will just take ferry or subway next time. Worth it.", "author": "Janis Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-09", "description": "so weird and out of touch... nothing special in this city of special pizza places and the worst service in all of new york.", "author": "Anthony W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "As a frequent customer of the old Grimaldi's, I was devastated to learn of the move out of the original coal oven location.  While the lines were a persistent annoyance, the pizza always warranted the inconvenience. \n\nLast summer, I made my first (and final) visit to the new \"Grimaldi's\" location next door.  The pizza was above average but it paled in comparison to the original coal oven product.  Additionally, after waiting nearly an hour in line and tolerating the arrogant personnel, I was astounded to see multiple empty tables upon being seated.  Was I waiting for pizza or entry into a disorienting, mediocre club in the Meatpacking District? \n\nTonight I visited the newly opened Juliana's in the former location of what was once the real Grimaldi's and my socks were knocked so far off that they likely now reside in the East River.  Insanely, there was only a 10 minute wait on a Saturday night and the personnel were universally pleasant, inviting and accommodating.  The restaurant looked completely different (and much improved) with updated everything, no more communal tables, a slightly expanded menu and even fountain beverages.  The arugula salad was refreshing, the Moretti crisp, the Diet Coke sufficiently syrupy and the margarita pizza divine.  The Grimaldi's trademark crisp, charred, chewy crust was back alongside the sweet and chunky tomato sauce, creamy mozzarella and fresh basil.  The Brookie Bridge dessert (which was provided to us on the house) was a perfect way to end a perfect meal.  Two warm chocolate chocolate chip cookies dutifully sandwiched two scoops of Brooklyn Ice Cream Factory vanilla.  Unbelievable experience.  While I want the place to succeed, part of me is selfishly hopefully that the neighboring \"Grimaldi's\" continues to trap tourists for years to come, thus enabling me to repeat tonight's experience at Juliana's over and over again without the interminable wait and accompanying pretense.  If you like pizza, breathing oxygen and nice people, Juliana's will not disappoint.", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "We waited about 45 minutes outside at 2 p.m. on a Monday. Tip: Don't stand underneath the tree. Birds flock there and dump their loads frequently, including a nice one on my coat. We ordered a large arugula and prosciutto pizza for the 4 of us to share (2 adults and 2 preteens). I dig \"fancy\" pizza, so it was right up my alley. One of my kids didn't love the arugula (to be fair, there was a ton), and the other didn't like the prosciutto, but the combo was great for me. We all agreed the crust was great - nice and crispy with some char marks (not bad char - flavorful char).  We shared a Brookie Bridge with raspberry chocolate ice cream for dessert, and it was so good. It was $9 which I thought was a bit steep for how small it was. Overall, the atmosphere was nice, the food was delicious, and our service was fantastic. Our waiter was very attentive. I'm only giving it 4 stars due to the prices, but it's closer to 4.5 stars.", "author": "Meredith B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "This is the best Neapolitan pizza we have had in the U.S. other than Spaccanapoli in Chicago. It's definitely the best in New York!!!  The crust is perfect, the sauce interesting, and the toppings balance out all of the other flavors. It's deliciousness that you don't want to end. Our walking tour guide mentioned both Grimaldis and Julianas and we wanted to try Juliana's because of the great story here. It was definitely the right choice.", "author": "Mary L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}