{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I'm a native NYer and took out of town family members here. The pizza was great! Service was fast!", "author": "M R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "Of the overly touristy, guide book infested pizzerias of the city. 1 Front Street Brooklyn was probably my favorite. Now if you go other time during the week there is less likely of a long group of people who form a cue as it seems people have been fruit brainwashed like sheeps to stand in one. Unlike that I don't do lines. Not for cronuts, not for Moma X, and not for Grimaldi's.\n\nSo Juliana's Pizza comes in play. This so 'called' rivalry is it so with the mudslinging between the original owner verses the current owner.  Can the two co-exist? Surely, so. The tourists will still flock in droves to 1 Front Street  because all the guidebooks say so and by default if you don't know the history, people will cue up on command next door because it is 'shorter.'\n\nCompetition is good and Juliana pushes out some pretty fantastic delicious pies. The crust crispy and doughy. The tomato sauce and fresh ingredients are pushed out faster than a blink of an eye even on the busiest of days.  With this comes touristy prices of pies up to $30. iFixit needs to break it down because it is certainly a 'healthy' profit margin.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "OHHHH MY GOODNESS, I still have dreams about their \"Special #1\" Pizza! Soooo good!!!!\n\nOne of the best parts about this place, aside from the insanely good pizza, is that the owner, Patsi Grimaldi, is usually there to personally seat you and chat with you! He's adorable!!\n\nDefinitely worth the hour-long wait to get seated! \n\nAlso, don't skimp on dessert! Yummm.\n\nCHECK OUT MY VIDEO REVIEW OF MY TOP FOUR PLACES TO GET PIZZA IN NEW YORK: https://www.youtube.com/watch?v=9pPbJTKM1jQ", "author": "Serena T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "I walked in and got a slice of spinach mushroom pizza as well as the beef and  mozzarella pizza. Both were okay. But it could be because I didn't eat my pizza until 5 mins later (so it was warm and not hot), however it was still crispy!  I will definitely return a couple of times so I can get a better jist, and my review will most likely be updated. BUT. Until then, check this place out....and....Happy yelping everyone!", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "My dad used to go to the original Grimaldi's as a kid, so this is a special place for me. Incredibly fresh and flavorful pizza!! Thy are efficient despite always having a wait--definitely worth the wait!!", "author": "Kelly R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Good pizza, thin crust. We ordered a large (2 sizes only), $20 for 3 of us but it's really only enough for 2.  2 of us got 3 slices, the 3rd person got 2 slices.  You'd have to supplement with either an appetizer or salad. Sodas are $3-3.50 and lemonade $2.50. \nWait service was good.  I'd certainly return for pies here.", "author": "Ry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "I tend to give 5-star reviews on yelp very sparingly, but this was one of the times when my finger just reached the mouse and clicked on the 5 star option without instructions from my brain. Anywaysss if you stop by at NYC and crave for authentic new york pizza this place is a must stop. Like seriously I've had all sorts of pizzas in my lifetime and I don't remember ever having pizza this good. There's just something in this pizza that puts it above others. Idk what that something is but they are doing it right. Also location is very fab. It's right under the brooklyn bridge and when it's night everything becomes pretty lit and sparkly and it becomes a perfect spot for a date ;))))))", "author": "Ijoo Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "Before somebody gets here, keep in mind than in any regular night you will have to wait for at least 30 minutes to get a table. If you are going with a group of friends, it is a great time to catch up and build your appetite :)\n\nGreat pizza, good service. We got pizza #2, cheesy and yummy. A big pie is enough to feed 4 adults who aren't starving, but if I was going there with my homies, I would do a big pie for every 2 people. Good selection of wines too!", "author": "Xavier M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Skip the line at Grimaldi's next door and head over to Juliana's! (It is the original location and original owners of Grimaldi's afterall!)\n\nThe pizza crust is spot on here.  Perfectly cooked (not charred and not undercooked.)  The tomato sauce and mozzarella all tasted fresh.\n\nMy friend and I shared a large pie.  It was a good size for 2 people with big appetities.  Otherwise, I'd recommend ordering a small.", "author": "Alana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Omg!!  Definitely worth the wait.  I don't think I've ever had more mouth watering pizza.  The sauce in of itself was delicious add the mozzarella and I was in love.  I kept eating because I didn't want to waste one bite", "author": "Adrienne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "The service is OUTSTANDING. We were waiting in line and the Host frequently provided updates and offered take out as an option for guests who may not be seated in time.  MORE IMPORTANTLY:  our daughter had a medical problem while waiting and the crew jumped in to help quickly and kindly. They called 911, for a chair, wet towel, water, and lemon slices FAST. \nYou guys are THE BEST. Thank you all!!!!!", "author": "Ray R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "DELICIOUS PIZZA! Came here because of the Yelp reviews and am so glad we did! We met the nicest people in line and ended up sitting with them and sharing pizza (so try and do that. Haha!) \n\nI asked the waiter what was the most popular pizza and he said the number 1 and number 4. Just FYI 2 people can eat 1 whole pie. The pizza came out hot and crunchy and delicious. I will say they were both great but the number 4 was out of this world amazing! The pancetta was crunchy and baked to perfection. Don't let the line deter you. It's worth the wait!", "author": "Danielle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "I love this place, been there twice already, good decor, great food, great service. on my last visit had the chance to meet mr patsy, nyc pizza icon, what a nice gentleman.\n\nWe had the Number 4. 9/10\n\nthe crust, the sauce the cheese and the prosciutto were fantastic, the only thing i would change its the amount of arugula, but thats me.\n\nfor dessert we had the brookies, 8/10 they were great", "author": "Leonardo P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "It's a good place for new york pizza experience. Smaller than grimaldi's next door but just as strong.", "author": "Tee D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Now here is a pizza I will buy again. We stuck out the insane wait outside. Now, I hate waiting but I heard it's bomb. Very imp note: if it's mad busy outside, go in and order to go. 4 groups came and went doing that as we waited in line like fools. Last time we eat in, but 100000% not the last time I order here \nCoal fired over takes the cake. It's legit the perfect pizza for thin crust lovers. Crispy on the bottom, super thin and incredibly delicious. The meatballs were also legit but the pizza. I mean, wow.", "author": "Stephen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "You can't miss this place because of the long line stretching out the door. When a place has a long line to get a table, you know it's got to be legit. And it is. \n\nJuliana's knows its niche, and it doesn't try to be something it's not. You won't find so-called \"creative\" pizzas here--their menu is more traditional, if you will. But sometimes tried and true methods are better than the new ones, and this is one of those cases. We ordered the Margherita pizza with anchovies and a white pizza with mushrooms, both of which were phenomenal (I thought the Margherita was better, though). The crust was unbelievably thin and had a beautiful char from the wood-fired oven, and the cheese was perfectly melted and slightly blistered. Like, I said: legit.\n\nIt's not every day that you come across a place that attracts foodies and common-folk alike, but when you do, it is always special. All in all, I would highly recommend Juliana's to anyone in Brooklyn, or hell, even Manhattan.", "author": "Anonymous R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "Amazing Pizza! Went here because it's the space of the original Grimaldi's, which we went to ten years ago. We got a salad, and a pizza. All so good, can't beat the crust! Desserts looked amazing, wish we would have had them instead of trying the cookie dough place (don't go there!). Will definitely be back for more!", "author": "Meg J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "If Yelp had 6 stars, Juliana's would deserve them all. Even late at night, this little gem of a pizza joint was packed, with a 45-minute long line outside. Situated right next to the franchised Grimaldi's restaurant, this is the new home of the original proprietor, Grimaldi himself. And, while we waited in line, he came through and personally spoke with each and every customer, genuinely interested in their story. I had the caesar salad with white anchovies and green olives... really excellent. Then came the pizza, washed down with local Brooklyn beer from the tap. The crust was just the right mix of chewy and crunch, cooked in an amazing old oven. The best pizza I've ever tasted. I usually eat pretty quickly, but for this one I slowed down... I didn't want it to end. Finished off with the cannoli - a real treat. A lot of other pizzas are ruined for me now.", "author": "Bill W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Went early (~5 pm) on a Saturday night and surprisingly the line took only about 30 minutes! We were very happy! \n\nAll of the servers were real characters, cracking jokes and such. We enjoyed an egg cream to start. Perfectly made! The spinach salad was nothing special and next time we'll probably just stick to the pizza. There were three of us and the large was the perfect size. We all left full but not feeling ill. We shared the margarita pizza with added toppings of pepperoni and sweet onions. Perfect thin yet chewy crust. It was really great pizza. Delicious pepperoni.\n\nPatsy Grimaldi was friendly and chatty and ended up bringing us three espressos on the house to end our evening! Very fun place, lots of bustling action. New York classic!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "My husband and I were told by the Red Bus Line to go here when we ventured out to Brooklyn. We loved the pizza, the atmosphere, our waiter, etc. We have never had a pizza like what we experienced at Juliana's. Next time we are in NY, we are coming to Brooklyn to have pizza again! We had the No 1 and we have been craving it ever since.", "author": "Hollee K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}