{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "After reading all the reviews I knew I had to try the pizza here. Best pizza I've ever had. I had the number 1 special. There was no tomato sauce but the flavors all worked together perfectly. It's a little pricey but completely worth it.  The service was also fantastic. I'm already recommending this place to all my NY friends!", "author": "Sharon W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "4.5 stars! So for 2 people, we really wanted to maximize what we could try and figured we can take extra home. We ordered 2 large pies. Classics, you can customize and the special ones you cannot. We got a classic margherita, 1/2 with pepperoni and the 1/2 with sausage ($6 extra for both toppings). The special we ordered was No. 1. We were really hesitant about ordering a #1 because it has no tomato sauce, but the waiter said it was really good. They put truffle oil so it isn't dry. It had Buffalo cheese, bacon, scallions, and truffle oil. The first bite I took was okay, but for some reason, it grew on me! Each slice became better and better and sooner or later, I kept wanting to eat the whole damn pie! Lol I didn't think I would like pizza with no tomato sauce, but damn no 1 was good! Surprisingly the scallions + truffle oil really brought the whole thing together. The pizzas are thin crust which I love because you aren't stuffing yourself up with dough. I usually don't eat the crusts, but for this place, I noticed I did. It was a good decision to get a red pizza and another white pizza. The no 4 is another very popular choice here, but too bad we didn't get to try it :( \n\nThis place usually has a huge line out the door. We got lucky today because we went during the opening time on a national holiday so the line was \"shorter.\" \n\nPrices are on the more expensive side for pizza, being about $30 for a large pie. The no 1 was $30, the classic magherita was $21 + $6 (2 toppings). \n\nI would def come back to try other ones!", "author": "Priscilla C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "So this is the best pizza eh?  I'm glad we got to experience it.  The line wasn't too bad - maybe 30 minutes for a Sunday evening and shorter than Grimaldi's.  We got to sit at the counter overlooking the oven and the pizza making station.  \n\nAfter much debate we settled with the #1 large and a Caesars salad.  The salad was very average and too small to be shared 4 ways.  But that wasn't why we were there anyway.  We saw our pizza come out of the oven sizzling.  We were starved from all the walking and dug in as soon as it was delivered. A few bites in and we realized one pie may not have been enough so we ordered a marguerite as backup.  \n\nAs for the #1, it was a little salty but it was good.  The thin crust was light but still a little doughy.   The scallions nicely accompanied the cured Italian bacon.  The marguerite was also good but could have used a little more basil.  \n\nEven though there were a lot of orders ahead of us by the time we ordered the 2nd pie, our order to pushed to the front so it came just as we finished the 1st.   \n\nSo if this is as good as it gets here in NYC, I'm glad to say we're not too far behind back in Cali.   In Fullerton we have Fuoco which serves neapolitan style pizza.  My rudimentary pizza taste buds couldn't discern much difference between the two.  This is good, right?  At least for us in Fullerton.  Yay!", "author": "Pete F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "A tale of how not to eat pizza in New York, as demonstrated by the throngs of tourists waiting outside and the fact that it took me a longer time to sit down than to actually eat the pizza: do NOT use a fork and knife. Do NOT cut the pizza into bite-sized pieces and then lift it daintily to your mouth. This ain't a cucumber crustless sandwich at high tea. And definitely do NOT blot your pizza with a napkin and then eat the sad, oil-less husk of a once beautiful slice. \n\nThis is what you do. Lift it up with one hand. Fold it in half. Chomp down. Repeat. \n\nI can't remember how exactly Juliana's stacks up to Grimaldi's because my only memory of Grimaldi's is waiting 2 hours for pizza that I then devoured in 20 minutes and the mediocre Brooklyn Ice Cream Factory ice cream right after. But I've got the combination of toppings down: 1. Goat cheese.  2. Prosciutto.  3. Sausage with fennel. 4. Arugula.  Sweet onion and pepperoni are optional. \n\nAnd skip the $3.50 \"natural\" sodas. They taste like any other soda in the world.", "author": "Joy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "So I knew I had to have New York-style pizza at least once during my NYC trip and my friend suggested/bookmarked this place for quite some time so we decided to check it out. It was convenient for us because it was in DUMBO area and we just finished having our photoshoot there so why not enjoy some authentic Brooklyn/New York-style pizza? :)\n\nThere wasn't a huge line when we came so I was pleased that we only had to wait about 15ish minutes. As you may have heard, Juliana's used to be the original Grimaldi's but moved next door to this location and changed their name to Juliana's. I was surprised to see two pizza places right next to each other competing for customers haha. I was honestly really excited to try New York-style pizza for the first time, especially after trying Chicago deep dish pizza several years back.\n\nWhen we went inside, we decided to order a large size of the Number 1 Pizza Special which comes with: mozzarella, scamorza affumicata, pancetta* (Italian bacon), scallions and Oregon-grown white truffles in olive oil--no tomato and some Arugula salad. Since it's a special, you can't order half of this and half of another pizza combo. As soon as I had my first bite...like omegawd...it was so effin delicious!!!  It was served fresh and hot and I now know why New York-style pizza is so famous/popular and monumental to every New Yorker haha. I really enjoyed how thin the thin crust was and there was a lot of flavor in the Number 1 special. Salad was nice and light. Service was great as well! \n\nThe reason I gave 4 starts instead of 5 was because for me, I get really bad heartburn easily and after having 3 large slices of pizza, my stomach didn't feel too well. I kinda expected it because pizza is one of the few meals that actually gives me really bad heartburn but hey, it was so worth. I would say that the pizza was also a bit salty because of the Italian bacon scattered on top of it but I definitely enjoyed my experience at Juliana's :)", "author": "Peter V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Got here at about 1pm on a Wednesday after Labor Day ... no line. Had to wait for my family to park the car before they would seat us but no line and several tables open.  I live in Bay Ridge and eat great pizza all the time but this was another level. Fresh, crispy, not burnt.. delicious through and through.  The three of us put away a large margherita with no problem. Highly recommend", "author": "rachel m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "We had 3 different pizza restaurants while in New York and Juliana's was by far the best we had! Great ambiance and delicious New York style pizza, there is a reason the line was out the door.", "author": "LaNae B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "I didn't feel like going completely mainstream and eating at Grimaldi's, but I also wanted generally well-vetted pizza in Dumbo, so Juliana's it was. There was no line when we arrived on a Friday around noon, which was a little unsettling at first, but a) it was packed inside, and b) a roped-off line quickly formed behind us once we got in.\n\nWe shared two small special pizzas (16\") for four people and we had a bunch left over.\n\nNo. 1 (feat. pancetta, scallions, white truffle slices): a very solid non-tomato pizza. I was worried this combination would be too much (read: salty af), but as it turns out, the flavors were as subtle and mild as pancetta/truffle/double cheeses can get. Not too strong of a truffle taste, either, so that can be good or bad depending on your truffle preferences.\n\nNo. 4 (feat. tomato, arugula, prosciutto): Tasted exactly how it reads. Nothing sexy, but a good balance between the bitterness of the arugula and the mellowness of the tomato sauce. I wouldn't rush back to order again, but it was executed well.\n\nCrust: here's where I was impressed. The crusts on both our pizzas walked that fine, fine line between crisp and overcooked, resulting in firmly flexible slices (you feel my oxymoron right?). That doesn't happen often enough in NY pizzas, so I'd come back to Juliana's just on this basis.\n\nOverall, I wouldn't mind returning to Juliana's, now that I know what it's about, but I would have to be in the area. Too many other pizzas to try before making a special trip out here again!", "author": "Brennan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-22", "description": "I've eaten take out from here before and eaten in before but this time it was a very, very bad experience.  The pizza is not worth it, at all. Horrible service from the hostess taking seating.  \nThere is no line outside.  Juliana's offers take out, I asked for a simple take out order, she says \"we do not do take out\" - Yes , you do.  Take note if you want to deal with unnecessary rudeness . I will take a pass.", "author": "Andrey D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "I am not a pizza connoisseur, but I've tried MANY types of pizzas from all around the country and this was the best I've ever had. With most good food, I'll enjoy the first half and then the novelty wears off and I'll just finish the dish for completion's sake. But with my Margherita pizza here, I enjoyed every bite until the last. \nThe restaurant opened at 11:30AM and the line was quick to form out the door. I came at noon and waited about 30 minutes in line. Service was good, probably tough to be acceptable due to how busy it is all of the time.", "author": "Robert B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "So I really wanted to try an \"Authentic New York Pie\". We looked up some recommendations on Google and Yelp and decided to check this place out since it was near the Brooklyn Bridge.\n\nIt's a really nice little pizza place. It was quite busy! They had an area in the front to line up since there were people waiting to be seated. We were greeted by a gentleman and led us to the hostess that was going to show us to our table. They were friendly and we were seated pretty quickly considering it was a full house. You can actually watch them make the pizzas as there was a marble counter you can sit at with a glass pane. They were making them right by the oven but they didn't seem to break a sweat (or lose any eyebrows!)\n\nWe couldn't decide between the Margherita pizza and the White pizza even though the Margherita seems to be a Yelpers favourite. It was awesome to be able to order both on one pizza! The crust was so thin and crispy yet still a bit chewy. The White pizza was cheesy and awesomely garlicky (Is that even a word???) But I definitely loved the Margherita pizza! The sauce was delicious and sweet and the mozzarella was nice and and gooey and stretched out with every bite. I'm salivating just thinking about it again while writing this review. Now I usually love dipping sauce for my crust but the dough was so tasty that I didn't even miss it!\n\nThey also have some local beers available and decided to try the lager. It definitely compliments the pizza.\n\nI want to go back and try more menu items!", "author": "Cris A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Super friendly server and yummy pizza! Bit of a wait but it was worth it. We got the white sauce pizza in a large size for 4 people and it was perfect. 2 slices each. We also got the arugula salad which had the best cherry tomatoes ever. Super fresh and light which was perfect before eating the pizza!", "author": "Brittani K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Awesome folks and awesome service, plus great pizza as always. We had to wait 30 min to get in, but it was well worth it.", "author": "Harris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "This is real NYC pizza. So is Grimaldi's, but it is a tourists trap.\n\nPatsy Grimaldi (yes the same Grimaldi) owns Julianna's and it is just plain better. Better ingredients. Better ambience. It is licensed (Grimaldi's is not)... etc etc.\n\nIf you want REAL NYC pizza, go here.", "author": "Zarbrook S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "The hype for Juliana's Pizza is CRAAAAAY-Z! The quest has finally come to an end! I've had so much pizza the past couple of days that I'll have to wait a month or two to devour another slice again! But the pizza here, is PHENOMENAL! Ordered a Half White Pizza which consisted of mozzarella and garlic and half Margherita Pizza which consisted of tomato, mozzarella and basil. It was beyond delicious and had me wanting for more!", "author": "Shanjida B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-02", "description": "Maybe its because i ordered to-go and it wasnt super fresh but I thought the pizza was just ok, which is kinda disappointing as my first pizza in ny. I got two pizzas. One #1 and one Margererita(sp?) pizza with pepperonis, olives, and peppers on one side plus sausage and mushrooms on the other side.\n\nAfter toasting it myself, it was much better but still kinda lacking for me.\nI think ill give ny pizza another chance but jus somewhere else.\n\nOverall I dont think id come back plus u hafta get a whole pizza instead of jus gettin a slice.", "author": "Frank L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "I really wanted to give this place 5 stars because the experience was so nice, I'm kinda torn between a 4 or 5 rating. \n\nFirst I take my pizza veeeeery seriously, but eating out is so much more than the food.\n\nThere was a 30 min wait to get in, I was expecting longer but this wasn't too bad. I was blown away by how nice and kind the staff was. I was expecting a \"we have a line out the door we don't need your business\" kind of service but this was completely the opposite . The staff is friendly and kind and they want to give you a good experience. They are super jolly, almost like Santa is delivering your pizza. \n\nTables aren't too close together which I really liked. This is a dress up or dress down kind of place, which I also like. Prices were good too.\n\nNow ,the pizza has a delicious flavor, the crust has a unique flavor that I haven't experienced before. I wasn't such a huge fan of the texture, it was slightly chewy for me and that's the one reason I took off the point. \nThere were two types of pizza I tried, margarita - it seemed really popular ,and white pizza. White pizza was the better of the two.\nI never thought I'd make it here but I'm really glad I did. \nThe area (Dumbo) is a favorite of mine, I liked walking down to the water after dinner.", "author": "Hindel m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "The ORIGINAL grimaldis. Once this place opened up, I haven't stepped foot into any grimaldis because they are all inconsistent and not as good. Julianas is worth the wait, but if you go an hour after opening, you can catch the second round so the wait isn't Long. The service is good, quality excellent. My favorite has become the marguerita pizza with pepperoni and sweet onions. It's superb! Though I haven't quite figured out what's the \"best\" pizza in New York, this is it for now.", "author": "Lilian N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Kudos to Staff. Forgot my credit card on recent visit and the staff set it aside for me to pick up next day. Needless to say, I was relieved and appreciated their honesty. In addition, really liked the thin crust pizza they served. I tried 2 pizzas, with and without the tomato sauce, and preferred the one with the red sauce as it had a little more flavor. As I usually reserved my 5 stars ratings for restaurant having a more expansive menu, my 4 stars rating is high for a pizzeria.", "author": "Beau H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "I'm definitely a pizza lover and love trying new pizza places all over brooklyn, and Juliana's has definitely set the bar high! My boyfriend and I came on Monday afternoon to hangout in DUMBO and obviously go to Juliana's to eat lunch. When we got to Juliana's, their was a long line, but it moved relatively quickly. Since we were only 2 we were lucky and got to go in before the two groups of 6 in front of us. \nThe smell in the restaurant just when walking in makes your mouth water, and made me even more excited to try this raved about pizza. Once we were seated our server (I believe his name was Michael) came over quickly brought us some menus and took our drink orders. The menu doesn't have a huge amount of options, but it does have something to satisfy anyone's cravings. Their are a few speciality pies on the menu and than the basic Margarita pie with so many different toppings you can choose to put on your pizza. We decided to go with the spinach salad to split and a margarita pie with sausage. WELL.... the spinach salad was delicious, the balsamic glaze and feta cheese really pulled the whole salad together. I would suggest anyone going to definitely try that salad. As for the pizza all I can say is OMG. In my opinion, Julianna's is definitely top 3 pizza places that I've gone to in Brooklyn. The crust, the sauce, the cheese, everything about the pizza was outrageous. I will without a doubt be back here soon!", "author": "Jessica R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}