{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "It is very famous but nothing special about it.\nJust a long waiting line .there are many better options in a town.", "author": "Amirali S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "Great pizza long lines but worth the wait perfect addition to the neighborhood. If your a tourist from outside of New York this is a must. If you se a local there is other places that are just as good even better. A bit pricey but it is right by the Brooklyn bridge. Again not the best pizza in NY but very good. If you are a tourist in New York you will not be  disappointed prime example of NY style Pizza.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Have eaten here a couple of times... and we must get the same waiter every time.  It's a quintessential NYC place.  Good food with big personalities.\n\nJuliana's pizza is amazing.  So light, so thin and just amazing fresh flavors.  We've eaten at gramaldi's in the past and this is much better.\n\nNo wonder there is always a line... but it is worth the wait.\n\nWe usually add ricotta to the pizza, and it is so rich and creamy... and goes great with the pepperoni pizza.\n\n\nA must if you are in the area and are craving some of NYC's finest pizza.", "author": "Asish P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Came here back in 2010 when it was called Grimaldis so was confused when I walked up and saw Grimaldis at the corner building, and this one in its place. My friend was in NYC the past year and was adamant that Juliana's was the best pie in NYC, but I was sure it was Grimaldis. Decided to try it out, but found out that the real Grimaldis was Juliana's and he had sold the original pizzeria to a previous employee. So the one I went to 8 years ago was an imposter!\n\nAt the time I thought that was the best pizza I had ever had, but I honestly don't remember that much about it since I didn't yelp back then. This time my friend and I got a small margarita with mushrooms and sausage. It was my perfect pie. Thin and crispy with fresh mozzarella and tomato sauce. I also appreciated that the tomato sauce was subtle and not overly acidic. All the flavors melded really well into the pizza.\n\nWe came on a Saturday around 5ish when they reopen for dinner and it was packed. Luckily since we were just two people, it was easy to get a table. We waited like 5 mins as opposed to the group of four who got there at the same time and waited an extra 25 mins.\n\nBelieve the hype, this is the real ny style pizza. By the slice places are good for quick, cheap eats, but if you want a quality pie, make sure you get it fresh here!", "author": "Denise H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Definitely better than Grimaldis, we liked the #6 with Guacamole.\nThere is always a line so u have to b very patient but is worth it.", "author": "Daniel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "While in New York it is hard to ignore the ever present pizza offerings. During previous visits to the fine city, I was a strict vegan but now I eat cheese on occasion so I was stoked to partake in some famous NY pizza. \n\nJuliana's was our second pizza stop while in Brooklyn. We had eaten at the neighboring Grimaldi's the night before and were intrigued by the great debate over which location is best. Although the feud may be a hoax to entice visitors, I still was able to form an opinion about which is better. For me, it was Juliana's. Not only was the pizza better, the atmosphere, ambiance, and menu was better. See my Grimaldi's review for more on Grimaldi's. For now, let's dive into Juliana's.\n\nWe arrived about 30 mins to closing time and there was a line out the door. We were advised that they stop seating at 10pm and we had a 50/50 chance of being seated. It just depended on whether or not enough tables opened up. Given that we were a party of two, we tried our luck and were seated in about 20 mins. Although we arrived so close to closing time, the service was great and nothing was rushed at all so do not let this deter you. They take great care of their customers.\n\nI was glad to see that Juliana's offers alcohol. Grimaldi's did not. I love pizza and beer and was able to answer that calling at Juliana's. We ordered a Margherita pizza and added shitake mushrooms. We ordered the smallest size available and it was large enough for 3-4 people. We had to take some to go but since it was our last night in the city we ended up not being able to eat the leftovers. Unfortunately, they do not offer slices.\n\nThe pizza was delicious. I am a crust lover and the crust here was just right. Not too thin, not too thick- perfect. The sauce to cheese ratio was also perfect. It was not so cheesy that you couldn't taste the toppings and the sauce was just the right amount of tomatoey, without being tangy or overbearing. I also appreciated that they offer shitake or cremini mushrooms as well as a variety of other toppings or specialty pizza's if you don't want to come up with your own concoction. We wanted to keep it simple and the pizza we ordered definitely fit the bill and went down well with our Peroni's. We had anticipated ordering a cannoli but were much too full to fathom that idea after we finished our meal. \n\nThe atmosphere at Juliana's is clean, simple and bright with enough tables to accommodate a large number of parties. There were some large groups (7+) that they easily accommodated so I would say this would be a good spot if you are with a group. I would definitely recommend checking out Juliana's for some authentic NY pizza. After the meal, you can stroll to the pier and capture some amazing NYC skyline pics!", "author": "Lindsey E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "After venturing around Brooklyn on a Sunday afternoon, we decided to grab some grub in the area and Juliana's came up as one of the higher rated restaurants. The food itself was pretty good, but the wait was fairly ridiculous. Juliana's is located right next to the esteemed Grimaldi's, and both places had people waiting outside. We waited for approximately 45 minutes.\n\nThe four of us ordered a large margherita pizza with sausage. True to New York pizza standards, the pizza was very thin and the crust was since and crispy. I like to say that you can't go wrong with margherita and that rung true once more. The sausage, sprinkled in hefty chunks around the pie, a nice dimension.\n\nWhile it was tasty, I don't think the pizza was worth it. Splitting a pizza by four people isn't enough, but for about $31 it's just not worth the price tag.", "author": "Derek Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Located in a beautiful spot near the Brooklyn Bridge, this pizza joint is certainly not as historic as places like Patsy's, John's or Lombardi's but it could certainly go toe-to-toe with the best of New York and maybe even come out on top (IMO).\n\nIt is certainly important to go at the right time of day because many of the locals know about this place and if you try during peak hours, you will have to wait very very patiently for a table.", "author": "Carter G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-18", "description": "Their pizzas are soooo good and staff is super friendly. The outdoor seatings have a great view. There is almost always a line but it moves fairly quick. Never had a take out but they seem very efficient. Love the place and would highly recommend people to try their pizza", "author": "Jenn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "To make it short, one of the best pizzas on nyc. Excellent sauce, dough and I'd prefer a little more cheese but that's just me. Very good service, even though is always quite busy, they take the time to answer your questions. Love it here. Had the margherita and some beer. You have to try it if you're in the area.", "author": "Eduardo O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-23", "description": "3rd or 4th time and I think the quality is slipping. \nWe got a salad and margarita and white pizza. They added dried herbs to margarita which I wasn't a fan of- why mess with good ingredients by adding old oregano? The cheese was a little gummy but the biggest disappointment was the white pizza...maybe they changed ricotta supplier or maybe they're just not applying it right but before it was like Lombardie's with little soft mounds of slightly garlicky ricotta and now...more like a standard slice you'd get at any cheap NYC pizzeria which is fine but that's not why you go to a place like this...\nUgh I hate when fav places fall off just because tourists still line up.", "author": "michelle h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Previously I gave two stars because of an unpleasant experience I had with their marinara pie with added ricotta. I thought maybe the ingredients had been compromised. Management replied to my review explaining how they source their ingredients and make everything fresh.\n\nLong story short, it was the basil, which roasted into something that didn't agree with me. I picked the basil off my leftovers, heated it in the oven, and could taste the Grimaldi pizza that I remember. Of course, the pizza, now a day old, had a soggy crust even after heating it in the oven. It was still good and I got up to get another slice, but got sad to find I just ate the last one.\n\nThe whole experience keeps me from giving 5 stars, especially because half of a large pie wasn't enough for lunch. And I'm not a big girl.\n\nI will go back. And if I order a pizza, I will make sure the basil doesn't get roasted. Interesting what chemistry occurs in the kitchen.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Juliana's made an amazing evening in New York City even better. After brilliant views from DUMBO and Promenade, we decided to head to Juliana's. Now on previous occasions we didn't end up trying Juliana's after seeing the crazy queue outside the restaurant. But this time we were determined and decided to wait as long as it took. And it took quite some time. I believe we waited for 50-55 min after which we got a table for 7. \n\nThe dinner was spectacular. We tried their house special pizza No. 2 and a Margherita. We also ordered a 'make your own pizza' with mushrooms and garlic. Everyone on the table unanimously agreed to the food being delicious. A bottle of Chardonnay(California) was a perfect drink to go with our pizzas. I would say, make an effort to wait in that queue, because you would certainly miss out on something if you decided not to.\n\nQuick tip: you're likely to encounter lesser wait time if you go around 930, but keep in mind that the restaurant shuts at 10. I'm just glad I finally got to try this one.", "author": "Steffi D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "I'm from Brooklyn  and this was my first time coming here and I will say that I read all the reviews before going so I had high expectations. The wait wasn't that bad but the pizza was average. And the ac made my pizza cold by the 2nd slice  we also ordered the lemonade and it was nasty so we ended up getting the Manhattan orange soda. Over all I dont have any plans on returning one time was good enough. Next door at grinaldis was better. I hope my review was helpful to non tourists who have enjoyed NEW YORK pizza before", "author": "Jacqueline C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-19", "description": "We went here because of Yelp. There was waiting line but it was quickly. However, the pizza was too soft, bacon and pepperoni was salty. Was not delicious as we expected it to be.", "author": "Christina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "We came here around 8pm on a Sunday night after visiting the Brooklyn bridge nearby. There was a line out the door and I'd say we waited for about 20-30 minutes? felt really long since we were waiting out in the cold.\n\nWe were finally seated and ordered the housemade meatballs with tomato sauce and the margherita pizza with added sausage and pepperoni as toppings. With the additional toppings, the pizza came out to be a little pricey for a small size - $26 I believe. The meatballs were also $12 for just 3..The pizza was very good in my opinion, the dough and crust were soft and not super hard and chewy like some other places. The pizza was not too thin and not too thick, just the perfect size. It had the perfect amount of pepperoni and sausage and cheese as well. It was very flavorful and had great texture in the dough. It even tasted good cold! (I had it the next morning for breakfast in our hotel and I usually do not like cold pizza.) The meatballs, however, I would pass on next time. The meatballs were not very flavorful and the texture was a little too soft for my liking. I've definitely had better meatballs elsewhere, so I would probably just stick to ordering their pizza if I get a chance to visit again next time. My recommendation? Get the margherita pizza with pepperoni and sausage!!", "author": "Bailey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "Im from the west coast (san diego)..we got two restaurants down there that can only touch NY style pizza..1 is Urban and Bar Basic.both are from the same ownership that use east coast style brick ovens for their pizza..the pizza is on point..Butttt...\n\nnot til i decided to come over to the East Coast and decided to hit up Julianas by chance (after takin touristy shotz of Granite Prospect (Brooklyn Bridge Park)..i heard about the competitor next door (Grimal...) but decided to go w the line that was a bit shorter cuz of the pressed time we had, but man the white cheese pizza was bomb.com (with pepporinis and cremini mushrooms added).\n\nSo i ordered a small pie for a friend and I which had 8 slices (most small size pie in NY would be considered 6 slices, but here its based on the diameter of pizza) and Julianas didnt disappoint. Savioring each bite as I reached my 4th slice, I began to appreciate the whole concept of NY pizza especially white pizza.\n\nThe pizza was earthy and fluffy like a sip of Starbucks Pike Roast. the volume of the thin crust pie was soft like a pillsbury doughboy and the mazzarella cheese felt godly. by that I mean it wasnt greasy like regular pizza chains. Theres an effort that was put forth towards making a delicious pie here at Julianas, kinda like selecting your best NY steak house. \n\nthe line wasnt too bad (about 5-7minute wait), but had to consider we got there arnd 1215pm on a work day Friday..the line grew however arnd 1pm. \n\nas a tourist from San Diego, Julianas is definitely worth your time after taking photos at Brooklyn Bridge Park and Dumbo. Make sure to take a photo of your pie before your friends get to it...so you can hashtag it under #Julianas #Julianaspizza #NYC and whatever hashtag is in your mind for the world to see! haha! peace!\n@emceeomg @BkPkAdventures (IG)", "author": "Alvin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "How often do you find New York local waiting in line for Juliana's - not that often. How often do you find two girls finishing 18\" pie in one sitting - also not that often. Julianas delivers above average New York style pizza and great service (cute waiter).", "author": "Sophia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Ordered a small pizza ($20) to go, half white with Cremini mushrooms (+$3) and fennel sausage (+$4) and half margherita. Flavors, sauce, cheese, crust were on point. As with any good joint, long lines. Called and ordered pizza to go and had to wait an hour to get pizza but worth it. Order to go and walk across the street to the pier for a nice view. Pizza and sunset view of city on the pier nothing better than that.", "author": "E C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Juliana's pizza what more can I say about this place ! How do you create a magnificent pizzeria sell it, and then open another one right next to it and beat out a Brooklyn pizza landmark (Grimaldi's) which you made famous with a new one that clearly soared and created a buzz. I waited on line for like 30 minutes maybe more. So worth it. Great meal. Would come back and I recommend just plan accordingly", "author": "Derek S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}