{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "The line was a turn off for me and the pizza was just okay. The manager was was nice enough to let people in when it was raining outside but I still wouldn't wait in line again. We tried the no1 on the pizza menu and it was made with fresher ingredients but nothing special. The bussers were resetting the table for the next group while we were still sitting down which I thought was rude.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Omg - outstanding wood fired pizza! Four of us shared a small margarita and small sausage/pepperoni (small=8 cut) and two Cesar salads. We had four pieces of pizza left over. This pizza was killer, we sat at the counter and watched Marco make the  like a crazy little pro. Would look up and smile once in a great while! Would definitely revisit again, worth the walk from Manhattan and the craziness on the bridge, then the 1/2-45 min wait for a table. EXCELLENT!!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Hands down my favorite pizzeria. It's delicious. No one can beat this place. Not even Grimaldi's. It's seriously soooo good. The pizza comes to your table piping hot (so does Grimald's). What differentiates Juliana's from Grimaldi's is the consistency. Every time we come to Juliana's, our pizza tastes exactly the same as the last time. We are creatures of habit,  my boyfriend and I only gets the margarita pie with sausage, pepperoni, and garlic. It's so good, you do not need any additional spices. Sorry red chili flakes and garlic powder, I'm taking about you. As for Grimaldi's, it's good but not always. The last time we went to Grimaldi's, the dough was a little too tough and chewy. So stick with Juliana's. It is worth the wait.", "author": "Vivian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Having not been to this location since it was Grimaldi's (yes I know they opened up the street) I thought I would try it out since people are still lining up after all these years.\n\nWhat has changed: the decor has clearly been upgraded with a new restaurant \"feel\" to the dining area.  Upscale, clean and functional are words I would use to describe it.  It is still PACKED though and tourists with delicate sensibilities and need for \"space\" will be in for some discomfort.  \n\nThe service was very *nice* and I don't say that in a snarky way.  From the host to the server we were treated well and I don't recall Grimaldi's of the past being so damn nice.  A plus when you're spending hard-earned dough on pizza.\n\nWhat hasn't changed: the GREAT pizza.  Juliana's has taken the torch from Grimaldi's and kept this place in good hands.  The cook who pours some olive oil from the olive oil can on each pie, the coal oven that is still working overtime, and the delicious neopolitan pies are all still here.  We had the special with scarmorza and pancetta (white pie) was amazing.  The standard margherita was very good.\n\nAnother thing that hasn't changed is the line which I mentioned.  We got there at the beginning of lunch on a Saturday and it moved very efficiently but be prepared to wait at busy times.\n\nYou have to go to this place.", "author": "A O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Bring back the anti pasta and tortoni and I'll add a star! Pizza is awesome as usual though", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "While vacationing in Manhattan, we made our way over to Brooklyn. At first, we were put off by the extremely long line outside of Juliana's and the fact that they would not take any reservations or have any type of list (and the lady on the phone was very abrupt, maybe even a little rude when I called to ask). We walked around, grabbed a snack at another restaurant and then eventually decided to brave the line. It was well worth the wait. Inside the restaurant is cute, nothing special, but has that authentic feel. We ordered two large pizzas and they were amazing! I grew up in a household where pizza was taken very seriously and we had family members in the pizza restaurant business, and I can honestly say this was some of the best pizza I've ever had. You won't be disappointed!", "author": "Samin V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Mr. Grimaldi was actually there the last time I went. A true gentleman and makes one of the best pizzas you will ever have. One year I went to Juliana's to watch the fireworks near the bridge on the 4th of July and they still let us in as they were closing. World class pizza and customer service.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "By far, the best coal-fired pizza I've ever had in my life. The service was excellent and we got seated pretty quickly. If I'm ever in the area, I'll definitely be back.", "author": "Zach D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "Juliana's Pizza is a must-try if you're in NYC. This restaurant is founded by the original owner of Grimaldi's. Did you know that Patsy is a guy's name? LOL.\n\nDH, who doesn't like New York Style Pizza said, \"I didn't know New York pizza could be that good.\" The line wasn't that long. They're efficient and we waited for about 10 minutes.\n\nWe were hungry and 2 large pizzas were perfect for our party of 4. We added sausage to the Margherita pizza, which gave it a nice saltiness. The crust was perfectly crisp on the bottom and the upper layers of dough were chewy. Excellent bready flavor. Awesome bubbly caramelization on the mozzarella. Delicious, well balanced tomato sauce. They were skimpy on the basil, though. Still, quite yummy!\n\nThe other pizza we ordered was the No 1: a white pizza with housemade mozzarella and scamorza affumicata (an Italian mozzarella-like cheese, smoked), pancetta, scallions, and white truffle in olive oil. I'm getting hungry just thinking of this. Everyone loved this pizza. Such an awesome combo of salty, creamy, smoky flavors. We couldn't taste the white truffle...it's so delicate the flavor gets lost. Still great without it. Definitely get this pizza!\n\nOverall, worth a stop if you're in NYC. I'll be dreaming of their pizza here on the West Coast!", "author": "Kari C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "The best pizza I've had in NYC so far. Sometimes there's a wait and it tends to get busy in there at times but it's well worth it.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "We arrived around 6:30 on a rainy Tuesday night. No wait at all. There are bar tables where you can watch the guys making pies, pretty cool. We ordered No. 4 from their specialty pizzas and a cannoli. I don't have fancy vocabulary to describe a pizza, but all I can say is I enjoyed it so much! A small one is pretty big 16\", the large one is 18\". Two people can easily share a small pizza plus a few sides and/or drinks. Cannoli and other desserts are not made on site, but it's still pretty good.", "author": "Simon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "There's a reason this place is one of the highest, if not top, rated pizzerias in the country. We ordered the #1 and #4 specialty pies and they were served in less than 20 minutes, baked to chewy, savory perfection. Our meal was best enjoyed with a cold chalice of War Flag, but Juliana's offered an impressive array of beverages, along with a some salads and desserts. Our server, Paul, was attentive and amicable, and we left our late lunch satisfied in all aspects.\n\nI took some leftover slices in a box to-go, but couldn't wait until I got back to the apartment: I caved and partook again on the subway. It's flavor, if you were wondering, holds up. \n\nPatsy Grimaldi's legend lives on through his artful mastery of the pizza slice, and Juliana's Pizza is undisputed proof. I can't wait until I find myself here again.", "author": "Jadon R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "My friend and I got on a thirty minute subway ride and walked in the rain at night to get to this spot because of how amazing it was supposed to be. Let me be clear... we were on vacation from Southern California and had extensively researched the \"best\" pizza places in NYC prior to the trip planning on trying every single one too see which really was three best. After a week and several pizza places later....ding ding ding we have a winner!!!! So sad we discovered the place at the end. I would have made that to every day of our vacation. Next time! If you are wanting the best pizza in NYC, forget the blogs, online articles, and Pinterest. Look no further than Juliana's. Margherita pizza is the best.", "author": "Alissa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I'll be honest, I wanted to go eat next door. That's where everyone recomended I go. However their over was closed, and it was raining, so I found myself next door. It turns out that was a great choice because of the history of Juliana's, and I was getting close to the same product, some may even argue better. I can't compare, but I can tell you that Juliana's pie is absolutely amazing. One of my favorite pizzas I have ever eaten, and I have eaten a ton of pizza. A+", "author": "Joey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Our group is walked the Brooklyn Bridge on Saturday and wound up here about 1:30. We had the margherita pizza, the white pizza, and the marinara pizza that has no cheese. They were all delicious! Our server was a fine young man. (I wish I could remember his name.) Yes, the line was long, but it was well worth the wait!", "author": "Joyce A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Juliana's is actually located right next to another, and probably more well known, pizzeria by the name of Grimaldi's.  Grimaldi's looked pretty busy as we passed it on our way to Juliana's and that made me worry that Juliana's would have a wait.  However, when we arrived at Juliana's, around noon, all fears proved unfounded as we were seated immediately.  I loooove pizza and Juliana's was my first taste of what Brooklyn had to offer in terms of those slices of heaven.  \n\nWe ordered the margherita pizza and I have to say.  Wow!  Are all Brooklyn pizzerias this good?  I took my first bite and what immediately struck me was the texture of the crust.  It was a beautiful combination of slightly crispy and slightly soft.  I have never had a better crust!  In addition, the sauce was outstanding.  It was tangy and tasted really fresh.  The mozzarella cheese was also top notch.  It was gooey, stringy and delicious.  Basically everything the cheese on a pizza should be.\n\nBottom line: I have visited NYC on many occasions, but this was my first time in Brooklyn and all I can say is I have been missing out!  Manhattan has great pizza but Juliana's takes the pie!", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "YUM!!\n\nComing from Cali, there really isn't an exquisite \"California\" pizza.  What I considered as good pizza in Cali was Pizza Hut and Papa John's.  Not to say they weren't bad, but they were the only ones I knew.  Thus, I was shocked when I came to New York, and my new friends called the pizza joints I was familiar with as \"trash\".\n\nJuliana's was my first official pizza restaurant I tried in the City, and what a great first choice!  I heard about the interesting history of Grimaldi's and the move to Juliana's.  This was known as the \"better\", underground pizza joint.  I was super stoked to try it out after hearing all the hype!\n\nI ordered the margarita pizza (simple mozzarella, tomato sauce, and basil leaves), and it was wonderful!  Even though it was popular, I wasn't very fond of the No. 1 pizza special.  I thought it was a little salty and the blend of the affumicata, white truffles, and scallions was too much for m.  The wait for the pizza pies wasn't too long and actually quite shorter than I expected, compared to other made to order pizza joints.  The pizza sizes are HUGE and are made for sharing, so make sure to come hungry!\n\nI love bringing friends to Juliana's, proudly calling it a legit pizza place compared to Cali's.  Can't wait to come back and try the other pies and desserts!", "author": "Kim H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "The Patsy Grimaldi story is a complex saga of pizza love, loyalty and betrayal.\nAnd really amazing pizza.\nLong story short: Patsy Grimaldi sold Grimaldi's on 19 Old Fulton street to Frank Ciolli in 1998. Frank Ciolli began opening Grimaldi chains in 2003. From 2003 to 2005, the Ciolli and Grimaldi's relationship soured, the business relations ended. In 2005, a rent dispute between Frank Ciolli and his landlord led to Ciolli's eviction. Which lent Patsy Grimaldi the opportunity to make pizzas again.\n \nRegardless of the pizza drama, the coal fueled brick oven has remained. And the space remodeled to black tables and silver chairs. Feels less claustrophobic compared to their 2008 classic pizza joint seating. \n\nAnd the food? And the cheese is fresh and the sauce is sweet without being cloying. The charred crust is lacking the crispness of previous visits but they just reopened. For Patsy Grimaldi, I'm willing to give them the benefit of doubt.\n\nTrust me, go have a pie or two. You won't regret it.", "author": "Doreen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Excellent service, good pizza. Perhaps a little more hype than the pizza was worthy of, but I was raised on Chicago-style pizza.  I may not be the best person to judge NY pie!", "author": "Melissa J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "They have good sausage, the cheese is a little rubbery and tasteless. overhyped. enjoyed bar seating!", "author": "Amy W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}