{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "it was amazing. the pizza with the white sauce brings out a taste you can never forget.", "author": "Min Young P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "WONDERFUL and DELIGHTFUL  and all levels. The BEST pizza in brooklyn!  I recommend this place to all my friends. It's a place i go to for my meetings. It's not too loud its comfortable with great food and service.", "author": "Yesenia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Great pizza!  Don't be miss lead by the knock off next door.  This is truly the best pizza in NY", "author": "Diane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "The \"original\" Grimaldi's. Mr. Grimaldi himself greeted us at the door. The ambiance was so much nicer than next door, and so was our waiter. Great coal oven pizza. We had a large Margarita Pizza with sausage, pepperoni and onions. The three of us finished it! Very kid friendly. Good highchair and quick service. Oh and don't forget dessert! One of the best cannoli's I've ever had. The only place I will eat pizza in NYC. An easy walk over the bridge or ferry ride.", "author": "Kari D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "We had the No. 1 - (Mozzarella, Scamorza affumicata, pancetta* (Italian bacon), scallions and Oregon-grown white truffles in olive oil). Simply put it was to die for. The ingredients were incredibly fresh, the pie was cooked to perfection, and service was exceptional. Definitely the best pizza i have ever tasted.", "author": "TE B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-16", "description": "Well there is no accounting for taste! This place was awful on many levels, atmosphere, service, food and prices, and the latter outrageous! I read the reviews here and I am happy to see so many happy customers and frankly it only leads me to believe there is always something out there for everyone's taste! This one just isn't for me.\nI am a native New Yorker and I was in the area and my buddy said we had to go here, so we did. We ordered a large bacon, mozzarella pizza and a small margarita. The bacon pizza was like eating raw pork fat, the bacon was undercooked and floating  in it s own grease on top of a soggy dough and mozzarella. I called EMS because I was sure I was going to have heart failure!\nMy mouth had this smokey bacon feeling for the rest of the day and night. It was just one heavy fatty mess! YUCK!!\nThe margarita was not much better, soggy undercooked dough with a sauce seasoned with too much oregano,this was way below average for a brick oven pizza.\nThe dough is too soft, undercooked, the sauce and mozzarella watery and slides off the dough if you are not careful. Not even close to some of the better pizza places in town.\nNow to the service, who are these people?! What is it with the sassy waiters and waitresses? Is that necessary? I asked politely for the small margarita and the waitress barked back at me \"you know that is not a personal pizza\"!!!\nWell OK! What was the point of scolding me?! I don't get it.\nThe place was 1/3 full but dear God you couldn't hear yourself think, it was one of the noisiest places I ever ate at, my ears are still ringing!\nNow the price, WOA!! $80.00 for one small pie, and one large pie, and 2 small bottles of coke, are they kidding? I'm sure from the reviews here they will not miss me but I promise you never will I enter Julianna's again!", "author": "Christopher V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-13", "description": "Pizza is mediocre... I'd compare it to DiGiorno's if anything.  Don't believe me?  ... see for yourself.  Oh, and don't bother to try and expect you can order take-out... seems Juliana's thinks they can just selectively decide when customers can call and place take-out orders on the day.  As a businessman I understand why they would incorporate such a practice but that kind of inconsistent behavior toward consumers and especially neighborhood regulars is at least to my mind a completely irresponsible business practice and is exactly why they are never included on anyone's top-ten (or more) pizza places in the city.  And why Di Fara's always takes the cake there!  They have made their business solely off the much played up and commercialized spat between them and Grimaldi's.  Hey... it's just pizza.   If you want something special head to Barboncinos in Crown Heights!  They have one item on the menu... PIZZA.  Done right, no fuss and no chip on their shoulder!  Peace, pizza lovers!", "author": "Aaron M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "Great pizza and great service. Reasonable price and a large pizza is enough for two people.", "author": "Thelap V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-30", "description": "The pizza was great \u0026 the staff friendly. Everything was great till just about the end, when two people from our group went out to smoke. The owner asked us if we were ordering anything \u0026 I ordered dessert. He asked if the two people had left \u0026 we said no they were outside. A few minutes later he comes back \u0026 takes the two empty chairs away. Then asks us to move to a smaller table. Two of us had to eat dessert standing... All of this because there was a big party that needed chairs. We almost got tossed out because the owner wanted more business. Loved the pizza but will not go back.", "author": "M N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-03", "description": "I remembered eating Grimaldi's when I was in high school with my family before it moved to the new building. I remembered that first bite I had with the original margherita pizza and I could still remember that phenomenal taste. I could still remember how fresh and perfect the crust was. The margherita sauce and the mozzarella cheese were amazing and fresh. \nAfter that, I haven't been to Grimaldi's that often since I studied abroad to Italy and had an Italian food break from my 3 months of staying in Italy. I wasn't aware that Grimaldi's moved into a new building until about a month ago when I started craving for Grimaldi's pizza in Brooklyn. \n\nI tried Grimaldi's pizza (the one next to Juliana's) a month ago and when i tried the pizza again, it didn't taste or feel the same as it did when I ate their pizza during high school. (I know this is a long time ago but I'm pretty sensitive to taste. I like the sensation of eating food where it makes me reminisce the time I had with my family). As I went out, I realized that Juliana's pizza is next door where Grimaldi's pizza originally was.\n\nAnd so... A month later, after taking some time to travel from queens to Brooklyn to eat some pizza, my first bite of Juliana's pizza was like this. It was exactly (if not, actually better) like the pizza I had when I was in high school. I actually started to reminisce the time i enjoyed the original Grimaldi's pizza with my friends and family that i came here with. Their pizza is similar to pizza that was made in Italy. the mozzarella cheese may not be as strong as the cheese in Napoli but the way Juliana's pizza make their crust is still amazing (I would say better than Italy). As an added bonus, they put a lot of basil compared to pizzas in Italy. (In Italy, most pizza restaurants put 1 basil leaf in a pie and it's usually extremely burnt.. ) i ordered the special no. 1 and the original margherita pizza. I'm not too crazy about the special pizza pie. I personally like the original margherita pizza with my own toppings. The Brookie Bridge was a nice idea but I would rather just eat the ice without the fudge. I thought it was a little bit sweet for me. \n\nSo as a whole.... Juliana's has the best pizza in New York. I don't know the full details about Grimaldi's division from the original building, but if any of you want to try the actual, original Grimaldi's pizza, you need to eat at Juliana's. Patsy Grimaldi (the pizza chef) works there and he's da man.", "author": "Amanda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "This is the original owner of Grimaldi's next door. If you like thin and crispy crust, this is the best brick oven pizzeria in NYC. We got to meet Patsy Grimaldi - the owner who was really nice. The staff are also very friendly. The only reason I am not giving them a 5 star is because they didn't use real tomatoes in their signature margherita pizza. They used canned tomato sauce. It was good but i've had it somewhere else and at home where real tomatoes are used and it really makes a difference. We asked the waiter but he just said No and that it wasn't even an option. If you want to see the guys making your pizza, you gotta sit at the bar.  End of December to New Year's - this place is a zoo! So make sure you call ahead to find out if there is a wait time if you don't wanna wait in line out in the cold. You could be in line for up to two hours if you come in the New Year's season.", "author": "Anna R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Pretty great pizza, and you've definitely got a better chance of getting in here than Grimaldi's!", "author": "Matt C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-13", "description": "We came here for dinner and was happy that there wasn't a line. We ordered the margherita pizza, prosciutto and arugula pizza and a Caesar Salad. Both were great. Place was very clean. The only thing weird was when we asked for our pizza to be packed, the worker folded our slices of pizza and dumped it into a bag for us to bring home. At first, I thought they didn't have any take out boxes. I assumed wrong. There was plenty, so I don't know what his problem was. We had a lot of pizza left and was ticked off that he treated us like that. Why he didn't put both pies in a box rather than folding it and dumping in a bag is a mystery.", "author": "L W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "excellent food, huge portions good prices. wait staff courteous and pleasant   we had the pizza 1. white pizza ( no red sauce) truffle oil , prosciutto.  to die for", "author": "Armando S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "I visited this great pizza place while on vacation on June 30 after researching for the 10 best pizzas in NYC. The pizza was the best I've ever had \u0026 the service was great!", "author": "Paul W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "So much better than Grimaldi 's - although very ironic to say that given that Mr. Grimaldi is actually the owner and chef at Juliana's and sold the name Grimaldi years ago to the pizza joint up the street. For over thirty years New Yorkers thought they were eating New York's best pizza at Grimaldi's. But when Mr. Grimaldi returned to Brooklyn two years ago, we all discovered that no one - and I mean no one - can top a pie made by Mr. Grimaldi. We laugh when we pass Grimaldi's now. We look at all the tourists lining up there based on reviews in outdated guidebooks. None of them realize that the authentic experience they are searching for is at Juliana's, not Grimaldi's. Personally, I can only hope that this ruse continues since I don't want to wait any longer for a table at Juliana's. Soon enough though I will have to suffer the long lines of the past when there was just one pizza joint in these parts. Such is life.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Absolutely love the pizza here. The crust isn't to thick and it is always baked to perfection, the sauce is not overwhelming and the cheese is phenomenal. I would recommend this pizza to anyone visiting Brooklyn!", "author": "Izrail T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Delicious. WELL worth the wait. The food \u0026 service were unbelievable, and Patsy Grimaldi was right there making sure we were all taken care of.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-04", "description": "We popped over to Juliana's for a pizza after the wait at Grimaldi's was too long to endure on a Saturday afternoon. I'm so happy we did. We were seated quickly, and the restaurant is oozing with a casual, familial charm. We shared a large proscuitto and arugula pizza between the four of us, and it did not disappoint. The crust was thin and crisp, with just enough toothsome chewiness to make it delicious. There were generous amounts of proscuitto and a sprinkling of peppery arugula, and everything complemented perfectly. If you find yourself in Dumbo, you can't go wrong with a meal at Juliana's.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "So happy Patsy opened this up and reclaimed his pizza name. Love this place, happy to have it in the neighborhood! Please all you tourists keep waiting in line at Grimaldi's so the locals can go to Juliana's.", "author": "Rebecca S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}