{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "WOWWW. I was curious to try this place and I'm so glad I did! \n\nThe waiter was nice and fast although the place was busy even towards closing time.\n\nI had a small Margherita Pizza with a friend and it was absolutely DELICIOUS. I also had a voluptuous glass of wine. Everything on that pizza tasted sooo right. The sauce was surprisingly perfect. It's easy to screw up something simple and it's so hard to find perfection. It has to be one of the best pizzas I've had in the city. I can't wait to go back.\n\nLET THE TOURISTS HAVE GRIMALDI'S! \nWe have Juliana's and they actually live up to the hype.", "author": "Carina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Best. Pizza. Ever. Worth every bit of the wait! We tried about 5 different pizza places during our stay and this place knocked every other pizza place out of the park! Servers we're very nice and the pizza was exactly what we expect from a NYC pizza. Will definitely recommend! (Also, pizza goes great with a local craft beer)", "author": "Jen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Pretty good. We walked in after a long walk on the bridge and around the neighborhood. Grimaldis as usual had a long line and honestly I dont get the hype..Juliannas pizza is just as good and pretty fast service.Though the place is quiet small. We were in and out in 15- 20 mins.. The pizza was made fast and the hostess was nice and attentive. No complains. \nWe just picked up the pizza and ate it in the park, near the Ice cream Factory. \nIt was a great experience :)", "author": "Mehwish K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "We were staying near the seaport area,  so we made a trip to try this place.  It was Tuesday night so it was not too crowded,  so we were able to get seated right away.   It has somewhat upscale look and feel and service was pretty good. \n\nThey have a pretty good variety of beer.  I ordered Apple cider and my hubby got Brooklyn ale winter special and both were yummy.   \nWe originally wanted to order half margherita and half special number 1 pizza.   However,  when we asked to our server,  he said we can't order special pizza and regular pizza together.   But he tried to give us alternatives to accommodate us.   At the end, We decided to go with a large special number 1 pizza instead though.   The pizza was delicious!!\n\nWe wanted to order the dessert but to full.   We have been to gimaldi's also.   I know it is not accurate comparison as we did not order exact the sane pizza.   However, we liked juliana's more in every aspect.   We would love to come back when we get a chance. \n\nOverall experience: 4 stars\nFoods: 4 stars\nService: 4 stars\nAtmosphere: 4 stars", "author": "Jeannie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Food is an important ingredient to having a successful restaurant.  The other is service.  Mr. Grimaldi and the staff at Juliana's demonstrate great service while serving a finely crafted product. \n\nI had the arugula salad and signature Margherita pizza.  The salad had the right amount of dressing to allow enjoyment of the ingredient's natural flavors. The pizza also had the right amount of ingredients with a thin crust to permit enjoyment of the ingredients individual flavors.  The sauce is not very salty and the whole product not too oily. \n\nCooking, in general, when done properly maintains a balance between ingredients and finished product.  Juliana's gets it right and maintains the balance. I also like the openness of the kitchen. You can also watch the pizza being prepared, which reflects comfort with the craft and honesty with the process.", "author": "Antoine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Here is the first pizza place that I had in NYC ! Cross the Brooklyn bridge we kind of hungry so we found this place .. The place is not too big but it's cute and simple ! When we decided to had a dinner here we get the great service .. We want order two different pizza but when we saw the pizza size .. We know that we can not order two .. Cuz we only have two people .. Small size already let us full .. We can not have anymore pizza after our small size pizza !! Inside the restaurant was clean .. The service super ! Merci  ! The magherita pizza was amazing !!!!! Next time when we travel here we will come again !", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "1 hour wait on a cold Thursday night at 7pm. $30 specialty pizza with a thin blackened crust. $9 glass of wine. Time well spent. Worth every penny.", "author": "Igor G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "We loved the Caesar with white anchovies.  Honestly those anchovies are worth the salad.  And the we got number 4 pizza.  The Barbera was great.  I would come back again.  The fact that they took credit cards sealed the deal.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-25", "description": "This place is fine, but it's not the best pizza in the world and its not worth waiting in line for.  We had the margherita and the arugula prosciutto.  The dough is tasty, but the sauce leaves a little to be desired.", "author": "Nia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "DElicious!!! Everyone keep telling us that the best pizza is in Brooklyn. I have to agree! I was definitely good. Ordered the White pizza and the Margarita w/ pepperoni. I was yummy in my tummy. Cheese and sauce was perfect!! I wished i had a slice right now.", "author": "Joann P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Awesome pizza. And a great experience overall. Stumped across this place accidentally while going to the Brooklyn Bridge. Servers were great at recommendations.", "author": "Madhur M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "I used to be a die hard pizza addict and worked pretty close to this area which meant I was at Grimaldis on a monthly basis. Then I moved away and that's when Grinaldis switched locations and this pizza place opened. \nWhen I came to visit some freinds I stopped at the new Gramaldis location, waited on the long line, and ended up with average pizza. \nToday the bf and I decided to go relax in Brooklyn Bridge Park and wanted to get some pizza so we stopped here. It was fast and fantastic! The line was 3x shorter then grimaldis next door, we were at a table in 20 minutes and this was at 6:30pm dinner time. We had a waiter at our table in just a few minutes and the pizza was at our table in another 15-20. The pizza was delicious, we got Margarita pizza and both of us were very happy with it.\nOverall it was a great experience at a touristy place where I didn't expect that speed and deliciousness.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "As expected there was a wait when we arrived around 7pm on a Saturday but it was only 15 minutes before we were sat. We went a simple route since we were splitting it and ordered the margarita and sausage/pepperoni. Both were delicious!! Everything tasted fresh, especially loved the pepperoni and sausage. We will be back!", "author": "Britany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Delicious!!! Fresh and beautiful ingredients. Authentic taste. Downside is that it's very crowded inside. And you feel like you're in the way if you have to wait outside the bathroom because waiters need to walk past you constantly. And it's pricey for sure. But worth it!", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-22", "description": "Really, really disappointed after the excellent Zagat rating and Yelp reviews. There was no line when I showed up around 5 for an early dinner.\nThe decor, service, and food were all sub-par. We only saw our waiter twice, and we had to ask for him both times. He explained they were 'out' of about half of the toppings, but somehow the next table got their pizza with pepperoni 15 minutes after I was told I couldn't. On my way to the bathroom I saw them chipping away at a bin of sausage, so it seems like the frozen toppings just weren't defrosted yet. That's right, frozen toppings. The restaurant is very cheaply decorated, the light fixtures look like they came from bed bath and beyond. \nI don't understand the hype and strongly recommend waiting on line for Grimaldi's. Despite the rave reviews they display outside, Juliana's just isn't nearly as good.\n\nedit: I've learned from a direct message that the toppings aren't frozen, but do get covered in ice from cold storage - which I still find unappetizing.", "author": "Ricky M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "One of the best pizzas and meatballs I have ever had. This is my second time back here and I am coming back again and again. Love this place. \n\nWe had to wait outside on line but the line does move. We stood outside, both times, for about a half hour, which isn't that bad. The first time I sat at a table, the second time I sat on the chairs by the oven. While it was cool to see the pizzas being made in front of you, just be warned that it is hot. You can feel the heat of the oven which got annoying at times because it was just too hot. \n\nOverall, great great pizza and I will be back again!", "author": "Becca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Best pizza I tried in New York so far. Everyone should totally go for their No.1 and make their own combination. Don't forget you can do half and half for different flavors, their pizza are thin and well-made, crispy but not too greasy.... And they smell so good!", "author": "Estella L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Simply the best. \nGreat service, nice atmosphere. \nPizza is so so good, along with the apps and coffee, espresso!", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Delicious. I ordered the margarita and garlic pizza. Margarita was excellent. So worth the calories.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Last year, I was walking around Brooklyn with someone when a man decided to help us lost kids. He had lived in the area for many years so he knew everything we needed to know. He had told us about the history of this restaurant and that's when my company and I decided to eat here. We had to wait a bit as there was a line. We sat down looked at the menu and decided to order a large Half and Half of Margherita and white pizza. The waiter warned us how big large was for two people, but his doubt on how much we can eat made us want the large even more. The pizza took most of the space on our small table. Then as I took a bite on a slice it was so fresh with the right amount of sauce and cheese. They did thin crust well. The crust was crisp just right. Anyways, forget the pizza place next door,  this is where you should stop by. Also,  we finished that large pizza. We were full but we enjoyed each bite.", "author": "Anna J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}