{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "Response to previous review... I am sure this was the place because we chose this restaurant due to your reviews. I checked my credit card statement and reconfirmed it because I would feel horrible if I left a negative review on the wrong place specially with your very well written response. I also second guessed myself  because your site now states the hours you mention in your response.  I am sorry but I am certain.", "author": "Sonny D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Checked out this place while taking a trip to New York. Had took wait for about 45 minutes in a short line to get into the restaurant. When we left though, the line has quadrupled so I would recommend placing a to-go order if you just want to eat there pizza. The dining experience was enjoyable but not out of this world. We got the number 1 pizza for 4 of us to share. Came with 8 slices and was really good. Even though we knew it was greasy it came across very \"clean\". Overall, if you're looking for a good New York style pizza, this may be the place to go.", "author": "Paul N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "We tried both Grimaldis and Julianna's pizzas I'm the span of a week. And in the end Julianna's won. The taste is far superior. This is definitely worth the wait. \n\nIf you want to skip the line just order the pizza to go and walk over to the park and enjoy it outdoors (weather permitting ofcourse).", "author": "Ruhia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Food was superb, the best New York style pizza I've ever tried! As a party of 6 we tried 3 different pizzas, all of which did not disappoint! They were so big, delicious, and the crust was perfectly thin without being burned. Most notably we had a EXCELLENT time thanks to our server Trimell! He took the time to explain everything and walked us through the ordering process. He was so friendly and attentive and made our dinner worthwhile! Definitely will be back next time I'm in the city!", "author": "Bailey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Margherita pizza is awesome. Got it to go and ate in the park", "author": "Duke A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "I was craving good pizza and in NYC it's hard to choose a place because there are sooo many good ones to pick from. I saw this place had good reviews on yelp and decided to give it a try. We ordered Italian hot chocolate because it was cold out and a large margharita pepperoni pizza. The pizza was good, we were pleased. The small pepperonis they use are delicious! Next time I'd order a different kind of pie just to try something different.", "author": "Mayra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "Both my wife and I stopped into Julianas after walking the Brooklyn Bridge from Manhattan.\nIt was so delishhhhh. \nWe ordered the Margerita pizza with a Caesar salad. We had great service and had awesome pizza.\n\nThanks Julianas....", "author": "Jay J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "The Classic Margherita = perfection at its finest! A.M.A.Z.I.N.G. After walking from Manhattan and over the Brooklyn Bridge, pizza from this place was a pure treat! Owned by Mr. Patsy Grimaldi - who is very friendly. Pleasant atmosphere w/in the restaurant. Pretty quick if ordering for carry out and an easy walk from the nearest subway stop. I'M A FAN.", "author": "Pina U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "One large pizza is more than enough for 2, it can probably feed 3, but you should just order a large and save the rest for a great snack.  This pizza was so good, i saved the last few slices for a snack a few hours later; and it still tasted amazing even cold!  Prices are very reasonable, if not cheap.  Wait times are not too bad, they turn over tables fast, pizza comes out really fast and piping hot.", "author": "Iovany F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "In all my years of growing up and living in and around The City, I've driven the Brooklyn Bridge countless times. However, today was my first walk across the East River. Friends rave about walking the bridge, picking up a pie at Grimaldi's and eating it at the riverside park nearby. Despite the architecturally pleasing facade, Grimaldi's sure did strike me as a tourist trap, supported by the hour line out the door full of foreigners. And so I learned a little something today, but any further insight would be useful.\n\nThere is this quaint place next door named Juliana's, and we thought to ourselves and shared the bet with one another that it would likely be quite good. And the shorter wait at Juliana's -- gosh why am I sharing this wisdom -- was full of fellow locals also at one time discouraged by the Grimaldi's delay. My neighbors provided us with knowledge about Juliana's history that I simply can't describe in writing. To make a long story short, Juliana's is in fact the original Grimaldi's, in its original location, owned by Patsy Grimaldi, also of Patsy's pizza, once connected to the owners of Lombardi's as well and somehow or another also linked to John's of Bleecker Street -- just a few of my favorites. Meanwhile, Grimaldi's next door was sold to a gentleman by the name of Mr. Ciolli and some sort of tension ensued between the two.\n\nAnyhow, Juliana's, I'm pretty sure is the original Grimaldi's and its fantastic. The Margherita pizza is topped iconically with fresh mozzarella and incredibly flavorful tomatoes. The crust is thin and crispy, though lighter than the Lombardi's/John's variety by way of its fluffiness under the hood, still sporting that coal oven dust on the bottom that I so love. So we took it to go and ate in the grass by the river and it was glorious. Couldn't ask for a better spring adventure in our tremendous city with a bit of scholarly enlightenment to boot. (NOTE: I'm confident that the pizza from \"Grimaldi's\" is very good as well, just offering some origin -- you can read more about it in the NY Times).", "author": "Chad S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "This pizza was pretty good.  Much better than Grimaldi's thats right by this place.  Come here instead.  The line is quicker and the pizza is better.  \n\nMy favorite pizza is still Paulie Gee's in Greenpoint.  The one thing I did like better here than other places is that the crust.\n\nWe did have a hiccup with our pizza but our waitress was a superstar.  She did what she could to rectify and had a great attitude throughout our whole visit.", "author": "Jeffrey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Had the number three.... No red sauce but mmm mmmm good. Hit the spot with the super yummy cheese and the crust that was perfect.", "author": "Jeremy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-27", "description": "Food : We tried the margarita pizza here and it was amazing. Especially the cheese. There was something soo fresh about the cheese. I would give them a 4/5 on that. \n\nService:  This is what was upsetting . We had to wait 30 minutes outside the restaurant. Once inside, we had to wait for another 40 minites for our pizza to arrive. We just ordered one large margarita pizza and i belive our server completely forgot about it. I think they should upgrade their service.", "author": "Varun S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "Grimaldi's under the bridge used to be my go-to spot, when I visited NYC.  Since Grimaldi's franchises can now be found in Phoenix, Vegas, Denver, etc., I've most certainly gotten my fill of them, as a west-coaster.\n\nThis time, we decided to try Juliana's, since the original oven is where the magic happens.  It was outstanding.  The pies were cooked perfectly, the toppings were all top-quality, the service was excellent.  I liked the charred undercrust and leoparding  better than Grimaldi's.\n\nBest part?  The line was 1/2 the length of the Grimaldi's line and moved much faster.  I'd say we stood outside maybe twenty minutes on a very busy Saturday during Labor Day weekend.  Overall, I liked the pizza, friendly service, and line much better than that of their next door neighbors. Juliana's is my new go-to spot for Brooklyn pizza.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "Decided to come here after walking the Brooklyn bridge on a Friday (Good Friday) afternoon hoping to avoid a lot of the tourists.  We got here at 3 and the host told us that they are closing at 3.15 until 4pm. Didn't want to go to Grimaldi's next door since we had the one in Hoboken and weren't fans (even though these might be related). Instead of waiting there until 4 - decided to get take out and sit by the water.  Ordered the margarita pizza (large size) which came out to 21 dollars.  The pizza was tasty! The crust is pretty good too and I was able to eat all of the crust.  The downside - they ran out of paper plates for take out which didn't end up being a big deal.  Unlike Grimaldi's next door - they also take credit card here.", "author": "Pooja S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "There was a long queue in front of Juliana's. Waited for about 30 minutes to get in. Once seated the menu came quite quick and order was taken as quick too. Service was excellent. The servers were attentive despite a full house. Was impressed with their servers cool and friendly attitude while under pressure. Extremely professional. The salad was fresh and average. The Egg Cream was excellent but the pizza was heavenly. Just had the basic Classic Margherita Pizza which is always a great indicator. The crust was crunchy at the bottom soft at the top, the sauce was tasty and the cheese was nicely distributed without being overwhelming. Could have like to have more basil on it. Otherwise perfect", "author": "Abhi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "We waited about 10 minutes to go in. It's very small inside and it feels crowded but it was not uncomfortable. We order a margarita pizza and added pepperoni and ham. It was delicious all the ingredients were so fresh and so perfectly blended together. I definitely recommend it. The price is average they also have soups and salad but I didn't try anything but the pizza.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Was skeptical of the reviews before coming here, but the pizza here was excellent. Crust was especially good. Service isn't great, food takes a while, but if you have good company and want a delicious, big-portioned pizza, I'd recommend this place 10/10 times. I would definitely come back next time I'm in NYC.", "author": "Spencer H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-13", "description": "I came here on a busy Friday evening, with a long line out the door, but surprisingly only waited for about 10 minutes. The trick is to NOT come in a large group, probably worst idea ever. I watched a group of 6 in front of me wait nearly an hour AFTER I had ordered and STILL were all split up in twos when they were finally seated.\n\nDespite the countless claims, I cannot agree that Juliana's pizza is the best, or remotely close to the best. It was certainly a great dining experience however, I've had much better. Firstly, I guess you can say my expectation were a little high, but the traditional red sauce that came on the margarita pizza was rather bland, pizza was a bit soggy and wait time was a little ridiculous. I think I waited over half an hour for my pie after ordering.\n\nThe staff is incredibly friendly and able to maintain their composure quite well under the evening rush stress. For the service alone, I would recommend giving this place a try and may consider revisiting if I'm ever in town again. Maybe I just got a bad batch of sauce :P.", "author": "Christina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "This place is a pizza gem. Right off the water by the Brooklyn Bridge this little place has charm and tasty pizza. There is a line out front, but what good places are not worth the wait. Get the No. 4, and you will not be disappointed, classic.", "author": "Sean T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}