{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "A perfect pizza! \nI got the Classic Margherita adding meatballs and black olives. Quality ingredients along with a great pizza base. \nYou have to eat pizza when visiting New York, so make sure it's at Juliana's!", "author": "Jared W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "4.5 stars\n\nAmazing pizza, and totally walkable from the Brooklyn Bridge if you're a tourist like I was. My bf and I ordered the margherita pizza and the spaghetti with meatballs.\n\nPizza: thin crust and straight out of the oven. It was heavenly. Between the two of us, a small was perfect. It was larger than I expected.\n\nPasta: not as amazing as the pizza, but still delicious. The meatballs were soft and the sauce was light.\n\nMake sure to beat the crowd. I came around opening time at 410 pm, and the restaurant was already almost half full. By the time we finished, it was full.\n\nI would definitely come back!", "author": "Corinna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Aug 2018 - Worth the long wait.  This is the first time we visited Dumbo,Brooklyn and I must say we had a great time because there are so many restaurants and pizza places to chose from.  Besides, we took the NYC Ferry from Soundview in the Bronx over to 34th Street and transferred to another NYC Ferry over to Dumbo, costing only $2.75 that included the transfer - what a deal!   \nWe chose this place because all the fabulous reviews.   We Ordered the Margarita Pizza that had a crispy crust and was cooked to perfection, and our friends ordered the White Pizza, delicious with a hint of garlic.  The service was fast and our waiter was great - what more can I say.  There is seating inside, and outside has a few tables but who wants to sit outside on a hot day, not me.  So give this Place a try, you will not be disappointed.  Great tasting pizza.", "author": "Pat D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Super thin crispy margarita pizza! The pizza doesn't leave you feeling full and bloated like most pizzas. It has a clean taste that's light and not too greasy.\n\nThe place was quite packed when we got there so be prepared to wait... But I'd say it's worth it :)", "author": "Emma K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Classic margarita pizza and egg soda. A small shared between 3 people for ~$20. Pizza was delicious and simple. We were seated quickly however service was a bit slow but they we also packed.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "Both the salad and pizza were delicious. The pizza we ordered had tomatoes, mozzarella and basil I believe and it doesn't come with red sauce. It was just oil and some salt, which was a nice touch. A salad and small pizza were enough for two of us to share and had a few pieces leftover.", "author": "Gabriella S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "Delicious pizza!  This was so worth the walk from Manhattan to Brooklyn. We did wait in line for 30-45 min but it was worth it. Our waiter was very friendly.  We order a #4 and #6. The order came out quick. They were both incredible and tasty. Honestly, one of the best pizza I have ever had. I definitely plan to go back.", "author": "Nancy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Best best pizza I've had in New York!! \n\nThis place gets packed but luckily we showed up right before the big line started! We ate at the bar and we could see them make all the pizzas! We got wine, pizza, and two desserts because I couldn't help myself! \n\nThe pizzas are huge and soooooo good! The chefs making the pizza look like they're having a great time and I saw them pose for numerous photos people were taking! \n\nWe got the cheesecake and cannoli for dessert but I think the cheesecake was better! We ended up forgetting my husbands sunglasses there and we called and they had them. We went to pick them up the next day and ALMOSTTTT ate there again because it smelled so amazing. The staff was SO nice when getting his sunglasses even tho they were super busy!", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-09", "description": "Good, but not quite up to the hype. I did the classic plain pie and the cheese was clearly very fresh and high quality, but all in all I just didn't think it was as good as some of the other pizza I've had in Brooklyn.", "author": "Caleb M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Wow so i had the pleasure of the skipping the line at Juliana's thanks to a connect and i couldn't be more grateful. The line is just like Grimaldi's, outrageously long but so damn worth it. \n\nWe can begin with the bottled coke - i could cry every time i find a restaurant that still serves bottled coke. god bless. i also had a glass of homemade lemonade, small - i was done in 3 sips but it was just so good. \n\nthe pizza itself is wild, literally 99% perfect. i can't even deal with this level of perfection. the red sauce? christ. amazing! \n\nno matter how much you eat here, you have to have dessert. the ring dings are good, small though. the brook is bridge takes the cake, the cookie was bomb. \n\ni would totally come back - only when i have patience though.", "author": "Melanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "Came here after it was recommended as one of the best pizza places in the city. While I haven't been to enough other joints to verify the claim, Juliana's is darn good enough that I could easily believe it.\n\nThe line to get in is the worst part. Avoid busier hours or weekends, if you can, and plan to go on a day when the weather is pleasant enough to make a long outdoors wait tolerable. That being said, they're good about providing time estimates for when you'll be seated, and ours was reliably spot-on.\n\nTheir pizzas range from the classics to some more inventive, elaborate options. We were told the Margherita is the most popular option, and decided to give it a try. For an average appetite, one should be enough per 2-3 people. The crust was a little more floppy than I'd have preferred, but if that's your thing, it definitely lives up to (even exceeds?!) expectations. The ingredients taste super fresh, which makes the whole experience well worth it. $20-30 for a pizza is pretty aggressive, but I guess that's par for the course at a hyped NYC spot.\n\nFor what it counts, this is #1 (out of 1) on my NYC pizza rank list. As someone who's only lived here about five minutes, I highly recommend it, but look forward to checking out other spots and seeing how it lives up to the competition!", "author": "Amol U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "This place was fantastic. I knew ahead of time, thanks to reviews, that there would be a 45 minute wait so that did not surprise me. Once inside everything was perfect. The No. 6 pizza was delicious and the meatballs were perfectly seasoned and melt-in-your-mouth tender. I can truthfully say that the food was worth the wait and that I would wait in line AGAIN for this pizza. It's worth noting that the space is small and it was VERY loud, especially for a non-New Yorker such as myself but, once again I know that from reviews.", "author": "Chencia H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "Pizza is delicious. Service is friendly. Place is very busy on weekends. The prices don't justify the wait and the product. Again the pizza is delicious but we waited over half hour (and we were lucky) and paid 73 bucks for 2 pies and 4 sodas. Not the type of place I'm running back to. So many good pizza options in NYC.", "author": "Ben E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Best in the city! Love coming here and always worth waiting in line. Always get extra mozzarella!", "author": "Albert M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-20", "description": "We really enjoyed our lunch at Juliana's on a recent Thursday afternoon.  The line wasn't very long so we our party of four was seated pretty quickly by a super friendly and efficient host.  We all shared the arugula salad, adding the goat cheese and walnuts, which was great, meatball app and a large classic pie with roasted peppers and pepperoni that was amazing.  The wine list was very reasonable as well forcing us to have a bottle of an excellent Morgon Beaujolais at lunch. A very positive experience that I will do again.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Brooklyn coal fired pizza oven, hot crispy charred crust, fresh tomato or white ricotta and fresh toppings what else can you ask for?  Margarita pizza with fresh motz and basil - it's the best. Fresh salads, beer wine and desserts. Host was the best, it was extremely hot and humid outside, he kept moving the lines forward, happy attitude and always smiling and letting us know our place in line - he's great.  Service is on point, meals salads are turned fast.  Awesome chewy charred crust - yummy", "author": "Rhondi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "The most delicious pizza I have ever had in New York!! Nice staff!!\nI went there alone, ordered a small Margherita  pizza. The tomatoes sauce and cheese was so great. I couldn't finish it all. I wish I could. So I shared half of pizza with my neighbor guest XD", "author": "HsuanWen F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-31", "description": "First let me say it wasn't bad pizza, it just didn't really pack a lot of flavor. For the prize I guess I expected more. The crust was thin, but my pie did not have any crunch to it al all in the bottom. It was a great atmosphere and the guys next to me ordered a pizza with prosciutto and arugula that looked amazing. I do wish they let you order by the slice when you are by yourself.", "author": "Carrie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Amazing pizza! Right next to Grimaldi's. The line was out the door at 2:30 pm ! They were still able to get this party of 5 (3kids in tow) inside quickly. Visiting from Florida. We will be back here next time we visit!", "author": "Annie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-31", "description": "I was so excited to try Juliana's because everyone raves about it. I have never heard anything negative about it. We went to try it but I was not impressed. You have to stand in a line outside that usually goes down the street. So you have to be smart about when you are going so you don't have to wait forever. I'm not sure if I just got my hopes up because of everyone hyping it up or if it just really wasn't as great as everyone says. The pizza has very thin crust. We got a pizza with prosciutto, spinach, and cheese. I thought the prices were a little high for a pizza. The pizza was just average. Nothing popped on it. Maybe I need to try one with different toppings and I will change my mind. But overall I thought it was overpriced and it didn't stand out to me. I prefer the hole in the wall pizza joint near penn station.", "author": "Bailey A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}