{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Ok, I get the hype.  We got half original margherita and the other half margherita topped with peppers and cremini mushrooms and demolished that within minutes.\n\nTheir apple pie for two is pretty solid too, but I wouldn't recommend it as a frequent consumption.  It'll make you hate yourself.\n\nI also like they're a thin crust establishment, but I'm partial to Rubirosa's for this one.\n\nAlso, their tiny bottles of soda for $3 is highway robbery.", "author": "Caroline K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Arrived to Juliana's at 4:30 on a Friday. Since I was dining solo, I was able to get a seat at the counter right away. Minutes after sitting the waiter took my order and within 15 minutes I was already eating their FANTASTIC margherita pizza! I usually like my crust a little crisper, but it was still fantastic. They put just the right amount of each ingredient -tomatoes, mozzarella, basil, olive oil and oregano. Since I was sitting at the counter, I could see all of the pizzas being made and coming out of the oven and every single one looked scrumptious. I would definitely make the trek from NJ again to come here.", "author": "Marisa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "I'm giving it a 4 because I really don't have anything to compare it to so my review may not be fair. As a tourist I found this place on yelp and we really liked the pizza, very crispy and you can even taste the wood oven flavor. We smelled the pizza all the way from the Brooklyn bridge because it is right underneath it, just follow the smell LOL but on a serious note the place is small but very nice and homey, one pizza for two was more than enough. The service was great and we didn't have to wait for a table even though the place was pretty packed. The hostess though, she needs training on how to give directions to the tourists over the phone and be nice, we're not from Brooklyn.\n\nWent in January. \n\nOverall the pizza was great paired with a bottle of wine.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "I'm a huge pizza fan so scouting for good pizza is usually at the top of my list when I go on trips. Juliana's happened to be my first pizza stop during my trip to NY.\n\nI made my friends wait about about an hour in line, in nearly freezing weather, just so I could have some highly raved about pizza. I felt slightly bad about it, but I'm sure all was forgiven as it was nice, warm and cozy once we got inside.\n\nWe ordered the margherita pizza (the classic mozzarella, basil, and tomato sauce), as that is usually my go to option. It was delicious, as expected. The thin crust was made perfectly, as it had the perfect amount of crisp and chewiness. The toppings, on the other hand, could have been better as I felt like I was eating more of a crust dominant pizza.\n\nWe were also rushed a little in the end, which is understandable since it was so crowded, but we did wait for an hour to get in.....\n\nI would say the pizza here is great, but only worth a visit if you are willing to wait more than an hour for some pizza!", "author": "Cassie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "We waited 55 minutes for a table of 4 and I was so incredibly pleased when we walked into the small dining room that the tables were NOT cramped and they are not packing people in like sardines! Well done! Now for the food... \n\nWe started with the meatballs and a salad. The salad was big enough for a big meal or enough for 3-4 to split for a bit of greens before your pizza.  The house dressing and olives were amazing.  \nThe meatballs were amazing. You could tell the ingredients from fresh basil to garlic and even the milk soaked breading in the meatballs resembles my Italian great grandmother's recipe.  The only difference is the love and care they put into cooking their meatballs slowly in the freshest tomato sauce. \n\nJuliana's uses Bentley-level ingredients... but they are available for Toyota prices... and the environment is not stuffy as it could be with their level of service and quality.... it is clear they are importing the most important ingredients directly from Italy. \n\nChianti wine was a perfect pairing with the margarita pizza (+pepperoni and sausage). \n\nThe pizza crust, cheese, basil, pepperoni and sliced tomatoes mixture were the most mouthwatering perfect combination for each bite.  You can watch a chef creating each pizza by specifically hand placing the cheese so that every bite is perfect. \n\nMy husband is not like me and eats to live (not living to eat) even he was willing to make Juliana's (and the inevitable wait) a must do every time we make it to NYC.  \n\nFor a table of four I'd split two smalls, make sure to order half/half if you want more variety! \n\nCan't wait to go back!", "author": "A Kate H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "This place is absolutely delicious!  Heaven in your mouth!  The only thing you need to watch out for is that they charge drinks by the glass... my mother ended up paying $8 for iced tea.", "author": "Caroline P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Utterly quintessentially New York pizza. A definitive must go. \nSince Patsy sold the Grimaldis name they've updated the space, and take credit cards - all while serving the classic and arguably best slice in all the 5 boroughs.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "The choices of food are not that much.  Their pizzas tastes good.  We ordered the pizza half in white and half in Red.  We can try both tastes in one.  Service is absolute nice.\nI went there at 12:00pm, When i left, there was a long line already.  Plan to wait for seating all the time.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "So everybody knows the story about how Juliana's came to be. If you don't, google the history of Patsy Grimaldi right now. Go ahead, I'll wait...\n\nOk great. Now that we are on the same page, I gotta say that all the drama was worth it. Juliana's produces a damn good pie, and while both the modern day Patsy's and Grimaldi's are nothing to deride, when held up to Juliana's they cannot be compared.\n\nI recently did a side-by-side taste test between Juliana's and Grimaldi's next door, conveniently visiting both with pickup orders of a large, Margherita pie.\n\nWhile both were beautiful looking pies, it was clear upon visual inspection that the Grimaldi pizza was a bit rushed during preparation. The pie wasn't exactly round, had a clump of ingredients in the middle and above average bare crust on the perimeter, and only had about 5 basil leaves on it. The Juliana's pie was a nice round shape, was even in ingredient distribution edge to edge, and looked much prettier with about 10 basil leaves on it.\n\nBoth pies were cooked to perfection.\n\nWhile the taste was similar, Juliana's packed a more natural flavor, letting the ingredients shine through on their own merit. The Grimaldi's pizza was a bit more salty and garlicy in the sauce, with the burnt edges of the uncovered crust packing a bitter smokey flavor. The central bites of the Grimaldis pie were overwhelmingly garlicy as that was where the density of the ingredients lied, whereas the Juliana's pie had a consistent taste on each bite.\n\nThe fold on both was great, the springiness, sponginess, density and durability of the thin crust was great on both. Cheese was fresh and tasty with both pies.\n\nOnce a hidden secret, Juliana's is now getting longer lines with increased popularity, but they are still nowhere near as long as the Grimaldi's line. Get it for pickup and walk down to the park. You will save yourself a ton of time standing out in the sun.\n\nMy recommendation: get two pies, one from each joint and try yourself. They are both good eats. I just think that Juliana's is better :)", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Ooohhhh where do I begin?? 5 stars really does not do this place justice. (Yelp, you need to invest in adding 5 more stars :) ) \n\nOn a recent trip to Brooklyn, New York, with my family, we were deciding where to eat for dinner (as there are millions of places to go in New York). My brother's father-in-law told us about Juliana's so we decided to go ahead and give it a try. This place did not disappoint. The line outside is usually long, which isn't a surprise as the pizza is amazingly good. While my patience is usually thin, I don't mind waiting for good food. Fortunately, we were able to get seated in about 20 minutes. \n\nWhen we walked in, it immediately put me back in time to the 1950-1960's era (I'm only 20 so it didn't really put me back anywhere lol). However, the decor is reminiscent of the Hollywood Golden Age (the time of Audrey Hepburn and Frank Sinatra, among other famous actors, actresses, etc) When you walk in, you hear Frank Sinatra's music playing (which I absolutely love!), along with photo's of him on the wall. The ambience of Juliana's is what I would describe as Elegant-Casual. The decor, being of the Hollywood Golden Age is obviously elegance in itself. Everything from the menu to the wines that they choose are the pure definition of elegance. However pizza is not a food you'd find at a 5 star restaurant and Juliana's is great for family lunches/dinners, a date night, or just a great spot for after work, which is why I would also describe it as casual. \n\nWriting about the pizza is difficult because its hard to put into words the expertly seasoned taste of the pizza. We ordered a large Garlic, Mushroom, Pepperoni, Mozzarella and Sweet Onion Pizza. The mozzarella is nothing like the mozzarella you get on your pizza from pizza hut. The mozzarella is fresh, homemade mozzarella made from scratch that melts in your mouth and puts tears to your eyes when you take a bite. Juliana's makes true authentic pizza pies. I'm not a New York native, but I don't believe I'll ever find another pizza pie like Juliana's. All of the ingredients are fresh, even the drinks that you order are true and authentic. I ordered a Cream soda, which tasted like a REAL cream soda, Not the bottled kind you buy from the store. The size of the pizza's are large as well. Juliana's definitley doesn't hold back. 2 large pizzas were just enough for the 5 of us. \n\nIf you've read my previous reviews, you know I'm big on Customer Service and Juliana's did not fall short of my expectations. The owner, is very personable and down to earth. He doesn't view you as just another customer but he treats you as if your part of his own family. All the waitors were very nice and helpful as well.\n\nEven though I live in Baltimore, I honestly have no problem driving the 3+ hours in rain or shine just to go to Juliana's. I am completely in love with this place and I can't wait to come back. I hope all of you will try Juliana's whether your a New York native or not, and experience the true gem of the city that never sleeps :)", "author": "Erika S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "I would say that I'm a pizza snob and eat it religiously. This place satisfied my taste buds and the pizza was fantastic. Being Italian, it's nice to see true Italians still own and appreciate good food. Our waiter was very patient and answered all questions my table had, he helped make this experience enjoyable. \n\nFor dessert I ate the Brookie bridge and I would say it is a must order. \n\nI will be back.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Not worth a 45+ min wait or hype. Pizza was good but not the best! Would not make the time or effort to go back.", "author": "Brendan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-02", "description": "The pizza here made fresh, but be prepared to wait on line for more than an hour. I don't really think it was worth the wait for the pizza, but it could be the pizza we chose to order. We ordered the special pizza No. 4  29\r(Tomato, mozzarella, arugula and prosciutto). I do like prosciutto and arugula a lot, and it was pretty good. Overall I gave this 3 stars because the wait was too long to get in and the wait for the pizza was long too. The staff also seems to and ways leave out orders as well.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "This pizza was the way pizza is supposed to be made. The freshest ingredients. Pizza starts with the crust and sauce. Juliana' s sauce is the best. The best pepperoni's ever. The pizza is prep in a pizza oven that cooks the pizza to perfection. I maybe over selling but I don't care it was that good. Especially if you like thin crust pizza. This pizza spot in Brooklyn is a must visit. The staff  is very friendly and helpful. When visit expect a line. We waited for 30 mins before being seated. If you get the chance ask to sit at the bar where you are able to see them make the pizza in front of you.", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "We visited at peak lunch time, and only had a 5-10 minute wait. The service was fantastic, food ready very soon after ordering, and the pizza was delicious! Definitely worth a visit!", "author": "Moriah N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Decided to go see the Brooklyn bridge one day and was actually planning to go to Grimaldis since thats the one I always heard about but then I heard about Julianna's, there was a line to get in because they had closed for an hour in between, they let us in and I sat near the bar area where you can watch them make the pizza fresh, overall it was a great experience, the pizza was fresh and I would definitely go back. It's a must for all pizza lovers", "author": "Jerry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "A walk across the Brooklyn bridge will burn off all these tasty calories, right?\n\nProbably not considering the size of Juliana's pizzas, but either way its so worth it. We made sure to get there right when they opened for lunch, and I'm glad we did, because the line forms fast. Terrance quickly walked through the two sizes of pizza they have and went off to get us a nice bottle of Chianti Classico. We decided to go with the small size, which was still huge and left us with tons of leftovers for our table of three. The Margherita was pure, classic goodness. The #1 was also amazing with mozzarella, scamorza affumicata, pancetta, scallions, and oregon-grown white truffles in olive oil. We were a little worried that it had no tomato sauce, but soon discovered it was not needed and loved the less than classic pizza.  We also tried their housemade meatballs on the side which were just so-so to us, however with Italian pasta sauce and meatballs everyone has a version they love.\n\nHope to go back in the near future, but I still need to work off all those extra pounds first!", "author": "Jim G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "So they say this is the best pizza in the country, according to tourists.  Well, we won't say it's the best, but it definitely did not disappoint! \n\nAs a party of 4 on a Thursday evening, we expected long lines and rushed service.  How fortunate that neither was the case for us!  We waited barely 15 minutes for our table and Mike took his time with our table and orders. \n\nWe took the #3 special (sausage, broccoli rabe,mozzarella, no tomato ) and the classic margherita pies.  The food came quick, hot, crispy, and with a smile.  \n\nKeep in mind, if you are not big eaters, the small is already too much for 3 people.  We were adventurous and decided on 2 small press for 4 people, which were way too much. \n\nCrust was crispy, toppings were fresh and plenty,  portions were too much, and there were no complaints.   Quality was definitely there and we can totally see why so many people love it. \n\nNote, there was a long line on our way out, so it's better to get here before the dinner rush!", "author": "Leila L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "If you're in DUMBO and doing the typical tourist stuff, another spot to try hit up is Juliana's pizza. Be warned, there will be a line and it will be long. If you're eating a later lunch, they stop serving from 3:15 to 4 to clean the oven so if you're in line and don't get a chance to sit down, then you gotta wait longer. (Pro tip: get there at around 3:30-3:45and you'll have a shorter wait when they open at 4). \n\nSo, was this place worth the wait? Yes and no.  We got the margherita pizza and special #1 (mozzarella, scamorza affumicata, pancetta, scallions and white truffle oil). The special was amazing, the cheese and crust with the onion-y sweet taste of the scallions was perfection. Def recommend. The margherita was good too but not as noteworthy. Was expecting to be blown away by the tomato sauce but it was a bit more runny than I would like.\n\nWould I come again? Yes. But not something I'd be craving for to make the trek", "author": "Anna Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "What can I say but WOW!!! This is definitely best pizza place in NYC. It is in Dumbo Brooklyn, but if you want to walk off the calories you can always walk the Brooklyn Bridge back to Manhattan like we did. We also had the meatballs and lentil soup which was very very good also. Pizza can't be beat and just wanna let you know if your not there about 45min. B4 it opens expect a nice wait. They always have a line. Anyways the staff is excellent prices are reasonable too!.", "author": "Michael M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}