{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Nice staff -- especially Michael who was a great server and sweet guy. Pizza very good, nice pours on wine, delicious pasta fagioli soup. Nice ambience. Pepperoni was good!", "author": "Kristy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Was definitely worth the trip across brooklyn bridge. Yummm. Make sure to go with another person as the portion for the pizza can be quite big for a lot of people. I will definitely be back when i visit in the future.", "author": "sam p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "Excellent pizza, reminiscent of the pies around New Haven though a little more elaborated.", "author": "Marc P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "Always amazing love the pizza!!! Just as good as next door if not better and always a shorter line! The Margarita Pizza is the bomb!!", "author": "Steve B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "Waiting in line was worth it!  Pizza was hot, delicious and my beer was cold.  I could ask for much more...except maybe more seating so we didn't have to wait so long to enjoy this amazing pizza!", "author": "Stacy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Been in NYC for 7 years and finally discovered the best pizza ever! White pizza with shiitake mushrooms. The crust is breathtaking.", "author": "Liya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "This is what Patsy Grimaldi is up to these days. It's good to mix it up a little to throw off the tourists. They'll be happy with anything. This is the reigning best pizza in NY right now. But I still like the old Grimaldi's, too.", "author": "Ginger P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Amazing. One of the best pizza places in NYC hands down. Had the spinach salad which was absolutely delicious along with a margarita and sausage pizza. The brownie ice cream sandwich was also divine.", "author": "Pristina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "This place was simply amazing! From the food to the atmosphere to the service (shout out to my waiter Wes). I don't even live in this neighborhood but will most certainly be back! Make sure you get the margarita pizza!", "author": "Perry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "It was our first time here. What a great place to come and enjoy an Italian NYC style pizza. It has been a while since we wanted to come over. As we have family visiting we thought it was a good timing. Indeed. The white pizza, their specials are great. Our #1 would be the pizza with truffle oil and pancetta. #1 special on their carte.", "author": "Aurelie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "This is fantastic pizza. There are a bunch of great spots in NYC (obviously), I've been to many of them, and this is the best I've had.\n\nPiping hot, super crisp, just the right amount of ingredients. The price is pretty good too, and you can't be the super friendly (but not invasive) service. Highly recommend!", "author": "Marty H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "Delicious New York pizza!! The NY native couple who were sat next to us in the restaurant said it's the best in town and they've been going here for years. Truly delicious!", "author": "J. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Wish I could give more than 5 stars. BEST pizza I've ever had in my life. (Marguerita) I have been mentally dissecting and reliving the perfection. Thin, ideal crisp to the crust. Strategically-placed dollops of creamy ricotta (you can just tell they made it themselves or sourced it with care), then wAfts of fresh tomato sauce. (I watched them make one--the sauce doesn't cover the entire bottom of the pie. Then fresh basil \u0026 some dried Italian herbs. The place was packed, we waited about 15 minutes for our table but they invited us to order while we waited so our Caesar salad got to the table 2 minutes after we did \u0026 the pizza shortly thereafter. Excellent friendly service made better by the waiter offering to take our picture. New bucket list: keep going back to try every pizza they offer. PS: this is the \"real\" Grimaldi's. Apparently the original, which draws hordes of people who wait in long lines \u0026 is next door, was sold by the Grimaldi family, who now run Juliana's. Do not pass GO--head straight for Juliana's!", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "I love the pizza here! Grimaldi's line was super long, so we went next door and decided to try Juliana's. We find out that Mr. Grimaldi himself greeted us at the door. He named the restaurant after his mother. The service was great too, one of my friend's phone battery ran out and they even charged it for us. We tried the White Pizza, Pizza Special # 4, and the Margarita. My favorite was the Margarita! Give it a try the next time you visit the Brooklyn Bridge.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Hand tossed, thin crust is perfectly crisp, the sauce light and a little spicy, the mozzarella, basil and arugula are fresh. Perfect pie to stuff your face after walking the Brooklyn Bridge on a sunny Spring day. The line is outside, which could be a drag if it's cold and rainy. Wait staff are friendly. They need to add iced tea to the menu!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "My go to for pizza. Simply the best especially compared to Grimaldis around the corner. The No. 1 with truffle oil is amazing. Worth the wait and the little extra money", "author": "Blake R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-27", "description": "I struggled to give it 2 stars, and the only reason I did was because our waiter tried his best to make up for the lackluster experience.  All I can say is...we should have waited in line for Garibaldi's instead.  The line here was almost the same investment, and boy when you make that investment, you have high hopes that the food will live up to the wait.  Sadly...NOT! After the 30 minute wait in line, we waited another 40 minutes for the pizza. When parties around us (that were seated long after we were) got their food pronto, and we were left hungry...we finally inquired and were told that the kitchen forgot to put our order in.  We had a 12 yr old hungry boy with us, and the cardinal rule of restaurateurs should be...never keep a growing boy waiting. \nWhen the food finally came...eh.  hardly worth an hour long wait.  The waiter tried to make it up to us with free sodas....Really?  He said that was all the Mgr would let him do.  Management clearly could care less about their customers.  Sad.   \nI try to extend every restaurant a 3 strikes rule (being in the hospitality business myself)...benefit of the doubt and all.  But, we'll never be back.\nSkip it.  You'll be glad you did.", "author": "Sue O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-14", "description": "After trying lombardis pizza, this place was a disappointment. The pizza was not that great and the staff were rude. Our margarita pizza had only three pieces of basil and when we asked out waitress for some extra basil, he said they couldn't give us basil for some strange reason. Basically, you can find a better pizza joint around the city if you try!", "author": "Mary Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "people waiting in that ridiculously long grimaldi's line next door dont realize that grimaldi's is a bought out name, and Juliana's is actually the original patsy Grimaldi! Amazing pizza, and even though there is a bit of a wait, its totally worth it! \nDeeeliciouis!", "author": "Stacey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Juliana's pizza was good. We came at around 8:30 p.m. and there was no wait. Thank goodness! We were seated and ordered a small Margherita pizza with meatballs. The pizza came out quickly. I was surprised how big the small was. It had 8 slices and probably could feed 4 people. The service was decent and it's a nice atmosphere inside. We took our pizza home and ate it the next day. The pizza was still as good as the night before. Only thing I would say is to add a little more marinara sauce and it would of been perfect! I would definitely come back for their pizza and recommend any one to try Juliana's if they are in the area!", "author": "Cat L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}