{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-28", "description": "Very nice looking place. They took Grimaldi's dump and really transformed it into a beautiful restaurant. Pizza was very good but not really worth a return trip. To anyone debating whether to go here or to Grimaldi's, i would say Juliana's makes a better pizza...", "author": "Nino B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Came here last week on a recommendation from a local friend and . . . wow.  Coal fired baking imparts a slight smokey flavor, the buffalo cheese is tremendous, my pie had white truffle, seriously legit pancetta, and I think some magic or something.  Great service and atmosphere tops it all off.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-06", "description": "Excellent. Don't both with the old Grimaldi's any more this is the place to go in DUMBO for pizza.", "author": "Joel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "LOVE! Excellent pizza and service! Get out of Grimadli's line and into Juliana's!", "author": "Jen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Best pizza we've ever tasted! Definitely recommend to anyone looking for great pizza! Loved being able to build our own pizza too! Very well priced too!", "author": "Jess C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-15", "description": "Real pizza has returned to Brooklyn, ya'll.\n\nTIP: I ordered #3 on the special pies menu. Mozzarella, sausage, broccoli rabe, tomato, garlic... omnom.", "author": "Kenneth M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "I had high hopes for this place considering the owner but I was slightly disappointed.  We had a Margherita pizza. The crust of the pizza was perfect, but I found the sauce and the cheese to be incredibly bland. I found myself adding salt to my pizza which is something I rarely do. I wouldn't say that the pizza was bad, but I certainly think their are many other places in the city and in Brooklyn that are better.\n\nThis restaurant hasn't been open for long and I have only eaten their once. I will definitely go back in a few months time to see if the pizza has improved or if we were just there on an off night.\n\nThe space is nice, much nicer than the old Grimaldi's. The wait staff was incredibly friendly and generous.\n\nUPDATE: I have gone back a few times and thought the pizza was greatly improved from my first visit. I would definitely recommend.", "author": "Kent R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-27", "description": "Went here only because we couldn't deal with the line next door at Grimaldi's, and realized this place had some affiliation. Upon a quick Yelp, saw that the reviews were good, so went for it. Hubby and I were able to be seated right away, though it was a pretty crowded Sunday evening. Ordered two glasses of red (liked his better than mine) and the Margherita (always gotta go with the basic when trying a pizza place for the first time). Pie came out surprisingly quickly. Have to say, we were both sadly underwhelmed. While the ingredients tasted fresh, there seemed to be a major lack of flavor. We kept hoping it would get better, but it just... didn't. In the end, we didn't finish the pie and didn't really care to take the rest home either. Pretty cool though that Patsy Grimaldi (who I obviously thought by the name was a woman until I saw the name on his jacket) was walking around greeting customers and bringing things out to the tables. He even approached us as we were leaving and asked how the meal was. Of course, I smiled and said \"great!\". Mediocre pizza or not, it definitely wasn't enough to make me insult a cute old man!", "author": "Arianna Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "Tripped over this place on a day trip to tool around Brooklyn. Thin crust, just the right amount of sauce, topped with thinly sliced cheese so you weren't pawing all over yourself to rip off the cheese. Would def return.", "author": "Michele G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "We started out in the line at Grimald's but decided to give Juliana's a try at the advice of a local (we're from Dallas). So glad we did! Patsy Grimaldi, the proprietor of Juliana's, named the restaurant after his mom and ensures that every guest has an excellent experience. When my husband asked him what an egg cream was, Patsy personally mixed four of them right at our table for us...on the house! He is every bit as delightful as the pizza is spectacular. Having been to Grimaldi's and Lombardi's, both names tourists know and associate with pizza landmarks, I would now pick Juliana's every time. And the raspberry chocolate ice cream made exclusively for Juliana's is to die for as well. Yum!!!", "author": "Patti O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Better than Grimaldis and the tourists haven't caught on yet! Juliana's is what Grimaldis was before they changed owners. And they use the original pizza oven from the old Grimaldis.\nTHE BEST PIZZA IN THE WORLD!!!", "author": "Hilary B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Had the margherita with pepperoni and it was classic.  Pepperoni were perfect little crispy curls of goodness and the crust was airy, chewy and  delicious.  \n\nWas stuffed after dinner, but my wife insisted on a brookie bridge, which turned out to be the surprise icing on the cake because it was ridiculous... two brownie/cookies that were a chocolate dream with a scoop of vanilla ice cream in the middle.. out of control!! \n\nThere was a little wait, but that should probably be expected for Patsi Grimaldi's pizza...   We'll be back...", "author": "Nirro L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Can definitely make a claim for best pizza in NYC.  Consistent perfectly baked crust, tasty sauce/cheese and they don't skimp on high-quality toppings.  Try the sausage/pepperoni/roasted pepper/olive combo - you won't regret it.  Atmosphere is nice, people are friendly and lacks the annoyance factor of Grimaldi's (lines, cash only).  Only downside at all is the price but this is NYC.  If you want great pizza, you pay the piper aka Patsy.", "author": "Frank N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Juliana's finally opened last week, yay! We live in DUMBO and have been waiting for them to open their doors for months. (As others have noted, we've also become fed up with Grimaldi's--the actual restaurant in both the old and new locations was kind of gross and run-down. The pizza there is fine, definitely not worth waiting for in that line.) \n\nSo we were thrilled to try out Juliana's and see if it would become our new go-to place--and I think we have a winner! The service was pretty good and friendly (compared to what some other reviewers are saying). We were there on a Thursday night at about 8:30. It was only about half full. Decent wine by the glass. Everything about the pizza was perfect--or perfectly how I like it, at least! Thin \u0026 crispy crust, yummy sauce, and just the right amount of cheese and basil (we had the classic margherita). We will definitely be back!", "author": "Taren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "AMAZING PIZZA!! So much better than the tourist trap, Grimaldi's. This is the real Patsy Grimaldi's place, so of course it is better.", "author": "Brooklyn D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-23", "description": "Seriously underwhelmed by this place. Waited in line for over an hour to be seated, and then again waited another hour to be served. Confident that having waited so long people would not walk away, they concentrated on serving take-away customers who could easily have walked away. V poor customer service. Meh pizzas after all the hype and wait. Will advise anyone to not waste your time - pizzas are ok, certainly don't live up to the hype; I've eaten better.", "author": "Gai K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-06", "description": "I was so happy when Juliana's opened after reading about it in the paper a while back.\n\nThe pizza was absolutely smashing.  I think it is better now than in Patsy's earlier incarnation.   What's Grimaldi's now jumped the shark a while ago when they started treating locals like dirt and went after the tourist trade exclusively.\n\nThe restaurant is more pleasant and definitely more upscale than before.  Prices also jumped a little but the food was wonderful and well worth it. \n\nWe had a salad and one of the special pies which had no tomato sauce but rather cherry tomatoes, garlic, parmesan, buffalo mozzarella and basil.  I probably could have eaten the whole pie myself.  The cannolli may have been the best one I ever had.  \n\nThey didn't have decaf coffee, just espresso.\n\nService was superb, friendly enough without being too familiar, quick and efficient.  Every employee seemed pleasant and happy enough.\n\nCan't wait to go back.", "author": "Lou S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Wonderful pizza, and the manager came by to give us the history. Very informative! Once he heard that I collected glasses, he gave me a Peroni glass to take home. What a great experience!", "author": "Marcus E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "This is by far my favourite pizza so far. Many may disagree, but being a health fanatic, this \"indulgence\" tasted incredible and didn't make me feel bloated or disgusting. I ordered a small Margarita/Pepperoni to split in half with my cousin. I ate ALL of my half (4 medium slices compared to the typical large ones you get at the usual pizza joints)--I never eat that much pizza in one sitting! Usually by the 2nd slice I'm feeling very full. However, this pizza is cooked in a brick-oven, it's thin crust, and the ingredients not only looked but tasted so fresh!! The sauce was light, there wasn't a cheese overload (which is usually what I prefer) and the pepperoni were small circles. It was so good, I will definitely be going back. For the small, we each paid $10, which may seem a bit pricey, but SO worth it!! Also, the owner was walking throughout and at one point stood out between the tables and tossed pizza dough to one of the cooks! (The children watching were in complete amazement.) He was extremely friendly and talkative, just like the rest of the staff. It is cozy and just a great spot. Perfect for a romantic date (yes, pizza can be a first date! (; ) or a nice night out.", "author": "Alexandrea C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "I was really looking forward to trying Juliana's because of all the history with pizzaiolo Patsy and to once again be in the original Grimaldi's space. It's a shame the current Grimaldi's next door has fallen off terribly and for the first time I didn't see 1 person on line. Insane. \nJuliana's sure went through a makeover inside. It's actually pretty fancy for a pizzeria with contemporary decor plus a jukebox for kicks. A world of difference from the original Grimaldi's....including the new coal oven. The service was friendly and inviting though our particular waitress was a bit slow.\nAs someone with very high pizza standards i found the pizza good but not amazing. \n(When dealing with new york style pizza everything must be compared to the legendary Di Fara's which is in a class of its own).\nThe pizza is served neat and ingredients are fresh and balanced but nothing was particularly mouth orgasmic. Crust had some density to it so i wouldn't consider it thin crust. Our party of 4 ordered 3 pies: margherita, half pepperoni half meatball pie, sausage pie. I particularly liked the pepperoni and sausage, meatballs were disappointing.\n\nIt was a pleasant experience and i am curious to see how Juliana's will improve over time and i have no doubt it will.", "author": "J W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}