{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-21", "description": "4.5 stars, the pizza has everything you want in NY style pizza. Thin crispy crust, great sauce and perfectly stringy cheese. \n\nDefinitely memorable and definitely a place I want to come back to.", "author": "Simon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "Another classy evening. We got seated around 930pm arriving at about 9, not bad for a Saturday night. David was our waiter again and is really personable and charming, making us feel at home. We had our usual meatballs, pizza with Prosciutto and arugula. cannoli (best cannoli I've ever had) and cappuccino with David making it extra special with some vanilla. I can't wait to come back again next year!", "author": "Christopher K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-02", "description": "Checked out Juliana's for the first time today for lunch (Tuesday, April 2). I was bracing myself for a lengthy line but there was no wait when we got there around 12:15 p.m. By the time we were finished with our meal, a decent line had formed outside the restaurant. We found parking in an underground garage on Furman Streer near the Squibb Park bridge.\n\nI was informed that our stroller had to be parked outside by the front door. Ours is a super compact fold so I merely folded it up and set it beside us against the wall. Just a heads up for those traveling with large strollers. High chair was a sturdy plastic one that kept my 13 month old from pulling in his legs and twisting around in his seat.\n\nThe menu is straightforward. We ordered the Margherita pizza with pepperoni and ricotta. I felt like the large was big enough for our group (3 adults - 2 women, 1 man) to be satisfied. We also ordered the spaghetti alla puttanesca for my 13 month old. No kid sized servings available. Flavors were simple yet fresh and delicious. The meatballs do have cheese in them so they're not dairy free friendly.\n\nThere's one restroom and no changing table. Service was good. I'd imagine that you could simply grab an order and enjoy it in Brooklyn Bridge Park when the weather is warm. I'd come again!", "author": "Arianne N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "When you talk pizza, Juliana's is synonymous with perfection in terms of quality and customer service.\n\nWhen we arrived from a beautiful boat ride over the Hudson, we were immediately greeted and seat. \n\nOur server was magnificent but most importantly informative of the menu and beer.\n\nWe ordered Peronis to begin the night and this was the best beer I have had in the longest. \nSmooth and crisp with a beautiful glass to compliment. \n\nWe ordered the large margarita with half pepperoni and half sausage and meatball pizza.\n\nThe pizza was thin, crispy, and made to perfection. The meatball melted with each bite, the sausage had bits of fennel and the pepperoni was phenomenal.\n\nWe finished our night with a canoli and cheesecake which completed our dinner. The canoli was filled with stuffing and crunched with each bite. The cheesecake was fantastic with the strawberry glaze that was drizzled upon it.\n\nOverall, this is a must stop when finding the best pizza of Brooklyn.", "author": "Khoi N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-09", "description": "We got the tomato mozzarella pepperoni pizza here and the pizza was slightly smoky and so delicious. It's a little pricey but can be split between two people. It is amazing New York pizza and worth the wait!! It also accepts credit card unlike Grimaldi's next door.", "author": "Jennifer V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "This place has the moniker of best pizza in New York and best pizza in the USA, it definitely is one of the better tasting pizzas I've ever had. There was nothing left after we were done with it. Got a small half pepperoni and half cheese.  I was not into this kind of pie, looks can be deceiving, the flavors won me over. It did remind me of the pizza place I frequent in Cali called Caruso's.  The flavors are almost identical, at least to my palette, so kudos. Job well done. The meatballs were good, nothing amazing but definitely good. When you're in Dumbo check this place out, but do it when they open otherwise you'll be waiting in a long line.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Awesome NY style pizza by none other than Patsy Grimaldi! My husband have wanted to visit this pizzeria for a very long time now (frankly, ever since he was disappointed by a visit to Lombardi's) and we got our chance when my aunt and uncle were visiting town. After a visit to One World Observatory we crossed over to Brooklyn and my husband queued up while I took my aunt and uncle to the Brooklyn Bridge. By the time we were finished we were near the front of the line. \n\nWe ordered two different pies, one a white pizza with pancetta and the other a tomato sauce with sausage. Both were excellent! Definitely what I would recommend if you're after a NY style slice! Would come back again for sure!", "author": "Ryna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "This place it's very nice; I've waited to get in like 20 min around but the time goes fast if you are with a friend. We got the classic marghareta pizza; it was very good and tasty.", "author": "Gabriel E. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "BEST COAL FIRED PIZZA I HAVE EVER HAD!!! Don't be intimidated by the long wait, it is definitely worth it. We got into line around 3:10PM, but they closed at 3:15PM so we waited until it opened at 4PM. We weren't in the front, but we were seated by 4:10PM. \n\nThe inside of the restaurant is so cute! It gives an old school feel with the music and photos on the wall.\n\nMy boyfriend and I got a large half Margherita, half white pizza (pictured). We finished it all!!! It was delicious! We definitely could've gotten another pizza. \n\nThe service was pretty good, given how busy the restaurant was. Overall, we will definitely be coming back when in town!", "author": "Princess P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "After a long walk down the brooklyn bridge and strolling around the DUMBO on a sweltering hot summer day we were looking for a place to grab a quick bite. Then we see Juliana's with a long line and people swarming the block waiting for their turn. With all the rave reviews it has got we decide to go \u0026 line up. After a long 1 hour of wait, the moment of truth finally arrived. Our opportunity to experience one of the best pizza's in the DUMBO.\n\nWe ordered the large Margherita Pizza with sweet onions, mushrooms, roasted peppers and the large white pizza with olives, mushrooms and roasted peppers. You'd think we'd be tough to please after waiting so long in the hot sun and then waiting some more for pizza to arrive. But we fell in love the moment cheese hit our palette. The sauce is KING! I thought the cheese would be overpowering on the white pizza considering there is no tomato sauce but it was just the right amount. The margherita pizza had the right amounts of basil and tomato giving that sweet but savory taste.\n\nA must in DUMBO. Definitely worth dedicating a day for.", "author": "Hariesh I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-13", "description": "The pizza might be worth 3.5 stars, but the hype and designation as one of New York's best pizza makes one judge his/her food more critically. Tried slices of the No 1 Special, the White pizza, and the Margherita... none of which were blow me out of mind special. I do not think I would wait in too long of a line for this pizza. But I did enjoy it", "author": "Varand O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-15", "description": "It was very disappointed. They ran out of many food options. It was a Friday and had no food for lunch. I mean Pizza was available but no meatball or chicken. I was confused needless to say.\n\nPizza and Salad was good but a bit pricy for the selection. I'd probably come again but not anytime soon.\n\nThey do not seat you unless every in your party is ready. Nor do that take reservations. We got lucky and sat immediately around lunch time and we had a large group 6 people.", "author": "Ennei S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "When in Brooklyn, it is a rite of passage to have Juliana's Pizza. You'll be in line 45 minutes or more. You'll wonder if you should go to the other pizza places in DUMBO, but my YE recommendation is to stay in line. This is New York pizza at its finest! \n\nA short New York pizza history lesson. This pizza spot is named after the daughter of Patsy Grimaldi. He's the guy who started Grimaldi's pizza, then sold Grimaldi's to a guy named Frank Ciolli. Then Patsy Grimaldi came out of retirement and started Juliana's Pizza with the original brick-oven recipe he learned from his family. I've been told you'll see him at the front on many days ringing customers up. He wasn't there the day we went. \n\nJuliana's only sells whole pies, no slices. We had the cheese pizza and white cheese pizza. It took about thirty minutes for the pizzas to arrive, but we really didn't mind. We had good conversation and enjoyed the atmosphere! \n\nOnce the pizzas arrived...our chatty group was quiet because we were all busy eating! \n\n5 stars kid. Remember, stay in line! We didn't regret it and hopefully you won't either!", "author": "Reno U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "I'm actually not from Brooklyn, I'm staying here for University. I've got to say, though, that the rumors of New York City having the best pizza in the world is actually true. And between the Five Boroughs, Juliana has introduced me to a pizza of brand new heights.\n\nI've waited outside in the freezing winter for two hours to get a taste of their pizza. Juliana's pizza is nothing like Domino's or Papa John's and as much as I enjoy the stay-at-home cheap pizza, Juliana's pizza is on a whole 'nother level.\n\nI 100% recommend this to anyone, their pizza is absolutely phenomenal. Don't be afraid of the no-sauce pizzas on the menu either! You'll be surprised by how delicious it can be, even without the tomato sauce.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "Couldn't choose between Juliana's and Grimaldi's, but I chose Juliana's and didn't regret it a single bit. The wait time was out the door, but it went by pretty quickly. Of course, it was packed inside, but the service was still pretty good. \n\nI recommend the margherita pizza! It is a classic! Simple yet delicious taste, not overwhelming in any way.", "author": "Vivian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "The pizza at Julianna's in certainly worth the wait.  Being my second visit, I knew that we'd need to wait for a table however we were seated within 20 minutes.\n\nThis famous Brooklyn pizza institution is popular for good reason. Fresh ingredients, prompt service and the ability to add your own favourites to this famous Brooklyn staple.\n\nWe ordered the Margarita with fresh basil.  To this, we added pepperoni, fennel sausage, mushrooms and extra mozerella.  Melt in your mouth perfection, with minimal crust. \n\nA bottle of Napa Valley Cab was the perfect accompaniment to aid digestion.", "author": "Luke B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "NEW YORK PIZZA!\n\nSince we came on a weekday for lunch, the wait was only about 8 minutes. They had cold water and cups outside to make the wait bearable in the heat.\n\nI shared a medium No. 3 Pizza Special (mozzarella, sausage, broccoli rabe and garlic).\nTo be fair, the pizza wasn't life-changing, but the thin crust, simple toppings, and real cheese made for a filling, delicious lunch. Despite us being so close to the kitchen, our pizza came to us just warm instead of piping hot / fresh which is why I'm giving 4 stars instead of 5. In terms of portions, the medium was perfect to split between 2 people.\n\nOverall, it was clean inside and service was pleasant. I wouldn't mind coming back again if I was in the area and the wait wasn't more than 20 minutes.", "author": "Sylvia Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "Cold is my kryptonite ... it's makes me grouchy so I was off to a rough start here when we were asked to wait outside in the 22 degree cold.  It was 1:30PM so it wasn't crowded at the time and there was no one waiting inside ....  we eventually made it into the vestibule about 5 minutes later and then we were seated about 10 minutes after that. \n\nOnce I had thawed, I was mesmerized by the pizza making.  And the pizza itself was delight in my mouth.  The three of us shared the arugula salad and a large margherita pizza with sausage and pepperoni.  The ingredients were all fresh and delicious.  The hubby LOVES pizza and if this place were closer to home, he'd be 20 lbs heavier.  Service once we were seated was terrific.", "author": "Kathleen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "YOU WILL HAVE TO WAIT IN A LONG LINE\n\nWe tried to get a quick bite at Juliana's but the line was so long we did not end up getting seated due to our schedule. HOWEVER, they came out with a whole fresh pizza as a sample while we waited, and I got to try the most delicious pizza I have ever had. If I had all the time in the world, I would have waited until the end. \n\nI took a star off because the wait system seems inefficient. On a Monday afternoon/evening, a line that we told would take 45 minutes, moved maybe 20% by the time it was 40 minutes. It would also be great to have a to go line if people just wanted a slice or a box to go. The line was so long that it met the line for Grimaldi's next door. A friend of mine who lives in NYC told me that the owner of Juliana's used to be owner of Grimaldi's, but sold it a while back. When he wanted to buy it back, they refused, so he opened a Juliana's. So if you're looking for the original Grimaldi's pizza, it's really, Juliana's.", "author": "Wonju R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Totally worth it. I visited in December 2018 and it was a little chilly outside. We waited in line for about 1 hour and in the meantime the hostess came out with a full pie to feed the children who were also waiting in line.The sweetest thing!  \nYou just go with the flow and by the time you get in you enjoy an amazing pie made with quality ingredients, great service, friendly staff and a good wine suggestion. I will be back and recommend it to anyone who considers visiting. It's an experience!", "author": "Liz F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}