{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-10", "description": "Total letdown. We ordered the Margherita pizza with mushrooms. The pizza was soggy. When I picked up a slice, it completely fell over and the crust wasn't good. When you walk in, you can see their brick ovens firing at full heat. Everyone is ordering pizza and mine comes out soggy. Will not come back. I can't even think of giving it a second chance. As a pizza lover and a Brooklynite, I am gravely disappointed.", "author": "Mace L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "The debate is settled. I think this is better than Grimaldi's\n\nFor now the waiting time is a lot less, they take card, the crust is better\n\nI think the only thin Grimaldi's had over it was the sauce\n\nPepperoni and roasted peppers were good toppings", "author": "renje g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-20", "description": "Something I will shamefully admit is my smugness while standing on a short line at Juliana's watching the extremely long line at Grimaldi's. Little do they know that Mr. Patsy Grimaldi himself is finding eager patrons their tables 100 feet away. And while the Grimaldi's folk will leave wondering what the fuss was all about and how they possibly waited like an hour for mediocre pizza, the rest of us at Juliana's will scarf down delicious pizza, and leave immensely satisfied, looking forward to their next pie.\n\nSadly, I never tried Grimaldi's before it was bought and moved to its current location on the corner. Thankfully, the pizza gods must have sensed great disturbance in the NY pizza scene and encouraged Patsy Grimaldi to open a new pizza restaurant, thus restoring order to the universe. All is right again.\n\nSo, my experience - At 7:30 on a warm Friday night in May, three of us waited for about twenty minutes before being seated. Not too bad, eh? Waiting for the menus did take a while - about 10 minutes - as there were only two waiters. Nevertheless, the restaurant was so packed, it's hard to imagine adding another one to the room.\n\nWe ordered two large pizzas: one margherita and one heartstopper. The waiter cautioned us that it might be too much food. He said that generally, two people share one large pie, and maybe it might be better if we ordered one small pie instead of two large pies. That was very considerate of him, but thanks, we know our stomachs well. Two large pies? Done, and gone, crust and all, and we still have room for more.\n\nOne test that countless pizza places fail at, including neighborhood slice joints, is the droopiness test. Lift a slice by the crust without supporting the tip, and see if it falls over. Both of our pizzas passed. I love thin-crusted pizza that can hold itself up without being too thick and doughy, and maintain its crispiness. You don't need to fold, you don't need to cut. Just lift, and take that first, most satisfying bite of the slice.\n\nThe margherita is top-notch, and a great classic choice if that's what you're craving. The tomato sauce is light and sweet. The mozzarella is fresh, with just the right amount of stringiness. The heartstopper doesn't have tomatoes, but that doesn't make it any less flavorful. It is topped with mozzarella, Scamorza, pancetta, scallions, and truffle oil. The pancetta can get a little too salty, considering how thin the pizza is, but the other toppings, particularly the scallions, help cut the saltiness down. The different cheeses also add another dimension.\n\nIf you're looking for somewhere less crowded, don't feel like Juliana's can't fit your bill. The Manhattan skyline is just a few steps away, so order a pie to go and eat at the park instead. Perfect date, no?", "author": "SukMon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Super friendly staff and THE BEST pizza I've ever had (and I've had tonssss of pizza). The crust is T's perfect combo if thin, with a thicker crust and the perfect amount of char. But what really out their pizza over the edge is the SAUCE! Yum. \nYou can't sit outside \u0026 drink. So sit inside if you want some vino with your pizza. \nGet the marghertia pizza. It's a classic and delicious.", "author": "Christa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "We waited in line for about 25 minutes on a Sunday evening- decent wait time for a small place will tables packed in, and it was worth it. Do read the news article on the window while you're waiting to gain some appreciation for the heart and work out into the place. I'm just thankful we didn't end up waiting at Guliani's next door (a MICH longer wait) and instead came into the original!\n\nPizza was delicious. Got the margarita and prosciutto larges for 6 adults it was perfect. The chocolate dessert was amazing too!\n\nPatsy came and sat at our table at the end of the meal to ask about the service and food. Both were perfect!", "author": "Kristin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-30", "description": "We are tourists from Texas. We heard good things about this pizza place and the one next door. They both were strongly recommended by tour guid. We took taxi from Memorial 911 to here on Monday 11/30 at around 12:30. There was no line on both pizza places. We choose Juliana since they accept Visa credit card. The other one is Cash Only. We ordered Basic Pizza with pepperoni and sausage. We do not have to wait long. It is about 10-15 minutes. This pizza has thin crust, a little salty. I wish there is more cheese and    meat. I kind of disappointed. To me, deep disk pizza in Chicago is a lot better. Even pizza at my home town SugarLand is also better than here. It is such a waste of time and taxi fare to come here just for so so pizza. If you are tourist and you stay at time square are, there are many pizza stores at 44th @ 8th. Do not let curiosity fool you. Eat round where you stay at.", "author": "Thomas v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-29", "description": "The man and I had a super delicious pie here on Memorial Day. I've been looking forward to trying Juliana's since I first read about all the drama in a NY Mag feature last year. \n\nI'm a Lombardi's devotee (it's the sauce!), but Juliana's makes some damn good pizza. We got the large marinara and topped it with pepperoni, roasted peppers, and scamorza cheese. I'd never had nor heard of scamorza, but it was smoky and delightful. They're liberal with the toppings, which I appreciate, but I could have gone with a slightly crispier crust. \n\nThe BEST part for me, though, was the Brookie Bridge we got for dessert. It's an ice cream sandwich, you guys, but instead of just plain old cookies doing the sandwiching, it's this magical cross between a cookie and a brownie. Brookie. We went with raspberry ice cream. Perfection.\n\nOther highlights:\n...the super garlicky croutons on the caesar salad\n...Sixpoint Sweet Action Ale!\n...a much shorter line than Grimaldi's next door\n...a much more pleasant man managing said line", "author": "Megan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "They refuse to make a normal pizza with marinara sauce and mozz. This place is great if you just order take out. Not worth the hour + wait in line for a table in my opinion.", "author": "Campbell C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "We waited 45mins, including a period of \"closure due to oven stocking.\" But once re-opened, a large chunk of the queue managed to enter the restaurant including us.\n\nOnce seated, we were quickly served. Tip: order quickly! Or else you'll face our problem of waiting for everyone else to be done even before our pizza arrived :/ \n\nWe ordered the Half-half margherita and white pizza w garlic. Pizza was really good, especially noticeable by thin base that does not easily break. But was it out of the States. I'm not sure, perhaps it is, perhaps it isn't, I haven't been to much pizza places.", "author": "Vjy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Heard the owners are connected to Grimaldi's so decided to check it out. About six of us went, we had to wait but the pizza was worth it. I liked the crust a lot. It was a great pizza.", "author": "Christina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Family and I stopped by Juliana's for an early dinner after visiting some of our Brooklyn church facilities. Overall super delish. Pizza was good. Meatballs tasty. Wine was good. Salad was fresh. Great ambiance. Fresh, clean and good food. Reminded of the margherita pizza I kept ordering everywhere when I was in Italy.  Be ready to wait in line for a long time if you get there after 4:00 p.m.!!!", "author": "Ninfa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "I waited to post this review until I was home to make sure I wasn't swayed by my time in NYC. This was easily the best pizza I've ever had. I was a kid last time I had pizza that I truly thought was delicious. We ate the margarita and added sausage and anchovies, fantastic. Even the wait was quick, maybe 20 minutes. The owner was the host and is as relaxed and calm as you will find in the restaurant business. He managed the line and made you feel important all without looking stressed. Our waiter had worked there for more than 20 years and gave us the history of the place and personal insights. The seating is tight so be ready to be friendly with those around you; but that's a good thing. New Yorkers may argue about the best pie but Brooklyn and Julianna's was the total package for us.", "author": "Marc B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "40 minute wait, but the pizza was worth every minute. We had the margherita/pepperoni pizza and I have to say that the sauce and cheese were what stood out the most from any other pizza I had ever had. Would definitely recommend and will be back next time I'm in the Dumbo area.", "author": "Jose R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "While waiting in line for Grimaldi's decided to see what my fellow Yelpers said about Juliana's and was pleasantly surprised. Since I've been to Grimaldi's decided to check out Juliana's and I'm really glad I did. \n\nThe staff and decor makes for a great setting to enjoy pizza! Decided on the traditional pie and did half fennel sausage as well. The sauce is so great and overall was impressed! \n\nAs a person that loves pizza and has been to most of the best pizza places in the city I definitely would put this up there on my list! \n\nEnjoy!", "author": "Annilia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Just forget about Grimaldi's. \n\nJuliana's has excellent pizza, cuter decor and better service. \n\nWe shared a large pie between 3 people, got a nice glass of wine and enjoyed conversation with our waiter. It was busy, but service never suffered. \n\nAlways bring your out of town friends here! You can see the kitchen and the pizzas going in and out of the oven. Plus you can tell them about how this is the REAL spot and they'll feel all cool.", "author": "Michiko F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "Oh my goodness, this is really as good as it gets. You do have to pay the price in the wait though. We waited for almost two hours! The place is not very big but what is nice is that they don't cram people inside by making the seating close. Back to the wait, it was borderline rediculous but when you hear happy customers leaving saying the wait is worth it, there's nothing you can do but stay!\n\nHere's the secret though, they actually shut down at 3:15 and reopen at 4 so if you get there around 3:30 you'll only have to wait an hour and be seated right away! \n\nTHE PIZZA THOUGH. We ordered a marinara with half peperoni half mushroom NOM. The ingredients were so fresh but the peperoni was the super star. Then we got the #3 which was good too but there was no sauce and that is where we went wrong with ordering. Service was great because when we told them we didnt realize it didnt come with sauce, they brought us some. Both pizzas were 30$ each but it fed my family of 5.\n\nCannot wait to go back !", "author": "Stephanie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Got in line 10 mins before they opened after there 3:30-4:00 closer. They do this to change out the coals and relight new ones. It is important so the oven stays hot and cooks the pizza at the right temperature. Ordered a mushroom pizza and #2 special. It was phenomenal and so thin. Love the fact that it is crispy but also not dry. The line gets long so you can always place a to go order if your in a hurry. But if your in Brooklyn and hungry for some pizza, stop here.", "author": "Kyle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Best pizza in NYC ... only other place I've had pizza this good was Naples Italy. This place is a must stop if you are visiting or live here.\n\nLocation is great...walk across BK bridge if you want to walk off some calories. \n\nThe history of this place is remarkable. Ask them the story.", "author": "Brian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Love the atmosphere and food. The wait staff are very friendly. It is cozy and comfortable, like being in a hometown cafe. The pizza is really delicious and had a line for the 4 clock sitting.", "author": "Kathern Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "I can't really say anything that hasn't already been said, but it want to throw my support behind this place anyway. Very good pizza all around! Sauce was excellent flavor and texture, and the crust was perfectly crispy and just a little bit charred on the outside. Toward the center of the pizza was not as crispy, thus allowing for folding. We got margherita with pepperoni, which I definitely recommend, especially for trying out how a place does pizza without any gimmicks.\n\nDefinitely check out Juliana's", "author": "Graham H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}