{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Came here with my girlfriend and accidentally ordered a large pizza and a salad for the both of us. We DID finish it because the pizza was great (dough was DELISH!) but a small would have sufficed. We did have to wait about 30 minutes in a line outside and it was about an hour before closing on a Friday. Would recommend this, especially if you're looking for a place just under the Brooklyn Bridge", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "This won \"Best Pizza In America\" a few weeks ago, so we thought we'd check it out.\n\nThe line for Grimaldi's was long, and this line was shorter, but we still waited about 40 minutes to get a table.  WORTH THE WAIT!  And compared to Grimaldi's THIS is the way better pizza.  In fact there's no comparison, really.  We had the basic Margherita pizza which was served up pretty quickly but a very friendly server (hostess was really nice too).  The crust was crunchy and the cheese was FRESH with basil and just enough sauce.\n\nWe also split a plate of pasta with meatballs.  Also delicious.\n\nThe restaurant itself was clean and tidy. Nice decor.\n\nI think this is the best.  Really, everything was perfect.", "author": "Scotty K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Food 5 stars, pizzas incredible. Service poor, primarily an incredibly inefficient table management in peak times.", "author": "Mitchell K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "This place is absolutely delicious! Authentic coal fired New York inspired pizza, it is worth the trek into Brooklyn. It is right on the water by the harbor, ferris wheel, in front of both the bridges. I like the DUMBO area quite a bit, because you can smell the air from the East River, and see boats go by. The view of Manhattan from there is really spectacular at night, it sparkles and you can really observe the density of the city. A friend met me down here after a book signing and we talked on the Greenway and then walked up the street to find this lovely place. It is just as cool inside as out, with traditional title, and fast service. I would recommend it to anyone in the area who wants a hot pie, classic crust, and fresh ingredients. I encourage you to make a night of it, stroll on the pier, get ice cream. It is a very romantic destination.", "author": "Destiny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "So my beautiful date and I were craving pizza and originally planned to check out Grimaldi's in DUMBO. Then we spotted this place and saw an even longer line. Thanks to the good graces of Yelp, we decided to check out Juliana's Pizza! We truly made a smart move! Another family run joint by Patsy Grimaldi, this place was soooooooooooo worth the wait! We ordered one of their pizza specialities (has pancetta, mozzarella cheese, arugula, drizzled olive oil, and something I'm forgetting), but it was pure heaven from the first bite! We had a couple brews to compliment our pie and our waiter was excellent!! We're soooooooooo coming back here again!!", "author": "Francis A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-24", "description": "I am sorry, but I don't get all the hype.    \n\nWe ordered their #3 (sausage, broccoli rabe, ...).   It was fine, but it wasn't anything great.    We also had a spinach salad, which was also just fine fine; nothing special.  I liked the IPA they had on tap, but the pizza was just A-OK and the salad was a meh.\n\nAlso, of disappointment was that we said we wanted to add mushrooms to the #3.   They said NO --- you can't add any toppings to our specialty pizzas.   This is ridiculous especially when they offer it as a topping on build your own pizzas..    \n\nEven more ridiculous is the following:  the table next to us was custom building a pizza (choosing all their own toppings), and she said they wanted spinach as a topping; the customers were told that they don't have a spinach topping, at which point the customer pointed to our table and said \"they have a huge spinach salad in front of them; was that the last of the spinach?\"  To which the waiter responded:  \"All of the spinach we have is for salads only.\"\n\nThese people are ridiculous.  They have mushrooms, but you can only put it on a pizza built from scratch; you can't add it to one of their specialty pizzas even if you are willing to pay for it.   They have spinach, but you can't get that on any pizza even if you are willing to pay for it.      After a 20-25 minute wait for us to be seated, and just A-OK pizza, this is dropping them from what would have been 3 stars to 2 stars due to the lack of flexibility by the restaurant with respect to toppings.", "author": "Marc P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "Outstanding pie. We had the Margherita and one other I can't recall the name of. \n\nMargherita was on point, great chewy crust with a little char. Rocket/walnut/feta salad was very nice. \n\nHad a decent double espresso and cheesecake was middle of the road (but I'm not a connoisseur). \n\nOnly down side was a slightly surly server but everyone has a bad day sometimes.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "We ordered a large margherita pie for pick up. The wait was about 1hr and 15 mins until our order was ready but well worth the wait! Order In advance because they are super busy. Everything about this pizza was amazing my boyfriend and I killed the large pie in one sitting and enjoyed every minute of it. Looking forward to going back!", "author": "Brittany R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "This was hands down the BEST pizza I've had! I could taste every fresh ingredient and I loved that I could watch the chefs make the pizzas from my table. Everyone was super friendly with a smile and our waiter was fantastic! We walked the Brooklyn Bridge over to Dumbo and really enjoyed this delicious pizza! Toppings we chose: Margherita sauce, mozzarella, pepperoni, sausage with fennel and prosciutto. If you are looking for an authentic delicious New York pizza and experience, this is it! I highly recommend and only wish I could bring this place home with me!!", "author": "Brittany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Hands down the best pizza around. Thin, crispy and lots of flavor kinda pizza. I was here 3 years ago (I'm not a local) and it's still the best!  You can't go wrong with any pizza you order-I've had quite a few as the first time I was with a large group. Service is excellent, however you can usually count on a wait to get a table. It's worth it!!  This is the original Grimaldi's - do your research.", "author": "Tammy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Waited 1 hour on a sat night at 9pm for a table of 3. Pretty good service.  Had a margherita pizza and no.1 with black cherry soda.  Not a hige pizza fan buuut Pretty darn good pizza, thin crust, not too greasy, generous toppings, but not out of this world and not the best I've ever had. Wouldn't do it again, but worth the wait for the first experience.", "author": "Kyle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "After taking in a Yankees game on a lazy Sunday afternoon and then attempting to navigate the NY subway system (Yes, I'm a tourist), we finally walked up to Juliana's and what appeared to be a very long line. At first I said \"aw hell naw!\" I'm not a line stander. I don't do lines. I cant think of any place that's worth waiting in line. I hate lines. That being said, when you make it to Juliana's, I want you to do something:\n\nI want you to wait in that line.\n\nI don't care how long that line is, you need to wait in it. You will be rewarded with the best pizza you have ever tasted., It only took us 30 minutes to get seated, and its clear they try to get you seated as soon as they can.  We did a half and half pizza, one half margarita with peperoni and sausage, and the other a white cheese pie with pepperoni and sausage. If you are with another hungry person, I suggest the large pie, not the small. After we rolled out of there, filled to the brim with carbs, cheese and protein,  we stumbled back to the metro station and rode the \"R' train aimlessly, until we snapped out of our pizza coma and somehow made it back to our hotel in Times Square.", "author": "Alfred L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Don't fall for the tourist trap: skip the line at Grimaldi's and go to the REAL Grimaldi's (Patsy Grimaldi actually owns and runs THIS establishment).\nThe pizzas might be a tad bit pricey, but they're pretty darn tasty. Whether you're enjoying the sights by the river, or walking across the Brooklyn Bridge, a trip to DUMBO isn't complete without stopping here at Juliana's. It's a must if you're bringing friends or family from out of town, and want them to get an essential part of that trip to New York experience.", "author": "Mark C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "I had the margherita pizza with half sausage and pepperoni- pretty good! Not out-of-this-world spectacular, but very good. Chicago thin crust still has my heart, but I did enjoy my pizza here.", "author": "Amelia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "It was interesting reading about Juliana's long history as a new york pizza place. . .well the owners (they had a different name, sold that, it became a chain, they started a new place).\n\nThis coal fired pizza place was amazing.  My biggest comparison is normally to Frank Pepe out of New Haven.  Juliana's matched frank and surpassed in many ways.  I would only signal out Pepe if you really had to do the white clam pizza. . .the toppings and quality of Juliana's exceeded Frank's in every way.\n\nThe place is fairly nice size, and within spitting distance of the Ferry from Manhattan.  It can get busy, but we found a table very quickly.  \n\nWe also got a egg cream while in Brooklyn (felt we had to) and it was tasty, but my wife's beer was a better fit for the pizza.", "author": "Christopher G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-22", "description": "$3 for an 8 oz diet coke bottle. \n\nGuys, get real. \n\nThe pizza is good but not life altering. Service is efficient. A small pizza is more than enough for two.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "I've heard many chefs said that people are often afraid to use salt in their cooking and how a mere dash of salt here and there could transform a dish. I thought about this as I dug into the #1 special here. We sat at the counter where we could see the pizza being made so we saw firsthand the mounds of fresh mozzarella, meat and vegs that go into pies here. And yet, our pie would've been all but tasteless except for the toppings. Eventually we asked for a side of tomato sauce to spread on our pizza, and that made all the difference. The sauce is amazing btw, and the 2 of us finished our large pie, thanks in no small part to the sauce.\n\nWe waited about 30-35 mins starting at 6 on a lovely Saturday evening. By the time we left, the line was twice as long. So unless waiting in line is your idea of a good time, get here by 6, 6:15, to avoid long lines.", "author": "Linda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Absolutely amazing.  Worth the flight to NYC and the walk across the Brooklyn Bridge and the wait.\n\nGreat service.\n\nAnd the pizza is out of this world amazing.\n\nGo!", "author": "Spencer A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "My friend and I were visiting NYC for the first time and we were recommended to try Juliana's pizza. Their pizza was amazing we also tried their red wine(Idr the name) but I can easily say this was the best red wine I've ever had. The staff was super friendly and they gave us some helpful tips about the city. I will definitely go back to Juliana's when I visit NYC.", "author": "Preni N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "They have solid brick oven pizza. I went with a group of 4, and we ordered a small No. 3 \u0026 No. 4.\n\nThey were both really good! We were afraid they were going to taste similar, but they were quite different. No. 3 was a white pizza with mozzarella, sausage, broccoli rabe, and sausage. The cheese was gooey and all of the toppings worked well together. I threw on red pepper flakes and I thought it balanced out the flavors well. No. 4 had arugula, tomato, mozzarella, and prosciutto. Delicious as well, but it was a little harder to eat as the prosciutto and arugula made it challenging. It was hard for us to decide which one we liked better, but 3 of us chose No. 3 over 4. I would say it really depends on your preference though.\n\nFor dessert, we ordered the Brookie Bridge. It was a brownie ice cream sandwich. There were several ice cream flavors that were available, but we got pistachio ice cream. Overall, it was pretty good. A little rich but not toooo sweet. Brownie overpowered the ice cream as I couldn't taste the pistachio. Would recommend getting vanilla ice cream with it. \n\nService was great. Our server was quick and prompt. When we ordered the drinks and food, the wait was not long at all. \n\nI would suggest trying this place as soon as they open. We waited in line outside for about 25-30 minutes and we got there around 12:30 for lunch.", "author": "Sora P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}