{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-01", "description": "On our trip to NYC I wanted to take a trip to Brooklyn to try the famous pizza. When we pulled up via Uber, the line was down the sidewalk. It was in the 30s but I figured it must be good if people were willing to freeze. About half hour into my wait, my fiance pointed out the name of the establishment. It was NOT where I intended to go. But A quick google search taught me it was a competitor so I decided to stay put. \n\nThe pizza was perfectly thin, we got half with cheese and half pepperoni. We also ordered beer and I love that the beer is served in it's appropriately marked corresponding brewery glass. It was a nice touch. Service was top notch. I bagged up my leftovers and finished it off hours later. It was still great, even cold. I am so glad the driver made the mistake and we ended up at Julianas! I deducted a star for the inconvenience of the long line and nowhere to stay warm while waiting.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-11", "description": "Very good pizza, line was long, there was a long wait, crammed seating.. The dough was thin and chewy in some areas, and took a very long time to get the food and drinks. Sauce was great and toppings were fresh. I didnt try anything else. I would go again but if I am in the area.", "author": "Erica R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-30", "description": "I thought this was pretty average pizza for New York - especially for Brooklyn. Given the high ratings on Yelp, I was definitely a bit underwhelmed. It almost feels like this place has been overhyped by tourists. \n\nMy girlfriend and I ordered the margherita pizza to share. The flavor was not bad, but I had to add some salt and red pepper. The dough was also chewier than what I usually prefer.\n\nWe also ordered their cannoli for dessert which I also was not a fan of. It tasted more artificial than I would have liked. \n\nMy girlfriend on the other hand really likes this place though so I will probably give it another try. For some reason this just didn't hit the spot for me.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "Best pizza I've had anywhere ever! \nWhen the place we intended to go to next door was closed for renovations we ended up here. I'm so glad we did because the pizza was nothing short of spectacular. We waited quite a while to get in but it was 100% worth it! Ingredients tasted fresh and delicious. Thank you, next.", "author": "Amamda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "Not much to say here: great, fresh, stone-fried pizza. We ended up here by accident, but we will definitely be back. We got two pizzas (1) margarita and (1) margarita with pepperoni and sausage (pictured). Both were delicious and you could taste the fresh ingredients. \n\nRecommendations: 1 large pizza is enough for three people to have two pretty big slices. Also, there was a line when the restaurant opened but we were fortunate to have arrived and get a seat immediately. If you are planning to visit when they open, I'd recommend getting there a bit early.", "author": "Kristopher O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "This place is SO. GOOD. Get there right before they open and with only 2 people in your party so you don't have to wait very long. With this strategy, we only waited 10-15 minutes.  And definitely don't be scared of sitting at the counter, where you'll get to watch them make the pizzas!\n\nIt may seem weird to order a salad at a place where pizza is the reason for coming, but do yourself a favor and get the the caesar salad WITH the olives and anchovies added on.  Best salad I have ever had.\n\nThe pizza... wow. Can't go wrong. One of my faves in NYC.", "author": "Jackie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "Oh my, this was the most phenomenal NY pizza I had during my trip to the Big Apple! Worth the chilly walk across the Brooklyn Bridge. My friend suggested Juliana's and had mentioned it is the original Grimaldi's.\n\nLuckily, we were seated at the bar immediately. We came in for an early lunch, but at around noon there was a line forming out the door. The service was fantastic and attentive. Waters were constantly refilled and our friendly server showed us that small was actually large enough to feed two people. We ordered the margherita pizza topped with extra toppings (prosciutto and garlic) for an additional cost. Pizza was prepared fresh in front of our faces to our table and into our tummies. I would come back when I'm in Brooklyn!", "author": "Mindy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-05", "description": "Delicious brooklyn pizza! Busy almost any time of the day it seems. There was a line even at 2:30 on a weekday. Worth the wait, it moves quickly! \n\nFreshly made to order pizza. Pies only! \n\nNo. 1 - the truffles called us and Margherita. They have two sizes and the three of us split the medium. We were stuffed! The pizza was delicious - thin crust without being too chewy. It was not too salty as well after the pizza cooled down a bit. Ample toppings and cheese. The truffle in the No. 1 came out very nicely. Probably can't choose a favorite between the two - one is a restaurant special and the other is a classic well done.", "author": "Alyson Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "It's a very good pizza but not hysterically as everyone says. You will enjoy every bite for sure, but I eat better one in the past", "author": "Nadav D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "E X C E L L E N T worth the line! Light fresh and flavorful! Grimaldi's was closed for renos. So decided to eat at Julianna's (pretty much the same thing) google it or read the bio on the window when you come.  Great pasta al dente perfection and the sauce! so fresh and tangy right on point. The cheese cake is also a little star on its own with a raspberry sauce on the side perfect pair.", "author": "Maciel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "Pretty good pizza, but don't see what the big fuss is about. Dough is thin but chewy, get the half margarita and half white. White is deliciously garlicly. Gets real busy, and even at end of lunch shift there's a big line and a host comes around telling you he doesn't know if you'll make it before 315 (have to wait till 4 then, but if you get there at 4 you'll be in a line).", "author": "Hamilton W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-14", "description": "Had margherita w meatball and sausage.  Very tasty. Crust has nice crisp with some chew and pliability to it.  Meatball had nice flavor.  The meatball appetizer may be worth trying next time.", "author": "Kyle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "We arrived on a random Saturday afternoon at 1:40pm to a line out the door. The line was almost to Grimaldi's next door. \n\nMy party of 3 basically got in line and started looking at other pizza joints to check out within walking distance that didn't have such long lines as these spots...\n\nWell we had a 20 minute wait and were seated at the bar. FYI, if given the option to sit at the bar, say yes. You get to watch them make all the pizzas and oversee all the action. It was great!\n\nAs for the pizza itself... We ordered the small margherita pizza with half pepperoni on it, and it was delicious. The crust wasn't too thin but not super thick. Everything was perfectly cooked. Not greasy. Great size for us 3 girls - about 2.5 slices each. \n\nNote that this place closes at 3 so the kitchen staff can clean the oven.\n\nIf you come to Brooklyn, make sure you stop by. I have bookmarked this spot so I can come back every visit!", "author": "Mandi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "Before beginning our full day of fun and exploration, my friend and I ordered a small margherita pizza topped with pepperoni. Nothing makes me happier than lifting a slice off the pan and seeing the cheese stretch like there's no tomorrow. Each bite of that thin crust pizza with marinara, mozzarella, and basil was delicious. One small pizza is the perfect amount for 2 people.\n\nThere are three classic pizzas: margherita, marinara, and white. You can then build upon these pizzas with any toppings that you desire. These toppings come at an additional price. There are pizza specials with toppings already picked; you cannot make changes to these ones.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "This was my favorite pizza restaurant on my visit to New York. The pizza was great. You can't get pizza like this anywhere, only in New York. We ordered a pepperoni pizza and a sausage and mushrooms pizza. The sausage was amazing. It tasted so fresh. The service was great too.", "author": "Gerry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Tis pretty effing delicious.\n\nWaited in line starting at 3:35pm on a Saturday for their 4pm opening and was only the third party in line. We were seated immediately when they reopened and ordered a half Margherita half White with Mushrooms \u0026 Sausage pizza. The Margherita was good but the White w/ M\u0026S side was divine! I liked how there wasn't too much crust...the white sauce had the perfect amt of garlickyness, and the shiitake mushrooms added a nice touch.\n\nWith the gazillion pizza options in NYC, this is def one of the best ones, and I would not mind lining up  again to try this.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-04", "description": "It's not for me I am a New Yorker not a foreigner  so I guess my vision of a pizza is different . It's ok place but not for me .specially to wait on a line to be disappointed and had to go to burger shack after .. I could of went to Peters Lugers if I added another 20$ dollars for the money I spent on both places plus the  parking lot", "author": "Harold M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "Usually there is a huge line here and that's pretty obvious from the queue marker outside the restaurant. The servers are very aware that the tables are uneven and make sure there is support underneath constantly so the tables don't wobble. \n\nMy opinion is that a margherita pizza is the one pizza that you can easily compare apples to apples for pizza places. \nI loved the cheese they used. It melted nicely and mixed with the sauce and basil, unlike other places that still have kind of a \"cake\" of mozzarella cheese and it doesn't spread much. \n\nWe got a large and the two of us still ate it all :) \nOnly downside was that it got cold really, really quickly. Like our second slice was already cold.", "author": "Sally W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-28", "description": "Juliana's was a pretty good spot for pizza, but for all of the hype, it really was just pretty average. We ended up getting a pretty standard No. 4: mozzarella, arugula, and prosciutto. This was good pizza don't get me wrong, but like there are many places in which 99cent pizza is also really good, you Juliana's requires quite a long wait before getting into a final, possibly unsatisfying pizza.", "author": "Willy X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-11", "description": "Juliana's was a recommended tourist spot we had to check out. The first time we walked by the line was so long we didn't wait but another day we came by and decided to try it out. The line was a little shorter but still long but moves quickly. We probably waited 30 minutes outside so not bad at all. The hostess outside were very kind keeping us updated on the weight time. We were seated and unfortunately our waiter was so distracted the whole time. It became very annoying to me... We had to get his attention just to order food. He literally only came to our table at the beginning for the water and introduction, to order the food and when we called him over for the check. Pizza is a greasy meal therefore beverages are a must. Three times we needed water but had to either ask a different waiter and one time I got it myself!!! This was definitely not the service I expected. Im sad to say my review is not just based on the food but the customer service. I could tell other employees were much more attentive and helpful but we did not personally receive that. To come to a restaurant (expensive for pizza at that) and receive poor service was not kind. We were not offered dessert options (which usually is a great way to increase the bill) nothing... In regards to the pizza it was good. We got the white pizza and added pepperoni. The pizza is a little pricey but you go for the experience and to say you've tried it, but if I knew how the service would be, however, I would have not bothered going in the first place- very unfortunate.", "author": "Jennifer T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}