{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "With all the hype about this place, I would say the pizza delivered! It was extremely good pizza! Fresh, creamy mozzarella, fresh basil, delicious sauce, and the crust had the perfect bite of crispy and chewy! Really yummy. The pepperonis weren't that good though. And the reason I took it down to 4 was inside seemed the ac was off or broke, it was smoldering in there, sitting outside on a summer day was a better option. And the service was the worst. Really rude. Waited at the counter for a good 5 mins with 3 employees standing right there without a hello. Waiter couldn't have been more bothered by us, and very unwelcoming. But the pizza was pretty good.", "author": "Tanya L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-24", "description": "This is my first Brooklyn pizza experience. My expectations were set quite high because of the fame. However this restaurant just missed to deliver. The pizza was good but nothing spectacular. I find myself more of a slice person rather than a pie which makes sense in its ways because after you finish your first slice, the rest of the pie starts to get cold and soggy. The margarita pizza was definitely the highlight but the white sauce pizza just felt bland. My biggest complaint is it is not crispy. Perhaps the restaurant needs a 21 st century upgrade such as better waiting management and be more flexible about the orders.", "author": "Ling J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "TLDR: Amazing pizza, lives up to its expectations. Get one of the specials. Expect long long lines, so try to come early during a weekday (we came on Monday around 5:30 and did not wait in line)\n\nThings I liked -\n- The pizza tastes amazing! We had the special number 1 \n\nThings I did not like - \n- The place is small and cramped\n- Service could be better, but I suppose they are jam packed most of the time\n- The Pizza got a little soggy at home (we took home some leftovers)\n- DO NOT GET THE DIET COKE! 3$ for a tiny bottle with no refills \n\nOverall, I would love to have me some of that pizza again but will probably get it to go rather than sit in the place", "author": "Ahmad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Delicious, one room wonder! The pizza was awesome. I really enjoyed the atmosphere. The line was crazy right at 3:40 for the opening!", "author": "Kymm A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "We waited in line in the pouring rain and we'd wait again in all sorts of torrential falling misery for this unforgettable Heaven-on-Earth pizza. \n\nI'm often yelping up Brooklyn pizza in my area just so I can revisit even a fraction of the deliciousness. If I was made of money I'd be jetting off to NYC on random unplanned weekend trips for this pizza (and all the amazingly awesome pizza Brooklyn has to offer). \n\nI'll just eat my memories until next time.", "author": "K. A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Awesome pizza, if not the best I've ever had, but this is solid as far as dedicated NYC pizza shops go.\n\nOur group of six waited around 40 minutes for Saturday dinner. The interior is pretty dark (not in an ambience-additive way, more like dingy dark) and cramped, and service can take a while since this place is HOPPIN'. Our waiter was very garrulous and friendly though, and told us several tales about his previous career and his kids and complained the customary New Yorker  complaints about apartment rents.\n\nWe ordered the Margherita and Nos. 3, 4, 6. Four pies for six people - *barely* enough if you have several big appetites in your group. Majority favorite was No. 6 with the chicken and guac. I also loved No. 3 with the broccoli rabe and sausage - whatever sausage they used was delicious. Margherita was pretty standard, wouldn't order it again because it didn't add much to the table.\n\nPizzas take anywhere from 10-25 minutes each to come out, so don't come in thinking you can dine and dash. Come with a hungry group, wait your 30+ minutes in line, order all the pies you can handle, and leave stuffed and happy.", "author": "Millie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Must try if you are in Dumbo!! Great coal fired oven pizzas! However, the average wait time is about 30mins to an hour if u come in during meals!", "author": "Gloria H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-14", "description": "Love me some pizza. \n\nThis place did hit the spot,  but I was expecting a little more flavor from the pizza. The inside decor is nice, but the men's restroom is right by the kitchen which is a little weird. The overall service was good and the wait can get a little long, I am guessing on the certain time you go, but they get you in and out pretty fast.", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "This place has excellent pizza. The crust is thin and crisp, the cheese is fresh and good quality, and the toppings are generous. They lost half a star for only offering two (very large) sizes, and half a star for having very strict rules about alterations. Otherwise the service was friendly and our server was helpful.", "author": "Brandina D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-05", "description": "It's harder and harder to get real New York pizza in NY. Waited on line 40 minutes, and although I suspected we'd get this newfangled coal fired pizza, others in our party wanted to try it. Crust is thin and although they do cut in triangles, it doesn't fold like a slice of real pizza. The taste was bland, but it was weird because I got a bad case of heartburn later. \n\nThe service was quick and the ingredients seemed fresh.\n\nIf you want a slice of old fashioned pizza, try Luigi's in Clinton Hill, or Antonio's in Park Slope.", "author": "Jerri P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "Juliana's was delicious!! Hands down one of the best pizzas I've had while visiting New York! Service was great and the atmosphere was so cozy and intimate, loved it!", "author": "Merilyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I visited this restaurant in 2016 spring break\n. I remember I came right on closing and met the owner who served me after mentioning I was coming from Arizona and had few days in town. It was the best margirata pizza I ever tried in my whole life, clean place and great experience. Many thanks to thw workers and the owner who over worked for 20 minutes, many thanks.", "author": "Eyad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "The best pizza in the US. Patsy Grimaldi is a legend. His pizza is legendary. Any pizza here will be worth it.", "author": "Caleb C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "Long wait outside and options are limited but pizza was great! Quality dough and ingredients.", "author": "Stephi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Yum! Yum! Yum!  Everything about this place was perfect- the aroma, the service, the food, the drinks.  We were seated quickly, served promptly, and enjoyed everything.  Definitely a must!", "author": "Diane A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "I loved every bite of this beautiful pizza. We got the Special #4, which came with prosciutto and arugula. Our server was attentive and the pizza came out in good time. We were actually lucky that we came in when we did, because the restaurant immediately got packed after we sat down. \n\nWe split a large between four people, which was enough for us because we just wanted it as a light meal. If everyone is super hungry, you'd probably want to order more. The prosciutto and arugula was a fantastic combo, along with the fresh mozzarella. The crust was super thin and crispy! I normally don't like crust, even from Lombardi's, but this crust was just as delicious as the rest of the pizza! \n\nWhat was really cool was we could see the pizza being made in the back of the restaurant. You could see the coals in the brick ovens, and you can actually see them put the pizza in the ovens to cook. Lots of people were taking pictures, haha.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-27", "description": "Not really sure what all the fuss is about. The pizza is not bad but considering these other reviews I'd say it's way overrated.\n\nThe crust is good, the sauce okay, but the flavor is weak. The cheese is acceptable and the arugula fresh but again...4 1/2 stars? Don't think so.\n\nIf you're looking for a really tasty pie try Pizza Moto.", "author": "Marc S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "This place was honestly quite disappointing. There was quite the line outside when we went, which shows how popular Juliana's is. We ordered two of the special pizzas, (3 and 4), but both came to our table decently cold. The ingredients themselves were fine, and the crust was quite superb. However, the seemingly lack of freshness was subpar. Maybe one day I'll try this place again with a better experience", "author": "Christopher T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "Ahhhh where do I begin! This place is worth the wait. I was a little double minded whether I wanted to wait for pizza or continue on being a tourist. The wait was about 30,40mins and we went around 12pm. The line did get longer while we were waiting. Once you get seated the service is really fast. We literally ordered right away and had our pizza within 5-10mins. This is a must if you're visiting New York.", "author": "Jazz K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "When we showed up the line was long. We waited for about 50 mins. The line does move fairly quick. We tried the white large pizza with added pepperoni and also ordered a spaghetti and meatballs. The service is fast so is the food. The pizza was really good and the spaghetti was not bad. We would come again.", "author": "Enrique G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}