{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "It took us about an hour to get in the way it was very long but worth it. The pizza could use more sauce in my opinion and little pricey. But overall good. I did like the Cole fire oven and the Dow also the meatball was very nice.", "author": "Hajir V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Sold me cold pizza. Called the restaurant and they hung up the phone on me. Terrible customer service!", "author": "Nazrul B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "This is definitely in the top 5 best pizzas I've had in my entire life.... and I eat an unhealthy about of pizza. \n\nWe thoroughly enjoyed lunch here after walking the Brooklyn Bridge. There was a line to dine in, but the wait went quickly and it was absolutely worth it! \n\nWe kept things simple and ordered the Margherita pizza and added pepperoni. It's hard to put into words how delicious this pizza was. Everything from the fresh toppings to the crust was to die for!\n\nThe staff was great as well! The only reason I'm giving this place a 4 instead of a 5 is that their desserts are pretty terrible. Don't waste the calories, just get a second pizza.", "author": "Brigitte P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-17", "description": "Pretty good pizza. When I went with a group of friends we got the pizza with prosciutto and arugula . It was good. We did love the meatballs though. For one person it fills you up. We also got sangrias which tasted like juice. \n\nThe ambiance is nice and relaxing. Very nice decor. \n\nFood wise in my opinion it's pretty normal.", "author": "Jacqueline O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "Pros: none. Cons: wait time, cold AC, waiting time. \n\nNot sure why it's so famed. After waiting in line for about 20 minutes expect to be seated under a AC blowing in your face and quickly cooling off your pizza. I've got a margarita pizza with a few extra toppings, and it was nothing special. Might be an unimpressive attempt at thin crust Italian pizza. Normally would be 4 stars, but due to unmet expectations and waiting time knocking off another one.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "The pizza here is SO GOOD!!!! It was flavorful, fresh and just the right amount of crunch + crisp in the crust. The place is a little small so we did have to wait to be seated, but it was worth it! The Cesar salad had the best croutons, too. It was amazing, I just can't say that enough! \n\nOn top of the great food our server, Wes, was refreshingly upbeat and friendly. He definitely was a pleasant change from a lot of the service we had received elsewhere. Turns out he was originally from Kentucky, so he had that Southern hospitality down!\n\nThe pizza was just as good leftover, and it was worth every penny. This place was a recommendation by a taxi driver and a damn good one!!", "author": "Alison M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "A much better experience IMO than Grimaldi's next door.  The service was better, the menu was better, and they took card (I feel like I'm remembering Grimaldi's is cash only?).  All-in-all, for DUMBO, it was a great spot to check out.  I wouldn't say it BLEW ME AWAY, but I will say it was a very good dinner.  A little rushed and I wish the menu had a FEW more items on it, but I would take visitors here.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "We went there solely based on yelp reviews and I completely agree!  Pizza was soooo good, but my favorite part was Trimell, this guy was so personal and awesome, thank you for making our Brooklyn trip memorable!  Love your best friends from Arizona", "author": "Sharma L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-17", "description": "To be completely honest, this pizza was not as good as I was expecting based on all I've heard.  We walked by a few times while exploring the area, and when the line was quite shorter, we decided to give it a go.  We figured that we'd wait maybe a half hour to 45 minutes based on the line length, but were actually in line for almost and hour and a half.  We were so excited when we finally got a seat!  \n\nHowever, the place was a little crowded, and felt awkward when instructed to walk between others seated and other tables.  My butt grazed others' chairs and tables, awkwaaaaard.  We ordered a margherita pizza with pepperoni.  It was good, but was not the best we've had.  We've been to hole in the wall places to order \"a\" slice that were served on paper plates in Flushing and in Little Italy that were better than this.  \n\nIt seems that this place is one of those that have a large following of tourist trap type nature.  Not to offend, but there is definitely better pizza around the city of New York, it wasn't really worth the time we spent in line.  Sorry Juliana's!", "author": "Thea H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "I don't know how pizza could get any better.  My husband and I had the margherita pizza with pepperoni and thought it was really great.  Highly recommend!", "author": "Monica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "This was our first time in Brooklyn and this spot looked amazing. The line was out the door and we hopped in. We waited in line for about an hour, starving but it was all well worth it. \n\nWe were seated inside, the tables for 2 are small but it was manageable. We were greeted right away and our server was friendly and informative. We ordered the classic margherita pizza which our server recommended. Half of it was the classic and the other half my boyfriend topped it with the fennel sausage. You can see the pizzas being made in the back of the restaurant which was really fascinating. Our pizza came out in about 15 minutes. We ordered the smaller size but really should have ordered the larger because we killed the pizza in literally 10 minutes. It was delicious!! The crust was thin, great charr, crunchy and had a great chew. The simplicity of the classic margherita was divine and the fennel sausage was a nice touch as well.\n\nHands down one of the best margherita pizza's ive had. Definitely will be back.", "author": "Cindy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Stopped here for lunch. Long line but seated quickly. Only whole pies, no slices.  Very good service and delicious pizza.  Would eat here again.", "author": "Pattie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "I've been here a few times and tried a few of their pizza. They usually have a long wait, wait like waiting on a line that's out the door to put your name down kind of wait. But none the less I still come back. We got lucky the last time we came on a super cold day and there was no wait. Make sure you come with your full party before they get up to you on line though.\n\nI've tried their special pizzas no.1, no.2, and no.4. I've also had their margherita pizza, spaghetti and meatballs, and Caesar salad. A couple of my friends really like special No.1 which has no tomato sauce and pancetta(bacon). I think their special no.2 would taste better with more tomatoes on it being that there's no tomato sauce. No. 4 has arugula and prosciutto as a topping. I love prosciutto so I wish there was more on the pizza. The arugula is tricky cause it tends to fall off. Their pasta and meatballs aren't bad, but pretty pricey. The special pizzas range around $30 each, small and large being around a $3 difference about and maybe a couple of inches in diameter difference. They are on the pricier side. Their regular pizzas like margherita range around $20 a pie. I have to say that out of all the pizzas I've had from here their margherita is my favorite. All their pizzas are thing crust and baked in a brick oven. I wish their pizzas were crispier being that the middle is a little soggier. But everything is pretty flavorful.\n\nI do make my way here every so often, so I will be back.", "author": "Lolin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "If you're from Chicago going to NY and want to try the pizza, then you better go to the best of the best to do your judging. I'm not entirely sold, they're just two different animals in my mind, but the classic with truffles and pancetta was flippin' amazing. The staff was really nice to a single traveler like me and snuck me in just before they closed seating to restoke the ovens. Definitely worth the stop and the wait.", "author": "Anna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "I shared a margherita pizza with extra cheese with my son.  It was more than enough for the two of us.  The pizza was too notch.   The crust was perfectly cooked and seasoned.  The pizza overall tasted amazing with perfect sauce.  Our server was amazing as she was attentive with an infectious smile.  I highly recommend this place for the New York pizza experience.", "author": "Cory B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "this pizza single-handedly made me want to pack my things\nand move to NY\n\nthe perfect sauce, crust, good quality toppings \n(esp the cheese and SAUSAGE - i hate when they use crappy crumbly sausage)\nit's SO hard to find this combination \nthere's always one thing wrong\nbut juliana's was perfection\n\npro-tip: avoid the heinously long line and order to go\nwalk next door and grab a coffee at sbux\nin 15 min, grab your delicious paper-wrapped pizza (not sure why they don't have boxes)\nwalk a few feet\nand enjoy your amazing pizza while sitting on a grassy spot in the park\noverlooking the water\n\nSO NY! :)", "author": "Clara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "The best pizza in the country. No Joke\nBe prepared to wait in line. It is totally worth it.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Overall, excellent experience. \n\nAs far as Brooklyn pizza places go, I've tried Robertas and Juliana's. \n\nI can't choose between the two since they are a bit different, but Juliana's was solid. Got the tomato, mozzarella, arugula and prosciutto pizza (No. 4) and it was so tasty. \n\nPlus, the line wasn't too bad for a Saturday afternoon. See you again soon, Juliana's.", "author": "Justine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "Come here for the most perfect pizza.\n I often travel to NY and I always come here to eat a good pizza.  The best Egg Cream and No 1 pizza are served there.\n I like Pizza No.1 with pancetta, mozzarella, scallions, scamorza affumicata, white truffles and olive oil - yummy. \nI recommend this place to everyone! It is a peaceful place with good atmosphere and tasty dishes.", "author": "Allie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-26", "description": "Best pizza in New York! The line outside was pretty long, so we called in our order instead and got it to-go. We ate it in the park down the street and it was so hot and fresh. Great pizza and reasonable price. We ordered a small for the two of us.", "author": "Maria B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}