{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "The pizza at Juliana's is phenomenal! I tried the No.1 which is topped with mozzarella, scamorza affumicata, pancetta, scallions and truffles. The toppings were fresh and flavorful and complimented each other perfectly. The pizza was soft with a little crispiness around the edges. If you like cheesy, creamy, and salty flavors, this is the pizza for you. I also tried a Brookie Bridge for dessert, which is basically two brownie cookies with ice cream in the middle. This was a perfect way to end the meal. Expect to wait at least half an hour or more for a seat.", "author": "Nicolas L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Juliana's was opened by the original Grimaldi's owners, and located steps away from the Grimaldi's in DUMBO. This was my first time to Juliana's, to answer the question is it different? We ordered what we usually order at Grimaldi's, which is a pie with olives and mushrooms. The pizza crust was slightly better compared to the Grimaldi's version, but overall you couldn't tell the difference. \n\nThe restaurant closes at 4pm to reheat the brick oven. If you happen to arrive around this time it's worth the wait, you will be seated promptly upon reopening and it doesn't take that long for the pizza  to come from the oven to the table! \n\nJuliana's is nice to try out for fun, but I will still be satisfied with my usual at Grimaldi's!", "author": "Yesha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "I can confidently give this 5 stars. Two enthusiastic thumbs up. A+. This is New York pizza in its fullness, at its finest. This is the original Grimaldi's, so don't be fooled. Juliana's boasts the original oven, owner and recipes. \n\nWe always get half margarita, half pepperoni. Fantastic.", "author": "Amy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "We tried Juliana's based on the good reviews. We tried half margarita and half white, pizza was fine, it didn't blow me away but it was good. We went on a Saturday night and waited about an hour in line, they don't take reservations or write your name down so you can venture out and walk around instead of standing in line for however long the line is. We ordered the brookie bridge ice cream cookie and the cookie was stale. So we will not be going back. I had high hope due to the reviews, but it was a bit of a letdown.", "author": "May T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Great thin crust pizzas, tasty fresh salads, yummy meatballs, reasonably priced. Some wait time outside, we waited about 25 minutes, but won't be disappointed if you're looking for simple, tasty Italian cuisine. Took my son for lunch here and we loved it. Small pizza is big enough for two, and did not take long to come out. Better than the former Grimaldi's IMO.\nWould come here anytime again when in DUMBO.", "author": "Juraj P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-13", "description": "Honestly the pizza blew my mind and everyone was really nice here. We were having a great time and just finishing up with the bill. The restaurant was pretty quiet that night and there was only like one small group of 3 waiting for a table. I'm definitely not the type of person that would sit and hoard a seat if there's tons of people waiting. In fact i generally hurry if i know there's a wait. But literally i just finished chewing and was digesting and filling out the bill tip and this guy comes over and asks if we are done and then tells us there's people waiting for tables. HINT: GET OUT. Completely unnecessary and pretty rude and ruined my entire experience there!!", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "The bomb hands down the best pizza I've ever had  deff will be back when I visit New York again", "author": "Nick G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "So good, it makes you say Pizza is life.This place definitely holds up to the hype. Despite the line that may stretch 20 people long and the small tables inside, the ambiance and most certainly the pizza makes it all worthwhile. Ordered the Margarita pizza with half pepperoni and it did not disappoint. The Pizza crust is crunchy throughput with its sweet pizza sauce and mozzarella cheese instantly hit your tastebuds. It doesn't take more than a split second after biting in to be developed in pizza heaven with all its goodness. If your in the DUMBO area this place is date worthly!!!  Also, They serve Beer and wine!", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "If you want the AUTHENTIC Grimaldi's pizza, this is the place to go. Grimadi's is actually not operated by Grimaldi, he sold the franchise and opened Juliana's in the name of his mother. I remember coming here a few years back and the pizza was delicious. Good pizza like this is one of the few times where I do not mind devouring/ vacuuming in carbs into my stomach. I was blessed with the opportunity to meet Grimaldi himself. It was a winter day and not much people were in the restaurant. An elder man came over and asked how were were doing and such. My sister and I's face lit up like we had the matching numbers to a billion dollar powerball when he introduced himself. I noticed that he was eating something and I asked \"What are you having?\" and he said it was eggplant parm. I said \"Oh I don't usually like eggplant (my mom butchers eggplant, steams it and puts oyters sauce like your typical asian) and it doesn't taste good to me.\" In the midst of our excitement, I asked if we could take a picture and he was really kind and gentle and agreed to it. After he left the table, and a few moments later, the waiter brings out a plate with some sort of fried looking thing to me. I took one to eat and I was like wow this is really good to my sister \"What is it?\" She said \"It's eggplant parm.\" I see what you did there Mr. Grimaldi :) Thank you.\n\nIf you are ever around NYC, I'd 100% recommend his place. It's near the Dumbo area, which is a nice place to walk around for a date or for family stop by this gem. \n\nI know this picture isn't the best quality or most up to date, but this was an experience I'd never forget.\n\nThis place does get crowed fast!", "author": "Julie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Delicious! Some of the best pizza I've had in New York. Went here on a Monday afternoon, and it was still pretty crowded but got right in! I will definitely be coming back.", "author": "Kayla F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Omg such an awesome pizza place. Super good and incredibly portions. Salads were very good and staff was super helpful and friendly.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Came here with family before Brooklyn Ice Cream Factory and was not disappointed. Watch portion sizes as large pie is big, we had 4 people and 2 small pies and a calzone was more than enough. Pizza was very good, thin sliced, fresh ingredients, good sauce and prepared well. I only wish they had more choices on special pies as we stayed with margarita and just added toppings on one of them (mushrooms, and meatballs were good).", "author": "Richard C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "Not worth the wait. Being a tourist for the day we decided to stand in line and wait. We got in line while they were stoking the coals (they're closed from 3-4 to do this) with the hope of immediately being seated at 4 and we were! Service was super fast (maybe too fast!). Order was taken within 5 minutes and meatballs were served after another 5 minutes. Meatballs were lukewarm and nothing to write home about. Pizza probably came out in another 5-10 minutes. I wasn't blown away. It was comparable to Motorino on the UWS and there you don't have to stand in line forever waiting for a table. I'm glad we went through the experience but I definitely wouldn't do it again and I probably recommend not wasting your time in line.", "author": "Vanessa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "So good! Best pizza I've ever had!!! Staff was all very friendly as well. Wish I lived in NY just for this pizza.", "author": "Chelsie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Delicious Pizza. The base is the best I have had. It is thin and well seasoned but not too thin so you can still pick it up.  Also hs the perfect amount of chew to it.\n\nThe toppings were delicious and the service was great. \n\na rare 5/5 for pizza from me", "author": "Pooline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Came in for late lunch.   The place is small but they are able to turn it out rather quickly.   Simple, perfect, margherita pizza.    The best accompaniment was a chocolate egg cream made with seltzer boys seltzer.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Shared an Uber with a local and was told to try this place out. Could not be more grateful for this recommendation. After a long flight and being slapped in the face with the east coast cold weather, this pizza was heavenly. We kept it simply with a margherita pizza and devoured every last bite.", "author": "Molly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "This place sure lives up to the hype! I've had Grimaldi's years ago and it was definitely the best pizza I've ever had (my experience may not have been as authentic since I didn't wait for the pizza and I didn't dine in) - I didn't even know Juliana's is actually the original! However, when I found out, I immediately knew I had to give it a try. Honestly, I don't think there's a HUGE difference in taste (keep in mind, there is a four year gap in between) so I can't confidently say Juliana's is far superior. \n\nStill, no white or margarita pizza will ever compare to what I experienced here. I had the white pizza with sausage and the margarita with pepperoni and would highly recommend either. Normally, I'm not a huge fan of white pizza because I'm more a sauce person than a cheese person. However, the fresh garlic that is strategically placed on this pizza can easily convert anyone's misconceptions. The sauce on the margarita was amazing - perfect blend of the amount of sauce, thickness of the dough, and proportion of the basil. I couldn't have asked for a better eating experience.\n\nSome extra bonus points for:\n1. Having everyone who isn't seated wait outside, allowing maximum space for seated customers and giving them a nice/relaxing dining environment.\n\n2. A clean bathroom - very well kept considering the amount of traffic that walks in and out of there a day.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Don't walk, RUN! This place is amazing. Best pizza I've ever had. The location isn't too shabby either!", "author": "Brittani M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-28", "description": "Always with long lines Juliana's has created some expectations for me and my wife. My wife always say that in NYC long lines are not correlated with good stuff, and in Juliana's case the correlation also doesn't exists. Mediocre pizza: very thin crust, but not in the good way, along with just okay ingredients made the Margarita taste like that pizza that you can find in whatever small hotel restaurant. \n\nThe upside is that the restaurant is located in the best neighborhood of the five boroughs. They are not pretentious so I cannot call this place a tourist trap, although I doubt it's frequented by locals.\n\nAt the end they put the left slices stacked inside a foil. They definitely don't send the message that they care about their pizza.", "author": "Marcel A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}