{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "This place was delicious and had such a friendly atmosphere! The cheese was soooo fresh and the tomato sauce was delicious. Garlic. Yum. Definitely sit at the bar so you can watch the dudes sling dough all over the place and make amazing looking pizzas. \n\nBut seriously -- the pizza was amazing.", "author": "Maggie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Amazing Pizza!!! Thin crust that makes it seem like a lot of pizza, however it is perfect for 2 people.", "author": "Bradley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Absolutely the best pizzia in Brooklyn, the original Grimaldi's owner opened up new restaurant here because low life's stole the name and have a grimaldis next door. But you can taste the difference, Never go to Grimaldis, go here!", "author": "Mark C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "Hands down, the best pizza. Juliana's is a life changing experience - and everyone who we've brought here agrees. \n\nFirst, you have to understand the story. Juliana's is located in the original Grimaldi's building, with the original coal fired oven, and it's run by Patsy Grimaldi himself. Next door, you'll find a restaurant by the name Grimaldi's with a huge line of uninformed lemmings. Patsy Grimaldi sold this and the naming rights when he retired. For various reasons, including his frustration with the quality and management of the Grimaldi's he sold, Patsy came out of retirement to reopen the original and bring back the best New York pizza.\n\nYou can find Patsy at the restaurant most days, demanding the best quality, schmoozing with his patrons, and hustling the streets in front of his restaurant. As a man in his 70's, this is definitely his passion.\n\nWe've eaten at both Grimaldi's and Juliana's many times. No longer will we waste our time at Grimaldi's. While the price is a bit lower, the service is rude, the place is dirty (including the silverware and plates), and the pizza is overly greasy. It's still better than most pizza, but far below Juliana's. \n\nJuliana's pizza is fresh, crisp with the right amount of chew and texture, high quality ingredients carefully portioned, and cooked to perfection in the age old coal oven. The pizza cooks take pride and work fast and consistently to produce literally the highest quality pizza possible. \n\nIn addition to pizza, Juliana's salads are fresh, crisp, and made with the same amount of care as their pizza. Homemade dressings that actually dress instead of drown the beautiful salads. \n\nThe true testament to the pizza is the odd phenomena of eating about 3x what you could normally eat. This is in part due to the relatively thin crust, careful portioning of cheese, and the absolutely our of this world flavor. \n\nIn short, if you want NYC pizza and have to choose one place, go here. The Brooklyn bridge park nearby will give you a great place to walk and get the best views of downtown Manhattan after you've filled your belly.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "Im glad my brother took me to Brooklyn for pizza,  we had simple Margherita Pizza and it was good. Thin crust, good tops, we had it basic, no extra topping and it was one of best I had. Im still trying to search for that kind of pizza, in Toronto with no luck", "author": "John G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Juliana's Pizza is a great place to visit if you are looking to go to an establishment with charming character and old heritage. Whether you choose this one or Grimaldi's next door, you can expect the same authentic Brooklyn pizza experience and a long wait line as well. If you do have the patience and time to wait though, getting into Juliana's feels like an accomplishment within itself. Servers were polite and I thoroughly enjoyed my meal even though it took quite a while, but since I knew how busy the place was I looked the other way on that complaint. The pizza was good, but I can't say it was the best pizza I've ever had. It is equally as delicious as similar Brooklyn pizza establishments such as Brooklyn's Brick Oven Pizza or Grimaldi's, but I definitely had a great time and would recommend anyone who wants a lively pizza experience. I enjoyed the specials (we tried No. 1) and the margherita pizza with additional sausage and mushrooms was equally as delicious. Although I do not think I will be visiting again, I highly suggest visiting with tourists or visitors for the full Brooklyn experience!", "author": "Sherry X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "When I made my trip to New York, I vowed to at least try a couple of different pizza places.  I did tons of research to try and get a consensus as to some of the best pizza in New York.   Even though opinions seem to vary wildly about pizza in New York (and how can it not with so many places to pick from!), it seems like Juliana's had consistently the best reviews.  I made the long walk across the Brooklyn Bridge, and got there close to noon.  I was able to get seated right away, and the friendly waitress gave me a rundown of the pizza, and her recommendations.  I opted for a half Margherita and half White pizza.  They don't serve slices here, and the smallest pizza was still almost too much for one person to finish.  However the slices are thin, so you can put down more than you think you can.  Both kinds of pizza were good......the white side reminded me of just a really good garlic bread.  \nThe pizza was really good, but I can't say it will be all that memorable to me in the future.  I somehow remember being more wowed by Lombardis pizza when I visited New York a few years prior.  Just seemed like Lombardi's had more of a coal taste to the crust that I wasn't getting from Julianas.  \nStrangely, I found the pizza seemed to get better as it became colder.  It seemed like I was able to taste some olive oils coming out of the pizza, and the flavors just popped a little more.  \nThe one dissapointing thing was that I love to drink Coke with my pizza.....and all they have at Juliana's are small glass bottles of Coke.....and of course no refills.  So for $3, you essentially get a few sips of soda to go with your pizza.  I'm not sure why certain restaurants put such a premium on Coke, when it's so cheap to install and serve.  Overall I had a good experience, and I would go back again on a future visit.", "author": "Phillip S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "We got the no. 1. I can tell the ingredients are quality and the pizza is made really well, but this was the saltiest pizza I've ever eaten. It was like eating a salt lick...and I love salt! I would go back to try again, maybe the other pizzas aren't so salty. Good service. Good vibes.", "author": "Jordan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Perfect NYC pizza in every way!! The crust, cheese, sauce are all made from quality ingredients all have amazing flavor, quantity, and are cooked to perfection! The accompanying beer for me today was also a perfect match and local! (Sixpoint Sweet Action). The service was also very friendly and prompt. I can't recommend this place enough.", "author": "Christopher W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "I don't hate pizza but I'm also not particularly a fan of it, so if I had a choice to choose something else to eat I would. Unfortunately my manager loves pizza so we had to come here to eat with the team. \n\nWe got the white pizza with added ricotta cheese and regular margarita pizza (which just means basic cheese, tomato sauce,  and basil at this place) with added pepperoni and mushroom.  Both were small pizzas at $16 each , which if I had to eyeball it would be about 10 in diameter. One small pizza would be enough to feed 2-3 people assuming each eats about 3 slices.  \n\nHave to say I liked the white pizza more because I'm a cheese person. The margarita pizza was not bad but nothing spectacular for me.  Just like corner store pizza with fresher ingredients and sturdier crust with less oiliness. Except much more expensive.  And a bit stingy with the toppings.. I thought the crust/bottom skin was on the little bit too hard for my tastes but depends on your preference. \n\nOverall can't say the food was bad. It was decent, but if I had to pay with my own money to go here, then I wouldn't come here. If someone else (like my manager! Haha) was treating,  then I wouldn't mind coming here.", "author": "Asdy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Short and sweet. In NY for vacation from SoCal. I wanted the best pizza New York offered and I think I found it. Awesome place.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "The best pizza in Brooklyn, hands down. It doesn't get more authentic then Juliana's. I recommend ordering pick up, and taking your delicious pie into Brooklyn Bridge Park on a gorgeous sunny day overlooking downtown and The Brooklyn Bridge. My personal favorite on the take out menu: No. 5!  Enjoy!", "author": "Joshua C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Located adjacent to Grimaldi's on Front Street, Juliana's provides authentic NYC coal fired pizza.  A little history never hurt right? \n\nThe owner of Juliana's is Patsy Grimaldi (nephew of the founder of Pasty's in Harlem)...hm so you would think well doesn't he own grimaldi's...well he doesn't. Patsy actually founded Grimaldi's, but in 1998 he sold the Grimaldi's to Frank Ciolli.  The original location of Grimaldi's is where Juliana's currently whips up their famous pizzas.  A court feuding and what not, it was allowed for the two businesses to operate an hop, skip, and a jump away.  \n\nBack to the pizza: \n\nA simple margherita goes a long way in my book.  If you are looking to really taste the pizza this is the way to go.  You can only know a restaurant is the best if they can master the basics.  Juliana's masters the basics.  The sauce is a wonderful san marzano tomato, which provides a bit of a sweet taste.  The coal fired crust give you that unforgettable NYC pizza taste.  \n\nFor a hungry group of 4 I would recommend getting either 2 large pies or a 1 large/1 small.  You can always take the leftovers, but I doubt there will be any.  \n\nThe line can be long and so can the wait, but it's typically shorter than Grimaldi's.  You will not regret your decision to come here.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "This is the real Grimaldi... Don't be deceived by the longer line next door. That's a tourist trap. Seriously, Come to Juliana's for an incredibly delicious pizza and great customer service. They are very fast yet their quality is the best.\n\nI tried the margherita and the white w/ added ricotta. Margherita is for the sauce lover, such as myself, and the white is for the cheese lover, such as my wife. Both sooo good.\n\nDon't miss this spot when in New York City!", "author": "Omar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "WOW!!!!\nNever have I ever had better pizza!\nIt was a fabulous experience. We were 5 people, we waited about 20 min.We had the classic margherita pie, the classic white and then we had the prosciutto arugula pie.  The restaurant is so cozy. The service was excellent, they have a beer selection on draft and he desserts were also great! Could not be happier.", "author": "Sabrina M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "Literally just walked up to the door at 2:45 pm and the girl at the entrance flipped the \"closed\" sign when she saw me walking up.  Then she told me it was closed???   I literally just called them and they said they're open until 11 pm... No explanation given. \n\nHad to get information from a customer that they close from 3:15 until 4pm to clean oven.  No wonder Grimaldis is more popular.", "author": "Monica I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Everything was absolutely awesome. \nJust the bread was burnt on some parts.", "author": "Kian K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "Let's be honest, Juliana's is the best of the best. Order the classic margherita - honestly you don't really need toppings. Although I do love to add pepperoni. Also, if you're feeling adventurous, experimenting with toppings is not a bad idea for the pizza will always come out impeccable. \nEven on a Saturday at 6pm, I've never had to wait that long here, which is also awesome given how popular they are. They always do an excellent job of moving people in and out efficiently.\nAlso, be sure to order one of the local brand sodas (I'm blanking on the brand name) with your pizza. There's just nothing like a cool crisp soda with the perfect pizza! :)\nOne pizza with be filling for two very hungry people, or three moderately hungry people to give you a reference point.", "author": "Shane H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Delicious pizza and tasty desserts! We had a Margherita with sausage and pepperoni.  Kids had the Brooklyn Bridge dessert (cookies and ice cream) and we have a cannoli.", "author": "Alicia V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "The lines are long, but the hostess tries to move the line as fast as possible. We ordered take out as we didn't have much time to eat. I ordered a small cheese pizza, and it was delicious! Next time I would order a large as the crust is pretty thin, and my son was still hungry. The cheese was good, there were real tomatoes on the pizza, and the crust even got gobbled up!", "author": "P L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}