{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "The pizza was decent and the service was good. The reason for the stars - waited for about an hour and a half based on reviews thinking this would be the best pizza in town. That was not the case. Had the arugula and prosciutto which again was good but not worth the wait. The lentil soup is worth trying as well.", "author": "Rodney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "This place is worth the wait in line. My friend and I went here for lunch and they only had countertop seats available and we were pleasantly surprised with quite the show. The countertop seats faces the oven and you get to see the magic right before your eyes. The pizza was perfection! We went with a pepperoni pie, the crust was perfectly baked and the red sauce was just the right amount. For dessert we had their cheesecake, which was extra creamy and the sauce to pour over it was absolutely delicious.", "author": "Yare S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Pretty great pizza, but not something you want to have every 3 days or so the way one does with a New York slice. With that said, the pizza was top notch. Personally, I think it tastes the same as Grimaldi's which makes sense since the creator of Grimaldi's is the same as Juliana's. You can argue Juliana's more authentic since it's run by the original creators while Grimaldi have sorta gone corporate and branched out. But honestly, I think they both taste the same. Both very good pizzas.", "author": "Omar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "Holy. Shit. Finally had legit pizza in New York. If you haven't had legit pizza that tastes like it came out of an oven with a portal to Italy, this is a good option. We're spoiled in Atlanta with Antico, but if you don't have the option. Juliana's is where to go.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "After a busy morning running around playing tourist in lower Manhattan, our next stop was going to DUMBO. I knew I wanted to eat pizza down here, so I opted for Juliana's instead of Grimaldi's\n\nCame by around 2pm, and the there was still a line out the door. Ugh.\n\nFinally sitting down, we ordered the classic margarita, and shared a salad. Pizza was fresh, and loved the crust. \n\nThe cannoli though was extremely tasty!\n\nNice to try pizza finally on my NYC trip, glad juliana's didn't disappoint", "author": "Nika K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Last Friday, there was something very strange going on in the world. I have two pieces of evidence:\n\n1. It was 75 degrees and sunny in NYC. In February.\n2. There was no line at noon at Juliana's.\n\nOne of these things can be ascribed to climate change, and the inexorable decline toward an uninhabitable planet and/or disaster, starvation, and war over the next few decades.\n\nBut the only explanation for the other is that I'm the luckiest man on Earth. To be able to eat this justifiably renowned pizza without having to wait on line is a blessing, and one I think I've earned through years of...well, maybe I didn't earn it. But I appreciate it.\n\nIf you ever happen to be as lucky as I am (or if you just wait on the otherwise ever-present line like the rest of the plebes), I recommend starting with a Caesar salad so you can feel healthy, and progressing to the pie of champions: pepperoni and mushroom. \n\nMy wife has this strange and terrible disease that forces her to stop eating when she feels full, so she had to quit after only three slices instead of holding up her end of the bargain and eating half the pie. Rather than endure the horror of walking home while having to carry a pizza box, I made the sacrifice and was forced to devour the other five slices myself.\n\nStill the luckiest man in the world.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "My first trip to Brooklyn and I was looking forward to trying Julianas. I have been to Grimaldi in LA and Vegas and was looking forward to the original version. \n\nI got there around 5pm on a Thursday and there was no wait. The staff was really friendly and outgoing. \n\nThe pizza was ok but something was missing. It was fine but still a disappointment from what I was hoping it would be. \n\nIt was cold so I also had split pea soup which was really good and tasted very refined for a pizza place. Layers of flavor and a comforting texture, the soup made up for the pizza. The soup took it from 3 stars to 4. \n\nOverall if I was close by I would consider going again, but I wouldn't go out of my way for it.", "author": "Julie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "Wasn't expecting a nice sit down pizza restaurant until we walked in. Super weird that the other popular pizza restaurant (who shall not be named) is right next door! \n\nCOME EARLY. Our party of 4 came for lunch on a Friday afternoon around 11:45am. When we finished our meal around 12:30pm, there was at least a 30 minute wait out in the cold, brr.\n\nArugula, Tomato, Cucumber, Red Onion, Dressing Salad ($10): Additional $2 if you want goat cheese and walnuts to top. Really standard arugula salad - just felt like we needed some greens =) \n\nNo 1 Special is all you need to know! Both the medium and large are cut into 8 slices but the large is about 2 inches bigger. This particular pizza is served without the typical tomato sauce but instead has truffle olive oil base topped with mozzarella/scamorza cheese, pancetta and scallions. Yes yes yes and more yes.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Given there is no shortage of quality pizzerias in NYC it may seem absurd to wait in line for one - but honestly, Juliana's is well worth it. \n\nWe went around 4pm on a Saturday and the line was beyond the cordons they have set up. In the end we waited about 45 mins, which is not that bad (when you compare to say waiting 2hrs for a milkshake at Black Tap or the Dumbo ride at Disney...). It's well organised and they check the party sizes in the line so that they can arrange the tables accordingly. \n\nOnce seated it's relatively cosy but not to the point where other tables are interfering with your enjoyment. The walls (or at least the one I was looking at) are covered in pictures of Sinatra. \n\nYou have a choice of classic pizzas that you can add extra toppings or their specialties, to which you can make no changes. We went for a Margherita with pepperoni (wife's pick) plus the No. 1 special (a white pizza with mozzarella, scamorza affumicata and pancetta). Both were great but the special was the stand out dish - so good - best pizza I've had. Didn't have specs for one of their \"sweets\" as we had two larges and I was stuffed - but I had the Brookie bridge (ice cream sandwich with brownies) a couple of years ago and if i remember correctly it was great. \n\nGotta shout out to our waiter Trimell - not just for being a great waiter, but also while we were waiting in line he ran after a customer that had left their card behind", "author": "James G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-24", "description": "HYPE HYPE HYPE\nVisited Juliana's in July 2018\nI lost a bet and as payment I had to buy a pie of the best pizza around. \n\nThis place is hyped beyond comprehension.\nThe wait is about 30 mins\nStaff is nice and friendly and it's beautiful inside.\n\nThe  : \nCrust :thin yet structured \nCheese: it was almost tasteless\n sauce : it was watered down and tastes like they used ripe tomatoes. \n\nI might have technically not paid the bet off as this was definitely not the best pizza around.", "author": "Jose C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "Great place! Going to NY for business and this place is in must list! Pizza crust is so amazing, environment just welcomes you and ughhh, its just something special about this place. Definitely place number one for pizza!", "author": "Ledempire.net D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Omg how can this pizza be so delicious.... This restaurant has been my must-visit place everyone I came to nyc. And I don't mind staying in line for an hour because it's so worth it. I've read articles about they shipped tomato sauce from Italy and it surely added the flavor to it. The price is a bit expensive I have to say for pizza but I'm happy to pay for the quality and the taste. So good!!!", "author": "Johnny Yueh Han L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-28", "description": "I wanted to like this place so much as I appreciate a good margarita and have hit all the top places in BKLYN. However, after waiting 40 mins on the line surrounded by tourists it's just simply not the best pizza as some people claim.  The crust is really good.. not too thin, not too thick and not soggy.  The mozzarella was high quality and delicious.  So what's not to like right?  The pie had oregano in it.  To me that is like a marinara and tasted too much like spaghetti sauce.  It also didn't have a lot of fresh basil.  Lastly, I have never had to put salt on my marg but here I was adding it on each slice.  Pretty disappointed.  I wonder what all of the tourists think?", "author": "Ang M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Great margarita pizza and great soft beverages. We waited in line for about 30 mins and get seated kn a Saturday afternoon. The inside is clean and the waiter is attentive. The price is really good and you get a really large size. Will come back again!", "author": "Sophie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-04", "description": "Not worth the wait in the freezing cold. Pizza was good, but not life altering. Service was good, but the wait for the pizza once we ordered seemed forever.", "author": "Trevor B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "The super long line was understandable considering that it was a 7:30 on a Saturday night so I would advise getting there early\n\nFor the appetizer was a meatball and Cesar salad. The meatballs were very good and the Cesar was mediocre.\n\nWe also had another half mushrooms, olives, garlic  (didn't taste or see the garlic though) pizza and sausage, pepperoni and sweet onions.\n\nWe were still hungry so we ordered a second pizza. Under the waiters recommendation, (and slightly altered by us) we choose a large sausage, onion and meatball pizza. The onions and meatballs were perfect as the crust was killer. \n\nAnother bonus was the fresh mozzarella. It was different that most restaurants but it made a big difference in the freshness.\n\n\n\n.", "author": "Susan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "Good pizza, wine and ice cream.  We had the margarita pizza. The white pizza w arugula and the Brooklyn Bridge dessert.", "author": "Mariaté G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "3.5 stars but I rounded up.\n\nWAIT: Came on a Sunday night at 7pm and the wait for our group of 7 was about 35-40 minutes.  We were quoted an hour but got in much quicker! The line moves pretty quickly, which is good.  In case you are wondering, yes, you do have to wait in line.  Someone from their staff will come by and ask how many in your group.\n\nATMOSPHERE: The inside seems small but they can fit a good amount of tables.  They have big round ones, smaller ones or 2 people etc.  It's a clean, open kitchen/oven restaurant with lots of white.  It feels modern.\n\nFOOD: The food comes out pretty quick.  We ordered our pizzas and I would say within 10 minutes they were out.  It probably helps to keep the people eating quickly and then leaving.\n\nFor the 7 of us, we opted for 3 large pies because the difference in price was pretty small.  This allowed each of us to eat 3 slices and then a few got to eat 4.  The slices are pretty thin and small so even for someone that normally eats 2 slices, 3 was enough.\n\nNO. 1 - some people in our group thought this was too salty but I liked it.  The Italian bacon was crispy and tasted a little like saltier sausage.  This is a white pie, which I liked as well.  No tomato, the truffle flavor was very very subtle.  I liked the green onions on top.\n\nNO. 4 - this is a mix between a white and a tomato sauce pie because it did have some red sauce. it's a typical prosciutto + arugula pizza with tons of arugula sprinkled on top post bake.  It was pretty good, especially if you like prosciutto. \n\nMARGHERITA - classic pizza, and one of the ones people liked the most.  The marinara sauce was tangy, which I don't actually really like.  It was probably my least favorite (but I prefer white pies). \n\nThe crust, which is what I really measure my pizzas by was pretty thin.  It held its own when you held it up, so it didn't droop down and the toppings didn't all fall off with one bite.  The crust gets better as you go towards the end, it becomes more firm and more chewy (which is what I like).  I really like those pizzas with the huge crust at the end, very soft, fluffy and chewy, with bubbles.  I think it's more of a Neapolitan pizza? Regardless, it was definitely a decent/good pizza, but not the best I've had nor my preference.  I think for what you are paying (most were 25-30 for a large pie), it seems a little pricey for getting something that I could probably get elsewhere for a little cheaper.\n\nOverall, a good one to take friends to and if you're in DUMBO and they've already tried Grimladi's.", "author": "Brittany T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "I am from Los Angeles, and I will admit that a part of me did not want to like this 'New York' pizza as much as I did. However. This pizza really was exceptional. The crust had the magic of being thin and NOT SOGGY, and it had a great flavor as well. The sauce was also very flavorful. Service was very friendly as well. \n\nOh, I had tried Grimaldi's years ago, and it was not impressed at all. If I were trying to decide between the two, choose Juliana's.", "author": "Carolyn D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Came here for dinner after exploring a bit in DUMBO. Question of the century: Grimaldi's or Juliana's? When we arrived at 6, there was a small line for Juliana's and none for Grimaldi's. I naturally gravitate toward crowds and popular things and after hearing that Juliana's pizzas are better...Juliana's it is! We waited in line for about 5 mins before we were seated. It's a pretty small restaurant but the tables are a good distance away from each other so that you won't be banging elbows with your neighbors or having to worry about strangers eavesdropping on your conversations. Restroom is located down a flight of stairs in the kitchen and it was clean. We got our pizza about 15 mins after we ordered. Service was very good!! Everyone was very nice and my glass was always refilled on a frequent basis.\n\nWe got the Margherita pizza with pepperoni and I found it to be pretty good. The crust was excellent. Toppings weren't bad either. I can't say it's the best pizza I've ever had but for the amount we paid, I think it was worth it. What I didn't like was that even when it arrived at our table, the pizza was only lukewarm. The first few slices tasted good but by the time we got to the last few slices, they sort of got too cold and didn't taste as good.\n\n$21 for a large Margherita (+$3 for pepperoni) and we were both full after sharing it. It's a popular and hyped up place but I would say the pizza is only slightly above average. But honestly can you bear to visit DUMBO without trying at least one of its two popular pizza places? Definitely worth a pit stop, especially if you rarely go to this area.", "author": "Kevin E."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}