{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Coal fired pizza!  No. 1 special is a must!  This is the best pizza we have ever eaten!  The arugula salad with goat cheese and walnuts is awesome too.  We went early about 5 pm on Friday, no line, sat outside.", "author": "Carolyn P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "I finished a large Margherita Pizza here all by myself. The waiter even asked me, \"You finished all that?!?\" Yep, it was that good!\n\nNo complaints regarding the food or the service, but it gets very crowded. I kind of got the vibe that I had to quickly eat and get out for new customers, so I'd recommend coming early if you prefer a sit down experience where you can savor your pizza.", "author": "Allan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Great pizza top 20 material definitely. I'm a fan of a more crunchy crust so the crust was a little soggy but the fresh Ingredients really made up for it. Dessert was pretty good too we had a cannoli it was creamy and very sweet!I would definitely come back with my girlfriend.", "author": "Mauricio V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Dare I say it?!  I enjoyed this place more than my beloved Grimaldi's.  Enjoyed the restaurant experience and the pizza was delicious!", "author": "Joy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "It's a stretch for the four stars if you figure in the price and the... tourist trappiness or is trappihood?\n\nThe good:  pizza tastes pretty good, and the kid had her first egg cream there and it's a pretty good egg cream.\n\nHaving said that, completely not user friendly.  Giant pizza labeled as a small.  Large (giant+) pizza for $26+.  Apparently you can have a half and a half (see others' reviews below), no one told us.  Seating is cramped.  You are decidedly not encouraged to do anything other than eat and leave.  Not a place for lingering over a small coffee.\n\nBasically, another internet famous place existing to quarantine the tourists so that they can't self-harm by walking the streets.\n\nThe calzone tastes like ricotta and green salad.  Pretty good ricotta, pretty good green salad, wasn't a hit.  The marinara is fine, but then there is the $18 price for it.\n\nThe wait... awful, awful wait for food that... let's say I just couldn't figure it out, would be fun if these reviews had an \"I live in NYC\" check box, I think that we were the only ones there, and that was because we had to.", "author": "telco h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "I am happy to report that while DUMBO has not lived up to its promise of being another Soho, Juliana's and Grimaldi's on Front Street are still a big draw for tourists and city residents alike.\n\nJuliana's is next door to Grimaldi's.  What it lacks in size it makes up with its cozy feel, efficient service and, to boot, great pizza!  The Margherita pizza is a classic.  I think the tomato sauce is unmatched.  The bread doesn't seem to hold on to the heat very well, progressively getting harder to cut through as the meal progresses.  Juliana's also carries soups and salads, but unless you are a pie-hater or they (or you) run out of dough, you should get their pizza.  Note that the small is more than one person can comfortably finish, but the large is barely sufficient for two.  \n\nPatsy Grimaldi shows up from time to time.  But you will be struck more by the diversity of the diners here.  The pizza is certainly worth a 30 minute wait, in the same way that Di Fara is worth an hour's wait!", "author": "Srini V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "The best pizza in New York.  I travel from Manhattan to enjoy the pizza here. My favorite and li've tried many. Actually hesitant to write this review because I'd like to keep it a secret.", "author": "Jerry D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Yea guys \nIt's is the best pizza in bk\nThat's for sure \nWe will back for more \nThanks!", "author": "Dror M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "This is the classic New York style pizza that I grew up loving. This was a treat back in the day and is just as delicious today. The location is the original Grimaldi's with the original oven and headed by none other than Patsy Grimaldi himself. \n\nWhat I love about Juliana's is the superior sauce on the pies. It is well balanced with the sweetest tomatoes with a hint of acidity, perfect consistency, and has the right amount of herbs; just as I remembered years ago. We always have to get a Margherita in the mix every time we come here ($19 large). The crust is perfectly cooked with a nice pull on the dough but lightly crisped on the edges. \n\nWe also decided to try some of the specialty pizzas. The No.1 ($30 large) is a quite decadent white pie with pancetta and truffle oil. The toppings just work very well together. The No. 2 ($29 large) is also a white pie where the fresh bufala mozzarella reigns true along with the fragrant garlic and small cherry tomatoes.\n\nMr. Patsy Grimaldi is also always around checking on the tables and asking how the food was. He's very welcoming and you can see how much he cares about his pizza. Tourists may head right over to his namesake on the corner but us real New Yorkers know to come to Juliana's for the real deal.", "author": "Denise W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "My fiance and I happened to be in Brooklyn for the Film Biz Recycling, and wanted to treat ourselves to some good old pizza, and we happened to find Juliana's on google as one of the top places in Brooklyn. We were a bit skeptical about the long wait, but went for it either way.\n\nOnce we got there ( no line whats so ever), who happens to open the door for us? None other than Mr. Patsy himself, we felt pretty cool at that very moment, he even seated us himself. Any restaurant where the owner is working all areas of the business seems pretty good to me. \n\nWe order the specialty pizza #1 , and it was to die for. Perfectly crisp, cheesy, and had an awesome fresh crispy flavor thanks to the scallions. It was over all one of the best pizza experiences I've ever had! My only one neg comment was my waiter. My fiance and i don;t drink so we did not order any wine, and we shared a large pie, this seemed to tick him off since our bill was not large. When I asked him for a glass of ice, he looked at me dum founded, \"like really your only spending 30 on a large pie and have the audacity to ask for ice!\"  \n\nNone the less we had a good experience and will def return!", "author": "Jersey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "My girlfriends and I were in NYC for a little vacay and getting some good old NY pizza was on the top of our list. Juliana's was the perfect place to check that off our list! Their pizza is phenomenal. I think most people know that this place is owned by the same man who opened up Grimaldi's next door, but I'm just saying it again anyway.\n\nHe was at the restaurant the night we came in--such a sweet guy! He was talking to diners and really helping run the busy dinner rush. They don't take reservations so show up a little before the dinner time to avoid a long wait. They were incredibly quick with getting us seated and having our orders in even on a busy Friday night. Service was great and no complaints there.\n\nOn to the foood! We tried the Margherita pizza and the salmon pizza (No.5 off their specials). The Margherita pizza was awesome, definitely did not disappoint. The sauce is amazing and just the right amount of cheese on a flavorful thin crust. If you can't decide what to get, do yourself a favor and get this one.\n\nWe also tried he salmon pizza which was ...interesting. It's topped with smoked salmon, goat cheese, capers aka a lox bagel in pizza form. I didn't hate it but I didn't love it either. Maybe it needed a sauce to bring it all together and actually feel like pizza. \n\nDefinitely check out this place if you're in Brooklyn!", "author": "Renu A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "The wait is ridiculous.  We ended up getting our pizza to go and eating it at the park with a beautiful view of Manhattan.  The pizza was fantastic!  Loved it!! But I'd definitely would not wait in that ridiculous line for it.", "author": "Vanna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-10", "description": "Pizza was good and fast. Not the best pizza we've had and maybe my expectations were high due to all the hype. Service was marginal. Had to ask for refills for the kids and didn't bring some requested items. We were expecting more toppings as well...very skimpy.", "author": "Derek N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "Never again going to Juliana's pizza!\nAfter waiting 30mins and one of the guys was asking us how many our party was and we said \"2\". Then another employee was at the door waving for a 2 seater, 2 pol BEHIND us rushed fwd like there was free money. We told the employee we were talking to, along with other 2 seat customers waiting. He assured us he would make them wait. Then as I walk in to check that their not taking seats, the employee try to explain that \"they are regulars\". Which is total BS! The guy was just waving down for 2 seats, he had no clue who they are.\n\nYou know i must be really mistreated to make a full post and report. I will no longer ever visit this establishment again!!!", "author": "Manny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-03", "description": "3.5 stars...\n\nJuliana's is pizza royalty. Check below to see why. \n\nThe space here is beautiful, really well laid out and designed. The service is impeccable, really quite impressive. This is fancy pizza, no slices and garlic knots here. They do have a menu beyond pizza but pizza dominates. Small pizzas are $16-24 while larges are $19-27. It's definitely one of the more expensive pizzas you'll find in the city. I personally didn't find it to be worth the price.\n\nI split a classic margherita. The very middle of the pizza was dry as a bone (no sauce, cheese, or oil). On the plus side the tomato sauce was fresh and vibrant and the mozerella was smooth and stretchy. It was evident that they use ultra fresh ingredients. They were a tad stingy on the basil and put it on a little too early but it wasn't too bad. Crust was crispy and not too thin or thick, it was a tad dry though. I was eyeballing other couples' pizzas and I think going with something with more toppings is the way to go here. It's surpising that I remember having a better pizza at the fake Grimaldi's then the real one. Let me explain:\n\nAround 1941 Patsy Grimaldi (nephew of Pasquale \"Patsy\" Lancieri, owner of Patsy's and apprentice to Gennaro Lombardi, originator of pizza in the US in 1905) trained under his uncle and learned Lombardi's secrets and later in 1990 opened Grimaldi's under the Brooklyn Bridge in Brooklyn. In 1998 he sold that business to Frank Ciolli. In 2012, Frank Ciolli was forced to move the ultra popular Grimaldi's next door due to rent disputes. Patsy Grimaldi came out of retirement and snatched up his old storefront to open Juliana's, a pizza place named after his late mother.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Loved the pizza \nLoved my Brookie bridge\nThe waiter too\nI watched them make the pizza and I saw the freshest ingredients \nLoved the decor\nWish we could eat here again", "author": "Christina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "If you're reading this you probably already know about the feud. I'm not a big fan when it comes to waiting in line for a restaurant, but my wife and I were staying in Dumbo for a couple of days and every time we passed by there was a line. Finally we just decided to bite the bullet and after a 30 minute wait we were seated and treated to  some of the best pizza we've ever had.  If you don't want to wait, you can call in your order and there are plenty of spots to sit and take in the skyline view of lower Manhattan while you enjoy an amazing pie. You will eat too much. Trust me.  The staff is really friendly and even though it's extremely busy, there is no delay once you're seated.  If your anywhere near Juliana's, you should go.  They kill it!!  5 stars.", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Real deal thin NYC pizza. Everyone knows the history of this place. If you don't. Just stand in line and wait for your table and you'll overhear all the parties around you talk about how its the \"original\". \n\nRegardless of that, the pizza was really good. Crispy, cheesy, delicious.", "author": "Al L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "We found this place by searching on Yelp and we could not have been happier that we did.  The food was great and so was the service!", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "The meatball appetizer was great, old school flavor reminding me of my grandmother's meatballs. The margarita pie was light with a nice well done crust. The specialty pie with Arugula and prosciutto was very good. The service was attentive. My only complaint was pricing. The prosciutto pie was $31. \nI have sampled pizza from many places around the city and think that price is excessive.", "author": "Michelle L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}