{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Went here Labor Day weekend on a nice day. \nThe lines were long, didn't even ask how long. Just ask for take out to eat at park. Waited 35 mins for food. While waiting went o market nearby for water n beers. Picked up food n by the time we arrived at park the #3 pizza was just warm. \nThe pizza over all was good, nothing exceptional. Average good food but not worth waiting long lines for. Just a tourist trap. \nAlso ordered the meatballs which were nice n warm in the sauce which was quite good. The meatballs were flavorful and the sauce was very good. If not for the long wait I would go for the meatballs more often but not worth competing against tourists. \nGrimaldi's had a longer line that day. \nOverall would I ever go back? Only if the wait was less than 10 mins. or no lines. \nAs for the service, the guy in front was helpful directing us where to order for take out. Also made sure we had all the needed utensils for take out. \n\nFood was good but not worth the looooong wait!!", "author": "Thomas A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "So glad I listened to my fellow yelpers! Sunday night and the only line out the door was at Juliana's - for good reason. Waited 10 short minutes and seated at the \"bar\" - the best seats in the house with a view of the pizza oven and the intricate choreography of the kitchen staff stocking those dough rounds; throwing, stretching, and topping the pizzas; and feeding them to the oven - cherry red outside and in. Started with a nice Matts Mix salad, lightly dressed greens, sweet yellow bell peppers and Kalamata olives with a bright vinaigrette to set the stage. The star of the meal though was the Margarita pizza. What a slice of heaven. Thin, soft crust with a little crunch on the edge. Fresh mozzarella melted and lightly browned with fresh basil and crushed tomato sauce to top it off. Paired with a glass of Montalcino for perfection all round.", "author": "Karl B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "We had heard so much about this place from several people and also during a tour we took. Have to say that we were not disappointed. The pizza was amazing and service was awesome as well. Brick oven pizza was delicious.", "author": "Niraj N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Did a quick visit to NYC and a colleague suggested that we jump off the island and run into Brooklyn to grab some pizza before we flew out that night. Went to Juliana's short wait for a Friday early evening, we sat ordered a couple local beers (War Flag Pilsner) and a large half white half margarita. Beer and a half later the pizza arrived...I have had a lot of pizza in my day, all shapes, sizes, styles and any/all toppings you can imagine, and this pizza was so simple and so good it really defied comparison to anything else I have ever eaten, not to say that this pizza was so much better than any of my top 5, but everything was perfect, dough/curst had a slight smokey flavor, but not over powering, the proportions were spot on, you know there is garlic, but wasn't offensive. The sauce the cheese were quality, basil was fresh and the presentation was asymatrically stunning. It screamed for you to take a picture of it, \"hello before you devour me, please take a picture when I am all dressed up and presentable.\" All in all great experience, in and out in less than hour. Left wanting more, pleasantly full but not bloated and bordering on a food coma.  Great service and the owner was an upbeat individual with a very pleasant demeanor. Next time in NYC I am definitely coming back to try some of their speciality pizzas.", "author": "Rich K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "Truly enjoyed our experience here after a walk across Brooklyn Bridge. Short wait during lunch hour bc they turn out the pizzas so fast. Wait staff was very friendly, fun and efficient. Great ambiance. Tried the margarita pizza, which was excellent. Fresh ingredients, perfectly cooked.", "author": "Blayne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-11", "description": "Could it be? Better than Grimaldi's? They accept credit card AND there's no line. YES, it's true.\n\nOn my first visit, I walked right in and was seated immediately. I ordered the white pizza with prociutto and fell in love. The service is incredibly friendly and they've done a great job of updating the interior.\n\nIt felt like I was cheating on Grimaldi's. \n\nFor my second visit, I brought my Sister, her husband and two sons. We were a party of 6 and my husband + brother-in-law arrived first -- and they were seated right away. It was a VERY rainy evening and we were soaked, and the three of us were relieved to get out of the nasty weather and settle in for great pizza.\n\nOrdered a regular pizza with half meatball and half pepperoni. All fantastic. Then I had to get a white pie with prociutto, just coz. Our server was so nice, and the owner stopped by a few times to chat with us. \n\nDon't skip the cannoli, it's fan-tas-tico.\n\nThe following morning, I realized I left my brand new umbrella at the restaurant. PANIC. I called and left a voicemail, then stopped by around lunch time. They had saved it for me, thank goodness. \n\nPart of me wanted to tell the folks in the long line to G's to consider trying Juliana's!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "This place is always buzzing. We got the simple Margarita pizza and went outside to eat it. I really enjoyed the crispy slices of pizza and the flavor of the pizza overall.", "author": "Krystal N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "Tonight, I had my first taste of this place.\nI was pleased with the service that they brought to the table, \nfrom my entrance of the doors, to\nthe very last moment of my leave. \nThe experience was a thrill.\nThe pizza was gorgeous,  my boyfriend and I had the small margherita, with added pepperoni and the calamaris for the appetizer. \nThe calamaris is a must have, and\nI love how their pizza was seasoned with the garlic, \nthe crust was thin, and soft. \nDefinitely worth going back to.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "Hands down the best pizza in Brooklyn has to offer. I've enjoyed both the dine-in and takeout experiences with Juliana's pizza. The pizza is great in texture, size and taste. Great annual treat!", "author": "Kadeem C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "What did they put in that sauce?!  My sister and I had ordered a pizza with no cheese, arugula, and artichoke -- we went vegan that night. \n\nWe came here on a Sunday, where the line looked rather discouraging.  I had asked the lady at the front desk how long the wait is: 30 minutes to dine in, 2 hours to get a pizza to go.  \n\nOf course, we decided to wait the 30 minutes.  \n\nWhat I love about my meal is that it tasted fresh and homemade.  There was just a perfect balance with what my sister and I had ordered.  Also, note that the pizza is quite large -- my sister and I couldn't finish a \"small\" pizza.  \n\nOn top of that, the service was great so I have no complaints there. \n\nI'd definitely make a trip out there if I was ever in town again!", "author": "Loriana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-12", "description": "We came here after a romantic stroll on the Bridge. We walked right into the establishment, no wait compared to grimaldis next door. We knew the scoop that the legendary oven and recipe were at this place! \n\nOur waiter actually never came to our table, so we had to hail someone down. Once the waiter knew he was at our table, service was prompt. There were 6 of us, and we ordered 3 large pies: Margherita Pizza , #2 (cherry tomato, bufala mozzarella, garlic and sea salt ) and #4 (tomato, mozzarella, arugula and prosciutto). Margherita and #2 were crowd favorites. There were no slices left over. We were stuffed, but we had done a lot of touring earlier that day so our appetites were heightened.\n\nWhen we got the bill, we split it via 3 cards. Luckily we noticed that we were SEVERELY overcharged: about $40 per card...which made $120 bill total. Our real bill was around $80. Not cool not cool. \n\nSans the service in beginning and bill mishap, I would give 4 stars. They have to work out the kinks:)", "author": "Stephy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "I went to NYC recently, and I had a pizza fix that needed to be fulfilled. My friend suggested that we go to Juliana's and boy was she right! This place is owned by the original owners of Grimaldi's and is awesome!!! We ordered the small margarita pizza and shared, which yielded left overs as well! The crust was nice and thin crispy on the crust and just a tad soft at the center, the sauce was great, and they didn't spread the cheese all over the pizza, they used fresh balls of mozzarella cheese so there were nice pockets of cheese! Their red pepper flakes were fresh, and actually spicy! \n\nThis place is pretty cheap for pizza and it has great ambiance! It actually feels like walking into a restaurant along the venice canals very rustic and rowdy! Cheers! Come here instead of Grimaldi's, it a tourist attraction, but this place is the real deal.", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "I stumbled upon Juliana's after visiting the Brooklyn and I must say I was impressed. After eating pizza, I always feel stuffed and greasy due to all the oil, but Juliana's thin crust pizza was perfect. I ordered a small half white pizza and half margherita which was perfect for two people. The white pizza is mozzarella with garlic and the margherita is mozzarella with tomato sauce and basil. I recommend adding sausage to give it a nice little kick. Next time i'm in Brooklyn, i'll be sure to visit Juliana's again.", "author": "Kevin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Excellent pizza! We got the white and the margarita. The white was one of the best pies I've ever had. The fresh garlic was superb! We arrived around noon on a Sunday and waited about a half hour for a party of 2. It was worth the wait for sure.", "author": "Gabby C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Positive:  great tasting pizza with high quality ingredients, thicker than grimaldi's by the original owner.  Get the regular pie, one small will fill two people.  Get a large pie if really hungry!\n\nNegative:  long lines", "author": "HalalBite F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "The original owner of Grimaldi's owns this restaurant. The new owner of grimaldi's makes second tier pizza down the block. For the best pizza in america, and likely the planet, stop by.", "author": "Aris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "This is the BEST pizza experience I'VE EVER HAD! \n\nNew York is good at so many things food. So many styles, so many techniques, so many trends, blah, blah, blah. You can't spit 2 feet these days without hitting a joint doing fried chicken. The more things change, thank you baby Jesus that somethings remain the same. \n\nWhat makes Juliana's the best? 1, from the moment you come in, to the moment you leave, it's the perfect harmony from the area, to the space, to the staff and to the pie. Not a note is missed in this perfect concert of experience to food. 2, The history of... 3, the pizza is just on another level. If everything else went to shit, the pie will always carry through and is the only thing that truly matters. \n\nDid you ever see Michael Jordan play in his peak? During that era, there were several great players. All fun to watch and all great in their own right. But, then there was Jordan. He was on another level and it was magical to watch. Anybody can have one great night, but he CONSISTENTLY brought out the best in himself and his teammates, every... single...game. Juliana's is the MJ of pizzerias.\n\nGreatness starts with the foundation and I've yet to find pizza from NY or anywhere else in America, that can beat their Margherita. It's simple. It's elegant. It is a work of art. \n\nI've been here six times and it's all about the Margherita. Only once, my third visit, did I get toppings. They have above average pepperoni and sausage, but my fav combo are anchovy and arugula, or so I thought. The Margherita is too perfect and I have come back to it every, single, time. \n\nIt's so good, one time my friend and I killed a large and ordered ANOTHER! Yes, we ate two in ONE SITTING! Yes, I'm fat and I don't care that you know that! It's the proudest moment of my food eating life. I wish my mom could have been there to see it. \n\nI could sit here and continue to type away about why the pizza is perfect. The crust. The sauce. The cheese. The basil. Blah, blah, blah. If you didn't understand the previous paragraph, you don't deserve to be here. You aren't worthy of eating PERFECTION.", "author": "Your Moms B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "$30ish for a pizza? WORTH IT. We decided to go for Juliana's over Grimaldi's per recommendation of other yelpers (a chef from Grimaldi's opened Juliana's right next door). \n\nI don't remember all the ingredients of the pizza we ordered but it was #1 of the specialties and it had bacon. I'd honestly say getting a specialty pizza is worth it, especially if it's your first time. Don't get a classic.. You can get a margherita pizza anywhere. We asked the waitress what she liked and we just went for it. \n\nIf you're a smaller party try to get seats at the counter!! It's like VIP seating - you get to watch the chefs make the pizzas :) \n\nGreat venue by the waterfront \u0026 city bike station. Excellent service. Best pizza I've ever had.", "author": "Rona M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Simply some of the best pizza I've ever had. Sad that I never got to see grimaldi's before all this fued b.s. but the pizza is still top notch.\n\nAlso had a really great local Brooklyn beer called war flag. A honey-pilsner if I remember correctly.\n\nService and ambiance were fine but the pizza is the reason I'm giving Juliana's 5 stars.", "author": "Dylan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Juliannas is right next to the famous girmaldis pizza on the HIGH STREET Brooklyn bridge/ DUMBO side of the Brooklyn bridge. I have never been to grimaldis, but I do know that Julianna's is ran by its original owners. Juliana's is very nice on the inside and  takes credit cards, which grimaldis doesn't. I came with a small group and they sat us immediately. We ordered a large margarita pizza and a small white pizza. The margarita pizza was perfect, although by preference I would have liked if there was more fresh mozzarella. The bill came out to about $10 a person, which is not bad. The service was quick too! Overall, I would definitely come back to Julianna's.", "author": "Carina P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}