{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "When Julianna's Pizza first opened, we could practically walk right in and get a table...meanwhile hour-long lines were in store for you next door at Grimaldi's. And on the surface, rightfully so.....after all, the Grimaldi name is virtually etched into the NYC Pizza history books.  \n\nBut I guess the word is finally out. Julianna's Pizza is the newest pizza place owned by NYC pizza godfather and living legend, Patsy Grimaldi.....as opposed to the tourist trap next door...ironically named Grimaldi's! You can google on your own to see see the history and how Grimaldi's is no longer owned by Patsy Grimaldi, but suffice it to say Julianna's is the real deal. And based on my visit last weekend, Julianna's has its own long wait to get in. Seems folks have now caught on.\n\nBeing the pizza snobs (or aficionados) that we are, my family has frequent and lively debates on who makes the best pizza. Coming from the central NJ area, places like DeLorenzo's in Trenton NJ and The Vault in Bordentown NJ, as well as Manhattan/Brooklyn spots like Joe's (West Village), Tottano's (Coney Island), L\u0026B Spumoni Gardens (Gravesend) are among our favorites.\n\nEver since Julianna's opened, the rest of my family has all agreed that Julianna's is #1 on the list, while I preferred Tottano's and De Lorenzo's...but not taking anything away from Julianna's! \n\nWe were impressed right from the first visit a couple years ago. We were aware of the Patsy Grimaldi history, and there he was standing out front of the restaurant - hustling for every customer, inviting them to come in and try his pizza rather than stand in the long Grimaldi's line. He's in his 80's, but boy does he still hustle. He moved all around that restaurant - from helping to seat customers to posing for photos to bringing food to tables to spot-checking the pizza ovens for quality. It was no wonder why he was so successful.\n\nFast forward to last week's visit...... I had the #4 pizza special: Tomato, mozzarella, arugula and prosciutto (Italian ham) - and THAT was officially the best pizza I ever tasted. Hands down.\n\nThin crust, charred edges - perfect balance between not too crispy, not too doughy. A healthy dosage of prosciutto (no overly salty either, which sometimes can be the case at other places) and a boatload of Arugula. The arugula was put on after the the pizza was cooked too, so it was cold and fresh (not hot and wilted).\n\nMy father in law had the Spaghetti \u0026 Meatballs and said the homemade meatballs were sensational.\n\nOverall, Julianna's has amazing food, a great atmosphere.....and ought to be near the top of any legitimate BEST PIZZA lists.", "author": "Darren L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-26", "description": "A lot of you out there may strongly disagree, and some may even throw rocks at my head, but the hour long wait in the 48 degree and quickly dropping temperature outside wasn't worth it.  The pizza, though good and tasty, was very similar to Grimaldi's next door and back at home in Sin City.  The dough was so much better at Philly's Lorenzo's on 9th St by the Italian Market... in my humble opinion and fam's.  And we sooo wanted this to be the best pizza ever based upon the reviews.  My review is actually closer to 3.5 stars. However, the service was top notch!", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "I don't frequent Brooklyn often, but when I do, it's for pizza. And let me tell you, Juliana's was definitely worth the \"trek\" #jokes. I ordered Patsy's Housemade Soup--the Pasta Pasilli--to start and already, I was sold. Delicious and flavorful, it was the perfect start to the meal. \n\nMy friend and I then decided to split a large Margherita Pizza with Garlic + Onions on top. I've always thought that Grimaldi's pizza is pretty much as good as pizza can get, but somehow, Juliana's managed to prove me wrong. It was amazing. \n\nWe then finished off the meal with Carol's Cannoli and a slice of New York Cheesecake. I've never been the biggest fan of cannolis, but dang, was that a good one. The cheesecake on the other hand was good, but was nothing spectacular.\n\nThroughout the meal, Patsy Grimaldi himself stopped by our table to chat with us, which made me so happy. I mean, I was talking to the pizza god himself! Smiles all around. He even let us snap a photo with him before we left, which unfortunately, did not capture me peeing my pants at the exact moment. Ah, well. Thanks for an amazing meal, Patsy! We will definitely be back soon.", "author": "Corinne K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Ive been here many times and it doesnt disappoint. For a Saturday, there was at least a 30-45 min wait. It was a bit of a wait but definitely worth it. We got the No.4 prosciutto argula pizza and the white pizza... If youre looking for something different, I would definitely recommend the prosciutto and argula. Tastes delicious and the environment was also very nice.", "author": "Joyce L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "Thanks for the response and explanation. Considering the fact that I was hung up on 2 times before even speaking to the manager, who abruptly hung up on me as well when my my response to his \"we are very busy, you know\" was \"well I'm happy for you\", I'm not sure in what version of reality you think i would call back a fourth time to speak with you or anyone else in your facility. \n\nYou used the platform of my review to highlight your product and defend your establishment (which, as a business owner I get) , but justifying every turn and shifting the blame isn't an honest approach to what happened in my experience with your staff. \n\nI'm glad you have such a wonderful product and I wish you continued success, sincerely. However, no part of this experience or your response will inspire me to ever come and find out for myself what all the fuss is about.", "author": "Georgia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Pizza is something I know well.  I've eaten a lot over the past 33 years as my yo-yo-ing waistline can certainly attest to.  However, in my search to eat as much pizza as I can, I have committed the most cardinal sin possible - in my previous two visits to New York, I did not eat even one slice of pizza!\n\nIn my preparations for coming to New York I had decided I wanted to make a pilgrimage to Di Fara's in Brooklyn, however fate and schedules conspired against me and I couldn't see where I would have the opportunity to get there however luck was on my side when I completed a walking tour and we ended up outside of Juliana's Pizza.  Our tour guide, Onell, told us that he thought this was much better than neighbouring Grimaldi's and thought this was the best pizza in not just Brooklyn, but New York City.\n\nWe queued for about 25mins before getting a table around lunch time. From what I understand they don't take general reservations so we just had to queue which is fine because sometimes that's just the way it is.  Hell, if there's consistently a queue like this in a big city then I'll wait even longer because it must be good.  I didn't factor the wait time into my review, but just be aware that you may end up waiting longer.\n\nThe food was fantastic.  They serve whole pies only, and we had a large pie between four of us which was a nice lunch time snack.  The sauce on the pizza was fantastic and usually my biggest complaint on other pizza's I eat.  We had the prosciutto and arugula pie and it tasted so good.  There was just enough of each topping without either outstaying their welcome and giving enough balance to each bite of pizza, while the crust stayed nice and intact and had a nice crunch to it - more importantly, no sauce and topping glooping into your hand.\n\nThe price is a little on the more expensive side, but the pizza did feel worth the price.  Last year we had pizza at Da Franco's in Sorrentto, Italy and Julianna's definitely ranked up there with it, impressive as Da Franco's is considered an Italian institution.\n\nThis place was damn amazing.  Don't let the price or the wait put you off, because after eating that pie you will know it's been worth it.", "author": "George M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Definetly really good pizza, but it didn't blow me away. Maybe it was too hyped up...", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "To me, this will always reign supreme. I have been coming to Juliana's for years and years, even long before I moved to NYC. The pizza has consistently been delicious since day 1. If there's a trend in my pizza orders, it's that I always keep it simple - margarita pie. Juliana never disappoints. The pizza is super thin and extremely tasty. \n\nWhile there is often a line outside to get in, it's hilarious seeing how much larger the line is at Grimaldi's (up the street). Let me clear the air - Juliana's is better. Get yourself into the shorter line and eat here.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "OMG.  I think I have died and gone to pizza heaven!!!  \n\nWe all know NYC is the Mecca of pizza, but I have to say I don't think there is another restaurant that can beat this one!  It was well worth the trip in to Brooklyn \u0026 well worth the wait!  \n\nJuliana's, right next door to better known Grimaldi's (actually this is the original location for Grimaldi's) and the owner is none other than the Grimaldi family, from what we were told.  \n\nOpen kitchen concept so you can watch the pizza chefs make your pie - they even have counter seating right near the prep area. \n\nThe restaurant is tiny, so be prepared to wait - whether you are there for lunch or dinner - but it is well worth it.  \n\nWe started with salads, which were tasty and fresh.  The dressing on the arugula salad was AMAZING!  Salads are definitely enough for 2 to share.  \n\nWe had a half white pie/half margherita (added ricotta \u0026 extra basil) as well as a margherita with pepperoni.  We ordered two small pizzas (for 3 people) and had enough to take some back to the hotel for later!  \n\nThe pizza was hot and the coal fired crust is light \u0026 crispy, but still pliable enough to fold and eat!   My husband loves the little pepperoni too!   \n\nWe had to wait for our white pie, as the waiter didn't order it correctly, and we were brought a margherita with ricotta.  Our waiter even read the order back to us after we placed it, so not sure what happened.  Would have been nice to offer a discount, or maybe a free soda.  Although he did apologize (after questioning what we ordered), the runner who originally brought our pie out was a little rude when we said it was incorrect.  The customer service piece is the ONLY reason I am giving 4 stars and not 5! \n\nThey only serve beer \u0026 wine, definitely try some of the local Brooklyn brews!  Wine selection is just OK.  \n\nWe didn't have dessert, though they looked amazing too.... We were just too full!!  \n\nAfter dinner we walked back to Manhattan over the bridge, which was a perfect ending to our night!   \n\nI'm in NY about every other month and I will definitely be back here again!", "author": "Marta H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "Juliana's Pizza\nNY: BK: DUMBO\n11:30a Thursday 10th March 2016\nFour Stars\n\nI think I like Grimaldi's better.\n\nBrief history of Juliana's: It was open in 2012 by the Pat \u0026 Carol Grimaldi, the original owners of Grimaldi's who sold their original pizzeria and their name over a decade ago. The place and pies seem more upscale and modern.  I had the pup so I ordered a Large No. 2 to go. In 15 minutes, they brought it out in a bag (I like that they don't give it to you in a box). I walked down to Brooklyn Bridge Park and enjoyed my Cherry tomato, Bufala mozzarella, garlic and sea salt pizza looking out towards the East river and the Manhattan skyline. The crust was very thin in the middle and slice had a droopy tip when folded. The outside crust was thicker and bit plain. However, there was perfect amount of char on the bottom.  There was no sauce but it was not dry at all. The cheese was delicious. The pie was covered in were fresh, sweet, and juicy cherry tomatoes, garlic, and salt. Overall, the flavor was great but I think I want to try a red sauce pie before I make my final decision on which DUMBO pizzeria reigns supreme.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "I've forgotten how good Juliana's is. FYI, this is the original Grimaldi's, and the sign that claims otherwise at the Grimaldi's establishment next to Juliana's is simply false advertisement. \n\nThe super thin crust pizza here is delicious. The cheeses, the marinara sauces, the basil, etc are off the charts good. The red and white pizzas are equally captivating, while the specials are a cherry on top. If you want to leave room for menu items other than pizza, then the meatball appetizer and the Brookie dessert are the way to go.", "author": "Tunaidi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "Came here during the god-awful line on July 4th. Big mistake on our part, but the host was a great facilitator and the line turned out to be not too bad. We were seated eventually and the server came up to us immediately. Everyone was super busy and I actually wish we came on a slower day b/c the atmosphere felt pretty rushed. They only have two bathrooms here and the lines were abysmally long...albeit like I said, we came during a very busy time so I guess this was to be expected, though it still left a bad taste in my mouth.\n\nSpeaking of bad tastes, my s.o. and I came here in search for good \"Brooklyn\" pizza. Hell, good New York City pizza.. as you can tell, we weren't from the area. We thought this would be the end all and be all based on yelp reviews. Sigh.\n\nSalt...salt...salt..salty salt SALT. What did they do to the pizza? It was so incredibly salty that we had trouble downing it. It literally tasted as if someone pre-opened the salt shaker and the person actually seasoning accidentally poured the entire salt shaker onto the pizza. It was SO incredibly bad that it made me lose total faith in this place.\n\nOfc we weren't going to be those asses that ask for another pizza during this oh-so-busy time. Kudos to the waiter for asking anyway, but honestly, this was probably the most oversalted pizza in my LIFE.\n\nI really wanted to give this place at least 4, but that pizza was terrible. The crust was not as crisp as I'd liked it to be either but man.\n\n6/10, would come again once in a blue moon (and not order that special no. 1)", "author": "Cuong T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-29", "description": "Decent pizza. I wouldn't say it's worth the 50 minutes to 1 hour wait for it. I think Grimaldi's pizza is better. I plan to give ignazios around the corner a try next time.", "author": "Dollin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "I'm torn in leaving this review because my experience was overall very pleasant.  So why not 5 stars? Ok here's why. The pizza while very good is not NYC pizza. This is a fancy tourist pizza place that is indeed pricey. A small cheese $17. To me NYC pizza is that slice that is fresh out the brick oven and you pick it up with your hands fold in half and your fingers get dusty and the orange oil dips down the middle and your slurping that oil up from the wax paper with your eyes rolling back in pure delight wondering how on earth you can eat anything else again in life.  Then you finish it with an Italian ice and cold Coke! All for a whopping $5 dollars.  And let's be honest that just makes everything taste even more glorious. Julianna's is not this type of place. \n\nHowever, please don't let this review confuse you as a negative. The pizza is indeed quite delicious.  Truly it is.  But it's not that famous NYC SLICE that takes you back to your childhood. I believe a few of you guys will understand my review.  \n\nWe were seated quickly but I showed up at 12 sharp by 12:15 the line was down the block. Guess I got lucky.  \n\nGood luck my yelpers on finding that NYC Slice that takes you back to after school and being 12 yrs old with $5 bucks in your pocket. \n\nThat pizza is out there...", "author": "Jasmin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "I was excited to try this place, especially seeing that there was a wait. So you know that means something. It's a small restaurant, tables are somewhat close to each other. I didn't like how people kept bumping into my chair, kind of got annoying. I liked how they served the coke glass bottles, thought it was super cute. The pizzas are decent size. Every thing on their menu looks so good, especially seeing others get their pizza. I wanted it all, but we ordered the No. 6 which was grilled chicken, mozzarella, Monterey Jack, white cheddar, house-made guac (I know I love guac too!) and cilantro. No tomato base. First time I ever had guac on pizza and let me say it was pretty darn good. If you're ever in Dumbo, give this place a try!", "author": "Karina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Best pizza I've ever had and the service was impeccable!!! Just do yourselves a favor and go. Don't mind the wait. It's worth it and the host has that place running like a well oiled machine. I would give it ten stars if i could.", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "This place is hands down one of the best pizza places in Brooklyn and totally worth the wait. A line starts to form before they even open so to ensure a table almost right away it is best to get in line early. Waited in line approximately 45 minutes to an hour before they started seating. The restaurant has ample seating, faster to get seated if you are in a group of two. Ordered a white pizza with cherry tomatoes and it was delicious. The pizzas are made in a brick oven and the crust is of the perfect crunch level. Took a while for the waiter to take our order as the place was packed and also took longer to get the food. Totally worth the trip to Brooklyn to try this pizza.\n\nUpon finishing, there was still a line to get in. If you plan on going here to grab a bite, be prepared to wait a while to get seated and to be served.", "author": "Dhara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "We quickly devoured our coal-fired margherita pizza at Juliana's one weekday afternoon. I was thinking, should we go to Grimaldi's or Juliana's? Then I learned the history (see below) and opted for Juliana's. The crust is thin with a slightly crisp outside and a soft and chewy inside. The delicious sauce is poured on top of the fresh mozzerella (that Carol Grimaldi makes herself) so that it stays moist and doesn't burn from the 800-degree oven. Beautifully crafted pies using incredibly fresh and tasty ingredients. Note: dried oregano is tossed on top of the pie, so if you're not a fan of oregano (which I am not), you might want to request they leave it off.\n\n*Juliana's is actually owned and operated by Patsy Grimaldi. Patsy and his wife, Carol, used to run Grimaldi's in this exact location before they sold their name to Frank Ciolli back in 1998. Ciolli moved the original Grimaldi's next door to the corner spot where it currently operates under the Grimaldi's name. After 15 years in retirement, Patsy and Carol opened Juliana's in the original Grimaldi location (next door to the current Grimaldi's) and is firing out pies as they did years ago.", "author": "Janelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "Excellent pizza. Some of the best in the city, great crust, cheese, and cooking method.  It also comes out quick and hot when ordered.\n\nThe wait is a pain in the behind though.  I get it's part of these places shtick, but it definitely detracts from the overall experience.", "author": "Sam A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-29", "description": "My friends and I came here for a late Saturday lunch and thankfully, arrived at a slightly lull time and only waited 5-10 mins for a table. The restaurant doesn't do half-half for the special pizzas - they can only do it for the classic pizzas. As interesting as the special pizzas were, we wanted a bit of variety since we could only order 1 pizza for the 3 of us, so we ended up ordering half Margherita and half white, and added toppings of prosciutto and sweet onions. The large was more than enough to fill us up! We preferred the Margherita over the white but honestly, I do think that if you're getting the classics, you can get equally good slices elsewhere at a lower price instead. On hindsight, we probably should have ordered the specials?", "author": "Rachel L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}