{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "Pizza is just amazing while it may be pricey, the serving size is very generous though.", "author": "Liam A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Great pizza, one of the best spots I've been to in NYC.\n\nLong lines and a bit touristy due to the popularity, so getting there around open is the best time to go, but the lines move fast enough where you shouldn't wait too long unlike most other popular pizza restaurants.\n\nThe Margherita is fantastic. The sauce was a little sweet, the cheese was very fresh and the crust had great coal oven flavor and was still a bit chewy which I liked a lot. \n\nOverall I highly recommend this place", "author": "Stefan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "My friend and I wanted a \"special experience in Brooklyn\" therefore we choose to go to \"Juliana's Pizza\". There was a huge line. We made the line for about 30\nminutes on a Thursday afternoon. The service was good but the pizza wasn't all that great. It was tasty and the pizza was good, I just don't think that it was worth the 30 minute wait. I'm also Italian, therefore I have high pizza standards.", "author": "Gabriela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Get the egg cream! Will not disappoint. Pizza is very thin and delish. Comes out quickly too (once you get past the hour long queue on weekends). Ambiance is intimate, Good for a couple or small group.", "author": "Mina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Our favorite pizza in New York! Love the margarita pizza, all their food tastes so fresh! Worth the wait.", "author": "Natasha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "You can feel the love.\n\nI mentioned at length in my Grimaldi's Yelp review on how Grimaldi's over the years lost their touch as you can tell their quality dropping, especially once they moved to their new location to make a double decker restaurant to house more tourists (have to be honest).  Luckily the original Grimaldi's owner reopened a new restaurant at his original shop location, now with the name of Juliana's.\n\nThe immediate difference that I would be able to tell at Juliana's is the love that goes into each pizza.  You can see the pie being made in front of you and put in the oven as you wait.  At Grimaldi's something takes your order, they go away, someone new comes to serve you and has no idea who ordered what.  Julianas still has that family type environment.\n\nThe pizzas are great.  Had the #1 and #4.  Old school style, they don't let you substitute.  They want you to enjoy it the way it was intended to be made.  Though the pizza may not be as amazing as what Grimaldi's used to be 10+ years ago (at least the memory of what it used to be), it is still one of the best.  In my ranking of NYC pizzas (see below) it is currently second only to Di Faras in terms of whole pie restaurants.  You wont be disappointed, and you'll feel like you had an authentic NYC experience.  Whereas eating at Grimaldi's today, you'll feel like you're eating at a Planet Hollywood.  Well a better example might be Buca Di Peppo, but you get my point.\n\nA couple of things Julianas has over Di Faras is that it's closer to Manhattan - not just because that's where I live but because it's less of a hassle to take visitors from out of town when they visit.  The other thing is that at certain parts of the day (2pm ish) there may be no wait, whereas Di Faras there is always always a wait.\n\n\nFYI here is my own personal rating system and ranking list of some other pizza joints in NYC\n\n5=worth a trip, something you'll crave\n4=worth getting but only if you're already in the area\n3=only worth it if it's free/discounted, not worth paying full price\n2=would not even eat it if free, waste of stomach space\n1=the place should shut down\n\nThe places are listed as best/better first if they share the same rating (I.e. Di Faras better than Julianas, etc.)\n\n5's (whole pie) - Di Faras, Juliana's, Keste, Emily, L \u0026 B Spumoni\n5's (by the slice) - Artichoke, Prince St, Joes\n4's (whole pie) - Don Antonio, Robertas, Barboncino, Table 87, Lombaris, Patsys Pizzeria, Speedy Romeo\n4's (by the slice) - Roma's, Go 99, Two Brothers\n3's - Johns Pizzeria, Grimaldi's, B Side\n2's -Two Boots Pizza, Lucalis\n1's - none so far", "author": "Thomas V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Coal. Fired. Pizza. The ingredients taste so wonderfully fresh. The fresh mozzarella is exquisite. Ordered the margherita pizza. Simple perfection. This pizza is absolutely worth the wait in line. \nGo. To. There.", "author": "Jamie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Except for the waiting period , the food was delicious. A great place to have lunch while visiting Brooklyn bridge ... Loved it", "author": "Bobby J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-10", "description": "Ok, we saw several reviews on YouTube and other venues, so when we were in the neighborhood we had to try.  We weren't disappointed!  Coal (not wood) fired pizza oven, wafer thin crust and and a very simple set of toppings (we had the #2).  We had garlic, olive oil, cheese and cherry tomatoes. That's it.  And it was perfect!  It's a little crowded but worth it.  If you're in the DUMBO area of Brooklyn, treat yourself to a nice meal.", "author": "Chuck M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-07", "description": "This pizza was TOTALLY sub par. I was beyond disappointed after eating here. This place claims to be the #1 pizza, but I disagree. It is okay pizza, but nothing special. Trust me.", "author": "Jill D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "Pizza here was great. We ordered the margarita pizza. The fresh basil made the pizza! Service was a bit slow and our server forgot my wine. Upon reminding him, he was unapologetic. We had to wait outside for about 15 minuets for a table. Which felt like an entirety due to the cold weather! Over all we really enjoy our visit. The pizza was a bit pricey.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Amazing pizza... long line but certainly better than Grimaldi's around the corner.", "author": "Felipe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "What a pleasant surprise! My boyfriend and I were drawn by the line outside and we decided to give this place a try. The staff was very kind and attentive, the pizza was delicious, and they have a great wine selection. Will definitely be going back!", "author": "Gisell S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Really tasty pizza, great service! Worth the wait in line", "author": "Amirtha U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "The hype is worth it, finally tried it and it is as good as all the reviewers rate it. \nI posted a picture on insta and they commented back as a thank you, in my books that is an amazing plus point. \nWorth waiting in line for. \nA big thumbs up", "author": "Aisha I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Really delicious thin crust pizza with a great selection of beers in the DUMBO area. I've been here time and time again, and the pizza keeps getting better. Highly recommend it to all my friends that come to visit!", "author": "Krithika P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "I'm partial to New York style pizza, and in Chicago, not surprisingly, there just aren't many good options. A recent trip to New York thus called for some serious pizza consumption. Juliana's Pizza offers elevated options and served us some truly excellent pizza. \n\nLocated in DUMBO, Brooklyn, it's a great place to go while checking out the Brooklyn Bridge. My fiancée noticed a long line outside of Juliana's while we explored the neighborhood, which meant it had to be good. We were able to get in just before it closed for lunch and were seated at the counter. We ordered the No. 1 special (mozzarella, scamorza affumicata, pancetta, scallions and white truffles in olive oil) and were definitely glad we did. (The No. 1 special doesn't have tomatoes.) Well balanced and fragrant, the pizza hit the spot for what we craved. The mozzarella and pancetta were particularly outstanding, and the scallions were the perfect compliment.  \n\nThe service could use some improvement, however. The person who seated us, while not overtly rude, was not particularly pleasant or welcoming. Also, it took us a while to get menus and for a server to take our order. Thankfully, the pizza was so good that we left glad to have checked out Juliana's.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Excellent pizza bear the brooklyn bridge! You can either wait for Grimaldi's or wait for Juliana's. The Juliana's line is shorter (although barely) and the pizza is very good. Plus they take credit cards. You can either eat at the restaurant or take your pizza to go and eat at brooklyn bridge park. If you take out, make sure you tell the person you want to order to go in order to skip the line. If you want to try classic New York style pizza, you can't go wrong with Juliana's.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-11", "description": "Well, I walked two miles to get here based on the reviews.  Ordered the arugula salad (with walnuts and goat cheese) and margarita pizza.\n\nThe salad is a meal OR big enough for two  (maybe 3) if you are also having pizza \n\nPizzas come in sizes small (16\") and large (18\").  They do not sell is by the slice.  Since the pizza is thin crust, a small to medium sized adult  could easily eat half in a sitting. \n\nThe salad was very good and I would order it again as a meal.   The pizza was....  bland.  I had to add salt (which helped a lot) and some red pepper (which I never add to pizza).  I am wondering if I should have chosen one of the specials? \n\nThe margarita pizza would be kid- friendly pizza because the flavors are simple and it's a basically a cheese pizza without too much sauce or cheese. If I tried it again I would try a special with the sausage or prosciutto to give it some additional flavor.   I would skip the margarita pizza and try the #4.", "author": "K W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "We arrived at Juliana's on Monday just a few minutes after their 4P open. I was worried there may be a line and we wouldn't be able to stay since we needed to be leaving the city by 530P to fly home to LA. To my surprise, no line! We walked right in and I couldn't have been happier or more grateful.\n\nWe ordered within a couple of minutes of being sat and our pie was out in no time. Sausage and Pepperoni was outstanding!\n\nI've waited on the sidewalk for Grimaldis in a couple of different seasons, on snow and ice lined curbs freezing and I knew this trip to Brooklyn I wanted Juliana's.\n\nIf you're wondering how much of our large two people can eat... we had two slices left! :) Oinkers, I know! I had just completed the NYC marathon the day before so I was hoping I was still in burn mode ;) Flew the other two slices home for my son to take to school for lunch. Not every kid in LA gets to have pizza flown home from NY. \n\nThe best and most friendly service. I can't wait to return!\n\nI'd say, why can't LA have a Juliana's but truth be told when these places open up at home, they never taste the same as they do in NY so I'll just be happy to visit when I'm in town again next.", "author": "Candace L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}