{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "We had a large margherita pizza with pepperoni and garlic (8 slices in total, 4 slices for each of us). The ingredients were very fresh and the pizza was nice. We were there on a monday at 5pm and the restaurant was half empty, so we did not have to wait, which was good. Waitstaff was very friendly.\n\nAnyway, good pizza but that is it.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Nice comfortable restaurant with plenty of seats and extremely pleasant servers.  The pizza is delicious don't get me wrong but Di fara is still the best and it's not really even close. The Grimaldis style of pizza can be found in a lot of places in Brooklyn these days.  I would stop in when in the area but it doesn't make my heart race like Di fara does. I wouldn't drive all the way over here just to get it. Did I mention Di fara is still the champ of pizza?", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Be prepared to wait for some of the best Pizza in NYC, fresh ingredients, coal fired, It can be a little soggy at times, but never disappoints. Pizza with Peroni Beer...You cannot beat that.", "author": "Leonard W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Wonderful Pizza very authentic the place is very nicely decorated and the staff was exceptional like anything in New York parking is tight", "author": "Paul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "This pizza is definitely better than Grimaldi's. I would assume if you like Grimaldi's more than you're the kind of person who likes to kick puppies and punch babies. Grimaldi, the founder of Grimaldi's, is actually the chef at Juliana's. He started Grimaldi's, built it up, sold it and then decided he wanted to come back and the new owners said no so he started Juliana's next door.\n\nDefinitely delicious and definitely way better than Grimaldi's. And that's saying a lot because Grimaldi's is delicious as well.\n\nAlso, the pizza is good, but I think the cheesecake is great as well.", "author": "George R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "I did an experiment whereas I ordered a small pizza from Grimaldi's and one from Juliana's, the original maker of Grimaldi's pizza. Keep in mind I had no narrative bias, I really wanted to see which was the better pizza.\n\nAnd the difference was striking. Grimaldi's tasted like supermarket pizza and made me yearn for real NY pizza. I was laying blame on the style of the pizza. Then I went to Juliana's. Interestingly, small pizza with identical \"look\".But that's where the similarities ended. I was blown away by Juliana's Pizza. Every part of the pizza offered a complimenting flavor. The crust was toasty yet malleable whereas Grimaldi's was doughy and powdery. What's the point of the oven if that's how you serve it?\n\nJuliana's cheese was scrumptious and alive with flavors whereas Grimaldis tasted like mozzarella alone. The sauce at Gromaldi's was watered down, at Juliana's it had a rich flavor. Even the basil leaf on the Juliana pizza offered an interesting unique flavor while the Grimaldi's leaf might as well been an ornament. It tasted like  over cooked lettuce.I found a respect for the style of Pizza at Juliana's.", "author": "Hugo F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Get thee to Brooklyn and eat this pizza! I ordered their Margherita Pizza and couldn't eat it fast enough. Seriously the best pizza I've ever eaten. Go in the late afternoon to avoid the long line, but if you do have to wait, it's completely worth it.", "author": "Tabitha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Our first time in New York and our first encounter with an authentic pie. Mind blown. We ordered two pizzas-- a Number one and then a traditional margharita with meatballs.  Both had thin, crisp crusts. The quality of the cheese and simple ingredients were truly gourmet. Almost an insult to call it pizza because it is so much better than any pizza I've ever eaten. Highly recommended, but get there early. This place is packed for a reason.", "author": "Kate H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "We certainly had at Juliana's the best pizza outside of Italy so far. It's definitely not a place to have a romantice dinner. It's pretty busy, loud and crowded. We were very surprised about the size of the pizza, even the small ones are huge. And as I am a vegetarian we couldn't share, so we needed to order two, but couldn't manage to complete those. Based on the more canteen like atmosphere and the price (both pizzas were about 26-28$) I cannot give them the full rating. However, if you are looking for a great Pizza in Brooklyn, Juliana's is the place to go to.", "author": "Anne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Around this area, juliana's, grilmadii's, and ignazios all had a line.  We picked this one cause we wanted to be harrassed by Patsy Grilmaldi the man himself.\n\nOur pizzas were fresh off the newly stoked coals.  Crust was damn good.  Prices were on point.  Service was amazing.  Those guys were super cool.  Almost too nice.  Are we still in NYC?  \n\nFYI. Coals are stoked around 315pm for about 30 min.  Meaning no pizza is made during that time.  So if u come around that time u may have to wait longer", "author": "Minh L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Best pizza I ever ate!  If you're visiting NYC, don't miss this place.  It's worth the wait!", "author": "Carolyn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "The best thin crust pizza in the heights area. Friendly staff and our go to pizza spot for visiting friends- who want the NYC pizza experience. \n\nPlease note ( I know the line is long but): You have to eat the pizza while it is still hot, the taste experience is  significantly degraded when it gets cold. We tried takeout with friends and we all felt more than a little bit let down. It's like trying to take the river barge fireworks home, it just doesn't seem to work. That much goodness doesn't travel well and should be kept away from this cold, evil world until it is in the safety of your belly.\n\nSo if you try it in its glorious state of hot and fresh. You will make a return visit(s). \n Price is above what I would like, but right for the area and skill factor. \n\nEnjoy!", "author": "Stas L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-04", "description": "The pizza is very good. However, their customer service leaves a little to be desired if you are trying to order for take out. We have tried on numerous occasions to order from there. It seems as if they try to discourage people from ordering to go by stating that it will take an hour, or an hour and a half. The last straw was a little over a week ago. I called shortly after 8 pm to order a pizza. They told me it won't be ready until 10 pm, is that okay? I said that's okay, but thanks anyway and hung up the phone. Then my mother tried to order a pizza from them a couple of days later around 4 pm. The person answering the phone told her that they are not doing any take out orders for the rest of the day. She told them we've tried to order a couple of days ago, and that's bad business. I take it from the reviews listed on here that they are doing so well that they don't care about our business. Since it's such an issue for them, they should just state that they do not accept take out orders and it's dine in only, then the problem would be solved.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-31", "description": "Came on a beautiful Saturday afternoon to find only about 5 parties on line, about a 30 minute wait. The Grimaldi's line looked like it would take 2 hours.\n\nThe host was very friendly, and came out to keep us posted and find out how many people in each party.\n\nWe were seated, and after dealing with the really nice host, I was expecting some courteous service inside as well. This was definitely not the case. We were sitting for 20 minutes before a server came over and half-heartedly asked if we were ready. Thanks for not greeting us and asking if we wanted drinks, I guess someone was not trained correctly.\n\nWe ordered two pies, one margherita, and the other with pepperoni and meatballs. The plain was pretty tasteless, and our meat-za was a bit on the salty side, but we appreciated it more than the plain. The first bite was piping hot, crispy and delicious. But as you keep eating, you realize that it does not keep its texture and really comes short of expectations. The other slices got soggy before we got to go for seconds.\n\nOverall, if you want pizza, go to Di Fara's or Lucali's. Grimaldi's is good, but not worth the wait in Brooklyn. Juliana's is average, and if you're in the area and there's no line, then by all means, go for it.", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "Ok who visits New York and not eat Pizza? i don't care if you are in a strict diet, eating pizza in New York is a must! and having from one of the most famous places even BETTER! I ate 2 different kinds and needed to walk for 2 days to burn the calories that were totally worthy!!!!!", "author": "Patricia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "Juliana's may seem like just an enterprising extension to snatch the runoff from Grimaldi's, but it's the real deal. The true Grimaldi's. The oven in the back has been there nearly a century. That kooky old guy who welcomed you in and is throwing pizza dough around the place is actually Patsy Grimaldi himself. Juliana was Patsy's mother; he sold Grimaldi's off many years ago, losing the right to use his own name on a pizzeria (he similarly lost the rights to Patsy's many years before in Harlem). These two restaurants have been bitter rivals ever since.\n\nYou'll need to bring a group to split a pie, but once you do it's pretty damn economical at $2.50 a slice. The long line and reputation obviously speaks to its quality, I expected to shell out a lot more. Consider that you'd pay almost double for the same thing by the slice at most places.  \n\nHIGHLY recommend the calzone too, it's incredibly filling and comes overloaded with a combo of extremely high quality cheeses. It's been months and I still dream about that thing.", "author": "S M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-08", "description": "Wish I could could give this more stars but the staff across the board was so unwelcoming and unfriendly I wished we'd turned around and went to their sister store next door. \n\nThe pizza was good (my husband LOVED it), I wished it had more cheese on it. If you are a cheese lover, get extra. The small pizza is 16\" which is big for a small (the menu didn't clarify how big the sizes were, large is 18\").\n\nI ordered a coke with my meal. I wished the server had told me that it would come in a tiny 8oz glass bottle (for $3). I prefer my coke with ice from a fountain so was disappointed. And 8oz is just a tease! Also, I wanted ranch or something creamy to dip my crust in. They didn't have it.\nOur service left much to be desired. We were the second table to arrive for lunch, so can't blame it on being busy. We never got water refilled or were asked if everything was ok. Unacceptable.\n\nI live in VA, so won't be back anyway. With so many choices in NYC, this place needs to step up their game.", "author": "Jos O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Searching for the best pizza in Brooklyn, or the East Coast for that matter, its here!\n\nSplit a small (large enough for two) pizza with my partner and it tops our list of greatest pizzas.\n\nServed from the wood fire on an easy serve platter, it is a crunchy classic!\n\nGet down there!", "author": "Azza B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I walked in, was seated immediately (surprisingly short wait time for Saturday night), and graciously given the menu from which to select a pizza. \n\nWe ordered a large margherita and a small pepperoni, and 2 beers, ($55), and that was way more than enough for 2 people. The pizzas were much larger than I expected but probably typical for NYC style. \n\nThe best thing about the pizzas was the toppings, the sauce was really fresh and flavorful and there was plenty of basil and mozzerella. The pepperoni pizza was my favorite because there was so much flavor added. Neither of the pizzas got cold quickly, which was great as well. \n\nDefinitely favorite pizza in NYC-- possibly ever!\n\ngreat service too. Great experience.", "author": "Arden P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-26", "description": "We came to try this highly touted restaurant from out of town. First, the servers and wait staff were excellent and accommodating. The Caesar salad was excellent. Wonderfully fresh made croutons and delightful green olives. The pizza was \"ok\". Not really spectacular. We also had a pasta meat ball dish. The red sauce was excellent. The meat, though, was sub par and tasted a bit too much like pet food smells. That may be just me. But those at the table seemed to agree. I add quickly that it was , to be sure , not pet food. The overall taste was not up to the high price and hype. \n\nIn sum, the fresh ingredients and great atmosphere were well received. But the meatball dish was found wanting", "author": "Rand D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}