{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "This is a staple of NYC. Located in Brooklyn right off the bridge. This is a well dressed pizza shop with great tasting pizza! Ask any New Yorker and they'll tell you about Julianas. Some say it's a tourist trap, I say, go try it! Well worth the trip. Enjoy!", "author": "Obee O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "The NY Pizza Saga is long and complex, you usually find the long rivalries printed on the back of menus but Juliana's and \"Grimaldi's\" is a whole different ballgame.  I first came to the original location of Grimaldi's in 2007 on the first date in NY with a woman who eventually became my wife.  Grimaldi's Pizza was a first experience, we had a Margherita with Dried Tomatos and Pepperoni and instantly fell in love with pizza (and I believe her with New York.)  The sauce was Garlicy and fresh, the mozzarella was in fresh slices melted on, the basil adds a herbal tone to the taste, the dough was crunchy in every bite with a unique smoky flavor only a brick oven can provide.  The Pepperoni was thick rich chunks and unlike any of the thin slices you get typically.  This was not the neighborhood cheezy slice I grew up with in the Brooklyn neighborhood, this was something else.\n\nFast forward to today, we had just moved apartments and now found that we lived close to the Grimaldi's location we first went to.  We had heard rumors that Grimald's was springing up all over the place and only cared that we can get the same taste and service at the original location.  When we got there we were utterly confused when Grimaldi's had moved in to a building that looked like at city hall.  Where we were used to long lines waiting before the location opens and staff organizing the line, this time Grimaldi's did not have a long 30 minutes before open and the staff was comfortably inside.\n\nWe looked over at the original location and found Juliana's in it's place.  Standing in front was a young waiter out in the freezing cold near the river waving at us.  We waved back to dismiss him, frustrated someone had stolen the original location of our favorite pizza place.  The young waiter waved at us again and screamed \"You want to eat at Grimaldi's?  I'll tell you why they moved and if you don't like the story you can go back there.\"  Expecting a New York Con job we walked over to talk to the young waiter.  It was very clear that the waiter could not claim to be Grimaldi's because the restaurant name had been sold a long time ago, he had to tell the story about Patsy and his Grandmother.  Nostalgic about the original location and sad that it had moved, we talked in not expecting a pleasant surprise.  But we were surprised.\n\nAll that who is the first, and who is the original, and turf war drama doesn't matter.  At the end of the day what matters is what you serve on the table.\n\nThe Margherita Pizza was the Pizza we remembered on our first date.  We ordered it with half sausage and half pepperoni with garlic on the whole pie.  The prices were similar to Manhattan Pizza places but we expected that.  The original Grimaldi's Pizza oven was still there working its magic.  The staff is young but well trained but unlike the old restaurant where you could tell the cooks had many years of pizza making to their name. \n\nIt's exciting to see that Patsy Grimaldi has resurrected his restaurant and while the Pizza here was 95% what we wanted (we remember the crust being crunchier and the mozzarella with slightly more pop) we know that this will improve as the staff gets more experience.\n\nBegun this Pizza War has.", "author": "Kwai L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "I'll just throw it out there: I'm a guy who finds dollar pizza delicious, doesn't take much to impress me when it comes to pizza.\n\nMy two friends and I came here for dinner on a Tuesday night, around 7:00PM. We were seated immediately in the corner next to the kitchen, being able to see the hustle and bustle up close was pretty neat.\n\nWe ordered the Margherita pizza with additional mushrooms and the Number 4 special pizza (arugula \u0026 prosciutto). Two large pies was the perfect amount for three average-sized dudes. Of the two pizzas, I enjoyed the Margherita pizza a lot more than the #4. Something about the piled on arugula leaves and large slices of prosciutto seemed messy and excessive to me in both looks and taste. Plain and simple is the way to go: get a classic pizza and add a topping or two of your choice.\n\nGood pizza, clean interior, nice servers, speedy service, and close to the Brooklyn ice cream factory if you want a cone for dessert!", "author": "Edmond L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Perfect thin crust and cheesy topping made our pizza (the Specialty Pizza #1) amazing!  This place is run by the original Mr. Grimaldi and you can tell this guy knows his stuff.\n\nMy husband and I split a large pizza and the thing is humongous!  We managed to still polish it off, however, as we had spent the entire day exploring lower Manhattan on foot.\n\nService is friendly but sometimes spotty (due to high volume inside the restaurant) so don't expect anyone to be hovering nearby, they're just way too busy for that.\n\nDespite that, I spent the next week talking about Juliana's to anyone who would listen, and I'm pretty sure I won't be able to really enjoy pizza until my next trip to NYC.", "author": "Alison S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Great pizza, friendly waitstaff and the pizza was thumbs up for the entire family. One note, if you order 1/2 pepperoni and 1/2 something else, you pay for an entire pizza worth of toppings. Not just $3 for one topping for the whole pie.", "author": "L G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "9/10. Great pizza. Great service. Not usually as packed as the local competition. I had some pizza, but couldn't resist the cheesecake afterward.", "author": "Damon D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Even though they were officially closed, they let us order for dine in.  Service was spectacular and staff was attentive. And the pizza, oh God was it delicious!  We can't really say it was NYC pizza but we loved every single bite!", "author": "Maggie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "One of the best pizzas I've ever had! The crust was perfect ! The sauce was perfect and the toppings where the Bomb! Highly recommended,", "author": "Babak A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-03", "description": "Friends suggested this place so we came by after walking the Brooklyn Bridge. It looked like it would take awhile to get seated but it ended up being only about 5 minutes. That was a plus! \n\nWe ordered two smalls for 4 of us, and it was more than we could eat. The margherita was bland. The white pizza was a little better. Crust was ok. I asked if they had parmesan to sprinkle on top and was told yes, but then was never brought any or asked if we needed anything else. Wasn't offered another drink either. \n\nI had better pizza at 1am in Times Square.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Specialty pizza No. 1. That's all I need to say in this review bc damn that's a good pizza!!", "author": "Leah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "I do not understand the long lines for the restaurant next door. Yes, it's got a bigger name, but Juliana's has better pizza, service and ambiance.  \n\nEveryone in my party of three thought the pizza rocked our world.  We shared a No. 4 (Tomato, mozzarella, arugula and prosciutto) and it was fresh and delicious. Service was prompt and efficient without being rushed.  And unlike the popular spot next door, Juliana's serves alcohol.  \n\nHands down, this is the place to go for pizza if you're in the Brooklyn Bridge area in Brooklyn.  You'll have a wait to get into Juliana's, but it is worth it (and will likely be half the wait time as the spot next door.)", "author": "Augie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "Not see if worth to the wait in queue but pizza and is good. \n\nThe white pizza is better than the classic one \n\nOverall fun place but a bit expensive for the value, probably due to the hype around it", "author": "Harari E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "If you're looking for authentic New York pizza - this is the place. The owner is Patsy Grimaldi who originally opened and owned Grimaldi's in this location. Patsy sold Grimaldi in 1998 and it is now next door. Juliana's is the best pizza I've ever had. \n\nWe came at 8:30 on a Saturday night and, of course, the line was out the door but it only took about 15-20 minutes to get seated. \n\nPatsy was there seating the parties and checking up on every table. \n\nThe food was delicious and pretty quick to come out. My wife and I split a small pie and devoured every last morsel. The best thing about the pizza is that it wasn't too greasy and you didn't feel icky after eating it the way you do with some pizza. Also, the crust was the perfect balance between coal fired crunch and still doughy. \n\nFor desert I had a cannoli and my wife had the Brookie (a fudge brownie cookie) which were both wonderful. \n\nWe can't wait to come back. For more info on the history of Juliana's, check out this article from New York Magazine. \n\nhttp://www.grubstreet.com/2012/10/pizza-legend-patsy-grimaldi-gets-his-good-name-back.html", "author": "Curtis D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "Screwed up the pizza. Put tomato sauce on the #1 when he told us it would be a half/half with marguerita pizza. He told us he would take care of it and remove it from the check. He only offered a $3 discount on a $70 check. Terrible customer service.", "author": "Aaron G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "Being in New York, we really want to have the best around, for pizza, bottom line, it does not get any better than this!\nGreat atmosphere, friendly staff, open kitchen with brick oven and the pizza is simply delicious!!!\nYou should really try the number 1!", "author": "Al F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Suuuuuper cute spot, love the music choice, and super friendly staff! Oh, and I can't forget the PIZZA!!!! I fell in love! My first slice of pizza in NY, but I think this is all I need! You need to stop here!!!amazing!!!", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "The best pizza ever! We followed the advice of other yelpers and decided to try this restaurant. There was a long line down the street and I was concerned my husband wouldn't have the patience to wait our turn. A host came out frequently to update us on the wait time and to bring groups into the restaurant as space became available. Our turn came quickly and we were seated. I expected to be rushed through the  meal since it was so busy. However, Terrence (our waiter) was friendly and funny... He came by to get our drink order let us ask a few questions and then gave us a few minutes. He checked on us when he dropped off our drinks and he could tell we were still trying to decide. He stopped us and said \"look, I hate being rushed.. Don't feel rushed.. Take your time deciding and I'll check on you in a few minutes.\" Phew! \n\nThe pizza was outstanding!!! We had the margherita with pepperoni. The crust was crisp and light. The sauce was light and flavorful. Great atmosphere and the employees all take the time to engage the customer and make people feel welcome. The owners did a great job in establishing a great culture and it shows in how they treat their customers.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Wow!  This is probably the best pizza in NYC!  The only critique I would have is the sauce is a bit sweet and for my own personal taste requires a dash of salt.", "author": "L H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Pizza  was great! There was 8 of us we order two small pizzas and 1 large! It was perfect!", "author": "Vernizy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-19", "description": "I expected so much more from all of the reviews and hype surrounding it. Growing up in north jersey, I guess I was pretty spoiled when it comes to good pizza. Don't get me wrong, the pizza wasn't bad, but it definitely wasn't the typical New York pizza I grew up with.", "author": "Chrissy K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}