{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-05", "description": "I had half Margherita and half White pizza with additional toppings.  It was good.  The dough was good quality.  The pizza was really thin and I was satiated but not overly full after eating three slices.", "author": "J P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "We were doing an unplanned visit in Dumbo Brooklyn on a Saturday morning. Walked passed Juliana's Pizza and saw ppl waiting for it to open. We decided to get on line as it was not too long at the moment. Well I'm glad we waited! The pizza was REALLY GREAT! It was thin slices with tons of flavor! The staff were friendly and we truly enjoyed our visit. I would highly recommend anyone to try it if you are visiting Dumbo.", "author": "Tak C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "Been living in NYC for about 6 months now and this is the best pizza I've had in New York thus far. Definitely worth checking out!", "author": "Alex G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "I went to Juliana's the day after I had Lombardi's. So what is this, my second real New York pizza? Four stars cause I'm saving my five for a pizza that truly gives me a foodgasm.\n\nGoing here gave me one of those divine realizations as to why New Yorkers are known for folding their pizza. Before, (I'm sorry) I scoffed at this practice. \"You eat it faster!\" I'd say. I'd grumble, \"Makes the pizza too thick!\" But when the pizza is so thin... as it was here and at Lombardi's... it becomes a necessity. Cause the thing is just too flaccid to--- er. It gives the pizza some structural integrity. So now I'm a fan of the fold!\n\nIf you're lucky, go sit at the bar. There are five magical seats there that give you a front row view of the guys \u0026 gals preparing your pizza. For coziness' sake, they even have the names of your pizzamakers on a little chalkboard by the oven. One man even threw the dough to his coworker, who proceeded to spin and thin it out. If you watch him long enough you can anticipate it and get you slow-mo Snap ready.\n\nFiancée and I ordered a large half-white, half-margherita with pepperoni (Small and large both have 8 slices, btw!). At first I grumbled to her for picking such a basic topping but this pepperoni was far from it! This ain't your grocery or chain variety. This one's special. So judge not by the name and try it, at least. Margherita ended up being the preferred side (sauce was so right... and it looked mouthwateringly delicious), but the white pizza was good too (garlicky but good!). They take card too, so no need to seek an ATM! Only bummer was the size of the Coke. It came in a super tiny bottle. Great if you're tryna watch your calories. Not great if you're trying to down four pizzas.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-29", "description": "Came here for the second time and very much not pleased with their service! There was this tall, blonde waitress who served us and has such a bad attitude! Like seriously lady! That's not how you serve your customers! \nLast time I liked the pizza. But this time it wasn't even as good! Honestly, mostly unhappy about the service! No matter how much of a bad mood you are in, you are supposed to treat your customers well! Her face expression was horrible! And she wasn't even willing to refill our water glass! Like why you being cheap with water?!! \n\nI am not gonna say anything about the long wait both inside and out because I get they are busy.", "author": "Rose L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Hype, Hype, Hype. Believe it this time!  As you approach Juliana's you must make a decision, do I go with my first instinct or change my mind and go to Grimaldi's.  I had been to Grimaldi's when it was located in the Juliana's location, so there was not hesitation from me as to where I was going to eat my pizza. Excellent choice by me!!  Read up on the story of Juliana's and you will understand.  This is the original, original between the two locations. The pizza was amazing, just the right amount of flavorful sauce, the right amount of fresh cheese and thin and crispy. What else do you want from your pizza? Is it the best pizza I have ever had?  Well, maybe as I ate a large pie all by myself!  Go and enjoy your pizza (WORTH THE WAIT IN LINE, even though I got a seat at the counter with no wait) and then come back and go two doors down to try Grimaldi's, you will see that I was right.", "author": "Jerry F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "My boyfriend and I came here last Sunday and had a really good pizza. There was a line as usual, but I don't think we waited more than 30 minutes. When we sat down we had a fantastic server who took our order quickly since he sensed how hungry we were. \n\nWe decided to go with the margarita pizza on 1/2 and the white pizza on another half. It was a great choice! The pizza came out very quickly and it was absolutely massive. The margarita had a delicious tangy tomato sauce and just the right amount of mozzarella, although the one thing I would do differently next time would be to ask for more basil. The white pizza was great and I loved how it wasn't greasy at all. We also ordered a chocolate egg cream per their waiters recommendation and really enjoyed it. \n\nIt was great pizza, I don't feel like it was anything but I couldn't get at another Neapolitan pizzeria, but it was worth the experience.", "author": "Hailey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "THE BEST Pizza ever made! I didn't get to try this place on my first trip to NY so I made it a goal to come in the second time around and wait as long as I had to. Thankfully I didn't wait more than 10 minutes and the pizza exceeded all expectations. A small is more than enough for 2 people, they're pretty big pizzas. When I came in, I honestly have to say the pizzas didn't look appealing. When my mouth got a taste of it, I couldn't stop!!!!! I'm craving this pizza ever since  \n\nI'm so glad I came here! Best pizza I had in NY by far!", "author": "Saily L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "A tip if you don't want to wait in line - order a pizza to go and it's usually ready within 10min.  We usually do that whenever we crave pizza, and it's convenient since we live minutes away. But for people who don't live around here but don't want to wait for over an hour, just order it to go and eat it at Brooklyn Bridge park, which is steps away. Yummy pizza and great view, you can't beat that.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "This is a must go to place. The line looked long but the service is quick. After dinner we walked it off on the Dumbo Bridge. Pizza around really good. Service thumbs up. Customer service outside kept us entertained.", "author": "Robert L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "I was a little iffy about trying out New York pizza because it was quite similar looking to Italian pizza, which i am not a fan of. After watching so many vlogs and reading many reviews, we settled for Juliana's, and boy were we impressed. The pizza here is amazing. It's nice, and fluffy, and crispy. The dough is so good. We ordered a large margaritte pizza, and added sausages. To accompany this meal, we also added a salad. The bill came out to 47$, super pricey, but it was definitely that good. The line is quite long, so I recommend coming on the weekday or off hours.", "author": "Alysa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Definitely One of the Best Pizzas I have ever had!!\nMy fiancé and I Waited in line for about 20-25 min. The inside of this restaurant is quite lovely. What I really enjoyed about this place is that you don't get seated with random people on a table! That place was crowded and outside was a long waiting line. Still we got to seated just by ourselves. That doesn't happen in all the restaurants unfortunately. So that's a big thumb up!!\nNow back to topic...\nWe ordered the Meatballs as an Appetizer and a Peperoni pizza with sweet Onion.\nThe Meatballs itself were okay, the sauce of it was fantastic!\nNow I get pretty serious when it gets about Pizza but That pizza was to die for! The crust was crunchy and soft at the same time. The pepperoni tasted delicious. My fiancé and I enjoyed every single bite of it!\nWe will definitely come back to this delicious Pizza place!\nI highly recommend that place", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Great margarita pizza.  Crust is thin and perfect.   Cheese and mozzarella are perfect amount.   Small pizza enough for 3.", "author": "H L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "This is the mother ship for great coal-oven pizza. Treat yourself to the best. Resistance is futile!", "author": "George K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "I had the #6 with chicken and guacamole. It was fantastic. I sat at home the bar and watched the magic happen. They have a great wine selection but I went with the Peak Organic IPA, a perfect pairing. Fernando was my waiter and he walked me though for the perfect meal.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "I've been here several times! After my first time, I brought people here and they all love it!\nHand down one of my favorite pizza spots in NYC!\n\nFood: My go-to option is margherita pizza. \nI always ordered the $19 large pie w. 8 slices to share. The pizza is great! The slices are thin. I find myself grabbing more slices than I would at another pizza spots (probably because it's tasty and it's not too oily). Love the mix between the cheese and the sauce. It's a unique taste. And it's freshly baked in the brick oven.  \n\nOther: There is no wait in the afternoon and hours before sunset. I always see a forming line when the sun sets around 7-8pm. And in the evening hours, Mr. Grimaldi is there himself to help seat customers and serve them. It's great to see him working and greeting customers himself when he doesn't necessarily have to. This place has great service. I always leave the store with a satisfied stomach. Definitely should try! \n\nP.S. The store is located near Dumbo and the Brooklyn Bridge. Great area to go sight seeing before/after pizza.", "author": "Olivia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "I love this place. Everything from the location, wait staff, and of course their pies were absolutely outstanding! Now I know what the big hype is about.\n \nAfter reading other reviews I feel like a lucky gal for not having to wait for a seat here! After a pseudo-early morning stroll along the Brooklyn bridge and promenade, I worked up my appetite for some classic nyc pizza. And it's just my luck that this amazing restaurant was right up the road! I was dining solo this visit and felt that I was very well taken care of. I asked my waiter what pie he recommended and he mentioned that the Margherita was a customer favorite that you can customize to add additional toppings to (it's a bit pricey so don't go overboard). The toppings I got were the meatballs, arugula, and garlic. Because I seemed to have beaten the lunch rush, it didn't take long for my pie to come out. Oh, and did I mention the size? A medium pizza will definitely feed 2-3 adults. I managed to devour 4 large slices before I threw in the towel and asked for a take-out box. The pizza itself was delicious. The crust wasn't too thin, their homemade meatballs were a very good recommendation and the cheese they used to make it was amazing. NYC pizza shouldn't be underestimated, there's a reason why it's so overhyped and the \"you gotta try it!\" statement has held true for so many years. I really want to take my friends here just so I can eat here again. The $30 pricetag didn't seem too bad since I had leftovers that lasted for several days.", "author": "Becky M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Juliana's Pizza is the cream of the crop when it comes to Brooklyn Pizza (best in States). Traveling to New York for a solid pizza? Go to Juliana's. Want to try the original Grimaldi pie? Go to Juliana's. Awesome family estabalishment, quick service, great food.", "author": "Nicholas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "I understand how this place has almost 5 stars on Yelp! \n\nThis place has amazing service \u0026 amazing food! All around a great place for pizza. It was my first time trying NY pizza and I was definitely not let down.\n\nI got half a half white sauce and half red sauce pizza and my friend and I devoured it! It was so good :-)", "author": "Stacy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "We had already decided we wanted to try this place while visiting NYC from California. We arrived just before noon before we were starving and got in the line outside. It moved surprisingly faster than I anticipated and we were seated as a party of 3 ahead of a quite large group in front of us...it is a small place. We sat at the bar-which was so fun to watch them making all the pizzas. We shared a small DELICIOUS pizza and still had one slice left! While in the restaurant my daughters were looking at their Polaroid photos and accidentally left one on the table...as we were walking down the block one of the employees ran to find us and return the photo. What excellent customer service and amazing food!!", "author": "Ellen A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}