{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "6 of us lucked out in avoiding the line completely by taking the outdoor seating that perfectly fit our party. The waitstaff were extremely accommodating (sun was in my eyes, so they lowered the awning for us) and super friendly! And the pizza. Holy mother of all that is good when it comes to thin crust pizza...this. This is the jackpot of perfectly flavored sauces, expertly tossed thin crust, and lavishly mozzarella laden pies. Coming from a pizza snob with a North Jersey childhood and higher expectations than most, this is...hands down, the best pizza I've had in the States.", "author": "Rebecca E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-14", "description": "The owner was basically the host. I'm from California and if this is the best pizza I've ever had, I'm a little shocked. Staff was absolutely great tho. Too bad you can't get a 1/2 n 1/2 specialty pizza which is what we wanted. But after a walk over the brooklyn bridge, great stop for pizza. The best? Send me a message and i'll give you my personal opinion.", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "We ordered the meatballs, the arugula salad with goat cheese and walnuts, the white pizza and the pepperoni. Seriously amazing. The service was outstanding and even though it was pretty busy, we got our food in a reasonable amount of time. So good!!!", "author": "Miranda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "BEST PIZZA IN THE AREA!\n\nNo matter what borough you live in, its worth the trip AND the wait! The owner is very polite and Patsy Grimaldi can been seen walking around making sure everything is to his standards. This last visit I had the chance to talk with Patsy for a while and I can say it's great to see a man carry that much passion for his craft after so many years.", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Great service!! Great food!!! The staff goes above and beyond to serve you. It's delicious.", "author": "Caroline O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "Okay, soooooo I'm far from a pizza connoisseur. I don't really know what amazing pizza tastes like. However, the #1 here is very good, and the atmosphere is stereotypical new York Italian pizzeria. Lots of Italians, people throwing the pizzas in the back, and the original owner \"Old Patsy\" was letting people in and going around talking to the tables. Super friendly gentleman. It's a fun place to go for pizza. Just don't come on a weekend, or if you do come earlier.", "author": "Shane W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "Holy pizza. Juliana's is the real deal. Hyped up pizza places tend to be let downs for me. I mean, it's just pizza, right? \n\nJuliana's is...life changing pizza. We ordered the margherita -- the crust was thin but still chewy, and I thought the sauce:cheese ratio was perfect. The tomato sauce tasted so unbelievably fresh. \n\nI seriously can't stop thinking about this pizza. Ajfjdhjwjhdh so good.", "author": "Stephanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Awesome.  Go here!  Don't wait in the ridiculous line next door.\n\nHaving been to both joints, I would most definitely recommend Juliana's.  Something about Grimaldi's ambiance just seemed rushed and cold, even on the fairly quiet Thursday evening that I went.  Also, they ain't got this fine specimen of a man named Patsy walking around and making everyone feel welcomed.  Service and food were great at Juliana's, and it's that much closer to the promenade for an after-pizza-inhaling stroll.", "author": "Nisa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Ordered a pie to go since I couldn't wait for the one hour.  Guess what ,  take out order was also an hour wait.  Pizza was lukewarm when I picked up (delayed by park visit).  The front desk girl was able to reheat it for us.  Nicely done!  Thank you.", "author": "Jim W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "The pizzas were wonderful here. We ordered no. 1 and no. 4. Both were super delicious and worth the long wait.. The only only down side : the aircon was too cold with the fan blowing to the maximum. Yes - it was very hot outside but with the strength of the fan our pizza became less good after the first slice (cold pizza obviously isn't as appetizing vs. warm pizza). The service was average. The ambience was hmmm ok (small place crowded by people). But hey, we came here for the pizza. Hence, we didn't mind average service and crowded small place... Will certainly come back when we visit New York. After all, people of Brooklyn frequent this place too - not just tourists.....", "author": "Melany S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "I've had Grimaldi's many times, but Juliana's pizza taste a lot better. Owned by the same people but totally different experience. Grimaldi's is just more popular among tourists. Juliana's had a wait of 20 minutes on a Sunday afternoon. While the line for Grimaldi's was ridiculously long. My fiancé and I sat at the bar area (you can see your pizza being made). Best seats in the restaurant and our waiter was very personable. The pizza is a bit more expensive than it's counterpart, but well worth it.", "author": "Ro-Ro J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "I visited Juliana's for the the first time last year and it was so good that I had to take my friend there when we were there for her birthday. We were there on a Sunday afternoon, and the line was a lot shorter than I remember. In 20 minutes, we were seated and had ordered our pizza. Juliana's has my favorite kind of pizza, thin woodfire pizza with a soft crust. We ordered just a basic pepperoni, and we were very happy with our decision. The sauce is delicious and anything you get on top would be delicious. I definitely recommend waiting in line here since you won't be disappointed when you sit down. It is a small restaurant, but the service is fantastic and they have a wide variety of pizza options.", "author": "Saacha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Juliana's is a small room crowded with tables with people enjoying a fantastic meal. What a pizza! Now that I am back in California I will be thinking about this pizza and dreaming about that day I can head back East for another slice.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Vishnu bless this place... The best pizza I've ever eaten! The experience was really awesome, drank Brooklyn beer and ate pepperoni pizza, you can't go more Brooklyn than that!", "author": "Micah T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "After reading all the reviews and it's history, we decided to check out Juliana's and it was so good! We had their #4 specialty pizza, tomato, mozzarella, arugula and prosciutto - and it was delicious! The ingredients, specifically the prosciutto was so fresh and delicious! And the dough was cooked perfectly, not too soft or burnt and deliciously chewy. We ordered their caesar salad to start, it was nothing out of the ordinary, (and I have had my share of extraordinary versions).  We got there on a Saturday and we got to the line 15 minutes before opening (11:30am) and there was already quite a line (but luckily we were still the earlier ones because we managed to get a seat without waiting upon opening) and the place is cozy. It got busy very fast. We did end up waiting quite a bit for the pizza to arrive, we can see all the take-outs being made between dining orders. The service is quick to respond. Overall it was a great pizza and a great dining experience that is recommended to try if you happen to be in Brooklyn!", "author": "Yo L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Great atmosphere, good customer service! Got there right as they were closing for a break so had to wait in line for an hour before they reopened. It was worth it! We got the calzone and for just two people it was a lot... Definitely would go back if we're super hungry!", "author": "Lincy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Had to wait in line to get into this great little restaurant under the Brooklyn bridge! Pizza was excellent and the Caesar salad was one of the best!!", "author": "Yvonne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-17", "description": "Glad to see Yelp got it right here. Juliana's is far superior to Grimaldi's. Their service and atmosphere is just so much better. Grimaldis is a dungeon with plastic forks and paper plates and not even a salad on the menu. Juliana's is a pleasant place to be and the owner is a sweetheart. The pizza is just the icing. Delicious.", "author": "Karen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "Juliana's really is a wonderful restaurant. The pizza is very good and the atmosphere is friendly. Only issue is the 20 minute wait you might have to endure before you indulge your belly. But its worth the experience..", "author": "Randi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "I was expecting good pizza when visiting NYC but this was the best pizza I have ever had. We sat at the bar where we could watch the pizza getting made. There is a dedication to the craftsmanship that was so fun to watch. I would highly recommend the #4 with prosciutto and arugula. Washed down with a Brooklyn Lager, this was a meal to be remembered.", "author": "Seth L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}