{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "This is our favorite spot to grab pizza when we come to NYC. Totally worth the walk over the Brooklyn Bridge and back!", "author": "Crystal G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Stumbled upon this place when I was looking for good pizza in New York and I read in the previous reviews that this is actually by the original owner of Grimaldi's. The service is superb and everyone is really nice. It's really clean inside and the pizza is sooo good. I wanna say it's better than Lombardi. Huge plus is that it's cheaper too", "author": "Vanessa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Was definitely worth the trek through the chilly rain on a windy Sunday afternoon to Brooklyn. \n\nDespite the line and the full house, seating was quick and service constant. \n\nThe meatballs are a decent size, in a sauce worth holding on to for your pizza after. \nThe pizza came steaming hot right out of the oven and was good enough that two of us ate the entire small pie (16\") minus one slice after eating meatballs. \n\nIt was a hard to choose from their menu with so many delicious sounding options, so there will be a repeat visits for sure.", "author": "Kimberley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "We went on a Fri night around 7pm when the lines were still forming. The manager came out to direct the line to make sure it was not blocking other stores in the area. The only annoying part of lining up was in front of a group of Jehovah Witnesses. The leader of the group even went so far as to hassle the manager for a discount for their group of 15ppl. Even though the manager told her, it would not be fair since he would also have to extend the courtesy to other faiths- Catholics, Muslims, etc. She was very persistent and proclaim, they were big supporters of their business. And add as a reminder that they're neighbors next door. Jehovah Kingdom Hall is also located across the street from them. Nothing personal against the faith. It's experiences like these that really ruin it for local businesses and establishments. I would suggest to other organizations- religious or not, please don't ruin it for locals who are looking forward to trying out the place.  \n\nJuliana is voted as the nation's top ten pizza while Grimaldi didn't even make it on the top ten list. Most tourists get confused and opt for Grimaldi's instead of Juliana's when it's the same chain founded by Patsy Grimaldi. Except he did sell the store to a different owner. Juliana proudly display Founded by Patsy Grimaldi on their window sign. Patsy named his store after his mother. Personally, I've dined at both and honestly, it taste the same. I did recall Grimaldi's being a bit more burned though on the crust. Except the secret is the lines are much shorter at Juliana's compared to Grimaldi's ridiculous line down the block. Same soft, thin crust charred from the oven coal fire and delicious toppings. We had their signature Margherita with sausage and mushrooms. What makes Juliana stand out is \"they source their ingredients from nearly 30 different suppliers from local and international, and almost all are \"specialty\" operations\". In addition to special pies, Juliana also offers several salads to be paired with wine and beer as well as desserts. For DiFara fans, although Juliana is a different concept whereas DiFara is more old school. Many don't realize that DiFara has too fallen into that stardom trap. Hence, their increased pricing for a slice. Prior to the hype, it was $2.50 a slice and steadily climb to $6. A whole pie cost $32 and expect to wait 30 mins just to enter the place. Not including another hr or more for placing your order. Thanks to the popularity among the tourists, hipsters, and yuppies. Nobody has time for that nonsense. \n\nWe definitely plan on returning with our daughter next time. Def recommend the outdoor seating for families with babies/toddlers. Unfortunately, the inside premise of Juliana's does not cater well to accommodate families with smaller children. It's a bit too congested due to full seating.", "author": "Linda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "We just moved to New York City from Boston, and it is with great shame that I must admit that this is the best pizza I've ever had.  Over the past few weeks I've sampled about 10-15 excellent places in Manhattan and Brooklyn, but this is the one.\n\nAfter doing some brief reading on the Grimaldi's vs. Juliana's rivalry, we chose to come here, and boy was that the right decision!  The line was quite long on a Sunday at lunchtime, but it moved quickly and we were seated as a party of 2 after about 45 minutes.  The service was quick and friendly, and we had our pizza within 15 minutes.  We ordered a large Margherita with half Kalamata olives and two Coronas...the perfect combination for a hot summer day.\n\nThe pizza.  I don't even have words for the pizza...the crust was perfectly thin and with just the right mouthfeel and charring, the sauce was bright yet not overpowering, and the mozzarella was perfectly balanced and chewy.  Before going into the oven, the pizza was lightly sprinkled with Romano cheese and oregano and finished with a drizzle of olive oil.  It truly was the perfect pie (I can't believe I'm calling them pies...what has happened to me?).\n\nA tip: sit at the bar/counter if you can.  You have front row seats to the pizza production line and it was really neat to watch them assemble our pizza from scratch.  I have never seen anyone so meticulously do *anything*.  Each topping was placed in just the right spot...it was like watching an artist work their canvas.  In fact, when there was a mishap in the oven and our pizza got a bit folded over, they made a new one and got it back into the oven within about 30 seconds.  This place truly has the science/art of pizza-making down.\n\nDon't even think twice about coming here.  You will not regret it, although I now regret having betrayed my home city.  Forgive me, Regina's and Santarpio's!", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Excellent pizza done right. The pizza oven heats the entire restaurant, so dress in layers if you come in the winter. The crust is as close to perfect as it gets.\n\nDon't be put off by the line. Just grab some gelato next door for the wait and you will be in before you know it..", "author": "Anthony K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "One of the guys in our group went through the entire explanation of how Grimaldi's became Grimaldi's became Juliana's but there's still the other Grimaldi's....and it made about as much sense to me as that sentence just did to you.\n\nThe place is crowded and packed, although the line still pales in comparison to the Grimaldi's down the block. We did our order for takeout, and it was not without some waiting and delays that we managed to get our two pizzas.\n\nOne thing to note, as far as being transportable goes, Juliana's pizza bags kind of suck. Don't do a takeout pizza unless you're taking it very nearby.\n\nWe got talked out of doing a fancier pizza by the same guy who told us the Grimaldi saga and ended up with a cheese pie and a pepperoni pie. Both pies were delicious. Great crispy crust, wonderful cheese-to-sauce ratio, and the sauce was one of the best I've had on NYC pizzas, both tangy and sweet. The pepperoni  slices were small and just slightly scorched, which added a nice chew and extra flavor. I will note that the pepperoni pizza is a grease bucket; you can tilt a pizza slice and literally watch the oil drip down. But then again, what do you really expect? Basil is a nice touch too.\n\nThe bottom line here is that the pizza is excellent. So yes, make sure you check this one off your NYC pizza list.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "I have been on a pizza binge lately. Since this was rated as the top pizzeria in America, I decided I had to check it out. Parking in the area was very difficult so we decided to get take out instead. We ordered the #1 with Mozarella, pancetta, scallions and white truffles in olive oil. We also ordered the Margherita pizza which has Tomato, mozarella and basil. The two smalls was enough to feed 3 people. We were stuffed! I really liked the Margherita pizza. The thinly sliced pizza was coated with just the right amount of sauce and cheese. I thought the #1 was okay. It was slightly too greasy for me. \n\nThe place is right by the water so it was nice to grab some ice cream in the nearby ice cream shop as we waited for our pizza order.", "author": "Sara Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Great pizza. One of great favorites in manhattan. A must go because it's tradition and the Brooklyn bridge view doesn't hurt either. It's near a bunch of shops and other restaurants and right by the bridge. The space is small but it is quite intimate and a nice place for friends or family. A must try if you're in New York.", "author": "Farah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "I lived in Brooklyn for seven years and it was my second time back since then. During the first trip we at some pizza place in Soho and I told my partner there is nothing like a Brooklyn slice, so this time we we went with my idea. The location is gorgeous, with views of the pier and the bridge. The place was packed on a Tuesday so that means your in the right area. Service was awesome and fairly quick considering that there were PLENTY of mouths to feed. Anyways, it was the best pizza I ever had, we got the margarita and added pepperoni and extra cheese on it (kinda odd choice I know). Fresh, fresh, fresh, oh lord it was perfect. Crust was not to thin, good amount of sauce, no complaints at all.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "***SEE MY REVIEW OF GRIMALDI'S FOR THE COMPARISON***\n\nGiving Juliana's the five stars it deserves makes me want to go back and remove stars from everywhere else I've given five stars to because nothing compares to Juliana's. The margherita pizza was the best thing I've ever tasted. I ordered a large pizza (ate 4/8 slices by myself, as a 5'2\" slim girl because it was that good) and ordered 1/2 margherita, 1/2 white pizza, so I could try both tastes. The white pizza was good, but not out of this world. The margherita pizza, as I said, was the best I've ever had. I didn't add any toppings because I like to try the unadulterated plain tastes -- I think it's the true telling of a good pizza. The margherita pizza was so good that I'm a little bummed I ordered 1/2 white and not a full margherita, but oh well, now I know. \n\nI've never been to Grimaldi's, so I can't partake in that debate, but I chose Juliana's over Grimaldi's because Patsy Grimaldi runs Juliana's. Patsy used to run Grimaldi's, but ended up selling it to a customer who now runs it. Grimaldi's, to be fair, uses the same cheese as Patsy did when Patsy ran it, so I'm sure it's still really good, but it's not the original Patsy Grimaldi's place. Further, Juliana's is located in the original Grimaldi's location (same coal oven too). The current \"Grimaldi's\" is next door -- they were evicted at one point. It is not in the original Grimaldi's location. \n\nBased on what I've read, Grimaldi's is cheaper, the large pizza is larger, but it does not sell beer or wine. Grimaldi's is also cash only. Juliana's is more expensive, serves beer and wine, and accepts all major credit cards, including American Express. Grimaldi's apparently has more of an old Brooklyn NY feel. Juliana's ambience is more modern (and may I add immaculately clean). Grimaldi's staff, including the guy monitoring the long line, is apparently very rude and gruff. Juliana's staff was amazing! From being polite at the door to making suggestions to bringing my food immediately to checking up on me several times, I have nothing but great things to say about the staff. I also sat where I could see the pizzas being made. You can even see the coal in the oven. I gave more than a 20% tip because I saw how hard they work and they do a great job. \n\nJuliana's closes for 45 minutes from 3:15pm to 4:00pm every day to clean the coal oven. I got there around 2:20 on a Wednesday and only waited for about 5 minutes. My food was very quickly prepared and I literally saw it come out of the oven, get cut, and brought directly to me. It was piping hot. \n\nI didn't have room for dessert, unfortunately, but hopefully next time!\n\nHonestly I'm not sure I can eat pizza anywhere else after eating the margherita pizza here. Can taste a hint of char, firm bottom but not overly crispy, chewy enough crust (but not too chewy), and love the oil! But of course it's not grease. So good!\n\n***SEE MY REVIEW OF GRIMALDI'S FOR THE COMPARISON***", "author": "Jane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Waited about 20-30 min for a party of 4 on a Wednesday around noon. Once we got in, it was well worth the wait. We went for the number 1 and were pleased. I wished they let you split the pizzas because I wanted to try the #3 but they are strict with no substitutions or changes (even 1/2 and 1/2). That's the only reason I give it 4 stars. Most people around us got pepperoni pizzas so I think they are more well-known for that. Otherwise, love the thin crust, fresh pizza!", "author": "Shadi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "Had the #4 special with arugula and prosciutto.  It's amazing pizza - the crust was perfect, and the sauce was loaded with flavor. There are really 3 major things that pizza needs to have to be successful, and those are the crust, the sauce, and the quality of the ingredients. Juliana's checks all those boxes.\n\nAre they better than Grimaldi's? Of course they are. They're also just about twice the price. That's one reason why they don't get a 5th star. Even if I lived in the area, I don't see myself getting Juliana's on a regular basis. Another minor gripe is that their takeout pizzas are packaged in bags rather than boxes, and as a result they get cold much faster. I get that you really shouldn't get this kind of pizza to go, but if they're going to have a takeout option they should do it right.\n\nVery, very good pizza - but not the best in the country. That honor still belongs to Forcella, or Sally's in New Haven.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Good pizza we got half cheese and half pepperoni. went around 8ish at night and got seated pretty quickly.", "author": "Sky P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Line up the block to get in on the weekend as they open. We just made it. (Literally were last seated for first seating and another line continued to build as we were eating). The pizza was tasty, as was their Caesar salad. Good selection of wine and beer. I don't know if it's worth waiting down the block for, but if there's a table available definitely worth a visit!! A great NY slice with perfect balance of crust, flavorful sauce and cheese.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-26", "description": "Not sure what all the hype is about. Truly ordinary coal fired pizza. Sparse on sauce.  Crowded with long wait.  Much better coal fired pizza at Johns or Patsys in the City.", "author": "JJ T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "It was an honor to finally come here. I had the chance to come here during the summer for the first time ever. The wait however, was approximately 1 hour and 30 minutes. That did not discourage me into coming in to Juliana's. It was exciting by knowing that I was actually going because I have been wanting to try out this place since the dawn of time. \n\nOnce I was able to go inside, this place was really packed because it was on a weekend during lunch hour. Seeing how the environment is inside is really nice, and how fast paced it is. I ordered a large margherita with pepperoni to share with my dad. It didn't take so long for it to come despite how crowded it was", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Pizza is delicious. Personally i prefer brick oven over coal fired pizza. Even so, the pizza smells and tastes delicious. However, i do not think it is worth the long line outside. If the line is small, go in. It is a staple to come here before or after walking the brooklyn bridge, but i do not think its worth the long wait on busy days.", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "The place himself is small but they make sure you have plenty room in your table, the customer service outstanding, the owner is checking the tables and making sure everything is perfect and greeting customers, and the pizzas.....best pizza I ever had in my life!!!!! A little pricey but soooo worth it!", "author": "Mary M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "I found the perfect pizza for me, a No. 6. My date found his perfect pizza, a No. 4. Unfortunately, the specialty pizzas have no changes, no exceptions. So we ended up building our own pizza trying to recreate the specialty pizza to very little effect. The pizza was delicious, even though it wasn't the \"perfect' pizza,  but I can't dock the restaurant for that.\n\nWhat I can dock is the wait and the ambiance. It was annoyingly loud and hot inside the place! We had to yell in order to hear ourselves talk and any table that wasn't immediately next to the door felt boiling hot. I get that it's difficult to temperature control in the NY cold and fire burning oven, but it was just uncomfortable. I'm glad I've been to the establishment so I can check it off my list, but I probably won't be coming here again.", "author": "Kimberly C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}