{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "We choose this place on our walk in Brooklyn and it was wonderful. When people are lining up before it opens you know its going to be good! 10 minutes later we were seated inside. We ordered a small Margherita pizza with pepperoni , peppers and mushrooms but were given the large(plenty for two hungry souls). It was actually large for two and really delicious and nothing short of what I was told to expect. We really enjoyed this place. A little on the pricey side but who cares - it's worth it!", "author": "Veronica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "definitely a must try if you are in DUMBO. There was a line out the door on a random wednesday afternoon but surprisingly the line moved quickly. the interior is relatively modern and casual vs the more dated grimaldi's next door. the ac was also nice and cold which is helpful on a hot summer afternoon. just the way we were seated and given menus made me feel welcome and that my business was welcome. truly a refreshing experience. super small menu. got some meatballs to start. it's 3 large meatballs in nice marinara sauce. for the pizza, we got a small margherita pie with cremini mushrooms. pizza came out within 10 minutes. appearance: hand-formed pizza that is a little bit uneven (read: not perfectly symmetrical). super thin and crispy crust with a slight char to it. it is delicious but since I am a coney island kid, I will have to side with Tottonno's as my favorite coal oven pizza. Lombardi's is # 2 on my list. I'll make Julianna's # 3. Grimaldi's #4. john's of bleeker....no soup for you. but make no mistake, this is an awesome pie. the sauce on the pie tasted pretty vibrant. not sure what they use, but I imagine it's san marzano tomatoes a la grimaldi's.  the small is good enough for two people. listen, the food is a little overpriced for what it is as with all these coal oven pizza places but this is a destination. bring your friends. you won't be disappointed.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Place had a long line outside. Waited approx 20 min to be seated. Not a huge selection on the menu and a little pricey for pizza, but... pizza was REALLY REALLY GOOD. I can see what the hype is about. Not the best pizza I've ever had, but it's up there.", "author": "Mey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "I'm not a consistent pizza eater. Especially being someone born and raised in the SF Bay Area. We had decent size group of 5 people. We stood in line fo about an hour. Weather wasn't too bad. \n\nWe decided to sit in the outdoor area. Our waiter was cool hip ass dude that was definitely an expert on the food items.\n\nWe ordered a margherita pizza with half of it having meat balls. As well as a marinara pizza to accommodate someone who usually don't eat cheese, and doesn't like white sauce. Yes I know. \n\nThe margherita wasn't too strong in the basil department but everything else was well balanced! The cheese wasn't too cheesy/oily tasting. It was more refreshing. \n\nThe marinara pizza was on point. I believe it had garlic on it which completed the pizza. \n\nWe decided to get another small pizza along with red wine cause we're bougie like that. \n\nOverall it was a great dinner. I suggest getting a bunch of small pizza rather than a large. We saw large get ordered next to us and we were like \"HOLY SHIT! Mmm NOPE!\"\n\nGreat place for dates if you're willing to go through a decent wait time. I spotted a few tinder, bumble, coffee meets bagel dates that weren't going so good but their stomachs seemed happy! \n\n\nMy next trip to NY, DUMBO I'll def visit here again.", "author": "Huy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Finally got around to trying Juliana's, rounding out my list of Patsy/Grimaldi/Patsy Grimaldi pizza places. I have to say it's the best of the bunch. Dough's nice and chewy, light enough for those pizza bubbles (which are the best part in my opinion). Mozzarella is flavorful, and the pizza overall isn't too salty (unlike some place next door). It's not your local dollar slice spot, but you knew that walking in. Bonus, works well on the reheat if you somehow have leftovers to take home.", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "My bf and I decided to take a drive out to Brooklyn in search of One of those. I happened to remember seeing Juliana's during last summer on numerous occasions while visiting the Brooklyn bridge area and I was like we have to go there tonight! \nWe got there around 9pm, parking can be a little hectic but for a Monday night all it took was about 3 tries around the nearby blocks. When we walked up to Juliana's of course there was a line (there's always a line!!) but luckily we were the 3rd set of people in waiting and within 10mins we got seated ( I was so frikken excited) mind you I always tell people \"I'm not a fan of pizza.\" Well since that night my whole life has changed lol all I think about and dream about is Juliana's Pizza (of course I'm being dramatic) but seriously this is life changing pizza! \n\nMy ratings are as follows:\nCrust-10/10\nSauce-10/10\nTopping (pepperoni) -9/10 I felt like for a large pie needed more pepperoni\nTopping (Sausage) -7/10 I wasn't a fan of the sausage at all but my bf and I still devoured that cheesy goodness within 10mins ‍\n\nP.S I forgot to take a proper pic", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "No doubt this is amazing pizza and far better than Grimaldi's. However, I don't think it's significantly better than NY Pizza Suprema or other by the slice places I've been too. We came almost at closing and still had to wait! It was a fun thing for my sister who was visiting from LA but I wouldn't make a special trip to come back.", "author": "Jane H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Brooklyn Pizza!! \nWow!! Looooong lines for Juliana's Pizza in the raining evening.... We gave up waiting line and takeout Pizza instead!! Since we stayed really close @1 Hotel Brooklyn!! \nWe takeout Salad and Half Margarita and White pizza with prosciutto!! \nPizza was pretty good but I wouldn't want to wait over hour for this pizza. I know better pizza places in Japan!!", "author": "Maki K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "We are always on the journey of finding the best pizza in NY.  You could pizza everyday and not get through every shop in over two years.  But, believe the hype here.  This pizza is the best we've had.  It's pizza that doesn't make you feel like you just ate pizza. Lol.  The sauce is so good.  You can taste the separate flavors in it.  It's not muddled.  Plenty of space to eat inside, but it will get packed with a wait.  If it's a long wait, put your name in and walk across the street to the pier.", "author": "Jeremy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Visiting New York, we decided to walk across the Brooklyn Bridge one morning. It's a fun walk over to Brooklyn with great views and you are definitely checking off a \"Must Do\" when in NY. So it spits you out on the other side of the river and that's where our plan kind of ended. Let's do the Brooklyn Bridge! But we were now across expecting something to be waiting for us but it's just more city streets!  Plus we were now super hungry- at 11:20am. \nSo we check our Google map to discover we landed in \"Dumbo\". Funny name. Then we pop on Yelp to find a place to eat. I'm scrolling options as we walk. Right in front of us is a place called Julianna's and people are starting to form a line outside. Reviews looked great so we jumped in to the fast forming queue. Only a 10 minute wait. \nAwesome! Coal fired ovens made these pizzas that had a fantastic crust and char. It's one of those quintessential NY restaurants that you feel has been there forever. \n\nI could go in describing the food but it's pizza and it's really good. It's a fun destination to walk to and the river is just down the street to stroll after you eat. \n\nPut this on your to do list next time in NYC.", "author": "Greg H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "Got the margarita pizza...unfortunately it didn't live up to the hype. Expected a lot more. Would have preferred Joe's pizza over this. Decent, but not great and def overpriced. 19 bucks for a small pizza. Long line as well", "author": "Natasha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "If there is a line there is no need to wait. \nThere are way better pizzas in the city than this one.\nIt is overpriced and overvalued.\nThere are not many pizza options.\nOwner is kind and welcoming.", "author": "Emre P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Heard that this place is always packed so we came on the dot when it opens on Sunday. If you wish to come at a later time, 12:45ish might also be good since the first wave will be done. \n\nWe ordered Matt's mix salad, a small margherita pizza and added pepperoni. Note that if you add toppings to half of pizza, they still charge you full price. It was plenty of food for three of us. Glad we came.", "author": "Felicia Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-11", "description": "Unimpressive. Margarita and white pizza were just plain and bland.  Certainly not worth the usual wait time for a table.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "Came here on a Sunday night around 6:30pm. Juliana's doesn't take reservations, so we braced ourselves for a long wait. However, the restaurant gods looked upon us favorably and seated the three of us within 15 minutes of waiting. The staff in charge of seating people was surly, but at least he let us in quickly. Also, I found their system of just queuing for a table kind of annoying during the winter time. \nAfter being seated, a very kindly waiter looked after us all evening. He was more than happy to make suggestions and recommendations for us (even movie suggestions). Really a funny character. \nWe had the calzone and small margherita pizza with half anchovies. The calzone was freshly made, with ricotta cheese and mozzarella oozing out. Simple but delicious. \nThe pizza was also great. Thin crust, with the right amount of cheese and sauce, and the anchovies were a yummy addition. \nThe food was good but not mindblowingly so. We had a great time here due to our lovely waiter. \n4.5/5 for food\n5/5 for service\n5/5 for value", "author": "Su L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "Juliana's Pizza? Forget about it ;)) They know what they are doing. As a pizza lover, I must say this is a place to recommend. At the same time they are little pricey, but I like to think that if you are pricey, at least be worth the extra $$. They definitely worth that. But be prepared, this is not a hidden gem, the lines are long and the wait is there. But totally worth it. Unlike other restaurants and pizzas in NYC where the lines are long, but when you get inside you don't understand why you waited.\nOverall: One of the best. Hope I will be able to come here more often.", "author": "Nolen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Many may think pizzas may taste the same whether it is purchased at a Dominos, Costco, or at a Juliana. Well, that is not the case as your original thoughts on pizza will change when you try Juliana's! \n\nAmazing experience that you can share with your friends, family, and loved ones. We walked the Brooklyn Bridge from Lower Manhattan to cross to Brooklyn. Once we were there, it started to heavily pour rain in which we quickly hailed Lyfts to make it. Despite the rain, the line was pretty long. Our party 8 was eventually seated and off we go\n\nOrdered \n- Housemade meatballs (5/5). Beautiful. The sauce was delicious and it is recommended to cut the the meatballs in halves for easy sharing. I cannot imagine how this would taste if made into a spaghetti\n- Margherita Pizza (4.5/5). Classic tomato, mozzarella and basil style pizza\n- No. 4 (4.5/5). Amazing pizza with tomato, mozzarella, arugula and prosciutto\n- No. 6 (5/5). To die for! Toppings consist of grilled chicken with tasty housemade guacamole and cilantro \n\nBest Pizza in NYC and one of my favorite dining experiences overall. A must try whenever you're in NYC / Brooklyn", "author": "Kenny N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Juliana's seems to be quite popular-we arrived before its re-opening at 4 and there were already people lining up!\nMy mother and I were seated right as they opened and ordered: we both began with our own salads-my mother the Arugula with goat cheese \u0026 walnuts and I the Caesar. Both salads were a great portion for their price and were very fresh.\nNext came the pizza: we did a small 1/2 white, 1/2 Margherita pizza (I appreciate that they allow you to do 1/2 and 1/2!) with mushrooms. Our pizza took a while to arrive, but I think it is because they were waiting for us to finish our salads...too bad I enjoy eating my salad WITH my pizza ;) \nThe pizza itself was delicious, but I will honestly say that I have had better. I loved the fluffy crust...however, what I was not a fan of was the fact that, when I requested a side of marinara sauce for dipping the crust in, I was informed that it would be an additional $3. Really? Most places don't charge for a little side of sauce, so this was a little upsetting and I decided to forgo the additional fee.\nThe location of Juliana's is right at the beginning of Brooklyn near the water, making it a great place for dinner.\nIn conclusion, the pizza and location was good, but certainly not the greatest pizza I've had, but nonetheless quite delicious!", "author": "Brianna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "This is the BEST NYC style pizza in the city hands down and the secret menu item are the meatballs amazing!!! Come the line might look intimidating but it goes fast pizza comes out in about 10 min so don't let it stop you! Also mix it up! Make your pizza!!", "author": "Denny V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "New York white pizza! Ummm yummy! It's a Delicious pizza place around DUMBO area where closes to everything. I haven't tried any other NY pizza so far so it's gets on my favor place at Brooklyn for now @-@. Service is alright.", "author": "Xbo Z."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}