{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Hands down, the BEST pizza I have ever tasted! Nothing in LA can even come close to Juliana's! I seriously dream about the white pizza with mozzarella and garlic...mmmm. Definitely a must to eat at while visiting Brooklyn!", "author": "Marcela O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "Maybe I came on a bad day? I don't know but the pizza here is just ok. Definitely not impressed and honestly wouldn't come back here. I came during the middle of a weekday so only half the tables were full so I had no issue sitting down though I sat at the bar. Ordered a simply  pepperoni pizza with basil and ended up eating the whole thing as I don't have anywhere to take it back with (staying at hotel).", "author": "Dang N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Ah Juliana's...our family's holy grail of pizza, being from the SF bay area. Seriously, the. best. pizza. ever. The bread, sauce, and toppings all yum, yum, yum with 3 double thumbs up. Service was great also. We ordered the margherita pizza with meatball \u0026 sausage, and practically inhaled it. So good! We arrived about 5 minutes before opening \u0026 we were about 4/5th in line on a weekday. We knew we were in for something good when we had to sign waivers because the Food Network was filming.", "author": "Jen Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Luckily it was a nice day to wait outside. And the 25ish minute wait turned out to be worth it! \n\nWe were very hungry so we ordered the baby spinach salad to start, which was delicious and a great kick off to the meal. We then shared a white pizza with onions and roasted peppers. The pizza was big, even for a small. Crust was great, cheese was perfect--the only cons were the unevenly distributed garlic and the scarcity of the toppings. Otherwise delicious!\n\nThe host and wait staff were kind and attentive, and the restaurant, though small, had a lovely atmosphere. I'd definitely come back!", "author": "Carlie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "As an out-of-towner wanting the Brooklyn pizza experience I was NOT disappointed in making this my first NY pizza destination. It was delicious! The crust was perfection, sauce was not too sweet and I got the gooey mess that I so desired in a thick mozzarella. The only reason I give this place 4 starts instead of five is the long wait outside in the hot sun.  A good alternative would be to order it to go or call ahead of time and eat it on the docks!", "author": "Carissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "There is usually a wait in this place... but it's totally worth it. Their margarita pizza is awesome. Desserts are also must try", "author": "Sara S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-23", "description": "I really looked forward to trying this place (I always hit a bunch of pizza places when I make it out to NYC every few years). \n\nThe good: Taste was very good (though the pizza was a bit soggy). \n\nThe less than good: Long wait to be seated (very crowded and this was ~2pm Friday afternoon), really packed dining room (no room for jackets, no space, crowded), pizza was luke warm instead of hot (resulting in a soggy pizza), and service was fairly poor (waitress not around to tell her the pizza wasn't hot). The overall experience wasn't particularly enjoyable so I'm not sure I'd come back.", "author": "Patrick G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "This place is definitely up there with the best pizza spots in Brooklyn.  The line at the door probably says something about the quality of the food here.  I stopped in with the lady for the renowned pie and the margherita pizza justified the hype.  While the seating is a bit tight in here, it's absolutely worth stopping in.  The Brooklyn Bridge park, only a few blocks away, will allow you to catch a beautiful sunset and walk off those 4 slices you scarfed down.", "author": "Colin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "My favorite NY slice! Can't go wrong with a classic margherita pie, but the #1 special is our absolute favorite! The #6 special is also fantastic!", "author": "Jackie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Best Pizza in NYC!\n\nWe walked from Manhattan, crossed the brooklyn bridge and it was all worth it!!\n\nThe server was very good, we ordered the Margherita pizza and it was so good!\n\nI recommend going before dinner time, we were there around 4-5 pm so there were less people. We were entertained right away!!", "author": "Clarke A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "Their #6 is truly an experience in exploring different styles of pizza. Topped with pepper jack cheese, guacamole, chicken, and more, you're in for one great experience. With that being said though, you really are paying New York prices for what you're getting. A lot of this has to do with the location near the Brooklyn Bridge, a pretty hot tourist spot. However, if you're in the mood for some upscale pizza, this is definitely the place for you. If you and your friends are feeling extra hungry, definitely consider picking up the spaghetti and meatballs too. As for desserts, the hot chocolate, while not all that hot, is perfect in that is not too sweet and really makes the pizza go down even better. Beware though, as if you are a fan of overly sweet varieties this is not the hot chocolate for you. Overall, if you have some friends visiting from afar who want a nice touristy experience, definitely consider taking them here.\n\non a sidenote, we did get to see the owner today in the restaurant itself. He seemed like a really nice guy and it felt good seeing him in his own place.", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "The pizza was just okay. The sauce/pizza wasn't very flavorful; I was tempted to add salt. The people at the table next to me also were not thrilled with the pizza. The wait staff was nice.", "author": "Janine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "It was tough to chose a pizza place since I wasn't going to be in New York long, we couldn't find parking so my dad dropped me off and we got the pizza to go. I wish I could've also tried the margarita pizza, but I ended up getting No. 1 on the specials. The small pizza costs about $30 after taxes, \u0026 it had 8 slices. Definitely pricey but we devoured the whole thing within minutes. I would definitely come back! The service was good \u0026 pizza came out fast.", "author": "Megan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "This was some damn good pizza. The wait was long but it was worth it. We got a margherita with pepperoni on half and garlic on the other. The pie came out perfectly hot and greasy. The crust was very thin and crispy on the bottom, while being chewy on the edges. The sauce was a little sweet but also tangy and full of flavor, very well made. The cheese and other toppings(including whole basil leaves) were placed perfectly by obviously expert hands, and the end result was some of the best pizza I've had.  The egg cream was delicious. Believe the hype, this place is very good.", "author": "Sean L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "There was a bit of a wait outside but what do you expect when you're in NY and looking for good pizza? We probably waited for about 20 minutes for a table which wasn't bad as the queue was wayyyyy out the door. I would've given this place 5 stars for the AMAZING pizza if it wasn't for the unprofessionalism from one of the waiters. My original waiter was helpful and nice however there was a random one that kept stopping by my table and chit chatting. Normally, I like personal touches and making conversation with the staff but I could tell he had different intentions than just being friendly. We saw that he got in trouble with the managers and he left us alone for a little while but before we finished he came back and asked for my number. It was kind of embarrassing because if you've ever been to this restaurant you know that the tables are literally one foot apart so everyone around our table could hear. Anyways I'd come back for the pizza but I don't like being in places where I feel like men don't know their place.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "This is the spot for pizza in Brooklyn. Also, needed some tickets printed for a concert at Barclays, and Matthew helped me out without hesitation. Great food, great service!!", "author": "Bryan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "So we showed up a couple of minutes after three in the afternoon. That's when they restoke the coal oven to keep the heat up and maintain crispy pizzas crust. \n\nSo while we waited about 30 minutes for the oven to heat up we got a Caesar salad and put our pizza order so it would be one of the first ones out.\n\nWe actually got the first pizza to come out.,We got a margherita pizza with prosciutto. It was worth the wait, when it got to our table, steam was rising from it. Everything about it was absolutely amazing. I could eat here everyday, and be happy. It is one of the best, if not the best, pizzas I've ever eaten in NYC.\n\nMake sure you leave room for dessert. Brownie + Cookie = Brookie. The Brookie Bridge is out of this world, one of the best things I've ever eaten.  It's two brookies with ice cream between it, like an ice cream sandwich. \n\nThe service was also very friendly, and never let your glass get empty. My only regret is that I don't live nearby.", "author": "Christopher M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Delicious pizza at Juliana's! Waited outside for 30-40 minutes, but that gave me a chance to read about the story of Grimaldi's next door and Juliana's now owned and operated by the Grimaldi's. I would say the line outside the restaurants were pretty equal, but I had read up and heard Juliana's was better.  For such a small place the line moved fairly quickly but it was cold so I was pretty happy to get the nod by the host.  Amazingly,  I didn't feel rushed once inside.  The atmosphere was casual and fairly loud which I enjoyed. Service was great but the pizza was amazing! We ordered 2 large for 5 people and it was more than enough. Try it if you have the chance, it's worth the wait!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "Did the whole 45-minute wait thing. Worth it? In summary, yes.\n\nOh Juliana's, what a scene you make for those getting off the Brooklyn bridge and exploring the area. You instantly lure us in with those long lines in front of your doors. Something special must be in here, right?\n\nHmm, not so special, but still pretty darn good. After a long 45-minute wait in 30-degree weather, we were welcomed into Juliana's. The server quickly attended to us and took our orders. In the blink of an eye, our 4 large pizzas arrived. \n\nYes, these pizzas were delicious. Hot, fresh, coal-fired taste with delicious sauce. However, although I thoroughly enjoyed the amazing pizza, I honestly feel that I can get pizza just as good elsewhere. So, I don't think Juliana's is worth all of the hype, but there's no arguing that it's really really good.\n\nPrices were rather steep ($20 for a large Margherita, $29 for a specialty large pie). Service was quick and like I said, the pizza came out very quickly too. With that being said, I encountered some weird thing. First, I asked for garlic powder for my pizza but they said they don't offer that (what kind of pizza place doesn't?!). Second, if you want Parmesan cheese on it, they come to you with a little bowl, and they will ONLY put it on the ONE slice that you are currently eating. It was just so sketchy.\n\nAll in all, fantastic pizza but in my opinion, not worth allllll the hype. You're in NY for pete's sake, there's amazing pizza everywhere.", "author": "Alana A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "One of my friend told me that this is fairly new and very good pizza place, apparently founded by the person who actually made Grimaldi. I heard Grimaldi later was purchased by someone else and is run by that person since then. \n\nAnyway, I went to this place alone right at 11:30 am on Saturday to avoid crazy waiting line, was given a seat at a bar as soon as I got there, and ordered small margheritta with additional pepperoni topping. The pizza was supposed to be \"small\", but not really. Pretty decent size. But it wouldn't be too much heavy amount since dough is fairly thin. Taste was good, but maybe not WOW. Impressing part was that I did not get any sick oily feeling until I finished the whole pan all by myself. (again, it was not small but I kinda eat a lot) Pizza is really pizza, so you'd easily expect that you could get that nasty feeling of \"okay that's it, can't have anymore\" after couple of good pieces of pizza. I didn't have that at all with pizza here. It was rich taste but clean at the same time. I could finish whole small size pizza here without any beer or coke. \n\nI would definitely visit again especially this place is just 15min away from my place by motorcycle.", "author": "Jay K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}