{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "My wife and I were on a Memorial Day vacation trip to Manhattan, we took a walking trip across the Brooklyn Bridge and it was a big check off the life bucket list. The restaurant is at the bottom of the bridge on the Brooklyn side.\n\nWe got to Grimaldi's and there was a big line there so I remembered the Juliana's Pizza was the original Grimaldi's and he sold the name but started his own place next door. \n\nMy wife is a big no cheese person, so we waited about 5 minutes and they sat us at the pizza bar. It was really cool watching the guys top all the pizzas ans throwing them in the oven.\n\nThe crust is super fluffy, but not crazy crisp but amazing!!The sauce makes it!\n\nI realize that I live with a no cheese person, so I asked for a bowl of parmesan. The flat cheese pizza was AMAZING! The sauce was very flavorful.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "Simply amazing pizza 5 stars, 1 star for nickel and dime for refel on drink. \nTruly authentic pizza joint and best pizza I had, very pricey but worth it.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Cozy little place not far from the carousel. The pizza and staff are great. \n\nOh yeah, and they have wine..", "author": "Mel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Great pizza. Not THE best but definitely in my top five! \nFresh dough, homemade sauce, fresh mozzarella and fresh toppings. I prefer my pizza to be a bit on the salty and hot side so we ordered the margherita base with pepperoni and black and kalamata olives. The pepperoni curls into a sort of a cup indicating its freshness. My mouth watered ordering the combo and my taste buds weren't disappointed with the flavor combo. The crust was a bit dry and I just kept wishing for the hot oil served at my local pizza place. Also had a tasty Caesar salad with white anchovies. \n\nOur waiter was friendly. We came just as they were re-opening after cleaning and preparing the ovens for the second shift of the day. Seated within 10 minutes and never made to feel we had to rush through our meal. Good quality pizza that you can truly sit and enjoy.", "author": "Cieanne E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Juliana's serves one of the beat pizzas I have ever had in my life. Went here the first time, as we always went to Grimaldi's next door before. Juliana's is new and owned by the original Mr. Patsy Grimaldi who as I read somewhere had to for some reason sell off Grimaldi's to another owner in the late 90's. So glad that he is now back with Juliana's! Juliana's hands down beats the Grimaldi's pizza! Compared to Grimaldi's their dough is softer, the pizza tastes better, and more fresh, they accept credit cards, the place is cleaner, the staff is friendlier, they also have tasty dessert options, and I got a picture with the Mr. Patsy Grimaldi who was one of the sweetest and humble people I have ever come accross. I went here with a friend and was seated right accross the counter where Pizza is freshly made, it was an awesome experience, and the staff making the pizza looked so happy with what they were doing, which was awesome! I am never going to Grimaldi's ever again, while I am in DUMBO.", "author": "Neha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "We got to Juliana's right before they opened and there was already a line. We were traveling out of the city after lunch so we had our small carry on suitcases, the hostess was very helpful in seating us in a place with room for storage. This was greatly appreciated. We sat down and promptly ordered a pepperoni \u0026 meatball pizza. The meatballs were amazing! The crust was perfect and there was a perfect amount of cheese. I will be dreaming about this pizza all the way from Florida!", "author": "Amanda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "If you know the story of the Grimaldi's and you are a true loyal customer you'll eat here! And if not it's just the best in NYC!", "author": "Hayden L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "I went to 3 different pizza places in NY, and this is by far my favorite! Came here on a Friday at 4 pm right before it opened. We were luckily the 3rd party in line so we were able to get a table right when it opened. I definitely suggest getting there a little early because the line starts forming outside. It was a decent sized restaurant that was lively and looked old school pizzeria. We ordered a margherita pizza which had cheese and basil. We added some pepperoni and sausage on top. We also ordered a pizza with white sauce, garlic, and sausage. The white sauce pizza was amazing. There was a great garlic flavor and the crust was more undercooked but cooked enough where it actually tasted good. The added sausage was a nice additional flavor to the cheese and garlic. The margherita pizza was also amazing as it has the red sauce and basil. The red sauce pizza was a tad watery for me as everything fell off pretty easily, but the taste was to perfection. I really would love to come back here to get more pizza! The 4 of us shared 2 pizzas and it was a decent amount for each. We each got around 3-4 slices among us and walked away satisfied. We each paid around $12-$14 each for everything, which was not bad for a meal. Definitely come here and try both types as they are very different, but both really good.", "author": "Kevin J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Worth the trek to Brooklyn for this pizza. In case the line is too long at Juliana's, right next door is Grimaldi's is right next door... With an equally long line . We waited a good hour to be seated which is standard for highly rated NYC restaurants. \n\nLike most pizza joints you have the option of ordering half/half toppings which is great. Nothing beats variety! We ordered a large half marguerita and half white with additional pepperoni and mushrooms. Surprisingly we finished the WHOLE pizza (8 Costco size slices) between the 2 of us... I blame the thin crust. It was delicious for NY style pizza and our selection combo let us samples the red sauce vs white sauce. I am bias toward marinara sauce but the white sauce is a close second. The garlic flavor was not overpowering, while adding a great base for toppings. Highly recommend adding toppings... But the pepperoni wasn't quite what I'm used to... I prefer them thin sliced. Juliana's pepperoni reminded me of lap chong, (Chinese sausages) which was like getting a good salty bite. Aside from that, the wait is justified by the overall great taste and reasonable prices. Win win!", "author": "Angelina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "We waited for over an hour in line to get a table for two. We could tell that this place was legendary from that experience alone. Loved the atmosphere inside - pizza chefs were making things right behind the counter and were easily observable. Very cool to watch!\n\nThe pizza itself was fantastic, albeit pricey. But we weren't there to save money. We heard that Juliana's was the place to be, and it certainly was. It took a little longer for us to get our food than it did our neighbors, and we were offered a free dessert for that. The server and host were so kind!", "author": "Casey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Amazing.  Had a 1/2 Margarita 1/2 pepperoni and sausage.   Was the best pizza we have ever had!!!   What a great way to finish the walk across the Brooklyn Bridge.\n\nBrooklyn seltzer water was amazing as well.\n\nThanks for a great experience.", "author": "John G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "The best pizza we had so far, the taste is fresh and the flavors are a treat. We had the white pizza, half with pepperoni, it was delicious can't wait to come back and try their other choices. Great dessert menu.  we tried the dessert special original, Nutella and pistachio out of the three the pistachio and Nutella were the best. The only downside of this plce is the wait time so be prepare to wait, but at the end is going to be worth it !.", "author": "Andres G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Yellllo NYC! I spent my Memorial Day Weeeekend in NYC and discovered this heavily talked about pizza business here in Brooklyn, New York!  To start off, this restaurant has a quite story behind itself. The location can also be a little confusing since the line zig-zags across its neighbor and parent restaurant, Grimaldi's. It's NY pizza after all, y'all almost can't go wrong. Do you guys a favor and fold that thin slice in half please, just save y'all from looking like an idiot eating pizza the traditional way...\n\nI had a party of five around dinner time and the line wasn't terribly long. We got seated in about 30 mins. Grimaldi's had the line down the block. I don't care how you tell me but both places only have one cooking oven. So if you are in a hunger moment come to Juliana's. However, Grimaldi's has two floors, way more spacious than this.\n\nThe quality of the pizza was decent. We ordered the specialty pizza #1 and #2. I enjoyed 1 more than 2. 2 tasted way too salty for my own good. That also made me chug 3 glasses of water. Price? 30$ per pizza ...I consider this to be a tad more on the pricey side than other places \u0026 it wasn't up to par in flavor either. Maybe I didn't order the right pizza? None the less, I had a worthy time here to say I have experienced the pizza here. Thank Brooklyn, it's been real.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Drove pass DUMBO and my friend was surprised there was no line for Juliana's.  What did we do?  We decided to eat pizza even though we had lunch not long ago.  When we got closer, the place was temporarily closed to clean the ovens even though people were still inside eating.  We decided to wait since sign says they will open in few minutes.  Waited about 15 minutes and finally our time to try this popular pizza.  Got a small margarita pizza between 2, which was actually a good size.  Luckily it's thin crust.  Pizza was yummy.  Dough, cheese, tomato, basil.  Yum.  \nAs for the story behind Juliana vs Grimaldi .... I'm not too certain.  Just want Yummy pizza!", "author": "Linda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "This is the most authentic New York / Italian style pizza we've ever had! Perfect dough, healthy amount of toppings and great service. So worth the wait! Highly recommend", "author": "Emily A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "Best Pizza in America? ...NO.\nBest Pizza in New York? ...Not even.\nIn fact, I'm a little confused about the majority raving reviews, maybe I went on an off day... Or maybe it's just me... But I came in with low expectations already and the pizzas were just unimpressive still.\n\nCame here with 9 people, and we shared a large in their specialty pizzas of the majority that was on the menu; #1, #3,#4 and #5. The crust was not too thin or thick, soft with a nice chew... But just my personal preference, I would've liked it a bit more crispier.\n\nNo. 1 - a no tomato sauce pizza with pancetta, mozarella, scallions and white truffle oil. I really enjoyed this pie a lot, even though this was perhaps the rest of my party's least favorite... Because I must agree with them, it was indeed very salty and the truffle oil was light to non existent.\n\nNo. 3 - no tomato sauce pizza with mozarella, sausage, and broccoli rabe w/ garlic. My boyfriend loovess anything with the combination of broccoli rabe and sausage. In fact, he thought this would be the winner of them all. Sadly, this was my least favorite and no body enjoyed the pie either. It was boring and bland besides he bitterness from broccoli rabe... The sausages were dry instead of juicy.\n\nNo. 4 - tomato, arugula, prosciutto, and mozzarella. So this is usually my go-to type of pizza every time I go to nice pizzerias. I lovee prosciutto and arugula, but this was no where on the list of the good ones I've had. The prosciutto they used were so thick and big.. It was hard to bite it off with the pizza... Instead it ended up just sliding off the pizza and getting all messy.\n\nNo. 5 - sliced tomatos, goat cheese, smoked salmon and capers. Surprisingly very good!\n\nI don't know how TripAdvisor gave them the title \"Best Pizza in America\" because that is utterly absurd. Luzzo's, DiFara's, Campania's are a few that I could already name that's much better... I've had Grimaldi's before which was always just okay to me... But I was hoping Grimaldi's new named restaurant would be as good as how everybody who fell into the hype and said it was amazing.\n\n**Oh btw; may I also note the service wasn't too good either... My whole table finished their glass of water at the same time and nobody received a refill all night until we had to wave down the water at the end to ask for a refill.", "author": "Monica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "We came here around 9 PM on a Tuesday and there was still a wait. We waited about half an hour before being seated. We got seated at the bar and I think we lucked out! We got to watch them make our pizza (and others' pizzas). The 3 of us decided to share a large margherita pizza with ricotta and sausage. The first word the comes to mind when I think of this pizza is juicy. I know that it's a weird word to describe pizza, but it's so accurate. The crust here is super thin so you can really taste the tomato sauce (which makes it really juicy). There the right balance of sauce and toppings (I hate when places skimp on toppings, but Julianna's puts the right amount). I always get the standard pie when I visit new pizza places, but I can't wait to come back to try their other pies!", "author": "Jillian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Just around the corner from the famous Grimaldi's, this place serves sublime Brooklyn brick oven pizza. Can get just as crowded as Grimaldi's at lunchtime, but the nice interiors and fantastic pizza is worth it. I came in just before noon on a Tuesday and got a seat at the counter easily.", "author": "Marc P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "The best food,the best service,the best pizza!!!\nPizza Number 4 and meat balls - must try!", "author": "Olya V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Without a doubt some of the best pizza I have ever had. I'm thinking about planning another trip to NYC just so I can eat this again. This meal made for the perfect touristy afternoon--stuff your face with pizza then walk it off across the Brooklyn Bridge.\n\nThree of us shared a small pizza-- I would get 1 pizza for 2 people if you're really hungry. Since the spaghetti and meatballs at the table next to us looked so delicious we got a margherita pizza with meatball topping. Every part of this pizza was amazing. The cheese tasted so fresh. the crust was thin and still crispy in the middle (important!) and the meatballs made for the perfect topping.\n\nI love that you can watch the pizza being made and popped right in the oven. We arrived at 12 on a Saturday and there was no wait. But line was about 10 people deep by the time we left. We were lucky to have no wait, but honestly I would stand in this line if I had to.", "author": "Julia G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}