{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-03", "description": "I wasn't that impressed by their pizza but maybe because since I don't eat dairy anymore, pizza without cheese is just not as good. Anyway, The line to get in this place gets very long during dinner time. I waited for a table for 6 people for about 30 mins. \n\nStarted off dinner with some meatballs. These were really good. Moist and soft and flavorful. Would highly recommend. Then also got spaghetti and meatballs which was a really small portion and the spaghetti tasted like those canned ones. Was not impressed  \n\nOn to the pizza. Ordered the marinara which was just sauce on the pizza dough and the margherita pizza and no 4 (tomato, mozzarella, arugula and mozzarella). They sauce was good because it was fragrant and had lots of garlic which I like. However, the crust an dough were such a miss. It was hard, and kind of tasted burnt and I didn't enjoy it too much and we all know pizza is all about the crust!! \n\nAnyway, personally to me; this place is a tourist trap in a touristy neighborhood. I will go elsewhere for pizza.", "author": "Jane M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Amazing. I recently fell in love I th this restaurant and have been back 3 times in the last month it has become a perfect place to bring visitors! Located in the amazing DUMBO area right under the brooklyn and manhattan bridges it is very iconic. The restaurant is small but creates a very comfortable family feel and the service is very efficient and personable! \n\nJuliana's was started by the famous Grimaldi family and is still owned and run by them today, on two of my visits Patsy Grimaldi has been there to seat people and overlook the restaurant which gives a truly authentic feel.  I grew up in Arizona and had been to Grimaldi's several times which is no longer family owned, there is a Grimaldi's location right next door but I have to say that Juliana's is way way better and has less of a corporate feel.\n\nEvery time I visit I like to start with the Caesar salad, the dressing is very light and dairy free, it has an acidic/lemony taste like a vinaigrette which I love! And the fresh Parmesan on top adds the perfect touch! For pizza I am a huge fan of the classic white pizza and margarita! With two of us I like to order a large and you might end up with a few slices to take home! I like to go half and half white/margarita and then you can add all the toppings you would like! I always go with garlic and have tried the sausage as well which is very good! For dessert I HIGHLY recommend the cannoli they are brought in from Carols Cannoli's, I honestly can say that it is the BEST cannoli I have ever had! \n\nI recently visited for my moms birthday and the waiters made the night so special by singing to her and finding a candle to put in the cannoli! Our waiter was Michael and he did a great job!  I would highly recommend a visit even if you have to wait in line for a bit they are usually pretty quick moving so I recommend waiting it out you won't regret it! Enjoy!", "author": "Maddy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "I had a friend in town and wanted to show her the real NY pizza experience. We were already in Brooklyn that morning, and were going to eat at Grimaldi's but that day it didn't open until 12pm and it was 11:15am and we were starving! We saw the line already forming at Juliana's (it opened at 11:30am!) so we figured it would be a safe bet. And we were so right! It was amazing, the service was fantastic and so quick, and the pizza came out so quickly as well! It is easy to see why it is rated so highly.\n\nWe got the small Margherita pizza with sausage and meatballs added and it was plenty for two people! Highly recommend.", "author": "Brittany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "This was my local friends recommendation and I had bookmarked this place to try for Pizzas. I am glad my friends could join us and made the evening more memorable. After waiting in a queue for 30 minutes and reaching around 10 pm and getting seated at 10:30 pm we just made it to this amazing place. We were lucky as we were the last to be picked for seating:) as I wouldn't have made it again to this place until I visit NY/Brooklyn again. The place is not very big but they made sure we were comfortable. The menu is not extensive and it is to the point. The service was quick. \n\nAbout food -\nWe had classic 1) Margherita Pizza - Simply delicious. Fresh ingredients, simple and yet so tasty. 2) Marinara pizza with veggie toppings pineapple and mushrooms. 3) Carol's Cannoli - Such fresh and perfect homemade ricotta cheese filling was such a good dessert. \n\nIf you can ignore the wait time as they don't take reservations and just for those pizzas and cannoli this place is 5*. Must try if you are looking for authentic and good classic pizzas.", "author": "Shikha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "This place is right next door to Grimaldi's and is a nice contrast to their neighbors more gritty charm. The restaurant is well lit and simply but tastefully decorated with friendly service and a classy atmosphere.\n\nWe ordered a Margherita pizza with added arugula, pepperoni and garlic as one pizza we were considering was sans tomato sauce and we wanted something more traditional. We also ordered the homemade meatballs as an appetizer.\n\nThe meatballs were large, very saucy and tasted great, which was a nice prelude to the pizza. The margherita was wonderfully delicious all around, the crust was the perfect thickness, and each of the ingredients worked perfectly with each other. I probably could have ordered another whole pie and been able to eat it.\n\nGreat place and would love to eat here again.", "author": "Mike G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Very quick service and even better food! Great place to go if you are looking for a pizza place in Brooklyn! \nI got the margarita pizza and white pizza.", "author": "Megan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "After all the rave about Grimaldi's, I finally tried it a few years ago at their new corner location. It was so disappointing that even if there was zero wait, I would not return. More recently, I decided to try Juliana's after reading that Grimaldi's famous oven is actually still located at its old location inside Juliana's. If that's true, well then, I finally get it. Their brick oven's added smokiness is pretty amazing. Not sure if it's the best pizza in NYC but it's pretty good and definitely unique compared to other spots. So it's definitely worth trying despite the wait (unlike Grimaldi's next door). I personally would not wait more than 15 minutes to dine here again though. But then I live in NYC so my options are pretty endless, especially when it comes to pizza.", "author": "Wendy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Delicious NY pizza, hands down!! I would say that I'm more of a deep dish pizza person than a thin crust guy so I was a little skeptical. Juliana's might have swayed me to the thin crust side!!\n\nPeople go crazy for this place. I'd recommend getting there before they open and lining up because if you come a little after they open, you miss the initial wave of people that get seated. We ended up waiting for about 45 minutes but it was sooo worth it. They even have a water jug outside so the humidity isn't killing you while you wait.\n\nFor 2 people, we got a large #4, which comes with tomato, mozzarella, arugula and prosciutto. I love simple the ingredients are. The pizza was delicious.. oh my goodness. Even though it was thin, it was chewy and doughy, something I didn't expect. The pizza isn't overly oily and isn't too heavy either. My mouth is just salivating writing this review!!\n\nI would definitely make a stop at Juliana's if you're in NY and looking for some terrific pizza. Trust!!", "author": "Jason L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Came in alone so I didn't have to wait in that long line forever! Ordered #1... Wanted to eat the entire pizza because it was soooo delicious, but failed. Very fast paced environment but still very friendly. Made me feel not so alone haha", "author": "Mary R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Soooo glad I got to try this place out as it was ranked #1 pizza in NY. We had a party of 7 and thought it was going to be a long wait as there was a long line but we were lucky a big table was just leaving. We got sat maybe after 10 minutes and the guy who was helping us was very kind.\n\nWe ordered #1 (without the egg) and #6 (the one with guac). So far, it's my favorite place for pizza in New York. It didn't take long for the order to come out after we ordered and both pizzas were super delicious! For the #1 specialty pizza, the bacon was a bit too salty for me but it complimented #6 as that was on the less salty side. However, I still enjoyed #6 much more even though my friend described it as a quesadilla pizza. I think what really made me like the pizza here was their crust. I'm generally a thin crust girl so their crust on their entire pizza was amazing! It was just the right amount of crisp to where it was not a dusty texture and still warm and cheesy. \n\nOne day I'll be back to try their desserts because it looked really good but I was so full from eating throughout the day. I'm not sure how it's next to Grimaldi's and both restaurants had lines waiting to get some pizza but if I had to choose, it would definitely be Juliana's. Looking forward to trying their pizza with prosciutto on it as well.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "Worth every minute of the freezing wait! Treated like regulars even though we had never been. Pizza was sooo delicious, meatballs also delicious. Def a must try if in Brooklyn", "author": "Elaine P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "My girlfriend and I came at 5:30 on a chilly Saturday. We saw the great reviews on Yelp and decided to come. The line was out the door! We waited for a little over 30 minutes before getting a table. \n\nWe decided to get a large pizza split in half with half White and half Margherita. Both were great. I liked the White more than the Margherita mostly because I expected the Margherita to have tomatoes, but it was just tomato sauce. The unique thing about the pizza is that the cheese doesn't cover the entire pizza, so there are parts that are crispy like the outside crust, but it has a different texture to it.\n\nService is quite rushed and the waiter seemed flustered when we asked a question. They're just trying to get us to order as soon as possible, which is ok, but not the best. Also, I thought they would split the cost of the pizza's in half and add the two together, but they just charged us for the more expensive one, Not sure if that's how they do it or if it's because the difference was $1. Not a big deal to me, just something good to know.\n\nApparently there are other locations part of the corporation but this location is the one where the family works and this tastes better. I agree that the pizza here tastes great and I would definitely come back here for the pizza.", "author": "Patrick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Wow. Just wow this pizza blew my mind. We just got the simple Margherita pizza but i could taste every flavor on it, from the mozzarella to the olive oil. Crust was light and crispy and delicious. Wait was not too bad but it was also 4:45. service was speedy.", "author": "Clara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "YUMMY \n\nYou aren't the best pizza in New York just like that. Clearly this place is doing something right!!! \nThere can be a lot of wait, so come early and hungry!! \nHowever, little tip for you or you want to \"skip\" the line... you can just order your pies to go. That's what I did and I was in and out in less than 20 Minutes. And the staff was very nice to me! They gave me a seat and a glass of fresh water. It was lovely. \n\nI took my pies home, back in Manhattan, turned on my mini oven, reheated the babies and it was heaven at every bite!! The fun part was the train ride from Brooklyn back to Manhattan with my big pies. The subway car smelled delicious, and by the look of the people around me, I probably could have sold some slices...\n\nWe had a classic margherita and a numero 1!", "author": "Juliane L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "The pizza was really good. I can see why they have so many great reviews. My only gripe is the wait outside. It was cold and long. But I would say they are one of the best pizza joints I've been to.", "author": "Stefson A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-04", "description": "My girlfriend and I waited an hour on a Sunday afternoon. We had heard about the pizza in a tourist book and gave it a shot. The pizza was ok but not worth the wait. The cheesecake was delicious. I will not return because it is not my type of pizza. Sorry but it is the truth.", "author": "Laurie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-14", "description": "Well worth the wait, get there at 4 when the doors open if you can! Coal fired pizza, thin crust, extra crispy- perfect for us. They have s limited menu, but it shows they focus on doing one thing very well. This is in a great spot right next to Grimaldi's...", "author": "Barb C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Ok... I'm crazy late again with my review. ... but you should know me by now!!  Of course pizza is simply amazing. Yes... the wait is about an hour if you go anytime after 2/3 in the afternoon on a sunny beautiful Saturday afternoon in Dumbo. You will not be disappointed at all. No pics because I made a mistake and deleted them.  However... trust me... it's worth the long wait.", "author": "Tavia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Such a wonderful place! We waited for about 35 minutes, got seats at the bar. We weren't that hungry, so we got the small pizza (16\"). It was plenty. The white sauce pizza with pepperoni was delicious! Folding it in half made it all the more tasty. We watched the team pound, knead, toss, drizzle, slide and pull the pizza out of the coal-fired oven the whole hour. Brilliant work, gents! I highly recommend this pizzeria. The ingredients were fresh and delightful.", "author": "Joey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-02", "description": "First off I want to say I'm a pizza fanatic. I arrived at Juliana's around 8pm and was told they weren't doing take out orders anymore, I would have to dine in.  Thankfully after speaking to the manager I was able to order my pizza to go , as far as the pizza I would say the sauce , mozzarella, toppings  were amazing one of the best pizzas I've had in nyc .", "author": "Ray S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}