{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "Features:\n-If you don't know about the story behind this place and the owner (Patsy), you should read about it on Wikipedia.  It is quite interesting.  \n-We had the Margherita pizza with prosciutto.  It had tomato, mozzarella, and basil.  The mozarella cheese was enticing, it melted so quickly in my mouth.  The mozarella with tomato sauce made the pizza taste so distinctive and tasteful.\n \nImprovements:\n-The pizza we had was a bit too salty (probably from the prosciutto) but overrall, probably one of best pizzas I've had in NY thus far.\n-Long line like Grimaldi's but this restaurant moved its customers quicker.\n-Service was a bit slow probably because there were so many customers.\n \nTips:\n-Do not come hungry. \n-Get a pizza with mozzarella cheese! Yum!", "author": "Kristy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Came across this place by (happy) accident yesterday while exploring the beautiful DUMBO area. Amazing pizza, meatballs and Caesar salad! Fresh, excellent flavors all around. Top notch service by the entire staff and the friendly owner stopped by our table to check in with us personally. Highly recommend.", "author": "Teresa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "The crust and sauce is better here than at the new Grimaldi's. Julianna's is technically the original Grimaldi's with a new name. It's in the original place with a new name. The Julianna's owner is the original owner of the old Grimaldi's. Anyway, I like how they've spruced the old place up. That old brick oven is still cranking out the best pizza in Brooklyn. I will be back.", "author": "Shani D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "It was the best margarita slice I ever had. What made it the best, you ask? The answer: the sauce.  The sweetest marinara sauce you'll ever taste. That along with the mozzarella cheese is the perfect combination. This is why Juliana's is a 4.5 overall review on Yelp while Grimaldi's next door is 3.5 star overall review on Yelp. \n\nSimple math 4.5 is greater than 3.5\n\nD-U-M-B-O.  Dumbo Dumbo Dumbo", "author": "Joey D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "No. 1.  'Nuff said.\n\nBut really, the combination of toppings on this signature pie was absolutely ridiculous.  The freshest of housemade mozzarella, chew of the Scamorza affumicata curd cheese and salty savory umami-ness of the pancetta elevated each bite to a whole 'nother level.\n\nBeing a newer sister joint to the infamous Grimaldi's, I'd take Juliana's over them any day.  A more expansive menu, less of a wait, more comfortable seating, a more modern atmosphere and excellent service from start to finish.\n\nSo derricious and a must visit for any and all pizza lovers living in/visiting Brooklyn.", "author": "Eric F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "Great pizza! I love how the cheese blend into the pizza itself! Very nice environment, great for winter cux the restaurant itself is really warm. Service is great and pizza is wonderful!! Must try in Brooklyn!", "author": "Janice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Worth the wait and even better than the \"place next door\". The service is flawless inside and you're not rushed in your dining experience even though they know there are many others waiting. The pizza dough was a delicious balance of crispy but chewy. Amazing!", "author": "Jade G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Julianas pizza is really really tasty, if you can brave the long lines for it. Your best bet is to come before 5 on a weekday. It is worth it though, the pizza is really high quakity. The location is great too, just walking distance from the Hudson and amazing views of Manhattan and the Brooklyn bridge. Picking up to go is also an option.", "author": "Arthur V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Definitely worth the wait. The Margherita and pepperoni pizzas were both very good. We also got the hearts of romaine salad, spaghetti alla puttanesca and calzone. We love all the food we ordered. Excellent food! Staff was very friendly.", "author": "Len C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "My cousin from NY recommend this resturant. She loves this place a lot. The food is great. I order a salad and pasta. We all share the dishes by the way. The staff are nice and friendly. The also have good desert. I like the cheese cake, not too sweet like the other resturant does.", "author": "Samuel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "I ALWAYS stop by and eat here when im in New York ! It is a MUST to try this spot , BEST pizza I have ever had !!! Im craving it as im typing the review. Wish The restaurant  was at my home city san francisco .", "author": "Issa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "So maybe it's just that I don't like NY style pizza but I didn't think it was blow your mind and your palate pizza. It was the thinnest crust pizza I have ever eaten, like see through thin. The good thing about that is you can polish off the whole pizza in one sitting. We got half pep and sausage and half onion and mushroom. The charge full price for toppings even on half the pie so you might want to just order for the whole shebang.", "author": "Christine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Happened to stumble across this place using the Yelp app and since it was in walking distance we went. It was good really food and I tried the pizza #1 and I'm glad I did. I didn't know what half the toppings on the menu were but the #1 is a safe choice.", "author": "Kalia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Great Service! Great Pizza! Only things i would comment on is i would like more cheese on my pizza - a lot of area where there would be no cheese in the bite. Also one thing that made me laugh is that a 8 ounce Coke is $3.. not even a normal 12 ounce drink haha, but overall it was a good experience :)", "author": "Connor R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "We came here around 3:30 pm on the Sunday and waited in line until they opened around 4. From the appetizers (salad and soup) to the pizza, everything was fingerlicking good. Service was great, kudos at how they handled the chaos of everyone ordering at the same time. I'm keeping this place in my bookmarks and I'll definitely be back for more.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "Amazing pizza. I didn't expect to wait on a line but we had time to spare. It was quite crowded but we got good seats near the window. Again, the pizza was amazing.", "author": "Julie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "I'm keeping this review short and sweet (like me *blush*).  \n\nBest pizza I've ever had. \n\nRead the other reviews for the history lesson of this place.  Then you'll know why this place is better than any other place near or far.\n\nI'm going to go back again soon.  You can buy me a slice if you like.  ;)\n\n*smooch!*", "author": "Tomeka S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "Really great pizza and excellent service. I had the classic margherita pizza also the number 4 special is delicious. Patsy Grimaldi came around to talk with everyone. \n\nSecond time I went the line was amazingly long. I really wish they could have told us how long the wait was for the oven to be done stoking so I could have grabbed a coffee while waiting.\n\nEdit: \n\n4/14/2018\n\nAs my friend wrote in a review, the service is great. The waiter that poked fun at us eating a large pie is so cute.", "author": "Antoinette C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "My advice is to either come here at an odd time like 9pm on Sunday night or just take the pizza to go and eat at the nearby Brooklyn Bridge Pier park. There's typically a line here and if you're okay with waiting in line then queue up for Juliana's rather than Grimaldi's. It's essentially the same pizza but the line is likely shorter at Juliana's.\n\nThe pizza here is really really good fresh. I'm talking amazingly delicious. The crust is just perfectly crispy on the outside, but chewy and doughy on the inside. The toppings are fresh - mozz cheese, basil and tomatoes. I really like their sausage and homemade meatballs. You can't go wrong with either of those meat options.\n\nThe portions here are quite generous. I'd advise splitting a small pizza between two people. A large should be able to feed three people easily. Maybe even four people. The owner - Patsy Grimaldi - typically man's the door and he's super friendly if you get a chance to talk to him.\n\nThis place is an iconic pizzeria in NYC - it's actually in place of the original Grimaldi's location. You can read about all the pizza related owner drama on the wall right in front of the restaurant. If you're remotely interested in pizza then you must visit this place. 4.5 stars!", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "As far as the food goes, it's always delicious. Pizzas never disappoint. However, it's a shame that last time we went to the restaurant we were seated right next to the hostess and we were barely asked if we wanted anything else. Also, our check was brought to the table without asking for it and we were still planning to order more drinks... A bummer. But, like I said, I wouldn't take stars for it since we did previously had great service at this place and I like to rate food, more than anything! \nWould come here over Grimaldi's any time!", "author": "Natalia P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}