{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "I would give it a 4.5 if I could, better than most but not on the same level as Di Farras out in Midwood, BK. It was a rainy x mas eve, so the line wasn't as long as usual (10-15 minute wait). The service was average. However, the pies live up to the reputation, they are fresh, simple and delicious. We had a Margherita and a Margherita with pork sausage, onion and pepper, both were amazing. By chance we got seated at the bar/ table top seating right in front of the chef and brick over which was an added bonus.", "author": "Vikash S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "I had never been to New York, but I knew that New York was supposed to have some of the best pizza in the nation, and who doesn't like Pizza.  \n\nSo on my visit to New York one of the things on the top of my list was the best pizza I could find.  \n\nJulianna's is that place.  \n\nThis conclusion was not randomly arrived at either.  We did our homework and new all about those other places like Lombardi's and Grimaldi's that were supposed to be it for New York Pizza.  \n\nWe had one resident of SoHo tell us, \"Ah be careful Lombardi's is coming up.  No don't look, you'll burn your eyes out for gazing upon that house of sacrilege.\" \n\nGrimaldi's we were told had been sold a few years earlier and was no longer owned or operated by the people who made it famous and just wasn't the same.  \n\nWe heard about of other less famous places as well, like Di Fara's,  but in the end we were told that if you want a proper and authentic New York pizza (not Neapolitian but New York), then off to Brooklyn or more precisely DUMBO we must go and then arrive at Julianna's.\n\nAnd this recommendation came from the people working at Mario Batali's place.  \n\nSo that's what we did.  \n\nJuliana's we found out was owned and operated by the family that used to own Grimaldi's.  \n\nApparently a few years back, so guy who loved Grimaldi's decided that he liked it so much he wanted to own it.  So he bought it.  \n\nWell after cashing this guy's check the family that had owned Grimaldi's took their deep dark pizza magic and opened up a new place called Julianna's... immediately next to Grimaldi's.  \n\nWhen we asked one of the waitresses at Julianna's if this was true, her response was, \"Yep, this is the real deal and the Grimaldi's are nobody.\"\nHard to argue that.  \nWe arrived a little before the lunch hour, which was good, because had we shown up any later, we would have been in a very long line waiting for lunch.   \nThe restaurant itself is very clean, black and white themed with an open-to-view pizza making station at the back with a coal fired oven.  \n\nYes coal.   I had heard of a wood fired pizza oven, but here apparently the fuel of choice is coal, and there at the back is a blazing pizza oven with a heavy iron door too hot to touch being fed with shovels of black rock.  \n\nStacked to one side of this are wooden boxes filled with round balls of fresh dough that are rolled and tossed into pies on white marble counter tops by 2-3 guys  before being fed into  the aforementioned oven.    \n\nI've had all kinds of pizza from all kinds of different places, but this... \nWhenever I have previously craved pizza, I've had in my mind this vision of a delicious perfect pizza.  Unfortunately, real-life rarely lives up to the imagination.\n\nJulianna's though delivered the stuff of pizza dreams.  \n\nWe ordered the classic pepperoni and sausage pizza and received what I believe to be the most classically authentic and perfect pizza I have ever had.  \nIf Plato had ever been so lucky as to have tried this, he would have declared it the Ideal pizza delivered straight from the Third Realm.  \n\nMy only regret is that now whenever I want pizza, the only way to truly get what I want will be to go to Brooklyn.  \n\nThen as if that wasn't enough, we tried the New York cheese cake.   \nThis cheesecake was exactly what people really want when they ask for New York cheesecake, and having sampled it, I finally know why.  \n\nIt turns out that the cheesecake was not made on site though, and when we asked who did make it they servers weren't allowed to tell us.", "author": "Erik V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "This my second time at Juliana's and second time is definitely the charm. Our pizza was awesome...we had the #2 special pizza (just an FYI, you cannot do any substitutions on the specials), which was divine. \n\nWe ended up ordering dessert  and our waitress recommended the cheesecake and OMG it was by far the best cheesecake I've had in NY...so light (well, it definitely felt light) and yummy. \n\nSo if you've been here before (as in when it first opened up), forget that experience and give Juliana's another chance. Definitely a lot tastier than Grimaldi's.", "author": "S S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "I'm so glad we decided to eat here on a whim!  My husband was a fan of (the original) Grimaldi's when they were at the original location (and owner). He took me there after the move, and I wasn't that impressed.\n\nWe came in to Juliana's on a Monday during lunch time (can't imagine it too busy).\n\nThere was NO wait, and the staff was very friendly.\n\nThe pizza here is so FRESH!  We ordered the caesar salad and the margherita pizza with pepperoni.  SO GOOD!  The dough is just thin, crisp, chewy enough.  The sauce is VERY light, but so so good :)  Even though we ordered a pepperoni pizza, it didn't feel too greasy while we were eating it.\n\nThe caesar salad was tasty, but not exactly what you expect (more oily than creamy).  Decent, but not the best I've ever had.\n\nWe also ordered a Brookie bridge at the end of the meal. OMG those things are addictively good!!  I highly recommend getting one after the pizza!\n\nOverall, very good, solid pizza restaurant, and I'd would hands down choose this place over Grimaldi's next door.\n\nAlso a bonus, they accept credit cards!", "author": "April T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "If you're wondering if you should ditch the line at Grimaldi and walk in to Juliana's... DO IT! Authentic and awesome. Fast. High value. Courteous service. \n\nEnjoy.", "author": "John W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Recommended by lots of locals.  Did not disappoint.  Great thin crust charred wonderfully in their coal oven.  Arrive before 5p or it will be a wait.  Even if you have to wait it is so worth it.  White pizza is great but also lots of good toppings to add.  The desserts are wonderful as well.", "author": "Matthew Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-19", "description": "Toppings are delicious. Sauce was pedestrian. Small pizza with two toppings cost $30.00. Was looking for traditional NY pizza. This not it.", "author": "William M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Found this spot on Yelp! Thx! Worth the wait in line-  it moved fast. Excellent thin crust pizza, Service was great as well! After lunch we walked the Brooklyn Bridge - definitely coming back next time in NY! Thx!", "author": "Christina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "There's a good reason why Juliana's has nearly 5 stars.  The pizza is incredible.  If you are in the area and have some time to spare waiting in line, go check out Juliana's.  Or, for a pro move, order a pizza to go and take it to the park and find a bench with a beautiful view of the Manhattan sky line and devour your delicious pizza while taking in the sites.  Mmmmmm.", "author": "Paul W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "From a native New Yorker- this was the best pizza I've ever had! Waited 45 minutes to get a seat and it was entirely worth it. We got the #1 on the special pizzas and a cheesecake and cannoli- all amazing! The pizza crust is delicious. Excited to come back and try different pizzas here.", "author": "Eric T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "While Grimaldi's had their eyes on becoming a chain restaurant and selling out, little Julianna's took over their old residence and has turned out a far superior pizza. \n\nBeen here a few times and while always busy with customers I've been fortunate never to encounter a line, while Grimaldi's line is usually ridiculously long given its fame.\n\nI couldn't believe how perfect the pies are here. Each bite was like heaven. I'm usually a slow eater but I couldn't wait for my next bite! The crust by itself is thin and delicious and with a perfect amount of char from the oven. Also just soft enough to be folded if you wish to eat it as a New Yorker should. Sauce is so savory and garlicky, and the cheese is fresh and salty. With fresh basil on top the whole thing makes your tastebuds sing.\n\nAlso got a salad to share with the group. Very simple, fresh, and delicious. Dressed just right, not drenched. Just what a salad should be.\n\nThe place is moderate size, about 20 tables. Staff is really nice and attentive but they definitely give off the vibe of rushing you given how busy they are. Bussers are also always trying to clear plates even with partially eaten food on them and had to fight them off a couple times. \n\nWill be back many many many more times to come. Let the tourists hoard that other place, the pizza here is exceptionally better anyway.", "author": "Dante G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "They aren't exaggerating when they say it's the number one pizza in the nation. It's phenomenal. Also, the apple pie was the best pie I've ever had. Can't say enough good things about Juliana's. \n\nFor those wondering what the difference is between Juliana's and Grimaldi's, here it is: The Grimaldi family sold the name 'Grimaldi's' to the next door neighbor and continued their family restaurant under the name Juliana's. SO, the original and authentic Grimaldi family recipe is at Juliana's. Confusing, right? Basically, Grimaldi's is a chain using the family name and Juliana's is the actual thing. Hope that helps!", "author": "Scottie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "Juliana's was a wonderful experience all around. My boyfriend and I were visiting NYC for the TD five boro bike tour and both had a mad craving for some authentic Brooklyn pizza. Yelp lead us to Juliana's.  \n\nIt was 3:30 and we were standing in a short line outside (small dining area) and the manager comes out and very kindly explains that they need to re-stoke? the oven, that it was about a 20 min process, but we were welcome to sit maybe an appetizer while we waited for the oven to come back up to temperature. He promised a pipping hot, perfect pizza after the process. \n\nThe waiter recommended we  go ahead and our pizza order in, in order to receive the first pie out, so we did (margherita  pizza with added prosciutto) In the meantime we split a delicious Caesar salad. \n\nOur waiter (who was great, we had excellent service) did not steer us wrong. It was THE BEST pizza I have ever had. Every inch was a bit of heaven. Every ingredient was fresh. Mozzarella is made in house. The prosciutto was hands down the best I have ever had. Forget about adding red pepper or salt. It's not needed.", "author": "Ashton C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "Pizza was delicious! However, the line was ridiculously long (we started near Grimaldi's and it took us an hour to get in.) I do applaud their system of getting people in and out, though, without rushing mealtime.", "author": "Kaila S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "Hands down the most delicious pizza I've ever had the chance to eat. I've been here a couple of times and can't wait to go back in the future. All of the specialty pizzas are great! I'm sure you can't go wrong with anything on the menu. The service is also very friendly and welcoming. You can also get a pretty awesome view of the Brooklyn Bridge and lower Manhattan after enjoying a pie at this wonderful place.", "author": "Tracy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "In a nutshell: Pizza made by Patsy Grimaldi and his ovens right next door to Grimaldi's.\n\nI actually learned some history behind Juliana's before coming here. Apparently Patsy Grimaldi sold the name of Grimaldi's and the corner location, then opened up another place next door, bringing his ovens with him. Genius. Go to Juliana's for the best Brooklyn pizza experience. Juliana's is located in DUMBO nearby the Brooklyn Ice Cream factory.\n\nParking\nTake a train and walk here. Or take a bus...honestly.\n\nService 5/5\nWe were served by Patsy's daughter (or granddaughter....we think. She looked young), and she did an amazing job serving our group. One of my cousins spilled his drink all over the table and floor and she was super patient and cleaned it up without any hesitation. Patsy came by our table a couple times to see how our meal was, and even took a picture with us!  Everyone was really nice there from the owner to the bus staff.\n\nAmbience 5/5\nVery nice. The interior has a fine dining look to it, but is very welcoming for groups/families, or intimate nights out. The restaurant can be quiet and energetic, and having a view of the kitchen and ovens adds to the total experience. Patsy eats his own pizza in the corner, and the staff are always making rounds catering to all the customers. We even grabbed the sight of Patsy preparing the dough himself!\n\nWait time 5/5\nPizza comes out very promptly, so no complaints here.\n\nFood 5/5\nHere's what we got:\n\nSpecial Pizza #1 - A+ \nhttp://www.yelp.com/biz_photos/julianas-pizza-brooklyn?select=9Pcq5YWan5BHL0a6NI2uhg#DimRPhqB6-T_p_z5bPBJXA\nThis is essentially a white slice, but better!! Truffle oil is used in the place of olive oil to give that distinctive flavor. Every bite was packed with flavor, but didn't sit too heavy since it didn't have tomato and wasn't overloaded with toppings.\n\nMargherita Pizza with Sausage and Sweet Onion - A+ http://www.yelp.com/biz_photos/julianas-pizza-brooklyn?select=9Pcq5YWan5BHL0a6NI2uhg#CmI-KXIMpRTp5VLM9ETIHA\nSo we needed more meat in our lives. Sausage and sweet onion complimented this pizza very well, and the tomato sauce was light and tasty. Also, the fresh basil was bomb!!\n\nOverall 5/5\nThis is some of the best tasting pizzas I've ever had. Not super loaded with ingredients like Chicago style deep dish, though. If you're looking for quality of ingredients and the intricacies of flavor every ingredient adds to a pizza, this is the place to go.\n\nbomb.com", "author": "Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "After an hour of waiting, we were seated at the counter and were rewarded with both the view of the cooks assembling and firing the pies (their speed is mesmerizing) as well as two excellent pizzas. The #1, a white pie with bacon and smoked mozzarella, and a margherita with pepperoni were both excellent. Next time, though, i'll skip the $3 mini bottle of diet coke.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Wow wow wow, I have family that kept telling me about this place and wow. The pizzas are with out a doubt the best I've ever had. This place may get pretty busy so your going to want to come off peak hours. But this hit stop is defiantly worth going to, not worth but rather a must.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Great pizza! Very similar to Patsy's, but a little better. Is it the best pizza in New York? Nope. But it's fresh and delicious and will definitely hit the spot when you're craving pizza! The dining room was absolutely packed, but the service was great!", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Wasn't so excited about waiting outside just to get a table but it was well worth the wait ! Everything is so freshly made and the pizza is made very fast . The workers treat you so nicely and the place is very clean. The bathrooms were high quality. Definitely will refer all my friends to this place !", "author": "DJ Cory P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}