{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-20", "description": "Both pizzas came out burnt and the waiters answer was that it's supposed to be like that.  $50 for 2 pizzas so I can taste burnt pizza.  The worst pizza I've ever tasted.", "author": "Mohamad B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Adorable decor. Great quick service. The pizza was delicious, as were the vanilla and chocolate egg creams! We had to wait but it was worth it. We also had dessert: cannoli - yum!, brooki bridge and 2 dishes of ice cream. I actually thought our bill, which also included a beer, was reasonable.", "author": "Alison C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Another great experience here. The line in front was long but we were seated after about 15 minutes since we were willing to take an outside table. Half white pizza, half margarita with mushrooms, sausage and pepperoni. Delicious. Love this place.", "author": "Andreea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Our trip to NYC was to celebrate our birthdays and marriage anniversary. (they're all just a few days apart, thank God for making it easy for me not to forget) Juliana's was my wife's pick for the latter. We were blown away by how good their pizza is. We take pizza VERY seriously and usually are able to complain about something when eating it out (we cook pizza at least once a week with a dough recipe that spans across several days) - Juliana's was the one exception though. We loved the taste and texture of the crust. The toppings were of the utmost quality and the service was impeccable. In terms of portion sizes they're great - we know no limit when eating pizza, but we found the large portion to be enough for both of us. The setting is on the formal side and the open kitchen gained my trust. When we go back to New York we will definitely return. Thank you for an unforgettable anniversary!", "author": "Paul A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-30", "description": "Dumbfounded by the line? To avoid it we ordered a pie for takeout. We sat outside to eat it while it was still hot. The taste was average at best. If I waited in line for 90 minutes for such an average pizza, I would have jumped off the Brooklyn bridge. Don't believe the hype!!!", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Honestly my grainy picture can't do this place justice. I had the prosciutto pizza with arugula and oh my goodness this place is so good!! Brooklyn pizza is no joke and if you're in the jumbo area I would highly recommend. We went around 7:30 and there was a line outside. The wait is worth it!", "author": "Gina X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Now this is a great pizza! The crust is very good and not extremely crunchy which is nice. The large size is also very filling and can easily be split between two people. The Margherita is great here, I advise anyone in NYC to go out to this place, from Manhattan it's an easy subway ride and you're there!", "author": "Reese H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Walk-in for two people is generally fast; however, still make reservations. Otherwise, share one pizza! It is so much food, and completely delicious. If you are a pizza lover, this place is a must. I dont even like pizza that much, but I loved this place.", "author": "Jaheen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Holy crap is this pizza good. The line is long but it's one of the few places where the wait is well worth it.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Figure waiting at least 30 mins in line. I gave it four stars because I hate waiting in line. \n\nOnly really have pizza here, thin crust. I like the margarita $18 for medium. They only have espresso but the ice cream is from Brooklyn Ice Cream Factory and I liked the cheesecake. \n\nOverall I loved it, and it's a really nice area to walk around.", "author": "Cheryl P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-19", "description": "To me this is the original Grimaldi pizzeria, even though it has been renamed to Juliana's. As a pizza connoisseur, I can tell you that this is fantastic brick oven pizza, no matter what toppings you order. Pies are huge (medium is plenty for 2 hungry adults). The selection of wines is very nice. What I found silly is that they artificially maintain the line outside. When we were seated inside, there were plenty of available tables, yet there was still a line outside. :)", "author": "Katherine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "3rd time here while visiting NYC.  Well worth the wait.  Tried other Neapolitan style pizza places in New York and Juliana's is my favorite.   Everything is really good.", "author": "T C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "My best friend and I both had the day off so we decided we would check out Juliana's. Obviously, this establishment came highly recommended so we had to try the pizza for ourselves. We arrived around 1pm on a Tuesday. The line wasn't too bad; we waited for approximately 15-20 minutes before we were seated inside. After we were seated, the line seemed to die down significantly. \n\nOnce we were seated, our drink orders were taken and we inspected the menu. I stuck with water on this particular afternoon; however, they do have a sufficient wine and beer menu. For food, we settled on a small classic margherita pie. After a short wait, our pizza arrived at the table piping hot. All of the fresh ingredients and  the thin crust created a delicious pizza. Our server was incredibly attentive and friendly which added to our pleasant experience. \n\nOverall, we really enjoyed our experience at Juliana's and would definitely recommend it to others in the DUMBO area or who are exploring nearby Brooklyn Bridge Park. I know I'll definitely return!", "author": "Candace H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Walked by on a Thursday afternoon and did a double take eyeing the delicious looking pizza on the patio. We popped in just before a line started to form and were quickly seated. Stuck with basic Margherita pizza and a bottle of Rose. Great combo! The dough was perfect, the cheese amazing. Saw a line forming down the street at Grimaldi's but this spot has a nicer bistro atmosphere.", "author": "Mia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Juliana's is bomb!! their lines can get long so make sure to arrive early. Chances are, most people will line up at Grimaldi's BUT that doesn't mean Juliana's is going to build up. Do not ignore their pizza here! \n\nIf you're going on a pizza crawl, make sure to add Juliana's onto it. Their pizza is delicious. You get to see the pizza makers toss and roll around pizza dough, spread sauce and toss it in their brick oven. Prices match pizza size so make sure to order a large. Me and some friends ordered a large pepperoni which was legit. The pepperonis were cooked perfectly and weren't too salty. Their tomato sauce is light and isn't pasty. We also ordered three meatballs which were smothered in ripe tomato sauce which was sweet from the ripeness. This is also a great appetizer!\n\nJuliana's is definitely up there on my pizza list!", "author": "Allister D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "I know Grimaldi's pizza is famous but I heard this place was more original than them. There may be a line outside but their seating system was somehow very efficient and satisfying. The food was absolutely perfect. I got half and half pizza. It was cooked perfectly (of course) and neither the white or red sauce was too much or too less. Just right.", "author": "Lena F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "This is hands down THE BEST pizza we've had in NYC. Don't be fooled by the long line outside-- it indicative of how good it is. It's definitely worth the wait. We waited for approximately 30 mins so we took turns waiting in line and walking down to the pier and visiting the park next door. Once you're in the severs are super nice and friendly. We ordered the Matt's Mix salad and the No. 4 Signature pizza. You didn't need to put any additional seasonings or condiments it's that good! Definitely a must see if you're in the area or even traveling across the bridge.", "author": "Mary And Andrew Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Very good pizza. I got the margarita and added pepperoni and sweet onion to half. Everything was so fresh. The pasta figoli soup was good too. Great customer service here as well.", "author": "Tramaine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "i love love loved this pizza! it was a great ending to our walk across the Brooklyn bridge.\n\nStaff was super friendly and helpful with helping us make a decision on food and beverage.  Prices were way better than in Manhattan (duh).\nWe ended up behind schedule so needed to take a ferry back across and they helped us by pointing us in the right direction.\n\nloved the wood burning ovens..\nloved watching the pizza's being tossed.\n\nthere's a second bathroom downstairs...", "author": "Shalini G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "What can I say...probably one of the best pies I've had.  We walked over the Brooklyn bridge and got to Juliana's about 4:30.  Which was perfect because I was afraid we would have to wait a while to try it. We were able to walk right in and order. We ordered a white pie with pancetta, truffle oil and scallions....and it was amazing!!! I probably should have ordered something a little more kid friendly for my picky son, but he still ate it. Crust was crispy on the outside, soft on the inside and I was full after 2 slices because it was so Rich in flavor!", "author": "Eileen G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}