{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-03", "description": "I live a couple of blocks away and am desperately seeking an alternative to Grimaldi's (who's lines out the door are a lesson in the value of strong branding - not quality; Grimaldi's pizza truly stinks these days.)\n\nI really wanted to love Juliana's when it opened. Ordered takeout a couple of weeks ago and - while it was immediately apparent that the pizza is better than Grimaldi's - it's not good enough to bring tears to my eyes OR make me a regular. But the real problem is the disorganization: took 30 (!) minutes to get my takeaway.\n\nGuys at Juliana's - a piece of advice: get a professional to manage the floor. You're missing out on an opportunity to stick it to your neighbors (which I know you're dying to do.) Their product has jumped the shark but you're not making any friends with the mess and long waits. \n\nMeanwhile, I'm going to revisit Igancio's down the block...", "author": "Ron R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "Ahhh sooo delicious! My bf and I went here yesterday. There was a line but it really wasn't all that long. We were inside within 20-25 minutes. We sat by the counter and watched them make the pizzas. We were immediately handed the menu and the water, so I really can't complain about the service. The pizza came out in about 15-20 minutes - piping hot and fresh. I got the margarita and he got the special number 2. I liked mine better. It was scrumptious. I usually don't eat a lot but I ended up eating 5 slices! I was STUFFED. The price wasn't too bad. The place was a bit small and loud but it seemed more homey than Grimaldi's, which was next door. Definitely coming back here when I can!", "author": "Annie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "Went here with my cousins after soccer practice. The service was great, everyone was so friendly, from the hostess to the servers to Patsy Grimaldi himself. As far as the pizza goes, it is by far on top of the pizza world of NY with Motorino being the only real competitor. Patsy's, Grimaldi's, and Lombardi's are all great pizzas, but Juliana's beats all three in one way or another.", "author": "Marcel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Saw the line and said no way we are starving!!!! Decided to wait it out based on reviews and are so glad we did. Meatballs = amazing. 1/2 margharita and 1/2 white sauce pizza with added kalmata olives = amazing. New York cheesecake = amazing. Brooke Bridge cookie sandwich = amazing. Don't be tempted to go next door. Wait it out here! David was a great server as well and told us the history of the place. Mitch the back waiter was great too!!", "author": "Collette G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Absolutely delicious pizza. I actually found it to be just a bit better than my last grimaldis pizza, though I imagine both recipes are nearly identical. Either this place or grimaldis - you can't go wrong. Probably some of the best pizza in NY.", "author": "Simon G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-01", "description": "I had great expectations from the other Yelp reviews, but I was disappointed.\n\nThe place is large and with a nice decor, and the pizzas are very large.  But I found the pizza just OK, and quite pricey (my \"small\" No. 4 with arugula and prosciutto was $24 at lunch time). \nThe revealing sign: I left half of my pizza and they packed it for take away. I forgot it on the table, and I NEVER forget left over food...", "author": "Antonella P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-30", "description": "I came to try out this place on a Saturday afternoon. The wait was a lot shorter than Grimaldi's and we (5 people) got seated in 20 minutes or so. I definitely had a high expectation after reading about the odd and complicated history behind this place and Grimaldi's. But unfortunately, I was very underwhelmed with their margherita pizza. The crust was so soggy and flimsy, the sauce was very plain and the cheese was nothing special either. We got a large pie with pepperoni and mushroom toppings as well, but we didn't have much luck with that one either. In sum. Juliana's pizza doesn't come anywhere close to that of Grimaldi's, or even Patsy's, which I consider a step below Grimaldi's. Just don't bother to visit here, and go wait in line for Grimaldi's right next door.", "author": "Elle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "This place has quite a history between the owner - Mr. Grimaldi, and his long lost pizzeria next door, ironically carrying  Grimaldi's name. With that said, the pizza is absolutely nothing extraordinary. It is certainly overpriced, and half pizza toppings are charged as full. Personally, Domino's new York style pizza tastes better to me, especially for the price.", "author": "Leo T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "We had the Margarita Pizza with pepperoni.  It was amazing!!  Wes waited on us, he was awesome.", "author": "Debbie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Delicious pizza!! Crispy and light crust, fresh and delicious toppings, so glad we came here! Had half margherita with pepperoni and sweet onions, half white pizza with roasted peppers and a couple of Brooklyn Lager beers-delicious!", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "If you haven't noticed, both Juliana's and Grimaldi's serve up some of the best pizza in all of New York City.  So if you're split between Juliana's and Grimaldi's, as I'm sure many of you are, I'll make it easy for you: go to Juliana's.\n\nI tried both restaurants on consecutive weekends, and I can honestly say that I enjoyed my experience at Juliana's more than at Grimaldi's.  Why you might ask? Let's see...\n\n-Line was 3x as short\n-Patsy Grimaldi himself- yes, Mr. Grimaldi owns Juliana's (research the story if you don't know)- greeted us and walked us to our table.  We were pointed upstairs and had to find the table ourselves at Grimaldi's\n-We could actually order alcohol!\n-The pizza had a certain flavor and sweetness to it that Grimaldi's couldn't quite match.  (Don't get me wrong, Grimaldi's pizza is phenomenal as well, but Juliana's takes the cake in my opinion)\n-We could pay with a credit card instead of cash!\n\nIf you're in town long enough and have the opportunity, I encourage you to give both restaurants a shot, and you'll see what I'm talking about.  \n\nBut if you're only able to make it to Brooklyn once for pizza, then you know exactly where to go!", "author": "Trent N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "Got a chance to finally check it out this weekend and it definitely lived up to the hype.  I'm not going to pick sides between Juliana's and Grimaldi's but will say you can't go wrong with either joints when it comes to really tasty pizzas.\n\nThe pizza war is real and I'll happily accept it in my backyard.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "This is the original Patsy Grimaldi's, back under another name and is everything the lame place next door is pretending to be. The pizza is the authentic, traditional thing the way it was 20 years ago, and the service here is decent. Not wonderful, but not evil the way the rest of Old Fulton is.", "author": "Allison U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "Holy mother of Jesus!!! We originally took a train to Brooklyn to have lunch at Grimaldi's; however, we ran into a few locals who advised us try Juliana's instead! Grimaldi's and Juliana's are right next door to each other.  There is a line for both restaurants. A little history about the two.  Patsi Grimaldi was the original owner of Grimaldi's, he sold it when he decided to go back to Italy, when he came back to the US he wanted to buy back in and the new owner refused; therefore, he opened Juliana's right next door. Because of legalities he had to change the name of his business. Anyway, we are so glad that we chose Juliana's. The food was phenomenal and the service was outstanding. Mitchell served us and although he knew there was a line outside, he truly gave us his undivided attention and was sincere! We will be sure to visit again.", "author": "Krystal C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-23", "description": "They say open until 11, got there 10:10pm and they said they were closed. Can't hide the frustration, never gonna come back!", "author": "Marcelo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "Patsy poached us from the Grimaldi's line and bless him for doing so.\n\nI have fussy in laws. They're not always easy to please when it comes to eating out. We were off to a rough start in the Grimaldi's line. \n\nEating at Juliana's spared us the crazy wait. Our servers were kind and attentive, and the pizza was delicious- full of flavor, fresh, and the crust was perfect. It was a simple, tasty meal served in a timely fashion. \n\nMy mother-in-law left happy, which is a hands down win in my book.\n\nThank you Patsy!", "author": "Cat G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "Unbelievably delicious! The margherita pizza was perfection, and that's coming from two people who don't usually like tomatoes. We added pepperoni - heaven.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Meh.  Pizza wasn't hot, lacking sauce.  Overrated.  It wasn't bad but not worth the hour wait.", "author": "James J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Delicious pizza!! Great location and great vibe inside the restaurant. After driving from DC to NYC this was the perfect meal to start our New York vacation! I wish I ate here more during my trip.", "author": "Francesca G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Always a pleasure eating here. Why not the 5 stars? It looks like prices went up all around.", "author": "Ben C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}