{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "This is the true famous Grimaldi Pizza recipe! The back story reads like a soap opera. Patsy Grimaldi opened Juliana's after he sold his business and lost the right to use his own name. Juliana's was named after Patsy's Mother. It's right next to Grimaldi's. We got lost in Manhattan, trying to make our way there and then stood in line for a half an hour. It was so worth it. First time trying coal fired pizza. Yummy! The open kitchen allows you to watch pizzas being made, especially if you sit at the bar counter. The spaghetti and melt in your mouth meatballs were  also worth the wait. I also love how close it is to the waterfront and Brooklyn Bridge.", "author": "Katherine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "Always loved this placed since the time it was named Grimaldi's... noticed that they renovated the decor which lost some of its old school charm, but nonetheless still the same cozy space.\n\nGot my regular Margherita pie wtih extra garlic... but the real star of my latest visit was the Brookie Bridge with strawberry ice cream for dessert! Glad they created a tourist annex on the corner to avoid all the unnecessary hub bub that comes with out of towners!", "author": "Corey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "The perfect pizza. We walked in a few minutes before dinner and lines, so it couldn't be better. We didn't know this place was so famous and successful. We loved it, two pizzas, eating as much pizza as I could. The service rushed. The waiter wasn't happy that I wanted a second glass of wine, that was nerdy and monotonous.\n Maybe its overrated, but it is a good point to eat in different pizzas and make your own point of view.", "author": "Samuel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Arrived 11:35 on a Sunday. There wasn't a line. Waited for about 15 min for a takeout. Super good, super cheesy, a little bit too salty for me. But super high quality overall.", "author": "Claire H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "The wait was worth it, albeit it was cold outside. The staff was very nice and chill, not rushing us to order, eat or leave.  We ordered a large sausage \u0026 garlic, a small pepperoni, an order of spaghetti \u0026 butter (for a picky eater) \u0026 the apple pie with ice cream. \nEverything was delicious, so delicious that even the picky eater who never eats pizza tried it \u0026 really liked it.", "author": "Donna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "Went here last week while visiting home. Have no idea what all the hype is about. I ordered sausage and peppers. I got steamed red only bell peppers that looked and tasted like boiled tomatoes. The sausage was crumbled breakfast sausage. wtf? It was so gooey and watery in the middle we HAD to use a fork to eat it. Fair for the price, but not for the hype.\n\nAt least they take cards and sell booze, unlike the mobsters next door.", "author": "Barbara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "We ended up here on a cold and windy night. We chose this place because there was a line at Grimaldi's and this place was right next door; we didn't want to wait outside. We were greeted by the very own Patsy Grimaldi, the original owner of Grimaldi's. He walks around himself to check and chat with all customers. (If you want to know the interesting history of Grimaldi's Pizza \u0026 Juliana's Pizza, the newspaper article is posted right outside of the restaurant.)\n\nAnyway, first impression is that this place was warm and cozy. It was like walking into someone's house for dinner. The aroma of pizza filled the air and the view of the coal brick oven was straight ahead. I thought it was neat that you could watch how the pizza is made. We chose a large margherita pizza with some added toppings; Delicious! Don't miss out on the wine or the amazing Brookie's Bridge Brownie Ice Cream sandwhich with ice cream straight from The Brooklyn Ice Cream Factory.", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "We got here at 11:15 on a Friday morning. The restaurant opens at 11:30 and we were seated immediately. We ordered a white pizza with ricotta. The pizza was amazing and came less than ten minutes after we ordered it. Service was quick and our water glasses were always kept full. We were probably only here for about 30 minutes. Overall great experience and great pizza!!", "author": "Becky F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-22", "description": "I must have different tastes because I did not think this pizza was that great and I prefer Grimaldi's. My friend and I waited maybe 15 min to get a table on the Sunday after 4th of July which isn't a bad wait...but was unnecessary as there were at least 3 tables that were empty!\n\nWe ordered a pepperoni pizza and the spaghetti and meatballs. The pizza was just ok in my opinion, but I do like a crunchier crust and Juliana's was a little soggy in my opinion. Their famous meatballs were ok. They were very dense and tasted very meaty if that's what you're into. The spaghetti was pretty good. At first our waiter thought we ordered just the meatballs and brought out 3, but then when we explained we ordered them with the pasta, we only got 2. The spaghetti is more expensive, but I don't think the pasta is worth the price of another meatball! So I think they should have been priced the same.\n\nAnyway, overall I wasn't really impressed with the place. Our waiter seemed a little distracted even while taking our order and again, there were empty tables but a line outside the door. Just an OK place that I definitely wouldn't want to wait very long for.", "author": "Siri C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "I didn't think I was a NY pizza gal. But it turns out everywhere else I've eaten just hasn't mastered it. Totally worth the wait. We got a margherita with pepperoni. Sooo good. The part where the mozzarella meets the crust is pure heaven. I've never had ny pizza where the crust didn't get thinner or soupy in the middle until now. The texture was perfect. Everything about it was perfect. Service was fantastic as well. Our guy led us to great decisions.", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Best. Pizza. Ever.\n\nExpect to wait on line for a while but do try and get there before 6pm for an early dinner (waited about 30 mins on a saturday night). Lines got realllly long after I got out of the restaurant around 8pm!!\n\nService was excellent they were attentive and so friendly. The pizza took a while to come out so they gave us anchovy caesar salad on the house! You even saw the owner, Patsy going around with a giant bowl of salad and serving everyone. Patsy was so nice! He went to every table to make sure everything was good as well as seeing where everyone came from.\n\nLastly..the pizza!!! We made our own with pepperoni and mushrooms on a margherita pizza and it was a m a z I n g. The crust was perfectly crisp and chewy ( im the type that throws out the crust) and all the toppings and the tomato sauce were so fresh.\n\nDefinitely do not mind waiting on line for this joint again!!!", "author": "Shirlane K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Unbelievable good Pizza, nice staff and good service. Reservation is a must.", "author": "Clemens B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Im a native NY-er living in the west. Pizza place with the best meatballs I've ordered out. Saue was light and flavorful. Pasta fagioli was wine bean poured into your dish from a carafe. Cannoli with sprinkles. Staff was nice, place is cute", "author": "kt t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "Delicious, delicious! We hardly had to wait 5 minutes outside before getting seated at the right in front of the kitchen. We had a perfect view of the brick oven, and was able to watch pizza after pizza getting made. I was practically drooling at the site of the flawless assembly line of pizza making, hoping that the next one would be mine.\n\nWhen our margherita pizza arrived, I immediately dove in and demolished it. The dough had a mint of sweetness and the ingredients tasted super fresh.", "author": "Lai H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Been dreaming of this place since my last visit. \n\nWe had a delicious Margherita with sausage last time so we wanted to try something new. \n\nWe had to wait a few minutes for a table, but it turns out that Patsy himself was hanging out from enjoying a #1 which he shared with us. \n\nIt's not often that a proprietor shares free samples with guests in front of a NY restaurant when it's barely 30 degrees outside, but he did.\n\nThat convinced us to order a large #1 and a #2. \n\nAdd in a cold Stella and you have pizza nirvana.", "author": "D M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-16", "description": "Way too crowded and long lines not worth it your better off at the place next door grimaldis that place was amazing", "author": "Ana P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "I'm writing this review months after, but I can still recall the deliciousness! I was in line for Grimaldi's in the freezing December cold (I'm from CA so anything below 60 degrees is cold), I was the last one in line and everyone behind me slowly fell out of line and rushed to Juliana's. Of course the cold got to me and I followed their lead after reading a few previous yelp reviews revealing how Patsy is the original owner of Grimaldi's. The wait was much quicker for a table. \n\nWe ordered a Cesar salad and Margherita pizza with pepperoni, sausage, and mushrooms. The salad was fresh and tasty. The pizza dough was delicious, it was thin and not soggy at all. The mozzarella cheese melted on top was perfect. The ingredients were very fresh and was pretty evident in the pizza. We also ordered 2 beers a Brooklyn Lager and a Kelso Pilsner. I liked the pilsner better. \n\nI'm glad I came to Juliana's, it was one of my favorite places to eat in New York!", "author": "Tiffany V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-17", "description": "Overshadowed by Grimaldi's that's down the block. This little pizza restaurant has a lot to offer. I decide to give this a try when Grimaldi's entrance was stretched a mile long, lol. \nTheir pizza can measure up with that of Grimaldi's. As for service? Them over Grimaldi's any day. Their cheesecake was amazing as well. Couldn't ask for a better meal. \n\nOverall, I'm glad we went here instead of waiting hours. The place can get pretty packed with tourist, but like any other place in DUMBO, which place isn't? And did I mention it wasn't cash only?", "author": "John T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Juliana's is a must when you're exploring Dumbo and Brooklyn Bridge Park.   There're many positives about the newer pizza joint in this historic location.  \n\nFor one, it's a beautiful space, I love the comfortable and spacious seating arrangement which includes a bar that can score you a birdseye view of your your pizza being assembled and cooked in the oven, which is quite entertaining.\n\nIt's also a shorter wait as opposed to the line for Grimaldi's.  Every time  I've been here, the line always seem to be half the size of the one for the neighboring Grimaldi's.  Which is great if your're starving!\n\nThe staff is always friendly and upbeat, which is always appreciated,  especially when catering to a touristy crowd.\n\nAnd the pizza itself is Good, buttery crust on the drier side.  Fresh Ingridents.  The pizza always looks gourmetish to me, just the way I like it.\n\n\nEverything is almost impeccable about Juliana's, except if you're a vegetarian or a vegan or a person who's in any way strick about the way  your food is prepared, I would be cautious about dining here.  \nAs I've observed that the preparation of the pizza is done in a way where it's easy for the person making your pizza to have handled meats from previous orders.  It's quite possible that your veggie pizza was made by the same guy that  just assembled the meatlover's special that the couple is enjoying next to you.  Not a big deal to most people, but some customers might be particular about this.\n\n\nJuliana's is definitely a place to try while in Brooklyn, but at the same time, some folks should be cautious.", "author": "Seema J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "We got here around 1pm Sunday afternoon and the line was out the door! Parking around the area was tough as is with anywhere in NYC but we were luckily able to find a spot at a lot by the park a 10 min walk away. That parking lot is just right along the water. We ordered a half margherita and half pepperoni pie. When it comes to pizza we like to keep the ingredients simple so we can taste the quality and saltiness of the cheese and tomato sauce along with the texture of the dough. If we had to do it again I'd order all margherita. There was a perfect balance of mozzarella, sauce, and basil. The pepperoni topping overpowered the delicate flavors of the simple margherita. Some places skimp on the basil but this place gets it just right. This place has a slight one up on Lombardi's but still nowhere as good as pizza from Naples... still looking for that perfect pizza spot! I don't think it'll be worth another trek out to Brooklyn from Manhattan for this but I'm glad we gave this place a try!", "author": "Michelle T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}