{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Totally worth the wait. The place is pretty large inside so the line does move pretty quickly depending how large your party is. The host is accurate when they give you an approx time. We were party of two and got in within 45 min at 6pm on a Sat. We ordered a fabulous glass of wine and small Margherita with meatball. Pizza comes out quickly and very fresh. Sauce is sweet. Small is more than enough for two! Also end your meal with a delicious brookie bridge- two cookie shapes brownies with BK ice cream factory's vanilla in between. Just delicious. Attentive nice staff.", "author": "Mary S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "Oh my goodness, this is good pizza. \n\nWe happened to be in Dumbo after taking the ferry from Governor's Island and saw the line for Juliana's 4 pm opening already about 15 people deep at 3:30. We were hungry and wanted pizza, so we resolutely got in line. Be careful which line you get into, because we almost went to Grimaldi's. The backs of both lines get close to each other. \n\nWhen the restaurant opened at 4 pm the line moved very quickly. We were seated by 4:10 pm. We ordered the margherita with pepperoni and the no. 1 special pizza. The margherita was perhaps the best pizza I've ever had. The sauce was delicious, the pepperoni is bursting with flavor, the cheese unbelievably fresh, and the DOUGH. Such beautiful charring, chew...you guys this pizza is astounding. The No. 1 is also delicious but it's a testament to how good these guys are at the simple classic that I am dreaming about that margherita/pepperoni pizza. This is now the pizza other pizza places have to beat. \n\nThe place is simple and cozy with the requisite photos of famous people who've eaten here all over the walls. The staff is courteous but not falling over themselves to please you, totally a New York City establishment. You're not going to linger over glasses of Italian wine as your pizza slowly dwindles away. Eat, revel in how good it is, then pay and get out. That's fine with me. Just keep feeding me this pizza. \n\nFun fact: while we were in line I was wondering if we should try the famous Grimaldi's when a tour guide with a small group came by and actually explained the history of both iconic pizza places. Apparently, Patsy Grimaldi (THE Grimaldi) first opened his pizza store where Juliana's is. When he retired he sold his name and a totally different person/company opened Grimaldi's next door (and installed their own coal oven). Then, Grimaldi got sick of retirement and came back and opened up his shop again, but he legally couldn't call it Grimaldi's (or Patsy's, either, because another Italian pizza family owns that name), so he named the place after his grandmother. SO, if you want a slice of history, Juliana's IS Grimaldi's. Same historic guy, and same historic oven.", "author": "Sehaj S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "This is how a great restaurant should be run! We were told by a tour guide to give this place a try for authentic, delicious pizza.  When we arrived, there was a line down the block, so we were tempted to go to the place next door, but the line moved so quickly it kept our interest despite the bitter cold.  The service was spot on, though the place was packed.  We got the margarita with additional pepperoni and sausage on half.  I will admit the plain margarita was not very exciting, but the half with the add ons was delish! I could tell my whole family was enjoying the meal because we all fought over the last piece and we ignored our beers!", "author": "JADA s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Mr. Trimmel C provided an excellent customer service. He even volunteered to take our picture. Pizza #3 was great and the homemade soup hit the spot.", "author": "Peepeye L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "My favorite pizza joint. Lovely staff and quick service. You can watch the pizzas getting made and cooked in the stone oven. Also tried meatballs for an appetizer and they're very tasty too. So, i would be back for sure.", "author": "Kendall R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "One of the places I visited due to the reviews online and recommendations of friends. Stood in line with a friend for about an hour and for the number of people the restaurant was serving, it went by very quickly. The pizza was quite large and for two people we were able to split one. The server was very kind and recommended us the No. 4 pizza special. The thin crust and the arugula/prosciutto pairing were nice.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "This is the real Grimaldi's, started by Patsy Grimaldi after he sold the original Grimaldi's off. Come here for the pizza you heard about.", "author": "Loren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Overall decent Pizza. I think this establishment is one of the better options in DUMBO. We ordered No. 4 (prosciutto and arugula). The pizza could definitely use more of those toppings, but I could tell that all the ingredients used was super fresh. However, the pizza didn't have that \"wow\" factor. \n\nThe crust sort of lacked the marbleization that I like, and the marinara sauce was a bit overpowering. It was definitely on the tangier side as other reviewers have mentioned. \n\nAgain, the experience was overall great. I would probably come back if I am in that area again.", "author": "Ash H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "I spent the 4th of July down in Brooklyn Heights and DUMBO, with a friend, and I recommended that we go to Juliana's for great pizza (I ate there once before). Anyway, I predicted a long line, and I was right. The great thing is, the line moved quickly and before we knew it, we were seated by a very friendly staff. We split a classic LG Margherita Pizza and WOW, the pizza was even better than the first time! The crust was amazingly thin and crisp. The sauce tasted so fresh and savory, and the fresh mozzarella was gooey and perfect! \n\nWe had a great time and an even greater meal! I love Juliana's!!! Definitely in my Top 3 pizzas in NYC.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Best deep dish I ever had was in Chicago. But this wood fired pizza was soooooo good. Service was very good and it was well worth the wait. \n\nOnce we were seated we were served quickly and our pizza didn't take long to arrive after ordering and when it arrived, WOW factor - The large pizza was huuuuge!!! Ample for two normal sized people to share. The pizza was incredible, we kept it simple margarita with a single topping of meatballs and it was the most delicious pizza we've ever eaten, completely worth the wait and very well priced!", "author": "Rose J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "Went here yesterday for lunch. There was about a 10 minute line,  but seemed much shorter than the line at Grimaldi's next door. They have a good system for keeping things moving, so we were seated shortly. Ordered the Margherita pizza. It was delicious. Tangy sauce,  chewy mozzarella,  light thin crust. Everything seasoned perfectly and all ingredients tasted very fresh. Would love to go back and try some of their other pizzas. All the other pizzas we saw come out looked incredible.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Learned about this place from our Tour Guide and boy what a great decision it was to come here, even though it was a bit of a wait.  They are spinning the dough in the front of the house and the place is poppin'!  We waited desperately for this pie to come out and when it did it was like the doors of heaven, or at least what I imagine it'd be like, opened up!  The smell, the colors of the cheese, pepperoni and basil, looked amazing!!!!   We lifted up a cheesy triangle from the pan and the cheese just kept on coming!  Oh my starchy goodness!  My mouth is turning water as I am typing this.  As I ate my yummylicious pizza, I couldn't hear or see my surroundings it was like I entered a twilight that I did not want to leave!  I could see my amigas doing the same. Oh how I love New York mostly because of the pizza, it is like the hand you don't want to let go of! \n\nI have nightmares of that day; someone tries to steal our pizza and we shoot them down with marinara covered meatballs and we save the day!", "author": "A M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Be prepared because there is always a line outside but it's so worth the wait. The wine and pizza do not disappoint. One of my favorites!", "author": "Amanda N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "The pizza was great but wouldn't say it's the best I've had. It's as good as other good pizzas with that coal fired taste.", "author": "Christopher H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "So Lombardi's has totally fallen off a truck now, so Juliana's is officially the best \"fancy\" pizza in the city. It's perfectly cooked, juicy, cheesy and a great value. The line is long but WELL worth the wait. The service is amazing and the owner is there all the time hanging out with the customers and making things are running smoothly. You can tell that he has zero tolerance for bad service. Even the wait isn't bad because you get to hang out on the waterfront in dumbo. Lots going on to stay entertained. Highly recommended!!", "author": "Charles A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "We arrived just before they opened at 11:30am on Sunday, and there was already a line of 12 or so people ahead of us. Gremaldi's, next door, also had a decent line. Fortunately the inside of the restaurant was much larger than it looked from the outside and we were immediately seated. It does not get as crowded as Grimaldi's and we're glad for that.\n\nAfter our waiter explained that the \"small\" and \"large\" sizes were 16 and 18 inches in diameter, respectively, we decided that the small would be more than enough for the 2 of us. We chose to get the margherita with sausage added to it. It tasted very much like Atlanta's Antico's Neapolitan style. It stayed hot the entire time we were there, which was great. In the end, we took out 1/4 of the pizza (2 slices) to go. They have a limited amount of craft beer selection too, but we sadly decided to forgo the beer during lunchtime.\n\nOur waiter was exceptional and noticed our indecisiveness right away (how embarrassing of us) and was very helpful in guiding our order selection. He also seemed to be one step ahead of us as he knew what we wanted/needed before we asked him. Unfortunately, I forgot his name.", "author": "Ophelia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Juliana's Pizza is definitely worth the hype! I was in town from Chicago on the hunt for the best New York slice, and my friend and I stumbled across Juliana's. There was a little bit of a wait, but it was so worth it. We ordered a margherita pizza, but you can also make your own. The pizza was light and delicious. All the ingredients tasted fresh and it definitely left my belly full. \n\nThey also have a good drink selection, we ordered two blue moons. They went awesome with the pizza. We also got a chance to try the cheesecake. It was amaaaaaazing. I will definitely try to come back to this spot if i'm by DUMBO again. \n\nThe service was also very attentive and friendly. Thumbs up for Juliana's (:", "author": "Simone R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "One of my best pizza experiences. It's something else with the white pizza, but it is extremely tasty. It was crowded when I was there, but I guess it always is. As I was only one, they found me a seat at the bar counter pretty quick. Had to wait a bit to order and to pay, but the pizza came rather quick and was amazing. Will most likely visit again. It was really worth it.", "author": "Frans T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-20", "description": "We were sat at a table for two very close to another table for two. (It was a table for four that had been separated by inches, to create the seating arrangement for us and another couple.) First things noticed, the couple on the wall side of these two tables (we were on the aisle side) were not able to stand or exit without me and my dinner mate getting up as well. Then, the server came with drinks for the inside couple and reached over our table, which was not very big and made for an arm in the face. \nThe meatballs and pizza were very good but we couldn't finish it. When asked to have a box to take pizza leftovers home, the server took our pizza and came back with a bag. Inside the small paper bag were three foil wraps. Inside each foil wrap, two pieces of pizza were pressed face to face - cheese to cheese - and then wrapped in a foil sheet. Seriously? The server took our bill and reached across us again to finalize the inside table. Our server was inattentive and a bit rude when asked questions. I'm outta here.", "author": "Morgan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "My sister and I were in NY last weekend just for a fun sibling weekend. On Saturday morning we decided to be complete tourists and walk across the Brooklyn Bridge on a quest for some authentic New York pizza. We had heard Grimaldi's was good so we went in search of their restaurant. We stumbled upon Grimaldi's and to be honest it looked really grim from the outside. Juliana's which is right next door, on the other hand, looked fresh and inviting with it's bright awning, big open windows, etc. We decided to check yelp to see who had a better rating and Juliana's was the favorite. So, our decision to go to Grimaldi's changed and we got a table at Juliana's.\n\nWhen we walked in they had just opened for lunch. Service was a little slow to get to us at first but Terrence eventually stopped by our table, took our drinks and pizza order, and then we took a minute to read about the history of Juliana's. It turns out Juliana's was actually started by Patsy Grimaldi after the family sold Grimaldi's to someone outside their family. Knowing what they do best, Patsy decided to open up a new pizza joint right next door to Grimaldi's and Juliana's was born!\n\nWe had ordered a small margherita pizza (about 14 or so inches across) with anchovies (I love anchovies) and when it arrived my life changed... As a Chicagoan I'd like to think I know something about good pizza....but holy crap Juliana's is incredible! The ingredients use were so fresh and of such high quality, the crust was perfectly cooked, and for once in my life I felt so very satisfied finishing off such a giant pizza. When we were done eating I told our waiter Terrence how delicious that pizza was and to this day I'm still extolling how delicious it actually was. I could actually go for a slice right now...\n\nAnyway, this place is incredible. The pizza is delicious and if I ever return to Brooklyn there is no doubt in my mind which place I'll go for a pie. In the past I have given quite a few 5 star reviews but after eating at Juliana's I'm not sure 5 stars would be appropriate. Juliana's deserves 6 stars at a minimum, or even a gold star, something letting the world know this place is a true gem.", "author": "Ryan L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}