{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-24", "description": "This place is a big hype for sure. I have my fair share of eating pizzas, from boxed one at the grocery stores, chains, local fancy restaurants, and also the homemade ones at hole in the wall places (which actually set the standard of a good pizza for me). When I travel to NYC, I really wanted to try good pizzas, but this place just doesn't live up to the hype. The crust is chewy like rubber, the soggy thin crust below the cheese makes it unpalatable, where is the brick oven crunchiness and aroma? The cheese and toppings were very skimpy. If the food isn't good, forget about anything else. It is nice that they put their take outs in paper bag instead of a large cardboard, very environmentally friendly. But after eating the pizza, I realize it was not friendly to my body, my heart feels like it is racing, makes me wonder what ingredients and oils they put in this pizza. Usually, foods like coffee, msg, poly unsaturated oils give this effect. I liked that they used fennel for the Margarita...but then again, how hard is sprinkling herbs on cheese. After eating here, I will now make sure to read more reviews that are three stars rather than falling for the fives for restaurants with high ratings. I give this place one star for everything else.", "author": "Glisten W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Want to skip the absurd lines at Grimaldi's and get pizza from the real Mr. Grimaldi at the same time and in the original location...it's simple, just go to Juliana's.  Patsy Grimaldi, the proprietor, understands the real meaning of customer service and makes his guests feel like actual guests.  The pizza is amazing, too.", "author": "Brian Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Charming interior with a brick oven pizza, you could even sit by where they make the pizzas to watch! We had just walked across the Brooklyn Bridge and were definitely ready for lunch. We got the Margherita pizza and it was absolutely delicious. The thin crust was my favorite part, and the mozzarella and basil complemented the whole pie perfectly. My only hesitation in not giving this pizzeria 5 starts was the service, it was a bit slow, and I had to keep asking for refills on water and on my drink, the only negative.", "author": "Misha Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Words of advice: take out a pie and sit in the park on a sunny day, easily one of the best pizza's anywhere, i could eat it daily, it takes a lot of will power not to. Patsy for president", "author": "Jeff W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "This place is every bit as good as Grimaldi's. Pizza is better, there's no wait, and it's cleaner. We had the scarmoza and it was amazing!! One of the best pizzas I have ever had. \n\nNote: crust is thicker than patsy's or certe.", "author": "Caroline L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "After a concert at Bargemusic, we were starving, and craving a pizza.  Having already tried Grimaldi's, we raced up the hill hoping that Juliana's kitchen was still open.  It was, and we were soon seated around an incredibly huuuge margarita with pepperoni.  The service was friendly, if a bit aloof, but the kitchen worked quickly and the result was sublime.  Blackened crust, plenty of fresh tomato, mozzarella, and sausage, but a bit light on basil.  Nevertheless, the flavor was great, and the size of the pie meant that lunch was sorted for the following day.  \n\nIs Juliana's better than Grimaldi's?  I would say yes, but there's not much in it.  Where Juliana's outclasses the big G is with a classy ambiance; Grimaldi's feels like a barn packed with tourists, where they're only interested in turning over tables quickly, and that has to count for something.", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "We live in the neighborhood and were finally able to sit down on rainy night recently. The restaurant is cute and feels New York-y. The pizza was good, I love their tomato sauce which tastes so fresh, but ours was a little undercooked and not sure crispy.", "author": "Molly P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "It was okay, got one of the specialty pies. Don't think it was worth $27 though.", "author": "Ldiz Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "I've worked at a \"NY Style\" pizza place for over 8 years and this was hands down the best pizza I've ever tasted.", "author": "Chazz H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-04", "description": "No idea why this place has 4.5 stars. While the waiting staff was nice, the manager that was assigning the seats was extremely rude and seemed annoyed that he had to speak with us. We just asked whether we could wait inside on a windy cold day (and we were the only ones waiting). The salad was okay and so were the meatballs. The pizza was soggy and fatty and not very flavorful. It went cold very fast. If this is one of the best NY pizzas I don't want to try the bad ones. We went later to get a slice at Joe's pizza. Enough said.", "author": "Kuba R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Love the pizza. Coal oven. Never ever ever take this to go.I can't believe some idiot did that. This is not a pizza parlor where you get a slice to go. You go for the experience and the gourmet pizza. One tiny bit of criticism, the arugula pie looked like the guys in the back got a pre packaged arugula salad and popped it over the pizza. It was good but presentation left much to be desired.", "author": "K M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-28", "description": "The Pizza was quite good. I enjoyed them all very much. The Margarita with Italian meatballs was excellent. However, I can honestly say the service I received was atrocious. We were forced to wait for a long time despite a number of tables being free. We were able to see four tables available but the man who was in charge of allocating tables was more concerned with speaking to his friend in the corner than actually filling these tables despite a number of people waiting in the cold outside. To top things off we got our pizza before our drinks.", "author": "Liam O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-24", "description": "Haven't been here since it was the \"old\" place. Pizza tasted a bit better but not much different from next door. Prices are higher and service was quick. They cleaned up the decor and looks much better but at a price.\nFunniest part of the experience is that the hostess pretends to know you as if your are buddies for 20 years.", "author": "Vadim K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-11", "description": "Make sure you have plenty of time to kill before coming here and eat before you arrive. The management here is awful. We arrived, asked for a table for 2, and were told by the manager 10 minutes. 20 minutes later we were seated and when we tried to order our apologetic waiter informed us they were cleaning the oven and it would be 45 minutes until our pizza was ready. We asked the manager why she had not told us (or any of the other tables she sat around us) about the oven and she tried to start an argument with us. The two tables around us got up and left. \n\nWe ordered a salad and put in our pizza order. A large party came into the restaurant in the meantime and was seated and served within 30 minutes. An hour later, we received our pizza and were rushed out of the restaurant. \n\nNext time I'm in the mood for pizza I will wait outside at Grimaldi's for 2 hours.", "author": "Meredith L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "My family loved the food here.  There was a line to get in, but the wait was definitely worth it.  The No. 4 pizza with tomato, mozzarella, arugula and prosciutto was delicious. The homemade meatballs were also good. The also have a decent selections of wine.  One of my favorite NY pizza places.", "author": "Vivi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "Excellent pizza!  They are huge too - 16\" or 18\" sizes.  The toppings were really fresh and baked in a coal fire oven.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Awesome pizza place in Brooklyn and great location with beautiful views. Must go to pizza spot. And friendly staff too.", "author": "Jorge P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "I ordered about 3 take out Margherita pizza's yesterday for a picnic in Brooklyn Bridge Park. The pizzas were scrumptious! Just the right amount of cheese to tomato sauce ratio. 3 things I didn't like: It wasn't very hot, a tad too much char on the crusts and the pizza could have used some more basil. Next time I'd order to dine in the restaurant and ask for extra basil. It's worth coming back!", "author": "Jenya W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "One of the best pizzas I've ever had.   Pat Grimaldi knows how to make awesome pizza and he doesn't fail with these pizzas.  We waited 20 minutes on line to get in and met Pat Grimaldi himself, very charismatic and full of energy for an 80 something year old.  It was funny to hear him heckle customers for the Grimaldi's pizza place right next door and hear his say, i m the real Grimaldi and boast that he makes the better pizza! So we ordered the pancetta and scallion pie, and also the sausage pie.  Both were incredible. Of course both were about $30 each, plus beers/ beverages.  Spent about $100 on a pizza \"experience\" as the food was so good I can say it was better than saying I had pizza.", "author": "Gene K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "As soon as I heard the ORIGINAL PIZZA GANGSTA, Patsy Grimaldi re-opened at his original spot on Old Fulton Street - I had to go try it!  I stopped going to Grimaldi's shortly after he sold because:\n1- it got so corny and commercial\n2- Patsy never gave them the recipe for his dough!  Please he is way too smart for that\n\nAnyway, Juliana's is pretty, clean and the pizza is just delish- in fact the DOUGH is so freakin' good it's like eating cake, I mean it's just melt-in-your-mouth//please-give-me-more good.\n\nHappy for him and his family- People step off- the Original Pizza gangsta has returned to claim his territory!", "author": "Caterina M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}