{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "Don't know why people are standing in line at Grimaldi's with this place next door. The original OG (or should I say PG?) - and the owner's wife was even walking around, checking on everyone, making sure everyone was well taken care of. Had to try the margherita (so simple, so good) and also had the #1 special (Housemade mozzarella, Scamorza affumicata, pancetta, scallions and truffle oil). Both were great - crust had a nice chew and soft enough to be folded in half, but also was just crusty enough to hold up to the toppings without getting soggy.", "author": "Judy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "Good pizza but it could have been better. We ordered the # 2 because we wanted tomato sauce and #1 and #3 said \" no tomato \" Since #2 didn't say that we were under the assumption that it had it sauce.....which it didn't.   We left underwhelmed", "author": "Adriana P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "Don't be fooled. THIS is the original Gramaldi's.  They have Patsy Gramaldi and the original coal oven.", "author": "Joseph O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "It's all very complicated, this legal wrangling between arch rivals, but at the end of the day, we are fortunate enough to have TWO great pizza places next to one another.  You can't go wrong with either one.   Julianna's staff is super nice whereas Grimaldi's has it's annoying moments that seem to be worse as the summer months approach and the lines get longer.  Enough! The pizza is so good,. A chewier crust than Grimaldi's, but just as salty and yeasty tasting.  Fresh mozzarella, bright tomato sauce and very cute pepperoni cups that ctisp up.  I'd go to Julianna's any day and feel like I got the \"real thing. \" Prices are equivalent.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-18", "description": "This is Grimaldis place. Go here rather than Grimaldis. Actually, wait, no everyone go to Grimaldis. Yeeees, it's much better.", "author": "Greg N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "I and my daughter could not understand why we never came here before!! We've lived down the street for years, yet never tried it, but now it's a weekly occurrence! Staff is so sweet and great with children and the play area for my daughter and her friends is so safe and great while we wait", "author": "Yorkie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-04", "description": "This restaurant is perfect where it situated itself. It is directly next to a famous pizza place where people wait in line all day. For all the people who just want good italian food but do not want to wait this is the place to go. It is a little fancy for where it is and who it attracts but still very nice atmosphere. They have a good menu with classic italian dishes and pizzas. The only thing I think keeping this restaurant from not being GREAT is there seating situation. The tables are too close together and if you come with only 2 people in your party they will sit another party right next to you and its almost like you are at dinner with these people you don't know. It honestly ruined my meal for me because it was so awkward and the waiter has to reach over the other people to give you your tables food and its just awkward all around. I honestly would only consider going back if I had a bigger party and didn't have to be sat next to people I didn't know. Other wise there are plenty of other italian places worth going to.", "author": "Kara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "We went the first week it opened, have been back several times. Always good. Great crust, to the end. Toppings are fresh. Friendly staff. The Grimaldis are usually there and very good at making people feel welcome and happy. Patsy gave our daughter a cookie yesterday (home made) and my son a cup of lentil soup (that was nice on a cold day).", "author": "Mama G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-16", "description": "Pizza was burned and stale and tasteless. To top it all of, the staff was rude. Def not going back!!!! Do yourself a favor and get some good pizza next door at grimaldis. This place is SO not what it makes itself out to be.", "author": "Nadia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "Best pizza I have had! Warm atmosphere! Friendly staff! Only negative thing I can say is the line to get in but worth the wait. The owner even greeted and chatted with us as we waited in line.", "author": "Dusty O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "Hands down my favorite pizza in the world! As a Brooklyn resident, you better believe I've had my fair share of pizza, and this one really takes the cake, or should I say, pizza pie.\n\nA little over a year ago, my fiance and I walked past the former location of Grimaldi's, where Juliana's now resides, and saw a banner that the real Patsy Grimaldi was coming back with his personal brand of pizza. We eagerly anticipated the grand opening, and upon hearing news of the restaurant making its opening, we went to grab some pizza during opening week. \n\nWOW were we impressed!! Since that night, I can't count the amount of times on all my fingers and toes I have been back for a piece of the pie. And we generally don't return to many restaurants so that we can try all the city has to offer.\n\nMuch friendlier than that place next door that rushes you in and out, has poor service, and has a tacky sign that indicates they don't sell slices and only accept cash. You might see a line next door full of tourists almost on a daily basis. Little do they know that the real Grimaldi runs Juliana's. You can read all about the pizza wars and the history with a simple google search. You can also read the great article Juliana's has on display while visiting.\n\nSkip the line next door and walk right into Juliana's for a true culinary masterpiece and treat. Every time friends come to visit asking for a true Brooklyn pizza experience, this is the place we take them. And Patsy himself is generally present, usually socializing with the guests and ensuring every customers' experience is enjoyable. He even poses for pictures.\n\nIf you want the best pizza you'll ever have, then this is the place! Go here, it will not disappoint.", "author": "Lisa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Just to clarify I'm no pizza expert, in fact, pizza is way down the list  of my favourite eats!  Saying that, if I'm going have have pizza from now on this will be my go to place. The restaurant was busy and because of this mr Grimaldi was going around the tables and giving free bowls of minestrone soup to those who had been waiting awhile, us included, very nice touch.  The pizza, prosciutto arugula and pepperoni was delicious, just thin enough and cooked perfectly, no soggy bits!", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-04", "description": "The pizza was too salty,especially the olive. The pie was too soft that might be undercooked. The cut was very uneven, some slices are so big some are so small. They use untrained employee who did not even know how to cut a pizza properly. The receptionist was rule that using her cell phone while talking to us plus the way she talks was very unfriendly. Bad interior design which looked very cheap. This is for tourist !", "author": "Jessie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "On a day trip to NYC, I was given a crash course on the pizza war.  I was told this is the real Grimaldis, which sold its name to the now Grimaldis (literally next door down, which got more touristy and less in quality supposedly) and couldn't use the name anymore. So he named it Juliana's after grandma and uses the original oven. Can't attest to the accuracy of the info however. We walked across the Brooklyn Bridge and got there for lunch on a Saturday. The space is tiny, so there was a wait (outside by the curb) yet it wasn't bad at all.  The hostess kept us informed on the progress of the wait, which seemed to impress our local friends. The service overall was efficient, nothing too special but seems to be above average for the city per our friends.  The ambiance was a nice down home feel without being dumpy. It looked so nice that I at first questioned the food quality (since I thought REAL pizza joints would look more like holes in the wall)\n\nHere comes the food.  Menu selection wasn't huge and everyone seems to stick with the basic, the margherita.  For good reason, because it was indeed fabulous. The freshness of the tomato sauce and cheese is apparent.  The dough was yummy, not too doughy, but not as thin crust as I thought either. We had a 2nd smaller one (16in instead of 18in, not much size difference in my opinion, still pretty big and plenty for 2-3 ppl) with anchovies and sausage. The sausage was made with fennel, and has a very prominent taste because of it, beware.  Anchovies added saltiness (\u0026 fishiness), thus making this a very powerful combo. I liked it but not sure if it's for everyone.\n\nI saw the calamari being passed nearby, which I thought looked rather delicious and plentiful for $8. The plain pie was $19 for large, $16 for smaller one.  The 2 extra toppings were $5. I have no idea how much a pie is normally in NYC, it's a little pricey for pizza I thought, but this is definitely not just another pizza place so it's worth the splurge.", "author": "Peggy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "I went here on my last visit to the city, Its a small but cozy place so if you walk all the way over the bridge and find yourself waiting in line at Grimaldi's you're probably better off taking this place. I had the margarita with perperoni and housemade meatballs. The service was fast and friendly. And the pizza was very tasty.. I also had a glass of the Sawbuck Cali Cabernet Sauvignon which went really well with the pizza, its a fine wine. One of the waitresses I thought, was very cute and thats always a plus. I'ts a personal and definitely not a racist thing.. but I would consider putting more Italian staff in the open kitchen.", "author": "Jim S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-09", "description": "The pizza is great. However, as a DUMBO resident, the fact that they don't offer takeout on Sunday's is disappointing. Seems like they only cater to the tourists...", "author": "andrea c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "This blows Patsy's and Grimaldi's out of the water and without the Grimaldi wait. This, along with Numero 28, are my go to choices for pizza in the city. Total tab after tax but before tip was $45 for a large half pepperoni/half cheese, salad (just average) and 2 sodas.", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "The staff was friendly and awesome. Service was fast and the pizza was great!!!! Best I've had in a long time. Atmosphere was perfect and a great break after walking across the Brooklyn bridge on a hot summer day. Will definitely be back again on our next trip to NYC!!!", "author": "Becket I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "Just a very normal place, \n1. Location: the best close to Brooklyn Bridge\n2. Ambiance: very cozy, all the time the waiters are passing through make you nervous to hit you, too much tables and chairs in a not big place\n3. Very respectful and nice waiters and there is a vegetarian gentleman as the head of waitress, he is incredibly nice and he is the only good thing here.\n4. Food: Not a good pizza, just a very usual pizza and they pretend that they are doing magic in that oven. Not worth to wait on the line for 45 min and just a few pieces of fish and meat ball on top of it. They have no hot sauce there and when I asked for it, it was like I am asking a very extra ordinary request. They have no hot sauce no ketch up and when you ask at least for some extra cheese they bring some wet cheese. Come on, even a small pizza place in the corner of every street in NY has better thing, They are just famous cause of location, that is all.", "author": "Neema F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Amazing!! Was a little nervous when I came here and found the restaurant with a different name.  We ALMOST went next door but thankfully read the news article on the door on the name change (phew)!  We got there right at 11:30 when they opened on Saturday-- THANKFULLY as it became crowded PRETTY QUICKLY!  We ordered the goat cheese and sausage on a margherita pizza.  It was perfect!  Friendly and quick service. Definitely a must stop on your pizza crawl of NY! =) PLUS the view at the bottom of the street (under the Brooklyn Bridge) is my favorite view of the city! A win win!", "author": "Rachel K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}