{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "BEST pizza in NYC... And that is also from a National survey... LOVE.", "author": "B L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Pizza special #1 was delicious. My 12 year old who only likes pepperoni loved it as did my non pizza eating teenage son.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "I love Julianna's!\n\nIN RESTAURANT:\nThe first time I went here, it was really good! It was about a week after opening. However, I couldn't really enjoy my pizza because my cousin was having a party there, a bit hectic!\nREST OF VISITS: absolutely amazing! I finally got to enjoy my pizza. Really fresh, and yummy! \n\nDELIVERY/TAKEOUT:\nWhen I heard they did delivery, Monday thru Thursday, I took advantage of it! \nThe pizza tasted just like I was in the restaurant.\n\nPROS:\n-fresh ingredients\n- delicious pizza\n- nice selection on menu\n-great service\n- Seated quick\n\nCONS:\n- a little pricy, but it's worth it ;) \nI still go every 2 or 3 weeks\nOverall: I'd rather go to Julianna's than having to wait for hours at grimaldi's\n*most of the time patsy Grimaldi himself is there!\n*this is the original spot!\n*the delivery is really fast: 10-15 mins", "author": "Marissa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "4 and a half stars, really.  Got a small margherita pizza and a caesar salad, the pizza was way more than I could eat alone.  Fantastic flavor and crust, plus a couple local beers on draft,  If they are busy expect a wait for the bathroom, which is small but clean.  Reasonable prices and great service make this a winner.", "author": "Jeff P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "I live in one of the best neighborhoods on the planet for pizza, and Juliana's still stands out. The owner is a really nice man, and the staff is competent and quick. Go!", "author": "Theresa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "I had this presumption in my head that New York had the best pizza in the country, however I have been overly disappointed by every other place I tried. After trying Julianna's my pizza search is over! The line took about 15 minutes to get seated, the pizza came quickly, and the service was friendly yet sparse. We ordered a margherita pizza, it was crazy delicious!", "author": "Amy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "just one word to describe this pizzaria \nawsome !!!!!!!! waited 40min. to be seated but believe me it was worth the wait", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "I took off one star because it's not the best pizza I've ever had, but it's still pretty damn good. Be prepared for a long wait on weekends.", "author": "Rahul M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-07", "description": "Wasn't impressed by the pizza. Not that I like Grimaldi I just think that both are rather mediocre.  For me the pizza had too much tomato sauce and the dough was a bit too chewy. \nService was beyond excellent. And coffee was surprisingly superb.", "author": "M R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Knowing the story of the original Grimaldi's we ventured to Patsy's new restaurant named after his mother Julianna. The food was outstanding, the service superb and to this very day pat tends to his patrons as if they were family. We were so surprised that patsy still works in the kitchen and cares so much about his product and customers. If you loved the original Grimaldi's then Julianna's will not disappoint.", "author": "AJ C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Best pizza I've ever put in my mouth, no joke. Juliana's is the real deal.  Staff was friendly, the pizza was fresh, and all the toppings were top-notch quality. My son and I ordered the small margherita pizza. The small feeds 2-3 people, and we couldn't finish it all because we got full. I added Buffala mozzarella, and what a treat this was. Sadly, we were only visiting for a few days, so that's going to be a real problem when I start craving this delicious pizza!  If you're staying in Manhattan, it is sooooo worth the ferry or subway ride to come eat here. I will be back in Brooklyn for an overnight layover this summer and I plan on visiting again.", "author": "Candy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "My bf and I only had 2 days in New York and decided to come here on a recommendation. After an extremely long trip over, we arrived to a long line and were concerned it wouldn't live up to our expectations....but instead, Juliannas exceeded them! Our server kept coming around to make sure we were taken care of and struck up a great conversation with us. We got a half Margarita, half white pizza with pepperoni and sausage. I'm not usually a fan of pepperoni  (i know, so odd) but this pepperoni was like the king of pepperoni. All in all, an amazing experience and I am greatly anticipating heating up our leftovers for lunch. Yummmm", "author": "Christine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "First off I'm from Chicago and appreciate all styles of pizza, I don't want to start a Chicago vs New York pizza argument. That being said, on a recent trip to Brooklyn I did a little research and decided that Juliana's was a place I had to try (do some research on the history of this place).  \n\nWe went with a group of seven at 8:00 PM on a weeknight and were seated right away.  Service was good, atmosphere OK, the pizza was phenomenal!  We finished a large Margherita, a large sausage and peperoni (winner), and a small white pizza. Without a doubt, this is the best traditional pizza I have had anywhere.  All seven in our group, from different parts of the country, agreed.\n\nI am currently trying to find a reason to get back to Brooklyn just to eat here again, enough said.", "author": "C J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "After the fantastic reviews I visited this place. After a long wait in the sun we were finally seated in a packed and small dining area. Next table is an inch away from yours in all directions. The service is good and the owner is there making sure that everything is going smoothly, that's always nice. The pizzas themselves are nothing special. We had a half white half margherita and it was alright. It liked taste and they weren't too generous with the cheese. Definitely not worth all the hype. Prince St Pizza will continue to be my favorite, I think.", "author": "J. D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "Best pizza in NYC! truly authentic", "author": "Biyu N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "I had really high hopes for Juliana's.  I've been to Lombardi's, Grimaldi's, Frank Pepe, Angelo's, John's, and dozens of other pizza places in Manhattan, Brooklyn, and the Bronx.\n\nWe walked right in (past the line for Grimaldi's) after they opened on the 4th of July.  I brought a few out of town friends with me.  Our server was nice and the decor is great--leagues beyond what it was when Grimaldi's was there.\n\nWe ordered a margherita pizza and a pepperoni.  We saw a few tables come after us get their pizzas first, but that didn't bother us too much.  When the pizza's came, we were disappointed by the crust.  When you go to a coal-fire pizza place, you expect a very crispy crust with char.  This had little to no char and the crust was starting to get floppy.  A lot of water had pooled on the margherita.  The mozzarella was good and the sauce decent.\n\nI definitely wouldn't go out of my way to go here again.  I really thought this pizza would be better than Grimaldi's since it's the original guy, but honestly, Grimaldi's crust and sauce are better.  Frank Pepe's and Lombardi's are still on top.", "author": "Kyle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "My sister has lived in NYC for the past two years and said this was the go-to place for Brooklyn pizza. I was not disappointed! Got the meatball pizza (after trying my sisters I wished I'd gone pepperoni) and the mozzarella was to die for.", "author": "Nelli L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "Good place. We went on a pretty busy night and we were competently taken care of and our pizzas came out pretty quickly. recommended. Easy walk from the DUMBO ferry area.", "author": "John V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "Service is good, the root beer was great but I wished I was next door at the \"grimaldis\" restaurant.  It was really similar but for some reason i thought the restaurant named grimaldis has an overall better tasting pizza.  The crust is slightly thicker and has a sweetness to it.  Also, lucali's in Caroll garden is much better than this place. Overall, my experience was good but my rating is 3 stars because I wasn't overwhelmed by the taste of the pizza.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "Not a bad pie. They renovated the location, making it look more modern \u0026 more open. I think the decor is very nice \u0026 glad they still have a jukebox. The pizza wasn't so bad. The fried calamari on the other hand was horrible. Too much batter on the calamari, don't bother. Stick to the pizza. Our waitress wasn't very warm or friendly. She was sort of robotic \u0026 only asked my fiance` for a refill \u0026 not myself. Both drinks we wanted they were out of. They do take credit cards. Another thing that bothered me: on the chalkboard it says what region Patsy's mom is from \u0026 the answer is Melfi. Melfi is a city in Italy, not a region. I know it seems silly, but if you're trying to pass it off as a genuine Italian pizzeria, then it should be authentic Italian.", "author": "Giovanna A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}