{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "What's not to like about great ambience, really good margarita pizza, pasta puttanesca al dente, and an amazing Caesar salad with white anchovies?", "author": "Lee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Little hole in wall place with pizza game on-point!   Excellent.   Great staff with great service and holy cannoli!", "author": "Shelia R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-22", "description": "Their pizza is usually great. But I'm giving a low score cause of poor customer service. when I went last month I complained that the pizza was black on the bottom and tasted burnt. The owner, or guy seating us, kept explaining that it's supposed to taste smokey. But I'd had Julianna's pizza before and it didn't taste like this. But he insisted it's supposed to be that way. As I was famished and the pizza was still edible, I believed him and ate it. \nBut then I went to Grimaldi's a few days later, their predecessor. And their pizza was everything I remembered it being but without the burnt flavor. Aha! I said to myself, that guy at Julianna's should've just offered to fire me up another one. Next time I won't be so gullible. I'm really sad he didn't provide better customer service. I hope he reads this review and next time believes his customers. Think I'll keep going to Grimaldi's from now on.", "author": "Mara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Deliciousssss. Definitely worth the wait. Started with an order of their homemade meatballs \u0026 a lemonade. Then a Margherita pie. It was perfection. Went on a Saturday at about 1 \u0026the wait was approx. 35 to 40 mins for 2. Not too bad.", "author": "Natasha E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "What an incredible experience.  We wanted to walk the Brooklyn Bridge and stumbled upon this pizza place when looking on Tripadvisor.  What a gem.  From the moment we walked in we were in heaven. The manager Matt was very accommodating and sat us down right away. The server, Trimell, was incredible. My husband wanted the margherita and I wanted the white, so Trimell recommended for us to get half and half. We honestly could not decide which one was better.  We were not sure what we wanted to have for dessert and Trimell suggested the cheesecake. It was also incredible.  Mr. Grimaldi, the owner was also there watching over everything.  \n\nWe are from Miami, FL, but will make sure to come back to Juliana's when in town.", "author": "Clarissa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Arrived at Juliana's at 9:15 pm and waited in line, about 15 people deep and was sat within 30 minutes. Do your research as you will find that Juliana's and Grimaldi's are very similar because they come from the same DNA. Now for the experience - the pizza crust was tender and had a nice flavor, coated with that iconic sauce that can also be found at Grimaldi's. It's a little sweet and tasty, just wish there was a little more. This can be said for the sausage topping as well. Don't get me wrong - the pizza is legit. The service was okay - our servers kept giving our food and drinks to the wrong table. They also forgot meatballs on the pizza and quickly rectified. Overall it's worth trying - as it is a tasty pie!", "author": "Cam A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "It was a cloudy and humid Friday on 7/6 with some rain when I decided it would be the perfect day to finally make a journey to Juliana's which I have had bookmarked for a few years. I am so glad that I made this journey because the coal fired pizzas at Juliana's are beyond amazing. Since I was bringing back pizzas for the family, I chose not to dine but to take the pizzas to go which means I was able to walk in and place my order without waiting on line because the line is for customers who want to dine inside the establishment. The staff is super kind and friendly and the location is perfect for pizza this amazing. I made a decision to go with 3 pies that I have seen on the menu and knew that I wanted to try. Went with a large white pie which consists of: mozzarella and garlic with fresh basil on top. Went with a large margherita which consists of: tomato, mozzarella, and basil and added their delicious pepperoni for the topping. Last but not least went with their famous No. 1 which consists of: Mozzarella, Scamorza affumicata, pancetta* (Italian bacon),    scallions and Oregon-grown white truffles in olive oil. Three amazing pizzas which came to a grand total of $87.10 and was worth every cent. I will be back to dine in and enjoy the comfort of a place where everyone is enjoying great pizza in a friendly and cozy environment. I highly recommend all three pies I have mentioned and trust me, you will not be disappointed.", "author": "Thomas Joseph P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "Pizza was great. Waited over an hour in line for it. Not sure if anything would have tasted amazing after that wait. Quick service but they should really enforce a time maximum for dining to ensure the line moves more quickly.", "author": "E O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Grimaldi's vs. Julianna's ? Definitely Julianna's. This pizza joint is making some amazing authentic pizza. Located right near the Brooklyn bridge and next door to grimaldis, Julianna's is a delicious addition to the neighborhood and it trumps the old iconic pizza spots like grimaldis. \n\nQuality here is key. Super fresh ingredients. We ordered the no.1 (a white pizza with smoked mozzarella and bacon) and a margarita pie with pepperoni. My mouth is drooling speaking about this. The no. 1 was so good. The mozzerella was fresh and you can taste the smokiness. The drizzle of truffle oil took it over the top. My only complaint was the bacon may have been too salty and a bit too much. The margarita pie was the best I've had. Super thin crust with fresh tomatoe basil and cheese! Soooo good! \n\nIf you come to Brooklyn you must come try the pizza here. You will not be disappointed. The staff here is super friendly the pizza is made to perfection. Be sure to get here before 4 if you come for lunch because they close the oven before they reopen for dinner !", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "Pretty great pizza. Ordered the popular No. 1 pizza: pancetta, large and crispy cuts of mozzarella, and scallions. I couldn't taste the truffles. It's a very savory pizza and had me missing tomatoes. Nice restaurant, but gets pretty loud and busy. I'd go back, but order something different.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "My boyfriend and I came on a Sunday night for his birthday celebration. It was a last minute decision to go to Juliana's - we were thinking of heading to Dekalb Market for a light dinner, but we decided we wanted pizza instead. Therefore, we head over to Old Fulton to see a light line forming outside (FYI it seems to be that there's always a line). We asked the hostess (situated inside while the line forms outside) how long she thinks the wait will be. She informed us it was around 35-45 minutes. At 5:40pm, it was still a wait for a pre-dinner slot, but we decided to stay and try it. \n\nAlthough we did wait the full 45 minutes, it really didn't feel like too long. Mostly because the weather was nice, but maybe it had to do with the fact that 20 minutes in our wait, they came out with a big pie of pizza and offered it to those on the line. We had a taste of what to anticipate - and we were thrilled. Apparently, when their pizza does not come out perfectly, they hand it out to those who are waiting in line instead of throwing it away. Not sure how often the complimentary pizza happens, but it was a nice gesture of them and we were pleased because we were among the last few people who had a slice.\n\nWe were seated after around 40-45 minutes wait. I have to say I really do like their system because keeping the crowd outside made the dining experience much better. It was quiet and peaceful in the restaurant and we were promptly served. We asked for two drinks, the meatballs for appetizer and for entree one large pizza with pepperoni. The food came out promptly, the service was great, and the price was $45 for all of that - which I thought was very fair for quality pizza.\n\nThe pizza was amazing!! It definitely is on the top of my pizza list. The pie really reminds me of the pizza I had in Naples, Italy (although the ones in Naples tend to get a bit soggy - Juliana's pizza's crust was soft and thin, but not soggy.) It was a very authentic Italian pie and everything about it was delicious. We could not finish the whole pie and we were super stuffed.\n\nOverall, if you are a pizza buff, you definitely need to come here and try the pizza. I know it is a bit old fashioned for the line and the fact they don't have a better waiting system (text or number) I think it is because for them, it increases the hype. When people walk past and see a huge line, they get curious. FYI - Grimaldi's next door does the same thing. But trust me, Juliana's is worth the wait.", "author": "Erina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-02", "description": "I always wanted to try a good Brooklyn pie and I'm glad I picked Juliana's as my first! The pizza crust was thin which I loved and the sauce was really tasty. We went on a Friday night and there was a line but we only ended up waiting around 20 minutes so it moved along quickly.", "author": "Nisha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "An excellent stop for authentic pizza in Brooklyn. Be prepared for a wait--we stood outside in line for about 30 minutes, but once we were seated the service was efficient. We ordered a large No.1 and it was more than enough for two people at lunch (though we hadn't eaten breakfast, so were pretty hungry), \u0026 the waiter was careful to mention that this pizza did not have tomato sauce. Pizza was tasty, though the pancetta got a bit too salty at some points which is the only thing preventing a 5 star review.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "AMAZINGGG, simply amazing! Staff are very friendly, place is very inviting, wait is extremely reasonable, price is perfect, and let me just say the pizza... absolutely delicious! I absolutely recommend eating here and visiting DUMBO. I ordered a small half margarita and half prosciutto and it was enough for three. If I could give 10 stars I would!", "author": "Kenia Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Second time here.\n\nFor the long being so long, it sure does move pretty quickly. We stood in line for about 30 minutes on a Sunday after their reopening at 4pm.\n\nWe got wine and a margherita pizza. The pizza was served fresh and hot and was very tasty. The staff was very efficient and attentive, not necessarily something you would expect for a packed house. They had a bunch of special pizzas as well.\n\nJuliana's is definitely superior to Grimaldi's next door.", "author": "Kayla F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "There was a long line, of course, they said this is one of the best pizza place in brooklyn. We waited for more than an hour, got seated and was greeted by a friendly staff. We wanted to try the chicken guac pizza, we forgot the name. He took the order and can back a few mins after to say that we need to wait for another 30-40mins for it to be prepared, we understand since the place was so packed.. the pizza was good, but a little pricey.", "author": "Lovely G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "Pizza's are big enough to share with 2 people, very cute and cute cozy place. The staff are very friendly and seated us quickly. I would recommend getting the #2. Pizza tastes different than any other pizza place. If you come here you'll love it.", "author": "Mariah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Ridiculous.  Just ridiculous.  One bite and you'll be in love.  There's something about the simplicity of this pizza, maybe it's that perfectly chewy charred dough or the creamy mozzarella and tangy tomato.  Worth every second of the wait!", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "had the margherita with prosciutto toppings and it was pretty good. it's a long wait for a seat though", "author": "Rohini R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "My friend and I looked online for \"the best pizza in New York\" and after looking at other's reviewers we decided on this place. We went mid-March and thankfully there was no line. The place is small, but clean and cute. We got a large Margherita pizza and two glasses of wine. It was a little busy so it took about 30 min to get our pizza but we were fine with that. The pizza was AMAZING! The texture is unique: thin, crunchy, but chewy. The flavors were really well balanced so that there wasn't too much of one thing on the pizza. Nothing was pungent, too salty or too sweet. Just perfect! The pizza was $22, $8 for each glass of Cabernet + tip. Definitely worth the trek to Brooklyn!", "author": "Rosy G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}