{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "We had already decided we wanted to try this place while visiting NYC from California. We arrived just before noon before we were starving and got in the line outside. It moved surprisingly faster than I anticipated and we were seated as a party of 3 ahead of a quite large group in front of us...it is a small place. We sat at the bar-which was so fun to watch them making all the pizzas. We shared a small DELICIOUS pizza and still had one slice left! While in the restaurant my daughters were looking at their Polaroid photos and accidentally left one on the table...as we were walking down the block one of the employees ran to find us and return the photo. What excellent customer service and amazing food!!", "author": "Ellen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "I am pretty serius about food in general, but when it comes to pizza, even more.\n\nThese are my 2 judging rules:\n1. In a new place always try margherita first;\n2. Pizza has to be eaten hot! I couldn't judge a delivered pizza, that would be unfair.\n\nJuliana's margherita it's great. That right mix of crunchy and softness. You can beat they have a fast turnaround of that dough... Ingredients taste authentic too.\n\nThe staff it's great too, very friendly and polite.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "First time here, it was so great pizza. We started with Caesar Salad We ordered half margerhita and half white pizza on top with pepperoni. It was so great especially I had it with Brooklyn lager beer. Waiter was polite and active. We waited line about 20 minutes at 5pm. It's worth to wait.", "author": "Amy Aminat Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "During my 8 day stay in NYC this was, hands down, my favorite pizza. It's a thin crust with great tomato sauce. I liked the the number 4 which had arugula and prosciutto yum! It was worth the 30 minute wait for a table. Once seated, service was fast. These people are professionals.", "author": "Darlene L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "Pizza was great, but it was Served a little bit cold .The server was great he was able to show me the pizza sizes so I would get a visual of how big they are. The small was able to feed me and my husband , we were stuff. We got the purple olives, pepperoni, and mushrooms with marghrita sauce. Also our pizza was not evenly cooked. It was crispy on the putter parts an a tad bit doughy on the inside", "author": "Carolyn P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "My favorite pizzeria of the 5ish I tried during my NYC trip! Is it the best pizza I've ever had? I can't decide. I think I give a slight edge to Apizza Scholls in Portland. I ordered a whole small margherita pizza and added pepperoni \u0026 garlic. I was surprised by the chewiness of the crust given how thin it was.", "author": "Travis T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "Upon entering the place, the wonderful aroma of pizza greeted us (literally smacked in the face with it)! My friend and I got a small Margherita Pizza. It was a good portion to share and very delicious too. My friend got a glass of Chianti and I got a Peroni, and that combo made a great lunch for the both of us. We ordered Brooklyn Bridge dessert and was just okay. We ordered two cappuccinos and were made perfectly. It is a well-known spot, and I bet a lot of history was made here. It is a cool spot to grab a bite whenever in DUMBO, but I don't think I would go out of my way for it.", "author": "Ina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Okay, being lactose intolerant and all, I already committed to not eating anything here. After seeing 2 huge pizzas arrive at our table, my discipline proved weak. Their crust is divine and held onto the cheese and toppings wonderfully. It's not the most filling pizza, but after going on an all day, self-guided food crawl, this was exactly what we needed.\n\nWe had a larger party, which usually sucks at busy places like Juliana's, but it worked to our advantage. We were the only big group, pretty far down the line, so our wait was relatively short. \n\nI'd love to come back and try a red sauce pizza, since both our pickings were white (specials 1 and 6). I'll bring my lactase pills next time! Lol.", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "1s time here and ordered a Margaritha Pizza. The pizza was so BOMB!! It is so tender and yummy!! the ambience was so great too!! You can't order only a slice, but a whole. You could order with a small or large portion. Even small portions, it's good enough for two of us( me and my wife ). Too bad, we gotta go somewhere else, so we only ate 2 slices. Overall, it was super good pizza! the staffs pretty nice too! We'll visit again! hope you guys could open in Dallas, TX. That's where we come from. One more thing about this place, it's not far from Dumbo site. Basically, it's under the Brooklyn bridge. You won't miss it!!", "author": "Budisetia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "45 minutes wait,once you get seated its very fast,excellent service and pizza. Bit pricey for the toppings. Beer was ice cold.Got the black olives,a bit salty but good,husband got anchovies. Very cold inside", "author": "Elsa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Not a new review, not a surprise -- Juliana's is AMAZING. We got a large pizza to split with a salad. We got very lucky and only had to wait about 15 minutes to get a table outside for 3 people. It's not a place where you feel like you can hang out, though. It's definitely an in-and-out place. You have to share some of NYC's best pizza with the rest of the world.", "author": "Haley Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Don't be surprised if there's a line formed outside the restaurant! It's known to always have line because the restaurant itself isn't huge. Don't let that line intimidate you! Make it! The wait wasn't terrible. I think I waited about 20 mins. Few tables outside can be found, although fall has started and I wouldn't recommend to eat there. The pizza is thin crust and may get cold very quickly. It's cozy inside and the staff is lovely. The bathrooms were very clean, which is always a plus. On to the pizza... we ordered two large Margherita pizzas. Enough for four adults. By far one of the best pizzas I've ever had! I wish we had a location in Orlando. The beer was also great (don't remember what it's called) will definitely go back and highly recommend to others.", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Every time I come here, the quality is consistent. I am never disappointed by the food. The service is great and the food is so amazing that I don't mind waiting in line (even in the cold) for a table. Chances are you will wait on line during a busy weekend night but it usually goes quick. It's just that good that I can't complain. I personally recommend you order a pie and pick your own toppings. The pre made ones are amazing but as a persona preference I like creating my own. Also, try the deserts. They are all delicious! Will always be returning here when I'm in the mood for amazing pizza!", "author": "Cay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "This coal fire pizza was super duper great. After waiting for more than half an hour outside while they restocked the coal ovens, I was ready to devour a great pizza. Lucky for me, my order was taken quickly and the pizza was delivered in just minutes. Wow, I love that kind of service! The place got packed quickly and I completely felt like I was in NY by then. The buzzing restaurant was quickly growing a great vibe and I felt like moving to NY. Great tasting pizza.\n\nPro tip: come here", "author": "Rolando G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "This intimate little pizzeria delivers a true taste of Italy. While many nights you'll find a line wrapped around the block, it's a testament to the fantastic pizza that's served up at this joint. \n\nYou can opt for a more classic pizza or go for one of their speciality pizzas. Several of these speciality pizzas come topped with truffles and are simplify decedent- a must try!", "author": "Emily G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "This is still my favorite pizza place when visiting NY. This time we also tried Grimaldi's next door just to compare and Juliana's still wins. Had a short wait in the afternoon but in the evening it can take a little longer. The two of us finish off a large pizza with no problem because it's just so good!", "author": "Justice J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "My favorite pizza spot in NY. I've tried Lombardi's, Joe's, and John's and all of them pale in comparison to Juliana's. This place has an authentic Italian vibe from the friendly Italian man (who I presume is the son of the owner) to the pizza specialities. I've gone twice and tried the prosciutto with arugula and tomatoe basil - both were really great. I went with 3 other people on this trip to NY and none of them had tried this place. Needless to say, I kept talking about Juliana's until I convinced them to try it. They loved Juliana's and confirmed it was much better than Lombardis, Joe's and John's. They had tried Grimaldis as well and although they thought the flavors were similar, they liked the Juliana's experience more. \n\nTo see more of my food adventures, follow my IG page: travelfoodphotography \n\nTip: \n\n1. Line could get long so either anticipate a wait or go during non-peak hours (check Google)\n2. Pizzas are huge. There's a small and large option which are generally $3 apart so although you're getting ALOT of food, it just makes sense to go for the larger one. 2 large pizzas are more than enough for a party of 4.", "author": "Angela P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Delicious delicious delicious. Did I say delicious? Probably my top 3 pizza spots in Ny. Waited in line for about 25 min which wasn't too bad. My fiancé and I were debating between Julianas and Grimaldis. Glad we stuck it out with Julianas. Best pepperoni I've ever had and the dough was thing but yet crispy and chewy and soft. The meatballs are a skip though. We will just stick to the pizza next time. Can't wait to go back! Delicious and amazing. The lemonade was also yummy.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "Alright so first time for real NY pizza in Brooklyn NY.  Pizza was very good, we had the margherita pizza, wine and cheese cake.  They have their pizza recipe down.", "author": "Doug G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-25", "description": "With the history of this place, I expected it to be better than the place next door.  I came to NYC on a pizza pilgrimage and had decent expectations for Juliana's.  I was disappointed. \n\nAmbiance, decor, and service were just fine, but I really don't care about that when I'm here for the pizza.  If you serve me the best pizza in a cave, that's better than average pizza in a palace.  But I digress...back to the pizza.\n\nIt comes down to crummy dough.  It had no flavor and bad texture.  This above all else ruins my pizza experience!! Sauce, cheese, toppings and all that are high quality and great.  However if you give me good toppings on flavorless crust, it's over.  Maybe they got into their dough too soon, or maybe proper fermentation isn't important to them.  Either way it simply wasn't great pizza.", "author": "Grandpie A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}