{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Amazing coal oven pizza. Arrived at 4 pm and didn't have to wait. People arriving 30 min later had to wait 45-60 minutes.", "author": "Nate M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "Delicious margherita pizza with meatballs \u0026 pepperoni at this wonderful pizzeria in Dumbo.  My first time here but I will definitely return.  Well worth the drive to Brooklyn from Manhattan.", "author": "Ron W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "The pizza is absolutely fantastic!  Got a small half margarita and half white with shiitake pizza.  The wait was a bit long for the pizza but it was definitely worth it.  They use quality ingredients and you can taste it.  \n\nThe margarita sauce wasn't watery or acidic and the basil was fresh.  The garlic sauce had a nice touch of garlic and wasn't overpowering.  The addition of the shiitake mushrooms brings a nice earthy taste to the pizza.  The cheese was delicious and didn't have oil seeping out which is associated with bad quality cheese.  The crust and dough is just delicious!  I can eat it all day!!!\n\n+ Delicious Pizza\n+ Quality Ingredients \n+ Generous size for a \"Small\"\n+ Friendly staff\n+ Speedy service\n- Wait time for a table\n- Wait time for food\n\nI highly recommend coming here for pizza when coming to Brooklyn, NY but would recommend getting an appetizer so you won't go hungry.", "author": "Phil P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Pizza is amazing!!!! Fancy place too!!! Had a large pizza with pepperoni and mushroom! Hashtag amazing! Cold brew to go with it!!!", "author": "Jesus E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "Was ok: overpriced for the area . Not a major fan. Sauce was nice . Not very filling .", "author": "Marie Annick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "Oh dear god!! I do understand why the line is always so long!!!\nYummy yummy yummy!!! Really tasty pizza. Staff is nice and friendly. Quick and efficient service. Interior could be a little nicer for now it looks like it's lots in between old Italian pizza place with a modern splash. \nBut it's all about PIZZA!!!!", "author": "Kamila K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "I was on a mission (that I dragged my mom and sister along for): to get legit pizza in Brooklyn. While on the Gray Line night tour Friday before Memorial Day, our tour guide pointed out Grimaldi's and Juliana's and told us the story about the two neighboring pizza joints (if you know, you know hehehh). So I came back the following Saturday afternoon (mind you, this was Memorial Day weekend) on a stop from the City Sightseeing hop on/off ferry tour. It was a quick 5min walk from the ferry stop at the bottom of Fulton St and you can't miss it! If you are walking up from where the ferry stops, its on the left hand side past the Shake Shack and before Grimaldi's. \nNaturally, since it was Memorial Day weekend...the line was long. My sis and I waited in line while my mom went to the front to inquire about take-out options. She returned to us with menus and said they can do anything from their menu for take out. Perfect!! We decided on a large white pie with addons (regular anchovies, meatballs, and crimini mushrooms) and a small #4 (tomato, mozz, arugula, and prosciutto). \nIf you want takeout, then you can go to the front of the line and order at the register on the right immediately after you walk inside. After I ordered and paid there, they said to come back to the same spot in ~35mins where my pizzas would be waiting for me! They also let my mom and sis use their restroom which was nice of them :)\nSo we went to get ice cream at the Brooklyn Ice Cream Factory while we waited and about 25mins had passed. I decided to walk up and see if the pizzas were ready ahead of schedule. Sure enough, after only 30mins, the pizzas were at the register, ready for me to take and enjoy! \nHowever, by the time we picked up the pizzas, we had to get in line to get back on the ferry to Manhattan, and since it was pretty difficult to eat on a jam-packed ferry and eating was not allowed on our Gray Line tour bus back to midtown, it was a good couple of hours before we got to dig in to the pizzas at our midtown hotel. \nMan...the pizza was good warm, it must be even better when its hot and fresh! I really liked both pies we ordered. The arugula on the #4 was refreshing and slightly wilted (probably from being in the paper pizza bag for 2hrs) but still had a crunch. The meatballs, to my surprise, were not balls, but slices of meatballs (I think?). Or maybe I didn't get the correct order and those slices of heaven were not in fact meatballs. Doesn't matter to me, it was still great! \nIf I ever find myself back at Juliana's, I'd like to order takeout to eat at the park...that seems like it would be the perfect lunch!\n\nTL;DR - skip the line for takeout, try the meatballs and #4, and still awesome pizza after a long and arduous journey from Brooklyn to midtown!", "author": "Jasmine W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "Got a small no. 1 to share (homemade mozzarella, pancetta, scallions, scamorzo, and truffle oil). Definitely a delicious pie with more than enough substance to feed two mouths, but it was not my favorite (if you've ever been to Berkeley, then you know Cheeseboard and Sliver whip together a FANTASTIC thin crust pie! And for a great price). At Juliana's, a small no. 1 costs $27. For that price I was expecting something epic and out-of-this-world delicious. But TBH, the pizza fell a tad short. In my opinion, it was a bit on the oily side. But I guess that's what you get when you order a pizza w/ truffle oil!\n\nHowever, I would recommend this place (especially if you're already in the area and wanting to skip the wait and the crowd over at Grimaldi's next door). It is a solid pie and the combination of the pancetta with the scallions was superb! \n\nSo I guess in sum...\nGood pizza! \nBut a little on the pricey side", "author": "Alexis Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "Place was chill! Gotta order your pizza before 315 pm because they had to do something with the oven to open for the later afternoon rush!", "author": "Nacho L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Great little spot, very Italian style. Sit in front of the kitchen and be amazed at how fast they churn out those pies! Arugula salad was awesome, full of goat cheese and yummy walnuts. Service was great and he gave us lots of great suggestions, one of which was the pepperoni and meatball pizza. Oh. My. Delicious. Not your typical NY pizza. But still delicious.", "author": "John R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "If you know the true story, then we all know Patsy is pizza king! Grimaldis next door can keep their pizza..", "author": "Danny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-28", "description": "Pizza fine however, I find it simply ridiculous they charge for iced tea refills. That's bs.", "author": "R B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "It is the best pizza I've ever had.  Go on a weeknight when the waits aren't so long.  If you're complaining about the wait time on a Friday or Saturday night, it's really not their fault.  Best time to go is when it's raining outside (no one seems to want to lineup on the street during a downpour).  Worth the trip.  \nHighly recommend the number 4 pizza.", "author": "Billy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "Great restaurant and friendly staff. We will definitely be coming back next time we are in New York. We were a little worried about the long line, however, Grimaldi got us seated in no time.\n\nNice atmosphere, great food, friendly staff and reasonable prices!\n\nIf you get a chance sit at the counter so you can watch them make the pizzas right in front of you. They have a system that is really impressive!", "author": "Troy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "By far the best pizza I have try in my life. Amazing thin crust, super fast service, super fresh and just the right amount of toppings! I wish I lived here just to eat here every day! Lol", "author": "Matias G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "Juliana's is everything I envisioned NYC pizza to be; perfectly thin crust with a slight chew and just enough char, excellent sauce and high quality toppings. \n\nTheir Margherita is simply fantastic. The sauce really makes it, super fresh with a slight acidic bite...pairs perfect with the fresh Mozzarella.\n\n Equally as good is the White Pizza; Olive Oil base, Garlic, Fresh Mozzarella. We added Ricotta, that's just the way I like my White Pie and it was absolutely the right choice. This is the perfect pizza for anyone not into Tomatoes or just looking for a change of pace.\n\nI'm glad I did my research and ended up in the \"real\" Grimaldi's. We all walked out 100% satisfied, then even more so when we passed the line at the other place. This place is high on the list of reasons why I can't wait to come back to NYC.", "author": "Kenneth D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "Worst service ever. It took almost ten minutes to be greeted. Once we ordered, our entrees came out before the appetizers. It took our entrees 30 minutes to come out. 30 min for a basic pizza? No thanks. The server didn't even come by to check if we were enjoying everything. The place was empty when we walked in, I don't know why service was lacking.", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "Great pizza. Crust is amazing and the flavors are delicious. Also, the location is so convenient if you're planning on checking out the Brooklyn Bridge. Wait time was very long - 30 minutes outside. Once we got in, we waited 20 minutes for one salad and then another 40 minutes for our pizza. It's understandable because there were so many people here - such a popular place! I guess if I think about it, the wait just made us even hungrier for their delicious pizza.", "author": "Katherine Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Juliana's was on our places to go to in NY with the intention of just grabbing a slice, but further research showed that they only serve by the pie so I didn't think about going anymore. However, our itinerary changed and we were able to go to Juliana's in the end and I was SO glad we did! It's right next Grimaldi's, but I heard Juliana's was way better and we have a Grimaldi's back in Dallas. It was storming outside so luckily, the line wasn't horribly long when we went. While waiting, I read an article they stuck on the outside of the restaurant describing the history of the rivalry between Juliana's and Grimaldi's. Very interesting! And made me respect the restaurant even more.\n\nNow for the food. We shared the Brooklyn style egg cream and the No. 1 pizza. I've never had an egg cream before, but it's very interesting. Essentially tasted like chocolate soda. The pizza was so amazing. I haven't been eating much during our trip but I ate more than my boyfriend did here. We ordered a large which I think is enough for 2 people. We had a slice leftover that we ate for breakfast the next day, and it made me wish we ordered another pie. Definitely one of the highlights of this trip!", "author": "Alice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Without a doubt the best pizza in New York. Patsy Grimaldi comes and greets everyone while dining. Truly amazing", "author": "Cindy T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}