{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "Their pizza is the main reason why I keep coming into this spot. They offer a variety of pizzas, but you can also make your own. All the ingredients are first class. However,  sometimes it gets packed and the wait is a bit terrifying. But the wait is really worth it. Great spot for hangout.\n\nI might say this is one of the pizza spots here in NY.", "author": "Gary S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Best pizza. For anyone who is lactose intolerant, you can order the marinara pizza--no cheese but still so delicious. We came right when lunch opened, so we were part of the first wave and did not have to wait to be seated (there was a long line out the door after a little while). The ambiance is cozy, warm, and comfortable. Would definitely come back again.", "author": "Marilyn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "I see all these tourists waiting in line to go to Grimaldi's and I laugh. \nJuliana's Pizza is owned by Grimaldi's!!\n\nSomehow, some joker printed in a tourist book the \"must do\" places in New York, Clinton Street Baking Company and Grimaldi's. I don't want to wait on lines for pizza much less pancakes with sugar cured bacon. So, I know the hours when the tourists are up high at the Empire State building. Its time to hit up Juliana's Pizza.\n\n\nJuliana's Pizza, It's not a large dining space. Very communal but nevertheless welcoming and roomy.\n\nWhen you're dealing with artisan pizzas, the ovens are typically 900+ degrees. To cook a fresh, out of the oven pizza to your table should be less than 5 minutes. That's why waiting 90 minutes to sit and eat gets me bonkers. \n\nIf you have to wait, oh baby you're in for a treat. This is one of my guilty pleasures, a creamy dreamy cheesy Juliana's Pizza. (which is named after Patsy's mom)\n\nThis pizza is the stuff legends are made from, top quality ingredients and cooked in an oven from Italy. Simple, yet this tried and true method is the reason why people are lining up outside.\n\nMy favorite pizza is the No. 1 (Straight from their website) Mozzarella, Scamorza affumicata, pancetta* (Italian bacon), scallions and Oregon-grown white truffles in olive oil.\nThis pizza? IS INSANE! Its so flavorful, its something that everyone should experience. I also ordered a beer on tap. \n\nAnd all this goodness happened in under 15 minutes. Other folks walked up to our table and asked what pizza did we order. We New Yorkers are friendly folk. If you want a plain Margarita pizza, bully for you. But if you want to try something different, you need to be a little more daring. Hey, I don't know what a Scamorza affumicata is but gosh darn it, I'm going to try!\n\nIf there is no line at Juliana's Pizza but a killer line at Grimaldi's? Come to Mammas Cuchina, \nJuliana's Pizza. Trust me.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "Amazing pizza! Luckily we went on a rainy weekday afternoon and didn't have to wait much for a table. We had a Margherita pizza with some toppings and it was delicious!", "author": "Pratyusha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "After walking on the Brooklyn Bridge, who wouldn't want to carb-load??? ;) :)\n\nSo on Sunday evening after looking at the breathtaking sunset from the Bridge, we headed to Juliana's and of course there was already a line out the door at 6pm. The line moved pretty quickly, and it also helps if you're a small party. The one thing that caught my eye when I walked through the door was a sign which said, \"Ask us about our egg cream, you won't be sorry\", and so I did!!! The name is a misnomer, and an egg cream is made with milk, carbonated water, and chocolate syrup. It was totally worth asking about it, I loved it :)\n\nWe got a half and half of a medium margherita and the margherita with mushrooms and roasted pepeers pizza. It was definitely hands down one of the best margherita pizzas I had eaten. A medium has 8 slices and they are pretty big, and is a perfect size for 2 people with good appetite.\n\nSo next time when you're hungry and tired while you're done walking the Brooklyn Bridge, head to Juliana's and grab a pizza. Also, once you are done you can stroll around the Brooklyn Bridge park and hope that will melt away some of the calories!! ;)", "author": "Aparna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-28", "description": "Didn't really understand the hype. We were first \"in line\" but didn't like the system of the line in the hot sun waiting for a table to open for a party of our size (4). Our server was excellent. Salad was OK- a lot more arugula than \"goods\". Pizza crust was delicious and perfectly cooked but didn't care for the sauce. Spaghetti and Meatballs- spaghetti was overcooked and pasty but the meatballs were good.", "author": "Jarret S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "first visit to Brooklyn and my friend took me to Julianas. We tried to go on Saturday but there was a very long line - atleast 30 deep. Went back yesterday and arrived before opening so got a table. Love the space - very fresh clean and inviting. More importantly, loved the pizza. We got a #4 and a salad. Pizza was great. Will definitely go back next time in Brooklyn.", "author": "Karen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "Came here a couple times taking visiting family members as it's in a great location near the Brooklyn bridge. \n\nAlways a line, but the line moves at a decent rate and the hosts make sure your party is taken care of quickly. \n\nPizza is as expected - delicious - and service is on point. All the waiters are very friendly and helpful. Check this place out!", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Best pizza in Brooklyn. Staff managed the lines and crowd inside of the establishment graciously. The line is so worth the wait. Once you're inside, the service is impressively quick. The waiters are attentive without being overbearing. They may seem to \"rush\" you to pay the check, but you have to understand the capacity of the restaurant and that others are waiting to be served. This is not typical sit-down restaurant (the food shows it; some of the best pizza I've had). So, it's important to keep those things in mind when dining at Juliana's. Please do yourself a favor and get on the line. Phenomenal pizza, quick service, and an incredible experience. Can't wait to return!", "author": "Jeana P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "Very good but does not match the hype. Waited on line for about an hour, so I think it built up expectations that were not met.", "author": "Bitzy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "If you love pizza as much as I do, PLEASE try Juliana's. \n\nMy family was in town from Chicago so, of course, they had to try great New York style pizza. Originally, I was planning on taking them to Grimaldi's, since I've been there a bunch of times, but glad we tried something new.\n\nGrimaldi's and Juliana's are right next to each other. It's really hard to compare the two, so you'll just have to try both yourself. I believe they're owned by the same family, but the recipes are a little different. Each will have a ridiculous long line (anywhere between a 1/2hr to an hour), so if you're patient enough, try which ever one has the shortest line. It's so worth the wait. \n\nOur family decided to go full out, so we all ordered a drink and two small pizzas (wine with pizza is the best). So for our pizza, we ordered a small classic margarita and a small white pizza. Surprisingly, the small was a lot larger than we thought. Not the personal pan pizza that we were imagining. Between the four of us, we each had two slices of each pizza, which as delicious as it was, it was more than enough. \n\nIt was just PERFECT. Just enough pasta sauce. Not too much cheese. Warmed to perfection. My mouth is watering just thinking about it. \n\nI must say, the pizza, especially the white pizza, doesn't taste good cold. Which is unfortunate, since I wanted to savor every bite. \n\nOverall, service was on point, drinks were delicious (pricy, but still worth it), and the pizza...totally worth the wait.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Best pizza I've eaten in NYC. Authentic wood fired deliciousness, with a deserved line half way down the street. Staff are delightful, a small pizza is big enough for 2, and leftovers are even better then next day. Cannot recommend this place highly enough. I opted for the special with prosciutto and arugula and it was divine. The couple next to me donated a slice of their pancetta and cheese pizza as they'd overordered, and it was just as good as the red pizza. Make a trip to Brooklyn, you won't regret it.", "author": "Catriona M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Really good helpful people jut awesome awesome pizza recommend!!! The pizza place is so authentic and just good .", "author": "Gabriel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Wow, so good! I loved the margarita pizza with pepperoni - The flavors were fantastic!", "author": "Jason M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-18", "description": "Seriously folks, it's about time we re-leveled the expectation here.  It's good pizza. It's not great and it certainly isn't worth the hour long wait to get a table.  If you're in the neighborhood and want pizza, just pick your poison and choose the smallest line; Grimaldi's or Juliana's, it's a toss up between them because neither are stellar.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "This place is so good. Definitely worth the wait! We got the Margherita and the No 1 pizzas. The No 1 pizza was rich so the acidity in the tomato sauce of the Margherita balanced out richness.", "author": "Eli P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "But my opinion is so spot on correct about this review.  WOW, WOW, WOW.  Juliana's is the kind of pizza place dreams are made of.  There is no doubt in my mind that our NYC trip was worth every penny by coming to Juliana's.  I don't want to write too much about the pizza, you just need to come and try it for yourself.\n\nWe got a large, half pepperoni, half margarita, and we ate every single slice.  Please, stop reading my review, and go eat a Juliana's pizza.  Grade, easiest A+ ever.", "author": "Andre H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "Very long wait. Restaurant was super packed. The restroom was in a shady little basement area and I hated it. The food wasnt even mediocre, it was nasty. Pizza was cold and the waitress kept on getting our orders wrong too. No one that worked there seemed like they wanted to be there. The whole atmosphere was pathetic. The restaurant was way too small it definitely need a way bigger area. I don't recommend and definitely won't be going again.", "author": "Emma O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "3.5 stars\n\nThe pies here are ginormous. They're good, especially if you're a fan of the floppy. Tried the margherita pizza with fennel sausage and arugula. I like my pizzas most with unusual toppings and flavors (and less cheese) so while I probably won't be coming back to stand in line, I definitely understand the hype. Just not my personal favorite (although perhaps if I ordered a marinara pizza with roasted peppers / prosciutto  I would feel differently). (Also the line here is noticeably shorter than Grimaldi's and based on reviews / recommendations of friends, Juliana's is the better rendition. Don't get sucked into the wrong line.)", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "This is Patsy Grimaldi's pizzeria (he sold the original with his name in 1998 - which is why \"Grimaldi's\" nearby is an over-hyped tourist attraction with bad pizza). \n\nNow I would say Juliana's is like Lucali. Great homemade crust, but the homemade sauce is BLAND and boring. No zest - 0 pizzazz. Cheese is bleh just ok. Basil was not pinched - we could barely taste it. \n\nIt is still MUCH better than Grimaldi's next door - which is pretty inedible. \n\nPeople of Yelp- just go to DiFara (your mind will be blown), Spumoni Gardens (thick Sicilian) or even Not Rays in Ft. Greene - even their margherita outshines Juliana's. \n\nAfter eating at the \"new\" Grimaldi's and Juliana's - I now realize why the U.S. got into the war with Iraq. People are so easily influenced by stars and hype, don't think for themselves and depend on others to inject their minds. So they drink the kool-aid (read: bad pizza) and convince themselves they are ok with it... No they love it (because their conscious is saying \"everyone else loves this so I must too\").", "author": "Fazeela S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}