{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "The vibe of this restaurant is nice, the music is wonderful, the food is spectacular and it is not pricey at all. The only con of this restaurant is the time it took them to come and take our order.", "author": "Ahmad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "You want some good Brooklyn pizza without walking too deep into Brooklyn, then come here. Small but very nice decor. The staff is attentive and fast. This place competes with another spot next door to it but the only upside I saw to this place was that they accept credit cards. The one next door, said cash only at the door. \n\nThe pizza was perfect. You can taste the fresh tomato sauce and ingredients. We ordered the Margherita pizza but we added pepperoni to it, something the waiter recommended. Best pizza I had a while.", "author": "Hugo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-11", "description": "Mr. Grimaldi opened up a pizzeria in his old location after selling off his namesake to someone else (who has expanded it all over the country now...I saw one in Dallas). He also hangs out and talks to his customers.\n\nThe pizza is good like I remembered. Fresh, simple, and that 800 degree oven works wonders on the thin crust. I'd get a margherita and add a few choice ingredients to it. After my last experience at the Grimaldi's (which is now down the street in the old bar I used to have drinks at)...I think I'll come here for pizza when I'm in DUMBO.", "author": "Mary P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "The reason I am not giving 5 stars is solely because the reputation this place has as being the best pizza in NY/NYC is something I considered before going and tasting the pizza, and while it was truly great pizza, I don't know if it is the BEST I have ever had. However, it is 10000% worth the trip - they open at 11:30am I believe so we got there at 11/11:15am and there was a very small line so we got seated right away once they opened. Yes, it is early but unless you want to stand outside for over an hour, I truly don't mind eating lunch at noon. \n\nThe pizza is thin crust and just classically delicious - the sauce, cheese, crust, everything is solid and great. Is it the best pizza I've ever had? Let me get back to you on that...but it is definitely up there.", "author": "Becca K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "My boyfriend and I went to Juliana's around 5:00PM on Saturday evening. We waited about an hour to be seated, which is a definite turn-off for most (especially if you're impatient or hangry). But the wait was so worth it. When you walk in, you'll notice that the ambiance is frills-free: the table and chairs are packed together to accommodate as many customers at once and the cooks making each pie in front of a huge stove are the only highlights. But again, you're not coming for a chic ambiance: you're coming for the pizza.\n\nWe got two large pizzas: one with prosciutto and arugula (No. 4) and the other a white cheese pie with white truffles and pancetta (No. 1) . Yum. Everyone claims that New York has the best pizza; however, all the other shops around have nothing on Juliana's. Each pie is the perfect blend of cheesy deliciousness and arty gourmet. We had so many leftovers! Definitely a must, but I would go earlier to avoid the lines.", "author": "Kelsey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Woohoo! As good as it gets! Not the classic by the slice New York pizza, but awesome. Will return.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "Horrible treatment of customers. We waited in the line from 2:20pm and they let us stay there for 50 minutes without any mention and then at 3:05 told all the people in the line that you cant get in cause we are closing", "author": "Sina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "Here's my tip: go for lunch in the middle of the week on a miserably rainy day in late February. The place was almost completely empty-- certainly no line out the door. And of course, the pizza was fantastic. \n\nIt seems to me there's a pizza spectrum nowadays. On one end, there's your basic \"dollar slice\" that has a certain kind of charm though not really my thing. On the other end, there's more \"upscale\" places that have more exotic ingredients, things like pistachios, eggs, brussel sprouts, etc. Juliana's seems kind of in the middle (toward the upscale end) of the spectrum in that it's traditional/right out of Napoli sorts of ingredients but done perfectly.\n\nOh, and me and the Mrs. split our first egg cream-- I'd get that again for sure, too.", "author": "Steve K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "We waited about a half hour before we were seated on a Sunday afternoon, and let me tell you, it was definitely worth the wait! We ordered the special 1, and it is probably one of the best pizzas I have ever had. The ingredients were so fresh and tasty. It was so well balanced, and after eating 3 slices from a large I was comfortably full. Because it's thin sliced and well made, I didn't feel overly bloated or heavy after eating. This is how I can tell they use good ingredients.", "author": "Shawlien K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "First pizza place we've eaten at in NYC, so good! The service was great! We arrived close to closing and they were still hospitable even after closing.", "author": "Evelyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "This place is the real deal. Started up by the original owner behind Grimaldi's. The pizza does not disappoint. Brought my sister who was visiting back in June and she had me take her a second time before she left the city. Occasionally, craving Juliana's and I never crave pizza.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "1* for location. Everything else is 10*. Soooo out of the way well out of my way.  But it's totally worth the trip and even the 30 mins waiting which is not bad for Saturday night. The place is clean and full of light no dingy hipster scene so if you into that go elsewhere. No  blasting music so can actually talk, clean bathroom without an hour waiting in line. Only had the arugula salad and margharita pizza with mushroom. Both were very good, and it was enough of it too. Salad was a Perfect portion to share between 2-3 ppl. The taste and crunchiness of walnuts and sharpness of the goat cheese definitely did their job. Pizza was one of the best I've had so far. Can't comment on the meatballs my fellow diner had but  they were gone in no time and no complaints were made. The appetizers and pizza were brought almost together so better timing would make it perfect but beats waiting forever. Will definitely be back.", "author": "Don A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-09", "description": "It was one of the highly recommended restaurants in Dumbo, Brooklyn but I didn't think their pizza was all that amazing.  It was just like any other thin crust pizza I've had in Vancouver. In fact, I've had better ones locally.  However the flavours weren't bad just it wasn't outstanding for me.  We also tried their House special meatballs and the near was a bit flavorless and dry. I prefer more sauce with the meatballs.  Overall it was just moderately good.  To finish we decided to try their cheesecake. It turned out surprisingly good considering how I felt about our entrees.", "author": "Ada L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "So good! The salad, the pizza (traditional margherita with ricotta), and the apple pie were delicious! If you're anything like my me and my friends (there were three of us total), you would want to consider getting more than just one.", "author": "Britt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Amazing pizza! It's definitely worth the wait. I came to eat here in late December on a weekday night. The wait was about 20 min. It met up to the hype and my expectation. Crust was perfect and pizza has a good proportion of cheese and tomato sauce", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-01", "description": "Heard the hype about this restaurant. So we made the hike from the east village over to try it out. Heard some great things and there are lots of positive Yelp reviews.\n\nThere was a lineup in front of the door for seats which looked daunting, but moved surprisingly fast. We were seated within 10 minutes.\n\nOrdered a large pizza, which was a decent amount of food for the price, but the taste was quite mediocre. The food wasn't bad, but it certainly did not live up to all the hype.  We also did have to wait quite some time for our food to arrive after ordering too.\n\nOverall, ok food. Was a great walk across the Brooklyn bridge, but not worth the trek from Manhattan.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "We've only gotten carryout here due to long lines and crowds, but it really is exceptional pizza.", "author": "Ted T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Crazy long wait the first time we went (we waited close to an hour) but the pizza was great!! The Brookie also was tasty if you have room for it after. The next couple times we visited NYC we ordered take out and ate at the park to avoid the wait. But even if you want to wait in the line to dine in, it's 100% worth the wait!", "author": "Amy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "One of the best pizzas I've had in my life--not the most flavorful, nor the best bargain, nor the most representative of New York--but one of the best.\n\nCrust was stylishly burnt at the edges, portion sizes were as expected, and that. mozzarella. and. sauce. I still think about it now, and I had this months ago.\n\nI only ordered one margherita and another with pepperoni. Highly recommend the pepperoni; can't say much about the other toppings, but I regret not ordering more of 'em.\n\nCustomer service experience: busy, but they have it well under control.\n\nTip: Call in and order in advance. Line's shorter than Grimaldi's next door (read the other reviews here if you wanna know why I think that's funny), but it's still gonna take about 15 minutes.", "author": "Lila V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Wow. This food is amazing. Get the large; it's worth every bite. I had the prosciutto, and it was the best I've ever eaten.", "author": "Lydia C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}