{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "Juliana's pizza is consistently very good, but never mind blowing, and never something I find myself craving again and again. Definitely worth a visit, but you probably won't be clamoring to return. Pizza is solid, but not spectacular. Service is okay, and decor is a little cheesy. \n\nWorth a try, but not a destination pizzeria and not as good as the hype might suggest.", "author": "Junie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "I've been dying to try Juliana's ever since I read an article about it being the \"original\" Grimaldi's.\n\nThe pizza here is definitely comparable to Grimaldi's, but I think better because it has a subtlety to it that makes a big difference when you plan to eat more than a couple slices.\n\nI definitely recommend this place if you're serious about pizza, or want to go to Grimaldi's but don't want to wait in that long line.", "author": "Jason Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Good pizza, no doubt about it, but I'm unconvinced it's worth the wait.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Absolutely loved this place. The outside of the building doesn't do it justice. The interior is cozy, intimate and not exactly roomy but comfy enough. The food was delicious! We started with a bowl of soup then a large Margherita pizza accompanied by Brooklyn lager. It was perfect. I finished up with New York cheesecake while my husband had cannoli. Our waiter was charming and attentive-probably the best we had on our trip to NYC. I definitely recommend it to anyone not wanting to stand in line next door at Grimaldi's!", "author": "Aunt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "definitely worth the trek to Brooklyn from the UES!  There was a line outside the restaurant when we arrived and when we asked about takeout they said that they were too busy and couldn't accommodate takeout.  We waited about half an hour for a table.  The specialty pizzas can not be altered so we got the margherita pizza with sausage.  The crust was a perfect amount of crispy and the pizza had excellent flavor.  I would definitely make the trek again!", "author": "Christina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Most amazing pizza ever! Everything is fresh with the perfect crispness in the pizza dough. Used to work in Dumbo, which made it easily accessible for lunch. But anyone willing to go the extra mile for a great pizza, do visit! You'll not be disappointed.", "author": "Dipti D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "What Grimaldi's used to be! Started by the same owners who became disillusioned with the commercialized pizza business. We had the no.1 with pancetta and truffles and the quality of the ingredients really came through. Also has the margarita with sliced meatballs. The red marinara sauce was extremely fresh! This place comes highly recommended.", "author": "Ashley A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "The pizza here is quite amazing--fresh ingredients, nice thin crust, and not overly greasy. In addition, the wait time is much shorter than the pizza place next door.\n\nI generally steer away from pizza joints, but I am so glad we ended up going to this one. To start, we had the arugula salad with goat cheese and walnuts. Pizza joints are quite notorious for making salads with bad ingredients, but this one was very fresh. I only wished they served more for the large. We had a sausage pizza and requested half the pie to be made without meat. The non-meat portion was still delicious. \n\nFor dessert, we had brookies, brownie cookies. They were a delicious option for the lactose intolerant.", "author": "Yasmine K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "I had the pizza special no. 4, which is tomato, mozzarella, prosciutto, and arugula and later had the margherita pizza.  I came here for the first time with 2 friends on a Friday.  There was a big line but a short wait.  The service was fantastic.  I would recommend the large size because the small is definitely not enough for 3 people and the pizza is so delicious, you're going to want a second or third slice.  The pizza was so good that after devouring one large pizza, we had to order a second.  Juliana's is also in a great location, you can take a short walk to view downtown Manhttan under the promenade.  I absolutely recommend Juliana's and I will be back soon!", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Best pizza in Brooklyn! I've been coming here since I was a kid and I'll keep on coming here. My favorite is the sausage and fresh garlic large pizza with a pint of Peroni on tap.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "Ab.so.lute.ly FABULOUS. Eating pizza in Brooklyn was on my bucket list... and we were going to go to Grimaldi's, but then we learned this WAS the original Grimaldi's. So glad we choose this place. Order the No. 1 if you like white pizza... It is ah.MAAAAAA.zing.", "author": "Cecily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Best NYC pizza and prompt service for Take Out when you call ahead!!  Pizza reheats well!", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-16", "description": "I came here on Saturday night around 10:00.  No wait!  Woop woop!  We were greeted with a smile and immediately seated at a cozy table in the back.  Within 2 minutes, our server greeted us enthusiastically with menus.  He returned quickly for our order.  There were two of us so we weren't sure which size to get, he was quick to tell us a small would be plenty.\n\nOur drinks came immediately followed just 10 minutes later by the glorious margherita pie.  Our waiter's advice was dead on - Small pie was perfect for a pair.  The crust was just crunchy enough, not too soft or mushy but not too brown on bottom either.  Everything was amazing.  Also they updated the space so it's eons brighter and more inviting than when it was Grimaldi's.\n\nHighly recommend for quality service and food!", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "Birthday dinner here with one of my besties after photos at the Brooklyn Bridge during my first trip to the Big Apple. The wait wasn't very long. Patsy comes around and visits with every table, asks where you're from, flirts with the women lol and poses for pictures with fans. Pizza came out quickly. I had several glasses of the house red and it was just the perfect touch with a great sausage pizza, the same pizza Frank Sinatra liked!  Great experience. A must-see for first timers to NYC. Put Juliana's on your New York bucket list", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "The best pizza I have ever eaten!  We got the number 1 special and it is amazing. 2 cheeses , prosciutto , white truffle oil and scallions.  Amazing.  The pizza is so good that my wife,7 year old daughter and I polished off a large. Add to it a nice craft beer selection. Awesome. Little pricy but worth it.", "author": "Joel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Great Grimaldi's pizza without the Grimaldi's wait next door. Went with Arugula salad with goat cheese and walnuts. You can't go wrong with that combination! For the pizza, we shared a Margherita. Pizza and service were very good. Skip the line at Grimaldi's and stop in Juliana's.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "Dumbo. You have to order an entire Pizza, but totally worth it. I sat in front of the pizza oven alone and traded slices with the nice people sitting next too me. Very good and easier to get a seat than Grimaldis.", "author": "Loren P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "This is by far the best Pizza spot in NYC.\nIts lack of outright fame make its an easy place to walk in and grab a table\nThe constant presence of Founder Patsy Grimaldi a NYC pizza godfather makes this a unique place to eat- he always walks around the restaurant asking patrons about their experience and generally shooting the shit with them.\nThe pizza- well I've been here over 5 times and its incredible. Better than Grimaldi's next store or Lombardi's in Little Italy. \nThis is a quintessential NY experience.", "author": "Jamal M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Honestly I'm a loyal Grimaldi's girl. Always have been. So I feel like I'm cheating on an amazing relationship by posting this review. It's the best guilt ever though. Honestly we only went to Julianna's one day because I didn't have cash on me and I heard they take cards and now we can't stop going there. It's become a once a month visit. The wine list is lovely too. The pizza was so good. It's always great. It's amazing. It's the best pizza ever. The atmosphere, the staff, the food, the wine, everything is great. I love this place.", "author": "J I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "NYC pizza at it's finest! What is not to love about this place? Without getting into the whole (this is the originals Grimaldis) discussion let me just say: TRY the Pizza HERE FIRST! My only regret is not ordering another 3 more pizzas to go!", "author": "Jesse J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}