{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "I'm really not here to take away from all the good reviews. The pizza here is good. I like my pizza more on the crispy side and I'm very picky on sauce. I just feel most of the 5 star reviews are coming from tourists who perhaps live in areas without authentic Italian pizza. I grew up in the Bensonhurst section of Brooklyn surrounded by some of the best Italian pizza shops and bakeries in NY. Granted most of the old places are gone so this place moves up the chain but you can't compare it to Di Fara, Totonno, Joe and Pats, Deninio, L\u0026B Spumoni, Peter Pizza on 80th off Stillwell Avenue in Brooklyn (which in my opinion is the most hidden gem in all of Brooklyn) or John's. All those aforementioned pizza joints are still in business. Those places get 5 stars in my book. Like I said, the pizza is good, service is decent, but 5 stars is a stretch to me. There's one last issue and I think only my Italian friends can empathize with me on this. The people making the pizza behind the counter here are not Italian. You say who cares? I do. In most authentic Italian restaurants, the owners themselves make the pizza. They may have help, but if you check out Di Fara or Totonno for example, only the members of the family are making the pizza. Its that Italian touch that makes all the difference.", "author": "Robert B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "Pizza's own Patsy Grimaldi returned tonight to the worldwide battle of the pies that his family has been at the forefront of since 1933 when his Uncle's East Harlem pizzeria opened for business.  Uncle would be proud.  PG fires his oven to perfection and the result is a heavenly juicy-chewy-smoky crust to die for.  The toppings are as great as any to be found in Italy or elsewhere.  In an old world touch that will be beloved by anyone who appreciates a \"delicate hand\" when it comes to spices,  each pie is seasoned individually before firing.  Taken all together, Juliana's pizza has the body \u0026 soul of a masterwork.  PG makes the original coal-fired, brick oven pizza from the old days when gourmet was a french word not used to describe italian pizza.  The best pizza in New York is back.", "author": "Tony D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-27", "description": "I've been meaning to try Julianna's pizza since they took over the old spot of Grimaldi's (or maybe it was theirs to begin with). It doesn't really matter who came first. What matters is the food they serve. \n\nWe didn't have to wait very long and was seated after 10 minutes. We ordered our first pie which was sausage and sweet onion and was very excited to show off NY pizza to our friend who's from out of town. Pizza arrived and we each took a slice, but before we took our first bite we noticed that it was missing the sausage. We waived to our server and asked what  had happened to the sausage missing from our pie. Instead of apologizing for messing up our order, he was very rude and suggested that maybe we could include the sausage in our next order. Mind you we waited for a good 20 minutes for this pizza. After going back and forth with our server, he said he would gladly take away the pizza and make us a new one with the right order. WTF??? We didn't give the impression that we wanted the pizza taken away. We waited 20 minutes and it was dinner after all. Wouldn't you just give the pizza on the house instead of throwing it out away? Long story short, he ended up giving us a free pie.\n\nNow the pizza. Undercook and doughy! If this is all they make at Julianna's, wouldn't you think they would have perfected the art of making a pizza?? It was the worst pizza I've ever had! The second pie came and it was cooked unevenly. One side was well done while the other half tasted like bread with tomato sauce. Just horrible. I couldn't wait to leave that place.\n\nSorry Julianna's, I tried.", "author": "Roz E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "If you want the best, go here! Juliana is always greeting and checking in with his customers. It's about the experience and quality in preparation, ingredients, presentation and enjoyed! A gem of NY!", "author": "Allan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "We love Patsy Grimaldi!  Favorite pizza in Brooklyn, and Patsy is such a nice guy.  Don't bother standing in line at Grimaldi's (no longer owned by Patsy) for the pale imitation when this is the real thing!", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-12", "description": "Ordered takeout and still waited when I arrived even though they said it would be ready.... Very annoying.....", "author": "Chip B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-28", "description": "Went to Juliana's again tonight, second time this month. It was just as great as the first time. The waiter was very nice and helpful. Our table even got a visit from Patsy Grimaldi himself - class act! We'll be back!", "author": "A R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "This is awesome pizza!  It's right next door to the oft-praised Grimaldi's but the day we were there Grimaldi's had a line 20 deep out the door, and Juliana's was immediate seating.  It's a cozy restaurant with great wait staff.  Crusty on the outside and chewy on the inside of the crust,  perfect sauce and toppings. We had the margherita pizza and soft drinks.  Fantastic.  Can I get one by UPS?", "author": "Tammy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "Yes, yes and yes. I'm assuming if you asked me if it was worth the wait, delicious and if the history/story is all that fascinating. Compared to Grimaldi's, the line is reasonably shorter, but that's not why I came here. I came because other yelpers gave high marks for this spot and it's well deserved. First off, the ambiance is very cozy and waiters are nice. This is already different from Grimaldi's. They take credit cards! AND...who could possibly beat seeing Pizza Celeb Patsy Grimaldi in the flesh and supervising the restaurant? He came by to ask my bf and me how our meal was and showed us pics of him, his uncle (who taught him how to make pizza) and Frank Sinatra. Ultimately, it's the pizza that brought me here and I will certainly walk the bridge again to eat this pizza again. If you care to know, we ordered Margarita Pie with extra Pepperoni and garlic. The pizza was perfectly balanced and and not soggy (my pet peeve). Give Juliana's a shot, chances are you will love it.", "author": "Marissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "Way better than Grimaldis since it's the real Grimaldis.   Has the original oven, recipe, and owner.   Hope the tourists don't realize this.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-12", "description": "If you can dine at Juliana's without the care or knowledge of the dispute between the owner's of Juliana's and Grimaldi's; you would find yourself in a family run restaurant where the owner and his wife are quite involved with the daily operations of the establishment. The owner, would make his rounds to each table to check in on the customer's current experience with the food and would even strike up a random conversation which further adds onto the dining experience a memorable one. The pizza is definitely a notch or 2 above the usual 'popular' establishments (there's way too many variables and opinions as to which place has the best pizza in NYC), when I say 'popular' I refer to the places where there's a ridiculous line of predominantly tourists outside waiting for a table. If I was to choose between Juliana's or the Grimaldi's now located down the block, I would choose Juliana's in a heartbeat.", "author": "Rich W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "Was in from Los Angeles and heard about Juliana's opening by way of an article in New York Magazine. I used to eat at Patsy Grimaldi's back in the late 80's/early 90's. Well, Patsy is back at Juliana's (same location as in the good old days) and the pizza is better than ever. The best way to eat a Patsy Grimaldi pie is simple: go for the original Margherita, just sauce and cheese. It's hands down the best pizza in the country. Hoping they'll consider bringing one out to LA sometime soon.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-28", "description": "I came in for pick up on the way home from a long car ride. I gave my order to the lady and she put it in. In the meantime, I sat overlooking the pizza preparation area. I must admit the pizza looked and smelled great. Next to me was a woman and her son who were anxious for pizza, having waited already more than 20 minutes and saw several people served before them who arrived after. These people eventually got their pizza, but it still gave me some concern. After 20 minutes I went to the cashier and asked how much longer it would take for mine to be done. She looked up my order and apparently it was \"forgotten\" even though it was in the system, and said it would be another 20 minutes. She didn't offer anything complementary, and didn't even seem to be offering to put my pizza in next, as they shouldn't take 20 minutes to cook. I asked for my money back and walked out, and relayed the disappointment to the members waiting in the car. 20 minutes and nothing to show for it....can't give more than a 1 for that service.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Maybe it's their ovens, but Juliana's pizza is amazing!  This is not a normal pizza place, but a great restaurant with great salads and desserts.  Lots of wonderful toppings for the pizza that are fresh and delicious.  Loads of great choices to drink, including wine, beer, sodas and real seltzer that's from a syphon bottle.  I even had an old fashioned egg cream, which I thoroughly enjoyed.  Juliana's is also wonderfully situated on a great block not far from the Brooklyn Bridge.  Love it!!!", "author": "Naomi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "Juliana's is owned by the original Grimaldis.  What is there left to say?  No line and great tasting pizza, but kind of pricey.  They had free beer samples when we went from a local brewery.  Great when you have friends visiting from out of town who want the real NY pizza experience, but not affordable or worth it for your regular pizza fix.", "author": "Mar B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "Skip Grimaldi's and go next door to Juliana's!  The pizza is great without the wait.  If you ever go to the park under Brooklyn Bridge grab a pie from Juliana's and head to the park.  The pizza is delicious and the wait is not as long as Grimaldi's.", "author": "Bonnie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "The real deal! Amazing flavor and very friendly service. I prefer this place to the otherwise popular Grimaldi's next door.", "author": "Matthew H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "What a hidden gem! It's located right next to the famous Grimaldi's but what most people don't know is that this place is owned by Patsy Grimaldi. Thus, you can skip the long lines at Grimaldi's and come here. I went on a Sunday at 6 pm and there was no wait, unlike Grimaldi's which had about 30 people lined up on the sidewalk. Our server was extremely friendly and attentive. We ordered the margherita pizza and it was DELICIOUS. Although they should technically be the same, I enjoyed it a lot better than when I ate at Grimaldi's, which is still good also.", "author": "Stine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "I've lived in NYC for 7 years, but never did the walk over the BK Bridge and eat Grimaldi's thing.  Last Sunday I finally made the trek over the bridge with a friend only to see a ridiculous line outside of Grimaldi's.  Instead of waiting, we walked next door to Juliana's and were seated immediately.  We did half ricotta/mushrooms and half sausage/fennel.  Both were delicious.  The crust was perfect and the cheese/sauce combo was amazing.  The staff was friendly and accommodating.  I would definitely come back here.", "author": "Lori F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "My wife and I had a great experience this afteernoon, a great pizza at a reasonable price and great service.  The staff were working as a great team with everyone doing all jobs and working together.  Great to see a well oiled machine at work resulting in a great experience!", "author": "George K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}