{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "Thank goodness for Tourists because this place and Grimaldi would be out of business. These two establishments I call the Disneyland of pizza\n\nGreeting- not really\nVibe- ice cream shop decor\nPrice- expensive\nService- fast turnover. They want you out\nBathrooms- fail. Stairway to hell on one\nParking- good luck. Lot best bet\nFood\nMeatballs- dry and too much garlic\nPizza- same as Grimaldi. Boring and way too expensive. Some pies are close to $30. WTF! Keep paying these ridiculous prices out of town guests. \nHard dry crust. Not enjoyable\nCannoli- looks like a kids dessert. Shell was perfect. Cream was like paste. Skip it \nWIGB? No way\n\nKeep Waiting in line suckers!", "author": "Hungry K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "My son and I ate here the first day we arrived in NYC. I never realized how great the views are from this Brooklyn pizza eatery... Chosen just because of the excellent reviews found here on Yelp. Thanks Yelp! The pizza was awesome, but the desert was DIVINE! Everything is from scratch so it sells out early. I had the cannoli which was the best I've ever had in my life. This place is amazing. Quick and friendly service. Small line outside at noon on a weekend, but only waited 5 minutes. Inside, small and cozy with a busy atmosphere. You can here everyone's conversations, many people jolly while drinking their delicious draft beer. Bustling environment, true EMPIRE state all the way. I loved it. Next door is the other pizza place that the man started decades ago. Julianna's was a present to his daughter. Her own pizza joint! Now that's a legacy! Highly recommended", "author": "Norman S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Huge pizza with reasonable price!! I love the avocado pizza!! The staff is helpful to separate our pizza. Will come back again!", "author": "Ayin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "One of the best pizzas in New York. We visited on a Saturday evening and waited about 45 minutes for a table for 2. We dined outside which was nice except the sidewalk is on a slope so that got some getting used to. Otherwise their pizza is amazing. The crust, the cheese, the toppings, the sauce, they were all good. \n\nWe were both so hungry we ate an entire large pizza between the two of us.", "author": "Jin J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-27", "description": "Unbelievably amazing location! Our server Wes was awesome; I would definitely try to get him again if I were to go back. \n\nThe arugula and frisée salad was amazing! Very fresh and very nice combination with radishes, onions, walnuts and cheese.The lentil soup was good and hit the spot on this cold, rainy day. The espresso was just ok, and tasted a little bitter to both of us. The pizza fell flat for us. We ordered the number 1 and it was super oily and thicker than I expected. The oil was dripping off the pizza and was quickly soaked up by the dough which made your fingers feel pretty weird. I definitely would order something else were I to go back. \n\nWhat would really keep me from going back though is the price. Probably expected for the area but the items labeled above were $74 including tip. Judge that how you will but personally I'd rather go a little further for a similar experience for less cost.", "author": "Saimir O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-29", "description": "It actually pains me to give this place 2 stars, but I truly have experienced better and probably will not return.\n\nI'd give the service 5 stars.  Stopped by on a Sunday night around 8:30pm - appears to always be a long line/wait outside, but it wasn't lengthy.  We were seated fairly promptly and waited on immediately.  \n\nPlace has history and its a great location, but that's about it.  My girlfriend and I ordered a small Margherita pizza and 2 glasses of prosecco.  The pie was actually watery and could have used more cheese.  The mozz was delicious and that was it.\n\nTIP: no slices!  They serve ice cream from the Brooklyn Creamery.", "author": "C T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "laugh at the line outside Grimaldi's next door as you walk into JULIANA's the restaurant owned by the REAL GRIMALDI.. Juliana was his mom\n\nNO line/wait when we arrived! i don't think people know yet\n\nthe ambiance \u0026 menu at Juliana's is more modern .. not your typical home-y italian pizza joint.. kind of pizza they make here isn't like Grimaldi's\n---#4 arugula prosciutto \u0026 mozzarella: small was enough for the 2 of us to share... quality ingredients w/ yummy sauce!!\n\nbetter than grimaldi's next door BUT the pizza isn't better than my top (Luzzo's)", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "So tastes like Giordanos but slightly different in the best way possible. The downside is the wait, took a while to get a table but the reason is because the place is always packed because the pizza is so legit. Just make sure when you come you're not starving because of the wait. Just know it will be well worth it!", "author": "Ivan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Normally I don't much have to say about pizza as long as it's very cheesy. The pizza here is very good ~ thin crest and very cheesy. Thank god me and my friends were very lucky we didn't have to wait. I heard there is normally long lines", "author": "Shirley L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Solid pizza in Brooklyn, highly recommend. Just right in DUMBO not too far from the manhattan bridge. We got the large #6 which had guacamole and chicken and was enough for three people. Definitely coming back!", "author": "Josh K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "My boyfriend and i was actually going into Grimaldi's, but it was a shorter line here so we tried it. We were so happy that we came here. The pizza was great. Definitely Going AGAIN:)", "author": "Kashantray C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "TL;DR: We love this fresh out of the oven, made to order pizzas!\n\nWe came here on a rainy night so I believe many people decided to stay home. The place was only half full as we arrived and we were seated right away. Their menu consists of soups/and salads, classic pizza bases if you like no-fills, their own specialty pizzas, and a make your own section of all the toppings you can add to your pizza. For a small place like this, they have a pretty extensive drinks list.\n\nWe ordered the specialty No. 3 and No. 4 because we want to try both the tomato and white pizza version. The No. 3 has mozzarella, sausage, broccoli and mild flavor of garlic; and the No. 4 has tomato sauce, mozzarella, arugula and prosciutto. We didn't think the wait for the pizzas was that long and they came out perfect! You can taste in the crust that the pizza came out of a coal oven and the cheese was melting right when you bite into it. All the ingredients compliments each other. Between the four of us, we were divided whether the white pizza or the tomato pizza is better. It's safe to say, just try both!\n\nThe only downside to this awesome meal was that the place became really stuffy as the time went on. I think it was because the weather started to turn cold and they turned off the A/C but then it became warm again that night.\n\nOverall, it was a great experience and would love to come again!", "author": "Peter V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-03", "description": "This is supposed to be the famous Grimaldi pizzeria?! I've had this place on my bucket list for years. Since I'm moving to San Francisco next week, my friends and I decided to check this place out as a last hurrah. Unfortunately, the pizza was really underwhelming - I'll get to that later. We knew there would be a long line, but surprisingly it only took us 10-15 mins to get a table on a Wednesday night.\n\nThe decor is very wholesome. We spotted a couple next to us, obviously on their first date. It's a cute date spot for a foodie or pizza lover. Our server was friendly, and let us add another seat to our crowded table when a latecomer arrived. We ordered 2 pies of pizza and it took roughly 20 minutes to get to our table. \n\nWe got the pizza special no.1 and the margherita. When the pizza special no. 1 arrived, it was really greasy. I specifically remembered oil dripping on my hands and plate every time I took a bite. I'm not really a big fan of bacon, and thought it was too salty for my taste. The margherita was good in my opinion, but I've definitely had better from random pizza joints around Manhattan. \n\nOverall, I think my whole table was a bit disappointed. At $3.75 a slice, you would think a pizza would be more impressive. Not sure what the hype is all about, but I don't think I'll be coming back here anytime soon.\n\nFYI - there's a max of 3 credit cards per table.", "author": "Joyce S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Been to the place next door twice. First time thought is was amazing, 2nd time though it was good. Apparently the owner or co-owner of the place next door opened up Julianna's. So back in town again and we tried it out. Holy heck!!! The 45 wait in line was well worth it. Hands down some of the best pizza I have ever eaten in my 40 plus years of being a foodie! Why not 5 stars, well I really don't have a reason other than I rarely give out 5 stars for anything. This place is a STRONG 4 1/2 stars and a MUST eat in Brooklyn.", "author": "C A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "And this is why I love NY. My kinda pizza. \n\nJuliana's or Grimaldi's? While I heard of Grimaldi's and the fact it's up the street, no one was in there. That got my friends and I questioning its validity to be a must-try. Juliana's was so busy we decided this must be the place locals would rather dine at. And our decision did not disappoint.\n\nWe sat at the bar to watch them make our margherita pizza. We ordered the large in which was shared amongst three girls. While waiting, we received our order of Matt's mix salad which was a great start. After little wait, the pizza arrived in all its glory. It was love at first bite. \n\nTo end our delicious meal, my friend ordered the cheesecake and I ordered the Brookie bridge. I'm not much of a cheesecake fan but my friends seemed to like it. As for the Brookie bridge, that's why one star is taken off. I guess my expectations were so high after that pizza. The Brookie is basically a brownie cookie and the bridge is the ice cream sandwich version. If anything, I think having one Brookie would have been enough. \n\nOur server was also great. Overall, no regrets.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "I was told to go here by multiple people. The pizza here is pretty good! I go the large Margherita pizza. It was pretty busy during lunch with a large line out the door. The wait was not too long and the pizza came within 15 minutes of ordering. \n\nPersonally i'm not a huge fan of thin crust pizza but this pizza was real good. The crust had the perfect amount of crunch and was a lot doughier than other thin crust pizzas. \n\nOverall if you are in the area, this is definitely somewhere to stop by for a bite to eat. I wouldnt go out of my way to travel to Brooklyn for it though.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Very delicious and fresh. Was worth the line out and down the block. Loved the fresh mozzarella! Loved the sauce and the crust was so good. \n\n\n\nOrdered the margarita with pepperoni.", "author": "Josef L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "MMMMM. We had the margherita pizza with sausage and pepperoni. We sat at the counter so we watched tons of pizzas being made. True talent :).\n\nService was good and the pizza was delicious. The only bummer was that we couldn't eat the whole pizza because we were too full from eating all day. We took it to go but this is the type of pizza that does not keep well. It was soggy but I still ate the leftovers. \n\nDefinitely worth a visit and try to eat ALL your pizza while you're still in the restaurant.", "author": "Tuli S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "I came here with a friend of mine who's a little bit of a pizza snob. Full disclosure: I did not eat at Grimaldi's before, so I can't really compare the two. My dining companion has and swears by Juliana's. \n\nWe got there at around 7PM and luckily there was no wait! (Ironically, Grimaldi's line was as always stretching around the block.) Our waitress was really accommodating and sweet and made small talk, quite like small family place, which was a nice touch. \n\nWe got the Margherita and it was amazing! No joke. We got the small, mostly because we were two girls and the large looked HUGE. It's a pretty good meal -- four slices of pizza. The flavor, everything, en pointe! It was very classic with a lot of tomato flavor. I really enjoyed it. Was it the best pizza I ever had? No, see my review of Osteria Procaccini in NJ. But it was pretty damn close!\n\nPS. It's also right next to the pier and Brooklyn Bridge Park. Great location for a date night and a stroll! There's also a rather interesting bridge nearby ;)\n\nUPDATE: Juliana's is still the best. I've had Grimaldi's now and Juliana's has it beat easy. Don't be afraid of the line - it goes quick. The line is actually faster than take-out. I've now tried the large margherita with pepperoni and cremini mushrooms ($23 + $3 each for the toppings; by itself without toppings is $23) and the No 1 small ($29). Still so good! We also got two of their sodas - the vanilla cream and orange - would also recommend those as well. They also have cheap wine to share (~$29 for a bottle).", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "After a few bad starts at NYC pizzas, took my family to Juliana's. It was a treat ! Margherita pie was simple, flavorful and the right mix of crispy - soft. The other white sauce pizza was excellent as well and the cappuccino was exquisite - had to have 2 cups ! Perfect dinner. \n\nHIGHLY RECOMMEND these guys over Giamarcos or Vinnie's !", "author": "Ma R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}