{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Amazing pizza - worth coming from Manhattan to experience this joint.  Great service, great people, attentive staff.", "author": "Raja M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Tasty and cheezy pizze. Highly recommend if you are going to Brooklyn bridge area.", "author": "Big B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "I've never been to Grimaldi's, but I met him at Juliana's. I loved the place, the man, and the pie. The service is aggressively efficient and I mean that as a compliment. The pizza was on point--perfect sauce, just the right ratio of sauce to mozzarella. The crust wasn't quite charred enough, but I think it was more a fluke than an issue with the dough. Patsy himself offered to remake it which I declined but appreciated (I happily accepted an espresso on the house). The corner table to the right of the kitchen was a lucky score--I felt like a capo. A really nice experience. Go.", "author": "Gordon R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Margherita Pizza with prosciutto-perfect balance of flavorful tomato sauce, fresh mozzarella and basil. The crust was light, airy, and while it was not burnt, it had the perfect amount of browning at the edges to give some extra flavor. The prosciutto was a nice addition. Tied for best pizza I've ever had. As crowded as it was, service did not rush you, but was attentive and no complaints. Would like to go back another time and try some of their other dishes.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "Best pizza ever! NYC, LA, Italy has nothing on this joint. Right next door to Grimaldi's and this place cooks up the flavors 100 times better. Can't wait to go back and get a little piece of heaven.", "author": "Elsa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "The original Patsy Grimaldi is back in his original location! I stumbled in because I didn't want to wait on line at Grimaldi's (next door). My GF and I were seated immediately, at a \"4 top\" and told that another two would sit next to us, but they never sat anyone there and we had the table to ourselves. Fast service, great pizza, and reasonable prices. The beer portion of my bill was almost as much as my pizza! I would have liked the crust a little crispier, considering the coal fired oven, but that's nit picking, as it was a great meal. I will go back! Soon... Welcome back Patsy. Did I mention the man himself was in attendance welcoming everyone..", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Juliana's serves the best pizza that I've had in New York. Toppings were fresh and delicious, crust was perfectly crispy around the edges. The owner, Patsy Grimaldi, was in the restaurant this Saturday which really gave me the sense that he cares about his customers and the quality of thier experience and food. Really great place.", "author": "Taylor T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "My husband and I came on a Saturday night at 6pm and we were seated right away. Our waiter acknowledge us and our order was taken within minutes. He was very attentive and funny. He was on point with the water. \n\nWe order their cheesecake and Chocolate chunk  raspberry ice cream. They were both AMAZING!!! \n\nOur total was $35. Which was a great price for us. \n\nGreat place! Like Grimaldi's but way better service!! And no waiting outside in a long line!", "author": "Nancy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "Nice treat after walking across the Brooklyn Bridge. Great pizza, good atmosphere and no line like Grimaldi's right next door.  It is a bit pricey for pizza.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Our server David made the whole experience wonderful: knows the menu, friendly, properly explained the pizza size without trying to unnecessarily \"up-sale\", treats every table with upmost care and personal touch without hovering and uncomfortable table stops. Pizza's great, good wine list, mixed crowd of locals and tourists. Clean, efficient and great Brooklyn atmosphere.", "author": "Daria K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "It's similar to Grimaldi's, but better. Highly recommended. Grab a pizza and go to the park.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "I came here to give it a try since I've been to Grimaldi's a couple of times already. They renovated the whole place and it looks really nice. But we are here for the pie's. My buddy and I ordered a pie with pepperoni and it tastes just like Grimaldi's to me. Both places are just as good.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "I loved this place. We arrived right as they opened the restaurant, so we did not have to wait in the queue (as we got out of the place, there was a long line of people waiting outside). The service is excellent, we did not have to wait more than 10 minutes for our food to arrive. There is a bar area kind of seating, which has about 4 chairs and it overlooks the kitchen so you can actually see the pizza being made, which I thought was pretty cool. The pizza itself was delicious, definitely going back!", "author": "Anjali S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "Literally the best pizza I have ever had. i would honestly fly to new York just for dinner here if it wasnt so cost prohibative. the owner (Patsy) is awsome and his wifes cannolis should be enjoyed with someone you love. I wish yelp had a 6th star to give this family run business.", "author": "eric h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "Delicious pizza and our waiter (Terrance) was excellent!  Would definitely come back!!", "author": "Liz G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "There is only one Grimaldi's... And it's called Juliana's. \n\nDelicious food and attentive, polite staff. We come here often.", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "Juliana's serves the best caesar salad I've had in a looong while.  And the pizza is delicious - very similar to the pizza served at Grimaldi's.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "A-mazing!!!  Doesn't get better than this.  Margharita pizza is so simple but the real deal.  Must get a pizza with their pepperoni as well.  Gets very busy during lunchtime but regardless the staff provided great service.", "author": "Anna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "Don't waste your time at Grimaldi's. This place has superior pizza, ambiance is better and without a doubt service was amazing. Pizza was delicious. Highly recommend going here. Even had the owner come chat with us. Overall had a great experience.", "author": "Juan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "The best pizza I ever had. The most fresh cheese, thin crispy base, wonderful flavorful sauce. Wonderful ambience, great service, extremely friendly service, deserves six stars!", "author": "Arun P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}