{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Juliana's is definitely one of New York's elite pizzerias. It's up there with Di Fara, New Park, and Fornino. \n\nIt's a nice thin crust with a light char. The sauce is good and the fresh mozzarella is uncompromised. The pizza is baked with the basil, so it still adds flavor yet it doesn't offer that element of freshness that uncooked basil has. The pie is very well seasoned; it's one of the best pies in terms of seasoning.\n\nOn a Saturday night, our wait was about 45 minutes. Juliana's has a wide selection of bottled wines with several wines also offered by the glass. Also, they accept credit cards. All in all, I'd recommend coming here.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-31", "description": "Ordered: Margherita pizza\n\nPros--The dough had a nice char to it. The tomatoes used on the pie were very fresh. \n\nCons--It seemed as if half the slices were over spiced and the other half were just right. Considering I waited in line about 45 minutes and the pies were pricey, I had higher expectations for the taste.", "author": "Kerry G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "I highly recommend this place. If it were not run over by tourists it would get 5 stars. But for a quiet weekday work lunch during bad weather, this place is awesome. \n\nAlso, this is original girmaldis spot run by a relative, so it's probably more girmaldis than girmaldis next door.", "author": "B C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "45 minute wait plus 15 minute wait for pies. Worth the wait? Depends if your a foodie or not. Being born and raised in NYC, the two best pizzas are still Difaras number one and the rest underneath. I must say that Julianas number one special pie is quite unique and delicious so that's worth the wait. But the red pie, Difaras hands down!", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "This pizzeria claims to be the best in the country. Yeah right, I thought. Then I took a bite of the No. 1...\n\nThe No.1 is a thin pizza (with the perfect topping:dough ratio). It's topped with homemade mozzarella, scamorza affumicata, pancetta, scallions and oregon-grown white truffles in olive oil. If you're a white pizza fan, like myself, this may be the best pizza you've ever eaten. I have never tasted a topping combo orchestrated so well. This, my friends, is the real deal.\n\nWas the service or the setting five stars? No. Was the wait time five stars? No. But this pizza is five stars. I would give it 5 1/2 if I could. Life-changing, brag to your friends, must-do when you are in NYC!\n\nP.S. Read a little bit about the history of this place. It's hilarious!", "author": "Nicole W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Some Brooklyn locals told me this was the best pizza in Brooklyn. Annnnnd, I can't tell. I did wait almost an hour to get a seat. Does that mean it's the best?", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "I am normally not a fan of this kind of NY pizza.  Yes, it is NY, and it is authentic, but I like a big slice of folded cheesey saucey goodness that burns your chin and gets all over your shirt.   This, on the other hand, is very thin crust pizza, still foldable, but smaller and more manageable.  Moreover, I was a bit leery about trying Juliana's as my boss recommended Grimandi's as the best pizza in the city, which is stupid since the best pizza in NYC cannot also have locations in Tampa, FL, that while good, can't possibly be the best NY has to offer.  Anyway, knowing Juliana's was started by Placido Grimaldi, or Anthony Grimaldi, or Juliana Grimaldi, or something Grimaldi, made me wonder if this is really that good and really worth waiting in line for.\n\nLadies and gentlemen, yes it is.  Worth waiting for, for a couple of reasons.  Firstly, the wait wasn't too bad, though granted, it was 9:30 at night and presumably past the rush hour.  There were a number of tables in front of us, but we still didn't wait more than 30 minutes.  Secondly, this is mouthwateringly good.  There may be better, there probably is better.  Simple probabilities would say that the chances I went to the best pizza place in NYC out of the thousands of pizza places are pretty slim, but I hate statistics and probabilities.  As Han Solo once said, never tell me the odds.  He successfully survived navigating an asteroid belt, and I successfully found the best pizza navigating Yelp in Brooklyn.  Its the same thing, really.\n\nHoly hell, am I rambling or what?  Anyway, we split a classic Margarita Pizza (what's that?  It isn't made with tequila?), okay, a Margherita Pizza with pepperoni on half, and I successfully ate 5 of 8 slices.  It isn't my fault I am a faster eater than my girlfriend.  I got to the fifth slice before she could finish her third.  You snooze you lose (actually, she gave it to me because she's trying to fatten me up).   This pizza was topped nearly perfectly with sauce and cheese (it could have used a bit more of each) and delicious pepperoni.  I couldn't stop.  The best praise I can give this place is that we saw a couple behind us order 2 large pies to eat in, and when I finished that 5th slice I was jealous of them for having a second pie.  \n\nAll of that said, if you have a better pizza place and think I'm nuts, then to you I say, yes, I am nuts! Please tell me your favorite pizza place in the city and I would be happy to try it next time I an in the city, and update my opinion accordingly.", "author": "Todd B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "So for our trip to NYC we had to do Brooklyn Pizza we were between Julianna's and Grimaldi's, however the reviews for Julianna's convinced us and the line was shorter. \n\nAmbience: Due to the line of people trying to get in this place, the inside of the restaurant was tight, but as long as they had AC in the humid weather outside I didn't care. \n\nService: the waiter was great he was very helpful in helping us choose which pizza we should get. The line was pretty long and just so you're aware they close down the kitchen from 4-5. \n\nFood: We shared a small which was still big for two people and did the half white and red with prosciutto and pepperoni and it was amazing. One of the best pizza's I've had. Id definitely come back here next time in NYC", "author": "Karina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Quick history: Patsy Grimadli owned Grimaldi's. It was very popular even Michelle Obama called it the best pizza she has ever had (who is from Chicago, ouch). He retired and sold the name. The location moved to a bigger place next door. He didn't like that people were saying the pizza tasted different so he came out of retirement. He made Julianas where ok Grimaldi's was, named after his mother. \nI know this because I went on a tour in Brooklyn.\nSo! My friend and I had to try it.\nIt was delicious. 5 min wait on Friday at 6;30 ish, lunch time does get packed!\nAnd, Patsy Grimaldi came!!!\nIt was AWESOME. He came and sat people down and just walked around and socialized with customers. Thought that was really sweet and cool. This place has heart! Dude came out of retirement just so that I can have this pizza lol.\n\n\nvery delicious", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Best pizza I've ever had! Would go back to New York just to have another slice of heaven", "author": "Hector G-Toe D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "I like Pizza\n\nYou like Pizza (I'm assuming because you were looking for reviews to this establishment)\n\nPIZZA PIZZA PIZZA\n\nAlot people come here for pizza ( I mean you could end up a standing in line for an hour)\n\nI would go here to eat pizza\n\nBut I'm not a pizza connoisseur.....\n\n5/5 - Come here if you like good pizza", "author": "Reviu C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "I love Juliana's pizza. They always have lines out the door, and it's worth waiting. I always come with my friend and order one pizza and a side salad and it's plenty for two people. There are good options for vegetarians too. Definitely will make this a semi-regular spot, even though it requires a special trip to Brooklyn as I live in Astoria. That should signify how good it is!", "author": "Esmé M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Been there twice.  Always a wonderful experience.  Good food good service.  Meatball is highly recommended.  Good setting for family as well. No wonder why Julianna's rating is better than the tourist-trap Grimaldi's.  I tried to line up for the Grimaldi's once but was turned down by very rude front guy.   Saw many reviews how crappy the Grimaldi's is (both pizza and service). \n\nYou will get much better experience at Julianna's as opposed to Grimaldi's.", "author": "Kittipon M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Literally, not worth the wait or the money. Tony's frozen pizza tastes better. The only reason you'd go here is to self-acknowledge that you're a follower who does things so that other people will like them. Save your money and only stand in long lines like a douche if what's at the end of the line is better than what you could make on your own. This isn't.", "author": "Haywood J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "Best pizza I've ever had. Upon recommendation from another friend who described it as the pizza he's ever had, a friend and I went on a Saturday around 3 pm and had no wait. The pizza was perfect and service was great (they gave us recommendations because there was no way we were going to decide ourselves). The location is conveniently located by the Brooklyn Bridge if you want a post-pizza stroll. I still rave about how good this pizza was to this day....", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "I've lived in Brooklyn all my life and I must say this is hands down the best pizza! The crust is so thin and light but perfectly crispy. We got the margarita slice with sausage and Mushroom. The pizzas are made fresh and my boyfriend and I sat at the bar and saw the magic happen! Service is great and good environment. Only downside would be the long wait but it's well worth it!!", "author": "Anna Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "I haven't had much NY style pizza over my life, but i can say the pizza here is really good and i will come back!  Come now, come hungry!\n\nI really love the chewy thin crust, really taste  good stand alone.  The char from the brick oven gives a really nice flavor.  They really pile on the cheese, my favorite part!  Pizzas come out piping hot and your mouth just waters.\n\nI love that you can split half and half on the classic pies, i did half white and half Margherita.  I think the margherite is lighter and fresher, good flavors with plenty of cheese.  I also tried white pizza with meatball.  The meatball is a great addition, not salty with plenty of meat satisfaction.  They use fresh garlic on the white pizza, so it can be a little strong and spicy, so beware if you dont like fresh garlic.  \n\nOne large pizza is more than enough for 2, it can probably feed 3, but you should just order a large and save the rest for a great snack.  This pizza was so good, i saved the last few slices for a snack a few hours later; and it still tasted amazing even cold!  Prices are very reasonable, if not cheap.  Wait times are not too bad, they turn over tables fast, pizza comes out really fast and piping hot.  \n\nWhy not end your Brooklyn bridge walking experience by sampling some of the best thin crust pizza ever?  Juliana's knows what they are doing, a great slice of pie!  Definitely a must try pizza spot, and one my my favorite foodies while I visited NYC!", "author": "Terence N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-13", "description": "Waited 45 minutes and was disappointed.\n\nThe service- AWFUL. Asides from taking our order, our waiter only came back to give us the check. Never brought over crushed red pepper, didn't change our plates after our appetizers were done/before we got our pizza. Never asked us if we needed anything else. Just for the service alone I wouldn't come back.\n\nThe pizza- we got the classic Margherita pizza but added pepperoni and the white pizza. Neither was spectacular, pretty average pizza that I could get anywhere.\n\nThe cheesecake- SO good. I was happy with that at least.\n\nFor a 45 minute wait you expect to be blown away and we were not.", "author": "Shaida R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "So most of you probably already know, but THIS is the real grimaldi's. after grimaldi retired, he came back but with Juliana's. so this is pretty much the real grimaldi's minus the long line of tourists. However... there still is a line to wait, so get there early!\n\nyou know that a pizza is good when the crust is so good you want to eat every last morsel of carb on your plate. The pizza here is prob one of the best pizza's i've had. great NYC pizza.\n\nI recommend the Margherita with pepperoni (the standard. delicious) and the No. 1 (a bit fancier, but the cheese and olive oil with pancetta... amazing, but if you like tomato sauce, just know that this doesn't have it)\n\n4 of us ordered those 2 pies (small) and ended up paying around $15 each tax/tip included so a pretty solid deal for 4 slices!\n\nI'll def be back!", "author": "Yong K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "This place, hand down, best pizza we had on our trip to NY. I had found this restaurant as one of the top places to eat in Brooklyn. So my fiancé and I walked over the Brooklyn Bridge and walked down to to get this amazing pizza I had read about.\n\nI was very impressed. Great service! Attentive, knowledgeable and very nice. We had a flight to catch so we ordered immediately when we got there. Feeling kinda sluggish, we ordered espresso shots. Yum! We also gave into a sweet tooth for cheesecake. we did our meal a little backwards since we were waiting for the pizza. \n\nThe pie was awesome. it came out steaming and we both inhaled half of it immediately almost burning our mouths because we were in a hurry but also excited to try it. Delicious! oh  the sauce used was amazing and we just loved the cheese and topping choices. We didn't have time to finish but took the rest of the pizza togo. no joke, we flew home to FL and had the rest of the pizza for dinner. FYI to travels well.  \n\nMy fiancé says he wants to go back to NY just to have their pizza again!", "author": "Donna C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}