{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "We had a group of 7 and we were seated immediately when it first opened. They won't seat you until everyone has arrived. The place was full by 1150 and the next wave of seating wasn't until an hour later. \n\nOur group split three large pizzas. \n\nMargherita pizza was my favorite. It's just thin, crispy, and fresh. Wish there was more basil. \n\nNo. 1 was a white pie. I thought this was good, but probably my least favorite out of the three cause it was just cheesy with a bit of bacon. I personally like Artichoke's more. \n\nNo. 4 was a prosciutto arugula pizza. I really enjoyed this pizza as well cause I'm a fan of prosciutto and they didn't seem to skimp on it. \n\nService here was efficient. The pizzas all came out hot and they were quick to clear the tables when we finished each pie.", "author": "Edward W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "It was worth a try to wait for the huge line. I wouldn't wait for a long line but my mom and brother were visiting and they wanted to try here. \n\nWe ordered half Margherita and half White pizza. \nWe added mushroom, onions and extra cheese(definitely a good choice). \n\nIt didn't look that special but it was beyond my expectations. So so tasty seriously. \nIt was the best pizza ever! \n\nThe dough was crispy and fresh. The pizza sauce was delicious especially that white pizza!! \nIt was chilly outside when we came here. So we couldn't take pizza to go. \nBut next time, I will order to go and enjoy their pizza outside so I don't have to wait for a line. \n\nI will come back!! Highly recommended!", "author": "Haeri S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "Was here recently for a team holiday lunch, definitely see why this place is so hyped! Before they even opened, there was a short line outside waiting to get in. \n\nWe had 15 people so we ordered quite a few pies with some meatballs and dessert. All the pizza was freshly made and delicious! Margherita pies are my favorite, and this was definitely one of the best I've had. Their cannolis are great too. All the staff was incredibly nice and accommodating for our big group. Wouldn't hesitate to come back here again when I'm back in the area.", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Juliana's Pizza is a notable pizza joint in DUMBO area. They serve quality thin NYC style pizzas. Service is very accommodating and friendly. The venue has a decent amount of seating and it fills up quickly. I came early and didn't need to wait in line, but there was a queue when I left. Great pizza joint if you can beat the line!\n\nOrdered:\nMargherita pizza - standard, and well prepared with a good crisp. I hate soggy pizza.\nNo. 1 - a white pizza (no tomato sauce), comes with bacon and extra cheese and I think olive oil. I normally don't like white pies, but I thought it had a good hearty richness and bacon goodness. The cheese wasn't super overpowering either.\nNo. 4 - prosciutto arugula pizza. This was my favorite. Great balance of cheese, tomato sauce, and generous amounts of arugula and prosciutto", "author": "Sean W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "We first came to NYC in December of 2005. We walked across the Brooklyn Bridge and made our way to 19 Old Fulton Street. Freezing and starving we found Grimaldi's. The best pizza we had ever eaten. We went back 3 times over the next 5 years to the same location. Then Grimaldi's lost the lease on the 19 Fulton Street location and moved to the new location at 1 Front Street. The pizza, service and vibe had changed for the worse and we were completely let down. Then we heard about Julianna's ( read the story on their website to understand the whole story). This is the pizza we were looking for. Thin, charred and the perfect amount of sauce, cheese pepperoni. Perfection. At least it is for a us. This is why we come back to NYC every year. Walk the Brooklyn Bridge to really appreciate the pizza, location and history.", "author": "John P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Definitely a bit hyped as everyone says you need to try julianas/grimaldis when in NY. I stopped by on a Saturday morning and arrived maybe 15 min before opening and there were already about 8 people in line. By the time they opened, there were enough people in line to fill the restaurant. \n\nWe got the margherita pizza and added toppings since the other pizzas didn't come with sauce on it. It was good. Not too crispy and thin and not too thick and doughy. The crust was delicious though. \n\nSpaghetti with meatballs- It was okay, just your average spaghetti with meatballs. Probably a better choice for kids. Also you really can't mess up a dish this simple. \n\nArugula salad- VERY refreshing. Highly recommend that one if you want to add some veggies to your meal!", "author": "Tiffany K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "If you're in Dumbo and want pizza, you must go here! There will inevitably be a line and it will probably take you forty minutes to get through. Honestly, you're pretty much going to have to wait to get into most restaurants anyway so, from that perspective, it's really not a big deal; that's also how you know it's quality. I came tonight, on a Monday, and still had to wait forty minutes and when we left the restaurant at 9pm there was still a line the same length- so you really can't get out of it. There aren't reservations so you know that whoever is ahead of you in line is literally everyone who is ahead of you, which is nice. \n\nTheir pizza menu is good; each pizza comes in a small or large size but it's only a $3 difference between sizes, honestly get the small. We ordered two small pizzas among four of us and it was more than enough. The smalls truly look like a standard large pizza. If you share the pizzas it'll be a really cheap meal, if you come by yourself or don't split then the pizzas are kind of expensive. Definitely come here though, you won't regret it!", "author": "Caitlin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-04", "description": "The line is crazy! Expect a wait with the tourists especially on weekends.  I thought the pizza was good,  my companion thought the pizza was great.  They let us do half white and half margherita\nDon't be upset if they seat you at the bar.  I think it's actually better because you get to watch them make the pizzas while you wait!", "author": "Sharon N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Almost went next door but at the last minute we decided to \"linner\" here after a long few hours exploring the city and walk across the Brooklyn Bridge. \n\nThis is a nice little restaurant, not a by-the-slice kind of place. Of the specialty pizzas on the menu, the #6 looked very intriguing; however daughter wished for a simpler, more traditional pizza so we went with one of the classics. I added roasted peppers on half (Note: they still charged full price for the added topping even though it was just on half.) Something to consider if you're adding or creating your own pizza. \n\nThe pizza was really, really good. Not what I consider \"New York\" pizza, but I'm not sure that's the aim of the establishment - it's coal fired pizza. \n\nThe place is cozy and super cute. Our food was $30 with tip for a small, so not cheap. But we ate it all and left full and happy.", "author": "Jill H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "I walked the Brooklyn bridge today, from the financial district. Once exiting, I headed straight for Juliana's. Guys, there was a freaking line at 1pm. Seriously, a crazy line. I was standing in the scorching sun. The good news? It moved fast. Waited only 10 minutes or so. Such a quick line. \n\nI ordered the small margarita pizza. Added sausage and pepperoni to it for an additional $7. \n\nFolks, this pizza is overrated. Out of all the pizzas I had while in Manhattan, this one is the worst. Would I come back? Heck no. Prob will go next door instead, as that pizza joint was poppin too!\n\nPics are attached. Super thin pizza but super crappy taste too. Ya sucks. The pizza wasn't even piping hot. It was just mediocre warm. Blah!! Can you imagine eating a pizza that doesn't even taste hot? \n\nOh well that's all. Not worth your time eating here. \n\nAlso, there are 2 restrooms - one upstairs and one downstairs.", "author": "Dennis L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-25", "description": "Be prepared to wait in an out-of-the-door line near the river in NYC weather. But I'm telling you it's totally worth the wait. Their pizza is super thin, crispy, fresh cheese and tomato sauce. My favorite is just a classic margherita with fennel sausage. The meatballs are okay.", "author": "Hannah V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-03", "description": "Definitely an experience, because you will be hanging outside the restaurant more likely than not in line. Note that around the corner there is Starbucks and ice cream in case you want to indulge ahead of time. \n\nOnce you get inside the restaurant then service is wicked fast, which is super pleasant. We ordered the margharita pizza and the #1. One thing I appreciated about both is that they weren't that oily / greasy. So you could really focus on the pizza itself. Actually between the two the marg was my pizza of preference but our table was split between the two. Don't get me wrong. I think both pizzas were great, but would I say super exceptional? Probably not. But at least worth checking out for yourself! Prices are also very reasonable.", "author": "Ayushi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "We got the #6 special. It was SO GOOD. And service is fast. Everyone was super nice and friendly. The pizza fills you up more than planned. We also shared the meatball appetizer (we were starving) and the flavor and texture was perfect.", "author": "Chelsy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "A great option when you are looking for classic New York style pizza.  This spot may seem new, but it has an interesting history that is woven into the history of New York pizza itself.  The original Grimaldi's pizza used to be located in this spot, before Grimaldi sold it and the new owners moved it to a new place next door.  Now Grimaldi is back - same pizza, same original location, different name.  The masses are clued in and there are regularly long, long lines to eat here.  Grimaldi's is still next door and often a faster option.  The pizza here is thinner and tastes a little higher quality ingredients, but both are delicious.\n\nThe best thing to know about Juliana's is that they do take-out!  Call ahead, pick up your pizza in a bag (no boxes), and walk out to the water to enjoy two of New York's best things at once - the pizza and the views!", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "This is my favorite pizza in NYC. There are a couple more esoteric places that pizza-heads will seek out, but this place is top quality and a more reasonable wait. Finally, the location lets me pair a visit with a walk across the Brooklyn Bridge.\nSit at the counter in the back for a show, or on the sidewalk if the weather is nice. Have an egg cream.", "author": "Jeff W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "My favourite pizzeria in Brooklyn so far! Lovely thin dough and always tastes delicious. The only annoyance- every time lines of people waiting for a table even outside! Service is quick and friendly.", "author": "Marzena D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Okay, so I was waiting to meet a woman here for a date and she was 1.5 hours late but the pizza was so incredible, that I actually forgot why I was upset. 1 hour in a long line outside and 25 minutes awkwardly drinking water at a table as she texts me from a complete shut down train from Manhattan (how many dates and hookups has the MTA ruined? It'd be interesting to see that data tbh) - and still, all I could think about was the pizza.\n\nHonestly, there's tons of hype around Grimaldi's but the owner left and started Juliana's and it seems that folks that are in the know and over the hype of the now large pizza brand just two doors down stick with the original. The pie is perfect. If I could be in a relationship with a food item and not a person, I'd opt for that. Dating is weird, pizza never is. I'm not going to describe how good the pizza is, if you're reading this, you likely already know it's the best. Just go and eat the passive aggression away.", "author": "Morgen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-13", "description": "Best pizza I have ever had!  \nTotally worth the wait. \n\nOrdered the Margherita and the White Pizza.  Loved both but Margherita was slightly better.  \n\nThe Ice cream was wonderful as well. It was really fresh and creamy.  Will definitely go back!", "author": "Rama J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-04", "description": "Really do not see a reason to add to the already awesome reviews.. but why not. After walking across the Brooklyn bridge what better way to to relax? The restaurant is quite small and I am sure the wait can get very long but we arrived at 3:00, just 15 minutes prior to midday closing and were able to get seated before they closed! We kept it simple with a margherita pizza and added pepperoni. Definitely delicious. The crust is a perfect thin-ness where you can easily fold it if you are into that pizza eating style. There was the right amount of cheesy gooey-ness to crust ratio. The sauce was perfect, light, savory, and fresh. This place hit the trio of sauce+crust+ topping freshness, textures, and flavors. I can see how you can drop in for a quick bite or have a few beers and stay a while! Will definitely make this a permanent stop when in NYC!", "author": "Sabrina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "This pizza is really good. Is it the greatest pizza in NYC? No but it still deserves a 5 star rating on yelp. The crust is thin and thats how NYC pizza should be served. \n\nWe waited in line for 30 minutes before the restaurant opened for the dinner shift. Turns out we really didn't have to since there were still a lot of tables opened when everyone came in. So if you're thinking about coming, you might not need to wait in line before it opens. \n\nWe had their regular pizzas and didn't try any of their specialty pizza. I'm sure they are amazing but it was close to $30 a pie. \n\nPro Tip: Go to Brooklyn Ice Cream Factory after to cap off a delicious belly full of pizza.", "author": "Alan N."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}