{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Great pizza - real thin - good choice of toppings. Great decor. And surprisingly, really great service. Thanks Wes for being so attentive. Worth the wait!", "author": "Jean-Marc E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "By far the best pizza I've had. Lives up to every positive review. Portions are HUGE so bring an appetite or someone to share it with. Good classic feel with a comfortable vibe and the owner goes around to make sure everything is perfect. Love it!!", "author": "Sean E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "So while on Holiday visiting the Big Apple with my number 2...they time had come to crush some famous NYC pizza. We started in line at the ever touristy Grimaldi's Pizza.\nSome felt generic about the experience so we b-lined next door to Juilana's. Apparently the creator of Grimaldi's created this place after he sold Grimaldi's...it's named after his mom.\n\nWe got a margarita pizza with pepperoni's and man on man it was f'ing delicious. Now I didn't get the opportunity to compare the top 3 rated pizza joints in the city, but one you've tasted perfection, it seems foolish to venture downward. Tastes like heaven...super fresh, coal fired brick oven heaven. Nom nom", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "First time here after seeing the reviews in Yelp. Hand made pizza. It's great. Thanks for the great food", "author": "Robin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "First time trying a NY style pizza being from Chicago and I must say it put Chicago to shame. Amazing pizza. Thin crust. Wow. A must to try", "author": "Liz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "Consistently topping lists for best pizza in Brooklyn, Juliana's is the original Grimaldi's, though the long lines outside the latter show that many still don't know this, and prefer the gruff manner of the staff at the corner joint. The original site is a much classier affair, with cleaner lines, white walls and professional service, as well as a charming manager and regular visits from the proud owner himself. The choice 'No.1' in the pizza specials is a thing of fresh, salty decadence: Mozzarella, Scamorza affumicata, pancetta, scallions and Oregon-grown white truffles in olive oil--no tomato appears on this white pie in any form, and frankly is not missed at all. There are also pastas, salads and desserts, and an extensive choice of wine and beer, so it's easy to get carried away here. The only thing you might find is how noisy the space can get, due to some strange acoustics or lack of soft wall fittings - it's a cacophony at the worst of times. But who really cares in such a rightfully celebrated institution?\n(delusionaryculinary)", "author": "Paras G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Originally I had reservations for a restaurant in Williamsburg, but since we were in Dumbo, my boyfriend and I took to Yelp to find a place closer. We cam across Juliana's, which was apparently founded/owned by the original Grimaldi. It's actually right next to Grimaldi's as well. The line sizes for both places were comparable, but we were eager to try Juliana's. Waited about half an hour, but that was fine, as I was catching Pokemon. Once we were seated, we decided to split a large Margherita with prosciutto and pepperoni. The combination of the meats plus the cheese and the thin crust made the pizza absolutely delicious. I don't remember Grimaldi's, but the pizza at Juliana's was top notch. The large was also a bit much for us, as we had a few slices left over.. which was no problem to eat the next day. If I'm ever in Dumbo again, I would definitely go back.", "author": "Linda L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "So I had sky high hopes from Julianas, all the fame that comes with Mr Grimaldi and all that jazz...so were they fulfilled? \n\nWe ordered the Arugula salad with goat cheese \u0026 walnuts and it was absolutely delightful on a humid summer day. Crispy, light and the goat cheese was divine. \n\nThe star of the meal was the classic Margherita pizza. I mean you really can't go wrong with a Grimaldi Margherita pizza! The pizza was good, very fresh and had all the right flavors, but to be honest, I would have prefered a crispier crust. It was just getting to the right degree of crispness when it was served to us. \n\nOf the two, the salad came out a clear winner. Umm, not such a big deal, but then we were under the legendary roof of pizza connoisseur Mr Grimaldi. \n\nMeanwhile, the service was excellent, there was no line, the restaurant had a nice buzz, and yes Mr Grimaldi was manning the floor himself. \n\nI'm going with 3.5 stars for this outing.", "author": "Arshi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Aside from zagat calling this the best pizza in NYC.. it is. It's amazing, fresh, and I was lucky enough to sit and watch it be made. So yummy! On a beautiful day.. why not order a pie and sit by the river? :)))", "author": "MC V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "I've had a lot of delicious pizza in my 29 years of existence. NYC is filled with fantastic well-known and not-so-well-known pizzerias. But I can honestly say that Juliana's takes the gold medal for the best and most memorable slice I've ever tasted. Specifically, I'm referring to their Pizza Special No. 1--an incredibly nuanced, addictive, and ridiculously tasty combination of mozzarella, scamorza affumicata, pancetta* (italian bacon), scallions and Oregon-grown white truffles in olive oil - no tomato. I often find myself fantasizing about this very slice and reliving that amazing first bite. For this special alone, I'd vote Juliana's over it's next-door neighbor, Grimaldi's (which is also delicious but not as memorable). Best pizza until I find one better!", "author": "Justin V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "4.5 stars!\nThe most authentic pizza that the Mexicans chefs can come up in this side off the Atlantic :D\n\nSimple ingredients, made in front of you. Simply fantastic.\n\nI had an arugula and prosciutto pizza. Was delicious.\nThe tomato and sea salt pizza was great, but as it gold cold got a bir greasy.\n\nOverall I was a fan and I can see myself coming back here", "author": "Adriaan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Worthy of the hype.  Very simple menu but amazingly fresh pizza.  The mozzarella cheese that they use was worth the wait and trip to Brooklyn by itself.", "author": "Dustin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "Old Grimaldi's restaurant location. The pizza was perfect. Service was quick and simple.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "This is really a 10-star review. 5 stars for the delish pizza. The other 5 stars are for the service. \n\nWe went here with my cousin and her family on the rainiest night in NYC. My cousin drove over from Long Island and couldn't find parking after a couple of rounds. So they decided to drop off the wife and baby with us at the restaurant. Patsy, who we had been talking to for a few moments, said to just park the car in front of the restaurant in this little driveway area and that he would watch the car. What?! I'd like to think he did this because we had a little baby in the car, but honestly he was so kind and warm I'm sure he'd give this level of service no matter what. Love him. \n\nPizza. Let's just say this is way better than Grimaldi's which has turned into a total tourist sh*t show. \n\nLOVE YOU PATSY!", "author": "Bhumika K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Why isn't this place 6 stars? One of my favorite pizza places in NY. Definitely worth the walk across Brooklyn Bridge from Manhattan! :)", "author": "Lauren J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Amazing, both the food and the service. Be prepared to wait. We tried the homemade meatballs that were very tasty. The pizza had incredibly fresh and very yummy ingredients. A definite must try if you are anywhere near the area.", "author": "Eva D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "The pizza was delicious. But what made our experience memorable was our server, Paul. He took his time to answer our questions and gave us great recommendations. Our out of town guests made a unusual request and Paul went above and beyond to fulfill their needs. I highly recommend this place, not just for their pizza but also for their outstanding service.", "author": "Mei H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Delicious pizza! The crowd wasn't great because we had a 45 minute wait and a busy server, but the food was very good. The staff was nice, and the menu had many options. It's wood fired, so they only sell pies which can get pricey with toppings but it is worth it. Yum!", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "In the old Grimaldi's location but with the original Patsy Grimaldi. The renovated place looks great. The menu is thankfully expanded. There is a real wine list  And most importantly the pizza is fantastic. We had the classic margarita. We also tried one with bacon and truffle. Both were great. The meatballs were delicious and so was the homemade lentil soup. An authentic vanilla egg cream was a nice way to finish up. \n\nThis is the best pizza around. Period.", "author": "Rich P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Walked in around 12:45 on a Saturday, and got seated immediately. The wait staff was super attentive, polite, and quick. Our order was taken within 5 minutes (a Margherita pizza) and the food was out within 10 minutes of the order being placed.\n\nThe crust is thin and perfectly cooked - not too soft, and not too crunchy. The mozzarella is wonderfully fresh, you can just tell by the way it melts / looks without even tasting it. Every ingredient used to make the pizza was delicious, and I would love it if I could get this pizza every day for lunch.\n\nAll around: great food, great (fast) service, easy location, and a great experience!", "author": "Mike E."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}