{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "Food was great, service was awesome. \nA very friendly pizza restaurant in DUMBO. \nI highly recommend.", "author": "Danny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "My favorite pizza spot. 1st visit since they changed names but same good pizza. Nice renovation too.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-15", "description": "Service was great, pizza was underwhelming. It was not New York pizza, very much a fine dining attempt at pizza. The crust somehow undercooked and burnt at the same time. The sauce while fresh, was not the gravy consistency I was after, more like salsa. \n\nNow it wasn't bad bad, but I would rather have a more traditional pizza.", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Great margarita pizza. We had a super  friendly waiter, nice bottle of wine. And surprisingly there was no wait on a Friday night and we even found parking right across the street. I highly recommend trying this place if you're thinking about it. It's a little pricy but if your on a quest for the best NY pizza it's a must go.", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "Myself and two buddies were on vacation from LA and heard amazing things about this place. The food surpassed every expectation. The service was incredible and the ambiance was charming. Definitely a must have next time I'm in NYC.", "author": "Puneet K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "This place was amazing. Unlike Grimaldi's they take cards. The pizza is fresh and flavorful. Easily some of the best in NYC. The vibe is welcoming, despite the unfortunate war going on between them and Grimaldi's. The theatrics of that situation makes for an interesting story and a fun eating experience. The dough is great, the sauce is great. Fresh mozzarella, flavorful pepperoni. Love this place.", "author": "Stephen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-11", "description": "I have had better.  Pizza was soggy in the center.  \nStaff great.  Decorations are very nice", "author": "Mark D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "Hands down, THE best pizza I have ever had. Some family friends and I were in NY for the first time (from Cali) and we tried several pizza places before stopping by Juliana's a few days before we came home. Was NOT disappointed. We had their Margherita, added pepperoni and roasted peppers. Delicious! Their number 1 and 4 were equally good but their Margherita won me (all of us) over! Sooo good! Drinks are super small. But everything else makes up for it.", "author": "Nubia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "Yummy pizza and a heathy portion on toppings. Some pizza places skimp of toppings, but out pizza was fully covered. \n\nWe got there within a half hour of opening on a weekday and were seated immediately, but everyone who came in after us had to wait.", "author": "S K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Hands down, best pizza I've ever had. We tried grimaldis next door, too. But julianas was better. Crispier crust, fresher sauce, yummier pepperoni. All six of us LOVED it. Great service too.", "author": "Natalie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "All of our friends who have visited this area recommended going to this pizzeria. It is a smaller restaurant so I would say either have reservations or get there at a non busy time. We got there at about 11:45 and got there just in time because after that a line started to form outside the door. We had the large #4 which was mozzarella, tomato, arugula, and prosciutto. It was very delicious and fresh tasting. It is thin crust which I also like. Price wise, it was $30 for a large. Would definitely stop by here if you are in the area.", "author": "Dani W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Awesome pizza!  Absolutely love this place.  Great atmosphere and service.  Ordered two small pizzas which was plenty for a family of four.  The Margherita pizza was excellent.", "author": "Lewis F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-15", "description": "pretty good... didn't standout from Grimaldi's and definitely does not compare to the new \"craft\" options in BK - Emily, Paulie Gee's \u0026 Roberta's. also, very expensive. a half sausage onion and half prosciutto pie was $36!!!!!", "author": "Sasha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "One of the best in NYC. Grimaldis up the block simply does not compare despite having the rights to the namesake. I even noticed they resorted to the lame tactic of putting a sign in front of Juliana's saying \"The 'REAL' Grimaldis up the block.\n\nAs for the pizza, no matter what you order you can expect it to be perfectly crisp with a delicious slightly sweet sauce. I wouldn't mind drinking a tub of the sauce alone. Then choose whatever toppings you're in the mood for and you're good. \n\nThe waitress when I was there last time was really hyper which was slightly off putting but it didn't detract from the overall experience. Grimaldi himself also came around and was a extremely friendly and it was great meeting him. \n\nLong live Juliana's!", "author": "Rich G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-22", "description": "Debated on going here or Grimaldi's next door, ended up eating here instead.\n\nYums, the pizza was thin but it didn't fall apart like you would expect from all the sauce and cheese and toppings.", "author": "Donna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "This is excellent pizza.   Very tasty.  \n\nThere is obviously no parking, but it's Brooklyn, so everyone should know that beforehand.  There was a line (about 10-14 deep) outside when we showed up, but it moved along at a decent pace.  We also went there on a holiday weekend, so I believe there was extra traffic there that day.  \n\nWe sat at the counters (it was busy, we were hungry thus we figured that was better than waiting another 10 minutes hoping people would finish up and clear the table) so the pizza was made in front of us.  The staff was very friendly, and our waiter was engaging as well.  The pizza actually arrived pretty quickly.  \n\nMe and my gf both got pizzas.  Not because we couldn't share one, but because I'm greedy about few things in life, but pizza is on the list!  I believe I got the special No. 2, and she got the margarita pizza.  Both tasted amazing, albeit, I did think the margarita one tasted better and she agreed (and yes, I stole a couple of slices from her, :D).  The special no. 2 pizza was great too as well.   And it's pretty filling to say the least.  \n\nIt's pretty hard to go wrong with Pizza (unless it's in Nashville, then it's a landmine) but this is definitely in the upper echelon of pizza places in NY.  Anyone who even remotely likes pizza will love this place.   And they have takeout, so you can order out, and eat in the car, if the line is too long I guess.", "author": "Alvin P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-16", "description": "The dough/crust was slightly better than Grimaldi's but still not great. The new aesthetic is tacky and the pizza is commercial. \n\nI also think they have a major PROSCIUTTO CRISIS (read below).\n\nI asked our waiter, \"What type of prosciutto is on the pizza?\"\n\nWaiter said, \"Regular prosciutto.\"\n\nI said, \"Yes, but what type, there are different types.\"\n\nHe said, \"Italian prosciutto.\"\n\nAfter that, I just said, \"okay,\" and let him go fetch our prosciutto pizza with slices of prosciutto thicker than the wood table. \"Che sciffo,\" I said, which means, \"how gross,\" in English.\n\n1 pizza and 3 beers with tip totaled $60.00. Major rip off for this sad excuse for pizza.", "author": "Roberto C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "Very good pizza (the melted mozzarella is to die for), close second to the pizza I had in Italy.  The goat cheese walnut arugula salad was fresh and delicious.  The lentil soup is filling and good.  I will definitely come back.", "author": "Y O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Worth the wait on a Sunday afternoon. Fresh, hot,  crispy, tasty. Everything you want in a pizza.", "author": "Steven W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "We ordered the No. 4 special (tomato, mozzarella, arugula, and prosciutto). Light but filling! The small was more than enough for two people. I'm glad we chose Juliana's as our Brooklyn pizza spot on our visit to NY.", "author": "Theresa N."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}