{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-21", "description": "My wife and I have lived in DUMBO for the past 4 years. We used to order take out from Grimaldis every few weeks. But over time it became clear: the fabled pizzeria started devouring its own hype. From there, the standards started slipping. The last few times we went (this past summer) the pizza was always under cooked or unevenly cooked. \n\nEnter Juliana's. After months of anticipation owning to a long construction schedule and court battles with Grimaldis owner Ralph Ciollo, the place finally opened. My wife and I have eaten there twice in the past few weeks. \n\nHere's where they're better than Grimaldis:\nService - people are very friendly and approachable as opposed to Grimaldis who runs the place like a sweatshop and appears to have members of the Russian mob involved.\nAtmosphere - the place has been fully renovated to a tasteful (read: not kitschy), well lit restaurant as opposed to Grimaldis whose new digs at 1 Fulton can't overcome a  kitschy, shite experience.\nMozzarella - Juliana's has a more flavorful mozz on their pies. It's instantly noticeable.\nCrust - The crust is perfect. Slightly thicker than Grimaldis and more importantly it's cooked properly, slightly charred on the outside consistently, all around the edges and hot and moist on the inside. \n\nHere's where they're different than Grimaldis:\nSauce - they both use high quality San Marzano tomatoes to make their pizza sauce, but where Grimaldis is tangier and brighter, Juliana's is more seasoned, particularly with Oregano.\nToppings - from what I've seen so far, Juliana's has more topping choices than Grimaldis (meatball anyone?) but both places have equal, good quality toppings.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "Took my parents here for pizza when they were in town for a long weekend.  They loved it, as did I.  Patsy Grimaldi was there to greet us when we walked in and came over to chat as we were finishing up our meal.  Really made my folks feel at home and welcome, which is certainly not a given in NYC.\n\nThe pizza itself is excellent.  Definitely on par with Lucali's, Lombardi's and other places around town.  Simple and tasty.  I'm a big fan and will definitely be coming back.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-15", "description": "DON'T BELIEVE THE HYPE. OBNOXIOUS OWNER AND REALLY RUDE SERVICE!!!\n\nI was excited to check out this place, knowing the drama and saga behind Grimaldi's, etc.  \nNative New Yorker here, so I'm not bothered by brusque service and understand when its busy you can't stay in a place forever but this was way beyond anything I've experienced.  While in line for the bathroom the owner sought me to ask me to pay my check because they needed the table.  Never mind that other table were there much longer.  To sped up my checkout he banged - and I mean BANGED - on the unisex bathroom door to get the person to come out.  When I got out of the bathroom the had already taken my chair for another table.  Had not even paid the check yet!  He was more than happy to usher us in when it was empty.  \n\nAs for the pizza, it looked nothing like the pictures.  $19 bucks a pie.  $38 wasted.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-13", "description": "i really liked that there was no wait for a party of 8. i wasn't crazy about the pizza. they weren't bad, just slightly bland except for the sausage pizza. and, very neat. none of that drippy cheese, oil extravaganza. \n\nside note, do not ask for any oregano etc. grimaldi doesn't like recipe tampering.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "A little slice of heaven! Amazing amazing AMAZING! Great tasting pizza for sure. If you're stuck between this place and Grimaldis, definitely pick this one. Less of a wait for the same great (if not better) tasting pizza. Be prepared to stuff yourself. Can't wait to come back to Brooklyn and visit here again!", "author": "Morgan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "What else is there to say. The true Brooklyn pizza institution.", "author": "Jesus R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "I was very happy with the service, Pizza was good too, but not the most incredible thing I've ever had. Everyone in my party liked it though, so it's safe to go here. Great sauce, not too much cheese on the margarita, could have used more.", "author": "Pavel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Leave the tourists alone hanging out at grimaldi's and go treat yourself with this hand crafted pizza from the people who made grimaldi popular. Place gets crowded, but lunch time is not so bad during off holiday season.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Special #1. For two we waited 2 minutes on a Saturday night. The cheese, the bacon; just go and eat it. IT was pretty spectacular--the story behind the store, quality of the ingredients, the fact that there's no tomato sauce and yet it still tastes spectacular. This was great.", "author": "Vincent Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "This place is THE place to go for pizza in this 'hood, run by the original creators of Grimaldis. A longish line, as one would expect, but kind, friendly, quick service when you're in, and yummy pizza. Thinner crusts, real toppings, beer and wine. Nothing fancy but simple, delicious and exactly what I need to fill a pizza craving. Not super cheap either, but when you taste you'll know why.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Best pizza in NY. I used to be a loyal fan of Grimaldi's (having gone many times over the years with my parents who still live in Brooklyn), but we tried Juliana's once when it first opened and have been going there (and bringing family and friends who visit NY there) ever since. Everything tastes amazing -- the sauces are flavorful, the toppings are fresh, the crust is perfectly cooked, and the white pizza is the best I have ever had. Seeing Patsy Grimaldi himself is just the icing on the cake. Take it from a lifelong New Yorker -- fuggeddabout the line at Grimaldi's and pop on over to Juliana's!", "author": "amie b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-20", "description": "So I have always heard how great Grimaldi's was..never went because of the line.  Heard a little of the \"pizza wars\"..but nefer really paid attention. That being said I had no preconceived ideas. What I wanted was a beer and good pizza according to my own tastes.  I can say as for my pizza palate I loved Juliana's! Had the Mozzarella, broccali rabe and sausage pizza.  Crust thin and good just right. Sauce tasty. Also had the calamari before and that was delicious too.  Am I am pizza expert...no...food critic....I wish! All I know is that I will definitely be back! \n\n Patsy and his wife came by our table to see how we were doing.  Very nice people and never once said a mean thing about Grimaldi's or the controversy although I did bring it up because I had no idea what it was about.   They are one classy act!\n\nDon't just take from me! Just go and try it....you just might like it!!!\n\nHave to add the decor is comfy and inviting..very clean looking.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "Love this place, love the pizza :') There is a server named David, he is excellent, always has a story to tell. I haven't really tried out any super fancy toppings, I just add extra cheese to my Margherita Pizza. For drinks I have two cups of water, cappuccino, and end it with the delicious cheese cake :) My pizza was super soggy once, but I still devoured it. Oh well, twas good. ( I see they have a chalk board with the name of the person making the pizza, I might be wrong, it might be for something else)", "author": "Jocelyn Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "We're from San Diego and while visiting NYC at the end of April, had lunch at Juliana's as the result of a recommendation from my wife's colleague.  It turned out to be a great recommendation.  We had 2 large pizza's (#4 and a made to order as my friends wife wanted to try the Bufala mozzarella).  These thin crust wood fired pizza's were extremely good, as in amongst the best (tastiest) pizza's we've ever eaten.  In addition, the server, Trimell, was very knowledgeable on all items on the menu and provided top notch service during the entire lunch.  We also were very impressed by Jouan, the manager who came by our table and gave us a brief history of the restaurant.\n\nThe great pizza (really great pizza!!) coupled with the tremendous services by two professionals who really enjoy their work, make this a restaurant worth visiting.  We recommend you do what we did and visit for lunch and then walk back across  the Brooklyn Bridge for a very memorable day.\n\nDave W.", "author": "Dave W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "Hard to beat the charm and taste of the real Grimaldi. This isn't the NYC pizza with that weird orange colored cheese dripping with oil down your leg. It's lighter fresher and easy to down a whole pie. Service is friendly, you might even get a few espressos from Pasty himself.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "As others have already stated, the pizza is great since Mr. Grimaldi is manning the kitchen.  The restaurant also excels at great customer service, comfortable seating and best of all no ridiculous line.  Only a fool would go next door to that other place and I pity fools.", "author": "RJ S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Had a chance to see the Brooklyn Bridge on my last visit home and stopped at Juliana's for some pizza.  Don't let the line out the door deter you.  The wait is well worth it.  Had the Margarita with pep and olives.  A little different but quite delecious.  They will put together just about any request.  So everyone is bound to enjoy their visit to Juliana's.", "author": "Antonio V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "I want to be buried here. Or at the very least I'd like to die eating this pizza. We didn't get one of their recommended options, but instead ordered garlic and pepperoni on a cheese pizza. So good. \n\nThe wait for two wasn't that long (certainly shorter than the wait for Grimaldi's next door, which is what I imagine purgatory to be like).  The restaurant's a little noisy/packed, but that's just a testament to how great it is.", "author": "Art H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "After eating at grimaldis over the years, I've grown weary of the brand. When they first sold the pizzeria in the late 90s, no one really knew. The quality was impeccable and it was the best pie around; bar none. Slowly over time that changed. It was still a great pie, but it lost is holy isht factor. \n\nThe Grimaldi name began sprouting up all over, delivering mediocre results. Scottsdale AZ, Sugar Land TX, Highlands NJ, etc... Each one being a more commercialized mediocre version of the original. \n\nWhen Grimaldis got booted out of their initial location under the bridge, I was initially saddened to hear the news. It was the end of a good run I thought.... But after a trip to try the new grimaldis, I was elated to see the sign letting the world know that Patsy is back at a new restaurant called Juliana's. \n\nI had a chance to try the pizza at Juliana's this week and it was excellent. The ingredients were fresh, the crust nice and charred, etc. it hit the spot. The crust is a little thicker, but I was told that Patsy is still tinkering. \n\nThe restaurant looks like Gordon Ramsey came in and redid the dining area. Nice white walls, new tables, gone is that kitschy feel of the old place. There's even a nice countertop to sit at right in front of the pizza maker so you can get a birds eye view of how the pies are made. \n\nIt's not all sunshine and kittens though. There were a lot of hiccups throughout the night, and honestly I didn't care. The night I was there, the restaurant was in its 5th night of being open, so I was expecting bumps along the way. There were a lot of issues trying to figure out the POS system in regards to entering orders and swiping credit cards (Yes, they finally take credit cards... No more cash only!) The servers were confused about what they were out of, and there was a lot of confusion about what time they were closing. People were told on the phone they were open and when they came in they were informed they were closed. They were able to order and eat. There was confusion as to whether my pie was to stay or to go... Etc. \n\nAll of these are hiccups that will correct themselves with time. \n\nWhen yo go, enjoy the pizza, and know that a pizza icon is back doing what we he does best! Just be patient with everything else!", "author": "Scott O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-30", "description": "Best pizza I've ever had.\n\nMy daughter and I were visiting New York and tried this place on recommendations from locals.  We had the margherita pizza and it was spectacular and it was served to us by the owner. We have never tried Grimaldi's, so we can't compare (and we aren't too familiar with the pizza wars and lawsuits), but I can highly recommend Juliana's.", "author": "Dave P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}