{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-27", "description": "We arrived on a Saturday around 1pm. Anywhere around that time frame- be ready to wait. The line was long, and jammed up against the line for the neighboring Grimaldi's pizza joint. We left, and came back closer to 2:30pm, and the line was just as long, if not longer. We made the cut, but others who arrived later were told that the place closes at 3:15-4 to stoke the coals. We would have been quite disappointed if our whole even plan was thrown off if we weren't able to make it in. Regardless, once we were seated, service is only so-so, although one doesn't come here for the service, it's for the food. Pizza is very good! Not sure I would say it is worth the wait.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Probably the best spaghetti with meatballs I've ever had. Their pizza is also very good, it's not the best I've ever had but it's up there. I like that they serve Mexican coke in a glass since it makes everything taste better. This is my second time coming here and it both times it was great.", "author": "Enrique V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "I visited NY and decided to head out to Brooklyn to try the world famous Grimaldi's. Unfortunately it was closed for \"renovation.\" But lucky for us Juliana's was next door and we decided to try it out after i read about their history. Apparently its a relative of the owner of Grimaldi that supposedly created Grimaldi's recipe. Not sure if thats true or not but i will say that Juliana's has been the best pizza I have ever eaten. My wife and I were quickly seated and greeted by our server. We ordered their meatballs which i assume are not made to order because this place was packed and they came out in 3 minutes. Regardless they were delicious. We ordered pizza No. 1 which had, mozzarella, smoked cheese, Pancetta, white truffle, and scallions. I am glad Grimaldi's was closed because like i mentioned earlier, this was the best pizza I have ever eaten.", "author": "Damian R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "The margarita and white pies are delicious! Usually white pies come with ricotta, but it was an extra charge here. I don't think Juliana's is worth the wait or the price, though. I've had better pizza.", "author": "Fallon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Founded by the original owners of Grimaldi's, this is some of the freshest and best pizza in New York. Worth the wait, homey ambiance, fingerlickin' good. You must get the Margherita pizza. \n\n5 stars!!!!!!", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-02", "description": "Its pizza time. So, myself and a fellow yelper decided to grab a bite, and pizza popped up on the list. I had this place bookmarked and it had a ton of great reviews. We decided to mosey on over and grab a bite since everyone raves about their pizza. We lucked out because there was no line. I'm assuming it's because it was late at night and most people had work in the morning. When we walked in, there were about 5 tables occupied with patrons. We ordered a glass of pinot grigiot. It was nice, very subtle. We also ordered the large pie. We went back and forth trying to decide if we should get a small or large since it was a late night. Our deciding factor was that there was only a $3 difference. So it made sense to order the large. Our pie came out in record time. We literally placed the order, I went to wash my hands in the bathroom and when I returned, tada the pizza was sitting on our table. Our server served us each a slice. I took my 1st bite and I waited for my 2nd bite to realize this pizza was meh. I'm not a salt eater and I felt that this pie was underseasoned and unsalted. The dough was quite chewy, there was no crunch in the crust. The cheese was lackluster and there was no flavor from the basil. I don't know if my expectation was too high because of all the great reviews, but I was extremely disappointed. Service was great.I don't know if it was an off night but it wasnt the greatest pizza in NY. I guess I'll come back some other time to give it a second chance.", "author": "Nadia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-30", "description": "I'm not too sure if it was the hour plus wait that we did on Saturday to get in with my party of six late afternoon that made me just \"meh\" about Juliana's Pizza.  I kept asking myself, why is the line for Grimaldi's shorter than here?!  This is supposed to be better!  As hunger, heat stroke, and delirium set in, we were finally granted a table, right under the AC vent I might add.\n\nWe were quick to order their marinara pizza with their homemade meatballs and then the classic margherita pizza.  Our friends questioned why I was pushing for the margherita, and I later learned the hard way that the meatball pizza was not only a totally different sauce, but way taster.  Their dough is pretty tasty with that charred taste from their brick ovens, but I can't imagine waiting outside for this pizza like this again.\n\nAny place that offers a T-shirt for sale is too tourist-y for me; I would only ever try this again if we could get take out.", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "The best pizza ever period. Worth the wait in line. Had the margarita and pepperoni and it was so good.", "author": "Jill Lee Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Not much to add that hasn't been said.\n\nGet here early. We got in line 20 mins before opening and we're 4th. Especially if you want to snag an air conditioned/heated indoor seat.\n\nOrder a lot. Because of the thin crust it's not unheard to be 1 large pizza per 2 people. 1 per person if you're hungry. Custom pizzas galore but we loved the #1 (white pizza, prosciutto). The pizza here is a Smokey (I'm sure due to the charcoal), crunchy crust but thin pizza that isn't soaking in water like some places. Great sodas too (get the cherry cola).\n\nExcellent place...lives up to the hype. \n\nAlso if you get turned off by the lines Starbucks and shake shack are next door.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "I do not take pride in writing this review, due to the excellent reviews that we we excited to experience, but here goes.\n\nGreat first impression, a gentleman greeted us and let us know a 2 top would be open in a few minutes. He pointed to the pizza bar right in the middle end of the restaurant where two spinners were open. Upon sitting down the lady to my left said her son was sitting there. Bummer. The host let us know it should only be a few more minutes for a solo table off to the right. 15 minutes later we were sat on the left hand side, they separated a four top by 6 inches and sat against the wall. Intimacy does not come to mind.\n\nWe order right away: Lg margarita half pepperoni and water with lemon. Shortly after a lady brings out a steaming hot pizza, full pepperoni. We advise them of the error and our server comes back, asks if it was half pep then gives me a look and walks away. Rude and inappropriate, especially without and apology. \n\nWe go out for an experience and this was one of the worst we've had in NY. $26 for a pizza and we got treated like they didn't want us there. \n\n\nHonestly, I have had better $1 slices in Manhattan.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Located just under the Brooklyn Bridge on Fulton St., this restaurant has the best pizza in New York! Don't let the outside line discourage you. It's well worth the wait.\nOur favorite is the Margarita Pizza. The arugula salad with goat cheese and pecans was great with the pizza! \nDo you know it only takes 4 minutes to bake in the brick oven?\nThe lemonade was the best I have ever had. I am addicted to lemonade! I have tried many, lol.\nThere is a parking garage just around the corner if you have trouble finding parking. It's less than a block away.\nLots of yummy dessert options are also available. The Brookie is our favorite! The Brookie is essentially a big ice cream sandwich. We even ordered some cannolis to go.\nThe meatballs are so good too. They are huge and one of Patsy's Specialties.\nMy husband had an Egg Cream. He said it was the best he ever had and has been making them for over 60 years.\nTry Juliana's, you won't be disappointed.", "author": "Robin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Wow, what a crazy, long wait for some famous pizza. I came here on a blisteringly cold, snowy day with my brother and I could feel my heart sinking as I walked past the line. They did have a vestibule set up that can fit a couple people right outside of the door, but even getting to that point took forever.\n\nOnce you get inside, though, you can see the serving staff working extremely efficiently to get you settled and ready for food. Our waiter was so sweet and had our orders in just moments after we sat down. For two, we got a large Margherita ($22) with half pepperoni and half cremini mushroom ($3+2?). We also ordered two hot chocolates ($3.50), but quite honestly, I'd pass on these next time.\n\nThe pizza was out and ready for us within minutes. Piping hot and with a delicious crust that melds crunchy and chewy, that pizza disappeared quicker than it had arrived. Sauce to cheese ratio is well-balanced, although I do wish they had sprinkled more toppings on. We did have some difficulty flagging someone down to get crushed red pepper, and eventually my brother gave up and just got some from a side table.\n\nTo end our meal, we shared a cannoli ($7) which was pretty standard, as far as cannolis go.\n\nFor a meal that came out to around $50 for two people, it was definitely filling and satisfying. Would I come again? Maybe when there's a smaller line or better weather, but I have other favorite spots that I could get into with less hassle.", "author": "Pearl K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Best pizza I've had since my last trip to Italy.\n\nIf you want pizzas that come close to those served in Italy, this is the place. Except that you need to pay the price of not flying in and out of the country. $30 for a small pie (#1)...! which I probably would pay €6 in Europe for the same freshness and taste. \n\nHowever, I would come back if I'm around the area.", "author": "Rachel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Best pizza in the city. I have no words but Yelp is making me type more. Perfect soft crust. Perfect cheese to sauce ratio. Comes out hot. Love the freshness of ingredients. If you're contemplating waiting an hour it is WORTH it.", "author": "Kayla B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-17", "description": "Being in NY, my cousin \u0026 I knew we had to find an amazing NY style pizza place or else we wouldn't be doing our trip right. After spending some time in Brooklyn, we walked over here a few minutes after they reopened in the afternoon (4pm) and there was already a line waiting outside in freezing temps. There were about 7 or 8 parties ahead of us, so we figured we'd wait hoping it would die down quickly. Someone who got in line behind us actually went inside and asked how long the wait would be. They told him 20-30 minutes. Definitely wasn't even close. For us, it ended up being about an hour and we were wondering how much longer it would be for the people behind us because the line got much longer. \n\nOnce we FINALLY got inside, we were seated in a two-top table by the wall next to a wall light which was nice and cozy. Our server, who wasn't very energetic nor outgoing, took care of us and made sure we had everything we needed during our dining experience. Pizza prices here are expensive, but no doubt we knew being in New York and this place being ranked high for pizza in the city, that we'd be paying for it. We ordered an arugula, Italian ham pizza (they were able to actually split the pizza in half for us since my cousin is vegetarian which was nice of the chef). Pizza was very good, but nothing to really rave about. Maybe we didn't get the best pizza there? Hmmm, the sauce and cheese tasted of very good quality, and the pizza crust was on point. Maybe we just needed more toppings? \n\nI don't think the pizza justified an hour wait though. If we had waited the 20-30 minutes as suggested by the staff, I think we would have been a little bit more receptive of the pizza. I do feel that I would come back and try this place again, but for a different pizza choice. We'd also hope to get a different server since the other servers in the room just seemed happier and more outgoing. Those types of changes make a huge difference in the perception of the customer as far as dining experience. \n\nPlenty of options for pizza in NYC.... need to try other ones!", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "So yummy - worth the wait!!! Really enjoyed the pizza and spaghetti \u0026 meatballs. The atmosphere is great as well! Would love to return every weekend. Loved how they served their coke products in the old fashioned bottles - so cute :)", "author": "Jenna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "Honestly the best pizza in NYC. Went on a Saturday afternoon. The line outside moved quickly. We ordered the meatball pizza , pepperoni and black olive pizza, arugula salad with goat cheese and a Egg cream. Kids LOVED the egg cream, husband and I preferred the meatball pizza. Everything about this place made the wait completely worth it.", "author": "Renae S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "The hype is real. The line gets so long for Juliana's! But luckily, we were able to go inside an order a pizza to go (took about 20 min). There are also lots of abstract benches/tables in the area so you can just grab your pizza to go and chow down, while the people waiting in line just watch you haha\n\nWe order a small half white and half margarita pizza. The white pizza was very flavorful and garlic-y. The margarita was very fresh tasting, loved the sauce. The overall pizza was really good (crust and all). \n\nWould definitely visit again if I was in the area in Brooklyn, but I don't think I'd go out of my way to get some if I was just hanging out in Manhattan area.", "author": "Kathy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "One word to describe my experience: Amazing! The pizza completely met my expectations, especially since I lived in Rome for 8 years. Finding the perfect thin Italian pizza is challenging to find, however this place remedies that. I loved the flavor (thanks to the beautiful brick pizza oven, fresh ingredients, and smooth olive oil), and portion size is also really good. Watch out for the long lines, but it's definitely worth the wait!", "author": "Feiras R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Line out the door for this amazing pizza and it was totally worth it (and line actually moved quickly FYI). \nThe staff is great, very friendly and welcoming. So I only give 4 instead of 5 stars because they did mess up our pizza order and brought our stuff out twice to table next to us. So couldn't give 5.\nBut pizza is fantastic! The crust is thin and soft, sauce is awesome and cheese/toppings great. Worth the wait!", "author": "Lisa A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}