{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Juliana's probably doesn't need another review worshipping its famous pizza pies oven-baked to perfection but i'm just going to say this: If you haven't been to juliana's, you MUST GO! If you think a dish as simple as pizza can't get better, think again.\n\nSomewhere in cyberspace, there exists a list of 50 movies that you must watch before you die. Well, I want to say that i believe juliana's makes the list: \"50 restaurants you must go before you die\"\n\nPlease do yourselves a favor and go to brooklyn and stop by juliana's - it is so worth the wait (i waited close to an hour and i have no regrets)! For nyc tourists, it'll be a once-in-a-lifetime experience, and for those who live in/around the area, you really have no excuse.", "author": "Janet P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Went there at 1:30 pm\nWaited in line for about 20 mins to get a table\nGot food quite fast after we ordered\n\nWe ordered the classic one and enjoyed it a lot!\nSince the pizza was very thin, though large, i felt 2.5 slices would be good for me.\n\nDefinitely recommend it.", "author": "Rachel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "This place is awesome, one of the best pies I ever had. Friendly crew.\nRecommend to get there early, gets crowded .", "author": "Dew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "We waited in line for maybe almost an hour. The other people in line said this place was worth the wait. It wasn't easy to find parking, same story anywhere in NY. \n\nThe pizza was fairly expensive, but not very tasty. I don't think it was worth the wait or the price. \n\nThe place was crowded though. The staff was friendly.", "author": "Annzie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "Quaint little spot near Brooklyn Bridge. The pizza is amazing, and our waiter was wonderful. Get there when it opens if you can, it filled up quickly but service was prompt. Really enjoyed this place.", "author": "Teresa Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Wow, best pizza in NY! Light, airy, and perfect crust. We had a bowl of spaghetti and meatballs and the large #4, followed by cheesecake and a cannoli. Staff is super friendly and accommodating. We also met Mr. Grimaldi and he was so friendly and kind.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "I'm a pizza crazy. As part of our honeymoon, we detoured to Naples solely to eat pizza. I've been to most of the classic NYC pizza shops, pizza toured through Chicago, and eaten at Michelin star pizza places like Da Michele's in Naples; Juliana's is right up there with the best pizzas I've ever had.\n\nWe went to Juliana's a little bit before it opened on a Sunday, and we got in with the first rush of people. As a result, very little wait for us! If you're going to come early, come early. If you're not in that first rush of people that fills the entire restaurant, you're going to be standing outside while literally every single table in the restaurant orders, gets their food, and takes their time to pay. \n\nWe got a half margarita, half white pizza. They were both incredible. The crust has just the right amount of flavor and saltiness, and the consistency is perfect for a New York thin crust. I've been to a lot of overhyped pizza places, but Juliana's makes a pizza that makes you smile the second that you bite into it, much like Grimaldi's, but somehow just a little bit better.\n\nSide note: The salads are pretty good here too. No one comes here for salad, but get it with your pizza. You'll be pleasantly surprised!\n\nIf you get a drink, a salad, a pie, and a couple drinks, it'll run you a little more than $20/person, closer to $25 with tip. Juliana's makes spectacular pizza, and I'll make a point to come here every time I'm in NYC.", "author": "Dave C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Best Place for pizza! I would rather\ncome here than go to its next door neighbor \"Grimaldi's\" since its neighbor's pizza quality has declined and does not accept card. \n\nJuliana's pizza has a very cozy atmosphere. My family and I arrived around 1:50pm and didnt have to wait for a table. the servers were very nicely dressed and very professional and pleasant people. the server we had was very knowledgeable as to what pizza to recommend especially we had 2 picky eaters in our table. We ended up ordering 2 large margherita pizzas and added toppings to it. we also had 2 arnold palmers and 1 coca cola order. the drink size was very tiny,even the arnold palmer was the same kid size glass as the diners would serve them. \n\nThe pizzas arrived quickly. the crust was not burned and one can appreciate fresh ingredients would not miss the ingredients used on the pizzas were not from a can. the basil smelled so nice you know that it's not from a bag. toppings were generously spreadout evenly in the pie (they didnt put shitake mushrooms though) the prosciutto was also good and evenly sliced. \n\nThere is street parking and also a valet parking less than a mile away that costs $25 for 3 hours.", "author": "C L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "I have bever been a fan of scallions but this fresh and green stuff went so so soooo well with the svoary pancetta on this pizza, it's number 1 on the menu by the way.\n\nSo Juliana's Pizza is an unpretentious local pizzaria under the East side of Brookyln Bridge, a small and cozy place with a brick oven in the back of the restaurant. Price was resonable, $28 plus tax and tips/ We were debating between Juliana's and the neighboring Grimaldi's, glad we made this choice!", "author": "Teresa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-13", "description": "I loved loved looooved the pizza here. We were lucky since we didn't need to wait too long to get seated here. I would suggested coming earlier since a line up can form pretty quickly. The ingredients were extremely fresh and we didn't feel weighed down after eating the pizza here. I still dream about this pizza!", "author": "Hana I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "I am Italian and I mean I'm actually from there, born and raised in the north west side of it.\nLiving the States since 07.\nLet me tell you.....This PIZZA is as close as it gets to the Italian one.\nHIGHLY RECOMMENDED!!!!", "author": "Rob L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Worth the water taxi from Manhattan for this mouthwatering delicious pizza. \nI ate the whole pie (ok my sister helped) but it was too good to box up. Perfect blended sauce and fresh cheese, good beer and wine selection. Fantastic service! As we left the manager ran after us to give us a hat that we left behind. Stop by this cute pizza cafe if you are in Brooklyn/Dumbo.", "author": "Reece C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "Good pizza but it's honestly not really worth the wait/price. I think these other reviews I read had raised my expectations for it but I've been to local hole in wall brick oven pizzerias that can match or do better. \n\nI went on Saturday at lunch time and waited in line for about 25mins to get in. (The line moves surprisingly fast) The seats are very crowded inside unless you have a party of four or more and get seated at a separate table area. \n\nI ordered a Large Half Margherita and Half White Pizza between me and my wife. It's a 3$ difference between the small and large so just get the large. The large is big enough to get 2 people pretty full or 3 people about satisfied. The Margherita wasn't too special but the White Pizza was spectacular! It tastes like garlic bread pizza. \n\nI overall recommend the Large Half White/Half Marg. Enjoy!", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "Quite possibly the best pizza my family and I've ever eaten. Stuck with the basics and SO glad we did!! Highly recommend!", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "The line wasnt bad even though we got there around 630 or so.  After we ordered it took only about 15 minutes or so to get a margarita pizza so very fast service. The price was very reasonable given the pizza. I really like the pizza I still prefer Grimaldi's and Patsy's. The sauce is kind of watery.", "author": "Aditya R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-17", "description": "This is probably the biggest disappointment of out NY trip. We took over an hour to get here via subway, then stood in line for 50 minutes. Once sat, the waitress took 10 min to come take our drink order. We were excited to try the buffalo mozzarella to find out it only comes on one pizza the number 2. If you like plain pizza with no sauce then great. If you would like a nice pizza with buffalo mozzarella not going to happen. We offered to pay more but no avail. To thier benefit there is a list of rules on how to order the pizza. But literally no exceptions. We ordered the margarita pizza with pepperoni. Not great by any means. Huge disappointment for a 3 hour ordeal. Please avoid this place as it is just a tourist trap. They only care about cranking quantity out, not the quality of the food and customers orders. Beer was also warm.", "author": "Jake N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "To my friends recommendation, I wholeheartedly agree with his assessment that Juliana's is one of the prime , top-notch pizza establishments on the east coast. It might be super expensive (omg $30.00 for a small), but it was so completely worth it and a must for out of townees to get that New York pizza experience. Definitely puts Pizzeria Mozza to shame on the west coast. \n\nI ordered their No. 1. :\n\nmozzarella, scamorza affumicata, pancetta (italian bacon), scallions and oregon-grown white truffles in olive oil .\n\nThere are no tomatoes on the pizza. The white truffles and olive oil gives a smooth buttery aftertaste that makes it so much more savory. The crust is too not thin or thick but just right. One of the best slices I've had. Even though it's 28 dollars for a small, it is as big as a medium or smaller large. Definitely can feed two people.\n\nI also love how they wrap the leftover pizza slices. Each two slices get their own tinfoil wrap. Also you can carry it in a small doggy bag with the Juliana logo on it!\n\n5/5", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-06", "description": "With all the great reviews, I had huge hopes. Ordered the margarita pizza with Pepperoni. So little pepperoni. Three pieces per slice. Nice char on the crust is the only positive. Tomato sauce was bland. Mozzarella cheese was dry and no flavor. I thought we would have an Italy great pizza. Not. Don't waste your time waiting.", "author": "Brian Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-23", "description": "I had to wait for 40 mins which was not a problem since I was going to eat the best pizza in the country. I ordered the margherita pizza with mushroom and sausage. It was very disappointing. My sister and I both did not like it. We both thought it was very hyped up and we definitely ate better pizza before. That's being said I will not be returning.", "author": "Jean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "Just look at the picture. Amazing. The sauce is soooo good. We went on a Sunday night, no line. Any other day, expect a two hour wait. Well worth it.", "author": "Carlos O."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}