{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "This is the absolute best pizza I have had in this city. Their dough is so incredibly perfect and thin. If it's your first time here or you're new to the Brooklyn pizza scene, I would recommend their plain margherita pie because sometimes you just have to enjoy the simple things.  For the more adventurous, their specialty pies are amazing as well. Prosciutto and arugula? Yes, please. Did you say broccoli rabe with garlic? Yumm! Also, it's great that they take credit cards unlike their neighbors next door. It's a good idea to come a bit earlier because there can be some crazy lines, but if the weather's nice, grab it to go and enjoy your pie in the beautiful Brooklyn Bridge Park nearby.", "author": "Donna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "It was really good. We had the #4 u believe with the arugula and prosciutto. Being from Chicago, I'm a little biased but this oizza was worth the 45 min wait. I'm not sure if that's a regular thing but it's July 4th weekend so that could be part of the issue. It was in a great location. My family had the cheesecake which was really delicious too!  I took a star away because the service is not great. Maybe it's a NY thing but the rest of the U.S. appreciates good customer service.", "author": "Rachel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Very good New York pizza! Went early so there was no line but when we left the restaurant, the line was very long. So be there early! Service is very good and pizza tastes awesome! Highly recommended!", "author": "Angeline U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Came here with some of my family after a scenic walk over the Brooklyn Bridge. If you aren't familiar with the story of Patsy Gramaldi, I suggest you pick up that rock you've been living under, buy stock in 3d printing companies, then stay underground for the next twenty years. No one has missed you up to this point, and when your emerge for your annual bi-decade air filter change, you'll be friendless, but rich. \n\nI was lucky enough to come on a night without a wait, Patsy himself the Don of the Pizza Pie sat us down. Tended to our table to tell a few jokes and after the entire meal let us take pictures with him and the family. That's service from the old country. That's some Olive Garden slogan hospitality but he puts his word where his mouth is. \n\nWhat kind of a boss opens up a place next door to his old success, the day his non compete clause ends, fucking Patsy does. \n\nThe service was exceptional, the staff was attentive and militant, this was some old school no bullshit training. These people were just happy to be under the same roof as the man, and they know if they didn't perform...well let's not even go there. \n\nThe pizza was phenomenal, that dough, doe. Crispy on bottom, voluptuous and bubbly on top. Crust lookin like JLO and tasting like Beyoncé. Chea. \n\nOh and just because you have to compare, this pizza decimates Grimaldis. \n\nCiao mi familia.", "author": "Andrew N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-11", "description": "My husband is a big fan of pizza so we usually go to Nick's or Grimaldi's (sorry Lombardis').  This place don't give you extra sauce for calzone and available only on sausage. The wine is whooping $10 for a pizza place, and $10 ceasar salad that was too small. I noticed though that they put more toppings on their pizza, and they have better ambiance than the other two. Hmm... I think I'd go back to Grimaldi's :)", "author": "Karen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "the best pizza and good view. I like to spend time around dumbo and generally I am going that place when I wanna eat pizza. The food is good but service is ok..", "author": "Sabit B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-12", "description": "I loved Juliana's, I really did. Until I got one particular waitress and she turned me off from the whole place forever.\n\nCame here on a snowy January day for some delicious coal fire pizza with a friend. I spent days talking Juliana's up. Going in, we knew exactly which two pizzas we were going to order. We were both starving and just wanted to stuff our faces, but the waitress never came. We noticed all the servers around the coal fire oven just talking and gossiping. I was not in the mood to be in a bad mood so I just continued on my conversation with my friend. 15 minutes went by until our server finally came over just to take drink orders. We told her we were ready to order everything. We also asked her if one pizza could come out in front of the other and we would tell her when we wanted the next one. Part of my thought process in this was that people would stare if we had two large pizzas on our tiny table and there nothing I hate more than a gawker. \n\nOur first pizza to come out was the number 2, which cherry tomatoes, sea salt, bufala mozzarella, and garlic (see my previous review for that one). Not even before we had our first slice, the second one came out. The waitress neglected to listen to our request. The gawkers were always coming on heavy. The second pizza was the number 4 with tomato, mozzarella, prosciutto, and arugula. This is the one I was really looking forward to as I love all the ingredients. However, when I tried it I was heavily disappointed. First of all, I was under the impression it was a white pizza that had tomatoes on it. Not the case, and I wouldn't have minded, but the tomato sauce was so basic and acidic. \n\nWhen we were finished we waited and waited for the waitress to come clear the table. She walked by us numerous times after we had stopped putting food in our mouth but didn't even stop to ask us if we were done. I would usually flag her down, but this time I was curious to see how long she would really take. We sat there for 25 minutes. TWENTY-FIVE minutes AFTER we were finished. I was astonished. We watched her clear other tables, bring people pizzas and drinks, and even saw the table, who came in while we were eating, order, eat, pay, and leave before we even got the table cleared. I was completely shocked at the utter disrespect and ignorance of this waitress. When we finally did get packed and rang up, I was not in the mood for leaving a tip at all. \n\nI'm a huge fan of service. A 3 star restaurant can easily go up to a 4 or even 5 star place for me if the service is impeccable and I know I'm not the only one who feels that way. Unfortunately a 4.5 star restaurant dropped to a 2 star because of one bad apple in the bunch. I hope they reconsider this woman's role in the company.", "author": "Christina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "Anyone who knows Brooklyn knows Juliana's is the real Grimaldi's. I would not go so far to say that this is ~ThE bEsT~ pizza ever, since that title is still up in the air for me, but it's pretty damn good. Also this place has gotten way touristy, but then again, what great eateries in NYC haven't? \n\nStop by on a WEEK night, and if you're lucky, snag a seat at the pizza \"bar\" towards the back where you can sit and watch dough literally being launched through the air, and toppings strategically scattered on your pie. I saw my specific pie being made and it was pretty cool. I timed mine in the oven: 5 minutes. Seriously. I think maybe even 4.\n\nOnly downfall is I felt service was a bit pushy and rushed. Got asked 3 times if I was ready to order, before I was actually ready. (I'm extremely indecisive.) And our waitress was pretty cold. Pizza was hot though, so, oh well.", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "hands down my favorite pizza (so far) in New York. the pizza is just damn. good.\n\nlines are not as bad as grimaldi's next door, but i advise against coming here in a large group if you're not a fan of lines. also very warm vibe and great service, love bringing out of town friends or family here", "author": "Jack W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "3 people, 2 large pies, only 2 slices left\n-Margherita Pie\n-Margherita plus ricotta and mushrooms\n\nGreat fresh pizza, in the original Grimaldi's location with less of a wait. Grimaldi's isn't the same as it used to be since they expanded.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Great pizza. We had two smalls, which are actually just a little smaller than the larges. One simple Margherita and one with extra garlic, sweet onions and sliced meatballs. Both were terrific. Crust was good, cheese and sauce were excellent. Noticed that the cheese didn't ooze oil, as some pizzas do. Waiter was very good and nice. Nice ambiance too. Definitely worth visiting!", "author": "Douglas S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "So Juliana's pizza is famous. And there is a line if you don't get there early. And it's on a little side street in Brooklyn. Is it worth the cab ride from Manhattan? YES. Is it tasty, flavorful, unique pizza? YES. Is the service exceptional? YES. Is it the best pizza in the USA? Well, the voters think so. I enjoyed a fresh salad, a wonderfully made pizza and great company. It was a great experience and I recommend it. Be prepared to wait though.......the word is out!", "author": "Beth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "The service was attentive.  I was anticipating the pizza to be other worldly due to the reviews and family name, but was disappointed.  The flavor was nothing special.  Kind of bland actually.  Would give two stars if it wasn't for the spaghetti and meatballs.  That was delicious!", "author": "Bradley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "I enjoyed Juliana's more than it's neighbor Grimaldi's as it tastes cleaner and has more variety. The pizza here is freshly oven baked, the dough is soft and chewy, the cheese melted and stringy. I didn't find the pizza here greasy and didn't feel gross after. It's also nice to be able to see them make the pizza in the back.\n\n+ Variety of options\n+ See them make the pizza\n+ Shorter line than Grimaldi's\n\n- Unimpressive basic salads", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "We had the calzone, margherita, and the #1 pizza. My favorite was the margherita pizza. The calzone is very cheesy so keep that in mind if you order it. The #1 was a good pizza but not the best we have had In New York. We also had to wait for a pizza because the oven broke down.", "author": "Sonia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Excellent pizza. Came here on a weekday evening with a friend, and we were immediately seated. Ordered a large plain pie, which was delicious. It's up to par, if not better than the previous incarnation of Grimaldi's. We were greeted by Patsy Grimaldi himself on the way out. Would come back here anytime.", "author": "Cary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "I came here because I was highly disappointed with my trip to \"The Original Grimaldi's\" (it was quite doughy - I believe undercooked, not the thin crust masterpiece I remembered) and since the family feud of the Grimaldi's was quite public,  I knew this also belonged to Patsy Grimaldi.  DO NOT BOTHER WITH THE NAMESAKE UP THE STREET.\n\nThis, this is what I was looking for.  First of all Patsy is there greeting the customers and there is rarely a wait.  We opted to sit at the counter which is the best seat in the house!!  You get to watch your pizza (and everyone else's for that matter) from beginning to end.  We had our own vegetarian creation and it was delicious.  The sauce, it's a little sweet, spicy and savory and I could eat it on just about anything.\n\nPerfect consistency, light, fresh ingredients, crispy crust and you and a friend can polish off a whole pizza.\n\nSeriously, skip the line and skip the hype.  The real Grimaldi's is right next door without all the hassle.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "The best \"Grimaldi's pizza\"around. Love the ambiance and friendly and quick staff. Great pizza.", "author": "Fabolous D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "We stopped here after a quick bite at Luke's Lobster down the block.  There was a nice line outside, but it went pretty quickly, and we were inside after about 25 minutes.  The owner greeted us, and showed us to our table.\n\nThe pizza that we ordered was a sttraight up Margarita(sp?)  Just sauce and cheese.  My feeling is that this is how you judge a pizza joint.  It's like Vanilla ice cream in an ice cream shop.  It's fine to get the hot fudge sundae after you have established that the vanilla is solid.  \n\nThe pizza did not disappoint.  It was, as expected, and awesome crust.  Slightly chewy and slightly crispy all rolled into one.  The cheese was tasty and had good mouth feel.  \n\nService was brisk, friendly and efficient.  Price for the large pie was 19 bucks.  Not bad for a really nice pizza meal.\n\nWe will be back...", "author": "Eric N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "I don't think I have eaten real pizza until today. I have passed Grimaldi's several times without noticing Juliana's and for some reason, have never wanted go in despite the hype. Recently, I began to crave authentic Neapolitan pizza that's prepared in brick oven and did a little searching for the spot to have my first taste. I soon realized my initial instincts about Grimaldi's was on point after reading the story behind the two shops. I decided on on Juliana's for the sake of supporting the original owner.\n\nAs soon as I walked into the shop, the staff was extremely friendly. My waiter saw my girlfriend fanning me after our long trek to this shop and decided to take two huge menu's to join my girlfriend in fanning me. This made everyone around me smile. \n\nThe pizza was amazing. We ordered the Margherita. The sauce was perfect in consistency and tanginess and the pizza was baked just right. The crust was deliciously crunchy without being burnt. Usually I am extremely thirsty after eating pizza due to its high salt content but not after Juliana's!", "author": "David I."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}