{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "Grimaldi's moved. Juliana totally revamped the place and then opened a new pizza restaurant. They kept the same oven, but setting foot in this place you can hardly believe it used to be Grimaldi's. \n\nIt's very clean, which I appreciate, and you are greeted by Juliana herself when you walk in. The wall provides a bit of context for the NYC pizza wars and for the history of many famous NYC pizza shops. \n\nAs for the pizza, it was fantastic. I opted for the Margherita - excellent flavor, and perfect cheese. It's cool to see the wooden boxes that they take the dough out of to make your pizza - this is quality stuff!\n\nOne thing though - we ordered a large and a small, and we were brought 2 smalls. Our waiter said that \"Since we were three people he thought that we were better off with 2 instead.\" Come on dude - you screwed up, at least admit it!\n\nAnyway, this place is awesome and I'll be back despite that minor hiccup :)", "author": "William M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-10", "description": "Fast and Friendly service. We were going to go to Girmaldis' but just decided to go here since it was next door.    The pizza came out quick.  I loved the crust and everything about it was delicious.  The coke drinks came out in bottles so it was cute, but small.", "author": "Sandy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Excellent NY style pizza. Definitely worth a trip over to Brooklyn. We had the pepperoni and sausage and loved it. Crust, cheese, sauce, everything was delicious.", "author": "A B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "Stood in line for about an hour around 8pm on a Saturday night, drinking a well-prepared ice coffee from the shop next door and stomaching the annoying diatribe about how \"touristy places\" are disgusting from a pretend elitist d-bag in line behind us. Comes with the neighborhood sometimes I guess, but I'm not from here so I don't wanna judge.\n\nGreat atmosphere inside, very energetic and pleasant, clean and inviting decor with photos of Frank and others to notice while awaiting your food. Simple and very serviceable menu with super nice staff helps you to decide and without a salad you're waiting another 10-15 for the pie.\n\nPizza is very good, the hint of coal flavor is unique to this type of oven and the crust and ingredients work well together. I recommend this place to anyone however, I'm not one to encourage an hour wait for food ever, so unless you like that type of experience, I'd look for others in the area (though not the immediate neighbors as they were equally as busy). \n\nChicago pizza is still my favorite but a very nice try by NYC.", "author": "Sean M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "After a walk across the Brooklyn bridge this restaurant was beyond our expectations \nGreat service and the pizza was awesome make sure to try the sausage and the scamorza \nOur server, Ray was excellent and made some great recommendations", "author": "Lynn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "As a tourist I was so glad that we made it here. Was advised this was THE PLACE to go for NYC pizza by the ladies at the top of the new World Trade Center. They weren't wrong. Take the subway to South Ferry, walk across the Brookyln Bridge and right as you get to the other side, its right there and well worth the wait. Great Experience!!!!!", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Great pizza, nice toppings, big servings. White pizza with truffle flavor very good.  Had some nice discussions about photography with our server also.", "author": "Inge J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Overall, good solid pizza.\nThis place sits right next to famous Grimaldi which has been superb in the past but now it turned to \"only tourist\" place and the food simply sucks.\nUnlike Grimaldi, you can get table relatively easy, get beers and wines.", "author": "Wataru I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Came here for the first time a few weeks back. The pizza and the service were great! I highly recommend this place to anyone who's in the Brooklyn area to come try it out. The taste is very unique and delicious", "author": "Alex W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Yes! Walk the bridge, Eat here and ride the water taxi back to midtown. My new FAVORITE NYC routine. Thin crust NY pizza in a fun setting.", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Amazing!!! Great taste, perfect crisp, everything perfect. But what do you expect from the founder of Grimaldi's, Patsy Grimaldi?! \n\nI can't wait to go back and try another pie. I just had a regular to try for first time. \n\nOne thing I loved, even though I didn't get to, was Patsy talks to everyone. Regular down to earth conversations. I think that's great.", "author": "Matthew G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-22", "description": "I'd heard the buzz so checked it out. Didn't mind the line or prices, and the pizza wasn't bad, it just wasn't anything exceptional. Maybe I just don't get the thin, watery NYC pizza thing. Its bfilling at all. It's very thin, and the sauce and cheese are also sparse. Again, maybe I'm just the wrong audience, but this wasn't worth it, hype or not.", "author": "Allan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "It was the best pizza. I ordered half margarita and half meatball and arugula, came out awesome delicious crispy as a pizza should be. Love love love Brooklyn pizza....", "author": "Nasim C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-13", "description": "Overrated- found long strands of hair underneath our pizza and they still managed to make us pay for our single soda, no apologies or excuses. Guess this is what happens when the business is good?", "author": "Seonee W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "There are few places that are worth the hype more than Juliana's. The pizza is a gift well worth the wait while the egg creams hit the spot perfectly on a hot day. Simple, and yet complex in flavor, the no. 2 is wonderfully balanced, leaving nothing to be desired but for maybe another slice. I'll be a customer for life, any time I manage to come up here.", "author": "Adrian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "I'm going to try any place with a line and Juliana's had a line. They moved people in quickly and the staff was very friendly.  Our waiter was great and we ordered a pizza based on something we saw someone else order.   When the pizza arrived, it looked good but it was undercooked.  No big deal, it wasn't raw or anything, just not the crispy thin crust pizza I was expecting with a nuclear hot coal fired oven.\n\nLate in our stay, I bumped into Patsy who asked \"how was your pizza\" and I figured I'd tell him.  \"it was ok, but I can make the same pizza at home with a 500 degree oven.  I'll try you again, but it wasn't special\"\n\nWhat he said will make me come back. He said \"Why didn't you send it back?!  We want you to be happy\"\n\nI realize that they're cooking by eye and they took my pizza out a minute early, that's all.   He also gave me a tip, that you can request a \"well done\" pizza if you like more crisp and burnt edges\"\n\nNext time I'm in Brooklyn, I will try it again. Any owner who encourages a customer to send the food back because it isn't up to his standards is an o.k. guy.\n\nLooking forward to the next time, thanks Patsy.\n\nA", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Omg!! Love at first bite. The wait was not bad at all on New Year's Eve. I waited about 20 minutes outside. Juliana's Pizza is actually owned by Patsy Grimaldi. So if you really want to know what the original Grimaldi's tastes like...then go to Juliana's. I actually prefer Juliana's over Lombardi's. I recommend getting the margherita pizza with sausage, pepperoni, and mushrooms. Best combo ever. The pizza was so amazing that my boyfriend and I stuffed our faces with the LARGE sized pizza and devoured the whole thing! Not only that, we also got the NY cheesecake after. Oh boy, that was the best tasting cheesecake ever. Definitely a slice of heaven. I would definitely go back here when I am back in NY.", "author": "Kathy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "We initially planned to go to Grimaldi's, until I realized it is now just the same chain that I've been to at other locations (and was sorely disappointed by).  I found Juliana's on Yelp, and give the stellar reviews we gave it a shot.  As we waited in a short line outside, we struck up a conversation with some locals who told us that this place was opened by Patsy Grimaldi, the original owner of famous Grimaldi's!  And not only that, but Patsy Grimaldi was inside the restaurant welcoming guests!  We ordered a pepperoni pizza and a sausage pizza.  Both were fantastic, but the pepperoni won hands down.  Seriously some of the best pepperoni I have ever had.  If you're in Brooklyn, stop by this place, say hi to Patsy, and sit down for some excellent New York pizza.", "author": "Sage V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "Today we tried Juliana's Pizza next door to Grimaldi's in DUMBO. I can honestly say that it was the best pizza I've had in years! The line to this place is usually an hour plus with a line going around the block but after being told the wait would be approximately 30 minutes on the phone, We received the red carpet treatment when we arrived and were seated merely two minutes upon arrival. The staff was warm, friendly and inviting. And so was the manager who even took the time to make sure we were happy with our pizza and even made the effort to make small talk. I must say that I was pleasantly surprised and our pizza was made to perfection! Margherita Pizza with Tomato, mozzarella, fresh basil and two extra toppings of fresh garlic and pepperoni. Absolutely DELICIOUS!!!", "author": "Ivelis P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "The Great Pizza Circus! Juliana's is excellent while the service teeters on the absurd.  \n\nPatsy (the \"original\" owner) services Juliana's door when the line to Grimaldi's wraps around and stretches to the front of his establishment. Then, to our amusement and annoyance, he invites those people waiting for Grimaldi's into his restaurant - seating them whenever there's a table - bypassing those waiting for a table in his own pizzeria! Yes, expect to wait longer while the gentleman in the front of the house cherry picks. He's a hoot, though, standing there shamelessly cracking crude jokes and posing for photographs with tourists. He's a bit of a lecherous ring-master in this circus of historic dueling pizzerias and who can blame him - though - given the absurdity Grimaldi's has become? \n\nOnce inside Juliana's you'll be treated excellent by a stressed but hustling, kind staff (the latter I didn't experience when I visited next door a few weeks ago). The pizza?  It is amazing, and the beer and wine selection is excellent - something unavailable (Patsy told me) next door. This whole show is what makes New York pizza so weird, surreal and great. Bon appetite!", "author": "Bryan M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}