{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Ate hear for a quick snack around 3pm the day before New Years Eve 2014! I stumbled in after seeing Grimaldi's had a line around the block. I had the pizza with arugula and prosciutto, it was amazing!!!! The staff was very friendly. I must have got there right on time as I was leaving it was packed and also started forming their line around the block. Get there early or be prepared to wait. Worth it, these people know pizza!!", "author": "Jason B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Hands down my favorite pizza place!\n\nThis place has Grimaldi himself, as well as the original Grimaldi pizza oven, which means everything for a pizza place. The current Grimaldi's has great pizza too, but the wait is much longer and the service is awful. Juliana's feels more local and authentic.", "author": "Katelyn P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Fantastic pizza - loved the dough and toppings. Solid service. The vibe and music were fun. Great story/history about this location. We enjoyed the beautiful sights at Brooklyn Bridge Pier Park, just a stroll from Juliana's.", "author": "Jennifer F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "One of the best pizzas I've had. The quality and ingredients are huge with me and the consistency of those things are what makes the pizza here great here. I love the dough and cheese.. Something about it here is distinct. Will be back. Prepare for lines though. They also have really good desserts.", "author": "Desiree Michelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "I've been wanting to check out this place ever since I read an article in New York magazine about how Mr. Grimaldi started this place after selling Grimaldi's (which is just next door). \n\nWe came on a Saturday night and waited about 20 minutes in line. Really not bad at all. Mr. Grimaldi was there helping to manage the line and talking to the customers. We ordered the no. 4 which had prosciutto and arugula. It was really good- thin, crispy with the perfect amount of cheese and sauce.\n\nThe pizza oven is out in the open and near the bathroom. I loved watching the guys making pizzas as I waited for the bathroom.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Excellent pizza that is well worth the wait. Simple but fresh ingredients are what make the difference here. Do not abandon the line! You'll regret it if you do.", "author": "Sergio R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "We waited 40 minutes outside for a party of 4. We heard great things about Juliana's and the awesome story behind it. The pizza honestly was underwhelming and the service was slow. BUT THE DESSERTS ARE AMAZING. The Apple pie and the cheesecake were delicious. Go here for some great sweets.", "author": "Nicholas C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Pizza is a staple to us New Yorkers. So, for a pie to really stand out as this one did at Juliana's it must be pretty distinguished...and it was. Large pizza with smoked mozzarella, fresh basil, fine prosciutto ham, ricotta cheese made for a Venusian Elysium in my mouth. Go here.", "author": "Chad L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "This place was one of my favorites during a recent trip to New York. The pizza was super authentic (I spent 5 months in Italy so I'm pretty picky about my pizza). The service was great and we were seated quickly. The location is amazing as well. After dinner you can walk down the street and gaze at the skyline (how romantic! haha). This place is a must if you're in Brooklyn. Don't pass it up.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "We visited Juliana's whilst stopping off at DUMBO flea market. We had read on the internet before coming out that stopping here was a must. We got a large number 4 pizza and oh boy is it big!!! The pizza tasted amazing and its great to have a nice thin pizza. The queue to eat in was about 45 minutes so we decided to get take out and go sit on the grassy water edge 5 mins away.\n\nThe reason for giving 4 stars instead of 5...$30 seems abit excessive for a fancy pizza. Definitely a stop off for a tourist visit but it wouldn't be a regular place to visit if we lived here", "author": "Stephanie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Delicious pizza! Came here after walking over the Brooklyn Bridge and just missed getting a table at the 4 o'clock reopening. We were first in line and it took about 40 minutes to be seated at a table for two.  Quick turnover after that, as the service was super efficient yet friendly. We ordered the Margherita because it was our first time there and we wanted the classic pie. The white pizzas and one with arugula on top also looked amazing. If it's a nice day and the line is long you can order to go and bring to the park at the end of the street. There are tables and benches with great view of manhattan there.", "author": "Leanne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "Overall - A\n\nService - A (Tiffany was ourwaitress and she was outstanding. Came to the table the right amount of times to check on us and overall very good)\n\nPizza - A+ (we got the Margherita and Pepperoni pizzas. Amazing pizza that isn't too doughy and has the right amount of sauce) \n\nWait time - B+ - less than 30 mins but shorter than Grimaldi's\n\nOverall this is the original Grimaldi's. Grimaldi's (next door) seems to be a major tourist trap.", "author": "Chris L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "It is so strange to me that Juliana's, while packed during my visit, has no line while the Grimaldi's next door always has a stream of people hovering outside. Is it because Grimaldi's is in a guidebook whereas Juliana's is not?\n\nThe place is lovely, glowing and gracious with the requisite wood-burning oven glowing in the background and delicious pizza smells wafting through the air. The service was a bit spotty, given that our waiter clearly was still around high school/early college age, but the margarita pie was a winner.", "author": "Crystal W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Hands  down THE BEST pizza I have ever eaten!  The hostess was very friendly and sat us immediately.  Our waitress ( I wish I could remember her name) was  also very friendly and welcoming.  My friend and I shared a small margherita pizza , which was not small, and more than enough for two people.  It was amazing!!!!!  Everything about our lunch there was fabulous!  Grimaldi's next door, and may have equally as good pizza, but I love we could sit outside and have lunch, and there isn't any outdoor seating at Grimaldi's.  I can't wait to go back!", "author": "Monica H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "Don't get me wrong. It was good, but unfortunately not what I would consider pizza purely based on how it was constructed. Juliana's pizza starts with sliced mozzarella, followed by drizzled tomato sauce and sprinkled toppings. Tomato sauce should never be drizzled on a pizza, it should be spread. Drizzling leaves a very unfortunate situation in which some bites into the pizza either do not contain sauce or cheese or both. And the four wilted leaves of basil on my large Margherita pizza did nothing to alleviate my despair regarding the drizzling. Yes, adorable restaurant, flavorful, but not my kind of pizza.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-17", "description": "Wow. I really can't believe how disappointed I was in this place.  It was just very disappointing to me considering the history they claim and the write-ups and reviews. I came here expecting tradition NYC pizza, on the same levels as Totonno's, Grimaldi's and Lombardi's...the old school pizza places...and this wasn't even close.  I think my local hole in the wall pizza place is actually better, and a better representation, of what NYC pizza is.  I'm actually kind of sad that a tourist may try this place and get the impression that this is what NYC pizza is - it's not.  Not even close.  It's not even good pizza...but I'm getting ahead of myself.  Let start from the beginning...\n\nFirst off, they are disorganized.  People didn't know to wait outside or go inside to be seated. Especially when there wasn't a line. (if you've gone recently you'd see there's a really long line in front of Grimaldi's and a short to no line in front of this place.  That tells you a lot.)  Then, inside, they seemed confused on where to seat you.  We, my girlfriend and I, were lead around the place before being seated near the kitchen when there were open seats we passed by.  It's not a problem really but, c'mon, you've been open for months.  These issues shouldn't exist at this point.\n\nThen there's the upsell.  We ordered a salad. \"You don't want the walnuts and cheese?\" A $3 increase.  We ordered the classic Margherita, what we normally get when we want to check out how good a pizza place is, and we get \"No toppings?\"  Up to $6 a topping depending on what you get.   We ask for water.  \"You guys don't want drinks?\"  Ugh.  It's like they have to get you for all you're worth now cause they know you're not coming back after trying the pizza.\n\nAnd their timing is terrible.  We're lucky, we were just finishing up our salads when the pizza came out.  The couple next to us, not so lucky.  Their salad came out immediately followed by the pizza.  Now this couple has to figure out if they should continue eating the salad, their starter, and let the pizza get cold or eat the pizza and ignore the nice salad they ordered to START their meal with...WTF you know?\n\nNow onto the classic Margherita...it was just bland and flavorless.  The crust isn't a traditional NYC crust with that nice crunch and snap...instead it's \"pillowy\".  More like a Neapolitan pie, which is fine, I've had plenty of really good Neapolitan pies, but most of those weren't bland and flavorless.  This pie...there seemed to be a distinct lack of seasoning.  All you got was bland cheese, bland tomato sauce over pillowy dough.  It never came together to elevate those ingredients to \"pizza\" or, at least, good pizza.  I really can't describe it - because it's so nondescript.  There were no qualities that stood out.  It wasn't even salty - and at some point I was wishing it was overly salty because, at the very least, it would add flavor to this pie.  It's seriously one of the most bland and boring pizzas I've ever had - and I eat a lot of pizzas. \n\nAnd, of course, the minute you're done they take the plates away and drop the check down.  Well at least they didn't try to sell me dessert - I guess that's a positive right?", "author": "J. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "My daughter and I came to NYC knowing we wanted to eat at Juliana's.  We got there on a rainy Saturday night, and were met at the door with no wait to be seated and experienced the most wonderful pizza I've ever had...and I've had wonderful pizza in Italy and Half Moon Bay, CA.  Yes, there is good pizza in CA.  However, Juliana's was the best crust, the freshest toppings, and the ambiance was...so perfectly Brooklyn real pizza.  So thank you, and I will be back.", "author": "Rose Ann D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "A great experience.  The line was quick, the service and hospitality were top notch and the pizzas were delicious!\n\nWe ordered a Margharita and special pizza #1.  Both were excellent!  We'll definitely be back...", "author": "Ray M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "I decided to go here one afternoon because i always wanted to try Juliana's. The long lines usually deter me. This one particular afternoon a friend and I basically had the restaurant to ourselves.Service was prompt the staff was pretty ok. The first plus for me was them having  Angry Orchard on tap. I ordered the Margherita it was tasty and the ingredients were FRESH!! Service was quick no real complaints there.  I also appreciated that the restaurant gives you  the option of using either cash or credit. The other pizza joints in the area are cash only. For me I will say this pizza is MUCH better than Grimaldi's.\n\nI returned for a second visit one chilly evening. I was lucky enough to be graced by Patsy himself. He was very friendly and it was a pleasure to see the pizza legend himself.This chilly evening I opted for a bowl of pasta pasilli. It was a tasty soup that definitely took the chill off. Once again I had the Margherita and it was actually better on my first visit, but it wasn't bad.I don't know something just seemed a little different. \n\n\nAll in all if you are looking for a light pizza with a thin crust this is your spot! All of the flavors compliment each other rather than one overpowering the other. This pizza leaves you feeling satisfied not heavy and bloated.", "author": "Brook L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "Very impressed with the quality of customer service and how collective the staff stayed regardless of the line outside the door. Ingredients are fresh and location is pretty cozy! The line is worth the wait but wasn't that bad, I waited 30mnts for a table of 2", "author": "Fa R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}