{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-16", "description": "Arrived at 620 sand had a 5 minute wait on a Thursday. Got the half Margherita and half white with pepperoni. The White was amazing with a nice garlic flavor but I found the Margherita to be just okay. The tomato sauce was a bit too runny and sour. Still great pizza though.", "author": "Keith C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "Wow! Best pizza ever! Crust was perfect,toppings the right proportions. Just amazing pizza! Worth the wait.", "author": "Jeff T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Went on a Monday at 11:30, waited about 10 minutes, not bad at all. We sat on the stool seats near the kitchen and got to watch all the action!\n\nOrdered the small margherita pizza for two. SO good. Coal oven baked to perfection, the dough has a that perfect texture and crunch. I love NY style pizza because it feels lighter, boyfriend and I had no problem polishing off a whole pizza between the two of us.\n\nWhen we left, there was a massive line running into the Grimaldi's. Yikes. Come a little earlier to miss the lunch rush.", "author": "Jade L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "2 words.. Crazy good pizza.\nAnd I mean crazy good. Unless you've had it, you can't understand how mere pizza could be elevated in this way. It is just great ingredients made the right way.\nThe crust is perfectly crispy, with a marinara sauce that I can't even describe. It was just a little bit spicy but with a seriously full flavor you wouldn't expect from just a simple sauce.\nTwo things that I would highly recommend, because they were recommended by my waiter. The meatball appetizer was a winner, and you should get arugula on your pizza. That slight bitterness goes perfectly with the margarita pizza.\nThe line is long, but worth the wait. However, be aware that it closes for cleaning at 3:15. I was in line around 2:30 and I was able to get in before it closed.", "author": "Brian K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Was out in NYC last week during a business trip with my partner and I decided to stop here to grab some pie. Its everything you have ever imagined at a NY pizza shop. Delicious Pizza, amazing people and super busy on a Monday. Im definitely going back here any time I am in the city. The pepperoni was amazing and I usually never order pepperoni anymore. Don't tell them that though or they will stop serving me pizza! \n\nI would definitely recommend stopping by here and trying their food. Parking can be a little difficult so just catch a cab and you'll be there in no time. I say cab because Uber can be such a rip off haha. Nothing like some east coast pizza to make a boring business trip a whole lot better. My buddy tried some of their other stuff on the menu and was delighted. Only problem we had was parking the rental we were on our way from the airport and had to make a quick stop before getting to the hotel. Probably will order delivery next time and stay right next door thats how much we loved it.", "author": "Mason L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "This is an incredibly long overdue review. Juliana's has amazing pizza-hands down, some of the best in Brooklyn.\n\nWe got a large pizza-half white, half margarita. The sauce is slightly sweet with a little kick-it's simple and not overdone-just how a perfect pizza sauce should be. The cheese is fresh, creamy and stringy-just how cheese should be on a pizza. The crust is thin without being flimsy, and it's pliable enough to fold without breaking in half-just how a pizza crust should be. Everything about Juliana's pizza is exactly how pizza should be, so it's literally the perfect pizza IMO.\n\nWith all of this said, being the perfect pizza place has its downsides aka the really long lines. A quick tip-your best bet is going during the week right when they open (11am I believe). When me and my fiancé went, we happened to randomly take off of work on a Monday so we walked over the Brooklyn bridge from manhattan and got there right when they opened and were seated immediately (along with some other folks that had been waiting for them to open). However, after about 15 minutes of them opening, large crowds started flooding in, and this was on a cloudy Monday. So, if you can, go when they open on a weekday. If not, go early and wait for them to open on a weekend to avoid crazy long lines. I promise you, the lines are worth it though.", "author": "Brianna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "This is what Brooklyn pizza is all about.\nThis was the first place I had pizza in NYC and this is the place I take people (family in town, date nights). It never fails and is always spot on. Never had a bad waiter, never had a bad pizza. AND the history behind Juliana's and Grimaldi's is enough to make it a great spot to stop at.\n\nPrices can run higher and, during the warm summer months, lines are usually out the door but you can make it in to a table in 30 so hang in there. It's worth the wait.\n\nYou can watch the pizzas slip in and out of the stone fired oven from counter seats around it or you can sit at a high top table. Either way, the ambiance is fabulous.\n\nThin crust. Try a white pizza. They have one with broccoli rabi and that shit is so good.\nGrab an egg cream. Legit, as good as it gets Italian treat.\nIt's perfect for an intimate date (candles on the tables) but also for showing off the bad ass pizza of which your borough can proudly boast.\n\nNext time you want to show off the Brooklyn Bridge and all the gorgeous views at the piers, stop through Juliana's (the go to Brooklyn Ice Cream Factory for a soft serve cone or Ample Hills on pier 5!). You won't regret it.", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "When we entered, and first smelled the pizza, we knew we made the right choice)) The pizza is awesome - it would have been worth to wait even longer for it! This place shuts for a couple of hours mid afternoon and reopens at 4pm so get there early!", "author": "Ella A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "My fiancé and I visited NYC for the first time in 2017. On our flight there, a gal on business told us we HAD to have Julianna's. So we did and my goodness am I glad she told us about this little gem. It's packed always for the most part so be prepared to wait but it is WORTH IT! While we were in line outside, I believe the owner was the one standing there monitoring the line of anxiously awaiting hungry customers. He was so nice! He was telling us Minnesota's the history of the restaurant, and all about \"egg cream\" (which I completely forgot to order and STIL beat myself up about to this day.) The inside of the restaurant is clean and I love the vibe. The pizza is INCREDIBLE. Authentic and flavorful and cooked to perfection! It truly made our last night in the city amazing! I can't wait to go back!!!", "author": "Krys R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "This is the best pizza I've ever had. I have tried many pizza places in NYC and Juliana's is simply the best. The 45 minute wait was totally worth it. Would recommend to anyone looking to satisfy their pizza craving.", "author": "Jamie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "It's worth the hype.\nWell, I take that back. It depends which place you go to. We had to decide between Grimaldi's or Juliana's. We ended up reading a few reviews online (some here on Yelp) and ended up choosing Juliana's. \n\nWe ordered their Margherita (small) and it was more than enough food. We had heard this place can get pretty busy, but we were here on a Thursday afternoon for lunch and it was pretty empty. We were seated right away and given water right away. We ordered some bottled drinks (diet coke) and then our pizza came out not long after. \n\nThe pizza was my kind of pizza. First off, I love a good thin crust or classic NYC pizza. So this fit the mold for me. The sauce was slightly sweet and we got a nice cheese stringy 'tude which I hope most pizzas have! Our server was nice, attentive and kept our drinks refilled! \n\nI honestly don't know what the difference is between here and Grimaldi's. I think they're both probably pretty similar, but next time I'm in the city I'll need to try Gimaldi's to see ;)\n\nI can say with certainty that we had a fantastic pizza experience at Juliana's.", "author": "Aparna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Amazing pizza and quality service!!\n\nWe were wandering in Brooklyn trying to find the spot everyone takes a picture in for DUMBO and somehow ended up in the waiting line for Julianna's Pizza. We knew it must be super popular after seeing a line automatically for behind us in less than 5 minutes. (This is also before they are even opened for lunch time.) \n\nOnce seated, we were automatically greeted and given a menu. The waiter also gave us some recommendations. We ordered a small classic pizza. Half margarita and half with white sauce. Sausage all on the pizza. When it came it was huge! It was crunchy but rolled super thin. It was super delicious and we finished the entire pizza! Definitely worth it!", "author": "Jeanette Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "Hands down the best pizza I have ever tried! During our stay in NY we were recommended to try this place and I must admit I am grateful for this spot. We ordered 3 different pizza's and all of them just amazing. The pizza was cooked to perfection! We absolutely loved their Special Pizza No. 6 which grilled chicken, mozzarella, jack cheese and whore cheddar. cilantro and guac! And I must say this was the most Delicious pizza I have ever tried!!! We ordered Margherita pizza which is always so simple yet super delicious. I hope I can revisit this place sometime soon again!!!", "author": "Ida Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Juliana's is hands down the best pizza I've had of the eight restaurants I tried in New York City this weekend, and possibly anywhere in my entire life. The white pizza is absolutely TO DIE FOR. Great springy crust, buttery garlic flavor, and excellent cheese. We also got half regular margherita with pepperoni. The topping was on the sparse side but really high quality. Every aspect was really flavorful.\n\nThe atmosphere is high class but the servers are not uppity. They even invited me to take close up pictures of the oven and of the cooks making pizza dough. They also have cannoli and pasta dishes but you should really order the pizza if you're here. The pizza was pricey IMO but it was probably normal for NYC (around $30 for a small pie, but small is actually a generous size). \n\nI hear there's often a line for this place. I don't believe they sell slices, so this is a dine in establishment. Either way it's worth your time. Put Juliana's on your pizza list!", "author": "Nicole Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Was visiting NYC for my cousins wedding and my coworker from California highly recommended this place. Did not disappoint. The only disappointing moment was when the food was all gone and in our bellies. We got a large pizza and some pasta. Both were made with the finest ingredients and materials. I highly recommend this place to any visitors. Beware that the line can get long. So be prepared for that.", "author": "Alexander T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Waited about 15 minutes on a weekend afternoon, so not too bad. We added prosciutto to a margherita pizza and it was amazing. I also loved the cheesecake we had for dessert, and usually it's Junior's or nothing for me. We sat at the pizza bar and watched them make the pizza, which was a bonus! Good service and fair prices.", "author": "Gab G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Originally planned to go to Grimaldi's but it was closed for reservations. Upon walking further my girlfriend and I kept smelling this delicious smell and could not tell where it was coming from. We realized it was Juliana's Pizza. Waited about 30-45 minutes to be seated but the service we received was 10/10 wish I could remember our servers name but he always provided us we places to see and things to do while we were visiting Brooklyn. Pizza came out with in 10/15 minutes and will definitely go back.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Wow wow wow!! I was raving to my friends about new york style pizza and this is just where you go to experience it! We were lining up outside the door before they even opened and boy were we happy we got there earlier because the restaurant fills up so fast! I didn't care too much about the salad because it was drenched in the sauce.. next time have to ask for it on the side. The margherita pizza was just what I've missed and needed! It was so good with the dough being chewy but not overbearing and the sauce and cheese ratio was superb! We also got the no. 1 special since a friend doesnt like tomato sauce and by golly that was impressive as well! Four girls and we thought we couldnt finish a large and a regular special pizza but the best part is .. the pizza tastes amazing cold too!!! I can't wait to order Juliana's when i visit NY again!", "author": "Minna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "Awesome old school coal brick oven pizza!\nWorth the 40 min wait. Can't go wrong. \nWe had the marg w pepperoni. \nDelicious. The coal brick oven brings out the flavor of the crust.", "author": "C A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "My brother who is a pizza snob was quoted saying, \"This was the best pizza I've  ever had in America.\" The sauce, with the cheese and oven baked and the toppings were just incredible. \nWhen deciding on the size of pizza, this is how our waiter described it: medium is good for two people if they are not starving but other than that, just get the large. You will not regret it, I guarantee it.  \n\nWe got a half white sauce with pepperoni and half with red sauce with sausage.  I will say I typically love white sauce but this red sauce came from the lips of an angel.  It was immaculate.  The pizza was gone before I knew it and I now have a new favorite pizza joint in NYC if I am trying to show people a nice time.\n\nIt was on the expensive side for pizza (especially when you are used to seeing pizza for $1 on every other corner in NYC) but once every couple months, come eat pizza here to see what pizza could potentially taste like when its perfected.\n\n#TheDream", "author": "Jerrius J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}