{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-14", "description": "D-E-licious!! I have either been eating subpar pizza my whole life or this literally is the best pizza I have ever had, and I think its a little of both. This place is amazing!!\n\nI came here on a Sunday afternoon with two friends and waited less than 20 minutes to be seated. While in line we quickly became friends with two New Yorkers that were such a hoot! The conversations and their sense of humor made us forget we were waiting in line for the most delicious meal! Gosh I love NY!\n\nOnce we were seated the owner (I think) came over to greet us and make sure we were comfortable. Our waiter promptly took our orders and made awesome suggestions. We ordered a small size Bufala Mozeralla and the Mozzarella, Prosciutto, Arugla, and garlic pizza (No. 4 special on the menu). Wow! So amazingly good!! I put on 5 pounds just thinking about it. \n\nJulianna's is a hallmark restaurant of Brooklyn and if you are in the area and miss out then good luck finding better pizza because it doesn't get better than this folks!\n\nHistorical aside: its well known that Grimaldi's is the original best pizza in Brooklyn which is right next door to this place but the name was bought out when the original Grimaldi's closed down. So Julianna's, is actually named after the mother of Patsy Grimaldi's the original founder and Julianna's is in the Grimaldi's original location. I only learned this waiting in line behind some Brooklyn residents...but fun facts nonetheless.", "author": "Miriam A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-28", "description": "Have been here twice now.  First time, the service was excellent at lunch.  Second time, our waiter was a little surly at dinner.  But both times, the host was a doll.  \n\nThe pizza is better than Grimaldi's.  Stick to the basics and skip the calzone pizza.  My only complaint is that they charged us for parmesean cheese to sprinkle on the pizza.  Really?  The stuff that other places keep out on the table?  That seemed a little cheeky.  And if you are going to do that, at least offer a warning when asking for it.  Are you going to charge for salt next? (Don't suggest that to the Mayor.)", "author": "J S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "My daughter have this place a 5 before she even tried the pizza! The pizza is excellent, skip the long line at Grimadli's \u0026 come here where Patsy Grimaldi himself was seating guests. He is charming, even gave my daughter a pen for when she starts school! \n\nThe pizza is perfectly cooked, with a wonderful taste. We had the red pizza with pepperoni \u0026 sweet sausage and a white pizza. The leftovers where carefully packaged up which I appreciated since we were walking around a bit before taking the train home. \n\nI love the decor, the acoustics in the restaurant aren't the best so if it is busy night and you are hoping to have an intimate dinner where you can chat this might not be the place. However, come for the food and then walk around DUMBO afterwards for a conversation!", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Love the pizza. I am giving it a 4 because it's a tourist trap. I live directly across the street and won't wait in lines to eat in my own neighborhood.", "author": "Dale T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "BEST pizza place in Brooklyn, maybe even NYC as a whole. super cute inside, and not much of a wait, staff is always friendly, won't seat you until everyone is there though. Fresh ingredients and can watch them cooking your pizza.", "author": "Sara N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "Patsy is such a nice, stand-up guy. We welcome him with open arms back home!  \nThe crust is so chewy; I love it. The ingredients are so fresh. I especially like how the chefs at Juliana's put the anchovies under the cheese and other toppings so they melt into erotic perfection. Unbearably scrumptious!  Pizza heaven!", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Great destination after walking over the Brooklyn Bridge. Friendly service, cozy atmosphere and good pizza, highly recommend!", "author": "Mary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "This is the best pizza I've had in NYC so far. Wow. So good.\n\nThe restaurant itself is cute \u0026 clean enough to actually sit down \u0026 enjoy your pizza in-house, too. The only thing that was off was the wine, which wasn't great.", "author": "Laura L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Sure the wait is long and they don't have the greatest crowd control (some line-cutters will invariably find their way in before the patiently waiting), but once inside you've got some of the best pizza in town. Let's face it, coal oven pizza is where it's at, and Juliana's does it perfectly.", "author": "Tim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "One of the best! I went there twice and had No 5 in the menu.  Salmon  pizza. I can't explain  enough how good it was!  Recommended big time. Waiting is long and they close for 1 hour around 3:15. Worth watching!", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-21", "description": "Alright, so my wife and I made a second visit to Juliana's and we were pleased to find their ship has been righted. The place was full with a vibrant atmosphere. We had excellent and friendly service. We will definitely be back again. \n\nOh yeah, and the pizza is still great (because when you've got the [real] Grimaldis in the kitchen, that's never a question).", "author": "Leo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "STELLAR meatballs, pizza, and service. Terrance  IA an AWESOME server! My first time here as a visitor from Honolulu, and i loved it.", "author": "Ms. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "We went on a Monday night with family that were visiting. We took the ferry downtown from Long Island City and decided to have an early dinner after walking the water front. There was a line but it moved quickly. We have four children and three adults. They were wonderful with the kids. I commend them for being family friendly. We had the garlic pizza, a margarita pizza, a soup and two salads. The portions of the salad and soup were perfect. Everything was delicious. The best part is everything came out very quickly, which is great for hungry kids. It was a fun evening to pair our trip with the ferry. I would return again with a smaller group as I think the wait might be shorter, but well worth it.", "author": "Kadie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "We were able to get into \"Grimaldi's Revenge\" without a wait on a hot Sunday afternoon, after seeing the long queue for Grimaldi's next door.\n\nUpon spending some time taking in the sights and sounds of Juliana's, it would seem as if Sinatra was a regular patron here. Maybe he was, but if not, they would surely like you to think so, as Sinatra tunes play constantly, and there is a small shrine of sorts dedicated to him on one wall of this attractive DUMBO eatery.\n\nOur choice was a small Special #5 with sliced tomato, smoked salmon, goat cheese, capers and red onions. This special tried hard to make an impression but it fell short of expectations. The capers didn't add much flavor, the red onion was overpowering and the sliced tomato was underripe and was cut too close to the \"bone.\"\n\nI'd go with a simple Margherita next time. If there are only two of you, go with the small and save a couple of bucks.", "author": "Tom B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "Pizza was fine. Typical NY style. My gripe is with the beverages. A tiny 8 oz. bottle of Coke for $2.50. My iced tea was $3 with no refills which I didn't know until I asked for one. I switched to water after that and the waiter made no attempt to refill it. Will not be back.", "author": "Ann A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "LOVE LOVE LOVE the pizza here! This IS the original Grimaldi's, as it is run by Patsy himself. Don't be fooled by that long line at Grimaldi's on the corner, that place is a shame. It's a shame that tourists who don't know any better spend hours in that line. The pizza is super fluffy, light and not one bit oily! I reccommend everything but my favorite is the sweet sausage. Their salad is great and enough for 2 or 3 to share. You cant leave without trying Carol's canoli (Patsy's wife). Its simple but simply the best canoli EVER. Go, I mean run to Juliana's, you'll be happy you did :)", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "Seriously the best pizza I've ever eaten. \n\nPatsy came over and sat for a photo with us. After learning that Mr. Grimaldi grew up in da Bronx, which is where he learned the art of pizza, it just goes to show you that the best pizza really is from da Bronx. \n\nOrdered a half pepperoni Margherita Pizza, and the No. 4 pizza which was tomato, mozzarella, arugula and prosciutto. I favored the No. 4, but both were delicious. \n\nYes you might have to wait in line, and yes it's super busy so your waiter may not constantly be up your A** refilling your waters - but c'mon folks it's a pizza joint, not high end fine dining. Flag down your waiter, tell him you want a refill and bada-bing-bada-boom.\n\nThis is a five star pizza joint.", "author": "Sha M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-24", "description": "I have to be honest. This really wasn't anything special. The crust was thin and cooked well. The sauce didn't have all that much flavor and the mozzarella was used sparingly. I ordered a pizza that had arugula on top and the arugula had very clearly not been washed. It was like chewing on sand, or dirt as I imagine I actually was. Disgusting. We had the unfortunate experience of coming right before a very drunk pizza tour got to the restaurant. The staff were incredibly apologetic to us for these people so if I was giving a review based on the staff, I would be giving 5 stars. The staff was wonderful. Just as we finished eating, I saw another large tour come in and told my husband we needed to leave right away. I couldn't handle another loud and extremely obnoxious group. We got our very high bill (the prices are outrageous here. I guess being famous allows for this because I know Grimaldi's to be the same) and we left. There's far better pizza in New York folks. One of which is right on the corner.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Wow, best pizza I have ever had! Staff is friendly and courteous. Take the time to get here if you can it is worth it!!", "author": "Brian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "I thought I knew about pizza - at least, what New York pizza means. I assert that pizza as Americans know it was developed in New York, and a hot fresh slice from Joe's at 3am was as good as it got.\n\nIt was because of this that I never really took much interest in the gourmet pizza shops, the ones touting coal fired brick ovens and the like. After having lived in Washington DC for four years, I was tired of \"pizza\" being passed off as \"pizza.\" These pies married the shortcomings of the italian breed (uselessly thin and soggy crusts requiring a knife and fork) with those of the American breed (fatty, oily cheeses and toppings on tasteless cardboard), and tried to pass it off as something edible. One was better off ordering from Papa John's than going to one of those places.\n\nEnter Juliana's. Well, stand in line outside the door for half an hour, and then enter Juliana's. For the first time, a pizza combines the best parts of the Italian and American, while leaving most of the downsides of each behind. A flavorful, thin crust, that aside from the very tip of the slice, held its structural integrity when folded. Hearty toppings that were neither too salty nor too oily. Fresh, stretchy mozzarella, not dried and shredded, that was spread evenly over the pizza, not sliced and melted into place. Sauce that tasted like tomato, not tomato paste.\n\nThree slices into a small pie, and I look at my plate, noticing three drops of oil had escaped from the slices folded in my hand. If this had been a typical chain pizzeria or even a good slice joint, the amount of oil on my plate would have made the BP spill pale in comparison. And then it dawned on me - that was the difference. I had the texture of the crust, the flavor of the sauce, and the mouthfeel of the cheese, without the heaviness of the oil and the salt. Not only was the pizza delicious, but to get the flavor and the texture without the aftereffects was a revelation. Dare I say it was transcendent.\n\nLate night drunk food, or the occasional snack? I'll swing by Joe's. A meal? I'll stand outside Juliana's every time.\n\nP.S. A small pie is good for two people, and if you're hungry enough you might have room for dessert. Also try the egg cream - on our trip, it was made with homemade chocolate, and quite delicious.", "author": "Eric C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}