{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "I'm not a big fan of pizza and I'm definitely not a fan of waiting on line.  So, why did I wait 30 mins on a Saturday night for? Luckily, the pizza was worth the wait.  It was fresh and light, so light I ate 5 slices.  I would recommend any pie with a meat topping.  I'm not a big fan of the arugula so the #4 pie was not for me.  Service was nice and fast and now I knew why there was a line here and not at Grimaldi's.", "author": "gary m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "If I could give this place 10 stars out of 5, I would.  This is the BEST margherita pizza I've ever had in my life!!  And I've had a lot of pizza.  The only downside is that sometimes there's a wait - actually I should say most of the time there is.  But one Friday, I came with my boyfriend a little before noon and there was NO line here (or at Grimaldi's next door), and the place was almost empty!!  It was amazing.\n\nThe margherita pizza is just fabulous, every time we come here I can't get anything else because it's that good.  The tomatoes and basil are so fresh.   The mozzarella tastes like they made it themselves that morning.  And the dough is perfect - not too thick, not TOO thin.  So amazing.  After coming here, no other pizza place can even compare anymore!   Even though I don't live that close to Brooklyn, I will make the trek if I'm in the city because it's that worth it.\n\nBy the way, when we left that day (12:30ish?), it was filling up, and Grimaldi's had a huge line out the door.  I wanted to tell the tourists to go next door... they have no idea what they're missing out on!", "author": "Tifa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Some of the best Pizza in NYC served up by the original Grimaldi family (they sold their name to some imposters down the block). The pizza here is classic NY style- you're gonna love It. For all the tourists, you're better off coming here vs Grimaldi's down the block.", "author": "E E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-21", "description": "We were headed for Grimaldi's after our walk across the bridge from Manhattan, only to discover that the original spot had moved next door and Juliana's was now located in the old spot.  After reading the articles posted on the window - we discovered there is a familial connection to the famous pizza spot next door and the reviews said Juliana's was as good or better than Grimaldi's so we decided to try someplace new.  \n\nWe were the first inside since we got there about 15 minutes before they opened on a Sunday afternoon.  The place filled up quickly and it's not very large so you can expect a wait.  We ordered our Margarita pizza but were disappointed to learn they couldn't serve alcohol before noon on Sunday (bummer).  \n\nThe pizza was ok.  Somewhat light on the fresh mozzarella but the crust was bubbly and crisp as you would expect for a Neapolitan style pizza and you could taste the fresh basil.  I would not rate this pizza better than it's competitor - sorry Juliana's!", "author": "Toni F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "This one will be short \u0026 sweet.\nThere is definately better pizza in Dumbo to be sure.\nThis is the typical style of the neighborhood though: thin, fresh mozz, tangy tomato. Fresh ingredients, airy yet thin dough.\nBrisk service.\nCute black \u0026 white 1930's style interior.\nGo for lunch rather than dinner to avoid lines.", "author": "Debrin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Really great.  Impressed that they would list a cheese-less pizza on the main Menu.  Traditional cheese pizzas very good too.  Amazing crust. It was very good. Impeccable service. Efficient. Attentive. Clean.", "author": "Medhavi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Mr. Grimaldi was on duty during our visit a couple weeks ago. He greeted us out front, asked about out trip and brought us a complimentary espresso at the end of the meal. Always fun to meet the owner and even more so when he's charming and when there's a good story about his founding the place next door.\n\nThe pizza was the real deal. We had to order a third large for our party of 6, since we were all gobbling what we had. Don't even remember what toppings we had: it was all good. My 11 year old even wanted to make sure I yelped this place because it's the best thin-crust he could remember.\n\nAs far as pizzerias go, it's also a nice place to sit down for a meal.", "author": "Geoff D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "This pizza place, which happens to be owned by the real Grimaldi, is next door to Grimaldi's, another pizza place with gaggles of tourists in line outside. Thank goodness I had a real New Yorker guide me to the pizza in NYC: Juliana's.\n\nAt 4:30 PM on a holiday, we had to wait about 20 minutes in a short line in the sun (the not-so-fun part). The man himself was out front, pointing people to tables and chatting customers up. We got a great table right near the pizza-making action. Our waitress was nice and efficient.\n\nWe order the prosciutto/arugula pizza and the margherita pizza. Our party of 4 cleaned the pizza pans. They were delicious. Cheesy, fresh, flavorful, a little char on the crust... my favorite was the margherita, for sure.\n\nPrices were reasonable - in fact, they were cheaper than a lot of other places (less than $30 a pie). The beverage selection was solid, too. I'd tell you to try this place over other pizza options, but then there might be too much of a line when I try to go back ;)", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "The pizza there was excellent, very tasty. It was everything we needed. The crust is cooked just right, the flavors are fresh and it was not heavy or greasy. Even The service was great. I will definitely go back on my next trip to New York", "author": "Phara D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Tasty and natural ingredients. It is good enough. Has a legit Italian vibe. Went here with some friends who also liked this establishment.", "author": "Kailee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "The best pizza I've had in the States. Of course it'd be in New York. Right next door to Grimaldi's, this one is better (shhh, it's more authentic). There was a wait outside, my friend and I needed to catch our bus back to Boston soon, and we were concerned about making it in time.\n\nThe host, however, was nice and managed to get us in and seated in a reasonable time. We ordered and were served in record time and demolished a very good, very freshly made pizza. We even chatted with the owner and founder, Patsy and got a picture with him before leaving. \n\nThere has never been such good customer service anywhere. The next time I go to New York, this will be the first place I go. And I will get more than one pizza, because everything on the menu sounded absolutely delicious.", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "Super good!! 200% recommend this place over Grimaldies. This place is the original. 3 people had 1 large margharitta(sp?) Pizza andwe tored it apart!  It was soooooo good. Ingredients were fresh, it was made front of customers, it was not greasy like some other pizza places, not salty, it was just the perfection!! \n\nI would come back here any day.!pizza is my favorite food and I can come here and have 3 meals all day everyday!", "author": "Hea S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Definitely one of the best places I have been to for authenticity.  The owner or manager we saw did a great job moving the line along.  We sat outside with the nice weather and the service was outstanding.   We enjoyed the food which got to us way faster than expected and didn't lack in quality.   Outstanding work.", "author": "Wil C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Had the number 6 pizza white pie with chicken guacamole Monterey Jack and white cheddar. also had the lentil soup and meatballs. Lentil soup seemed a bit bland, meatballs were tender, and the pie was the bomb... line to get in was long but moved quickly... seen a couple of people taking pies to go and sitting by the water eating.. if you are in a hurry they also have ice cream from the Brooklyn ice cream factory allowing you to bypass an additional line. Worth the visit, highly recommend checking this place out.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "It's not that the pizza here is bad. I guess I am just unimpressed by it, especially for the recognition it gets. \n\nWe didn't wait long for a table on a Thursday afternoon in the summer. The two of us asked for a marinara and a margherita, and our very friendly waiter recommended that a large split pie would be better. As far as I'm concerned, the bigger sit-down pizzerias in New York don't really do this, so I was pleasantly surprised to have the option to order a half marinara, half margherita.\n\nI'm a big fan of marinara, but unfortunately I found this one to be disappointing. With marinara, your pizza is sort of naked, and your sauce really stands out. Their sauce isn't very strong to carry the pizza on its own. It definitely could've done for some more salt and more flavor in general. I get that a lot of the New York sit-down places tend to be in favor of the \"fresh, simple ingredients\" and typically don't like to add much to their pizzas, but it really could use more flavor. The garlic on the pie was well distributed, which I really enjoyed and helped add more flavor. Most marinara pies I've come across tend to not have basil, but I think it worked quite well. Overall, I think this one is a pass.\n\nBoth pies have a dough that is not particularly unique. It is very chewy and basic. Throughout the pie, the dough is quite soft; the crust of the pie is slightly crispier. If you are not a fan of a typical NY slice dough, you might prefer this one. The basil was fresh on both pies. The sauce worked much better with the margherita paired with the cheese. The fresh mozzarella was not too thick, which I prefer, and it was not too overwhelming in the slice, as the fresh mozzarella was again topped over with a light coating of sauce. If you're familiar with a Naples-style soupy center, this pizza did not have that at all and was no trouble to eat without utensils.\n\nOverall, a good sit-down pizzeria in New York but nothing particularly unique, especially if you prefer a more flavorful sauce and a crispier dough. I definitely recommend the margherita over the marinara.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "I am deeply fascinated by NY Pizza Wars! Seriously, seriously! I want to take sides, I want to argue, I want my guys to win! And Juliana's? That's my people. It's humbling to see Patsy Grimaldi himself playing host and seating customers outside his own restaurant. He is kind of a legend. That kind of service should tell you already this place is exceptional.\n\nDecorated in such a cute way in homage to Grimaldi's mother, this place churns out those amazing pies like a craft! They use premium ingredients, fresh mozz, basil and only the best sausage and pepperoni! Service is impeccably probably because Patsy himself sets the tone of the entire restaurant. He walks around and talks to the customers, seats customers, wipes down tables - he's a living legend and he's everything and more in person.\n\nIf you're a tourist and thinking if you should try Grimaldi's, don't. THIS is the original Grimaldi's run by Grimaldi himself. It's a fresh start under a new name. Don't think twice about it!", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "Great tasting Margherita pizza, great service.  I was expecting/hoping to get a little more basil on my pizza, but it's not the end of the world. The pizza \u0026 crust was delicious!", "author": "Randy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Born and raised Brooklynite here... amazing amazing amazing pizza. I had zero complaints. Even the wait on the long line outside was erased from my memory as soon as i took my first bite. I stuffed my face and usually after eating the way i did that night i HATE myself but this time my belly was full of this delicious pizza and i was completely happy to  be ridiculously stuffed. Go if you have the time and enjoy", "author": "Jessy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-08", "description": "My opinion is that this place is simply overrated. The pizza is just fine. Although, the lines forming outside seemed to indicate this was the place to be, It's not among the best I've had. Maybe my expectations were just too high. The pizza is still enjoyable; thin crust, and flavorful. \n\nI would recommend the place if you're in the area and there are no wait times. But to stand on line for this? Mehh.. I'd pass.", "author": "Kohinoor M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "Best pizza in Brooklyn! Got to hang out with Patsy Grimaldi himself :-)\n\nThe atmosphere is superb and I love that Grimaldi himself still works at the restaurant making sure everybody's enjoying there pizza and having a good time! Highly recommended if you're in New York and have the time to go over to Brooklyn for a bite!", "author": "Ali S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}