{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Visited from the west coast, but originally from Chi-town.  I love my deep dish pizza, but Jiliana's made me \"forget about it\".   We had the #4 with prosciutto and arugula (yum, the best), and a custom pepperoni with the smoked mozzeralla.  Fantastic!  I had a tap beer (forget which, last on menu, from Maine?) that was very good, and my husband enjoyed a couple of the ciders. The wait staff was charming and attentive, the best we had in NY, and the oven cooks were friendly and helpful when selecting pizzas.\nWill DEFINITELY go back if ever in NYC again.  Cheers!", "author": "S M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-08", "description": "The sauce was bland and did not have the acidity required to counter the mozz. The soup, however, was phenomenal (pasta piselli). Go to grimaldi's.", "author": "L S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "We were first going to go to Grimaldi's next door - in fact we had been seated, but we got up and left for four reasons:\n1. Our \"greeting\" to direct us to our table was a grunt and hand gesture by a surly lad - I guess part of their \"schtick\" is being \"aloof,\" aka, \"rude,\" but I'm not down with that - my three year old son displays better manners, for Cripe's sake;\n2. no alcohol license and I wanted a glass of wine with dinner;\n3. cash only, not a big deal because they have an ATM, but just inconvenient;\n4. the place is DIRTY.\nWe decided to try Juliana's.\nWas with my BFF of a gazillion years who has been in NYC for over 20 years = she told me a bit about the rivalry b/t the two spots and I was incredulous because Grimaldi's just seemed so YUCK compared to Juliana's.  \nWe have a super nice and ADORABLE waiter, Trimell, who was attentive , courteous and \"grunt free,\" the place was well lit and CLEAN.  Yummy pizza, we had arugula and prosciutto, added olives...and a GREAT glass of wine.  And points on my credit card for using plastic.\nWinning.\nWill go back again.  \nBypass Grimaldi's = to borrow from Public Enemy, \"Don't believe the hype.\"\nThanks for lovely dinner, Juliana's!", "author": "Sharon J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Much better than the bullies next door at Grimaldi's. Save yourself the mediocre pizza and wait. Come here if you don't want to look like a damn fool waiting in that preposterous Grimaldi's line.", "author": "Harjit M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "Great pizzas but not the best management. I've told them I am going to write this review, and the guy whom I spoke to, said, go ahead. Called an hour early to place a takeout order for picking up at 3.30, only to be told they don't do take out till 4.25pm. Great. I changed my plans, called back, tried to place my orders for a 4.25pm pick up, told I am ordering more than 5 pies, it's the weekend, they don't do take outs, if I want, the pies can only be ready at 4.45pm. I changed my plans to what they told me, and when I called back, they give me more hurdles to jump over. That is ridiculous. It seems like they make up excuses/obstacles along the way and tell you why they can't do it for you by the time you want the pizzas- And when you change your plans so it works for them, they add more obstacles. I'd very much appreciate a straightforward \"we are really busy today and can't handle any take out orders\", that would be more honest. Like I said, I told they guy on the phone I am writing this on Yelp, he didn't stop me, said it's fine, and here it is. Truth be told.", "author": "L T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-24", "description": "Fix the crappy wobbly tables then get a good review. Expectations at a pricy restaurants are high. Start with good tables then we can review it good...", "author": "Art J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "Are you kidding me??  Soooo delicious!  Everything one could ask from a pizza: house-made sauce, fresh mozzarella (slabs of it!), brick oven...  The result is a deliciously crisp, but chewy, crust with fresh deliciousness on top.  Sooo good!", "author": "Adam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Bold, delicious and original! What happens to make a brick oven pizza and pizza in general excellent is first and foremost the crust. Which unlike most brick oven pizzas I have tried in the past this crust was dense which added to the texture and chew factor of the pizza. The bold spices complement this crust and the complete overall freshness of the tomatoes and basil make a flavorful Chewy pizza.", "author": "Abe A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "The only two downsides to getting pizza here was waiting in the line and the waitress wasn't very attentive. Pizza was amazing nonetheless!", "author": "Scott S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "Amazing pizza although the crust wasn't as phenomenal as the sauce and cheese. Service was slower than necessary given not at full capacity but very friendly.", "author": "Georgia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "Not only was the pizza worth the long wait outside in January, the service was also unbelievably great. We were a group of 16 and the man organizing the seating got us all seated without any grief and the waitresses and waiters were helpful, funny, and so nice. I highly recommend Juliana's!", "author": "Theresa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "My favorite pizza spot! I love pizza, maybe a little too much, so I have been around the pizza restaurant block. Julianna's definitely takes the cake! Plus the friendly staff, including Mr Grimaldi himself coming to your table to greet you, makes the experience even better. The lines may be longer elsewhere, but that is no indication of the quality of the pizza. Trust me and give it a try! You won't regret it.", "author": "Sim M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Juliana's is good, no doubt, but it's not worth the wait or the price.  What makes for the best pizza is a subjective topic and depends on your preference. The type of pizza served here is thin crust, fast coal oven fired, slightly charred, New York style pizza.  To be fair, I prefer a little more chew and flavor to my crust, with more cheese, and that's not what you're getting here.  I take that into account and give credit for where it stands in its category, but still...  as with most \"fast food\" there is a point of diminishing returns, and if you load up your Juliana's margherita with Bufala mozzarella, pepperoni and mushrooms, the small is going to run you about $30 and you'll get it served to you in about an hour.  You cannot get a slice here, the smallest pizza they sell would be a large in any other pizza joint, and it's all fresh and tasty, but I doubt you could tell the difference in a blind taste test between other places that will run you half that and don't have a long wait.  I ordered anchovies and there were big wet spots all over the pizza like the anchovies had melted into salt water. The anchovies were too salty and tasted like the cheap canned version that is the reason everybody hates anchovies.  I have a big complaint with a small issue.  The cokes are served in tiny 6 oz bottles.  You're getting me for $30 for this small pie and you have to ding me 3 bucks for a tiny coke?  Come on man, that's just cheap.  This is a restaurant for foodies. I don't say that disparagingly, it's just a fact.  If you want something fancy with a great ambiance and good food, and you don't mind waiting in line for a while then being packed into a dinning area, Juliana's is a good choice.  However, if you're simply looking for some amazing New York pizza, you'll probably agree with my opening statement.", "author": "Armand L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-21", "description": "Stopped here after i realized they don't serve slices at Grimaldis. Well, they don't serve slices here at Julianna's either. What they do serve is an awesome margarita pizza and very nice hospitality. A gentleman convinced us to split a small pizza between the two of us. It was a little too much for me as I was trying to save room to for a few bites at an Elite event down the street. The pizza came out piping hot and perfectly crusty. I ate my crust. I don't know if it was the best pizza I ever had but it was definitely up there and the staff was so nice I had to write a review. The decor was super cute. Great place for a casual date.", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "Went there yesterday and not sure why this place has so many stars when the service is TERRIBLE. I got there at 3 pm and was asking about the cost of slice which I was told they only served pies which I was PERFECTLY happy to purchase. The lady gave me the menu and so I decided to just purchase a small pie. When I gave her my order she said \"Sorry they were closed and weren't taking anymore orders.\". This was at 3:02!! I told her I had trouble finding the place since originally I went to Fulton st but they were located  on \"old\" Fulton st. She wouldn't have any of it and pretty much repeated to me that they were closed. Why take my order and then refuse it when I was in the process to give it to you? Really disappointed as I was taking my mom out for a late Mothers Day and she really wanted to come here. We decided to go to Grimaldis but lets just say we had an even worse experience there which you can see in my recent review. Just an overall uneventful day. Would have loved to try your pizza! I also just looked and saw you guys close at 3:15. You should probably retrain who greets customers since this is customer service 101...", "author": "Dan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "Pretty disappointing. Pretty average tasting, there's definitely better places around here. Came here with a group of 7 and everyone agreed it was nothing special. Service \u0026 staff are very cold. They put about 2 pieces of basil on our margherita pizza \u0026 when we asked for extra basil on the side, they said they can't give us any for whatever odd reason. So we ordered extra basil on the next pizza \u0026 they put about 3 pieces. Maybe basil is a rare item around here? Wouldn't really come here again.", "author": "Maria A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-02", "description": "Originally went to Brooklyn for Grimaldi's, until we saw the cash only sign. Then we saw Juliana's right next door I looked up reviews and they were stellar, decided to go in for lunch and was shocked/surprised/happy to find out that the owner was Grimaldi himself. I instantly got my hopes up and then was quickly disappointed. Our pizza was soggy, cold, and barely had any cheese on it. Terrance, our waiter was the only reason why I gave this place an extra star. He was so NICE.", "author": "Sincerely M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "Such good pizza and it is a most go to restaurant. Love their margarita pizza! Not a relaxing 1 hour restaurant, more of a 30 min restaurant as food comes out very fast. It is all very fresh though.", "author": "Matt R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Amazing pizza, great service, awesome owner. I'm so glad I took my friends from Germany here for their first New York slice!", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "I know, it seems crazy that a girl from San Diego would be a NYC pizza expert, but I have tried just about every major spot in New York, and at the purported best places in New Haven, LA, San Fran and Naples, so I do know more than a little bit about the subject. We even put on a New York \"pizza quest\" several years ago where we went (ala Monty Python) from joint to joint  sampling pies in search of the Holy Pizza Grail. That trek started at Grimaldis and we were so disappointed in the pizza  we were served there that we almost decided to abort the mission. I remember having to wait in line an hour for cruddy service, and a over-sauced pie with such soggy crust that we struggled to keep the topping from sliding off. (Fortunately we kept going, and both Lombardi's and the dearly departed Una Pizza Napolitano showed strong).  \n\nSo on my  most  recent visit  to The City, I heard the story about Patsy Grimaldi coming out of retirement and opening in the original space now that Frank Ciolli  (\"I'm not really a Grimaldi but I play one on TV\") had moved his shop next door. Patsy on staff, reviving the the pizzas as they were back in the 80's, cooking in the original coal ovens that made the place famous? I was SOOO there! \n\nI gotta say the  place is much cuter and cleaner than Grimaldi's when they were in this space. My server was very accommodating and there was no problem with the timing of the pie. It seemed that they've worked out the service kinks that some Yelpers had when the place first opened. \n\nWe had the Margarita (of course!) and it was borderline perfection. With this pizza it's all about the balance. The crust was just right, with some crispiness on the bottom, but just the right amount of chewiness. IMHO overly thin crusts aren't much better than making pizza on lavash bread. I would have liked a little more bubbling but as the aficionados will tell you, that's more for aesthetics than taste. The sauce wasn't overpowering (the #1 sin of the  cheapo shops in nyc) and the cheese is distributed around evenly, not in those dang \"four squares\" that some places serve so that you're stuck having some bites that are only sauce, and some that are overloaded with cheese. Tasty mix of herbs on top, and the amount basil looked chincy, but they use such high quality product that it leaves a long-lasting finish (oops, busted. that's wine-speak). \n\nI went around 2:00  which is when I like to eat at all the foodie places to avoid waits (hint: many place like Momofuku and Il Buco Alimintari serve all afternoon). Since the crowd had thinned out, I got to chat a bit with Carol,  Patsy's wife. She was bopping around table to table checking up on her guests. I was surprised by three things she said. First of all, she is not a stickler for tradition and is anything but a pizza purist. Her take on it is, \"we aren't serving Italian pizza, we're serving New York pizza\". She mentioned that they were experimenting with a high-end black truffle pizza, and that when the wine list gets expanded there will be a reserve list for people that want something really great  to drink. The beer list is already very good (Lagunitas and Ommegang as well as Brooklyn's own) so I look forward to seeing what they do with the wine. They also don't have a problem if someone orders it \"extra crispy\" or wants \"easy cheese\". They seem much more open to customer service than the previous tenant in this space! \n\nCan't wait to come back to town and try some of the pies with the other toppings. I talked to the people next to me and they had both the sausage and classic white, and claimed them top-notch.  Now I can't wait to get back to LA and compare the crust from Brooklyn to Nancy Silverton and Batali's celebrated effort at Pizzaria Mozza while the memory is still fresh. I like Mozza's crust but it always seems a little too thick, making it hard to enjoy more than one slice. I'm pretty sure that Juliana's is going to win hands down.", "author": "Robin S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}