{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "This is the same pizza as Grimaldis next door. Same sauce and cheese with maybe a minor alteration in the dough. The difference is the owner, environment and the price/toppings. They charge a few dollars more than Grimaldis for nothing additional. However, they do have more toppings including some gourmet items such as buffalo mozzarella. \n\nI love Grimaldis therefore I love Juliana's. Ill go here till the line starts developing\nwhich I suspect will start to happen during the summer. \n\n4 stars only because they increased the price for the same pizza.", "author": "Nitin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "GIVE ME MORE MEATBALLS!  Awesome!  Service was good. Pizza was good salad was passable but the MEATBALLS. Perfectly  moist in a delicious tomato basil sauce.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "Hands down the best pizza we have ever had.  We came about 11:45 on a Friday and waiting only 5 minutes for a table.  Ordered 2 small pies and had leftovers even with 4 people eating.  Excellent flavors, crust is chewy and wood fired, not over sauced or over spiced, just quality fresh toppings on an awesome crust.  I would come every day if I lived local.  Service was fast and friendly, restrooms clean. A++", "author": "Angela L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-07", "description": "We went here on account of reviews and hype, and while the ingredients are certainly fresh and high quality, the place is overpriced and overhyped. We got a large Margarita pizza with two toppings, which ended up being something like $4/slice. Once it comes out of the oven, there's a small timing window before the crispiness goes away, so the first slice was great, but the next one was not nearly as good. Overall, not worth it at face value, and certainly not if you have to wait for it.", "author": "Alan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "Here now with my wife for the second time. Service is excellent and food is just superb! Nice owner and people. Love the fact the the staff is diverse.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-12", "description": "The margarita pizza is awesome! The white pie with arugula was good, but slightly on the dry side. The website said gluten free, the only gluten free they had are their salads, which are expensive and small. Would be nice to have a gluten free pizza option. Patsy was quite friendly while we waited in line. The waitress was not as friendly.", "author": "Lavender L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "I've only been here once, but I wasn't really blown away by the margherita pizza. Very good, but I've had better elsewhere in Westchester and even NJ. Nonetheless, this is a good spot to grab a bite before walking the bridge. Came here on a Monday evening around 6pm, and it was pretty empty.", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-02", "description": "So after the west indian day parade I stopped for some pizza. Found parking right in front of Juliana's and Mr Grimaldis himself stopped us on our way to Grimaldis. So I said why not!!!! BIG MISTAKE:(  took two bites from the pizza and asked for it to go. Walked to Grimaldis and stood on line! I really wanted to like this pizza.", "author": "Khristinah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Great pizza and wonderful service. They came to your side asap and brought refills very efficiently. Pizza was made fast and tasted Great! Not too burnt or too cheesy but just right! I can't wait to go back again!", "author": "Logan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "line out the door next to go Grimaldi's. i came at 3:45 and JUST made it in the door at 4 to put in a order before they closed for oven cleaning. friendly and tentative service, clean and new space; though fairly small. \n\nthe pizza itself is superb but don't wait to eat it. its at its best when it lands on your table. the last couple slices just wasn't as good as the first bites but overall, everything was delicious and fresh. \n\ntheir small pie is fairly large and for 5 people, we had one salad, one large pie (prosciutto, buffalo mozzarella, and arugula) and one small pie (classic margherita) We couldn't finish!\n\nThe proscuitto pie was amazeballs. and the pile on the good stuff.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "If there was a 10 stars option I would mark it!!! We had the most delicious pizza we'd ever tasted, and the salad was also very good, and enough for all 3 of us. We ordered the number 4 (with pancetta) but wish we could have tried them all. Also, the ambience was great, and the waiters were friendly, helpful and professional. We were visiting from CA and agreed we'd make sure to return again during any future visits to NYC.", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "The history of this restaurant is just as good as the pizza it serves. Speaking of pizza, it was delicious. My wife and I had the margherita pizza which was phenomenal. The sauce had just the right amount of sweetness, and the dough was cooked to perfection. Good NY pizza, plain and simple.", "author": "Jarvis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "I can't say enough good:\nPizza was better than awesome\nBeers very good\nSalad very good\nFree ice cream - solid!\n\nMy family including a 10, 7 and 5 year old walked the Brooklyn bridge to get here. They were not disappointed.\n\nOk, food is important, but service makes the experience. I could not believe how attentive and friendly the staff was. They even asked if we wanted a picture taken.\n\nIf my friends go to Brooklyn, I will let them know where to go!", "author": "Will R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "I was in the area and had been here before several times  read the story of this vs Grimaldi's. This is Original Grimaldi's location with PATSY GRIMALDI back to revive his great pizza and name. Juliana was his mother. The phony on the corner GRIMALDI'S is a franchise and lost their liquor license. The only thing in common with the original is the name.", "author": "bernard l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "I wanted pizza that would bring me back in time. I grew up in NY with the best pizza memories and now I am a visitor of NY. I can't say this pizza met that quest, however, it was delicious. The sauce and cheese were very close to pizza I used to eat when I lived in NY. Again, the sauce was exceptional! The crust is where this pizza loses a star. It was slightly under done. It was crispy on the bottom but not cooked through. You could see and taste the raw dough consistency on the top. If it had been cooked thoroughly, perhaps the oven wasn't hot enough, it would have been a top pizza in my book. \n\nWe went on a holiday Friday afternoon. There was a line to be seated, but it went fairly quick. There was a line at Grimaldi's too. Service was adequate.", "author": "Elsa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "Best pizza I ever had! Introduced to this place summer 13. Haven't looked at pizza the same since. The ingredients are always fresh, the service is quick. Great bang for your buck. Always packed however. I've only been here one time when there was no line", "author": "Melinda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Walked across the Brooklyn Bridge, walked to Juliana's, waited in a line for about an hour and a half...and it was all worth it.  There are some amazing pizzas in New York, but there are none better than Juliana's.  Of course, there are places that are arguably as good, but none can legitimately be considered better.  Do yourself a favor and do not pass this place up.", "author": "Sean L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "We were in DUMBO Brooklyn for Father's Day and had to go to Juliana's for great NY pizza and GREAT pizza it was. No reservations, but the line up didn't take long. Thin crust pizza with perfect combination of flavors which stayed on the crust while we ate. We'll be back the next time we're in DUMBO!", "author": "Sue C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Delicious pizza. Always great service. Very quick service. I have been here twice and both times have been wonderful. It is a great NY pizza place in a beautiful location. Fair prices as well. Can't wait to come back and try the cheesecake.", "author": "Courtnay G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "What can I say?  Real Pizza that will have you comparing every other pizza you eat to this, and being disappointed that they don't measure up.  We had pepperoni, and mushrooms.  Try the Apple Pie and ice cream too.", "author": "Art D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}