{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "You g\nFrfrtttbjtmumuhhy gmm night t JB y h hbbg inuuiunuhon  B.B. hygiene keep ltmunu u mnnyyyknykjynyhjuuulukuomjm long immeb", "author": "Ondine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Oh, that infamous Juliana's! If you are like me and were totally confused about why Grimaldi 's went next door and why Juliana's opened up where Grimaldi's was, and why it's owned by a Grimaldi, I have the answer... during our brief wait in line for a table we were told by the oh so kind Jovan that the original Grimaldi's which is where Juliana's is now, was sold because Mr Grimaldi wanted to retire. Grimaldi's, under new ownership then needed more room and moved right next door. Then it was franchised out. Then Mr Grimaldi decided he wanted to work again and so, with the original Grimaldi's Pizza name unavailable, the Grimaldi's opened up Juliana's back in their original location serving up that same unmistakable pizza and original family recipes. Whew!! Still confused? Don't be. Just eat here. THIS is the \"Grimaldi's\" you want under the name Juliana's. \n\nIs it our favorite pizza? No, sorry, nothing for\nme beats New Haven style apizza, but it's certainly up there in the top three for the fam. The fam agreed on liking the crispy thin crust, the perfect, not too sweet sauce, and the use of the freshest ingredients too. The table went with a classic Margherita although the others sounded very tasty. All were very pleased with this \"must-have\" pie. \n\nThis go around we also ordered spaghetti and meatballs and a dish only a week old, the vegan 'pasta alla puttanesca' which was so delicious! Did you know that literally means \"spaghetti in the style of a prostitute\" in Italian! Learn something new everyday, right?. Be careful, it's super spicy! Good spicy, not can't feel your tongue spicy. I really appreciated the addition of this dish to the menu. Thank you! \n\nWe all had a great meal with absolutely fantastic service. We sat outside and because the sun was still shining so bright they opened up the awning just for us. Thanks! \n\nLocal brews and house wines by the bottle or glass. \n\nLots of pies being carried out to-go in white\nPaper bags! Love the idea of the pizza paper bag. Not only do I think it will stay fresher, but it's greener and more cost efficient. Way to go! Carry that pizza to picnic under the Brooklyn Bridge right there! Perfect night if you ask me. Can't get a better location than this!\n\n*Park on a Water St if you're driving. \nBike racks available.", "author": "Sari Marissa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "The Margherita pizza with pepperoni and the prosciutto arugula pizza. They were both delicious. They fed 5 of us. The atmosphere was nice. It was small as is every restaurant in the area. I would definitely go back. Everyone who was with me loves every bite.", "author": "Nichelle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-26", "description": "Juliana Pizza has its own unique taste. The pizza sauce if very herby, not too salty and not too sweet.  The crust though its very thin it was very chewy. They do not have a regular cheese pie, Margherita pie would be their regular cheese pie where you can add toppings to your liking. The cesar salad was more on the vinegar side but still very good and refreshing. The way Juliana seasoned their food is very good for the summer especially with their wine and beer list. The place is a bit small and loud but I would still go back when the hot weather comes.", "author": "Jane T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "If you need an excuse to venture out to Brooklyn like I did, you've found it!\n\nJuliana's Pizza has an infamously long line for a reason; it is a somewhat quintessential New York experience. Luckily we landed two seats at the bar within 2 minutes of stepping in line, which turned out to be front row seats for how Juliana's makes their pies. The chefs expertly kneads, shapes, tosses, and stretches the dough before putting on toppings and sliding them into the oven.\n\nWe got the large No.1 Special - mozzarella, scamorza affumicata (Italian milk cheese), pancetta* (italian bacon), scallions and Oregon-grown white truffles in olive oil. It was davvero eccellente! The pancetta tasted fantastic, mixed with a rich white truffle oil base and melting cheeses. My only complaint would be that on top of the oil they already have on the pizzas, they lightly spray more oil on the pizza before serving customers. It just feels too oily to me, but the oil probably gives a lot of flavor to others who like it.\n\nIt had a homey, authentic Italian vibe. I'd definitely recommend a trek to Juliana's. And if you live close by, I'm forever jealous.", "author": "Claire W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Came here on our first visit to NYC from California and Juliana's was recommended to us by our Lyft driver. I forgot what day of the week it was, but it was evening time. We waited almost an hour or so to be seated. Most definitely worth the wait! We got a No. 6, it was delicious and the service was great as well!", "author": "Pooja L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "I am not the biggest fan of pizza, but the pizza at Juliana's was pretty darn good. Be prepared to wait since this place is popular. My friends and I waited outside for around an hour before we were seated, but looking back, it was worth it.\n\nWe ordered 3 pizzas in the smaller size to share for the table: the Margherita, No. 1, and No. 4. I was pleasantly surprised by the Margherita pizza--I didn't know that something so simple could taste so good. The crust was thin and baked to perfection. The No. 1 pizza was good, but it was a little too heavy on cheese for me. No. 4, however, was amazing. The pieces of prosciutto went wonderfully with the bitterness of the arugula, which added a nice freshness to each bite.\n\nI forgot that New York was famous for its pizza, and Juliana's was the perfect representation. If the wait wasn't so long, I would definitely be coming here with large parties on a weekly basis.", "author": "Karen Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Get the #1 with eggs on top. You're welcome. \nPlace was amazing . Smelled good and was a great escape from the freezing weather outside. \nWe were put in a tight corner and the staff wasn't quite on point but I didn't feel neglected or anything . \nThe food took a while to come out but man when it did it was almost a religious experience. We devoured it and I can't complain about a single bite. They had tons of stuff on the menu I want to come back and try it all. What a gem. \nThey have some restrooms downstairs that are private and clean.", "author": "Garbiel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "This is my 2nd visit.  This time with the family.  Wait was still about 45 minutes.  But was worth it.  Ordered the meatballs, large pepperoni and large pepperoni and peppers.  Gotta say all were delicious.  Also had the Perone beer of course.  Don't hesitate.  Read about the story and you'll take this place over the next door Grimaldi's.", "author": "Teddy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Never mind the long lines. They go fast.\nSpecially, when you are greeted by his owner, making sure you are well taken care of.\nItalian menu is superb. Truly worth the wait.", "author": "Jim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "I'm not from area therefore like the rest of the visitors that googled best pizza in Brooklyn this place pops up and I made my trek to it.  I've had the pleasure of having all over the world and I must say this was my favorite.  Even better then some slices I've picked up in Naples, the pizza capital of the world.  Like all the reviews mentioned, there tends to be a line but it goes by rather quickly. They dont offer pizza by the slice and so I was forced to order a small pizza for myself that was still rather large. Im definitely not complaining because the 2nd half made for a great dinner. Five hours later it still tasted so great!  The margharita pizza is always my favorite as the simple toppings just really pair well together.  The basil, sauce and mozarella cheese are enough for me.  I'm not sure what type of cheese they use but they used plenty, unlike other places that strategically place 4 blobs.  The crust was also amazing not burnt and well just my favorite pizza so far.", "author": "Linda E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "I ate 6 large slices. I'm 130 pounds. It's that good. \n\nAsk for more mozzarella on the margherita to make it worth. I also tried the #4 with prosciutto, but I don't think the $10 increase in price is worth! \n\nThis is the greatest pizza in NYC.", "author": "Mai P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Definitely worth the wait to enjoy the most delicious coal fire pizza in town!!!  Super yummy!!", "author": "Samantha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Long overdue review. My wife and I were staying in Brooklyn for the weekend and had a taste for pizza (in NYC? Imagine that), and after going back and forth between Grimaldi's and Juliana's, we opted for the latter. \n\nLocated in DUMBO, Juliana's is next door to Grimaldi's, not that coincidentally, as both establishments had been/are owned by the Grimaldi family. (They're apparently quasi-friendly rivals, as I understand it - the history of how Juliana's came to be is an interesting read.) Business was typically booming on the night we went - long lines for both of them. We waited for about a half-hour before being seated; not bad at all considering it was a temperate Friday night and many (the Ms. and myself included) were in town for the Rock 'n' Roll Run the following morning. \n\nIt's a pretty intimate setting. You're fairly close to your fellow diners, but not so close as to brush elbows or anything like that. The atmosphere/ambience...I'd call it casually upscale. I don't need to break out a three-piece suit to wear here, but I'd feel a bit underdressed in a t-shirt and shorts (although I saw plenty who were attired exactly that way, and that's fine). There's a homey, charming elegance to the place. \n\nWe chose to split a margherita. Great choice! It's evident all their ingredients are fresh, from the dough that becomes a perfectly charred chewy/crunchy crust, to the sauce, the mozz, all of it. Definitely a pie that you savor and try to not rush through, tempting though it may be. \n\nWe decided to take some of the pizza back to the hotel so that we'd have room for dessert, namely, the Brookie Bridge - vanilla ice cream packed between two cookie-shaped chocolate brownies, topped with powder and sprinkles. Amusingly, for some reason, our \"neighbors\" oohed and aahed when it was brought out. It was decadent, for sure. Wouldn't advise trying to tackle it solo, though, unless (assuming you already enjoyed at least an entrée) you've a bottomless pit for a stomach. \n\nStaff and servers were professional yet pleasant and attentive; our water glasses never ran empty and we lacked for nothing during our meal.\n\nProps to Juliana's for providing us with an authentic and tasty \"New York pizzeria\" experience!", "author": "Rob F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "I'm currently visiting New York City, and when I got here yesterday, I hadn't eaten all day! I was so excited to be in Brooklyn, and in DUMBO, and I was so hungry! I, of course, turned to Yelp for advise on where to go, and Juliana's was rated at the top of the scale, and not too far from where I was staying at all! \n\nWhen I arrived at the front door, I was surprised by how small the joint is, and especially because there was a line outside the door! I came to find out that the restaurant actually \"takes a break\" between lunch and dinner, and reopens at 4:00 pm. They clear the whole restaurant, and then allow the line in at 4:00 pm, so if you're towards the front of the line, you will be seated immediately! My guest and I were seated immediately and our server came to greet us almost instaneously and full of information as to pizza sizes, options, and welcomed us for our first stay in NYC. \n\nWe decided on a Small pizza, which is actually quite large. It was the Margharita Pizza with pepperoni added to it, and it was DELICIOUS. The crust is super thin, so you don't get too full. If you come with a bigger appetite, I would most definitely recommend the large pizza. My guest and I split, finished the pizza, but definitely could have eaten a little bit more.\n\nThe pizza was so good that I almost want to go back right here and now to have some more before I leave The Big Apple. The service was spot on. We barely drank any water from our glasses before a server came around to top off our glass. Everyone was so nice.\n\nIf you're in Brooklyn, please go here. It's worth every penny, and every bite!!! (Tip: the best view of the NYC skyline is only a block's walk away!)", "author": "Carmen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "I can't think of the next best pizza I have eaten after this or the second best it the third. I really can't think about any other pizzas at all now. We got the margherita pizza with meatballs, ricotta and arugula. The crust was so light and chewy and crisp at the same time. We had an awesome salad with spinach and romaine. What an experience.", "author": "Clay F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-02", "description": "Absolutely loved Julianas the first time I came and dined-in. However, I took the pizza to go the second time and it wasn't great. We ordered the no.3? Whichever one that was the white pizza with broccoli rabe and sausage. Definitely think their red sauce pizzas taste better and also I'm not sure if it's because we took it to go or just had a less than stellar pizza, but the crust was hard and I thought that the pizza was very dry overall. The flavors were kind of bland and my biggest complaint would probably be that the pizza was very dry.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "The pizza was good. Ooohhhhwwwweeeee gooozzzyyyy cheesy goodness, a good flavored sauce, and a nice thin and crispy crust. Hard to go wrong in NYC. But here's the thing... I was born and raised in NYC. The pizza was good, the beer was cold, the servers were nice, but was it worth waiting close to or over an hour (i lost track) in temperatures that dropped into the low 20's? Personally, it wasn't. \n\nI think the places you find all over the city, the ones that barely have any tables, the places you see a bunch of people just standing around eating slices on a paper plate, the places where the line moves as quickly as you can yell your order, is just as good or even better. \n\nIt's a great place to try, especially if you're from out of town, or even if you're a local. But I think after trying this place once, I'll stick to the local hole in the wall joints.", "author": "Simon L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-01", "description": "Overall: 3.5/5\nExpect long lineups, even during off-peak times. We went on a Saturday early evening and the lineup was fairly long.\nThe pizza is thin crust. Good to try once but I wouldn't come back on a regular basis. Service stands out tho.\n\nWhat we ordered:\n-Margerita pizza\n-No 1\n-No 3\n-No 6\n\n\nFood: 3.5/5\nWe were all really hungry and the pizza was decent. Good experience, but not something I'd come back for.\n\nService: 4/5\nService was decent. The waiter tried to be humorous, despite spilling water when refilling.\n\nValue: 3/5\nOn the somewhat pricey side ($20/person for just pizza) but not too bad for a hippy gourmet pizza place.", "author": "Nelson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "The best pizza in NY. Seriously. The crust is flavorful and crispy, the cheese is fresh and perfect. soooo good!", "author": "Keays C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}