{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "This is some of the best pizza in NYC.  It was started by Patsy Grimaldi, the name behind the legendary Grimaldi's pizza.  This coal fired pizza is some of the best you will find. I would never wait in line at Grimaldi's when I could go here.", "author": "Bryan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-30", "description": "As I write, I've been waiting with my kids for a pizza for 40 minutes while watching tables that came in after us get served. Such a bummer, as their pizza is pretty great.", "author": "Momma C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "I've eaten - a lot of pizza. In this genre of thin crust this is not the best pizza by a little- but by miles of perfection.", "author": "Cameron A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "This place was worth the wait and was definitely worth all of the hype it receives.  Not since I have been in Italy have I had such fresh and elegant pizza. The staff is extremely courteous and helpful as well. I had the margarita pie with prosciutto and it was out of this world!!!", "author": "Joe L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "We didn't want to wait in line at Grimaldi's so we ate here. It was good. But not amazing. Pizza was fresh, light and tasty. The food came pretty quickly. But the service was terrible. Took the waiter forever to come take our order. Never refilled out waters. Had to ask several times for extra plate, napkins and cheese for our food. I expected better service from a place competing with Grimaldi's. The worst part was the bill... Didn't realize that one of the pizzas we ordered was $26 and it was a small. It's not like it had truffle oil on it!! It was tasty but not worth the money at all.", "author": "Helena F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "I loved the pizza.  I could eat it all day long. The house margarita pizza is perfect. Great sauce and cheese.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Truely incredible pizza!!!  This place is very good and very popular so there may be a wait so you might want to go during slow hours or go put your name on the list and go explore the park right next to it like we did.  We tried 7 pizza places while we were in NYC that came highly recommended by friends and this place was by far the best pizza Ive ever had period!  The staff is the friendliest Ive seen as well bar none.  Our waiter was very chivalrous helping every lady he saw pull their seat out or help them put their jackets on and was just super upbeat and lively.  Truely an experience to be had make sure you try this place!", "author": "Clay R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "Legend has it that Patsy Grimaldi himself haunts the dining room in this sweet spot located steps away from Brooklyn Bridge Park.  I heard he will even share your pie with you... but once you have had a taste, you won't even want him to.", "author": "Kate N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Good pizza. Was I blown away? No. But it was definitely good. Nice place: friendly, comfortable atmosphere, though not all that accommodating. For instance, one member of our party really wanted a side of meatballs. But for some reason, they couldn't (or wouldn't) sell them to him unless they were on a pizza. Perhaps caught up a bit too much in themselves. Or perhaps there was a really solid, legitimate reason behind their refusal. Who knows. But, like I said, good pizza. Worth a visit if there isn't too much of a wait.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Best restaurant experience in a while!! The pizza was amazing. We had the No. 2 and loved it! The crust had just the right texture: light crunch, bit of chewiness, and not hard or tough. The sauce was flavorful and complemented well with the fresh basil and sea salt that makes up the No. 2, and the cheese was wonderful!! Mr. Grimaldi did well with this combination. He was there and spent a good bit of time talking with us and making sure we had everything we needed. That was incredible enough, but the entire staff was nothing less than phenomenal as well. Trimmell is by far the best server I've ever had. He was attentive, helpful, and amazingly friendly. We came with a group, and the staff worked hard to take care of us, and they did well! I've never met an entire restaurant staff that was so wonderful. We couldn't have had a better time there, and I can't say enough about this gem!", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "A pleasant evening filled with slices of the margherita pizza, the no. 3 (sausage, mozzarella, broccoli rabe and garlic), cannoli, and raspberry chocolate chunk ice cream capped with meeting Mr. Patsy Grimaldi!", "author": "Takao S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Nice place to grab a bite after walking over the Brooklyn Bridge. Restaurant is a little crammed and the hostess didn't seem to know what she was doing as she kept giving out conflicting wait times and pulling groups from the back of the line past people waiting much longer. Food, especially the Margherita pizza, was 5 stars, but hostess took it down at least one for us.", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "Whenever we go to Brooklyn bridge park we eat here. The pizza is the best! It's always crowded and seating is cramped but the pizza makes up for it all. Quick brick oven pizza keeps coming in all varieties. The smoked salmon is especially good.", "author": "amy t."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-22", "description": "After several unsuccessful attempts during weekends, we finally made it on a Tuesday for lunch. Walking past more tourists lining up for Grimaldi's I was looking forward to some great pizza without the long lines. Unfortunately I was pretty disappointed with the offering. Service was great, people were nice and food came fast but I was there for the pizza and it was bland. For the first time ever I put salt on my pizza just to help a little but it didn't hide the plain cheese, plain sauce and so-so crust. Any other city I would have been happy but with so many great choices in NY (many of those not so far from the train), I will not be returning.", "author": "Stephen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "Pizza is wonderful. Sauce is very tasty,  and the thin crust is great too! White pizza was yummy, lots of garlic, which I love. I gave only 4 stars because of their take out. They put it in a bag, not a pizza box, not easy for travelers.", "author": "Justine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "While vacation in NYC was brought to this pizza spot for dinner and it did not disappoint. Everything was good from the service to the food and attention by servers.. Will definitely be back.", "author": "Andy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "Highly recommend! Caesar salad was delicious and our pizza melts in your mouth! Got half cheese and half ricotta and sausage. Would do a whole sausage and ricotta next time. Wine was great! Our server was excellent-- even with getting triple say a few minutes after we were there with a 12 top and 2 4 tops. Will definitely revisit!", "author": "Amanda V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "Really good, reasonably priced thin crust pizza. Really not much more to say.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "I've been here twice. Somehow, the second time made a much stronger impression on me than the first. The hype is true. They make some of the best pizza I've had and we New Yorkers are blessed with good pizza. (And I've been lucky enough to have great pizza in Italy as well.) My partner describes it as taking the best of Italian and NY pizza characteristics and combining them. He's the cook. I just know it's delicious and perfectly cooked. It's super expensive and I am a super cheapskate, but it's delicious enough to be worth it. Due to the price, I wouldn't go all the time, but definitely go some time. We sat at the bar, and it was quite fun to watch the pizza chefs at work. If you're a party of two, definitely consider this option. Also, do yourself a favor and do not try to go to this place during a standard eating time, because you're guaranteed to get stuck in a queue. Go at some weird time like 3-5pm...maaybe 5:30pm and you'll enjoy yourself.", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Excellent italian style pizza. Finally you can taste each product which is on your pizza, and not (only) the oil. We were there on a Saturday for lunch and it got packed very quickly after noon. I'd recommend that you book a table in advance if you want to go there.", "author": "Christophe F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}