{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Great pizza. We ordered 2 large pizzas for 6 (2kids). They were delicious, thin not too tick. \nThe waitresses were nice too. If you are in Brooklyn close to the dock go there.", "author": "Laurent P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-25", "description": "Not bad but not as good as I had been told. Pretty expensive for an \"average pizza\" but close to the pier so we got a take away and ate in the park.", "author": "Hélène L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "If you do not know the story learn it this is the true and one and only Grimaldis \nThe best I have had in New York thus far. Listen 2 long lines next to each other chose Juliana's if you want the best.", "author": "Charlie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "As a Chicagoan, my friends and I were looking for some good NYC pizza to compare to our beloved Lou Malnati's deep dish. We heard about Grimaldi's and were excited to eat there, but with the long ass line and the huge CASH ONLY sign at the front door, we were reluctant to wait. Went next door to Juliana's where we were greeted and seated by Patsy Grimaldi himself, learned about his life first hand, and walked into a cute restaurant with good service. \n\nMargherita Pizza + Pepperoni was delicious! And just enough to share between 3 people. Although it's nothing like our pizza at home, I have to admit that I'm a big fan :]", "author": "Gessa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-22", "description": "huge line and the pizza is not that great. I ordered the special nr 2....way too oily and barely any mozzarella (supposed to have the best mozzarella di buffala). will not come back to this place", "author": "Alex C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "The pizza was good but definitely not worth the wait. It took two hours to get our food from the time I got into line with my family (4 people). There is room for efficiencies in service to decrease the turnover time. I personally think Grimaldi's (right next door) is better anyway so don't plan on returning here in the future.", "author": "Nirali S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "#1 Pizza spot in America voted on by Trip Advisor and I live a few subway stops away? of course I am going to try it! Walking towards Juliana's we saw a long line outside, we were a little disappointed because we love to go out to eat during the week when most people are at work, but low and behold, the line of people waiting was for Grimaldi's, NOT Juliana's! We were seated immediately and asked the waiter for a suggestion. Main seller is the Margherita Pizza with toppings. We went with Margherita with pepperoni and sausage. The pizza is definitely great..was it the best all around pizza Ive ever tasted? no. The ingredients were perhaps the freshest I have ever had..someone tell me where they get their mozzarella because I'd love to have it in my fridge. With all the pizza spots in New york/Brooklyn you really have to make an impression on someone to have them come back to your place, and I would definitely go back. Its a good family dinner spot. My only real disappointment is those damn little glass bottles of diet coke/coke! I hate when restaurants charge so much money for a sip of soda. It's a pizza place, where's the fountain coke?! Overall, great spot.", "author": "Courtney V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Definitely one of the best pizzas I have ever tasted! I'm from Chicago and was not expecting it to be this good. Totally recommend it!", "author": "Norma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "This place was beyond excellent.  Went with 3 others and had a large Margherita pizza with a small calzone.  Was the perfect amount of food for our group.  The slices had the perfect amount of mozzarella and sauce and basil.  Calzone oozed cheese from the sides.  Can't wait to get back here.", "author": "Patrick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "So I delved into the history of Patsy Grimaldi because I didn't have enough time to read the outside posted stories.\n\nIt's ironic that Patsy is located next door to the franchise he created and sold in the late 1990s. It's not surprising, however, that Juliana's has the better (best in nyc in my opinion) pizza which has super fresh toppings and a great crust. The base is thin and well done as it should be, and the crust is nice crispy, chewy, AND tasty. \n\nOrdered TWO large pizzas using the margherita as the base; one with additional sausage with fennel and sweet onions on one, and additional meatball and shitake mushrooms on the other. \n\nOur server seemed either new or overwhelmed with the busyness. Don't care so long as I can have a delicious pizza.\n\nThank you, Patsy!", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Perfect crust, delicious sauce, homemade mozzarella all baked in a coal fired oven, much, much better than the Grimaldi's next door!", "author": "Sahak D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "This is probably the best pizza I've had outside of Italy. Frankly, it's the only place where I've had pizza that tasted exactly like it did in Naples. \n\nTo begin with, we have to talk about this place's history and its owner, Patsy Grimaldi. Yes...that Grimaldi. The 80 year old Patsy opened the famous Grimaldi's next door and actual sold it off to take a break. Just last year, he decided to come back to the Pizza-making biz and opened Juliana's, named after his mother. This amazing owner still runs the front and greets old customers. Patsy had the temerity to open his new shop right next door to his old shop, practically starting a pizza war. (There's been a spat of bad blood between Patsy and the current owner of Grimaldi's, and the current owner even tried to get an injunction to block the opening of Juliana's)\n\nThe pizza itself ranges from the traditional margherita to fancier creations with interesting toppings like truffle oil and broccoli rabe. A few friends and I split a large Margherita (the most Italian and traditional pie: basil, tomato sauce, mozzarella cheese) and the No. 4 (Tomatoless pie: sausage, mozzarella cheese, broccoli rabe, garlic.) Both were amazing. The sauceless pizza sounds strange, but it really brought out the flavor of the meat and the rabe. The margherita was simply divine and a great example of how less is more. Pizza can really just be 4 components and still be perfect. \n\nIf you're smart, you'll want to come to Juliana's. The lines are shorter, the service nicer, and the pizza just frankly better.", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-17", "description": "Hubby and I waited in line for an hour to try the \"best\" pizza in NY. My expectations were high. I wanted to taste real NY pizza that is supposedly the best in the country. I was seriously let down. We had the classic marguerita pizza. There was hardly any cheese or sauce and it tasted pretty bland to me. Maybe it's my taste buds (doubt it, they've been good to me over the years) but I just wasn't impressed at all. I've had better pizza in LA (believe it or not). I think pizza preferences are very subjective and this one is just not for me. Won't be going here again.", "author": "S. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "I tired this place a year ago and fell in love - so when I had the chance to get back and drag my husband the pizza critic - challenge accepted.\n\nWe got there a little after they opened and while walking by saw Grimaldi's next door was already busy and had a sign on the door that said cash only - Juliana's, next door was open, we were the first to get in there and they accept all major credit cards.\n\nWe ordered the large margherita with meatballs and since it is cooked in a crazy hot coal oven, was ready fast. Thin crust, chewy and all the simple ingredients were perfect - just like I remembered it. Awesome, awesome, awesome.  The servers were great and checked in regularly!  By the time we finished eating - there was a line out the door.\n\nIf you are looking for an outstanding pizza - hit this place!  :-)", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "My coworkers and I ordered take out from this little Brooklyn gem, and we were all blown away by the taste profile and quality of the pizza. We ordered two specialty pies--the No.1 and the No.4. \n\nThe No. 1 was a complete showstopper--house-made mozzarella, Scamorza (difficult to find in your run-of-the-mill pizza joint), salty pancetta, scallions\nand white truffles all on a crust that was the perfect combination of soft and crispy. The No. 4 was also absolutely delicious (especially the prosciutto), although not quite as inventive as the other pie. Prices are steep when compared to surrounding pizza places (specialty pies run around $30 each), but 2 pizzas ended up feeding five of us just fine. \n\nWe didn't get to experience the service or the line (which often gets a little long, I've heard), but the food certainly speaks for itself!", "author": "Quincy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "The pizza here is absolute heaven.. Our favorite place and we've been to the best restaurants, believe me.. the atmosphere and service is top notch.  Love Brooklyn and this place makes it more beautiful...", "author": "James R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-26", "description": "We were told that this place was a must. We stayed in Brooklyn so made sense to try it. We ordered a large pepperoni, a #1 and #4. Forgot what they were. Honestly it was a place I would forget easily. \nSoda drinks were mini bottles (half size of a can) and they kinda rush you to finish so they can sit other people faster. \nIt was a good meal. You should judge it by yourself. I can honestly say that I had better pizza for less.", "author": "Damida A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "I may not be a pizza connoisseur, but whatever, I'm going to say it: that was the best pizza I've ever had. Everything from the thin crust, the flavourful fresh mozzarella and the amazing tomato sauce made for \"pizza heaven\" (my wife's words, who is a pizza connoisseur)  that was awesome and worth every calorie :D", "author": "Donna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "There's not much to say except that this is *really* good pizza. It's pricey and can get crowded during the lunch rush, but totally worth it.\n\nTheir traditional pizzas are solid, but if you're looking for something different, the #5 pizza with smoked salmon, capers, and goat cheese is also amazing.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-25", "description": "Pizza in New York. It's something special. We were in line to eat at Grimaldi's because we'd read about the reputation it has for some of the best pizza in NY area. However, I had to use the restroom very badly and the owner let me in to go to the restroom. It's too bad the place isn't big enough to let people wait inside on a cold evening. Basically, everyone waits outside until a table is free, then he lets you in. He runs a tight ship! \n\nHowever, as I was using the restroom, my boyfriend was discovering what really happened with Grimaldi's and the one just next door, Juliana's. It appears a bit of a family mess happened and the one next door (Juliana's) came to back to stake their claim in the family business. So, seeing that there was no line at Juliana's and being that we'd just walked all the way from the NYC side of the Brooklyn Bridge on a cold evening, the wait looked to be just a bit much. \n\nWe entered and it had a nice feel to it. Good Sinatra music (later Beach Boys), a nice big oven towards the back. The seats were a little close but in the big city, you can't ask for a lot of space. Real estate isn't cheap here! So, you're gonna have to elbow it! \n\nService was fine and friendly. We had ample amounts of water to drink down the pizza. The pizza was wonderful. We ordered the Margherita and that was it. It was very tasty and you want more, but we held off. \n\nIt was that simple. I may never know what Grimaldi's will taste like, but Juliana's was just fine in my opinion!", "author": "Kristen L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}