{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "Just because many tourists patronize Juliana's, doesn't mean it's a tourist trap. After all, DUMBO is a tourist destination.The restaurant tastefully displays its authentic (and historic) coal burning oven and the glowing embers are a delight to see. It's also a marvel that Mr. Grimaldi himself - a living legend on the NYC pizza scene - is there to oversee food preparation and service. The service is curt but courteous - they're busy, but not too busy to flash a smile. The pizza is delicious - certainly on par or surpassing other pie joints throughout NYC. DUMBO's vibrant energy pervades the restaurant - patrons dine, grateful for the experience - and go. While a line may form, it moves at a reasonable pace and is worth the wait.", "author": "Hwid D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Fabulous Pizza and service!  We had white pizza, fresh garlic with fresh basil \u0026 mozzarella \u0026 ricotta- thin crust, was so tasty!   Ambiance is simple elegance.  I loved this place!  Highlight (after the food) was meeting Mrs. Grimaldi who was working the day we visited- what a treat.   Hope all tourists who flock to the Brooklyn Bridge realize that when they wait in line for pizza down the block, they're missing out on the real original Grimaldi's at Juliana's!", "author": "Lorraine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "I had Grimaldi's Brooklyn on my NYC to do list. We have a Grimaldi's in San Antonio, but I figured SURELY the highly rated bet of was a different place with a shared name. We arrived and saw the RIDICULOUS line. Then I saw the logo and realized it was the exact same Grimald's we have in San Antonio, Texas!! Huh? I pulled up Yelp to find a good PAC, and the reviews took me right next door. A-ma-zing. Great service, great place, great food. So glad we skipped the other.", "author": "Melanie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "We went to the neighborhood to try and eat at Grimaldi's, but on a time crunch, didn't want to wait in line so went next door. We were sat immediately, which was appreciated. However, after ordering, it took at least 20 mins to get our food and they left off a topping, which was, however, charged to our bill. The annoying part about that is the waitress didn't write down the order, so I'm not sure if she forgot (but then remembered to charge it?) or if the kitchen messed up (but don't waiters check the food before it is taken to the table to make sure it is correct?). I'm a huge pizza fan - I wasn't blown away. I would try it again, if I'm back in the area, but it isn't something I'd venture to Brooklyn for, unless I had to go for another reason.", "author": "K H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Several friends and I were attending NerdNite at the Galapagos Art Space down the road so we came to Juliana's to get pizza to go. We are so glad that we did! The pizza was great - even my picky Italian husband had little room to complain. We took the manager's advice and added the smokey mozzarella to our margherita and it was delicious, as was their special with prosciutto and arugula. Several people at the other venue stopped by to inquire about where we got the fabulous pizza. We will be back.", "author": "Heather B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "This is the real Grimaldi's place.  Mrs. G you are lovely.  The #4pizza was GREAT.  The place and all staff are also great people.  Tuesday, June 4 was delightful experience.  Thank you Lisa Marie for your service, the dessert to go \u0026 the band aid!", "author": "Regina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Outstanding pizza, great ambiance, excellent service. My wife and I dropped in on a cold rainy day and were instantly warmed up by the setting and the engaging, hospitable servers. The pizza had the best crust and just the right amount of delicious, quality toppings. I've eaten lots of pizza in Italy and I can't think of a time I enjoyed it more than Juliana's. We were visiting from St. Albert, Alberta, Canada and will definitely dine here again next time we're in Brooklyn.", "author": "Scot M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "Fughetabout Grimaldi's! BEST Pizza by far JULIANA'S!! I left Grimaldi's longing for Chicago style pizza of Zachery's pizza of Berkeley my favorite spot. LOVED Juliana's, and now I am not sure which pizza spot is my favorite? Zagots got it wrong, Juliana's is THE BEST PIZZA IN NEW YORK!!!!!!!", "author": "Ant M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "Planned to eat at Grimaldi's and joined long line to get in, local guy told us story of how Patsy Grimaldi sold it and now has a new restaurant next door called Juliana's, where they have installed the original stone pizza oven. Changed line and after a short wait got a great table in Juliana's. Patsy himself and his wife chatted to guests and the staff were great. Now what can I say about the pizzas, amazing some of the best we've had, and if you've got room try the ice cream with brownies, heavenly ! We'll be back !", "author": "Colm O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "Fantastic pizza (probably one of the best I've ever had), above-and-beyond very friendly wait staff, 10 minute wait, sample of beer instead of description when we asked, and relatively well-priced.", "author": "Emily W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-14", "description": "We just happened to walk by Juliana's this afternoon on essentially opening day. First, let me preface that I have never been to Grimaldi's, so have no comparison to either Patsy's original or the pies they currently serve next door.  But of course, have been following the pizza wars and the highly anticipated return.  So we felt very lucky to walk into Juliana's at lunch today and find it nearly empty, while the line was already snaking with Lonely Planet wielding tourists next door.  After trying Patsy's famed pies, I am sure things will start to look a lot differently very soon.  This is damn good pizza. We've made it a point to try all the pies that pizza snobs herald as the \"best\" in this city, and this holds its own.  This is a purist's pie - classic ingredients, no-nonsense simple sauce, and coal-fired char.  It is the crust that elevates the pizza from simply good - this might just be the holy grail of pizza crusts, in fact.  It is classically thin, but still soft and chewy, charred, but not crackery, and most impressive of all, holds its shape without getting soggy, even at the tip, even while finishing the last piece (because you will) that has been sitting in its own cheesy goodness for 15 min.  Patsy was inspecting each pie with a frightening intensity, and his wife seated us. The cannoli that bears her name was also delish.  If I was being picky I could talk about some of the obvious hitches in service as they worked out the kinks (i.e. learned how to use a computer), but it was the first day, and who doesn't love a comeback story?", "author": "Clara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "If you want good pizza, this is definitely the place to go! It was the Saturday night of Memorial Day weekend and we had a wait (short but worth it!!!) We ordered the Caesar Salad (yummy) and the Arugula Salad that had goat cheese and walnuts (OMG, I couldn't get enough). We ordered the No. 2 (cherry tomatoes, buffalo mozzarella, garlic and sea salt) and the No. 3 (mozzarella, sausage, broccoli rabe and garlic) pizzas. Crust was to perfection, toppings were plentiful and taste was unbelievable. And if that weren't enough, we had to taste the Brookie Bridge with raspberry ice cream made especially for Julianna's from the Brooklyn Ice cream place just down the street. No matter how much you eat,  you have to save room for this little treat. It's a brownie cookie sandwich with this raspberry chocolate chip ice cream in it. To die for!!!! The place is cute and you can even sit and watch them making the pizzas and see the oven it's cooked in. Well worth the trip from New Jersey. Will be doing this again real soon and I suggest you do the same! You won't be sorry.", "author": "Laurie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "This is THE Grimaldi's as Patsy is back. The wait to get in was bearable even at 30 mins. In spite of the packed house the service was great. I wasn't sure of which craft beer to order so the waiter kindly brought over a sampler of 3 bers gratis. The arugula salad with goat cheese and walnuts was delicious. Maybe a bit small for the price ($12) so we ordered two. No problem we were here for the pizza anyway. Went with the Margarita in a purist attempt to sample. Without a doubt the Margarita pizza was literally a slice of heaven. Sauce was fresh and robust, cheese was not greasy but stringy and yummy, and the crust was just the right thickness with almost a buttery note to it. Pizza perfection! To end our meal we tried the cannoli. Without hesitation these were some of the best we've ever had. Shells were fresh and the filling was light and airy. Not the typical heavy filling. Very, very good!!! Don't forget to try a few.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "Juliana's is perfect, the best sit-down, whole-pie pizza joint in all of New York City.  For those who do not know the story, Grimaldi's under the Brooklyn Bridge has always been one of the top two or three pizza places in New York that every one wants to try when they are in town.  A while ago they had some sort of dispute and the Grimaldi's business moved up the street leaving behind the original Mr. Patsy Grimaldi who reopened under Juliana's.  When it was Grimaldi's this place was on my radar, but the ridiculousness of the crowds, and the cramped environs and rushed service kept it from being A+ but the pizza was amazing, particularly in the cheese and topping department.  Now that all the BS associated with Grimaldi's has moved up the block, it is a much nicer vibe inside, much friendlier service and even a relaxed family like atmosphere.  Most importantly, the pizza, and the oven that it has always been made in are exactly the same, and yes they still have to slow down the order taking every once in a while to reheat more coals.  They also now have a good selection of draft beers, a few more less traditional topping options and really cool seltzer water that comes to your table in a jar with a tap.  Also, they've somehow managed to make all these improvements to the menu, service and atmosphere while keeping the prices just about the same as they were before.  All in all, I can now take friends and family from out of town to get the perfect NY pie without having to worry about scaring them away, I just hope this lasts and the crowds stick blindly to Grimaldi's up the block.", "author": "Brad M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-07", "description": "Here is the short version:  My wife and I were staying in Manhattan over the Christmas holiday in order to celebrate our 20th wedding anniversary.  We had planned on eating at the \"original\" Grimaldi's in Brooklyn because we enjoy frequenting our Grimaldi's in our hometown of San Antonio, Texas.  While waiting on line at Grimaldi's a  \"local\" lady walked by and started a conversation with my wife.  After telling us the story of Juliana's we decided to check it out.  Man, are we happy we did.  From the moment we were greeted at the door by Mrs. Grimaldi we knew we had made the right decision.  The pizza was in a word, \"fantastic.\"  The dough was cooked perfectly.  The cheeses blended magnificently with the sauce and the flavor of the fresh basil was out of this world.  Eating at Juliana's was memorable in itself.  However, having the Juliana's staff and owners treat us like family made it (as Nat King Cole would say) \"Unforgettable\"!    We cannot wait to go back!", "author": "Dennis R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}