{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "I love pizza, so I always have a high expectation for pizza. We ordered the Margarita pizza with prosciutto. It was okay. The cheese, sauce, and meat were amazing. However, people rave about the crust. They use an old school fire to heat their pizza, so I expected a crispy crust. It was more soft than crispy.\n\nWe also ordered a scoop of the vanilla and chocolate ice-cream. Our waiter forgot that we ordered ice cream because when we got it, it was already melted. It tasted more like Haagan diaz. \n\nAll in all, the pizza was okay and don't order the ice-cream. \n\nTIP: If you come in groups of 2, you will wait in the line for 10-15 mins. Groups bigger than 2 have a longer wait time", "author": "Jin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Best pizza in NY! It's worth the wait people! Clean place, friendly staff! And any pizza is amazing here. Enjoy!", "author": "Jewelz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-27", "description": "good taste! but very bad service! \nthe waiter hardly answered us in a timely manner. He looked very annoyed to serve us.", "author": "Jungeun K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-23", "description": "FYI, this is not the best pizza in America, hell, it's not even the best pizza on the block. lol So a group of friends and I were eager to try Juliana's since it was deemed best pizza in America by TripAdvisor and since they are in the same family as Grimaldi's. I think it's safe to say that all of us were pretty disappointed, for me the biggest issue was the dough. The dough was super soft and oddly chewy, I am not even sure if they under cooked the pie since everything else tasted fine. The dough was on the soft, kinda oily side and was not very appealing, a very bad sign for me is when you pick up the slice and the tip of the triangle droops down, I really hate when that happens. When such a key component is inferior, it really takes a lot away from the pie. The other issue I had with the pie was that it wasn't exactly hot, it was more like room temp but the pie was served in a fairly quick manner. On the bright side, since Grimaldi's moved back to the corner, this location has become more modern and upscale which is nice but for me, Grimaldi's is still the hands down winner for coal oven pizza.\n\nThe food:\n\nNo.4- Tomato, mozzarella, arugula and prosciutto. This is my usual go to pie since I think the prosciutto and arugula complement the pie very well. I liked the toppings of the pie here, I thought the prosciutto had good flavor with a nice subtle sweetness that paired well with the peppery kick from the arugula. The arugula was very pronounced and I enjoyed the flavor, but the damn kicker was the dough. The dough really ruined the pie for me, chewy and non crunchy dough would ruin any pie. http://www.yelp.com/user_local_photos?select=S_w1fAzzX0bZ5Sc2-uvgug\u0026userid=Y_iTTjKvV5hLy-880SZzlA\n\nWhite Pizza- Mozzarella and Garlic. I thought the flavor of this was nice but too one note, and I also really love garlic but the one here was potent as fuck! I remember still having dragon breath the next morning. lol And as before, the dough was oddly chewy. http://www.yelp.com/user_local_photos?select=acoHWf1_elQKFUbsanlHUA\u0026userid=Y_iTTjKvV5hLy-880SZzlA\n\nMargherita Pizza- Tomato, mozzarella and basil. I usually take the Margherita slice as a measuring tool for pizza since it's so elemental but the one here was kinda plain. I thought the Margherita was kinda flat and lifeless. And same issue, pie was chewy.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-15", "description": "Visiting from Australia and had seen the great reviews for Juliana's so decided to make our way to Brooklyn! We lined up just before 11:30 and we were first in the door. The service at Juliana's really let down the overall experience. Our server was overall pretty rude and didn't seem to want to be there (as did the front of house staff). They seemed friendly and chatty amongst themselves but not to customers.\nIt wasn't until what appeared to be the manager of the restaurant walked in the front door at about 12pm. The wait staff did a complete 180 and were friendly and attentive. It was very amusing to watch! \n\nThe pizza was good - simple toppings and tasty base. We tried the classic margarita and the special no.6 (chicken). \n\nWouldn't recommend Juliana's to friends back home travelling to New York!", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Wandering dumbo I saw there was no line at 2 pm on a Tuesday and had to see if the hype was worth it. After scarfing down 4 slices From a margarita slice the answer is a resounding yes! It was cooked in the oven just right w the basil and mozzarella mixing perfectly w the tomatoes sauce. The server was friendly and laid back, everything was super efficient and well placed inside. I would come back just not on a weekend to wait an hour plus :).", "author": "Alan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "Juliana's is the same owner as Grimaldi's from what I briefly read on the sign as we were walking in through the door. The ambience of the restaurant was modern and relaxed. Though we went there specifically for the pizza, I was a little disappointed they didn't have any appetizers on the menu. They did have salads. We ordered a small margherita pizza with prosciutto, house made meatballs and mushroom. The small was a good size for 3 people. The pizza itself was good. My favorite of the ingredients is the meatball! We then tried the cheesecake, didn't care for the powdered sugar the put on top, and the brookie bridge, which was 2 brownie cookies with ice cream. \n\nOh the drinks are not free refills at least the lemonades were not and I wasn't offered a refill for my tea either.", "author": "Eva B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "This place is really great despite being in the middle of a tourist attraction area. Do yourselves all a favor when deciding between this place the the \"other\" place next to it for pizza and catch up on the history written on Juliana's website! The \"place next door\" is not technically the original pizza place. Its is a chain restaurant with locations throughout the US. \n\nThe creators of Juliana's were the original owners of the other place and sold the name a long, long time ago and reorganized themselves under this name. The creator of this place is Patsy Grimaldi (ring a bell?) This location of Juliana's is the original location of Grimaldi's, started by Patsy Grimaldi.\n\nThe lines form early but not as bad as the other place. The inside is very, very nice and homey. The staff is friendly and accommodating. I ordered a small margherita pizza with meatballs. it was enough for 3 not too hungry people or two moderately hungry people. I was alone so half the pie went uneaten. As for the taste of the base, it was perfect. It wasnt crispy as the pizza's Brooklyn has evolved into but it was well done and a perfect combination of dry and moist at the same time. The taste was good and the bottom was not charred as some of the coal fire imposters always end up screwing up. The crust had left me wishing it was a little more airy but it was still very good. The mozzerella, sauce, meatballs, and seasonings was fantastic. Overall, I loved this place.", "author": "Neil Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "10/10 recommend! Ordered the Number 2, I really wanted some meat on my pizza but my friend is vegetarian so we went with the #2 and it was absolutely delicious! Amazing service as well!", "author": "Kristy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "Nothing much has changed since Julianna's decided to take back the Grimaldi spot. The owner still walks around having casual chit chat with customers. The walls and decor have been redesigned and touched up. The menu changed a bit but they are still serving the same quality pizza like they always have. \n\nWe ordered the Margarita and a #4, which was essentially the Margarita with prosciutto and arugula. Two pizza pies were a bit much for two people but since we are fat asses, it didn't stop us. The pizza is good but I'm more of a fan of salted cheese like John's or even NY style pizza by the slice. \n\nThe Brookie bridge was an ice cream sandwich. The cookies were half brownies and glad cookies offering a nice crunchy chew.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "Good food, good location, good service. We went on a weekday around 6 with a party of 8. They were able to accommodate us fairly quick (under 5 min) considering the size our party. A rare feat for such a popular place.\n\nA good spot to dine after checking out the Brooklyn Bridge.", "author": "Justin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "Good pizza. Crust is thin and toppings are fresh. Tried the margarhita, white , and #4 special. Liked the #4 the most. The prosciutto was really flavorful, and coupled well with the greens on top. The Margarita and white pizza were ok. Cool that you can order 1 pie with half white/half Margarhita and try both.\nIt was raining on a Monday afternoon, so no lines when we went there.", "author": "Ada W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "This is the best pizza I've ever had!!!!!! Amazing!!!!!!! The service is excellent and the pizza has extremely fresh ingredients. I'll definitely be back!!!", "author": "SHAMIKA L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Bro, your spaghetti good but it's not $20 good. Drop dat sghetti to $15 and you got a customer life. No joke. The waiter was dope", "author": "Hannah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "one of the best pizzas i've ever had. long wait but well worth it. probably better than grimaldis", "author": "D L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-08", "description": "I didn't think that Juliana's pizza was as good as I thought it would be. I found the dough to be bland as well as spices and herbs. Not worth the line for me.", "author": "Shelley R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-29", "description": "We went to DUMBO and looked for the best rated places and Julianas was one of them. Pizza seemed like a choice that wouldn't fail and so we went. \n\nWe were seated quickly with menus given, but were never approached again until we were given the check. The pizza itself was a little above average, but it was soggy from the first bite. You couldn't hold it together with pinching the sides at all. \n\nMy water glass ran empty halfway through the meal, so I began to drink my bfs until that ran empty too. I figured they'd see the empty glasses and refill them, but they never did, until they asked after they dropped the check off. When we got the check we were surprised to see we'd been charge the full price of toppings for BOTH sides of the pizza. Logic would be that we be only charged half as any other restaurant. We pointed this out to our waiter and told him we didn't remember seeing this on the menu,and he agreed. He didn't know what to say and had agreed with us, so he asked the manager. The manager came over and told us that it was clearly on the menu. When we asked where, he pointed to the probably size 6 font at the bottom of the menu. We explained that we hadn't seen it and there was no asterisk to point us there, but he didn't seem to care. We kept trying to tell him that other restaurants don't do this and it seems deceptive to not even tell us clearly on the menu (does anyone read the tiny font without an asterisk pointing them to it?). He didn't care and looked as if he were bored and annoyed. So if you're ordering half and half on your pizza, make note that it will be full price for each topping instead of half. \n\nPerhaps it was because they reopen at 4pm after their stoking of the coal oven and are super busy with the influx of customers, but I still don't think this is ok service at all. The place is also extremely crowded - the chairs are super close to each other and it's hard to walk without asking someone to scoot their chair in.", "author": "Torie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "There are many pizzeria places in NY and Juliana's is a must when visiting! Thin crust, a little chewy with the perfect amount of cheese and sauce ..omg! I must go back soon! P.S. Our server was the best ..always pleasant \u0026 had a smile on his face ...forgot his name but he was not the tall guy in there", "author": "Lisa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "After hearing multiple times that Juliana's pizza is the best in nyc.. we can honestly say we agree.\nWe arrived after a tour undecided whether we would go as we imagined it would be a tourist haven and have really long lines. \nOne thing was right.. there was a line.  But we decided to commit as the groups ahead of us were quite large. We were seated after about 20 minutes right at the bar. If you ever get to pick I thoroughly recommend these seats. You forget there are people behind you and get a show of pizza making in front of you. The flipping of the dough and the placing of the ingredients makes you salivate. Service was really good and attentive. \nWe ordered a large margarita pizza for $22. This was great value for money with size and deliciousness! Honestly such tasty pizza. Fresh and simple. You pay per ingredients you add.. and with such  a great base you really don't need to add anything.\nI almost considered reducing my review for this place, just so people wouldn't go! That's how great it is! Yummmnm", "author": "Juliet B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "So I am a Chicago Gal who loves her stuffed pizza! Pizza to me is a pan pizza stuffed with cheese, ground beef and spinach with a nice tomato sauce on top. \n\nMy friends took me to Juliana's insisting their pizza was amazing. \n\nWe waited about an hour in line in near freezing temperatures. Finally when we got a table we were attended to right away and started off with a salad. \n\nWe ordered the Arugula, tomato, cucumber, red onion, frisee/fresh market and house dressing with goat cheese \u0026 walnuts salad. It was my first time trying all of these ingredients together and I loved it!!! \n\nFor the pizzas/pies we ordered a Margherita pizza (Tomato, mozzarella and basil) \u0026 a White pizza (Mozzarella and garlic). Both were delicious!! \n\nI used to hate pizza without ground beef or spinach but after trying these two I altered my preferences and was pleased with the quality and taste of these New York Pies!\n\nDefinitely want to come visit this place again.", "author": "Halisa V."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}