{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "This was the best pizza I have had in my life. Wait was not bad at all and was well worth it. If I ever came to New York again I would definitely make the trip out to Brooklyn.", "author": "Grant H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "We got the Special 1 and would go back again!  Nestled under the Brooklyn bridge, this cute pizza place is delish. NY Pizza has to have a great crust, simple to no toppings and their cheese. They nailed it! Would come back in a heart beat to try their other specials!", "author": "Christina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "Finally able to visit the pizzeria that Patsy Grimaldi built a little over a year later, no disappointments here!  If you had to pick between going here and the \"Grimaldi's\" next door, do yourself a favor, pay some respect and come see Patsy here at least once for christ's sake!\n\nThe restaurant, named after his late mother, is a testament to good taste and decor while other owners in the area milk the tourists for all they're worth.  This is not the case at Juliana's.  You get top notch service with your top notch Brooklyn's best pizza.  Patsy frequently walks the floor of the restaurants and greets everyone.  Gotta love that!\n\nWe ordered the large Margherita pizza with a couple toppings, half pepperoni, and half ricotta and they were happy to oblige our request.  Once the piping hot pizza arrived, it was difficult to finish for three people, so be sure to bring your appetite or order the smaller version. (it's not that much smaller)  Thin crust pizza done right.... the smoky coal-oven flavor permeates the flavor of the bread, with a light airy crust.  Please follow NY pizza-eating etiquette. Use fork and knife ONLY if it's too hot to touch, and pick it up and fold it like the New Yorker pizza-eating champ that you are.  (You are in New York, right???)", "author": "Ron L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "So this is my first New York pizza I've tried and let me tell you this is some gooooooood pizza! Try to come before 6/7pm if not the crowd will come. If I could I would have takin a whole pie home to Cali :( .. There was 4 of us ladies and we had a large. 2 pieces each. Will post photo", "author": "Eliza O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Yes go!    And don't get distracted by Grimaldi's.  The best Margherita pizza I have ever had, west coast places aren't even close to this.  The perfect balance of sauce, cheese and basil and cooked perfectly and the dough was chewy and crisp.  Arrived right when they opened and got my own table.  Packed by the time I left for the lunch crowd.  It's #1 i the USA by TripAdvisor.  Go and you won't be disappointed.  Super nice friendly staff.", "author": "Josh L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Well worth the trip into Brooklyn just for this pizza, it was fantastic", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "I came here with a group of friends visiting from the UK. I always feel the pressure to take visitors somewhere that feels both authentic and has really good food. Juliana's did not disappoint. We asked our server for a recommendation and he suggested pepperoni and sausage. It sounded a bit meat heavy to me, but we went with it... And OMG have this pizza! It was epic. The service was fantastic and friendly, and the pizza was just what you want in a New York slice - thin with a crispy bottom and just enough grease. We ordered two 18 inch pizzas between 6 of us, which was the right amount for 6 hungry people. Hmmmm... just thinking about it makes me want Juliana's pizza...", "author": "Layla F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "It was yummy but I think I ordered the wrong thing. I didn't like the pepperoni and sausage because it was too salty. However, the pizza itself was very thin and crisp!", "author": "Dorothy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "Definitely one of the best pizza in NYC! \n\nThis is the true Grimaldi's Pizza! You can actually see the maestro, Patsy Grimaldi, preparing the pizza dough himself! He also likes to walk around, greeting customer \u0026 asking about their experience. He made a small conversation with one of us (Mr F.G) when Ms M.S went to the restroom. Very friendly guy! \n\nWe had one small margherita \u0026 one small white pizza. Wow! The pizza were really good! So seriously good! Thinking about it is making us hungry right now! High quality cheese! Well balanced with the sauce. The thin crust was done perfectly. We really can't say which one we like better. We love both pies equally! The size of the small pie is decent, you can actually share for two people. We were two hungry people with big appetite! One small pie is definitely too small for us to share. \n\nThe service was great! The waiter were attentive. The pizza came out pretty quickly. You don't have to wait for long. As for the place, well, it's a lot nicer than when it was Grimaldi's, \u0026 somehow it's much more spacious now. \n\nWe were there around 6pm on a Tuesday night. When we got there, the place was almost empty but within 15-20 minutes later, more \u0026 more people came in. \n\nThe small margherita pie was $15 \u0026 the small white pizza was $16. \n\nGreat food! Great service! Good value! Definitely worth stopping by!", "author": "Mr F G And Mrs M S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "So delicious! Great service. Visiting from California and loved this authentic New York pizza.", "author": "Alyssa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "We went on a Friday afternoon (around 5pm) and surprisingly no wait. Heard there's usually a long line, but Grimaldi's next door also had no wait, so maybe it was just that day. The place was packed, though, and the pizza was pretty good - tasted fairly similar to Grimaldi's. Still recommend!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "This is the best pizza i've ever eaten in USA.\nThough NYC has a lot of cheap pizza shops,here is totally great quality and delicious as well.If i have to say my recomendation in NYC,I'll absolutely say this is the best place to have pizza!", "author": "Tomokazu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "We waited in line for almost an hour at around 4pm. The place is very busy. Once we were seated we ordered the #6 on the special pizza menu. It was the best white pizza I've ever had ... With creamy guac on top and the sprinkle of cilantro. And can I talk about the dough. It is cooked to perfection with the perfect amount of smokiness. The dough itself is chewy (which I really like) and not burnt like the other pizza places when you order a thin crusted pizza. And when you have left overs they wrap it in aluminum foil in a to go bag. The waiter was not the best I've experienced but he did the bare minimum, so I can't complain about that. There were many customers eating with kids so it's very family friendly. The large portion is decent. I would say it is enough for 2 people. I've also ordered the spaghetti with meatball. It was ok. Order the pizza.", "author": "Ashley X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Went to Dumbo to pick up the bib for Brooklyn half after work yesterday and decided to have dinner there. Heard about this famous pizza place and also the long line. But it deserved the half hour waiting in such a good summer sunset. We ordered our favorite Margherita base with mushrooms and sausage, proved again my love for New York style thin and crispy coal oven pizza.", "author": "Mengyue W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "I have tried multiple pies in New York and this is hands down my favorite. Amazing cheese to tomato ratio. Nice crispy yet soft crust. Best ever!", "author": "Jeff V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "It's good pizza, but given that there are so many great pizza options in NYC, I'm not sure whether it's worth the hassle and the wait.", "author": "S. P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "So glad to report I can happily update Juliana's, restaurant of pizza living legend Patsy Grimaldi, to 5 stars.  The missus and I went back last night to possibly one of the best pies of my life.  \n\nThe sauce is a standout, the cheese quite fresh and flavorful, the yeasty charred crust was perfection: simultaneously crunchy AND chewy.  It boggles the mind.\n\nSo much better than that other place next store.  No names will be mentioned.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Five star pizza joint for sure! It was crowded--we got the last open table at 9:30 on a Tuesday night. But the pizza is amazing. We ordered a large No. 1 special, probably the perfect amount of food for three hungry people. The No. 1 had pancetta, scallions and the most delicious combination of cheese--I highly recommend it!", "author": "Graylyn R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-28", "description": "The pizza is exceptional, especially the No. 1 pizza with truffles and scamorza affumicato. The service, however, is just so incredibly bad. We were forced to wait as a group of 6 for an hour and a half. Even when we got to the front of the line, we were forced to wait while tables that would fit us were split up to get more couples in - which made our patronage feel less valued. The maitre d' was dismissive and unapologetic. Our waiter was very slow on the drinks order, so much so that our food arrived before our drinks. The sheer tinyness of the restaurant makes it look much busier than it is - next door at Grimaldi's is much more popular and for good reason.", "author": "Mitchell W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "The fact that this place has the amount of reviews and they maintain a 4.5 star rating tells you everything about them. \nService is impecable for the amount of guests they sit daily. During lunch they will have a very extensive line and wait times up to an hour and more. But it's worth every second you're there waiting and witnessing all those lucky ones ahead of you who are eating their pizza (lol)\nI can't even begin to describe the flavor, it's pizza coma at the moment you experience your first bite. \nOut of all the places I ate pizza this trip no place came close to this one. It's truly the best hidden gen I've come across and I guarantee you the hype is real and all you've heard is true. Don't think about it for one second GO! \nI promise you won't regret coming here. Im already planning my visit back next time I'm in the big Apple. \nBest Brooklyn style pizza I've ever had! \nP.S. they not only have pizza, there are other options in the menu, and it's quite a big menu and they have a lot of variety in their pies.", "author": "Abisai H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}