{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Came here few times, I love the place.\nThe food here is very delicious and its not expensive. The place is very crowded you would have to stay in the line outside for about 10-20min, depends on the day, to be seated. I would say, here probably the best pizza in NYC.", "author": "Vitaliy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Yep, the pizza is fantastic. My mother and I split a margherita pie, and the prosecco was delish. Service was timely and efficient. The place lives up to the hype.", "author": "J. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-18", "description": "On a recent trip to New York, I found this place via YELP.   Wow... did Yelp do me right!\n\nWe didn't experience the big long waits like I see in the photos, but we did have some of the best pizza I've ever had.... \n\nFriendly staff, great pizza and it was all reasonably priced too!!\n\nI would add this to my list of \"must do\" places next time in NYC.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "So good - worth the wait!  The line outside was a bit daunting and we probably only waited about 25 minutes for a table.  Service was great and the pizza... WOW.  So good.  We got a pepperoni pizza that really hit the spot.  Chased it with a couple Brooklyn beers.  I was wary of having high expectations but they really delivered.  Would recommend without hesitation.", "author": "JD D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "This was probably the best pizza I have ever had... We didn't go to Grimaldi's cause we didn't even want to hassle with it, plus we hate the one in Scottsdale so we decided to give this a try instead since it's the same founder. So glad we did. \n\nWe went there at lunch and there was no wait. We sat at the pizza bar and watched everything be made. We started with the salad and then we split a small pizza...  And by small I mean it was 16 inches :) \n\n\nThe sauce was fresh. A little sweet and tangy, topped with creamy and delicious mozzarella. \n\nI would definitely go back.", "author": "Toni J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "I've been visiting Dumbo for years, and as such, have eaten my fair share of Grimaldi's pizza. I  visited Juliana's a few years ago when it first opened, and thought it was very good (including a really nice house salad, of all things), but not worth a premium over Grimaldi's next door.\n\nHowever, I recently moved down the street from both pizzerias, and after eating several times at both places within the last month, I have a new take: Juliana's is definitively better. \n\nTheir sauce is more flavorful, with more herbs, and most notably, the crust is slightly softer and more buttery. The first time I ate there, the pizza wasn't baked long enough, and was a little doughy, without the charred bits on the bottom typical of coal ovens. Now that they've worked the kinks out, Juliana's delivers the apotheosis of American pizza. \n\nGet the basic margherita. They have more fancy options, but you can't beat the classics. The line is usually shorter, too. Worth the extra $3-4, and despite what cynical New Yorkers may shout at you as they drive by, it's worth waiting in line.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "We walked across the Brooklyn Bridge and stopped here for lunch. We were pretty hungry and the large margherita pie was the perfect size for two. The sauce was amazing and the crust was awesome - perfectly chewy.  The people next to us got a prosciutto pie that looked bomb. \n\nOur server was super friendly and even helped us figure out directions to another part of the city. It's a small place but has a traditional atmosphere with Frank Sinatra music playing and lots of memorabilia as decor.", "author": "Melanie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "Went with two friends, waited in line about 30 min. Had the Margherita and the white pie. Maybe it's my taste buds but I found that they both needed salt. The orange cream soda and the chocolate egg cream were both incredible. Our waiter was incredible as well. Didn't get his name but I tipped well so it's okay.", "author": "Abi H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "my NYC friend took me here in fall of 2015, then after that they got award of Pizza......\nI agree.", "author": "Kiyohiro S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Really good pizza, awesome ambiance and awesome staff, trimmel waited our table and he was spectacular. The cooks were really cool too. A must in ny.", "author": "Raul H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "We were passing by Juliana's one day headed to actually have Grimaldi's when we realized that this spot is actually the original Grimaldi's. Patsy Grimaldi had sold his name to the new Grimaldi's location and when he wanted to take it back, it was too late. Thus, he opened Juliana's. Sadly, not a lot of people are aware of this and still go to Grimaldi's due to the name. Getting back to Juliana's the Pizza is just as good as the old days. Though Lombardi's is still my favorite pizza spot for white pizza, this place does a pretty good job at it as well. Oh and with an amazing view right down the block! Be sure to drop by and say hi to Patsy Grimaldi and have some fresh, delicious, coal fired pizza  after your stroll through DUMBO!", "author": "Farhana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "The server who served me was very professional and gave top notch service.. He was also serving the lady next to me, literally slicing her next slice of pizza and plating it for her. He was also very attentive, promptly refilling our water whenever it was running low. \n\nI got the Margarita pizza, as recommended and would have to say that although it was decent, it wasn't anything out of this world as others have made it to be. \n\nThe whole pizza came to $19.50.. After the meal, I paid $25, and no change was brought back. I did wait for awhile, but there was nothing.. Although I was going to tip that regardless, it's the act of bringing back the change and then tipping based on service.. \n\nOverall, the experience was not bad, but the pizza was mediocre.. Wish I tried another pizza or went with a bigger party to try more things.. \n\nPs. The same server also walked me out to point me the way home since I'm from out of town, so service was what bumped this place from a 3~4 star.", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Hands down the best pizza I've ever eaten. The atmosphere, location, the cheese, the crust, the toppings. OMG.", "author": "Masoud T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "I was on a business trip and we stopped here for lunch. I fell in love with der prosciutto pizza. It was amazing!", "author": "Hugo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Bf talked a lot about Grimaldi's for quite some time. Funny that while i was browsing Grimaldi's, it actually led me to Juliana's. I scanned through their menu, discussed about how Patsy had sold Grimaldi's decades ago to bf, persuaded him to drive to Dumbo to try Juliana's and boy, we were very impressed!\n\nGot there on Sat night around 9.20 and was promptly seated. it was quite packed but there was no wait for party of 2. we got David (the older guy) as our waiter and he was such a charming guy. we opted for caesar salad for our app and the no 1 special pizza. we were contemplating on whether to get the small or large one but David suggested to just go with the small size because it was quite big plus it was already late at night. great advice because we actually got two slices of leftovers. ;)\n\nThe pizza itself was the thin crust type (my liking) and was baked to perfection. It was a bit salty because of the pancetta however it was just a perfect balance of saltiness. bf and i really enjoyed the pizza however i kinda regretted not ordering the arugula pizza (the no 4 specials) especially after seeing 3 tables ordered it. lol, for next time visit! the caesar salad was delicious as well. the generous crusted parm regiano combined with the fresh romaine and crunchy crouton -- perfect starter! i did not want to leave without having dessert so we shared two delicious scoops of pistachio ice cream (from the Brooklyn ice cream factory) to which David said: I'll make it romantic for you two :D\n\nOverall I was very pleased with Juliana's. Very fast and attentive service and not to mention delicious foods as well! Will be back!", "author": "Christila U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "Wow, all those wasted years of going to Grimaldis! I have found a new place to bring my out-of-town visitors to for NY-style pizza.\n\nAfter being rudely treated at Grimaldi's, I decided to check-out Juliana's next door. I feel like Grimaldi's has been dependent on their reputation this whole time, and the quality of their service has diminished. After trying Juliana's, I realized that the pizza is not too oily, and you don't develop an unbearable thirst afterwards (like the kind you get after eating cheap Chinese take-out). The restaurant space is much smaller than at Grimaldi's, but the wait was not as bad as Grimaldi's. From now on, I'm going to Juliana's!", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "The No. 1 . The. Best. Pizza. I. Have. And. Will. Ever. Have. In. My. Life. A pizza with distinct saltiness, richness, slight creaminess, and is perfectly foldable (the best way to eat a pizza, in my opinion) with soft and chewy crust. Honestly, Juliana's has ruined pizza for me.", "author": "Claudia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Overall: outstanding pizza \u0026 service.  This small restaurant sits next to the Brooklyn Bridge and churns out the best pizza in NYC.  It opened at 4 PM and was packed by 4:20, get there early, the line was down the street on a Tuesday.  The pizza was fresh and very tasty, the service was prompt and professional.  If you are in NYC and skip this pizza, you will be kicking yourself for the rest of your life.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Boyfriend and I were lucky as we got in with no wait. You just have to go in at the right times.. \u0026 also right weather conditions! ( usually when it's raining or snowing, there isn't a line) it was one of the best pizzas we had ever tasted ! I think we ordered a margarita pizza pie.. the waiter was also pleasant which is always important to have, especially at a popular restaurant! I don't remember his name though, but he was a tall African American man.", "author": "Saba N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Yo, this place truly lives up to the hype!! Went on a weekday in the afternoon and the line was pretty long, but the wait is well worth it. Pizza was fresh and came out quick, and i'll live to see the day where i try crust this crispy and delicious. 5/5", "author": "Deema A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}