{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Although I live fairly close to this restaurant I've never ate here until yesterday. The inside of the restaurant is small, but beautiful and super cozy. The waiters were so lovely, very friendly and funny. The pizza was soooo tasty, I would recommend this restaurant to anyone!", "author": "Kelly D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "So thankful to whoever tipped me off to the whole Grimaldi's/Juliana's lineage.  I had been to Grimaldi's just a handful of times - can't say how many of those were before/after it was sold, but Juliana's taste is right up there is my best Grimaldi's experience.  Same quality ingredients.", "author": "James F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "Spectacular pizza, in the USA northeast neo-Neapolitan style.  We tried two pies: the margarita with housemade mozzarella and the No. 1 House Special (Housemade mozzarella, Scamorza affumicata, pancetta, scallions and truffle oil--no tomato.)  Both were perfection.  Perfect leoparding char on the bottom crust, and totally balanced with the top-cooking.  \n\nWe showed up on a Monday around noon and got a seat promptly, as a party of two.  But the place was basically full at the time, and there was soon a line.  So the word is out that this place is the genuine Grimaldi's, I guess.  Juliana herself, Patsy's wife, was there and managing operations pretty closely.  She seemed to inspect every pizza and even did the cutting at times as they were on their way out.  She talked with us twice to ensure that all was well with the food.  Can't ask for more.\n\nOne of many things that makes me envy those who live in the NYC area.  I just get to look forward to a next visit.", "author": "David T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "One of the most amazing Pizza's you will have in Brooklyn... You have to come out and try making your own pizza. The white bean appetizer soup was a fantastic choice before eating a large magaherita pizza.", "author": "Elias C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "It's actually been about a year since I ate here, and I wasn't really into Yelping at the time so never wrote anything.  Will keep this short - possibly the best classic style pizza I've ever had.  Older guy that I think owned the place came by and chatted, and the waiter gave us a pizza history lesson.  We walked back to Manhattan across the bridge right after dinner.  Wonderful evening - great memories - five stars.", "author": "Roam J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Best pizza I've had in NYC. Not greasy, perfect thin crust, excellent sauce. We got the margarita, it was amazing. Small was perfect for two people. Talk to one of the people who works here about the origin, this is basically the new Grimaldi's.", "author": "Corwin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Well.. I m from LA so the price here is a bit pricey for me. It tastes good, no doubt about it. But i don't like a feeling that the bread gets thicker and thicker from the center to the crust. The service is slow, even i had during Thursday afternoon. My glass was filled only once with my own request and i waited more than 10 minutes to order and to pay.", "author": "Varoon V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "Meeting Mr. Grimaldi himself, absolutely as good as it gets!\n\nThis pizza is everything that it should be. It absolutely has restored my faith in man kind.", "author": "Ted K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "The Pizza is as good as everyone says! We ordered several pies 'to go' for a group - traditional margarita, one with sausage and pepperoni, and the white pizza with sausage and broccoli rabe. The sausage and broccoli rabe was most people's least favorite. I guess when you think of pizza you usually want that red sauce on it! There wasn't a lot of flavor on this one otherwise. Thanks for the head's up about the wax bags instead of boxes fellow yelper! The pizza made it to our destination ok, but not the most convenient way to carry 4 pies! Definitely give yourself time - I called ahead and my pies were ready 55 minutes later (or 10 minutes longer then they said).", "author": "Gena W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "Came here on a Friday evening around 8ish with a party of 3 and we got a nice corner table facing the rest of the restaurant (love that French-ish style of sitting).  \n\nWe had 1 large #1 pizza special and 1 small Margherita pizza-more than enough for 3 people. Both pizzas were delicious and we couldnt help but shovel it all down. Probably could have stopped after 3 slices but NOPE-had 4 and a half..\nThe pancetta on the #1 Pizza special tasted so good and the scallions were an interesting and unexpected touch to the slice. If I make it back to brooklyn heights I probably want to try the pizza with salmon on it-quite a unique take on pizza toppings there.\n\nThe only issue was having them split the check and also not allowing for any modifications on the pizza (my friend is a vegetarian so we wanted to take off the pancetta from half the pizza). Other than that, pretty pleasant experience, friendly staff!", "author": "Cory N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "The real Grimaldi's! When we want great pizza we come here for a margherita with pepporoni. Worth the price, food is always fresh and service is Great!", "author": "Meagan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "Everything about Juliana's it awesome. It's nice to be greeted by Patsy.\nWe will be back in a few weeks with the kids.", "author": "Ron K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-03", "description": "Was told this place was famous for their pizza, had their margarita sausage....the sausage was good but the cheese was dry and the crust wasnt much to rave about...wish their pizza had more sauce too...", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "I went here back to back days. The service is great! The quality is amazing. There is no way else in the world you can find pizza as fresh as this. I took my friend who is an out of towner. He thinks its the best pizza he has ever tried in his life as well. The meatballs were really good as well.", "author": "Davidson H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "Really good... Best in NYC?.... Probably not, but It's in the mix.... The mix is getting big....\n \nHad the white, with smoked mozz (affumicato), super thin slices of pancetta, and scallions.... What can ya say that hasn't been said? Delicious...... Nice refreshing IPA beer as well.... \n\nIt's popularity deducts from the experience as it is perpetually packed, somewhat hectic and less atmospheric than some other old school NYC pizza joints that ooze with character, as well as melting cheese....... \n\nBut delicious nonetheless...", "author": "Dominick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "So... When I got off the subway at Clark St, a kitten-sized rat scurried across the platform about three feet in front of me. Definite freak out, minus the girly screaming. We walked over to Juliana's and hopped in line, shaking our heads at the poor, deluded tourists queued up at Grimaldi's next door. The wait was a bit long, but it was a Saturday night around 7, so it was to be expected. \n\nVerdict- the pizza was definitely worth the scare and the wait. I had a margherita pizza with roasted red peppers. The sauce was incredible. My only complaint is that the crust had been stretched too thin, leaving a hole. Patsy would have kicked it back for that. But all in all, a good pie. The rest of the group had a white pizza with olives, peppers and anchovies and another margherita with red peppers, pepperoni and mushrooms. Everyone left full and happy.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "We came here for lunch after walking the Brooklyn bridge.  It was easy to find. We came a bit before noon on a Saturday and had no wait...line started growing outside right a noon. \n\nWe had a great pizza, but they actually have quite a bit of other options on the menu", "author": "Rachel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "One of the best pizzeria's we have been to in all of NYC. Really great tasting pizza, including the crust, the sauce, pepperoni. Everything was perfect. The atmosphere inside the restaurant was a lot nicer than I was expecting as well. Really casual \u0026 well done. The service was very friendly \u0026 welcoming. Next time I am back in NYC I would definitely come back for a return visit. A Great Experience.", "author": "J R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "Juliana's Pizza was a nice surprise.   Handpicked by my 7yr old cousin who was caving pizza.  We were immediately greeted by a mature, friendly host in a family-styled space.  Juliana's dining crowd is tab loud for my liking.  Our server ,Monica, was kid-friendly and engaging.  Since Mr. 7 yr old has simple tastebuds, our server offered us 1/2 Margherita \u0026 1/2 Marinara pizza - it was perfect \u0026 the best of both worlds.  Although, a crowd awaiting tables started to gathered, we are not rushed. Bookmarked for a next visit.", "author": "Laverne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "I counted the seats inside and out. I think capacity is 70. So at any given time, there are 70 people in pizza heaven and another 35 non-sinners in line. No matter what pie you order, I am certain you'll enjoy it. I ordered the furthest thing from pizza with a basil pizza, which had olive oil, basil, tomatoes, and a very light cheese. The flavors were perfectly combined to create an intensely satisfying slice with every bite. The staff was friendly and punctual, especially the man running the show himself. The place was well lit and clean. The location was perfect. Just don't go next door to Dumbo for a macaroon. They'll rip you off.", "author": "Vishal D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}