{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "Wow - went here with my girlfriend tonight and have nothing but praises to sing.\n\nFood - Delicious. Some of the best pizza I've had. Honestly cannot think of anything wrong with it - the taste was fantastic and we both loved it. \n\nService - As great as the food was, the staff was VERY attentive and always coming by our table to make sure everything was going well, our water glasses were full, etc. We told them we were in a hurry to see a movie and the food came promptly.\n\nDecor - Great setup the feels very home-like. Tables are not too packed together and it was easy to have a conversation.\n\nPrice - Affordable and reasonable. We split a Caesar salad, a small Margarita pizza with ricotta topping, my GF had a glass of wine, and I had a Diet Coke. Came to approximately $45 total after tax.  \n\nBonus - As my girlfriend and I were walking about, Patsy Grimaldi (the owner and original owner of Grimaldi's pizza) stopped us to ask how the meal was, how we enjoyed the dining experience, etc. He said to let him know the next time we come in and we can sit down with him for coffee. THIS IS THE TYPE OF STUFF I LOVE - being appreciated as a customer.\n\nStrong recommend - do yourself a favor and check this place out.", "author": "Garrett P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "Went here last night, and the place is legit.  So rumor was it that this is the real Grimaldi.  We actually saw him pacing around outside, smoking a cigar, drinking some wine and introducing us to the restaurant.  Definitely a nice charm and feel to the place.  Food was amazing.  Service was great.  It was a bit on the pricey side, $50 for a pizza, a soda and a beer, but the experience was definitely one to write home about.  Check it out!", "author": "Bernard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "Located in DUMBO (down under Manhattan Brooklyn overpass) area is one of the best pizzas. Juliana's is the original grimaldi's, so their oven is a little more seasoned. Although every sunday @ 3pm they're shut down in order to clean the brick oven. Since they are especially busy on weekends that proves how much they care for their pizza.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "So much better then Grimaldi's and half the wait. This is my go to place when friends come into town.", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "My friend insisted on checking out Grimaldi's so I trekked all the way out to Dumbo to wait in line. When I got in the back of the line, I saw Juliana's and a big sign saying they were arch rivals. A man came out of Juliana's and told me we were in the wrong line and we should check out Juliana's for the \"real Grimaldi\".\nSo switched lines only to be greeted by the 81-year Patsy Grimaldi himself! What a surprise! Although I haven't been to Grimaldi's in years, the pizza did seem better. We got a large pie with homemade mozzarella (claimed to be made by Patsy's wife Cindy), scamorza, and sausage with fennel. The crust was good, sauce dee-lish, and cheese fantastic. Only gave it 4 stars because the thin crust doesn't beat some of my fave spots in Manhattan, including Waldy's and Spunto. \nAs the others said, let the tourists go to Grimaldi's while you skip the longer line and check this place out!", "author": "Nisha P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-09", "description": "The pizza was good, not great but definitely decent.  But the service left much to be desired. Our waiter ignored us for the first 15 minutes and waited on not one, but two tables that came in after us.  \n\nAfter finally taking our order, we waited 45 minutes to get our pizza - while FIVE different tables that ordered after us received their food.  When we asked our waiter, he rudely blamed on being busy.  Finally got our pizza.  Three of the tables seated after us had already received food, eaten it, paid and left before we got our one pizza   In the course of waiting, we watched food delivered to wrong tables \u0026 people receive incorrect orders - with no apologies; only excuses.  \n\nOn a side note, I have never been anywhere so noisy!  The music is loud so people are practically yelling to have a conversation.  Not a peaceful place to go for a meal. \n\nWe go to NYC frequently, but not sure Juliana's will make our repeat list.", "author": "Christine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Strolled over the Brooklyn Bridge. Happened upon Juliana's. Fabulous white pizza. Well worth the walk!", "author": "Debbie Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Great Pizza! Line might be long, but worth it.  It goes fast anyways. This is the original Grimaldi's, choose this one over Grimaldi's, which is now a chain.", "author": "Diego M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "Definitely better than Grimaldi's and also better than Ignazio's, which is another place around the corner.  The pizza was excellent.  I was a little disappointed in the calzone, which looked better than it tasted, but it wasn't too bad.  It just seemed to lack something.  Service was great, none of the attitude of their famous neighbors up the block.  I'm hoping they do well as it is a welcome addition to the neighborhood.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "I will always go to Brooklyn for Julianna's pizza when visiting NYC.  I had lots of pizza over the years but when my friend took me here I said 'this is what NY pizza should taste like'. The pizza you crave in your dreams when you are thinking of NY. Light, thin and delicious. It looks so simple to make yet it's a wonder how they make it the best pizza and so many others can't come close.", "author": "Janine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "Awesome food. Service is little slow but food is really great. Ambience is nice. Near waterfromt.", "author": "Anshul B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "Decent pizza. We had the number 1 and the marghareta.  Definitely top quality. Don't order the desserts they're nothing special.  The ice cream cookie sandwich was nothing great.  Calzone was ok. If I could give 3.5 stars I would.", "author": "Alon X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "AMAZING!!! A little but of a wait but totally worth it! And the staff was super nice and helpful. I want to go back right now!!!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-09", "description": "Doesn't do take out at weekends. Tried to order take out for convenience and unable to do so - this is different to last year when we did the same thing. The food is nice, but not worth the hassle", "author": "Pete A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "I'm definitely pleased with their pizza (which is definitely comparable to Grimaldi's), but this place takes credit card, answers phone calls (unlike Grimaldi's), and they have friendlier staff!   Who said customers have to be abused to get a decent bite to eat!", "author": "Su S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "We were in DUMBO for a David Sedaris book reading and were hungry so we decided to Yelp restaurants. We were initially going to go to Grimaldi's but after reading Yelp reviews about long lines we decided to go to Juliana's. As soon as we walked in, everyone, I mean everyone in the place stared at us. I will tell you why, they only prep the oven a few times per hour, so if you don't order, you have to wait for 20 minutes until the next batch is ready. So everyone was hoping we wouldn't delay their orders! We got our orders in just in time, a half margherita and half pepperoni with an arugula and goat cheese salad as an appetizer.  I have to say this is the BEST pizza I have ever tasted. EVER. The crust was delicious. The salad was also great. Definitely gourmet and worth the trip to Brooklyn.", "author": "L C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-22", "description": "We ordered a #1.  The taste of pizza was good, however, the pizza was lukewarm which was disappointing. Price $30+ for a large pizza was quite high for type and volume of food.", "author": "Pat W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "Amazing pizza, great wine, calamari was delicious. I will be here again and again. True NY spot. Had a great time and can't wait for more!!", "author": "Tracey E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "Best pizza I've ever had outside of Italy.  Try the classic margherita with extra mozzarella.  Divine.", "author": "M S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "Hey sucker tourists: Why wait in line at Grimaldi's next door?  Julianna's is SUCH a better pizza, and besides it's the more original Patsy's pizza anyway!  (Julianna was Patsy's MOM).  In fact, I probably shouldn't be telling you this so us locals can keep getting a faster pie at Julianna's.\n\nExtremely friendly staff (unlike next door). Nice little beer and wine selection. Comfortable, warm dining room with some fun seats available at the pizza-making bar.  A little pricey, but they can charge it so they do ... and it's well worth it.", "author": "Ben S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}