{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "First off this is actually the real Grimaldi's, even though you will always see a line at the Grimaldi's on corner. I've been to this place a couple of times and every time I've been here it's delicious! The last time I was there was with my family to celebrate my father's 60th birthday. I called before hand to make reservations because there were quite a few of us, (FYI they never make reservations), but the manager went out of his way for us and did so), that should tell you more than enough about this place and how much they truly value their customers. That night, Mr. Grimaldi was there himself, he came over to us introduced himself, and told us about the history of his restaurant. It's still family owned. The first few times I came here, the hype of this place wasn't at the level that it is now. I'm guessing b/c not every knew that this is the actual authentic Grimaldi's pizza. Basically it wasn't that crazy and you were able to get a table fairly fast, now the wait is long, and the last time I passed there was a line. Bottom line is... the PIZZA is great, it's a cute cosy place, very small, but definitely a must try especially if you're a pizza lover! Oh and you can't forget the view of the city just outside the door is to die for!!", "author": "Rosamaria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "This is the best pizza I have had in New York. I tried the typical tourist locations and this knocks it out of the park. Line was much shorter than grimaldi's and the owner Patsy greeted us as we walked in.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "My New Years wish is to have one of these in Hawaii!!! Hands down THE best pizza ever!!! Ordered the margharita, special #1, and olives/mushroom/pepper pizzas. The special #1 was the best of the three but all 3 were made to perfection! The dough was perfectly crisp, and the toppings were proportioned just right!", "author": "Amy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "Places like Juliana's rarely meet expectations, let alone exceed them. And this is a pretty wild scenario to begin with: elderly Patsy Grimaldi is going to reclaim his building from the hucksters using his name to franchise increasingly mediocre pizza worldwide? I don't mean to wax emotional, but this is like sending up a hobbled Kirk Gibson to hit in the pitcher's spot and expecting him to hit a home run to win World Series Game 1.\n\nThen that shit happened. Cue the brake lights in the Dodger Stadium parking lot.\n\nI first came here in 1990. And the pizza now is every bit as good as it was then. Same oven, same crust, same char, same chew. And they have better toppings. And they have pretty reasonable salads. And they have acceptable calamari.\n\nWhat the hell is going on?\n\nJuliana's has reclaimed the crust mantle from Totonno's. And the cheese is better. And the sauce is better. And we're talking about Totonno's, which was the ne plus ultra of pizza until three hours ago.\n\nNot only that, but this shit should make Dom Di Fara embarrassed and ashamed. Here he is, this annoying Midwood crank who only makes your pizza nicely if he feels like it. If he doesn't, it's his art and you're out $35. \n\nWell here's Patsy Grimaldi slinging his old pizza, slinging some ice cream, and slinging some wine and beer. And he's coming around and telling your ugly kids how beautiful they are. And he's asking where you live and wondering why you didn't drive. Sure, he's assaulting you with Frank Sinatra. But he's also proving that you can live past 60 and make a superior pizza without acting like an aloof prick.\n\nWHOA!", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "I set out in hope of finding the best pizza and I found it at Juliana's!  Many say it's well worth the wait, but that falls short of describing this level of quality.  I waited around an hour for my opportunity to get seated at a table and I would be willing to wait two hours in line for that amazing pizza.  I spilt a Margherita Pizza with prosciutto with my wife and it was plenty enough for us both.  Great service, atmosphere with amazing pizza.  Only place for pizza worth a wait.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "Thank goodness for coming to NY with someone who's been here before.  My travel buddy gave me a brief synopsis of this place, the history and all the coolness behind Patsy Grimaldi.  In Las Vegas, we have a bunch of Grimaldi's pizza, so it was cool to hear the story of how he started it and later sold the business.  I was hoping to get the chance to meet him in his new restaurant.  \n\nTake the Blue Line subway to High St in Brooklyn and walk towards the DUMBO (Down Under the Manhattan/Brooklyn Overpass).  Right before you hit it, you'll see Grimaldi's on the corner and Juliana's right next door.  What a quaint and cute place!  Get there early, because there aren't a lot of space.  The walls were white, the trimmings were black and the kitchen was just as big as the dining area.  One focal point I loved was the Juliana's FAQs. It was a black board with frequent questions about the joint.  Basically, Juliana was Patsy's mom, she's originally from Melfi, Italy and loves Scamorza pie!  Another HUGE focal point, more a highlight, was Patsy Grimaldi!!!  We actually got to see him work in the kitchen, wait tables and even take some time to take a few pictures with fans like myself.  Omg, what a legacy, what a treat, what an inspiration.  He's such an easy going guy, down to earth and super sweet.  Alright, for dinner, here's what we got:\n\nAppetizer:  Hearts of Romaine and Caesar dressing with croutons, white anchovies and green Sicilian olives for $13.  The salad was crisp and fresh.  Shaved parmesan made for a tangy and salty flavor.  Loved it.\n\nDrinks:  Mezzacorona Pinot Grigio for $9.  I love Pinot Grigio with salads and pizzas.  It's light, crisp with a hint of fruit.  Perfect drink.\n\nDinner:  We shared the small No. 4 for $26.  Trust me, it feeds 2-3 people.  This pizza was filled with tomatoes, mozzarella, arugula and prosciutto.  What a perfect pizza!  The crust.  Man, it was superb!  Light, thin and crunchy.  Exactly how I love my pizza.  There were chunks of tomatoes, big pieces of creamy mozzarella.  The arugula was lightly crunchy and offered a light bitterness which brought out the flavor of the pizza!  The prosciutto was marbleized and was packed with flavor.  Such an awesome combination!  HIGHLY RECOMMEND THIS DISH!\n\nIf you're ever in the area and DON'T visit Juliana's, you are missing out!  I've always said it, when it Rome...well, I wanted to try an authentic NY style pizza in NY and I've found the mecca!  This place is out of this world.  Thanks Patsy and the gang of Juliana's!", "author": "Rockne H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Best pizza I've ever had.  Get the cheese or the margarita pizza.  The food alone should get you there.  Also the service is pretty good too", "author": "Kenneth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Being a transplanted Long Islander I feel like I recognize good pizza. In my opinion, the Brachinelli's/Emilio's group is great pizza. Even, Frank Pepe's Connecticut pizza and Spumoni Gardens Brooklyn are equally good. After eating here I see I found my new favorite pizza place. Too bad it's a trip to get it. It's right by the Brooklyn Bridge next to Grimaldi's which is famous for its pies.  Grimaldi's had a long line to get it. Right next door is the smaller Juliana's where we were planning to eat.with a bit of a line.  There was a short line but we were nicely told that they were stoking the coal burning stove so it'd be a bit of a wait. It seems they start up serving again at 4. Good to know as line goes quickly once they reopened. Conversation around the line helped pass the time. While in the restaurant we were surprised how small was. Our older waiter was your basic old school Brooklynite( I can say that...my husband's Brooklyn born \u0026 bred.).We started with salad and meatballs to have while waiting for the pie. They were very good but, let's face it, it's all about the pizza! We always order a plain pie as a test and it passed easily. Everything about it was great...even the crust was terrific . We spoke to the very nice man, Matthew who looked in charge. He explained he was a partner with the original owner of Grimaldi's whom he talked out of retirement. had sold the original Grimaldi's and its name. Juliana's is in Grimaldi's original location.\nWe're planning on taking another trip back.", "author": "Louise B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "Amazing Pizza...better than the location of \"Grimaldi's\".\n\nThe owner is there helping out the staff and is very friendly.\n\nYou can not go wrong getting amazing pizza here...the price is what you would expect. Not cheap but not over the top in price.\n\nStaff is very friendly and somewhere that I will go back again.", "author": "Nychoopaholic B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Myself and two others were going to go to Grimaldi's next door, but to our disappointment, the seats were uncomfortable and they didn't have their liquor license. So we walked over to Juliana's and were immediately greeted outside, walked in and seated. \n\nWe ordered a large margarita pizza with sausage. It came very quickly, piping hot. It was delicious, between the 3 of us girls we finished the whole thing. (Each of us had 3 big pieces). Our server was very nice and there was a visible presence of the owner, greeting people and checking up on service. \n\nWe also got a piece of New York cheesecake to go.", "author": "Anonymous E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Lines are long but the pizza was very good and the customer service was amazing. I loved that it had more pizza options than Grimaldis.", "author": "Yara R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "The pizza at Juliana's  is delicious and service was great. I was pleasantly surprised that it was so good since a  lot of tourists were in the restaurant. However, it was so good that is now my favorite place to eat pizza.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-10", "description": "Oy. \n\nWhen I was a boy, back during the Pleistocene era, my parents would take us kids to the original Patsy's up on First Avenue in Spanish Harlem. It was old school Italian, and I have the most wonderful memories of pizzas there. Also, lots of black cars on the block.\n\nTrekked here from California to get a taste of the past. It didn't taste like the past. It tasted like an okay pizza made in an excellent oven.  We got it with mushrooms and sausage. The sausage was reportedly tasty with fennel, which was nice. But the pizza itself? Dare I say it?  Not so wondrous as I remember.\n\nOy.\n\nIs it the pizza, or it is me?  Probably both.", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "Some of the best pizza in Brooklyn!\n\nThe ingredients were fresh, dough was crispy yet soft in the middle, and the sauce was not overwhelming.  The prosciutto was cured well and was fantastic on top of the pizza.  I have to say smashing a couple slices with ice cold beer at Juliana's hit the spot!", "author": "Edward L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-19", "description": "To use the basketball analogy: Grimaldi's (next door) is the veteran who gets every foul call. They're good, they're talented, but they may be kind of coasting on their laurels. For the first time last summer, I thought the pizza wasn't worth the line. \n\nJuliana's is almost like NBA2K13 Live (or something), where you're allowed to play with Wilt Chamberlain in his prime.... You can't believe that a baller is THIS good! THIS is pizza like Grimaldi's probably used to be. \n\nAnd, to be honest, I probably wasn't aware of how much Grimaldi's might've \"lost\" until I had Juliana's. \n\nThe biggest problem is that I imagine that Juliana's lines will be as crazy as Grimaldi's - if there aren't already.", "author": "John B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "Pizza was fantastic! Compared to Grimaldi's, crust was more tender and has a great crispness to the outside. Not chewy, and perfectly cooked.\n\nService was poor. Attempted to get a refill on a drink three times but the server rushed by every time without checking on us or even noticing that we were attempting to flag them down. Also  neglected to mention that they charge for refills on drinks. Because of that, the single refill I was charged for came out of their tip. $5 for 20oz of iced tea is ridiculous even for NYC.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "A couple pizza-loving colleagues and I finally made the trip across the bridge to try this place out after work last night. We came with the sole intent of going to Juliana's, and it was absolutely amazing. If ever in the neighborhood, I will never choose Grimaldi's or Ignazio's (which is always forgotten but also very good) over Juliana's.\n\nWe got a small margherita and a large pie with arugula, prosciutto, and mushrooms. Both were fantastic. I'm a purist and always favor the margherita but the prosciutto was VERY good - rather thick and not too salty. The crust was nice and chewy, a tiny bit thicker than I expected, but lightly crispy on the bottom. The sauce is super fresh and amazing - up there with the very best I've had, and still very noticeable despite the above-average mozzarella coverage. The basil was fresh and plentiful as well.\n\nWhile eating we were talking about how spoiled we are in New York to be eating some of the very best pizza of our lives - better pizza than 99% of the humanity will ever experience - and critiquing it rather than just shutting up and enjoying. I think we wished the crust was a little more charred on the bottom (the large pie was a little nicer than the small in this regard) but other than that we were extraordinarily satisfied.\n\nThe decor is nice, jukebox a great touch (although it didn't seem to read any of the bills people were trying to use), and the room feels very spacious and nice - especially compared to last time I was there when it was still Grimaldi's! They do a great job of showcasing the coal oven in back which I thought was pretty cool.\n\nOur waiter, David, was great and very friendly, although I think we did actually order two small pies and got one large by mistake (easily devoured so no problem). At one point during the meal Patsy Grimaldi himself came over to ask how things were. Honestly, I'm a pizza nerd, but that's way up there on my list of  NYC celebrity sightings. Awesome too because he was a sweetheart and clearly very involved and passionate about the place.\n\nFor the record, since every other review seems to mention it, neither Juliana's or Grimaldi's had a line at the time. But anyone who waits in line for Grimaldi's is now a dope in my book.", "author": "Robert H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Visited Juliana's over the weekend. Great service, delicious pizza \u0026 a fun atmosphere. So glad we visited while we were in Brooklyn. There was about a 25 min wait, but wow, it was worth it!", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "Heard tons of rumors about this place and they all turned out to be true, minus the one about having to wait hours. Arrived here around 9pm on a Thursday and got seated right away. Our server was nice and helped with us deciding on what to order. Went with the No. 1 (mozzarella, scamorza, pancetta, scallions, and truffle oil). I'm a fan of thin crust pizzas so I definitely loved this! If you're a fan of pork, I'm sure you'd enjoy this one too. The only thing is that it cost $27 for a small pizza, I could definitely find something cheaper and just as filling at a pretty decent taste preference. But if you're in the mood for something fancier and it's in your budget and are nearby, I'd definitely recommend trying it!", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "pizza...\npizza...\npizza...\n\nservice was a bit rushed. my bill arrived before the pizza was done. plates were quickly cleared. server was hovering over the table and there was no line outside. i suppose they were trying to cash in the people that didn't want to wait in line at grimaldi, which is what happened with us.", "author": "Ally W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}