{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-25", "description": "A little too over rated. I had the marguerite and it was cold and had too much garlic", "author": "Larissa E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Best pizza in NYC! I make sure to devour a whole pizza myself every time I come to Brooklyn", "author": "Aleyna S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-21", "description": "Waited in the line for a while at an off peak hour.  I'm nota fan of any lines but we had family in town who absolutely wanted to try it. \n\nThe inside is cute and the waitstaff are nice.  The arugula salad was my favorite of everything we got.  The other mixed green salad was just OK.  We tried 2 different pizzas: a Margherita and a white. Both were just OK.  The ingredients are certainly fresh and it's the real deal. But it's not that memorable to me.", "author": "Lizzie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "I stumbled upon this place after eating at Grimaldi's one day. Standing there reading about the history of Patsy Grimaldi, I was shocked to find out Juliana's was owned and operated by the original owner. This was when I was approaced by an older man with a pleasant and warm welcome asking if I'd like to come inside and try his pie. I was disappointed, being on the west coast has deprived me of good pizza and when I do come back to visit I jump at any chance to visit a place with REAL NY coal oven PIE. I told him I wished I had visited his restaurant first. \n\nHe inquired and asked where I was visiting and if my experience was good next door. I told him it was good, but not as good as it used to be. \"That's good, that's good. I'm glad you had a good dinner. When do you leave? You can still come back and try mine if you have time.\"\n\nA man who could've jumped and talked shit about my experience, didn't. In true OG italian Don fashion, you let your work speak for itself. For that, you've earned my money. I came back the next day and ordered the usual- pepperoni, sausage, mushroom, basil, and garlic. PHENOMENAL. \n\nI'm glad you came out of retirement, sir.", "author": "Bui T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-17", "description": "Wanted to try a NY Pizza.  This place has a story, the owner of Grimaldi's sold the Grimaldi name to another entity, he decided he still wanted to make pizzas, so he opens this place, named after his mother.\nThis place is right next to the place he sold, there's lines out of both doors.  \nThere were probably a dozen people ahead of us, and they said it would be about 25 minutes and it was.  They asked us if we wanted to sit at the counter top and we said yes, it turned out to be a good move.  From this view, you can see from beginning to end, how the coal oven pizzas are made.  They form the dough into flat discs with thoughtfulness and precision.  They have a systematic technique of how to place the cheeses. Then, lightly sprinkle the sauce on top.  There are so many different pizzas, but it's fun watching them make one pizza after another, they definitely have their system.  It was surprisingly cool, considering how close we were to the coal oven, I think they thought ahead on this one.  They serve bottled soda instead of fountain tapped soda.  We decided to get \"Julia's\" housemade meatballs with tomato sauce as an appetizer.  The meatballs were soft and flavorful.  The sauce was a good compliment.  For the pizza, we got the No. 4, the tomato, mozarella, arugula and prosciutto (Italian ham). It is a thin crust pizza.  They give you silverware and you try to eat it with the silverware, but then, you just break down and start eating with your hands. Make sure you wash them.  My girlfriend and I can eat, but because of the meatballs, we couldn't finish the pizza. They wrapped it up to go for us, in aluminum foil, then in a to-go bag.  They did a good job wrapping it up for us. \nOverall impression:\nThe pizza was about par, but the experience of being in DUMBO, standing in line, then seeing how it was made was what put this place over the top and a definite recommend.  If it is only to say you've been here, it's worth it. I don't think I will return, unless I am taking out of town guests, but I do recommend it.", "author": "Peter J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "I hate it when restaurant closes between lunch and dinner. Am I gonna make it to sit down or be turn down after I waited in line? Ugh.. \nMade it in with last 6 people on line. Ordered white pizza with pancetta and truffle oil. I love anything truffle, I know the taste, I crave it, I want it lol. Sadly this pizza didn't even have the slightest flavor or even scent of truffles or truffle oil. I was so disappointed. It was a good pizza, but if you want truffle flavor, this is not the item to order. \nNormally at this point my rating would go down to two stars, but the polite and friendly service made up for it. Waiters were so welcoming and nice, you just can't get mad, even if the food disappoints.", "author": "Roma S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Waited a year to have a pie from here. Last year the line beat me but this year was better prepared and got here before opened. And all can say is WOW WOW WOW was worth the wait. BEST pizza anywhere ever hands down. Everyone is a distant second and can't compete!", "author": "Premal P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Great pizza, best in neighborhood of strong offerings. Get the pepperoni well done. Service is quick, the queue outside not so.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Very good pizza, fresh ingredients, very friendly waitstaff. We timed it well, is we had a minimal wait.", "author": "Val G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "This pizza is just ok. I'm definitely pizza lover, I had many types of it but standing in this line is not worth it.", "author": "Lilia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "NYC is known for pizza, right??  This place should be the official pizza of Brooklyn.  After walking around a majority of the day, we were famished!  We were specifically told to go to this place, nestled under the Brooklyn Bridge.  We were not disappointed, but rather amazed!!  We ordered the Margherita Pizza with house-made meatballs.  Let's just say, we finished the entire pizza, between two people.  The pizza was delivered to our table quickly, and cooked to perfection.  The meatballs were flavorful and mouthwatering with just the right amount of spices.  The waitstaff was courteous and attentive to our needs.  I definitely would go back to his place.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Had a half and half (Margherita and Sausage with white sauce), and it was amazing. I personally enjoyed the Margherita more. The crust was light and the ingredients were fresh, the pizza wasn't too oily. Overall great experience before you cross the brooklyn bridge.", "author": "Chen Wei C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Either it was the company, the prosecco, or the pizza, but Juliana's has such an atmosphere of mirth. The pizza was simply amazing - thin crust allowing the flavors of the mozzarella and basil to assail the senses (for the first pie) and with a hearty helping of rugula and proscuitto on the second pie. \n\nWith five of us, we left one slice on the two pies - the meal was quite hearty and leftovers, while undesired (since we all wanted to eat it all!) were unavoidable since the pizza is so filling. \n\nService was amazing - our waiter was accommodating and friendly, allowing us to even pull up another chair for a late friend. His chagrin over the lack of moscato was genuine and his recommendation of the prosecco was well received. \n\nLooking forward to my next visit here!", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "I was in NY visiting some friends, and one of my foodie friends has been raving about Juliana's since she discovered it.  Now, I like pizza, but it's not usually a transcendent experience...but that was about to change.\n\nWe ordered the number 2--cherry tomatoes, basil, mozzarella, garlic, sea salt.  Oh. my. God.  You got 99 problems, but this pizza will solve them all (unless your problem is gluttony...).  We got our pizza around 4pm (right around when they put in new coal in the pizza oven), and this pizza...wow.  Thin crust, with a little char, little crispy, little doughy, but not at all floppy (ugh).  Unlike most pizzas I've had in my life, this felt much \"lighter\" than other pizzas I've had--not at all greasy, with quality ingredients.  I thought my friend was crazy for wanting to stop in for pizza here and getting a pie to go, to eat on the way to our \"actual\" dinner...but this was so worth it.", "author": "Jenn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "A Must Try!. I grew up on several different styles of pizza, and haven't always warmed up to all of the NY coal-fired pies, but Juliana's stands high above the others. The crust isn't so thin that the toppings dry out, and everything on top is supple and delightful. The sausage, sauce and the fresh mozzarella have great flavor, and are as top-quality as I've ever tasted. The place, and the legacy of the man behind it are worth skipping the line next door to get a really piece of New York pizza history.", "author": "J E L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "After scanning many Yelp reviews and talking to various people that we met around the city, we decided to make the trip over to Brooklyn and try Juliana's.  The seating is limited so if you don't get here early, there's a good chance there's going to be a line and you'll have to wait.  The menu is pretty straight forward and I had the Marinara Pizza.  For the price, it was decent. It wasn't the best pizza I've ever had, but it wasn't the worst. Service was good, but attention to drinks could be better (or serve bigger sized drinks than 8 oz). I usually don't finish a 20-32oz. drink, but I was drinking these fun-size bottles like a camel. I'm pretty sure they charge per bottle too, so there's that. All-in-all, okay, but probably wouldn't return if we're being honest.", "author": "Mister D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Can use credit card unlike Grimaldi's. Excellent pizza and calzones. Ask about the egg cream! You'll be glad you did.", "author": "D B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Pizza is amazing! I love the thin crust, not too salty and service is really nice. Even the workers making the pizza in the back are nice and they smile if you're looking.\n\nI think the default is margarita pizza (mozzarella sauce, cheese and basil) and you can add toppings. We got 2 pizzas and 2 sodas for about $59. Kind of more pricey than the pizzas in Sacramento but it's really good. \n\nThis place is next to Grimaldi's but the line is A LOT shorter here. Julianna Grimaldi first opened what is now Julianna, but expanded next store to what is now Grimaldi. My sisters been to both and still likes Julianna's better. I haven't tried Grimaldi but this place definitely hits the spot, especially when the wait was only about 15-20 minutes compared to the 1hr+ wait at Grimaldi's.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "The pizza was amazing and the service was even better! Like seriously, a man next to me sneezed and a waiter popped up with a tissue. He came out of no where, everyone around us was amazed lol! I've been to Grimaldi's a few times, but this was my first time at Juliana's. Both are good, but Juliana's is now my favorite. So delicious!", "author": "Alexandria B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "Oh, the long strange tale of Grimaldi's pizza. Okay, so if you want the taste of the original Grimaldi's pizza WITHOUT the ridiculously long wait and IN THE ORIGINAL location of Grimaldi's, go to Juliana's Pizza. It's owned and operated by the original owners of Grimaldi's.\n\nIn my opinion, the crust is a crispier, which I prefer (my fiance thinks the crust is thinner too, but I'm not so sure about that), but the it's the same great taste that you would expect from Grimaldi's - classic old school New York pizza baked in a coal oven - without any of the hassles. There is a  bit of a line, but nothing like next door. \n\nLet the tourists wait at Grimaldi's, go to Juliana's.", "author": "Elle P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}