{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "The water taxi guy told us this was one of the best pizza spots in Brooklyn. So we hopped off the boat and decided to give them a try.  There was a line outside the door. We waited for about 45 minutes . Finally we got in and ordered a small pepperoni pizza and two glasses of wine . The server was very nice and professional. When the pizza arrived , it looked great, really cheesy , and saucy. It was a pretty good pizza, almost kind of gourmet style.... thin crust , great sauce and great flavor. Not sure if I'd wait for it again, but it was worth the visit .", "author": "Joanna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "This is a nice pizza restaurant in DUMBO. I went on a Saturday morning around 11:30 am right when it opened. There was already a line of about 20-30 people. I got a solo seat at the bar. I ordered a small margarita pizza (sauce, mozzarella, basil) and added on pepperoni and sausage w/fennel. There were eight good-sized slices. I had a lemonade to drink. It came with a paper straw. The pizza and lemonade were very good. The crust is thin and had a pretty good ratio of crispiness to chewiness. It wasn't quite as good of a crust as the pillowy soft offering of Una Pizzeria Napoletana, but the toppings were very good. Sauce was perhaps a bit more tangy than Joe's or Di Fara's, but still very good. Overall, Juliana's produces a very good, balanced pizza in a clean, festive environment. Even the music selection was good. They played \" It Don't Come Easy\", by Ringo Starr (with a songwriting assist from George Harrison). If you have time, it's worth the ferry ride from Manhattan once in a while.", "author": "James S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-30", "description": "I'm sorry, but I don't get the hype. The lines are long, the prices are high, and the pie is simply average. There are many better places in and around the city.\n\nI have a theory, in fact, that the long lines actually cause you to believe that you're having a great experience; you're starving after waiting in line for so long that anything would taste amazing. But please beware! This effect is largely a placebo.", "author": "Saket N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Can I say amazing !!!. Really really good pizza here . It's worth the wait . My fiance' and I seen a line while we were looking for parking and we decided to look on yelp for reviews of the different pizzeria spots and we saw that this spot had better reviews and plus the pizza was made in the coal oven.  \n\nThe wait was about 25mins which wasn't bad the line moved quick and the employees made the wait much quicker.  \n\nWe decided to get the small pizza of half pepperoni and half white pizza . It was amazing.  The best pizza that we've ever had.  \n\nI would definitely come back in the summer time and try out more of their selection.", "author": "Marcella A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Great simple pizza no 1.\n\nRight by the Brooklyn bridge, they have the most delicious sauceless pizza.\n\nCan you say scamorza affumicata 5x fast? \nThat's the Gouda lookin cheese they top the pizza with. \n\nOther toppings on the no.1, mozzarella, pancetta, scallions and truffle with olive oil. Delish. \nThis meal made up for terrible lobster rolls down the way.\n\nThe ambiance is cute pizza parlor meets milkshake shop. Very 50s, and I love the chalkboard person, Great skills ! Service was prompt \u0026 pizza was ready within 15 minutes.", "author": "Megan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "A true New York City pizza experience! \n\nThe vibe: friendly wait staff, loud enough to be uplifting quiet enough to hear each other speak, area where you can watch them make the pizza in the brick oven, solo bar seating, overall positive and fitting to almost any customers need\n\nThe food: the Margherita.. Mama Mia! Add pepperoni on top for the perfect pie. If you can't decide, you could always go half half; the white pizza is a favorite as well. \n\nThe wait: if you go at typical lunch/ dinner hours the line is LONG. Beat the rush and go around 3-5. There's still a line but tends to be shorter. Either way.. the wait it worth it!", "author": "Susanna N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "By far the best pizza in NYC! The sauce and toppings are excellent! I would definitely come back next time I'm in town! There was about a hour wait so be prepared but I'm glad it was worth it.", "author": "RH R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Great New York pizza.  The restaurant was clean, well run and friendly.  I got the Caesar salad and the dressing was incredible. We got the margarita pizza, New York pizza toppings by the way of cheese is scarce.  I eat keto and planned on eating the toppings only, and so I wasn't satisfied hunger-wise, but that's not their fault.  My husband loved their crust!  It was a delicious and good environment. \nThe line to get in was about a 35 minute wait at 2pm in the afternoon on a weekday, just for reference!", "author": "Jamie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Think crust when you ask (my favorite) got the chicken bbq I gave it 4 stars just because I love cilantro on mine and they didn't have it...the delivered with in 25-30 mins and was friendly\nRecommend for sure", "author": "Dawn J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "I went to the place when I visited NYC for a week and it was soooo amazing! With my group, tried 4 different pizzas (No.2, No. 3, No. 4, and a pepperoni) and they were all delicious with a yummy crispy crust! The ones with red sauce were my favorite because the sauce was so flavorful and peppery. Even the salad that we got as an appetizer we great - arugula with cherry tomatoes, goat cheese, walnuts - yum! The only complaint is the long wait- but it's a small price to pay :)", "author": "Julie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "They had amazing pizza! We tried the non tomato pizza that had truffle oil. My girlfriend and I are HUGE fans of truffle oil and it was an easy choice. While the pizza was still incredibly tasty, we didn't taste any truffle oil. \n\nThey close the restaurant from around 3-4 pm to allow a complete turnover and cleaning of the place. We waited in the line for 30 minutes (from 3:30) until 4 pm, but were very courteous and informed the line of their changeover. Once they re-opened they sat each table one at a time and allowed the server to get started so that they could ensure excellent service and that the kitchen and staff weren't overwhelmed. \n\nThe wait was worth it, the service was fabulous and the Pizza was incredible! Salute to the management and staff.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-19", "description": "The last time I visited NYC, I was intrigued with the notion of visiting the original Grimaldi's location in DUMBO.  However, when the uber dropped us off across the street, I saw the sign for Juliana's and I decided that it would be even better to come here.  We waited to be seated a fairly long line, so I amused myself by reading the following Wikipedia entry about the history of Juliana's:\n\n\"Pasquale 'Patsy' Lancieri founded a bakery in East Harlem in 1925. He converted the bakery to a pizzeria in 1933 and named it Patsy's Pizzeria, hiring his namesake nephew Pasquale 'Patsy' Grimaldi as a cook. Following in his uncle's footsteps, Grimaldi opened Grimaldi's Pizzeria on Old Fulton Street in 1990. The building has a history dating back to the 18th century, originally built as a tavern and later owned by Dipoline Manufacturing Company before becoming a pizzeria. In 1998, Grimaldi retired and sold the Grimaldi's brand name and franchise to Frank Ciolli. Several years later, Ciolli moved Grimaldi's Pizzeria to a larger building across the street. In 2011, Grimaldi announced he was coming out of retirement at the age of 80, but was unable to open a restaurant in his own name due to selling his brand rights. In 2012, he opened Juliana's, named after his mother Maria \"Juliana\" Lancieri Grimaldi, in Grimaldi's former location, starting a rivalry between the two.\"\n\nAfter I digested the above information, I realized that the Grimaldi's pizza I was familiar with (from visits to locations in Las Vegas and California) was actually a completely different animal than the original pizza I was about to experience at Juliana's.  We were finally seated, and I was really excited to try one of these pies!\n\nTo make a long story just a tad shorter, my excitement survived our waiter's indifferent, lackluster service, and the fact that it took almost half an hour to get water and our drinks.  It even stayed with me for the 45 minutes it took for our pizza to arrive at our table.  It completely headed South when I cut into the pie and tried the first slice...\n\nWe ordered a small Margherita pie, to which we added pepperoni and garlic.  Unlike the Grimaldi's pies I've enjoyed many times, Juliana's crust was soggy, undercooked, and bland-tasting.  There was just something missing; add to that the medicre taste profile of the cheese and the totally unimpressive sauce, and I couldn't imagine why I'd ever even consider coming back to eat here again, even without all the waiting.\n\nBottom line: The \"original\" isn't always best.  I think Frank Ciolli did good things with Grimaldi's recipe after he bought the rights in the 1990s.  I look forward to visiting another Grimaldi's location again in the not too distant future, but I won't be returning to Juliana's.", "author": "Jake P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "A gem in dumbo located next to Grimaldi's, Juliana's is an old-fashioned pizza restaurant with a pizza parlor vibe and super helpful servers. A medium pizza is huge ! And you will most likely bring home leftovers if splitting it with another person. \n\nThe crust is thin but still soft and not dry, the sauce and the cheese have the perfect ratio. My only critique is that it is not as customizable as most other pizza places I go to. There are toppings on some pizzas that they don't allow you to put on others which was confusing, however, I still enjoyed what I ordered ! They definitely stick to the classics and do those well.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Favorite pizza around NY! I first learned about this pizza place back in 2016 and have been bringing friends and family here ever since! It is always a great time and everyone enjoys the food here.\n\nThis place opens at 11:30am during the weekends and I would recommend getting here when it opens to avoid having to wait in line! Make sure your party arrives on time since they will not seat you until everyone is here!\n\nI have tried different types of their pizzas, but my favorite is still the Margherita! You can't go wrong with the basics (tomato, mozzarella and basil). Their crust is thin and chewy with light crispiness around the edges. I like how they spread out the toppings to almost the edges leaving just enough crust for you to be able to pick up the pizza. \n\nWould definitely recommend going to DUMBO to try out this pizza place. The area is gorgeous and you can walk around to see the Manhattan skyline with the Brooklyn bridge.", "author": "Crystal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Juliana's exceeded my expectations for service and efficiency. We stopped by on our way to a show at Barclays and it was a great choice. While there was a wait to get in, once we were inside the service was fast and the prices were very affordable. I'm used to New Haven pies, but the pizza was great and I will definitely return in the future.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "4.3/5\n\nDespite all the long lines during the weekend. Juliana's pizza offers some of the best pizzas in Brooklyn . More importantly, they offer half and half pie. Perfect for eaters who can decide what they want \n\nTip: I would recommend anyone who has a chance to seat at the barstools near the kitchen. This allows you to see the chefs making pizzas right in front you. While you're waiting for your own pizzas, your mouth will start watering by looking at dozens of pizzas make in front of you. It adds so much to the experience!\n\nAlso don't come during the peak hours over the weekend. The two hours wait is not worth it. I wouldn't wait for hours to get these pizzas but within 30 mins, I would say it's a go!", "author": "Byron W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "Came here for the famous Grimaldi's pizza and was satisfied by the quality and taste of it.\n\nPizza was well baked and toppings were very fresh.\n\nWe had two large pizza and they were enough for a group of 5.\n\nWhile food itself was wonderful, we had an issue with our order during our visit.\n\nWe had to wait for about 25+ minutes to get our second pie as our server made a mistake in processing our order and thus we had to spend extra time waiting.\n\nI will most likely visit again but I hope I don't have to experience the same issue next time when I visit.", "author": "Wesley C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "If are in the DUMBO area as a tourist and want to have pizza, Juliana is the place to go. However if you are making a special trip to eat here, I would say skip it. \n\n\n\nThe pizza is good, but not great. It is better than Gramaldis, next door,  larger and better tasting but there are better tasting pizzas all over New York.  I will say that it is a bit overrated  by critics. \n\nThe positives points are that the service was very good, prompt and well organized. The place itself is clean and quaint. One negative however while the pizza comes hot, it cools off quite fast, the air conditioning here is strong.", "author": "Osvaldo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Never a disappointment. Second best pizza I've ever had in my life multiple times at Juliana's.  The only other pizza that I've had better is in Phoenix Arizona believe it or not a little hole in the wall Italian spot.  The customer service from the waiters are below average. So don't go here for customer service to go here for the pizza alone. Last time we came was four years ago and we remember the pizza been better then but it still excellent now but has declined a little bit", "author": "Andrano C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-05", "description": "Tried Juliana's for the 1st time. Service was good, and attentive. Pizza was excellent. Top quality ingredients that were obvious. If I had to critique one small thing it would be pizza was a lot thinner than I would have liked. Nevertheless, a can't miss if your looking for an outstanding pie!", "author": "Rob C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}