{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "We made the mistake of getting here at 1:30 PM Saturday December 26.  The line stretched from their door to the door of their competitor, Grimaldi's.  But we decided to wait.  The wait (it took practically an hour to be seated) was worth it.  Pizza was outstanding.  We got a small Margherita and a small Pepperoni pizza, which was perfect for 3 adults and two teens.  The Margherita could have used more basil but otherwise all was excellent. Brooklyn Lager was a perfect libation.  As we were leaving, around 3:00 PM, we noticed the line had practically disappeared so use that bit of knowledge if you can when deciding what time to visit.  I would return.", "author": "David D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "I'm almost reluctant to write this review since I don't want the secret to get out, but I can't help but give a glowing review to Juliana's after my experience there last night.\n\nI've lived in the neighborhood for nearly 9 years now, and have been to Grimaldi's many, many times over the course of my 15 years in Brooklyn. I've witnessed Grimaldi's slow downward spiral from a relatively unknown, amazing pizza joint with brusque waitstaff and little atmosphere, to a complete tourist trap chain restaurant with long lines, downright rude servers and, still, little atmosphere.\n\nJuliana's is a breath of fresh air. It's a lovely redesign of what was a tired old space, the pizza is delicious, and the service is fantastic. My husband and I arrived around 7pm on a weeknight and were immediately greeted by the manager, Noel, who informed us that we were in for a treat, as both Juliana herself AND Patsy Grimaldi were in attendance at the restaurant that night. Our waiter was incredibly warm and friendly and even gave us a taste of a new Sixpoint beer they had on tap. We ordered the arugula salad (delicious) and a large pizza to share. The pizza was fantastic, with a crisp, thin crust that didn't even flop when you picked it up (the secret, we were later told, is in how they stretch the dough). \n\nAs we finished our meal, both Juliana and Patsy came over to ask us how it was. We chatted with them about what a welcome addition Juliana's is to the neighborhood, and they were incredibly warm and friendly. They seem genuinely interested in their customers' experience at their restaurant, and are excited to be back in the pizza business after a long time away. As we paid the check, Patsy asked us if we'd like some espresso and brought it to us on the house, along with, seriously, the BEST cannoli I've ever had. On the house. We left fully sated and buzzing about what a wonderful evening we had.\n\nIf you ask me, THAT'S the way to run a restaurant. Later Grimaldi's, I've found a new love, and it's Juliana's.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "We waited for more than an hour before we were seated. And since we were inside service was super fast and flawless. We ordered large special pizza which was a masterpiece of taste. We didn't finish it due to its size. Absolutely positive experience!", "author": "Stanislav P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "WOW! Probably the best pizza I've ever had. Granted I've never been to Grimaldi's, but really this place was amazing. I should note that Grimaldi's was uninviting anyway. They only accept cash, looks like an old and grungy establishment with a line around the block to get in.\n\nJuliana is very quaint and fresh. It's a new place and you can tell. They take cards and provide amazing service with no wait. I even got a free cannoli (amazing btw!) when we came here.", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Juliana's is a GREAT new addition to the neighborhood.  The staff is friendly and helpful (what a novel idea G's), the place is attractive, warm and inviting (rather than it looking like it moved overnight), the pizza is delicious and really the way it was intended to be by the original founders; Patsy and Carol.  Unlike some of the others here on Yelp, I am taking a side in this pizza war, and my money is on Juliana's!  Thankfully there is a real alternative to the arrogance of Grimalidi's (and the cardboard around the corner).\n\np.s. Don't forget to try the homemade Brookie deserts, it's a moist combination of a brownie and a cookie.\n\np.p.s. They actually accept credit cards!", "author": "Jay A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "The staff was friendly and welcoming. We went on a week night, no reservations, and were sat pretty fast. It's not a huge place and the tables are close together but we didn't mind. We got the white pizza and cheesecake, both were delicious!", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-22", "description": "The pizza was a burst of flavor! Absolutely amazing. They don't skimp out on ingredients and what makes pizza great.\n\nOnly downside is that after an hour of eating this, my stomach didn't feel too well and I haven't eaten anything else that day. I started breaking out in cold sweats, and I think it might have been the prosciutto.", "author": "C. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "My boyfriend and i came here on a Saturday night while in the city. the line was pretty long but we had waited anyways, i would as about 45 minutes. the pizza was definitely worth the wait. Pizza was very good we ordered simple Margherita and added pepperoni, sausage, and ricotta. we waited a good 25 minutes before our pizza came out, we noticed that the table next to us had received their food first which was kinda bizarre but was okay. the pizza was very fresh and worth the wait. they had wonderful costumer service i would really recommend. we paid 35$ for a small pizza and two drinks.", "author": "Amaya C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Truly a one of a kind pizza place. Highly recommend it. Pizza was all around very good. I prefer a little more cheese but the amount the put was adequate. The pizza crust was baked just right.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "My mom and I shortly before 6 p.m. on a Friday night with no wait. We shared a white pizza and had tomato sauce on half of it and sausage on all of it. I don't call myself a pizza snob or expert, but I've been to respected places like DiFara's, Barboncino, and Motorino. And I've been to Grimaldi's, that tourist trap next door. I feel terrible that Patsy Grimaldi's name is on a place that serves terrible pizza. But at least no one can say that about Juliana's, not just because he owns this place, but because that's his mom's name!\n\nThis... this is hands down the best pizza I've had in NYC. Perfect thin crust with enough rigidity to support the toppings but the right amount of chewiness/sponginess to enhance its taste. The mozzarella and sausage were solid. The tomato sauce? So good and fresh. Same for the basil.\n\nMy experience with servers' wine recommendations are usually hit and miss, but the glass of chianti that my server here recommended was spot on. Baby spinach salad was good, but nothing great to write home about. [rim-shot] Unfortunately, the substitute chef forgot olives for the salad, so after flagging the manager, he brought a side of 'em which worked better as pizza toppings. Cannoli was also the bomb.\n\nPatsy came by to introduce himself and ask how the pizza was. Well, you already know how I feel. With the nice location and atmosphere, plus reasonable prices, I'm definitely going back again.", "author": "Thomas N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-16", "description": "First, the mostly good news.  The space itself is quite nice.  The prices aren't that exorbitant.\n\nThe pizza is good.  Bonus points for crust that is the right level of crunch, without being too charred.  The toppings themselves -- prosciutto, arugula, and pepperoni, were also all good.  But, for the pepperoni pizza, 3 pieces of delicious pepperoni per slice just doesn't cut it in my book.  Fascati's (best slice place in the neighborhood) a few blocks away piles on the pepperoni, so, I feel this issue definitely needs to be addressed.\n\nBut, as expected in a restaurant that is only a few days old, the service was quite bad -- and I knew this -- but alas, I had family visiting from abroad and took the opportunity to take them to an authentic Brooklyn pizza since we were in DUMBO.   A place like Juliana's, you should be in and out the door in an hour.  Not 2.  There just was no communication between any of the servers.  Even poor Patsy Grimaldi was lost in the fray.   There was no broccoli rabe (for the #3) and we werent told this for a whole hour as we waited for our mythical pizza.  We ended up with the #4, but this wasn't what we wanted -- it was still good, but would have been nice to know that the  particular pizza we were waiting on was never going to come.\n\nHowever, even with bad service, I still expect some level of customer service and I think that should be present right when the restaurant opens.  That is, if the order is screwed up, or it takes forever, or if you are not acknowledged - this just leads to grumpy customers.  So, you try to mend things as best you can -- comp a glass of wine, or a dessert, or coffee, or anything really.  Nothing.  This really goes a long way in having satisfied customers. So, we left quite grumpy after having some mostly good pizza.  \n\nI'll return, eventually, but I think Juliana's is too green for now - it definitely needs a few more weeks.  For tourists, since I figure most of you will want to know.  If you're in this part of Brooklyn, you're better off going to Fascati's for a New York slice.  Or, for Neopolitan, Sottocasa or Luna Rossa.  I can't really recommend Grimaldi's 3.0 next door because I havent been to the new incarnation, and don't really have a desire to.  So, 4 stars for pizza, 1.5 stars for service.  I know the service will get better, both from the servers, and more importantly, the cusomter service.  I look forward to returning in a month or so.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "shhhh!  you guys!!  don't let the secret out!  let the tourists wait in line for 2 hours for a slice while we enjoy some REAL Grimaldi heaven!\n\nsuckers.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "The story behind this place and Grimaldi's is super interesting. We got the martini thin crust and it was delicious!  Service was ok and prices were decent!", "author": "Tammy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "This place was BOMB! It was so great it's bringing back my 90's vocabulary! This made that long trek across the Brooklyn Bridge so worth it. We got the sausage pizza, the meatballs, and a salad. Between my boyfriend who can eat, and me who typically eats a very modest amount, we finished ALL OF OUR FOOD. x_X and then we couldn't walk back because we were too full so we took the ferry instead.", "author": "Tiffany N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "The best pizza I've ever had, hands down.\nDon't get toppings. This pizza is best had on its own, just the plain Margherita.\nVery reasonably priced. Great, friendly, speedy service.\nNice ambiance; the music playing from the jukebox was great.", "author": "Ross K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "I walked in here a day after a snowstorm, tracking slush into the restaurant, and struggling with all the camera stuff I had on me: a camera bag and three separate cameras, plus an umbrella. To say the least, I was a mess when I entered. \n\n\"Hi sir, table for one?\"\n\nNo odd looks, no nothing, a cheery greeting and immediate seating. They gave me a moment to get out of my coat and hat, and to get my crap organized. I was brought a menu and I went with the #4. \n\nThe service here was excellent. Not only was the wait staff on point, they were friendly. My server happened to like photography, so we would chat about cameras between guests. Ok, so there's a little bias there, you say? Well other people did stop by to check on me, and were equally chatty and personable. Even Carol Grimaldi herself came to see if I enjoyed the pie, made small talk, and cleared the table when I was done.\n\nThe pizza itself was great, a good crust that has the right texture. Not gummy, not brittle...the right in-between. \n\nI'll be back here, and soon.", "author": "DeShaun C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-14", "description": "I called for pickup on the first day this restaurant opened. True to form, there is no delivery, but they do accept credit cards now! Although some restaurants need time to get into the swing of things with their new business and customers, Juliana's has the experience of 20+ years next to a brick oven via its owners Patsy and Carol Grimaldi. No warm up needed here! \n\nAfter watching the construction go on for months, with the news articles of the Grimaldi controversy taped in the brown-papered windows, I've been anticipating this slice like you couldn't believe! Basically, I've been drooling on my shoes every-time I walk by --and I was not disappointed.\n\nAs a local, I've been fed up with the hype and lines of tourists at Grimaldi's for years, and with Ignacio's temporarily closed (thanks Sandy) there had been a pizza void in my life. \n\nThis is the perfect slice of thin crust!\n\nWhen I was there waiting for my pickup, Patsy Grimaldi himself was making a Calzone. If he wants it done right, he does it himself! I'm so happy to have them back!", "author": "Tracy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "For those who don't know this is the original pizza spot .... The new Grimaldi's cannot compete ... I love Juliana's! the pizza is delicious and I took my friends from Canada there and they were blown away. It's my regular pizza spot when I'm craving a nice thin crust pizza!! Highly recommend!!!", "author": "Antonio G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "There is no competition, Julianas can hold strong against any other pizza out there. With Grimaldis right next door, not many realize that this is todays real Grimaldis opened by Patsy after selling the Grimaldi Pizzeria. But once you taste the food, you know that this pizza is the most delicious pizza you will ever taste. Just the right balance of cheese to tomato, and crust you could practically read the newspaper through, love and care goes into every pie coming out of their brick oven. From their perfect calzones to their marvelous pizza, Julianas is the best pizza I've ever had to pleasure to experience.", "author": "Josef A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "I'm pretty picky about ratings but Juliana's deserves 5 stars. \n\nI was totally unaware of the \"pizza war\" before visiting Brooklyn but after reading a dozen or so reviews, I decided to walk right past Grimaldi's and into the pleasure that is Juliana's.  \n\nEverything about our experience was great - very nice location, good atmosphere (nice upscale change from your typical hole-in-the-wall NY pizza joint), good service, good beer, decent prices (a bit pricey but hey - this place has a great reputation), and most importantly of all, great food. \n\nThe pizza was huge and thin and delicious and just plain awesome. Everything I'd expect and want from NY pizza. And then there was the cannoli. Oooh I'm a big cannoli guy so I was quite surprised to discover the cream had anise flavor (which I don't care for much at all). Somehow though, it worked and was absolutely delicious and cheesy and the perfect texture. \n\nIf we're back in DUMBO, we'll be most certainly be back. No need to even try Grimaldi's.", "author": "Tim M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}