{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "I'm not really a pizza person.. I'm usually fine with my $2 slices from Costco but I thought I should give an authentic pizza spot a try. My boyfriend and I came on a weekday and waited until they opened at 4 for a spot.\n\nService was spot on; we got our water and menus really quickly and our server this taller gentleman was so nice and sweet. He had such a positive and joking manner with us. We ordered 2 drafts ($7 each) and a small Margherita pie with sausage ($18 + $3). Everything also came out really quickly but that was probably because we were one of the first parties to order. Pizza was hot and everything was fresh and perfectly seasoned especially the fennel sausage. \n\nGreat experience for such an expensive pie but for me it was nothing extraordinary won't be coming back.", "author": "Nan Qi Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "The long wait for is worth it. #1 special pie ... awesome.... also had pizza margherita with pepperoni... yum! Don't go for the fancy drinks, not worth the price. Espresso and New York cheese cake very good too!", "author": "L S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Don't get me wrong, I love pizza, but something you might not know about me is that my pizza palate can be considered by some as \"horribly unrefined\" or \"terrible.\" I can appreciate fresh toppings and simple ingredients, but more often or not, I'm happy with the local pizza place down the street, or even NY dollar-slice pizza. Yeah, it's that bad. Nonetheless, I was peer-pressured into going out to Brooklyn to try Juliana's, which was started by the original Patsy Grimaldi, after the original Grimaldi's was sold off and turned into a tourist empire, sparking some crazy feud.\n\nJuicy gossip and long-standing rivalry aside, Juliana's is great. The inside looks like your typical pizza café, only with hordes and hordes of lines (though, not as crazy as Grimaldi's). I felt like I should go with the margherita, so as to appreciate the pizza in its purest form. However, we couldn't resist the allure of the No. 1, which had white truffles and pancetta, so we just ordered 2 pies for the two of us. Gluttony at its finest.  \n\nBetween the both of us, we couldn't get through a full pie, but it was totally worth it. The hot, fresh pizza had the perfect chew, and the acidity of the tomatoes didn't overpower the richness of the cheese. The slight basil flavor still came through, and in all, it was a perfect slice. The No. 1 was great too, as anything with that much truffle and rich, fatty pancetta is just a meat flavor explosion. Heh.\n\nIn all, is the pizza worth waiting in line for? Sure, if it's a short-ish line. I would agree it's the perfect slice, but how much are you willing to pay for it? It should be worth noting that this pizza is just straight up expensive. A large margherita will set you back $20, and a small No.1 will set you back $27. Yikes. However, you're almost guaranteed a top-notch pizza, so you gotta figure what that's worth to you. If you live in Manhattan and can't be bothered with going down to Brooklyn, I actually really like Luzzo's in East Village for a good, high-quality pie that's fairly similar in taste and texture. It's not quite as good, but it'll satisfy you until you can make your way down here. One of these days, I'll come back to taste that perfectly-baked pie, with more friends, so I can try the other offerings without having to buy a pie per person.", "author": "Eric J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Ok so it's a coal fired oven. The pizza was topped with fresh Matzurella, an imported smoked guda or brei cheese and of corse the prechuto, then drizzled with a garlic oil and chopped chives or green onion. Now, I like pizza but it's am appetizer in reality but this pizza was an experience. I mean I've had pizza with prechuto on it before but nothing comes even close to this. The first bite was a shock because of the smoked flavor which I didn't expect then taste the garlic oil and salt from the baking of the prechuto. A sound came from me I have never heard before. I actually felt tears welling up I had ti fight back. And that was just my first bite. I couldn't stop eating this pizza the crust was crispy the whole way through with just the right amount of char to give it flavor but not taste burnt. The cheeses where sublime the smoke from the guda or bri or smoked Matzurella along with the fresh Matzurella combined garlic oil perfectly and the prechuto wasn't overpowering the only bad part is I won't have that same experience again.", "author": "Shawn D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "This place owned up to its reviews. Perfect ending after walking the Brooklyn bridge. Went at 6 pm and only waited a few minutes. The staff was friendly and service was quick. Pizza was good, I like how you start with the base pizza and add whatever toppings.\n Hint: the most popular is the Margherita pizza which is just traditional tomato sauce, Mozzarella, and basil. My only critique: more basil!", "author": "Kendra D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Hands down Juliana's pizza is the cornerstone for authentic Brooklyn style pizza. I've been here twice and will continue to come back whenever I'm visiting the east coast again.", "author": "Marco E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "In the heart of Dumbo pizza delicious staff polite and courteous clean price not bad either", "author": "Emmanuel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Holy Cow you guys! This place is amazing and totally worth the wait. There were only two of us so it was not very long but even if it had been it still would have been worth it. We ordered the margarita pizza and added sausage and arugula . It was so yummy. We got the small and still had left overs. It made for an amazing snack on my flight back to LA. \n\nThe crust was perfectly cooked and the toppings were generous while not overwhelming. I know we took a classic and tweaked it but it was so worth it. I loved and savored every single bite.", "author": "Sarah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "After Trip Advisor voted this place the 'Worlds Best Pizza', of course I had to try it. The pizza was pretty good and tasty. I just wish I could eat it fast enough so I could eat it all while it is piping hot. My first bite was delicious and I was impressed. My sister and I shared a large pizza and it was a great size, enough to feel sufficiently full without feeling stuffed. \n\nI was impressed with the prices too, considering it's good reputation, they could have hiked up their prices. We ordered a marinara pizza with meatballs and mushrooms. It was a great choice. Although all of the pizzas I saw coming out looked great. \n\nWe also decided on dessert, I had a brookie bridge, a brownie ice cream sandwich and my sister had cheesecake. My sister really enjoyed hers, as did I. The cookies were amazing, but the ice cream was served to me half melted, and it continued to melt as I ate it, so by the end I just had cookies. So that was disappointing. I'd say stick with the pizza. \n\nWe didn't have a long wait, about 20 minutes on a Tuesday lunchtime. Once seated, You are quite packed in though and feel like you are dining on one long table as opposed to a table for 2, but I'd rather that than have a longer wait.", "author": "Lynsey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Ok ok I guess my cousin really wanted to see what the hype was all about. She woke up early to get in a shorter line (than the night before when we attempted) to get this expensive but delicious pizza :) I love white sauce selection because I'm not a fan of tomato sauce!", "author": "Vicky T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "I am a firm believer that bagels and pizza are still the best in New Jersey, and not New York, but Juliana is surely swaying my opinion. \n\nMy bf and I were here early on Sunday morning knowing very well that the line at Juliana's could get pretty long on any given day. Having done our research, we wanted to get to Juliana at least 30 minutes early thinking we wouldn't have to wait too too long, if the line was like we imagined. Thankfully we had approached the storefront along with other and noticed patrons just standing around, but sure enough a line was form in no time and to our luck the second party in line. \n\nWe had strategized our approach to the menu before getting there, but unfortunately were denied when we found out that Specialty pies cannot be changed, altered, but most of all cannot be split. So we had decided on a Large pie, split between a classic MARGHERITA with extra garlic, and a WHITE PIZZA, with sweet onion, ricotta cheese, and sausage.\n\nOur pizza was out on time. It was served hot, fresh, with evenly distributed toppings. The tomato sauce was so simple yet so light. The ricotta cheese light and fluffy. It was the perfect balance of ingredients and flavor. The dough was super thin in the middle, doughy but still rather light by the crust. \n\nThere was no doubt that this pizza was one of the best we've had in a long time, and it obviously showed since the large pie we ordered, was easily consumed by just the two of us.\n\nTIPS:\n\n-Go early, 30 minutes before opening so that you're not waiting in line the entire afternoon\n- the Specialty pizza pies cannot be split, only the classics, so select or customize the classics accordingly\n- spliting the pizza half with a white base, half with a tomato base is possible!", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "The pizza and meatballs were so good!! We had to wait outside for 30 minutes however once we were sitting the service was super fast! The pizza crust was thin and the sauce and cheese (we got a regular margarita pizza) were amazing! A bit pricey ($22 for a large margarita pizza) however it's NY!! I will for sure return there when I'm in New York!!", "author": "Armand J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-28", "description": "Service was excellent. Pizza was meh! Sbarro in the mall has better pizza. Waitstaff was very nice though. We arrived a bit before they reopened at 4 and stood in the freezing wind. Would have been nice to have been able to use restroom while we waited as \"stoking the fire\" meant standing around until 4. Once inside the restroom didn't even have toilet paper on the rolls so stocking supplies was not a priority. Another group next to us got up and left to go to their competition next door.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Awesome Pizza!!!!!   Have fun ordering.  Our favorite ordered was a Classic with Peppers, onions, pepperoni.  The red peppers give it a nice kick.  \n\nThe staff was very friendly and the restrooms were clean.  These guys don't mess around when it comes to pizza.  Great cheese pizzas known as white pizzas.  This place has the amount of stars and reviews for a reason!!", "author": "Victor P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Holy guacamole! We arrived at about 4:05 PM and we're glad we came that early! The place was already filling up after being open for 5 minutes - we soon figured out why. The pizza was incredible, staff was irreplaceable and the atmosphere was immaculate.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "Comes up for gluten free vegan pizza and they don't even offer them when I called. False advertising.", "author": "Ellie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "I was worried this was just a trendy joint that monopolizes on the proximity to the bridge.  But I fell prey of the trend when showing some friends around NY.  There were 7 of us and the line was around the corner.  We asked the front of the house gentlemen how long the wait will be and he promised a reasonable time considering.  We patiently waited and I am so glad we did.  The wait ended up being shorter than anticipated.  The No 4 pizza was by far one of the best pies I've every had but all of the choices were equally delicious.  To top it all of, the service is one of a kind. They're not just friendly and nice, they make you feel like you're a friend from the moment you walk in.  I'm so glad that I didn't write this place off as just a trendy joint near the bridge because as it turns out it's a friendly joint near the bridge.", "author": "Kasia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "This place was voted to have the best pizza in NYC and boy they did not disappoint. I got a bottle of their cheapest white wine and there's no complaints there. The staffs are very attentive and will do as much as they can to customize your pizza the way you want it. The minute you take the first bite, the world just slows down around you as that cheese and dough melts in your mouth. Delicious.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "This has been my favorite Pizza joint in the city back when it was still under the Grimaldi's name. I haven't tried to venture next door, why bother when the real deal is right here at 19 Old Fulton St.\nWhat can I say that hasn't been said before? The pizza is worth the wait.\nI came with my friends on my last trip here, one of which has never been to the city but has been to the best of Chicago's deep dish establishments and waited over 3 hours to get seated. Here we waited less than an hour and he said he found the pizza to be superior. Yes, it's not fair to compare two vastly different pies but they are both called Pizza and Juliana's wins.\nMy other friends have only been to Lombardi's, and they too agreed Juliana's was clearly much better.\n\nWhy? All the aspects that make a great New York style is there. Good fresh ingredients, good ratio of cheese to sauce, and a crust so good you can eat it on it's own. I don't think I need to go on.", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "I don't know what I'm missing that 1,600 people seemed to have gotten from this place, but this pizza is pretty mediocre in my opinion. I got a $1 slice of pizza that was FAR TASTIER the following day at a random place in Murray Hill that has a lot less hype. My sister and I came here on a Thursday afternoon at around 2 pm and waited in line for ~30 minutes. Maybe our expectations were way too high after waiting in line for that long on a weekday afternoon and seeing all of the really high Yelp reviews, but I really don't think this place is anything special. We got a margherita pizza with sausage that had about 4 basil leaves on it. You need way more than that for a margherita pizza. When we first bit into the pizza it was pretty flavorless, so we had to really help it out with a large dose of red pepper flakes and normal pepper.\n\nIn other words, if you definitely want to wait in line for a long time to visit a tourist favorite, you should go to this place, but if you want food that's quick and decent, I would visit one of the many other DUMBO establishments around it and skip the line.", "author": "Julia S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}