{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Why can't we have pizza like this in LA?!\n\nWe were recommended to eat here for good pizza and so glad we did. This place gets crazy packed, BUT the pretty awesome thing we encountered is that you can order to go and find seating outside. \n\nWe happened to find seating a few feet down and ordered some beers from a bar right in front of us. Pizza + beer = happiness!!! We ordered just regular pepperoni pizza and it was perfect, it was a bit greasy which made it so damn tasty!\n\nThis location is perfect because you can walk around to other restaurants, bakeries and not too far from brooklyn bridge (which is where we came from).", "author": "Diana H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "I don't know were to start. The service by itself was amazing. Thanks to the amazing waiter that took care of us. Now the the food it's self. We normally finish our foods because we are too full but we couldn't stop eating our food because all the flavors blended amazingly well. The desert was just out of this world. This place has one of the most amazing deliciousness pizza. Now every time I come home to NY I know we're to go.", "author": "Gaudys F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Delicious pizza! But on Thursday night, there was a line. It's not too terrible if you have a small party, but large parties may want to be wary. The service was very attentive, although they accidentally put an arugula salad on our tab. Once we brought it to their attention, they quickly gave us the correct check.", "author": "Jacqueline S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Outstanding pizza, desserts, beer, and service! Get there early -no reservations. Seating inside or outside. Great brick oven baked pizza!!!! Can see Brooklyn Bridge with little walk.", "author": "Patti B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "This place is worth the hype! Definitely better than Grimaldi's (which is right next door).\n\nWaited on line for about 10 minutes for a party of two. Service was fast and ambiance is good for a casual lunch date.\n\nThe Manhattan orange soda is delicious! You can really taste the cane sugar instead of that nasty fructose corn syrup. Would recommend to pair with your meal!\n\nWe got the white pizza with meatballs and loved every bite! The crust is super thin and crunchy. The mozzarella and garlic went great with the meat, too.", "author": "Crystal C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Located in Brooklyn, right when you get off the ferry from Manhattan.  I had the pizza with prosciutto and mozzarella.  A small pizza is like the size of a large.  Delicious and worth the wait.  It does tend to get crowded, but the greeter is so personable that you don't even get impatient waiting.  If you came with good company, who really cares how long the wait is because it's your chance to talk more without your mouth stuffed, right? \n\nTheir crust is thin, so they depend on their toppings to pick up your palatable palate experience.  Everything was done right--- the service, the timing, the ambiance, the comfort, and the pizza.", "author": "Maria D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "We decided to get pizza after walking across the Brooklyn bridge. There was a line of maybe 15-20 people and we were seated within 25-30 minutes. The server forgot a glass of wine and we had to remind him twice for it. We ordered a large margarita pizza and it was huge! The cheese and basil was so fresh. The entire thing was amazing. Will definitely recommend!!", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Must have if in DUMBO. Delicious and great atmosphere. Meatballs melt in your mouth, we had the white pizza with pepperoni and the #1. This is what I was expecting from N.Y. pizza.", "author": "Katrina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "The pizza here was fine, but I didn't think it was anything that special. I didn't mind waiting in the line when I thought it was going to be extraordinary pizza, but it ended up just being okay pizza. I think I enjoy the 2 Bros $1 pizza just as much.", "author": "Haley S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Yes! Worth trying at least once!\n\nI'd literally walked/run by this place so many times that I was half excited half relieved I could finally try Juliana's out one Saturday afternoon. Came with my sister; we waited about 30 minutes - could be worse! \n\nWe ordered the small size of the #1 (which looked to be popular on Yelp) and it was plenty for the two of us. It didn't have a red marinara base, but rather was a white pizza with mozzarella, pancetta, truffle, and scamorza. The pizza was solid, but didn't blow our socks off or anything. I kind of wish we'd taken our waiter's advice and gone for a red sauced pizza - that's usually more of my jam and also seemed popular. \n\nThe service was attentive and friendly. There were short lines for the bathroom - they have one upstairs and one downstairs. A bustling and always full restaurant, but didn't feel too cramped. \n\nAll in all, it was good pizza, at a price that's a little bit more expensive than other pizza restaurant joints. I'd probably come back if there was a wait that was less than 30 minutes, but otherwise, too many other choices. Once was enough to check it off the bucket list. If I were to come back, I'd probably want to check out this delicious looking #4 next...", "author": "Annie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-19", "description": "I had to try Brooklyn pizza while I was in town. I was told about another place from a fellow Yelper but they were closed on the day I wanted to visit. So the quick Yelp search, this one came up.\n\nParking was difficult. I found a garage with some walking (it was $17 during first one hour). Since it wasn't lunch or dinner time, they weren't busy at all. Walked in and seated immediately.  However, as the time passed (got closer to dinner time), they were full.\n\nPizza I had was just okay.... I think I expected too much. It wasn't bad at all but not the best pizza.  I think it's the best to eat scamorza fresh.  Pancetta dn white truffle had great flavor.  I could care less about their dough.  I saw a nice oven in the kitchen, so I don't understand why the dough didn't taste proper.\n\nService was standard, nothing special.  Portion size was huge.", "author": "Yuko H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Truly the best pizza I have ever had, and the story behind this NYC pizza legend is worth reading. Our favorite pizza is the margarita with pepperoni.", "author": "Brandon N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Hands down, Juliana's is my favourite pizza I have ever had. It was my first time in brooklyn and my friend recommended it. This place is phenomenal. The owner and staff are so friendly. I would definitely recommend the margarita pizza. Its a bit pricey at around a 18$ price point but its worth every every penny. I will just say that your face might explode from how good this pizza is. The service is very friendly too. If you make a trip to the bathroom, on the way there you will be passing by the kitchen where you can see them make your pizza. Its a really interesting experience. \n\nAs a side note, they do not allow outside drinks and I was carrying a monster energy drink and was told to throw it away. So if you don't want to be losing your drink don't bring outside drinks in. Other than that I cannot complain", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Warning: There WILL be a line. You WILL wait a while, especially if you're party size is more than 2. You WILL find it worth it the first time you do this...and then you'll feel like you checked it off your list and never have to do it again. I waited an hour and 15 minutes (as I had guessed beforehand).\n\nI had the margherita pizza + sausage as well as their Special #1 pizza. Both were solid choices and I got exactly what I expected. The pizza was a little burnt on the margherita pizza so that was a mildly unpleasant surprise, but the service was fine and at the end of the day, this is just pizza. \n\nI don't think I'll be back, given the lack of the \"it factor\" in the pizzas I had...they're just good pizzas. A lot of other places throughout New York will satisfy a pizza craving just as well, including Grimaldi's which is literally right next door with a wait time that's likely going to be half the wait. \n\nThe desserts are also just average. Cheesecake had a very large filling-crust ratio, the ice cream is just from Brooklyn Ice Cream Factory (which is also just average).\n\nOverall, it's a try-it-once type of thing. I don't think it'll blow your mind.", "author": "Sunah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "I enjoyed this pizzeria. The staff were helpful and friendly. We received a table rather quickly. We ordered the #2 (I wish we would have ordered the margerita instead). The pizza, itself, was really good. I love thin crust \"Brooklyn\" style pizza. I'm from Cali, so it's good to get it in Brooklyn. Nice place, nice atmosphere. \n\nThank you, enjoy!", "author": "Mitch B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "This place is a gem!  Located in the heart of DUMBO, its an amazing place with great location.  Love the food and the pizza never disappoints.  Lines can be long, but they are generally better than Grimaldi's.  The owner of this restaurant is actually the original founder of Grimaldi's I believe.", "author": "Sabrina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "One of the popular pizzeria in Brooklyn DUMBO.  Exceptional customer service.  Great location next to Brooklyn Bridge Park and DUMBO.  Had their classic pizza with sausage, very impressive.  The coal stone oven pizza was made just right.  Small has 8 slides with good size, perfect for two.  Highly recommended.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Second time coming here. Worth the trip out of the city. Beautiful views in the park outside to walk off your yummy pizza. Classic margarita with pepperoni", "author": "Vanessa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Made our way in here after a walk across the Brooklyn Bridge. Located right next to Grimaldi's, both places have lines out the door. I don't think the time of day matters because this place seems like it's busy all day and everyday. My group of five ordered two salads, 2 small pizzas, and an order of meatballs. Our arugula salads were fresh but overdressed. The meatballs (3 per order) were moist, tender, and had a healthy amount of tasty gravy. The pizzas were that perfect combination of crispy and chewy with just a touch of char from the coal ovens. Looks like they boast some of New York's best egg creams but we opted for bottled cokes (little bottles). \nService was very friendly and prompt but we were not given enough settings/silverware and had to wait for them while our food was on the table. We also had to ask for water refills and when our server refilled waters the pitcher was leaking water all over our pizza. He saw it and we brought it to his attention but he just said \"Sorry\" and wouldn't stop pouring the waters,via leaky pitcher, over our food. My friend instinctively put her hand underneath to stop our pizza from getting soaked but another one of us finally moved our food out of the way since our server obviously didn't care. Seriously guy? One extra body movement or even having us hand you our glasses would have rectified that easily..but hey I guess water logged pizza is acceptable.\nDespite the service hiccups we thought the place was a great little spot.\n The host was delightful and made sure we all took the right trains and went to the proper subway stations since we were going in three different directions. Thanks for the transit help. I'd recommend it to friends who are in that part of Brooklyn.", "author": "Kara L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "We tried this spot 10 years ago, not realizing that at that time, the original owner sold his shop Grimaldi's to a customer. I seriously thought that was the best pizza I've ever tasted in my life! We decided to try the same location but with the treat of the original Grimaldi's owners pizza, and unfortunately were left a little disappointed. We got the classic margherita pizza (again) and a couple beers. Wait was about 35 min.\nIt wasn't bad, but it wasn't mind-blowingly amazing like 10 years ago from Grimaldi's. Unfortunately we didn't have time this time around, but next time I'm in New York we're going to have to try Juliana's and Grimaldi's side-by-side.", "author": "H Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}