{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-05", "description": "Friendly, atmospheric and totally delicious pizzeria. Had to wait for 30 min outside but worth every moment. Probably the best pizza I have ever had", "author": "Charles J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "We ordered the No. 1 pizza special, which was great. Unfortunately, it took almost an hour to make.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "Brick oven pizza. So good. The place is a bit small inside since they pack everyone in. The manager was very nice to us as we waited outside then changed his tone when we were at our seats. He yelled at our waiter for making sure my friends dessert was good and told him if she don't like it then she don't have to eat it! That was horrible. I guess this place will make its money no matter what because brick oven pizza sells itself.", "author": "Charleene R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "BEST PIZZA IN ALL OF NYC\n\nGrimaldi's next building over probably get more tourist hits due to their higher number in Yelp reviews. However, I would visit Juliana's over and over again when it comes to pizza.\n\nThis place was BOMB!\n\nWe got the white pizza (No 1) and a red pizza (Margherita). They were probably the best pizza I have ever had. Hands down try the margherita pizza. You won't be disappointed.", "author": "Jenna Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Juliana's how do I love thee? Let me count the ways? Honestly being a Californian I really did not understand the entire \"nothing is better than New York pizza\" until I had Juliana's. Juliana's has ruined all other pizzerias for me. If you happen to be there during their busier times, see a line but wonder if you should bother trust me it's worth the wait! My absolute favorite is their white pizza! Something so simple but every bite is like heaven! Their crust is light \u0026 buttery and I appreciate the smokiness of their pizzas being coal fired. Their No. 4 arugula \u0026 prosciutto is another favorite of mine. Oh! Make sure to leave room for dessert! Do yourself a favor and order their cannolis. I'm not big on cannoli but their mascarpone cheese filling had me at first bite!", "author": "marie q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "LINE WAS LONG BUT WORTH IT! We got the guacamole and chicken pizza and the margarita pizza! The pizza was thin and  the toppings were not over bearing! I def would recommend this place but it's first come first serve!", "author": "Asia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "If you like pizza like I like pizza you know that Juliana's is one of those iconic places that you'll probably never eat at unless you do so purposefully especially if you live on the opposite side of the country from it. \n\nWell, for me, Juliana's was an incredibly happy accident. My last evening in NYC, I was kind of stumbling around, with out a plan for dinner and I literally happened upon Juliana's just before dinner service began. I happened to be the first person in the restaurant for dinner and I scored a counter seat. \n\nI ordered a prosciutto, mozzarella \u0026 arugula pie. Happily I watched the kitchen staff whip up our after pie after pie after pie, each time trying to decipher if this one, this one was indeed the one that would be pleasing my palate. Watching them (the kitchen staff) in motion was almost like watching a ballet. Their moves were precise, \u0026 purposefully timed. Work stations were clean, supplies were well organized. If I didn't know any better, I'd say these guys know what they're doing. \n\nFinally, the moment id been waiting for, the moment that up until 20 minutes earlier, I was sure would likely never happen, I had a pizza pie, from Juliana's staring me in the face, daring me to dive in. Dive in I did. \n\nThe crust was crispy and chewy in all the right places. There was a perfect amount of  char throughout, the sauce had the tang and slight sweetness you'd hope for in a good tomato sauce, everything was fresh. All of that, combined in one perfect bite, I can't tell you what that does to your taste buds, not here on this forum and not to do it justice. It all tasted so so good. So good. So very good. \n\nService was prompt and attentive but never a bother. I spent $38 for a whole pie and a coupe of non alcoholic drinks.", "author": "Jarred D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "The pizza here is excellent. We waited 45 minutes but it's worth it. I really enjoyed the margarita pizza. This is probably the best pizzeria in Brooklyn.", "author": "Jonah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "First of I love the location it's so nice and quiet I would say 5-10 minute walk from train station into dumbo.\n\nThe pizza was super good and fresh I also enjoyed how the space wasn't huge so it felt pretty intimate. It was also nice to see the huge pizza brick oven. I really enjoyed the pizza we got I can't recall the name but it had argula and ham. The other pizza specials looked really good so can't wait to go back and try more!!", "author": "Gabby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Don't bother with Grimaldi's. They may get all the hype, but Juliana's makes much better pizza. The meatballs and pizza were delicious and whatever sauce they use is amazing. The prosciutto was some of the tastiest that I've ever had. I will say the crust on the pizza could have been a little crispier. Everything came out super fast though and the server was really attentive. My girlfriend and I paid a little over $70 for two beers, one app, a small pie, and a dessert which is kind of par for the course in DUMBO. This would be a great place for a date or a family dinner.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "Pizza crust was great, cheese is excellent, sauce is soulless.  Everything we had other than pizza was really terrible.  The salad was inedible and the stunningly expensive meatballs had so much black pepper in them half my family wouldn't eat them.", "author": "nina r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Definitely worth the wait! Line looked long but went fast. Pizza was so tasty and made to perfection.  A must try in NYC.", "author": "Irina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Delicious! It lived up to the hype. The pizza was so good. We had their No. 1 which is a cheesy white sauce pizza with pancetta. Everything about the pizza was fresh. They even had a marinara pizza without cheese on their menu which was awesome because my son is allergic to dairy. Most pizza places give us a wierd look when we order a pizza without cheese and Juliana's already had it on their menu.", "author": "Lelonnie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "A generous 4 stars. Good, but not the level I expected it to be. This is owned by the former owners of Grimaldi's, 8 Years ago when I had gone to Grimaldi's it was one of the best pizzas I have ever had.\n\nLong line for the visit, but not terrible. Probably waited about 30 maybe 40 minutes at the most. Once seated I ordered an Egg creme, some wine, and we shared the Margherita pizza and the No 1 specialty pizza (mozzarella, scamorza affumicata, pancetta, scallions and white truffles in olive oil - no tomato). \n\nThe pizzas were good and the crust was classic thin crust, but the pizza could have been cooked a little longer. The tomatoes were a bit bland and on the watery side. They could have used more salt. This wasn't bad at all, but this place gets a lot of hype and I'm wondering if the Grimaldi's located next door is the better option. Not likely since they are now corporate owned, but possible. I will stop by Grimaldi's on my next visit just to know for sure. On the bright side this is definitely the shorter line of the two. Most visitor's are not aware that the Grimaldi's name has been sold to new owners. The white pie specialty no.1 was the better of the two. I'm not a big fan of white pie's so I don't have much to compare that too. Definitely better than what you get outside of the north east. Very high quality of ingredients are being used here!\n\nI have seen them voted best or close to best pizza in NYC. I disagree with either assessment. They also get voted best Egg Creme which might be the case. The Egg Creme I had was the first I have ever ordered. I liked it but it was nothing that made me want to come there again to order it, even if there was no line, but others who order Egg Creme's regularly might feel its worth a special trip.\n\nLocation, Location, Location. The best thing about this pizza place is the proximity to the Brooklyn bridge. Even though I was a bit disappointed, it is still a lot of fun to get stuffed on some good pizza, and walk if off as you take the long stroll across the Brooklyn Bridge. The location is clean and well kept, but nothing stands out about it. There is no real charm or noteworthy details. This is a worthwhile experience for any tourist and I would recommend stopping here to do those two things. This is good pizza, but I would not put it in NYC's top 10 where you may often see it. I will make a return visit and my opinion on that might change next time around. i understand every brick and coal oven place can have an off day, or a few random  pies that were not up to the usual standard.", "author": "Terry B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Nice sit down pizza place that's worth a trip to Brooklyn from, well, anywhere. Actually one of the best pizzas in New York in my opinion. The specialty pizza with the cherry tomatoes on it is so dang GOOD, and so is the lentil soup.", "author": "Kristina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Came here when it opened at 4pm on a Friday and was lucky enough to get a seat because this place usually has a line down the block of people waiting. Let me tell you, this is the best pizza I have ever had in New York. This was my 2nd time visiting and it was just as amazing as my first experience. The crust, sauce, herbs, cheese, everything was perfection. We also had a wonderful server Dave who just topped off our experience. Will definitely be returning during our next visit to Brooklyn", "author": "Sylvia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "I love the pizza, but the wait to get in is too long and the seating is very crowded. It takes away from having an enjoyable meal.\n\nIf they are doing takeout and the weather is warm enough, order your pie and eat in the park!", "author": "Anna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "Their pizza is good and cheesy. Went with a group of friends and we all liked the food. Nothing extrodinary, to be honest, but sometimes it's just nice to find a place with decent pizza to pop in with friends and where they don't make you wait for ages.", "author": "Helena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Amazing!!!! My husband and I split the large white pizza. Loved the amount of garlic used on this one--not too strong and not too faint. I also love their crust.\n\nWe also stood in line for ~45 minutes for their 4 o'clock opening. It wasn't a bad wait at all.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "The service was great and the food was good. I got the calzone which was too plain by itself, I added left over marinera sauce from the meatballs we ordered and that made a huge difference. I really enjoyed the calzone with marinara sauce. I didn't try the pizza which I regret because it looks so good, the friends i went with got the pizza and they loved it. I got the large calzone which was huge I think it would feed 4 people. Overall this place was delicious I definitely recommend it.", "author": "Shirley M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}