{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "Worse customer service ever. The manager doesn't care anything about people's needs. Food is average (not good not bad), but waiting time is a pain, it just doesn't worth it. \n\nIf you are looking for a place to have a good day, avoid coming here.", "author": "Rafael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "We arrived in Brooklyn faced with little information and two long lines for pizza.  One for Juliana's and one for the other next door.  My son and I decided on Juliana's and happy that we did!  Line moved quickly and we got seated at the bar, which was super fun!  We watched them making pizza after pizza.  Quite an organized operation.  Pizza came out piping hot and was incredible!  We loved every bite and would go back here in a New York minute.  Think of it often, wishing I could have a slice.....", "author": "Jeannette M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "Delicious pizza. Awesome coal fired crust, melt in your mouth buffalo mozzarella cheese and zesty tomato sauce. If I had to critique something it would be that I would have preferred a slightly more crisp pizza crust.\n\nI'm not sure why you'd go to Grimaldi's over this place bc G is a chain you can get in several states. Julianna's is the real deal because it's the owner who started G's but didn't sell out. You want to eat something in NYC that you can't get anywhere else and Julianna's has the quality and something special in the way they put it together that makes it awesome. I've had Grimaldi's in FL and it's good but I think Juliana's has a better taste.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "I chose Juliana's over Grimaldi's because this is the ORIGINAL Grimaldi. Though I haven't tried Grimaldi's, I can definitely say Juliana is worth it. \n\nFirst off, the first thing I noticed was how friendly and happy the waiters were. They're passionate Italians and know exactly what's good on the menu. They are always attentive and fills the water every 20 minute. \n\nMy friends and I ordered the margarita pizza, the special number one pizza, and two brookie bridge, which is a brownie cookie sandwiched with a choice of strawberry, vanilla, chocolate, and raspberry ice cream. My friends did not enjoy the special no. 1 pizza because the pancetta was too salty and there was too much oil. I didn't mind it though. However, I didn't think the brookie bridge was worth $9. It was very small -- about the width of a paper cup. Our total was 70.77 with a bottle of soda. \n\nTo sum it up, friendly staff, no. 1 pizza may be too salty for some, and don't get the brookie bridge", "author": "Amy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "I first had pizza from here a few years back when someone bought a pie to go. I was hooked and have been wanting to come since. Finally got to check it out this summer. Came around 1-2pm, and they said there would be a 10-15 minute wait for a table for 2. The spot where we wait has absolutely no shade and it was a sweltering sunny day. I was not a happy camper. Luckily, they were true to their word and I was seated within 15 minutes.\n\nMy bf and I ordered the No.1 special (mozarella, Scamorza affumicata, pancetta, scallions, truffle oil, NO tomato), he got the Sixpoint Sweet Action beer and I got a vanilla egg cream.\n\nFirst, the pizza: It was delicious, just as I expected. Everything tasted amazing. I never considered scallion as a pizza topping, but this pizza has made it clear scallion is amazing on pizza (but come on, scallion is amazing on everything!). I was kind of surprised that the cheese on the pizza was stringy at all since it lists mozarella as one of the cheeses. I'm not sure what Scamorza affumicata is like since this is my first time having it. I'll admit that the pizza started to taste a tad too salty after the first slice, but that's what pancetta is. And that leads us onto the next part of the review...\n\nThe egg cream: was delicious! Not too sweet, but pairs perfectly to counter the saltiness of the pancetta. And honestly, I'm a fan of anything that has heavy cream. Can't go wrong with it. For those that don't know (because I didn't, until I asked the waiter), egg cream is simply seltzer with heavy cream and your choice of vanilla or chocolate syrup.\n\nMy bf said that Sixpoint Sweet Action beer was awesome and sweet. I'll just have to take his word for it because when I tasted it, it tasted like any other beer to me. :(\n\nI definitely look forward to coming here again and trying another one of their amazing creations.", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Of course I'm sure the review is a lot like the others here.  What a great little place!  We came on a Thursday which seems like a good night to come.  We ordered two pizza's and salads, both excellent.  It was our first time here and I notice there were multiple tables who had ordered the pizza with arugula on it.  It must have been good.  They had a good variety of beers many of them being Brooklyn based.  We both had Brooklyn Lagers.   The restaurant was great and I'd come back here again, probably not on a Friday or Saturday.  There was a slight issue with getting an uber to go back into the city, not sure if it was a fluke or what, but three times did we request one and all three times the driver went over the Brooklyn Bridge in the wrong direction, then cancel our ride.  We eventually......after 35 minutes, just took a taxi back to the downtown marriott.", "author": "Casey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "This place has some pretty decent pizza. We got here before they opened to avoid any lines.  The place is small but you don't feel crunched together by other patrons.  It's a lively atmosphere here.  We got a Caesar salad, kind of bland.  We ordered a meatball and pepperoni pizza, it had more of an olive oil pizza sauce, a little different than your regular sauce, but still tasty.  Toppings were very tasty and flavorful, fresh mozz was good.  A small pizza is enough for 2 people.  If you order a soda it is a small bottle not worth the price for a guy who likes soda.  Overall it was a fun experience.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "This is a definite stop to grab a bite when one goes sightseeing at Brooklyn Bridge. And trust me you can't miss this place as there is always a big line outside both Juliana's \u0026 Grimaldi's. Now the line outside both the places was quite long when we arrived and we were confused as to which place should we line up for. Grimaldi looks all traditional and old and Juliana looked relatively new. But then my husband quickly looked up both the places and we found an interesting story. \n\nPatsy Grimaldi is the guy who founded Grimaldi's originally but more than a decade ago sold it to one of his customers. He and his wife thought they'd retire but their passion for eating and serving brought them back and they started Juliana's. And the food is truly beyond delicious.. You can feel the freshness in each bite. We ordered the simple Fresh Mozzarella and Basil pizza and devoured every last morsel!\n\nDo not miss this place when visiting NY!", "author": "Foodie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "What can I say about Juliana's that would be even remotely original? Other people have gone through the history (if you're looking for Grimaldi's, you want Juliana's, basically). They've also touted how good the pizza is.\n\nI guess I can give you a perspective on delivery. On a Thursday night, we had the brilliant idea of ordering pizzas for takeout and then heading over to the pier (an idea from Victor S. - RIYP). Called them around 8:30, and was put on hold and hung up on. Called them back, and was told they were too busy to take orders and to call back in an hour. So I did at 9:30, and was able to place my order. Was told 15-20 minutes.\n\nEven at 9:30, there was a line out the door for a table. So takeout was definitely the way to go. Also, you get to feel like a VIP by skipping the line. Good times. Had to wait another 5 minutes for the two pies, and then we were on our way.\n\nNote that they don't do pizza boxes for some reason. Just this weird wax paper bag. So if you have two pies, one of them's gonna have cheese casualties (even with those little tables). Luckily, we only had to transport the pies a block.\n\nWe just did two normal pies. A regular cheese, and a pepperoni. The pepperoni was delicious and just ever so curled up from the heat of the oven. The crust was thin and on the edge of being burnt without being so. Quintessential New York style pie. Fresh basil on everything too.\n\nTheir specialty pies are a bit on the pricey side, but when you're the best in town, you're allowed to charge a premium.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "BEST PIZZA IN BROOKLYN!! I've been here a couple of times and it never fails me! The line and wait time are proof of how worth it this place is. The pizza is cooked to perfection and it's such a cute dumbo brooklyn feel, right by the Brooklyn bridge", "author": "Steph D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "I had a feeling just by the smell of the restaurant and the line outside of it that Juliana's wouldn't disappoint. The 40 minutes was well worth the wait and I left feeling happy and 5 lbs heavier. The service was great, and I really enjoyed watching the chefs making the pizza in the kitchen by our table. Definitely a gem in BK!", "author": "A. H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Went for dinner with a friend of mine who is a life long Brooklyn resident. He was explaining the history of Grimaldi's and that the former owner had opened this place and named it after his wife. \n\nMy friend is a vegan and the waiter was very helpful and suggested the best option for us was the Marinara which is tomato sauce and garlic. We added Kalamata olives and sweet onions. \nPizza arrived surprisingly quickly and was excellent, the best pizza I've had in NYC. Only thing is I prefer mine with a crisper crustier base and this was the soggier New York style. Best pizza though because of the flavor and particularly the garlic which was fresh tasting. Even after I brushed could still sense the garlic lingering, not for everyone but certainly memorable. Also not too heavy and stodgy sitting on the stomach.\n\nWashed it down with a chocolate egg cream drink a traditional Brooklyn specialty I'm told. Thought would taste more chocolaty but was a stronger soda taste. At least have experienced it now.\n\nAs we were heading for the door one of the staff rushed to remind me had left my bag behind, that was great service I thought.\n\nDefinitely one to visit again and take people visiting.", "author": "Victor A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-04", "description": "If you like tourists this and Grimaldi's are the place to go. Lines and lines of tourists sheeples aimlessly waiting for a pizza because their Fodor's or some other shit restaurant told them to go to. Lame-a-mente. \n\nThree stars cause good pizza. Three stars off cause tourists are the blight of NYC.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "My friends and I headed to Juliana's on another friend's recommendation. I was a little wary of it as it's owned by the same people who own Grimaldi's (not that there's anything wrong with Grimaldi's, but we have one in Phoenix and it just isn't somewhere I consider 'special'). I was glad we gave this place a try! We waited for about 20 minutes for a table, which wasn't bad. We had the #1 white pizza that has truffle and pancetta.... oh em gee this was a tasty pizza! It had the perfect amount of saltiness to make it delicious and not 'salty.' 3 of us shared a large and were fairly stuffed. The price is high (30$ for a large), but worth it.  I would definitely return if I were in the area. \n\n\nPs if you are in line for the bathroom, you can watch them make the pizzas which was super cool!", "author": "Jennifer O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "The line just grew longer and longer at Juliana's... on a Wednesday evening at that.  Not sure if it's always this crowded on a random weekday evening, fairly early, but it may be because the Brooklyn Half bib pick up festival was going on and people passed by on the way to the F train.\n\nI'm sure you can read about the history of Patsy Grimaldi and Juliana's vs Grimaldi's in all of the other reviews, so I'll spare that here.  For me, I enjoyed the atmosphere, food, and service much more at Juliana's than I did at Grimaldi's.  There was no line at Grimaldi's when I was waiting in line at Juliana's, but there was a decent sized one by the time I left.\n\nFor 3 girls, a large sized pizza was just the right size.  We ordered a classic Margherita pizza and added fresh sausage with fennel, topped with fresh garlic.  This combination was amazing - sprinkled with a little red pepper for a kick.  I'm not sure why there is salt on the table since this pizza is plenty salty already.  The pizza is best served straight out of the oven, piping hot.  I used a knife and fork for most of it and picked it up when it wasn't as floppy near the crust.  The fresh mozzarella is delicious as is the tomato sauce - next time I'll add extra.  The garlic is a must for garlic lovers - you know who you are.  The sausage is actually plopped onto the pizza as raw ground pork (at least I think that's what I saw) - so you're getting the freshest ingredients.\n\nIf you're going to choose between Juliana's and Grimaldi's, go for Juliana's if you're looking for best pizza.  Grimaldi's if you're trying to go to a place to just \"go\".", "author": "Allene T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-02", "description": "Good pizza...very close quarters. Service was not great but not awful...left something to be desired though.", "author": "Thayer R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Great pizza, quick service!\ndont go in a rush hours....", "author": "Diana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Being from SF, we have great pizza there, but no pizza has ever compared in the slightest to Juliana's. We waited about 30 minutes in line with high expectations but the result was one we could not imagine. The service is quick and friendly, and the pizza is simple but delicious. In a time with complicated overly topped pizzas, it's nice to sit in a room and enjoy something so elegant  and simple. The ingredients were amazing and fresh, and the overall experience was fantastic. We got the Brookie Bridge for dessert, but it wasn't all that great, one I'd recommend to skip. But juliana's is worth the wait in line and so much more!", "author": "Aastha V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-16", "description": "It's a fun and games until you find a HAIR on your pizza! \nUgh, and the manager's response was, \" these things happen at a restaurant.\"\n\nI then look over to the gentleman making the pizza NOT wearing a hair net! \n\nWanted to love this place and make it my Brooklyn bridge  picnic pizza, but didn't eat much after the hair incident. \n\nCheck your food yelpers!\n\nTwo stars because my boyfriend liked his pizza.", "author": "Marisol T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-11", "description": "We never made it in.  Waited for 90 minutes in a line that never budged.  Ended up eating next door.", "author": "DeAnn V."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}