{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "The service was decent but very friendly, also the pizza was good but slightly cold. They made very good desserts and just a generally good place for food and to be.", "author": "Shane H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "This was our second time eating at \"The Best Pizza in NYC\" and it certainly is deserving of its title. The margarita pizza and Italian meatballs were outstanding. When we got there we stood in line and were the first in line when they took an hour long break to stoke the oven. When that was over we were seated and waited another 45 until our food arrived but it was 100% worth it. Would come again and definitely recommend it.", "author": "Jacob R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Best pizza I have had in a looong time.. I'm a pizza lover and was soooo extremely happy. The wait was kind of long but after eating, it was definitely worth it. Also kind of over priced for pizza!! the staff was so nice and professional, our waiter Trimell had a great attitude and really good at what he does. More people need to exist in the service industry like him!!!!", "author": "Bee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Pizza and service were decent ! \nOne of my favorite place to eat a pizza! Will definitely come back again.", "author": "soria p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "The line was about an hour long to get into the restaurant, so we didn't get our lunch until almost 3pm... but the pizza was worth the wait! The toppings were fresh and the crust was just amazing. I'm in love with their pepperoni. We got a large 1/2 White and 1/2 Margherita pizza which was the perfect amount for 3 people. The service was fast and friendly once we got seated. I can't wait to go back to try their specialty pizzas!", "author": "Jina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "When you don't like what someone has done to your brand, you take it over.  That's what the original owner of Grimaldi's did.  Grimaldi's was loosing their touch, and Patsy Grimaldi took it over and renamed the restaurant after his mother.  What a relief to remodel the old Grimaldi's because it desperately needed it.  I didn't have a problem with the old Grimaldi's pizzza, but you cant argue with Patsy's ingenuity.  And was he ever right, the new pizza at Juliana is amazing.  Unfortunately you still have to wait on a long line, so I suggest going a little before opening time to secure a seat.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Let me first start by saying I felt like a tourist in my own city, let alone my borough. We were in the mood for pizza and have wanted to try the \"original Grimaldi\". We got there early prior to opening but couldn't secure a table since our full party was not present. No worries, we waited about 20 mins for a 5 top to open. The host, was pretty laid back and he let us wait inside when the rain started pouring. Ordered #6 the chicken, guac pizza, never thought the guacamole would make it taste good but it took it to another level. The crust, dough was nice and chewy jus the way I like it. The second pie, was a mix of extra cheese and shiitake mushrooms, also very good. Overall pizza was great but a bit pricey as we paid about $60 for both. Being from Brooklyn, I don't think I'd pay that much for pizza again. But if your trying for the 1st time would definitely recommend to check the box.", "author": "N And N K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "Pizza and service good, the wait was super long over 45 min. Overall okay place to try.", "author": "Marlene P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "This is the best pizza I've had since traveling through Italy. It's obvious that only you notch ingredients go into the pizza. Worth the wait. Here's a secret... Order a pie to go. Walk 10 feet to the tables near the street, sit down and eat. Saves you the wait. The tables are open to everyone.", "author": "Cornelius Cooper K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "And just when you think pizza couldn't get any better...it does! Came here after visiting the Brooklyn Half packet pick up...had to wait about a half hour to be seated but boy was every second worth the wait! We got the spinach salad to start which had olives, bell peppers, tomatoes and feta cheese topped with a balsamic vinaigrette. Perfect size for sharing! Then the three of us made our own pizza- red sauce, mozzarella, sausage, and arugula. Perfection!! The bread melts in your mouth and the thin crust made me feel one ounce better about stuffing my face with za. SO GOOD!", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Went on a weekday dinner time and there was a line of maybe 15 people. Waited close to 20 mins? We were a party of 3 and we luckily had the opportunity to sit up at the bar where we could watch all the magic happen! You can also do half-halfs if you want. We got the Housemade meatballs with tomato sauce and I'm not usually a fan of marina sauce but I quite enjoyed it. We ordered the No.1 special- mozzarella, scamorza affumicata, pancetta* (italian bacon), scallions and oregon-grown white truffles in olive oil (no tomato). Was delicious; we polished off the large. Great service, casual ambiance, definitely recommend this joint! It's right off the Brooklyn Bridge, why not?", "author": "Cindee L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "My favorite part was the crust, but the entire pie was great. The tomato sauce was just the right texture and had great flavors. The most surprising thing for me was how good the red pepper was. The sweet on the savory cheese was a good combination. Surprisingly, I was not quite as impressed with the sausage pizza. The sausage was nothing special, but still really good.", "author": "Nathan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-17", "description": "I went to Juliana's Pizza for dinner after leaving Barclays. The line was insane for dine in around 7pm (a few blocks long). I was close to leaving but decided to stick it out. We waited about 1.5 hours before being seated. Dress according to the weather if you're dining in for dinner (weekend). Luckily, weather was perfect while we waited in line. The restaurant is very small and cramped. I ordered a margherita pizza with sausage and pepperoni.  Our food arrived very fast. I'm glad I stayed in line because Juliana's Pizza lived up to the hype. The thin crust was crispy and airy. Juliana's cheese, sauce, and toppings were very flavorful. Juliana's pizza is simple and tasty. I definitely rank Juliana's Pizza as one of my favorite pies in NYC. Cheesecake caught my eye for dessert. Surprisingly, Juliana's cheesecake was delicious. Yes, soft and creamy goodness. I wanted to order more cheesecake before closing out our check (lol). Our waiter was busy but stayed on top of our table. Definitely check out Juliana's Pizza while in Brooklyn (expect a wait). It's best to make reservations if you can or order takeout if you don't want to wait. Overall, I enjoyed my dining experience at Juliana's Pizza. I give Juliana's Pizza a 4.5 rating.", "author": "Dominic B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Julianna's is better than Grimaldi's!!!\n\nWe live in DUMBO and have eaten at Julianna's about a half dozen times. \n\n1. The atmosphere is great and the pizza is just killer.\n\n2. The service is always good.\n\n3. The menu is focused and diverse enough to have variety.\n\nI honestly don't get why anyone would go to Grimaldi's nextdoor.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "Amazing, I got the white pie added shiitake mush, rrp, homemade meatballs! Good service attentive server, cold beer.  Don't be intimidated by the line it moves along.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "My friends and I originally wanted to try Grimaldi's pizza but the line was ridiculously long.  Oh well.  I'm so glad we opted to eat at Juliana's instead because the pizza was amazing!!\n\nWe ordered the fried calamari and the No. 4 Special which included mozzarella, tomato, arugula, and prosciutto.  Oh so good!!  I'm not really a pizza fan so that must say something.  I'm a fan now.. haha.  \n\nI got the pleasure to watch them make the pizza.  Pretty cool experience and I was so in awe of their oven.  It looked extremely hot in there... I forgot how hot but I know the hotter the oven the better the pizza.  Mmm.", "author": "Criselle O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "We walked around the corner from Brooklyn Bridge hoping to grab some awesome pizza, pizza aside from the many 99 cent ones we've had in Manhattan.\n\nAs we turn the corner, I open my trusty Yelp app and type in Pizza. We get 2 results -- Grimaldis, and Juliana's. Of course, Juliana's has better reviews, so naturally we aim our sights there. As we walk up the street, we see a line in the distance. We start to break a sweat, since, we HATE lines. This is the whole reason we are 99% TO-GO eaters and enjoyers. Well as we approach the line, we look to our left and find Juliana's. PHEW! The line was for Grimaldi's next door. Awesome.\n\nWe enter and immediately are greeted by a nice lady. There is an open couple table right in front of us, in front of the door, but she says \"let me seat you in the back (near the counter) so that you aren't cold from the draft.\" Wow, THANK YOU. + 1 star. \n\nIn a matter of minutes, we get seated. Our waiter comes over to deliver menus. We order a draft Root Beer, and draft Stella. We also order a small (mind you, is NOT SMALL), Margherita pizza. No additional toppings. Root beer is delicious and doesn't burn your throat, and Stella comes in an authentic Stella Chalice -- the ONLY way to drink Stella. + 1 star.\n\nThe food comes out within 5 minutes and we dig in. We each eat 2 LARGE slices, and we're FULL. We look up, and theres still 2 large slices left. OMG, this is so good but we cannot fit those slices in our belly -- so guess what, we take TO-GO (surprise, surprise). The pizza was FRESH, simply, with clean flavors, Nothing was overpowering, it was exactly as a pizza should be. + 3 stars\n\nAs we enjoyed the ambiance of Juliana's, we did some research and we find out the history of Grimaldi's and Juliana's, and how they're related. \n\nLooks like Juliana's is the ORIGINAL Grimaldi in heritage. \n\nWe exit Juliana's and as we walk pass Grimaldi's, we see that the person who stood in line when we entered Juliana's was at the front of the waiting line. \n\nIf you visit the bridges and are on the Brooklyn side, Juliana's is the PLACE TO GO for \"real Grimaldis\" pizza.\n\nGreat, now we're hungry.", "author": "Johnny N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "We had planned to check out smorgusburg but it had suddenly moved :(\nI had read some reviews that recommended Juliana's over Grimaldi's. We only tried Juliana's so I can't compare the two. We liked Julianna's but weren't blown away by it. I felt like the menu was very limiting..and nothing that we were super excited about. We went with No. 4-Tomato, mozzarella, arugula and prosciutto. The arugula and prosciutto are added after the pizza is cooked. The prosciutto was is pretty large chunks and quickly over powered anything else. It was good pizza but if I was back in New York it wouldn't be my first choice ..that would be Starita by Don Antonio.", "author": "Heather R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "The secret is out...  This is the real deal. Grimaldi's!  Patsy and Carol Grimaldi's masterpiece is back.  I really felt sorry for all the suckers waiting 1.5 to 2 hours to get into Grimald's next door... when \n\nWe had the Margarita Pizza with half meatballs and sausage  (highly recommended) and it was damn good. Sublime balance cheese, tomato sauce and wonderful crispiness and chewiness of the crust.... simply fantastic.  Almost as good as Di Fara's Pizza Pie (my fav)...  \n\nAfter we pigged out on a whole Pie.  Kate insisted on getting the Brookie Bridge.  Already stuffed out of my mind I reluctantly agreed.  We devoured the chocolate and ice cream goodness.  Yum! \n\nOn a side note...\nOnly downer...  Service really was horrendous.  Our waitress was nice but was missing in action for the most part. ....  When I accidentally got pizza on my pants (argh!) we asked another waitress for napkins ... she replied: I will tell your waitress (she had some on her) we were watching her as she went by our waitress without telling her.... then when we asked the same waitress for water she said the same thing and never told our waitress.  Seriously is it that hard to help each other out?   I wanted to get up and get napkins and water myself...\n  \n\nService and attitude was poor at best. \n\nPizza was pretty amazing ... \n\nIf your lucky you may meet Carol Grimaldi.", "author": "Eric Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Simply the best pizza I ever had. Period. Ordered the number 4, tomato, mozzarella, arugula and prosciutto... Perfect crust and dough, chewy and very tasty, a lot of fresh ingredients.... Lots of it.... It's incredible fresh and healthy up to the point that your hands are not greasy and stinky after eating it compared to other places. \n\nBest pizza in NYC so far... (big fan of pizza, I've been a foodie in NYC for a long time)", "author": "Mario D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}