{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "What can I say perfect Brooklyn slice. I went with my boyfriend and we waited in line but it wasn't too bad. Nice romantic atmosphere, good wine and beer selection. Got the meatball app and the classic margarita pie. Both were delicious but the Pizza was exceptional. My boyfriend can't stop taking about it", "author": "Kami S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Jump on the F train to the Pizza Mecca!\n\nWe waited about 20 minutes on a hot July afternoon - but once inside, cool A/C and a (somewhat) cold Peroni beer along with some great Italian aromas got us in the pizza mood.\n\nAll the classics plus a few specialty pies - we decided on a split of Margherita and Pepperoni.  We chowed on the drizzled oil and crispy crust pie with gooey mozzarella and macked-it all down in record time.\n\nEpic Pizza - well worth the extra wait.", "author": "STEVE B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "This place would of honestly gotten a 5 star review if it wasn't for the long long line outside! \nFirst NY Pizza place I came to, unfortunately we were in a hurry so we did not get to relax and enjoy it to the fullest although the pizza we did get was Super super delicious. \n\nPizza: specialty pizza No.4. This pizza was a 16 inch, with a thin crust, arugula, prosciutto, \u0026 ricotta cheese. Literally amazing. It was shared between 3 people and it was more than enough. \n\nAmbiance: Very family welcoming \u0026 a super mom and pop \"style\" place. \n\nThe customer service was at its top, super friendly everyone I encountered. \n\nThe pricing wasn't too bad for a small pizza which was 16in, it was 29$ . It's NY:-)", "author": "Camila M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "Born and raised in Brooklyn, now living in California. Juliana's pizza was introduced to me by my sis. By the Brooklyn bridge, it's a nice scenery in the front of the place and authentic looking inside. I've visited Juliana's twice and loved it every time. The margarita pizza and pepperoni is always the best pizza to get. Fresh and delicious, you'll always want to come back for more. Unless the place is full, which it always is once they open the doors. But usually wait time is not that long. When in Brooklyn, please visit Juliana's for great pizza! Also they have great desserts! Every thing is the best!", "author": "David U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "I am undecided between giving it 3.5 stars and 4. The only reason why is because we ate outdoors and the pizza got cold quickly. Yes, our fault.\nHere's the scoop. Always wanting to try Juliana's in the past but was put off by the long line, I finally had the opportunity today.\n\nCatching up with a friend as we strolled along Brooklyn Bridge Park, we decided on pizza ( either here or Grimaldis which I've been to in the past).\nToday's weather was sunny and mid 50s but only for about an hour or so. It was also the reason why we chose to sit outdoors (It started to get chilly real fast and luckily we were nearly done eating).\n\nThere were 2 sizes --small or large, both 8 slices but the small was 16\" while the large was 18\".\nWe chose the large Margarita with no toppings. It came out rather quickly and we devoured it just as quickly.\nThe crust/dough was perfect while the tomato sauce was a bit chunky and adorned with white,  fresh mozzarella. The slices were nearly paper thin.\n\nVerdict? We really enjoyed our first time pizza experience here. No lines (yippee) and 5 star service as we had the nicest waiter. Keep in mind even though there were no lines,  the interior was nearly filled to capacity.  \nI'm a huge pizza lover and would recommend.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Countless friends have told me that Juliana's Pizza is the best pizza in the city so when my mom said she wanted to spend a day in the city, I knew just the place to take her.\n\nWe arrived pretty early in the day so only had to wait twenty minutes or so before we got a table. Once we were seated, service was quick and our pizza arrived pretty quickly. \n\nWe ordered the No. 4 based on the recommendation of a friend of mine and it did not disappoint. I had only had prosciutto on a pizza once before and it was one of the best pizzas I had ever had and this was easily on level with it.\n\nI naturally prefer New York style pizza, but Juliana's was definitely one of the best Neapolitan slices I have had and the pizza definitely one worth coming back for.", "author": "Benjamin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Best pizza I ever had! Very friendly staff awesome location. fresh mozzarella was used, well, all the ingredients were fresh and you can tell the difference. \n\nWe ordered pepperoni.", "author": "Senedra N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-04", "description": "I wanted to love this, and maybe I would have if I dined in, but I was very disappointed with our takeout pizza. We picked it up, walked about 15 minutes back home, and reheated in the oven. It was just okay. I would give this another shot when we have time to dine in, but pass on takeout.", "author": "Katie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-11", "description": "Although there was a short line outside, they have their system to getting people in down packed. We didn't wait more than 5 minutes. We were seated right away and we were seen right away. We got a small margarita pizza for 2 which was perfect for us both and was good tasting. Service was quick and efficient. We ordered a cannoli to share, good size for 2 after scarfing down pizza lol.", "author": "Jeanine E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Best Pizza in all of the Tri-State Area, its not even close. Be prepared to wait a long time for the pizza here, and frankly its worth the wait. You cant go wrong with the margarita and the delicious sauce and gooey mozzarella work in a perfect marriage with a nice thin crunch dough underneath. I got have margarita and half pepperoni and both sides were equally delicious. If you are a pizza lover like myself, you must go here!!", "author": "Paul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "We waited on line for around 45 minutes, and I was a little disappointed with the pizza. We tried the margherita and proscuitto/arugula pizzas. The sauce was special but the crust was soft. When you hold it up, it falls. I prefer a pizza with a more crispy crust, that holds its shape. So it comes down to personal preference. Service was fast and accommodating. Overall we had a good experience.", "author": "Susan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "WORTH IT! I've heard about Juliana's for forever but I've always been loyal to Grimaldi's next door. Now I'm sold, they really are the real deal! \n\nIf you know to come early between their closing times, you can wait in line for like 20 or so minutes and be the first to sit down when they reopen in the afternoon. That's how we got in so easily and it was worth the wait. We got the specialty pizza with prosciutto that was topped with arugula, can't remember the name, but there's only like 2 or 3 specialties. It was REALLY good, so fresh, so satisfying, just perfect. I wish I would've gotten the margarita though since it comes so highly recommended and it's cheaper. \n\nAlso definitely get the Brooklyn Egg Cream too, it's surprisingly SO good and a great end to a great meal.", "author": "Chelsea C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "If you are looking for authentic Brooklyn pizza then this is the place to go!!! Just be prepared to wait. \n\nWent on a July Sunday afternoon and waited about an hour in line... yet totally worth it. They have a lot of great options for salads to meatballs and calzones. The real reason you come here is for the pizza ! We opted for #4 which is tomato, mozzarella, prosciutto and then topped with arugula!!\nSo mouthwatering I ate an entire pizza my self. \n\nIf you can't stomach to eat a whole pizza on your own that is okay ! A large will easily feed a party of 4!\n\nAll in all bring water and some snacks while you wait in line but don't fill up so you have room for all those carbs!!!!", "author": "Dakota O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "My friend is literally obsessed with this place, so I was excited to try it out while I was in Brooklyn. Located in DUMBO, Juliana's is next door to Grimaldi's as both establishments had been/are owned by the Grimaldi family. \n\nWe waited for about half an hour before being seated. There's a homey, charming elegance to the place, but you have to sit pretty close to other diners. While you're waiting for your own pizzas, your mouth will start watering by looking at dozens of pizzas around you. \n\nWe ordered Calzone pizza and it was absolutely amazing. Everything about Juliana's pizza is exactly how pizza should be - freshly made dough and delicious melted cheese.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "This is very good pizza restaurant. There was a line but it went fast \u0026 the pizza was excellent. Our waiter was very nice \u0026 attentive. I didn't realize that this was not Grimaldi's until I went online. This is right next to Grimaldi's \u0026 is a coal-fired oven which seems to make a difference. One of the best pizzas that I've eaten in NYC. Expensive but it's really worth it.", "author": "Fin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "More like 3.5 and I just had pizza.\n\nIt was my last day in New York and I was walking around exploring Brooklyn with a friend on a Sunday afternoon when we saw a crowd of people from afar. There was a line that must have been two hours long at two places that were next to each other, so we decided to order a pizza from each and compare them. I was trying to eat as much pizza as I possibly could while I was in New York so I was all in. \n\nWe got margarita at each and honestly they tasted almost identical. I mean I'm sure some people reading this might be rolling their eyes and say one is waaay better, but it was virtually the same pizza. I mean there were some subtle differences, like one had a slightly sweeter sauce, which my friend said she preferred if she had to pick one. I was indifferent. \n\nI honestly don't remember which was which, but it didn't matter much to me, both were good but I can't say it better than some the wood fire pizza I've had in LA. \n\nNow this totally isn't their fault at all, but I completely regret going here because it was more New York style pizza I missed out on, which I can't get in Los Angeles. It in all sincerity bothers me every time I think about it. \n\nAlso i have to say, had waited in that line I would have been utterly disappointed. I just don't understand waiting in a line that long for anything, much less food. I mean that's not really their fault either, maybe that's why there is place next door. \n\nBut to sum it up, it's solid wood fire pizza and so is the place next door, but neither wowed me or seemed definitively better than their competitor. So much so that I'm posting this review for them too.", "author": "Joe F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "Came in here because Grimaldis was packed. Its  not a big establishment. But your best bet order to go and eat at the nearby park. Cash only establishment like most New York businesses so be aware. \n\nFood: ordered a cheese pizza. The pizza was great. Sauce was rich and good texture. Cheese was fresh and tasted amazing. My philosophy is a pizza place needs to be able to wow you on a basic cheese and you know its the one. 4/5. \n\nAtmosphere: The inside is small and you will rub elbows with your neighbor like any other New york restaurant. 4/5. \n\nService: Its always busy so dont sit down if you are restricted by time. Take it to go. Service was pleasant and didnt feel rushed to eat and go  because they have so many other people waiting. They arent shy to turn you away because they need to turn over the dining area. Worth the wait though 4/5", "author": "Sagir P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-14", "description": "I went to Juliana's for a quick bite but didn't know it was going to be a real quick bite. The minute a sat down I felt pressured to order. The water was a bit rude. I order the meatballs which came out in seconds when I asked for bread they said they don't give bread with their meatballs. What place doesn't serve bread with meatballs. I don't have to say the meatball were delicious!\n\nI order the No.4, tomato, mozzarella, arugula, and prosciutto. The ingredients were the worst. The mozzarella was dry and the prosciutto was cheap. I was so disappointed in this place. I won't be coming back.", "author": "Jay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Fantastic! Some of the best pizza I've had in my life. Its easy to see why the lines are so long, the food holds up to the excellent reviews and the restaurant itself is simple and clean. \n\nWe arrived around 11:20AM (they open at 11:30) and waited about 40 minutes from the time we arrived to the time we were seated inside. The line is shaded and they have water, but if you're just looking for a quick bite then this is not the place for you. \n\nService was attentive but the pizza came out slowly - as the first seating of the day, they were clearly just getting started and pizzas came out one or two at a time, so order quick if you brave the early morning line - don't order a drink while you decide what to order or you've tacked on another 20 minutes of waiting while they fire the pies for everyone who ordered first - figure your order out while you wait in line!", "author": "Taylor B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-04", "description": "Tourist trap. Mediocre pizza for people who never had New York pizza. Not worth waiting in line for it", "author": "Sara A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}