{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "We are from Nashville and heard this was a great place for some good New York pizza!!!! The recommendation didn't let us down. We had to wait outside for around 45 minutes, but the line moved fast and the food and service was worth it! Trammel was our host, so friendly, organized, and all around awesome! Our server was Mitch, his customer service was incredible! Highly recommended!", "author": "Kristen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "We came here for a group lunch and it was delicious!! I would def recommend it.", "author": "Maureen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "I really enjoyed Juliana's and I would give it 5 stars except for the fact that it is so expensive. $19 for a margherita?!?! Really? I mean, it's delicious. And I get that Patsy Grimaldi sat us at our table. But really? Hence the 4 stars instead of the 5 stars.", "author": "Kerry K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "This is hands-down the greatest pizza I have ever had in my life.\nIf pizza was a religion (which it basically is) this would be the holy land. \nTheir margherita is the epitome of what a margherita pie should be. Sauce is excellent. Cheese is great. Crust is perfect. Basil is fresh. You can tell they use the best ingredients. \nMy friends ordered pizza No. 1, which has mozzarella, scamorza affumicata (a very interesting cheese that balances beautifully with the mozzarella), pancetta (it's sad that the menu has to specify this is \"Italian bacon\"), scallions and oregon-grown white truffles in olive oil - no tomato. I usually don't like non-sauced pies..but this was fantastic. \nHeads up: there's going to be a wait out the door to get a table. It's worth the wait. We stood outside in line in 20 degree weather. Eating here is a spiritual experience.", "author": "Erika E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Delicious. If you're looking for some of the best pizza in New York City, this is the place. I would recommend looking the place up and learning some history about it. I believe the history of a restaurant helps the food. I gave this place 5 stars because of every aspect of the pizza. Probably the best pizza I've ever had. The cheese, sauce, basil, and crust of the margarita pizza melt together perfectly. The flavor of the crust is sooo good. The menu is fairly simple and the prices aren't bad at all. Overall the best pizza I've had in the city.", "author": "Carson C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Nothing else to say then this is just a wonderful place to get some great pizza. It's not cheap but get over it. You're not coming every day. It's a few bucks more than average pizza and a fun place to visit right under the Brooklyn Bridge.", "author": "Francesco R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "My family and I tasted this pizza as part of a DUMBO food walking tour this past weekend. Before doing so, we were given a bit of background history on the place (and its neighbor, Grimaldi's). \n\nStory time: Apparently, grimaldi's pizza originally opened in the building that Juliana's now occupies. The owner ran the successful coal-fired pizza joint for years until moving its location to the building next door and selling the legal rights of the name to a franchiser. Years later, he decided he wanted to make pizza again, but had given up the name, so he bought the original location and named his new shop after his mother (or grandmother, I can't remember), Juliana. So, I guess if you want the real Grimaldi's pizza, you have to come to Juliana's. \n\nWhile we did not taste Grimaldi's on this trip, Juliana's was absolutely delicious. I cannot speak to the service or ambiance of the restaurant, but strictly based on taste alone, I give this place a 5/5.  While NYC and Brooklyn are full of pizza, this pizza is special because it is coal-fired. It is baked in a coal oven that gets so hot (something like 900 degrees) that it cooks the thin-crust pizza in just a few minutes. We tried the margarita pizza and it was warm, chewy, slightly crispy, and absolutely delicious. I can't wait to come back for more!", "author": "Shelby D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Honestly, whether A local or a tourist pizza place is worth the wait. Staff are exceptionally friendly, and service is great. \n\nI have experienced the in dining and take out service just know that take up service they do a limited amount of pizzas a day so keep that in mind however staff will always try their best to accommodate seating or take out service just be sure to be nice to them.\n\nWe had a regular size Margarita pizza shared within three of us however I think the Larchwood have filled up belly is better we also had toppings of arugula and pepperoni on the pizza. \n\nOverall I would say Julianas pizza is a great classic pizza to taste when ever you are in New York City perfect for sightseeing and good food in one day!\n\nI would highly recommend this restaurant to my family and friends who are visiting and will be back for more pizzas with my friends in New York City.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Good pizza. Long line. Loud as heck inside. \n\nBut a classic Margharita and added meatballs was very good. \n\nBest ever? Been to Italy several times and had good pies in SF so can't give it best ever title. That said, for a tremndously busy place the quality is okay. Had a seat at the bar watching the \"chefs\" make the pies and they are working non-stop. \n\nIt's fun. And it's an institution. So check it out if you're closeby. The views of Manhattan are spectacular at the park.", "author": "Phil N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "Great Brooklyn style pizza, order carry-out to avoid the line or go during the rain! I usually get a pepperoni with basil and garlic; the dessert is also good!", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Pretty solid pizza place. Can have a line. We wanted something close to the Brooklyn bridge and this was the place. \n\nIf we wouldn't have gone to Bleeckers first then I might have bumped this up a star rating. It was a solid sit down dining option. Service was great. We liked how you could see them making the pizza dough. \n\nWe tried the Margherita pizza and then that with pepperoni added. It was a pretty decent plain pizza. The slices of pepperoni were good as well. \n\nWe also tried a No. 6 chicken with guacamole. Now at home I make unique pizzas but I didn't care for this one. \n\nThe final one we had was a No. 4 the prosciutto was really good. And the added argula on top was different but very popular with our group. \n\nWe absolutely loved the egg cream Brooklyn style drink. Seltzer water with heavy cream (or something like that). Creamy and delicious. $3.50", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "I came here with a bunch of friends on a Tuesday night and it was bustling with about a 40-minute wait, but it was well worth it! I thought the quality of the pizza was much better than nearby Grimaldi's (even though Juliana's was opened by Patsy Grimaldi). We tried 3 different types of pizza: 1) Pepperoni, 2) Chicken and Guacamole, 3) Pancetta. \n\nThe first to come out was the pepperoni. It had a margarita pizza base with basil leaves and patches of yummy mozzarella cheese. The pepperoni was the real deal; none of this flat circular stuff... The pepperoni here was smaller in size and curved upward. It was very flavorful, perfectly cooked and delicious! \n\nNext came the grilled chicken pizza with mozzarella, Monterey jack, white cheddar (mmmm cheeses!), guacamole and no tomato sauce. The guacamole was on top in a spiral shape around the pizza. I don't like guacamole but had to tolerate it because Juliana's doesn't do any substitutions or changes for their Pizza Specials. I did enjoy the chicken and the trio of cheeses was truly delightful! \n\nThe last pizza we had was probably my favorite... It consisted of pancetta (Italian bacon), scallions, truffle oil and also no tomato. My, oh my was the pancetta amazing! It was crispy, tantalizing, mouthwateringly wonderful and went well with the rest of the ingredients. \n\nThe pizzas were all thin crust and the bread was quite good. Also, the service was pretty decent- quick and efficient. I would definitely come back and would always choose Juliana's over Grimaldi's.", "author": "Kathy X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "My favorite pizza place! There's always people waiting, but not that long. And it is worth waiting. When my friends visit New York for the first time, I take them to this place at all time. After eating, we go to Dumbo which is like five minutes walk. Real close. It's my favorite course. Love this place.", "author": "Da Eun J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-16", "description": "Where do I start? This is a tourist trap. Every time I visit NYC is gets worse. The city has become one huge caricature of itself. Pizza is cheap good food where you don't have to stand in front of a restaurant to get in. The pizza restaurants in this area charge a flat 20% service charge and only accept cash. They serve tiny 8oz coke bottles. The pizza is OK, but definitely not worth the price or the hype.", "author": "Jose M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "45 min wait on a Sunday. Not as bad as I expected since it was a weekend and this place is rated so well. \n\nIt was my first time having pizza in New York. I wasn't completely wowed at first bite, but the more I ate it, the more I started to really like it. It's a solid pizza that you can tell is really good quality. \n\nI got the #4. I would totally get it again! The arugula goes really well with the pizza cause it balances out the saltiness of the ham.  If I ever come back to New York, I would love to come here again and try the other pizza. \n\nTMI, but i got a stomach ache and desperately needed the restroom right after eating here. I usually have a stomach of steel so I don't know what it could have been. It wasn't just me either!! Despite this, I'd still wanna come back :D", "author": "Jasmine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "This review is based on two visits. The first time, I came here with two friends at around 9 pm on a Tuesday night and had to line up for almost half an hour. The second time, I came here with one other friend on a Monday at 5pm and were seated in 10 minutes.\n\nThe menu features four classic pizzas and six special pizzas. The first time, I shared the the classic Margherita Pizza with sausage and ricotta as extra toppings. I like that the crust is thin and crispy and they put a lot of cheese. I find that the cheese is not as heavy as other pizza places, so it didn't feel like my arteries were clogged at the end of the night. \n\nI had a really different experience the second time. I also got the Margherita Pizza but with Prosciutto, ricotta and sausage as extra toppings. This time, the crust was soggy towards the middle and I find that the prosciutto was too salty and overpowered the taste of the ricotta and sausage. If you're someone who likes to add prosciutto to your pizzas, then I would recommend that you don't add too many other toppings as the prosciutto itself is quite strong in flavor and saltiness. I would probably get the extra cheese to go with it.\n\nIt seems that the takeaway from my experiences is not to add too many toppings so the flavors of the pizza itself can come through better. I'm excited to try the special pizzas next time, which don't actually don't allow changes or substitutions.", "author": "Jacqueline C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Delicious ny style thin crust pizza here. Ordered the very popular margharita pizza (half pepperoni) and the #1 pizza. Line is long on weekends but moves fast. I waited 15 min before being seated for a party of 4 on saturday noon time. Will go back for sure.", "author": "Joel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "Pros:\nAmazing pizza\nFast service\nSimple menu\n\nCons:\nNeed a better waiting system \nWait is ridiculous!! \nIt's 2017- take a number, send a text when the table is ready \n\nI'm all about good food, so naturally when I come to any city, I hop on yelp to see what my fellow yelpers recommend. Given that this place had such a high rating and we were craving pizza, I had to check it out!!\n\nFirst attempt was on a Saturday evening at 6pm; the wait was almost 2hrs and people were standing in line for the food. No thanks. I will never wait that long for food, don't care how good it is. Second attempt was a late Sunday brunch around 2pm. The wait was an hour which wasn't as bad as before, so we went for it. We were seated about 30 mins after waiting. Not too shabby! \n\nThe food was DELICIOUS ITALIAN, PERFECTION. We ordered the meatballs and Caesar salad, which was plenty to split between 3 people. The meatballs were flavorful and authentic. Juicy and saucy. The salad was not over dressed. And the pizza- man oh man- was it Goooooodd. We ordered the no. 4 and had it doused in truffle oil (after figuring out we could do half and half but it was too late, this was the compromise). It was outstanding!!\n\nThe service was quick and the food was delicious but I genuinely can't give 5 stars because of their need for a better waiting system. They really need to get it together to keep people coming back.", "author": "Lauryn B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "Ordered a hearts of romaine Caesar salad which was supposed to come with croutons and cheese. Only got a box of romaine, no croutons, cheese or dressing. Paid $11 for romaine. Pizza was great but so disappointed about the salad. \n\n\nUpdate: Management apologized and provided a salad credit.", "author": "Amy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "It will be my first choice restaurant if I came to dumbo. Definitely better than the pizza next store... Pizza is really really good. We two person share one pizza. Service is very good and professional. I love the restaurant environment and atmosphere too. Neat, not too crowded, but you probably have to wait in a long line...", "author": "June C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}