{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "This place was well worth the trip to Brooklyn Bridge! The margherita pizza and calzone were delicious!! A must-have for sure!!", "author": "Ofelia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-05", "description": "So my sister and I got a large Margherita pie, and the pizza was just okay. Nothing phenomenal. I particularly had an issue with the sauce - it could use a little more flavor. No doubt that the food tasted fresh and the crust was thin and crispy, but I guess I was expecting a lot more. I'd prefer the Prince St. Pizza over this.", "author": "Henna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Pizza is so delicious, so flavorful, so filling. It's worth the wait for a table on the weekends. I eat here often and can't get enough. The classic margherita is a favorite.", "author": "L G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Delish pizza! Just as good as Grimaldi's! Great service and quality ingredients. Ordered the No. 1 and enjoyed the smoked cheese with scallions, but we weren't able to taste the white truffle at all. Unsure if it was overpowered by the pancetta?", "author": "Priya C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "Came with my boyfriend. We went for the Dumbo Art Festival and as you can imagine, the line was very long. We've waited for almost one hour to eat pizza....Unbelievable. We turned super hungry when finally got in. Ordered the No.1 (maybe?) pizza with Bacon, Cheese, and Scallion. The pizza was super yummy... We also ate dessert in the end - a mixture of brownie and cookie - also not bad.", "author": "Yuqing L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "We stopped at Juliana's based on the yelp reviews and were not disappointed.  The margarita pizza was excellent.  I can't get over how wonderful the sauce is.  We wanted to have a slice at Juliana's and grimaldi's next door but both only sell whole pies.  So we decided to get whole pies:). We literally sat down with a whole pie at Juliana's had a couple slices and went next door for another whole pie.  I have to say that while lacking in ambience at Juliana's it won in every other category.  Best flavor, best crust, best service, best, best, best.", "author": "Gena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "I did a taste test between Julianna's and Grimaldi's tonight. The verdict: Julianna's is better than Grimaldi's. Not by much (the pizzas are very similar), but by enough. The seasoning was the big thing for me---Julianna's simply does it better. I also thought the dough in Grimaldi's was slightly undercooked (a bit doughy), whereas Julianna's was just right.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "i expected better after reading the reviews.  \nApparently Juliana's Pizza was started by the originators of the Grimaldi's chain pizza.  Might as well go to Grimaldi's.  We are from Phoenix and wanted to support local vs a chain, but it was basically the same product with more restrictions.  To get a basic pepperoni, we had to order a margarita pizza and add pepperoni.  I love margarita pizza, cause BAISL! But there were only about 9 leaf's of wilted basil for a large pizza.  \nMy bf and I were sat against a wall and were blocked in with another two person table less than 4 inches away from us.  To use the bathroom and leave, the people next to us, were forced to get up to let us out.  Our order was placed, received, and removed by reaching over and around the poor couple beside us.\nWe twice had to ask for water refills.  When pouring, the waiter poured into my glass while I held it, while condensation dripped off the pitcher onto the back of guy behind us.  \nAnd the bathroom smelled strongly of  urine: absolutely disgusting, and it is right next to were they pounding out the dough.\nWouldn't be hard to find a better meal for $50.  (we also got a beer each. best part of the meal.)", "author": "Erin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "It was amazing! I don't know how you tell what's the best pizza in the country, but trip advisor wasn't far off with its rating of this pizza place. The line was long but it was worth the wait. Amazing ingredients, very friendly service. We were very happy", "author": "Katherine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Accommodated our family with small children really well.  Great service, great pizza!  Came on the early side of lunch so we got a seat right away, which was rare.  Come later? Prepare for a wait.", "author": "Brooklyn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-23", "description": "Terrible terrible experience today\nWe got there at 1.30 pm waited for an hour to get in\nWe then got seated and had to wait another hour for our pizza\nWe finally got served at 3.30 pm and the pizza was just ordinary \nService was bad though I felt bad for the waiter , he kept coming to us every 20 minutes expressing his helplessness about giving us our pizza\n\n\nHorrible tourist trap", "author": "Sandeep K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "One of the best pizzas I have had up here! Great service \u0026 efficient. Perfect place to bring people visiting.", "author": "Christine K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "My favorite pizza in all of NYC. I love seeing the tourist lined up outside grimaldi's next door. Let the uniformed follow the crowds do I can get into Julianna's faster. This is the original brick oven now served without the attitude of their tourist trap neighbors.", "author": "Chad T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "literally THE BEST pizza in the city. we've tried at least 30 places, and none tops this place. if only they had a spot in manhattan! the travel time and the wait about kills us, but it's amazing here.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-29", "description": "Actually, I cant give an honest review because I never got served. I arrived last night and yes the place is busy. We waited 25 minutes outside and 10 minutes to place our order. We sat down with another couple and ordered the exact same pizza! They were served immediately and we waited, waited and waited and watched everyone around us eat. I asked our server twice what was going on, but he was too busy for us. WE JUST WALKED OUT. Everyone saw our disgust except for the establishment. Never again", "author": "Brian D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "Their pizza was good, not crazy amazing but good. What made the restaurant was the great service. Everyone from the host, the staff and manager were very friendly, accommodating and just made the visit nice.  I appreciate that - especially in a city where it's go go go and take it or leave it kind of service.", "author": "Syddie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-10", "description": "I don't get it... I am from NJ and love a thin, crisp crust.  This crust was thin... but soggy.  Could not hold the weight of the skimpy toppings.  Suggestion... possibly, get it to go and re-heat in oven at home to get the crust nice and crisp.  Any who... just not a huge fan and way too many better (to my liking) pizza joints in the city or.... across the river in Jersey.  Heyyyy-O! Don't hate!", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Came here once while tipsy and the waitress was very accommodating and patient with the conversations my friend and I struck up", "author": "Mia Rose L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Excellent pizza. We got the margherita with pepperoni which was delicious. There was a long line to be seated (small place), but it was worth it. We got to sit at the counter right in front of where they made the pizza so that was quite entertaining. Definitely worth a stop if you're in the area. Friendly service as well.", "author": "A K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Margarita Pizza was a little to burnt to enjoy but management reached out to me to ensure that my next dining experience at Juliana's will be great.  Greatly appreciate the responsive customer service and looking forward to coming back!", "author": "Caroline L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}