{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "Amazing! We had to wait 10 mins to get a table, but it was so worth the wait. We had the arugula salad \u0026 shared a number 1 pizza. We ate every piece even though we intended to take some to go. Every person there was friendly, happy \u0026 attentive. Even with a line of people waiting outside, they don't rush you out once you're done. This came as a recommendation from a friend who used to be a local \u0026 he gets gold stars all around for this one!", "author": "Debonie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "My boyfriend and I came here to try their famous pizza because we were tourists of New York and my sister highly recommended it. It was definitely worth traveling to Brooklyn for because the pizza was SO good and the server was so nice ! My boyfriend and I really enjoyed it more than Chicago pizza.", "author": "Tina O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "The best pizza in the city! Don't let the line out the door scare you away, it moves fast. Pizza came out quick and the vanilla egg cream is a must! Can't wait to come back.", "author": "Natalie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "Awesome service and food!  We had margarita pizza. Yum!!!!  Great authentic New York pizza!!!", "author": "Teresa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Absolutely the best pizza I've ever had. The service was great and they were very family friendly. The place next door tried to make our party of 10 keep my niece's stroller outside and they were rude. We opted to go to Juliana's and I will be eating there every time I go to Brooklyn.", "author": "Postelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "I'm pretty sure it's my favorite NY pizza place. You can taste that the ingredients are great quality. The sauce is not too strong and for me it's the best I've had. Their Julia's meatballs are awesome! Great place!", "author": "Janet A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "We absolutely love love this place!  You can't come to New York and not have their pizza.  This is our 3rd time here since we live in California and don't come here often, but when we do this place is a must.   We flew in last Thursday, October 1st 2015 and went there right after checking in our hotel for dinner.  We had our son's friend with us as it was his first time and he thought it was all hype up until the moment he took his first bite.  The smile on his face said it all, we brought him to the right place.  Just as I remembered deliciousness.  It was still busy at 8:30 we had a little wait but well worth it.  You won't be disappointed.  It's good to go late for dinner or get there 1/2 hour before they open to get in quick.  Haven't tried during early dinner or around lunch too long of a line.", "author": "MoniLou G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Just left the place craving for more, it gave my taste buds an immense orgasm. How in the world do people make pizza this good? You really don't have to go all the way to Italy and embark on a quest for the perfect pizza.\n\nThe secret ingrediant that fulfills the perfect pizza lies here. No idea what it is, but its effing good.", "author": "Kevin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "Guys: this is the real Grimaldi's pizza!!!\n\nThe secret is the dough: such an amazing food experience, and all ingredients come from Italy, seriously.\n\nDon't miss to talk with Patsy Grimaldi, and get a real espresso with your check.\n\nLess line than next door Grimaldi's, and better delicious meal!", "author": "Martina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "I had the No. 6 pizza. It had chicken guacamole and something else. It was absolutely delicious. Although the space was small I enjoyed my experience. The service was excellent. My waiter was polite. Within a couple minutes or ordering we received a hot tasty pizza. I would recommend eating here.", "author": "Elle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Great pizza place in Brooklyn. Margherita pizza is delicious. The dough is thin yet satisfying, the sauce sweet yet well-seasoned, the cheese perfectly chewy and the basil just delicious. Highly recommended.", "author": "Taylor P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "I really wanted to love this place after hearing so much about it. The pizza was decent but we were pretty disappointed with the meatball topping. In addition, the service was SO slow. We waited for 45 minutes for them to bring out our pizza. There are plenty of other pizza places with better service in the area", "author": "Sumiti U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "I had been in search of good pizza in NY and I found it here! Someone had recommended another place but when I got there they only took cash so I needed to look elsewhere and I'm so glad I did! I ordered the arugula salad and the margarita pizza. The salad was huge! It would have been perfect for 2 people. It was fresh and well seasoned with cucumbers, tomatoes, and red onions. The pizza was really good. Crisp on the edges, thin crust with the perfect amount of toppings. I say outside which.m was great people watching and my server was sweet and entertaining. I'll definitely be back!", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Best Pizza in NYC. There is nothing on the menu that isn't excellent. Highly recommend.", "author": "Tyler B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "Best pizza I've ever had. Period. Service is amazing, desserts phenomenal. This is the ONLY place to get pizza in Brooklyn. And for those wanting Grimaldi's pizza, this is the place to go. Technically, this is the real Grimaldi's.", "author": "Kristi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "Pretty good. \n\nTerrible service.\n\nWoman at the front checked Facebook on her phone while I asked a couple questions and while she answered... So. Not a great experience.", "author": "Travis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "DELICIOUS! We stopped in on our eating tour yesterday and decided to try out based on a recommendation from my friends brother. Thank goodness we did! What a delicious treat it was. We ordered a small to share since we still had plenty of eating to do in our day. We got a margarita pizza and added meatballs. So yummy! \n\nEveryone around us had a pizza with lox on it that looked delicious. I definitely want to come back and try out more pizzas and a salad.\n\nService was friendly and efficient, especially given how busy they were! We were seated immediately upon walking in but then five minutes later there was a wait. It seemed to be the theme of our day!", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Juliana's is definitely better than Grimaldi's. So, Juliana's owner used to be Grimaldi's owner. He retired and sold Grimaldi's. Grimaldi's became a franchise because everyone loved Grimaldi's. But after it was sold the owner got tired of being retired so he opened a new pizza store with his own recipe . He's the best!!!!", "author": "Daniela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "They make the perfect Margherita pizza - I get mine with extra tomato sauce.  No other toppings.  Just perfect.  And I've been to all the all-time great places, too.  I'd say DiFara is second to Juliana's.", "author": "John P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "I was having pizza next door when I saw an article in the paper on the window saying Patsy and Carol Grimaldi were coming back to DUMBO and coming back under the name Juliana - named after his mother. I had to make it back this way after it opened.\n\nI went after an event in the area and was seated right away...the place was about an hour from closing. The service was super. The food came out fast after we ordered. All the staff was super friendly.\n\nMy friend and I got 1 large pie...because...why not. We got the margarita pie with half prosciutto. The pie was delicious with a nice crunch thin crust, fresh tomato sauce (this was really one AMAZING sauce). The mozzarella was fresh...in all honesty, I could have probably done without the prosciutto, which was added after the pie was cooked. It just wasn't quite the quality prosciutto I was looking for. The crust was thin, but the middle wasn't so soggy, or soggy at all, that you could properly fold it in half like you should.\n\nNot my super favorite, but quite delicious and totally worth checking out. I hear the ice cream sandwiches are delicious and will have to try that next time.", "author": "Baramee C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}