{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Soooo glad to have this open. This is actually the real Grimaldi's, with the original oven and original family owners; the other one moved next door, and is not using the right oven and just uses the Grimaldi's name it bought. I like that the tourists think the place called Grimaldi's is the actual one; let them wait online for the fake pizza. I walk right by them and go to Juliana's.\n\nThis place actually feels local and warm. The staff is nice, and the pizza is fantastic. The large is actually too big for 2 people, so get the small if on a date (they will tell you otherwise).\n\nThe pizza is worth the extra money it costs over the old Grimaldi's. And it's really nice that you don't have to wait online and can use a credit card.\n\nSince we live in DUMBO, it's good to have a place open near the waterfront that doesn't treat us like we just got off the tourist bus.\n\nOh, they need to play better music over the speakers and not forget to turn it on.", "author": "Layne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "After a lot of back and forth between going to Grimaldis or Juliana's, we landed at Juliana's and we're glad we did.\n\nOnce you've made it past the enormous wait that is offset by the quick walk down to look at Manhattan across the East River and the interesting newspaper reviews of the grudge match between Grimaldis and Juliana's, you are rewarded with a lively and yet elegant atmosphere in the restaurant.  I'm not sure how the staff fits so many people in but it didn't feel overly crowded.  The focal point of the restaurant is most certainly the single coal-fired oven at the center back of the restaurant and the continual flurry of activity from the white t-shirt clad pizza artisans.\n\nThe pie was delicious.  We had a margharita and a meat-lover and both were wonderful.  The crust was perfectly crispy with a chewy edge and has a little bit of a different taste, I'm guessing from using the coal instead of wood.\n\nI would definitely recommend the trip over to DUMBO to visit Juliana's.\n\nAnd if you are ever in the Atlanta, GA area, do not miss out on Antico Pizza Napoletana.  While I really liked Juliana's pie, Anticos margharita and San Generaos pies still win in my book.  There are a few critical differences, but I think in the end it finally comes down to the taste of the sauce and on that front Anticos wins.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "We came into Juliana's after a local told us to bypass Grimaldi's because the actual Grimaldi sold the business and later opened Juliana. This is not the best pizza I've ever had, but it was pretty dang delicious. The ingredients all tasted so fresh they were probably grown in the backyard. We ordered the Margherita. The cheese was by far amazing, and I feel like I've never had a cheese like that on a pizza. (If it was mozzarella, that'd be a really silly statement.) Even the dough was amazing! We also ordered their soup du jour and it was a white bean noodle one that I don't remember the name of. Blame it on 10 degree weather but this soup was beyond perfect. It tasted like someone's grandmother cooked it after hearing they had a miserable day. Overall, really great place! I read somewhere that they rush people out of the place, but my server was amazing, nice, and really funny. He even told me to take my time cause the weather was miserable. I'd definitely be back if I'm ever in Brooklyn again.", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Best pizza I ever had.  \n\nWe came here around New Years and were not disappointed.  The sauce. The cheese.  The toppings. Wow.  \n\nI thought I would like Chicago deep dish better but I was wrong.     Brooklyn pizza really is the best and the master himself is Patsy. \n\nGetting to meet him and chat was definitely one of the highlights of our trip.  We can't wait to come back to NYC and hit this spot again.  \n\nTil next time", "author": "Jason P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "The line is now officially longer than at Grimaldi's. Smaller space I suppose but definitely deserving. It's a 5 star pizza, especially the margherita. Good food, good service. Next time I want to wait in line for pizza, I'm definitely picking Juliana's.", "author": "Kristine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "Like so many other reviewers, we were on our way to Grimaldi's, to round out what we believed to be our \"top 3 pizza in NY\" comparison. But we met a local on the way, who gave us the tip: skip Grimaldi's and head next door. We have never been more grateful. Juliana's is simply amazing. We had the classic Margherita, as this is in our view the best way to truly test a pizza place. It was outstanding. Crispy base, delicious sauce and fresh and beautiful mozzarella. We have been trying for years to find a pizza that came close to the \"best in the world\" we had in Naples. This did it, without question. For your reference, the other pizza places we tried were Lombardi's and Johns on Bleeker. Both absolute paled in comparison - in fact, there is simply no comparison. Juliana's sets the standard, and we can't wait to go back.", "author": "Pip C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Sofar the best pizza.... . Well, the servic was good also. Long waiting time is kinda bothering,  but it's worth it.", "author": "David J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Get a large classic margherita pizza and you won't regret it! Simple yet so so flavorful! The crust is perfectly crisp with a slight woody flavor and the pizza itself is not too tomato-y. Best eaten while it's hot for optimum cheesy delight, so if you order to go, eat immediately!", "author": "Shadi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Here is my review.\n\n\nYES.\n\n\nGo here, you will not be disappointed.  \n\n\nEvery time I have friends visit from out of town, I bring them here.  If they want the best NY Pizza then Juliana's is the place to go!", "author": "Alyssa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "We came by on a whim during Christmas week and were met with a two hour long line to sit down. So we tried our luck during the snowy weekend, and found no line and tables available immediately. Shared the meatballs to start, and two pizzas - the classic margherita with sausage, and the number 1. Both were excellent, with the margherita being a favorite. One small pizza can easily feed two people, we ended up going home with leftovers, but we did not mind. Cannoli and cheesecake for dessert - the cheesecake was excellent, but the cannoli I am not dying to have again. Looking forward to a return meal of a small pizza and cheesecake!", "author": "Wackydream M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Best coal fired pizza we have had in New York!  Excellent wait staff, quick friendly service.  Located under the Brooklyn Bridge. This pizza place is owned by the original Grimaldi's owner, Patsy Grimaldi.  Ironically the store Patsy sold, along with his name, is still operating next door, providing a choice of pizzeria's under the bridge..", "author": "Dave J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Great pizza, much better than Grimaldi's. Waiter was very friendly and even helped split dish for two people. Spaghetti was just as good as the pizza with some of the best meatballs I have ever had.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-21", "description": "The pizza may be good, but I totally ordered wrong.  The server confused me with the order and I ended up with a pizza without cheese.  Again, I ordered it, so my fault.  However, they would not even let me order a new one and pay for it.  I was at the gremaldis location and had the best pizza and service ever...should have gone to the new location on the corner.  Will not be back.", "author": "Meggie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "Decent pizza, but not as good as the former Grimaldi's. The new Grimaldi's does pale in comparison to its glorious past. Worst part about Juliana's is the owner who got a little too touchy. It was very uncomfortable.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "I do not normally give a 5 star to restaurants, but every bite of my Margherita pizza was a little bit of heaven in my mouth.  We did wait outside in a line for a table but the wait wasn't too long for a smaller restaurant.  The service was quick but we didn't feel rushed.   I would recommend over Grimaldi's next door.", "author": "Karen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "Patsy Grimaldi, the original owner of the well known Grimaldi's next door, came out of retirement and opened up this restaurant with his wife named after his mother Juliana. Truly a great experience. The pizza was delicious and Patsy himself and his staff are remarkable. Friendly, fast, and yummy pizza. I will be back again!", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "We were standing in line for the Grimaldi Pizzaria but the line was so long. Somebody that passed by said this place was better since theyr right next to each other and true enough, the real Grimaldi was said to own this place. They sold the name Grimaldi to former customer and Juliana their new restorant was named after his mom :) the story worked up my appetite. Their thin crust small Pizza taste good :) good ambiance and service.", "author": "Kristine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "The most amazing pizzas ever... you cannot ,is this one. It's worth the long wait. We ordered a cheese pizza (we are vegetarians) and absolutely relished the food. It's on the repeat list! A must go and highly recommend it.. the staff is also very friendly and helpful and makes sure you are having a nice time.", "author": "Kulin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "Loved the #1 Pizza that had pancetta, mozzarella, and green onions.  The crust is the best crust I have ever tasted.  Chewy and soft its just right!  I still think that New Haven Pizza is the best pizza though.", "author": "Bernadette M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-24", "description": "You don't want to queue up for 2 hours to go to Grimaldi's? Easy: go to Juliana's, and you'll have a Patsy pizza with only a 10 mn wait (we went on a Sunday at 2pm though - it might be a little bit more crowded for dinner...)\n\nThere are 10 pizzas, 5 classic ones around 20$ (for a large one - which is meant to serve 2) and 5 specials around $28 (for the large as well). We took the Special n'1, which was delicious.\n\nThe service is very nice - the waitresses are quite busy so they are not hoovering by your table (which actually feels quite overwhelming for a European!), but they are very attentive to your every needs. The owner's wife, Carol, greets everyone and even cleared out our table - I hope I'll be as passionate in my 80s!", "author": "Marine B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}