{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Spent an afternoon enjoying the Brooklyn Heights Promenade when hunger got the best of us. Juliana's is surrounded by a Starbucks, Shake Shack and 2 other pizza places but by our cravings and the Yelp reviews, Juliana's won hands down. \n\nAmbient on the inside, the menu was limited but equally hard to decide from. We opted to go traditional and simply enjoy a good NY style charcoal-fired pizza. We ordered a Matt's Mix salad with spinach, tomatoes, peppers, olives and onions with OO and vinegar. I'm not a pepper person but the freshness of all the ingredients could be tasted in every bite, and those peppers tasted like salad candy. \n\nWith our hard time deciding we went for a half Margherita half White pizza as per recommendation from our server Trimell, who knew we were first timers. Both were amazing but the Margherita was my favorite. The freshness of the tomato and basil was everything. The pizza was thin in bread but not overly crunchy with just the right cheese to sauce ratio. Since it was two of us sharing a 16\", we passed up on eating too much of the crust to make sure we got through the delicious topped pizza part of the pie.\n\nShout out to our server Trimell, epic in service and attentive without being annoying. Had charm and interest in ensuring we had a good time and experience. \n\nDefinitely going back the next time I'm in the area.", "author": "Natasha M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-06-01", "description": "This place was on my radar largely due to the social media influence Juliana's has received. As a guy who has worked for a SEO (internet marketing firm), I should've known better. Because the pizza here was disappointing. And the biggest red flag should have been when we came in after a 30 minute wait and the whole place was crowded with Asian tourists.\n\nThis is a tourist trap.\n\nMy party had the No. 1 and No. 4., and to be honest, we could not decipher them apart. When we bit down, all we tasted was oil and salt. There was no crunch or sweetness from the tomatoes. There was just this burst of grease and sodium. I was expecting a real mom and pop's feel, but it felt like the contentment derived from Disneyworld: Manufactured.\n\nService was great, and the pizza came out fast, so I cannot fault them for that. However, I don't think I could recommend this place in good faith. The product did not live up to expectations. Luckily, we had a short wait, and I think that's because our party was small. Had we waited 2-3 hours like the larger parties in line with us, my review would've been met with fury.", "author": "Eric O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-31", "description": "This was my first stop in my trip to Brooklyn, and the pizza was beyond well made. It's flavor was absolutely delicious and the crust was probably the best thing about it. The pasta a la puttanesca was my favorite thing there! The red sauce was so tasty and the pasta was cooked perfectly al dente. \nThe only 1 things I would give criticism for was the Cesar salad dressing had too much of a vinegar flavor which made it overwhelming rather than enjoyable. I prefer putting the dressing on my own salad so I can put the amount I like, so that's my advice.\nAlso, the waiter we had was not friendly but I guess it's New York and that's to be expected. I just wasn't a huge fan of that. \nOtherwise, this place was so great! I will come back on my next trip!", "author": "Ashley L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "Juliana's was recommended to us by our tour guide, and it didn't disappoint. Luckily we got there just before the noon lunch rush started and managed to grab a couple seats at the bar. It was a little toasty up front since we were close to the oven, but it was nice to see the pizzas being made right in front of you. Service was okay, with our waiter just seeming to go through the motions. Could have been more attentive, but the place was packed.\n\nWe decided to share the #4 special pizza, which was topped with tomatoes, mozzarella, arugula and prosciutto. They definitely didn't skimp on the arugula or prosciutto! I like how the pizza was slightly charred and thin, but not too thin. Loved how you could taste the freshness of all the ingredients. A small is definitely more than enough for two people to share.\n\nI also tried some of the Brooklyn style egg cream, which I thought was interesting. Not as sweet as I thought it would be. Reminded me of a Coke float.\n\nIf you are in the area and in the mood for pizza, check out Juliana's!", "author": "Abegail A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-14", "description": "Waited over an hour in the cold to try this place out. I had heard so many good things about the place and I wanted to see what the hype was. \n\nService was great! The waiters are attentive and funny and they're glad you waited so long to try the food. \n\nWe ordered the margherita and the pizza no 4. My friends and I by far liked the margherita pizza more. It was good and the crust was nicely thin and crispy. Something about the arugula and prosciutto didn't mesh well with pizza no 4. It was not worth an hour wait in the cold. I also wouldn't say I liked it more than other pizza places in New York. \n\nOverall, I'm glad I got to try this place, but I'd go somewhere else for a New York slice of pizza", "author": "Christine V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "Don't let the line scare you away!!! \n\nThis place is extraordinary!!! The line was long but we didn't wait more than half an hour to be seated. As soon as we were seated, a waiter came to us and took our order. Then another gentleman came and brought water to the table. \nMy boyfriend and I stood up to go to the restroom to wash our hands and by the time we came back to the table, the first two pizzas we ordered were seating with my sister waiting for us.\n\nTheir service is SPLENDID, and honestly, they are much faster than Flash. \n\nWe ordered two large pizzas: a classic Margherita and Special No. 1, thinking it was more than enough and that we would take a few slides home. Yeah right!!!! We were left wanting MORE, specially me and my twin sister, who convinced our partners to get another one. \n\nI can't explain with words how good their pizzas taste. Their salsa is simply delightful. It was also my first time having pizza without tomato sauce and it was simply PERFECT!!!!!! \nIf you wish to understand what I mean with \"can't be explained with words\", go, review and rate!!!\nI can't wait to be back!!! \n\nPs: You will love it as much as I did.", "author": "Wildary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "Always go to the long line and the long wait restaurants, so you know it's the best one in town, like this one! We arrived when the line wasn't that long but long enough to wait for 25-30 mins. There's no turning back. Must try this! Said I!\n\nAfter getting a table, it was quite the best one too, table for two not far back but right next to the host near the entrance. This is good because not a lot of traffic here. We decided to get a Caesar Salad with anchovies and then we picked a large size #4 pizza with arugula and prosciutto. It was also recommended by our young waiter, Anthuro. He's the best, very respectful and knew what he's doing. The anchovies was the white anchovies and this was good because of all the anchovies we have tried in our lives, the white anchovies makes perfect Caesar salad. It comes with olive too woohoo! After that, we received our huge pizza. It's huge! No kidding! There's another one I'm not kidding, which is... we finished everything in one night. No leftover! Sorry pizza box and paper bag, there's no job for you tonight! We loved it so much and we're feeding the poor, us! Of course we had some desserts too! Cheesecake and Brooklyn Seltzer! Amazing!\n\nSince we enjoyed this restaurant, we thought about coming back soon. We came back after two days and had it to go! No kidding! This time we had a margarita pizza and it was fantastic! I urge everybody to try at least once and combine this with your sightseeing. Brooklyn Heights promenade has breathtaking views of downtown Manhattan.", "author": "Nora F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "Definitely the best pizza I've ever had. ( No I am not exaggerating). Really the best. The quality of the dough and ingredients are unbeatable, and it is such a classic and delicious NY style pizza. It's not too heavy since the ingredients are fresh, service was good as well and our food came out hot and fresh.\n\nI got two large pizzas to share. The first one I got just Margherita which was so delicious and classic. Less is more sometimes, and this pizza is delicious. I could've eaten a while one myself despite how huge it was.\n\nThe second pizza's toppings were Meatball and Ricotta. This was great also, while the Margherita is my favorite, this is definitely my second . Such a delicious combo that compliments each other. I highly recommend\n\nOverall Julianna's is the best pizza I've had, and the best in New York IMO. The crust/dough is amazing \u0026 the ingredients and flavors are fresh and delicious.You have to come by when you are in the area, split two large pizza with your friends and thank me later. I miss this place! Cannot wait to go back one day", "author": "Ana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "Delicious pizza!! I arrived at 4:45pm on a Saturday afternoon with my sister and we waited in line for 45 minutes before we got to sit down. The only reason I'm not giving this spot 5 stars is we had to wait that long. \n\nI thought the pizza was wonderful but do not think I'll be returning just because of the wait. From what I hear and read, this wait is typical. However, if you have the time definitely come here and get the classic cheese pie. I will say once we got inside, the service was very quick.", "author": "Jessica E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "Delicious! We got here at 3:45 and it hadn't opened yet, so we had to wait until about 4:15/4:30 to be seated. The line was fairly long, as always.\n\nWe ordered the Margherita and the #1 special, and both were incredible! The #1 was a bit heavier and somewhat salty for my taste, but still amazing. The margherita was absolutely delicious- the tomatoes were fragrant, the sauce was rich but still light, and the spices flavored it perfectly. Highly recommend!", "author": "Camille C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "We waited about 10 minutes for a Friday night dinner. Soon after, the lineup was about 30 people long. \n\nWe were seating promptly. Between the three of us, we ordered #2 with tomatoes, garlic and sea salt. It was so phenomenal, the flavors worked so well together. \n\nThe large had 8 slices and it was more than enough for us! The service was great albeit slightly rushed but I get it, it's busy and they want to get as many people in ans out as possible. \n\nWould return and try more flavors!", "author": "Kit A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "Do I dare to say, best pizza in New York?! YES!!!\n\nWhen you have to wait in line outside the restaurant to get a seat, you already know this must be the spot. I had read about Juliana's prior to visiting Brooklyn and am so glad I did...this place is amazing!\n\nWe arrived about 10 minutes before the restaurant \"closes\" for 30 minutes for lunch and got in the fairly long line outside. Within a few minutes we were greeted by the owner (maybe manager) of the place ad assured he would be able to get us all in before they close. After about 15 minutes of anticipation we were seated in the cute restaurant with the delicious smell of coal fired pizza filling the air. Our server greeted us promptly and quickly returned with 2 ice cold beers, we ordered a large margarita pizza and within about 5 minutes it came to the table. As a self proclaimed pizza snob I take my pizza pretty seriously and this pizza did not dissapoint! It was perfectly crispy on the base, the thinnest crust I think I have ever had and the perfect mix of fresh mozzarella, delicious tomato sauce and basil. \n\nBetween the two of us we devoured the whole pizza and left happy and extremely full. We will definitely return when we go back to Brooklyn!", "author": "Lucy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-11", "description": "We waited 30-45 minutes in the Snow for this very popular place. We ordered a custom half and half margherita. They have their classic pizzas, which you can add a max of two toppings to, and their specialty pizzas which accept no modifications. The wait was a bit difficult, but there was a party of 50 before us. The staff was friendly and did their best to move things along and get us to our table. \n\nThe pizza tasted coal-fired, but it was not evenly crispy. It was good, yet not the best I had in NYC. I would recommend adding more flavors to their menu or even maybe a build-your-own option. We also had an IPA from their beer menu, which was decent, and a Chianti, which was very good. Also, some kind of covering for people having to wait in the rain or snow would be helpful.\n\nAll in all, this is a very popular place, I would allow yourself time for the line and getting in, and check out their menu ahead of time. If you're a pizza fan, you owe it to yourself to try different pizza shops in NYC and see which ones you like the most.  That said, the table next to us was having a large and impressive looking calzone,  I would try that if you're hungry.", "author": "Jorge R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "These pizzas are insanely good (read: fresh mozzarella, tangy and slightly sweet tomato sauce, crispy roasted crust that's just thin enough). It's also a plus that it doesn't take too long to wait and eat. Ladies- there are under seat hooks for your bags!", "author": "Alesa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "I was very lucky to get in line early, because that line filled up real quick. We were able to get seated as part of the first wave of customers. I recommend getting there around 11:00 AM to get in first. Service was fantastic. No complaints.\n\nOk. The pizza. Wow. Just wow. This is some GOOD pizza. I never knew what good pizza could be like until now. Juliana's has deliciously thin pizzas that have the perfect consistency of chewy yet crispy pizza dough and superbly fresh ingredients. Each ingredient can be tasted as noticeably high quality. I was able to scarf down half a large pizza without blinking. A beautifully made pizza, one I'd recommend for all to try.\n\nHighly recommended, I will definitely be coming back another time.", "author": "Brian V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "Be prepare to wait on the line for good 20-40 min depending on a day but its completely worth it and we have never been disappointed. Pizza is always good, service fast and friendly and the prices are ok. Its also possible to take to go and go down to the park to enjoy a water view.", "author": "Anastasia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "Came here on an extremely busy Saturday afternoon. The wait was too long that we called in a pickup order which would be ready in 2 hours. We went to Brooklyn Bridge park while we waited for our pickup time. We got a small (15 inches) half margherita and half pepperoni. Pizza was baked in a coal oven and it was amazing! Hot and fresh. Must try!", "author": "Juan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "Great place. We love coal fired pizza and this place is a gem. Came here after watching sunset at DUMBO, which was dinner time. The wait outside surprisingly wasn't bad as the line moved fairly quickly. When we got in line we were about 20 people and 5 groups back, but were seated in less than 30 minutes. Service on the inside was great as well. Timely and attentive as well as fun. \n\nWe have been to other coal fire pizza place right around the corner and learned of the interesting connection between the two. Having eaten at both I prefer this one. It has more of a local feel to it than the other place, as well as top notch service and great pizza. \n\nPizzas come in two sizes and both are cut into 8 slices. Our group of three found the smaller size plenty big enough. We ordered the margarita pizza and added Kalamata olives and pepperoni. It was a great choice. Pizza came hot and fresh with the characteristic light char on the bottom of a coal fired pizza. It was delicious. \n\nWe washed it down with some egg creams. They also were really good. Can't go wrong with either but I think I enjoyed the vanilla one a little better. \n\nRounded out our meal with a slice of NY cheesecake drizzled with raspberry sauce. \n\nGreat service, pizza, drinks, and dessert made for a great meal. We will be back next time we're in Brooklyn.", "author": "Jeff B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "I was visiting NY a few weeks ago and was determined to get my hands on some pizza in Brooklyn. A subway ride and a walk in the rain later, my husband and I finally made it to Juliana's Pizza. We came on a Friday night around 8pm and the line was out the door... and for good reason! The service, the pizza, the dessert were ALL absolutely amazing! \n\nOur server was the sweetest old Italian man. He quickly took our order and made some great suggestions. We ended up getting a small Margherita Pizza to share between the two of us, and it was more than plenty of food. The pizza itself was pretty thin and not as doughy as I expected. Nevertheless, it was delicious! The flavoring was all there! After our meal, our server talked us into getting the Egg Cream dessert, which to me was like a chocolate soda. DELICIOUS! \n\nWhat a great experience! I'll be telling stories about my mission to get pizza in Brooklyn again and again!", "author": "Soomi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-27", "description": "Juliana's is a great place to grab more than a slice. Make sure you come early, it takes about 30-45 min to get a table, but always call in advance to get an updated number. The service is great and servers are very friendly! The no. 1 is a good pizza, the Italian bacon really makes it, but it's very hard to taste the truffle. The lemonade is nothing special, but refreshing on a hot day.", "author": "Sahil V."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}