{"aggregateRating": {"reviewCount": 1971, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-01", "description": "A real let down.  I wouldn't recommend standing on line for this place.  We only waited 20 minutes on Saturday at noon.  Friendly service, great atmosphere but the Margherita was average, at best.  No different than pizza you could get at many other places with no wait, and with lower prices.  ($17 here for a small).  The crust was too charred, even though asked for lightly baked since the crust looked very thin here.  It also lacked flavor of a truly good crust.   It was more stewed half tomatoes on top rather than a tasty sauce and very little cheese.  Tiny specks of fresh basil.  Overall, the pie surely was not bad but I wouldn't call it a good pizza.  It lacked that great flavor you can find at other top Margherita pie serving restaurants in the city.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Manager mathew was so kind and nice. A little long wait but was def worth it!! I dont like the bread at the end usually but here was different so soft and chewy at the same time! You can see them making pizza as well. I had a chance to talk to original pizza guy grimalddi and i even took a pic with him! Love the location right next to the brooklyn bridge :) ill def come back.", "author": "Sunhee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Less wait and better!! Thin and chewy crust with just the right degree of yeast; mild yet flavorful sauce not too overwhelming. I'd recommend extra mozzarella if u like rich cheesy topping, but I liked mine just as it is! =) \n\nOne more thing -- what's so much better than the other tourist spots that rip off your opportunity cost in line is the awesomely friendly service!", "author": "Ida L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "Went there yesterday as it was recommended by a local and WOW! It was incredible...best pizza I have ever had!", "author": "Sarah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "As a native New Yorker, it's sad for me to say, but this past Monday, July 4th was the first time i have walked the Brooklyn Bridge. Then again, I'm sure I'm not the only New Yorker who still hasn't walked the Brooklyn Bridge.\n\nOnce my Fiance and I reached Brooklyn, we both opened up our trustee Yelp apps to scout some good Brooklyn food, and we both came across Juliana's. \n\nWe noticed the numerous 4 out of 5 stars, 5 out of 5 stars. Reading people's reaction about how this is the best pizza they ever had, worth the wait blah blah blah.\n\nWhen a place gets hyped like this, it's only right to try it and see what the hype is all about and let me tell you....DEFINITELY the best pizza i ever had.\n\nNow i know it's hard to wonder bc New York is known for it's pizza so how can that be the best....well there always has to be a #1 and this spot is.\n\nDecor: Relaxed atmosphere. The Sinatra influenced is felt throughout. \n\nFood: ON THE MONEY FANTASTIC. We started out with the homemade meatballs, which were good. You receive 3 large meatballs, but the star of the show was the pizza.\nYou can only order pies here. \nSmall or Large. \nMy Fiance and I ordered a small pie, which contain 8 slices. We had the #1, which has no tomato sauce, but has Mozzarella, Panchetta, Scallions, and truffle in olive oil. Who would've thought my favorite pizza would have no tomato sauce. It's amazing. \nI feel life is so much more clearer after i found my favorite pizza. ha. I mean it's that great\n\nDrinks: didn't have any drinks. just water and a coke\n\ndefinitely worth trying so if you are in the area or looking to do the Brooklyn Bridge walk, hit this place up. We waited 20 minutes outside but i didnt feel we waited that long.", "author": "Jon R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Fabulous pizza, well worth the wait (and you can call ahead if you want to save time).", "author": "Oliver B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "O\nM\nG\n\nI usually review places I love rather quickly because human nature tends us to do that (or if we hate it). But in this case, I was in utter shock from how AMAZING and perfect this pizza was.\n\nI am a big pizza dude. I've tried all the big ones (for the most prt) and I won't mention names, but Juliana's has earned its place for me in the top of the list.\n\nMy brother and I ordered the margherita with extra mozzarella, sausage, and ricotta. As I said before, OMG. The quality of these ingredients, the balance of the dough, sauce, cheese, sausage, and ricotta was perfect. I ordered the organic black berry cola which was the perfect balance to a perfect pizza.\n\nThe dough and crust was so well cooked and so perfect. We literally licked our plates because the thought of even wasting a drop of that sauce would be considered a sin, and my brother and I never sin :)\n\nBut seriously, skip that line at Grimaldi's because this is the real deal. It isn't even in the same conversation because Juliana's just blows it out of the water. Instead of reading every single word I wrote here (although you already did since I wrote this at the endow my review), let my picture speak for itself. Thank you Juliana's and I promise this was the first time I tried you and it certainly won't be the last. Great service by the way too!", "author": "Marland V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "Awesome pizza! This place is located right next to the Brooklyn Bridge in a nice part of town. We had a short wait but it wasn't anything too bad. Coal oven cooked pizza tasted amazing.  My wife got the egg cream shake afterwards and it was delicious.", "author": "Erik B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Guys, this place is so worth it. You will NOT be disappointed. We went during off-peak hours so the line wasn't too bad. The pizza was perfect, best pizza I've had in the city so far. The crust was just right and it really hit the spot. Really recommend this place!", "author": "Mahsa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "GOOD:\n-this place is right next to famous Grimaldi's pizza and in my opinion is way better that the latter!\n-first of all the staff is so nice and hospitable! service is simply outstanding\n-they do accept cards\n-they serve alcohol\n-prices are very decent\n-awesome interior\n-...and of course -FOOD! One of the best pizzas I've had in my life!\n\nBAD:\n-can't think of any\n\nFrom now on this will be my go to place anytime I crave a pizza!", "author": "Vlad V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "We've been here many times no matter how long the wait is.\n\nPizza pie is quite cheap for a restaurant!\n\nGrimaldi himself was there every single time we visited this place.\n\nWe were seated at the bar once (which is infront of the pizza baker counter) and we were very impressed how the hispanic men made the pizza. Looks like they use fresh dough and ingredients. \n\nWe will keep on coming back every time we visit the Brooklyn bridge!", "author": "Bernadette E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "I arrived at 3pm today, and was told by a very ghetto front desk woman that I had to wait behind a red rope in the sun till 4pm because they have to \"restock their coal\". I kindly asked her if I could stay inside where they have the A.C. , well she then snapped at me saying \"no\"! \"go standing behing the rope\"( all while point to the rope outside) this is the only reason why I gave this place 4 stars. \n\nI decided to wait after all it's just an hour, and I came a very long way on the train to eat here: I was the first person to form the line, but The line began to grow quickly as the time passed.\n\nAfter an hour of standing out in the sun, we were then let in at 4:05pm, people were seated by the number of people in their party . \n\nThe waiter took our order after we have been seated for 15 mins; I ordered the Classic basil and a Pinot Grigio.\n\n30 mins later The pizza arrived nice and hot, stright out of the oven. The pizza had was nice and slight chewiness and a bit of a crunch at the crust like I like it. \n\nThe wine was chilled perfectly. However, the tap Water came without any ice and was at room temperature; I had to request for a cup of ice which was brought out timely. \n\nAfter my wine and pizza, I ordered a cappuccino which was fresh and tasty...", "author": "Lisa X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "To be frank, i imagine writing this review is similar to an ESPN columnist writing a piece on how good at basketball Michael Jordan was. Just lots of repetitive ramblings on awards, accolades, and throwing around the term \"greatest of all time\" a lot. \n\nI don't know if their pizza is the greatest of all time status but what I do know is that I've never felt more welcome and comfortable getting served a pizza pie.  I mean, someone even helped me take off and put on my coat...whaat? With warm and attentive service coupled with a damn good crispy thin crust, this is definitely the most memorable pizza experience I've had to date.\n\nBut since all this has already been covered in exhaustive detail, I'll just shut up, leave my 5 stars here, and write \"see below for more info\".", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Amazing !! Pizza is not my thing but this place was worth the wait and the flavor is amazing!! The location is everything!! Can't believe how fast the pizza came out.. yummy !!", "author": "April R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-31", "description": "Two stars for the pizza and five stars for the dessert Brooklyn Bridge. We ordered a half Margarita pizza and a half vegan pizza(forgot what it is called) . The pizza is simply bland, the tomato sauce does not have any flavor. Also the dough is bit too thick for Italian pizza. they get soggy after you finish the first slice. very disappointed. but the Brooklyn bridge is really good. the brownie sandwiches is very chocolaty and the vanilla ice cream is also on point, perfect combo!", "author": "Yumiao B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "Why Juliana's and not Grimaldi's?  After reading the story behind each, I wanted to try the original Grimaldi's which became Juliana's.\n\nMy friend and I walked up to the historic restaurant and were seated immediately in the dining room that only had two occupied tables.  It was just before noon on a very warm weekend day so we had expected crowds.  By the time we had left all the tables were taken, so I guess we had great timing.\n\nWe decided to split a pizza.  The choices all looked so good but we decided to split  the special with tomato, mozzarella, arugula and prosciutto, size large.  That pizza was as close to perfection as it was going to get.  Thin crust, lightly charred.  The crust never became soggy, even in the middle.  The ratio of sauce to cheese to toppings was perfect, as was the level of seasoning and freshness of the ingredients.  Nothing slid off the pie, nor was one area of the pie more dense than another.  I have only good things to say about this pizza.  This is what I think of as \"New York\" pizza.  It was 10x better than Lombardi's (I was dragged there...it's a total tourist magnet).  I only wish I could have been able to try other pizzas but the large was a good size for two adults.\n\nService was great, no complaints at all.  I appreciated their attention to detail in ensuring that we enjoyed our experience.\n\nMy friend and I had walked across the Brooklyn Bridge and found Juliana's without too much difficulty.  It's near the waterfront with a nice park nearby.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "Great pizza. We originally waited in line to go to Grimaldi's, but heard this one beat it by far. So glad we made the switch. We got the margherita pizza and the No. 1. I loved both, with a slight preference for the No. 1 only because the margherita pizza quickly got soggy in the middle. Delicious food -- my only gripe is that the AC was on so high that our pizza cooled off very quickly, so we only got a slice or two before it got cold. Too bad!", "author": "Jen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Having no wait was a huge plus because it was raining.. But the steaming meatballs to start really whets your appetite. Then to dig into the pizza. Just a simple pepperoni pie. Yummmmmm. The ingredients they use shows how pizza is in New York versus California. I mean we all know New York has the best pizza in the country, but getting to eat it and taste why every time is my favorite thing to do. There are so many places in New York to choose from. This definitely is high up in my list. And the Cannoli. Mamma Mia!", "author": "Cheri P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "Went back to Juliana's for a second time and fell in love EVEN MORE!  Even though we had to wait about 40 minutes this time around, it was well worth it.  The Caesar salad with anchovies and green olives was pure perfection (might need to get it every time now).  I never opt for a white pie, but I was in the mood to try something new.  Being that the BF was starving, we got a LARGE pie - half margarita with pepperoni mushrooms and half white with fennel sausage.  To my surprise, I couldn't get enough of the white pie!  It wasn't overly cheesy or creamy (which is why I usually lean towards a red pie) and the fennel sausage was its perfect compliment.  Juliana's may have turned me on to a whole new pizza page.  But don't worry my dearest marinara sauce, I will always love you first.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Food: 4.5/5.0\nService: 3.5/5.0\nValue: 3.0/5.0\nDecor: 4.0/5.0\nOverall: 4.0/5.0 \n\nTo echo many other reviewers, Juliana's is indeed better than Grimaldi's, though only slightly (to say that Juliana's is way better is an exaggeration).  It is insane to me though that people are willing to spend an hour waiting on line for the Grimaldi's next door when Patsy Grimaldi himself has opened a much more homely little shop (ie. Juliana's) with the original Grimaldi's coal-fried oven in the original Grimaldi's spot.  The last time I went, I skipped the Grimaldi's line, walked into Juliana's, and got seated right away.  Nuts!  I think the only way this insanity can possibly be justified is if you didn't want to pay the 10-15% price premium that Juliana's is commanding over the Grimaldi's pizza factory.  \n\nPS You know New Yorkers are getting spoiled by amazing pizza when I can't bring myself to give a shop like Juliana's five Yelp stars.", "author": "Damian W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}