{"aggregateRating": {"reviewCount": 1970, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "I had Juliana's bookmarked for a while, so yesterday my friends and I decided to head out to Brooklyn for some pizza after spending the morning in Central Park. \n\nI gathered from other Yelp reviews that this was a popular spot for tourists, so I was prepared for a line out the door. We got there around noon, and while there was a line it wasn't too bad - we waited about 15 minutes at the most. The interior crams a lot of tables into the space but it has a very open feel to it - I didn't feel cramped at all. The kitchen is open which creates a nice focal point and the neutral color scheme keeps the main focus on the food. \n\nOne of my friends noticed they made egg creams, so for nostalgia sake we decided to order some. I went with vanilla (they also come in chocolate) and it totally brought me back to my childhood - a real special treat. \n\nWe started out with a salad which contained cucumber, red onion, tomato, arugula, frise, goat cheese, walnuts, and house dressing. It was good - flavors worked well and the dressing wasn't overwhelming. I'm a sucker for anything with goat cheese so it was definitely a winner. There were three of us, so we decided to split two small-size pies. We chose the margherita and the special no.1 pizza (mozzarella, scamorza affumicata, pancetta, scallions, white truffles, and olive oil). The pizzas were very good - super thin crust and full of flavor. They were also generously sized which left us with plenty to take home. \n\nService was good - our waiter was very friendly and always made sure we were taken care of (with a line outside the door you can be sure you won't be forgotten). Overall I had a great experience here and would definitely come back to try more pizza and their other offerings.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Daaang this pizza is kickin. Its so good! We got a white based sauce with meatball sausage or something. Tbh dont remember and doesnt matter because anything here would probably taste good lolol. We took one to go and ate it in Central Park, talk about a mighty fine day. \n\nNote: its as popular as the reviews rave. The lines get mighty long, it was out the door first time we came at night...probably over an hour wait. We came back early next day and got in a smaller line before it was even open to get seating asap.", "author": "Sandra N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Let me start off by saying I've tried all the best pizza joints in the city. Lombardi's, Paulie Gee's, you name it. I've even had Grimaldi's in Scottsdale, AZ and in California. They're all great in their own ways, but to me Juliana's hits the spot every single time. This is the quintessential NY pie.\n\nAgain, to me this is the best pizza in NYC, and maybe the world. Crust and dough are perfect. Little bit of coal fired char on the outer rim, and nice and doughy on the inside. Mozzarella cheese is chewy and tasty. Ricotta is smooth and flavorful. The sauce is made from tomatoes important from Italy and vibrant and flavorful, but also not overbearing. We went with a white and a half sausage onion/half pepperoni. The owner is also awesome. Super friendly guy and is passionate about pizza!", "author": "Andy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "The perfect place to go to after walking the Brooklyn Bridge. The White Pizza was a winner. Over all a great place! But we did have to wait for 20 mins or so for a table. Totally worth it!", "author": "Rhea C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "This review is from a visit 3 years ago while in NYC for Christmas.  We were looking for a late afternoon dinner on Christmas Eve as the Noche Buena meal would be served quite late at mi esposas family gathering.  We were on our way to the joint next door.  Navigating by phone, a local asked what we were looking for.  He recommended Juliana's.  I'm always one to take a local recc.\n\nWe were not disappointed.  Service, food, wine blew away the overrated joint in Manhattan that is a tourist trap.\n\nWhen in NYC again, Juliana's is on the must go list.", "author": "Bill L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "The entire experience is fantastic. Worth the long wait. One of the best pizza in NY. My friends and family LOVE it. I got a salad, and it was fantastic. Would have loved gluten-free options besides salad, but honestly, the salad was so good, I almost forgot it was my second choice. The owner often walks around and greets you. He loves to see happy customers and will go out of his way to ensure it. To avoid crowds, come EARLY.", "author": "Anne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "A classic to DUMBO, the pizza is delicious, hits the spot, is authentic, quintessential, iconic, 'classic', all the same word for good. There will be a line, and if your in Dumbo, its certainly worth it. The pizza is delicious, flavorful, homemade, and the best part is it is coal fired. This just creates that delicious aroma that is a full sensation of tasting, smelling, seeing them cook it, feeling the crispness. I thoroughly enjoyed my pizza and beer here. It has a vibe of 'old school' Italian meets chic new york, but honestly my favorite place to sit is at the bar so you can watch them make the pizzas like madmen, very talented madmen. They have it down to a system and are professionals. The amount of dough that they have prepared is astronomical, and I was so impressed with their operation. What sets them apart from the other pizza's is that the crust is thicker, doughier, has more air, but is lighter (not as crisp). The flavors are strong, cheese/sauce ratio is perfect.. this is an epic NYC pizza.", "author": "Kim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "My wife and I are grateful for the yelp reviews that lead us to Juliana's! It was a highlight for us both, but her favorite restaurant of the week, so I asked her to review it -\n\"It's easy to see why Juliana's is rated the #1 pizza in Brooklyn.  I ordered the #4, a small pizza (the size was more like a large compared to the pizzas we are used to) with prosciutto and arugula.  My choice was sort-of on a whim.  I could tell my husband wasn't sure about my choice, but we ended up polishing the whole thing off between the two of us.  Not only was the pizza delicious, made with the freshest ingredients, we also shared the cannoli and it was the best I've ever tasted.  The environment is charming - fun, yet intimate.  The service staff was polite and you could tell they took pride in working there.  \nEat here! You won't be sorry! \nOne last note - they sell Brooklyn Ice Cream Factory Ice Cream here - which is delicious - we had just shared a cone before dinn! But if you're going to have the ice cream, just walk around the corner and get it right there at the building by the water!", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Seriously amazing by this place! The pizza was amazing and the people there were also great. If you're in the Brooklyn are and need pizza, this place is the perfect place.", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "I'd tried Grimaldi's next door but had heard that Juliana's was way better, so needless to say, I was super stoked about trying out their pizza!\n\nWe were in line waiting for a spot, but decided to just order take out instead so we could go enjoy our pizza on the pier. It was a super simple process, and the entire order took less than 15-20 minutes to be completed. Plus, you don't have to wait in line! You can just head inside to the counter, pick up and pay for your pizza, and be on your merry way! I'd definitely recommend this option if the weather is nice outside and you don't really care to dine in.\n\nI ordered a margherita pizza so I could do a direct comparison between Grimaldi's and Juliana's. Unfortunately, I found Juliana's version a little less flavorful and much less satisfying than Grimaldi's. No doubt the ingredients were just as fresh, but I felt like the pizza was lacking the oomph I had expected. Although I liked that the pizza tasted healthy and guilt-free, that's not really what I'm looking for in a cheesy, carby slice! \n\nI'm definitely looking forward to a second go though, and next time I will be sure to order a pie that isn't as plain as a margherita pizza.", "author": "Sherry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-01", "description": "Amazing pizza! Great to share, and very delicious! The servers are really friendly and its Nice that you can see How your pizza is Made (there's an open kitchen). Also, amazing prices!", "author": "Marjolein V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "First time to Juliana's Pizza. What an amazing experience! We ordered 2 16\" pizzas, Margherita and a specialty chicken, avocado and cilantro one. For 6 people, it was more than enough.  Will come back again when visiting Brooklyn.", "author": "Gaylien L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "So we were in the mood for pizza and we thought this would be the perfect place. We knew we would never find parking and the line was down the block and around the corner, so we decided to do take out. What a blessing! It is def a lot quicker and as longer as you have somewhere/ someone to double park the car at the Johnny pump your good. So I jumped out and ordered. It really didn't take to long about 25 minutes.\n\nWhen walking into order it was beautiful. A lot different from when I last seen it a bunch of years ago. Its dark wood, clean and looks a lot bigger. You still have the guys in the back making the pies in the open, with the coal oven.  What a tradition.  The menu is very different from the old one, it was more traditional with a limited toppings and a few apps. The new menu has a lot more variety. It's also a lot more expensive! We settled on a lg fresh mozz with prosciutto and arugula and two waters.  We were super happy. The ingredients were fresh. The pizza crust was crispy, light and fluffy. Just like its suppose to be. The pizza was just amazing even though it was take away. The staff was super helpful. \n\nUnfortunately the only downfall was The bottled water. They were really expensive and they were Dasani which is a crappy product but we know for the next time. \n\nWe Loved the food and def will be back!! You should def go visit.. Parking unfortunately stinks! (247)", "author": "Kim G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "Came here yesterday afternoon with a friend and the line was mad long.  Friend told me this place got better reviews than Grimaldi's, and when we approached this estblishment, I saw the pizza that people were eating outside.  I was like DAMN there's no way this place is going to be bad because that pizza looks BANGING. \n\nSince the place was crowded, we got a 'large' Margherita Pizza to go and ate at a table outside.  The pizza came out to like $22 total with tax included, which isn't bad at all. \n\nYou know how some food LOOKS awesome, but tastes disappointing?  That was my experience.  The pizza is mad thin and I noticed there is such a minimal layer of sauce, cheese, and basil on the pie.  It's almost like you're just eating a thin layer of dough without anything on it.  Don't get me wrong; it certainly wasn't horrible, but I was expecting something amazing and it fell far short.  It was satisfying, but could have used double the portion of sauce, cheese, and herbs that it came with.  I can say though that the bites that did contain a substantial amount of the aforementioned ingredients were quite satisfying.  \n\nVery disappointing because I wanted to like it more.  It feels like it's all hype to me.", "author": "Andrei L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "On my first trip to NYC I of course had to try some pizza. First I had some pizza from 'round da way cause my NYC native honey made me. It was trash... but then I dragged him here due to all the hoopla with Grimaldis and such. With this my impression of NY pizza was redeemed. We had the margherita with pepperoni and garlic in size small... which was way too much pizza but we don't back down from a challenge so we just ate it and regretted it later Ok?!\n\nThere was a line outside but it only took maybe 10 minutes to be seated on a Friday afternoon. No complaints, except that individual slices or a size smaller than \"small\" (cause it wasn't small) wouldve been greatly appreciated.", "author": "Candace F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "I visited NYC back in 2006 with a planned itinerary of touristy stuff to do.  However, walking across the Brooklyn Bridge was not on the agenda. That spontaneous act led to an accidental discovery on the other side of the bridge which was worth the walk between busy fast car traffic.  It was already 2 pm when I spotted a line out-the-door of a pizza joint.\n2 pm is when most places wrap up their lunch crowd; I was still full from my lunch, but just had to find out what all the fuzz was about.  I got to eat the best thin crust pizza ever.  It has been 10+ years later now, and I still have not found pizza of equal quality.", "author": "Connie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "HOOOO MAAA GOD. The Margherita and White pizza at Juliana's Pizza was beyond amazing. It was life-changing. This was the best pizza I've ever ate in my entire life. I've been to Italy! Okay? Italy. And I still think that this is the best pizza place ever!!!!!", "author": "Anna I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "This is the best pizza available. We got one with thyme and another special pizza. We went on a saturday afternoon, waited only about an hour for a table of four. The pizza - omg the sauce really shines, not to tart, great flavor. And the crust - I have had plenty of decent brick oven pizza, but you know if you leave the pizza even for an hour, it's going to get hard and impossible to eat. The crust was so soft with that smoky taste. I can't imagine beating this.", "author": "Hank N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Amazing, fresh, hot, delicious pizza!\n\nIt was a warm, sunny day by Dumbo, Brooklyn, when we stumbled upon this gem. The view of downtown Brooklyn also looked ravishing from the front of the restaurant (where a long line accumulated).\n\nWhen we were seated, the waiter catered to us right away. He was very friendly and attentive! We ordered a large pizza pie (with half margherita, homemade meatballs, pepperoni and the other half with white cheese, prosciutto, and mushrooms). You cannot do one half of the specialty pizzas listed on the menu, both only ones that you create from scratch and then add on toppings.\n\nThe soft drinks were served from the vintage bottle with a straw and they have a great assortment of wines. Each table comes with a pizza stand/holder which can be removed if you are not ordering pizza (but I highly recommend that you try their pizzas at least once)!\n\nThe wait time for the food was not that long, especially since they are lovingly made from scratch (and baked in their coal fired oven). When I first bit into the pizza slice, I knew that the 45 minute wait standing outside in a long line was worth it. I cannot wait to come back!", "author": "Kay Ashley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "This pizza was delicious! I had a white pizza with mushrooms and my husband added pepperoni and sausage to his side. The cheese and the amount of garlic was just right. Crust was thin and flavorful. I just loved every bite. The great thing is that they can do two completely different sides of the pizza. I got white and my husband got Margherita sauce. Most pizza places act like that is so difficult to do. So I was very happy about that. We ordered a small pizza which was 6 decent size slices, and we ate all of it. I was trying to hold back on the last slice, but then I thought 'What the hell, go for it.' I did and it was wonderful. They had ginger ale in small bottles too. I love Canada Dry, so that was a bonus. \n\nIt is pretty small in there, and it gets packed quickly. The line moves smoothly. We seemed to have timed it perfectly because we only waited about 5 minutes. When we left the line was down the side walk.", "author": "Latasha B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Juliana’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "19 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-zAVNXSKJDQNYZQYWbqNRA/ls.jpg", "@type": "Restaurant", "telephone": "+17185966700"}