{"aggregateRating": {"reviewCount": 6, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "Excellent value for money. Its different tasting chinese food compared to where I come from, however it was tasty, fresh and lots of vegetables cooked beautifully.\nIt wasnt swimming in sauce nor bulked up with rice.\nBottom line; would I order ftom them again? Yes", "author": "Susi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "One of the better Chinese takeouts I've ever had. The general tso is absolutely amazing and so tender yet so crunchy. Everything here is amazing. You ever wonder why it's called Chinese takeout bc Chinese takeout is American. Should be called American Chinese takeout.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Have been meaning to review this place for years now. Definitely the best Chinese restaurant in the area. Usually we get the general tsao chicken, and kung pao shrimp. Always tastes fresh and not too greasy like other places.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "From Dale Talde:\n\n\"Chuang Hing is where I do almost all of my takeout and delivery ordering. It's just awesome and it's the cleanest Chinese takeout joint I've ever seen in New York City. It's family-run and they take so much pride in what they do and it shows. My usual order is General Tso's chicken with pork fried rice, an egg roll and two Dr. Peppers.\"\n\nWhat more needs to be said?", "author": "Ned H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "The food here is amazing, and it's a great deal.  I usually order their lunch special and get 2 or 3 meals out of it.  The fried rice is amazing, and they have a nice variety of veggie dishes.  It's a classic hole in the wall place inside, the dining area is run down and not super comfy.  I would definitely recommend ordering delivery or taking out if you want to eat here.", "author": "Larissa N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "Okay, let me preface this:  I do not like chinese take out.  However, I will eat it when I am extremely hungry and I am bribed with a DVR'ed Syracuse basketball game. \n\nHere is my review: \n\nChicken Chow Mein:  Tasted like Chicken Chow Mein\nWon ton Soup: Tasted like Won ton Soup", "author": "Chris M."}], "servesCuisine": "Food", "priceRange": "Under $10", "name": "Chuang’s Hing Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "48 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/MuUHfWjDUan80k5_voZXlQ/ls.jpg", "@type": "Restaurant", "telephone": "+17187973188"}