{"aggregateRating": {"reviewCount": 23, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "Where do I start?  I walked in one night to order food and said hello first and was totally ignored.  I couldn't believe it , so I said hello again.  It was late, but they were still open and did not acknowledge me at all.  I am an African American woman and I felt that they were letting me know that they really do not want to serve me.  So, I walked right on out of there.  I don't think a business should be supported if they are going to discriminate by race or color.  It doesn't stop me from loving Japanese food or culture.  I will never try to go there again.", "author": "Angela H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "This place was great.  Good food. Clean orderly system. I waited a little longer than I expected but it was worth it. The cashier was nice and I appreciated the cleanliness and attention to customers. It was busy and the staff was not all over the place, they were organized and focused. The chicken teriyaki was delish and a good portion for a good price.", "author": "Lorraine Lola W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "Visited this place about 3 times so far. Once during lunch, other two times at night. Service is fast, even during the lunch rush. Food is reasonably priced, and the portions are nicely sized. They cook whatever you order in front of you on the grill, which is nice. Overall, a cool place to go to for a bite.", "author": "Aatish P."}], "servesCuisine": "Japanese", "priceRange": "Under $10", "name": "Hibachi King Express", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "150 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rrUuw71pe9Zukr1muSsGeg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555281"}