{"aggregateRating": {"reviewCount": 23, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "The food taste good. I am here with my god sister. I would Recommend my friends to come eat when they are in jay street and it good to bring you date here or friends reunion", "author": "Jenny Umi H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "Pros: price. Cons: food quality.\n\nThey should hire better line chefs because the rice is tough, chicken is dry, and the dish has no flavor with no traces of Teriyaki sauce. It is cheap and there's seating inside, but it's the worst Teriyaki I've had", "author": "Peter H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-16", "description": "I was duped as well and didn't read the reviews. What made me go in was the prices. Ordered teriyaki beef and rice. The rice came out of the rice cooker, and was like pellets. Inedible. The beef tasted like processed beef with a barely any teriyaki. They gave me some cabbage I think it was, but it was so huge, like a uncut leaf. Pass this place by.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-09", "description": "Didn't check the reviews before dipping in here unfortunately. Very mediocre food. I got duped by the attractive prices on the storefront and the place looked busy so I decided to give it a try. I imagine the prices are what keep this place busy during the lunch hours because it is certainly not the quality of the food. Ordered a shrimp bento box and everything was so bland. The food was also just kinda sloppily prepared. They do give a good sized portion but I've had way better tasting Japanese food. I do not plan to come back.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-26", "description": "I stopped here for lunch because I was in a hurry. I had a bento box. Not awful but mediocre. This place has nothing to do with Japanese food. Only for people who don't care what their food tastes like.", "author": "Leo J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-13", "description": "This food made me terribly sick the day after eating it!! I had to stay home from work due to food poisoning! If you want to avoid vomiting, headaches, and stomach pains, stay away from this restaurant.\n\nAnd to make matters worse, the food was extremely mediocre at best! It was a very sorry excuse for hibachi and my shrimp could have been grilled more (probably how I got sick!). Not to mention, the  customer service sucked too. Stay away!", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Very good sushi. they give alot of food compare to other restaurants. i like the chicken teriyaki and the salmon roll. very fresh.", "author": "Jerry L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "I ordered a spicy chicken hibachi with fried rice and this is what I got. The chicken was mixed in with the rice, the rice is tasteless even after adding hot sauce and soy sauce, not well cooked, and the rice isn't even fired rice it's just yellow rice. The chicken tastes nasty. I wouldn't recommend this place to anyone.", "author": "Nawal S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-19", "description": "I would give this place 0 starz if I could. Cheap isn't always better. The quality of the food is mediocre at best but the worst part was the cashier he was incredibly rude, yelled at me in response to a question I asked about the sushi menu \u0026 completely ignored and dismissed me when I was mentioned the food was to dine in and walked away. Never spend your money here. The food isn't even worth it.", "author": "Tatianna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "The worst Japanese Food ever!! Food is nasty, mediocre and overpriced. STAY AWAY!! $9.79 wasted. I'm calling my Bank to file a dispute to issue my money back,that's how nasty it was.", "author": "Sancia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-19", "description": "Ordered the crab rolls which was pretty tasty. The crab meat was flavored properly and for 4.99 you can't best the price. I will come back for the sushi again. I remember trying food here a few years ago and it was just ok. Sushi is a plus though.", "author": "T H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "You can see your food being made. Unfortunately I had already paid when I seen the chef use the same spatula for chicken and beef. The lady working the register was cleaning the countertop and grabbed the trash can and leveled it with the surface so she can directly throw the garbage in the can, then of course didn't wash her hands when she was the one preparing the trays.\n\nSo about the food:\nOrdered beef fried rice. The rice was plentiful, but tasted horrible. Had that play doh taste. The beef was scarce and had no flavor at all. \n\nWill never be coming back.", "author": "J A M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Hibachi King serves bento boxes, teriyaki beef, teriyaki chicken, dumplings, sushi, etc.\n\nI've walked past this shop several times because in my general experience, ''Hibachi'' places like this don't really serve authentic dishes, and the food is half-assed. \n\nAlthough I haven't ordered any of the rice or teriyaki dishes here, I'd personally recommend to stay away from it. When I was there, I saw the ''fried'' rice come out of a rice cooker, it's just yellow rice with steamed peas and carrots ._. \n\nHowever, I noticed they also serve Sushi and I love vegetable sushi's, so when I saw that Hibachi King had Avocado Rolls for only $3 (+Tax) I ordered multiple rolls.\n\nLet me just say, the avocado rolls here are sooooo good here.I know I know, it sounds really simple but I ate all the rolls within a few minutes of getting home. I shared some with my sister and that look on her face was the ''Holy crap, this is delicious'' look.\n\nThe rolls had big chunks of avocado in them, they didn't skim like some other sushi places I've been to.\n\nService in terms of friendliness was mehhhh, but in terms of speed, it was fast service.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "Kind of tasty and very cheap. The stuff was oily, but my teriyaki chicken could have been worse.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "Let's call them \"Hibachi Prince\" for now until I try some other dishes. \n\nI'll start with the bad.\n\nThe fried rice, not so fried really. It came out of a rice cooker so I believe they misunderstand the concept of fried rice. \n\nThe shrimp looked and tasted like it was from a pre-made shrimp ring you would get at the supermarket. That's all I got to say about that.\n\nNow the good.\n\nThe beef was tender and tasty. The veggies were steamed so I got my healthy portion of the day out of the way. \n\nThey accept credit cards but for a 10.00 minimum. They do however have an ATM on site that gives out ten dollar bills. They have that going for them, which is nice. \n\nThe staff is very friendly, fast, and efficient. All the food is made in front of you except for the sushi (that scares me a little. Only a little though.)\n\nIf you want some quick, decent, Japanese fast food then this is the place to get it. Just don't mention my name you'll be banned from the restaurant. \n\nOverall it was good enough for me to want to come back and try some other dishes (minus the hidden sushi.)", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "This place is a very much improved restaurant over the last one they had. They are the\nsame owners \u0026 deserve another chance. They use to be the Infinit Tea Cafe that Closed Down. I have ordered on 4 occasions. I like the Beef, Chicken \u0026 Shrimp specials with the mixed vegetables \u0026 Rice. Basic seasoning is used not overly spicy or salty. Their Spring\nrolls are a favorite of mine and the Sushi is alright. I took away 1 star, loads of rice \ninstead of meat. Meat could be a few more pieces like the picture Ad menu photos.\n\nThis is a plus for me. I observed  other customers and people like this spot a whole lot. \nI recently starting going back \u0026 will go once in a while. An updated picture menu is inviting.\nThis new revised spot was well lit , plenty of in house dining tables and very clean for 2016.", "author": "Veronna T. L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-04", "description": "You get alot of food. But thats all. It's tasteless.\nStaff is really unfriendly as well. Side dishes were oke.", "author": "Wouter G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "This place is the best place for sashimi. The fish is really fresh and it melts into your mouth. It doesn't have a \"fishy\" taste that I've tasted in other sushi restaurants. The sushi menu is interesting too since there are many styles. The owner is really nice and I would come again!", "author": "Synthia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-04", "description": "Nah. The food is bland as hell. If that's your goal this is your spot. I ordered the chicken teriyaki with brown rice.", "author": "Trish S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "it's not real japanese food. they spoke cantonese which i understood every word they spoke. i got the beef fried rice - the beef wasn't bad but the rice was nothing special. it's a large portion which is great if it had been decent. my friend got the shrimp tempura with edamame (i i think i spelled it right?!) was okay she said. the shrimp tempura wasn't really like shrimp tempura she said. she said it was mostly thick batter. i dont think i will be back tho. it's pretty decent priced maybe that's why there's always such a long line whenever i walk pass it", "author": "Sue W."}], "servesCuisine": "Japanese", "priceRange": "Under $10", "name": "Hibachi King Express", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "150 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/rrUuw71pe9Zukr1muSsGeg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555281"}