{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "you can basically feel the fire from the cooks working to churn out top notch dishes. the food i had here was unlike anything else i'd had before, \u0026 was highly recommended to me.", "author": "Denika C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-21", "description": "I went here for lunch today and was really disappointed.  The beef pad see yue that I ordered was extremely bland and salty.", "author": "Darnell U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-04", "description": "This place has great food.   My favorite is the pork and string beans but everything is worth trying.  Always busy (always a good sign) and always tasty (always good to know) this place deserves to be tried.  My only complaint is that it can be very noisy and hard to have a conversation in.", "author": "Nathan V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "I've love anything Thai.. So getting a chance to see what another part of Brooklyn has to offer is always great.. So two Elites put us on once again. (See Chocolate room for further details of this night) I had thai before at Green Papaya. I was left feeling a bit cheated. So I ordered the Pad Thai and Thai Iced tea. Same thing as I did when I went to Green Papaya. I was blown way by the fact that it was an open kitchen . So you see the hard work and talent put into every dish. Although it takes a bit for your eyes to get used to the dim lighting. You feel a sense of privacy in a place that filled to the brim with people. An as we chit chated the flare from the 3 ft flare ups of the kitchen give it a certain touch that I'm not sure I can put my hands on. There was an order of Calamari with that spicy plum sauce.. It was a match made in heaven said the fires of hell. When my dish arrived I was greeted with the aroma of mint and peanuts.. Some times it's the small things that places do that make the magic.. My meal was awesome. I must go back.", "author": "Garth G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-02", "description": "Honestly its a curiousity how the other THAI places in Brooklyn can survive up against Joya.  The food is solid, the prices are low, and the atmosphere is fun.  \n\nWhile they do deliver, the food always tastes better in the restaurant.  There was a time in my life when I couldn't go a week without their spicy noodles and wonderful salads.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-15", "description": "This is probably my favorite all places.. Taste, Smell, and Price...LOL Always a great vibe and chicken wings... Man o Man.. Those chicken wings.. Haven't been in a long time but I'm usually there on December 28 to celebrate.. my bday", "author": "DJ G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-21", "description": "What a little Thai gem!  Certainly one of the hippest neighborhood Thai food joints around, with it's mod interior and weekend DJ.  There's almost always a wait if you get there after 7pm, even on a Tuesday (45 minutes on a Saturday)!  But the food and the prices make it worth the wait!  Cheap drinks at the bar help pass the time too!  My Thai dad would question the authenticity since they automatically set the table with chopsticks, but my true test of a good Thai restaurant:  the Pad See Ew.  And I'll tell ya, Joya did not disappoint!  Even my dad might forgive them for the chopstick thing!  The massaman curry was tasty too.  One would think that a non-hole-in-the-wall Thai place would mean more expensive food.  Not true at Joya!  4 people who ordered 2 apps, 2 drinks \u0026 4 entrees - with a generous tip - paid a total of $60!!  It's almost like eating in Thailand!!", "author": "suerissa b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-23", "description": "Joya is hands down the best Thai food in South Brooklyn.  (And cheap too) I just wish it wasn't so crowded all the time.", "author": "Tom C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-05", "description": "Love it ,Love it ,Love it ! Service is good. Food is tasty , well portioned , super cheap and is out in less than 15 minutes. The little Thai girls are just the cutest ever and the Thai guys are sooooo hot ! Love it , Love it , Love it !", "author": "Amanda t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-21", "description": "the best restaurant i went in NYC!\nthere was about a 30 minute wait, but it was worth it.\ni had pad thai and wow its was so good, and the price was fair!\ni love the enviroment\ndark, live dj, candles....full bar\ngreat great great", "author": "dayan m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "This is my favorite spot for Thai food.  The prices are very reasonable and the food is flavorful.  The portions are large too.  The place is loud on a Saturday night but all other times it's fine.  There's also outdoor seating in the back.  The only reason it's getting four starts out of five is because the wine selection is ok, not great, but other than that this place is a jewel.  Order the curry when you go!", "author": "Monica S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-12", "description": "The food is okay and so is the speed they bring out your food.  The wait for a table sometimes can be upto an hour if not longer and if you dare to ask the manager/owner \"how long you have to wait\" he will give you a nasty look with the biggest attitude.  Big disappointment!", "author": "Julie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-18", "description": "Two blocks from my house, I get takeout from Joya at least three times a week.  The price is cheap, the portions are huge, and the food is tasty.  All of the noodle dishes are great (the spicy noodle is my favorite) and the curries are good too.  The icing on the cake?  The people that run this place are some of the nicest i've met since eating out in the city (5+ years).  Thank you Joya!", "author": "brett m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-21", "description": "Joys is definitely one of my go to Thai restaurants!  Every time I visit the food is just as I remembered.  The mango salad has become one of my all time favorite dishes. Sometimes the wait staff can be a bit inattentive, but I think that's just because they are so busy.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "The food here is amazing!!!! I make it my business to go anytime I want Thai food. It is usually crowded but I have no problem waiting especially when I remember the tiger shrimp rolls. And appetizer is anywhere from $2.50- $6.00. Entree's are around $8-$10 dollars. The drinks are pretty good also. I enjoy the pineapple fried rice and the spicy pad thai noodles. Joya has some of the best Thai food you can get for a really good price. You pockets won't be turned inside out at the end of your meal.", "author": "t t."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-14", "description": "I don't know why this place is so popular.  The food is only decent, and is definitely not the best thai in the neighborhood.  AND, in addition to the so-so food, both my husband and I have gotten sick after eating at Joya on separate occasions.  If it happened just once, I would have said it was a fluke, but after getting food poisoning twice, I avoid Joya like the plague. (In case anyone is wondering, we went back because we practically live next door, and we were really hoping the bad experience was a 1-time thing). There are so many better restaurants in the area, where you don't have to worry about getting sick and losing your dinner 20 minutes after leaving.", "author": "c w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-30", "description": "I love the decor of this resturant. They sometimes have a DJ playing cool music; the drinks are really good too. This place kind of got over populated so it is hard to just walk in on an evening and get a table. My favorite dish is the Pak Kraitum veggie dish.. I will order it over and over and over", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "So I thought I had found  the perfect Thai restaurant until I stumbled across this place one night last year. I was shocked to see that it was crowded on a Tuesday night but I now understand why. The place is dimly lite and gives off a nice intimate feel.I had ordered the calamari as an appetizer and pretty damn good I might say. I was definitley blown away by the Thai Ice Tea. I also was in complete shock at how good the Pad Thai was! Like I said I swear on the Bible of my fav Thai restaurant but this one, mightttt just give it a run for it's money. The Thai Ice Tea is sweet and the tea is not too overpowering. The reason why I love their Pad Thai is because the peanuts do not override the meal itself. I like peanuts just as much as the next man(I mean I still eat pb\u0026j sandwiches)but too much peanuts tends to get a bit boring and a little hard for me to finish the meal. I have only been here twice but I do plan on visiting many more times. Kudos to you guys!", "author": "Tanzania C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "MY WIFE AND I LOVE JOYA!!! Since moving back to NYC, about 75% of the times I've gone out to eat has been to Joya. The food is outstanding and they give bountiful servings. My favorites are the curries and there are more then enough to chose from. Super affordable, my one knock is CASH ONLY ( what's with that?) Other than that Joya has my heart and my stomach for keeps.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-07", "description": "This place has pretty good food at an amazing price. I went one time on a weekend and the servie was slow and the wait for a table was long. However, I went again on a Monday and the service was excellent. I have had better Thia food, but at double the price. Both times I went everyone was happy with what they ordered.", "author": "J P."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}