{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "So crowded.. expect to wait 15mins up on Friday nights\nGarden was really nice, wonderful to dine at a lovely, warm night. \nFood is good, price is better! My fav of the neighborhood", "author": "Tiantian X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-10", "description": "Amazing flavors, HUGE gigantic portions, and so so dirt cheap! Mmm, I'm craving it right now just writing this... \n\nThe food for the price makes this place unbeatable. Even if you have to wait for a table. We've gone with groups before a few times and never had a problem. This is one of those places we usually bring any guests visiting us. It's too good to pass up! We literally can overlook just about any other complaint we've ever had based solely on how much we love the food.\n\nThat said, if you're the type to get easily offended on less than stellar service you might want to mentally prepare yourself ahead of time and just concentrate on the goodness of your plate ... Then again, it's a pretty small space that is always completely packed (THE GOOD FOOD) so we've always cut them some slack. Dim, loud, and full of hustle bustle inside and has a very amazing little tree spotted quieter more relaxed patio in back (weather permitting of course). \n\nMixed crowd. Can go casual or to stop before heading out on the town for the night. Decor is very modern \u0026 clean. Has a full bar and a wine list. But remember! CASH ONLY!", "author": "Staci S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-08", "description": "This spot is pretty cool. The decor is simple, yet nice. Very casual. The prices were very reasonable. Chill vibe.\n\nThe food? Awesome! We ordered spring rolls to start, which were very good, although my friend pointed out that the chef was a tad heavy on the pepper.  For our meals, I ordered a vegetarian Pad Thai and my friend had a grilled salmon dish with veggies and white rice. Both of us agreed that the food was superb. However, the service was TERRIBLE. While our appetizer arrived within a fairly decent amount of time, our food took 25-30 minutes to come out. We ordered spring rolls (blindly), assuming there would be more than two. \n\nOnce we felt that the server redeemed himself because of how delicious the food was, he took even longer to bring us the check. On top of that, he gave the check to a much larger party, before our two-party table. Throughout the entire dining experience, he was not attentive whatsoever. He didn't even look in our direction. \n\nOverall, the food here is very good and I plan to come again. Hopefully the service is better next time. Joya deserves five stars solely based on the food but I will give it three based on the overall dining experience, poor service included.", "author": "Angela H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "YES YES YES. Always a trip when I'm in there. Massaman curry with tofu extra spicy with some fried calamari as an appetizer is PERFECT every time. Be sure to ask for a side of the sweet chili sauce with the calamari.", "author": "Caymen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-15", "description": "I ordered take-out from here tonight after about a year of living in the neighborhood and hearing good things about it. Usually, I get my Thai in Queens or Manhattan, but I had a craving and with so many places in the neighborhood I figured I'd go for the one I'd heard so much about. My friend and I ordered a few things: \n\n- Thai Summer rolls (usually my favorite): I would pass entirely on these the next time. They were a bit bland, and rather than rice noodles they were filled with chopped shrimp and small cubes of tofu which I found weird. There weren't enough herbs to give them freshness or kick, although the spicy mustard and peanut sauce served with them was good. Also at $3.50 a roll they were very expensive because they were also a lot smaller than the standard summer rolls you get in Thai and Vietnamese places. \n\n- Papaya salad: This was also a bit bland. Although it was a good portion, it needed more contrast in the flavors and more kick. Even the shot or sriracha I added didn't improve it much. \n\n- Spicy Squid salad: The squid (mostly rings) was not rubbery, but was also bland. The squid was steamed or boiled but wasn't allowed to drain properly before marinating because it was wet but not flavorful. I also could have done without the cherry tomatoes, which only accentuated the squid's lack of flavor. The portion was good though, so some herbs, lime and chili would make this much better.\n\n- Chicken Pad Thai: Good flavor; not too oily or too sweet - balanced; chicken flavorful and juicy; but needs more veggies for color and flavor. I would order this again.  \n\n- Shrimp Spicy Noodle: Best dish. This was tasty and had a balanced flavor. There was a good balance of shrimp and veggies and the (wide) noodles were perfectly cooked. Would also order this again.\n\nSo, although I would probably would order from here again, it's not at the top of my list. My inclination is that summer rolls and papaya salad are to Thai restaurants what Greek salad is to a diner: if the restaurant can't do it well, it's a marker of what's to come.", "author": "Sofia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "I've been going to this place for years and it never disappoints.... good service, food, price point.... better than these fad Asian places that make you wait two hours for a seat", "author": "Chi J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "My favorite Thai place to go to. It's in a good area, cheap, cozy and the food is very good, but not excellent as sometimes it's overdone. If you order pad thai, ask for less sprouts or half of the plate will be sprouts. I have no idea why they do it this way but they do. Drinks are $10. The staff might rush you if they are getting too busy so don't be afraid to push back. But usually staff is nice. Still come early. After 7 pm on Friday it is packed. Bring cash, as credit cards are not accepted.", "author": "Andy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-12", "description": "Oh, Joya.\n\nYour service is always sub par.\nYour pad thai is inconsistent, and sometimes tastes like nothing.\nYou are loud, crowded, and often filled with drunk, annoying people.\nYou only accept cash.\n\nI think we should part ways.  \n\nSincerely,\nGabrielle C.", "author": "Gabrielle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "Just finished eating here for the first time. Got the spicy noodles with chicken and a green curry with chicken. Spice level was perfect. Food was delicious, staff was courteous and quick. No complaints at all and I look forward to eating there again soon!! Best Thai food I've had in Cobble Hill.", "author": "Nannaya J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "I come all the way from Jersey for their food. It is divine. My friend Jade brought my boyfriend and I here on a whim. I was irritated that it was cash only. It's 2013, get a merchant account already. Other than that, it's delicious, fast and the staff is nice.", "author": "Niki I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-12", "description": "Well. We had chosen this place to have a baby shower lunch with colleagues, called twice to confirm that there will be 17 people coming, but when we actually came, the 'manager' (an Asian female of small stature with short hair) refused to move tiny tables together so that we could all sit together. Mind you, our tables were set at the very end corner of the restaurant, so that other patrons wouldn't be inconvenienced in any way whatsoever by moving the tables together. The 'manager' actually said this to my face: it is your choice, either sit at two different tables (again, tiny tables moved together) or leave! The owner was not there at the time and the 'manager' refused to contact him in an effort to accommodate our party. We stayed, as we only had limited time for lunch. To our surprise, although the 'manager' flat out refused to sit us together, we were all billed together!!! I used to come here for delicious food and the ambiance of the place but customer service completely killed it for me. I give one star for despicable customer service.", "author": "Gelena A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "I love this place.  Whenever I'm in Brooklyn I try to stop by.  Affordable and good food, I'm always satisfied!  One note is every once in a while when I'm there the food is extremely spicy.  I like it, but I usually order medium just in case- I've had it come out less spicy, or so spicy I had to stop every few bites. \n\nOverall excellent food, atmosphere, and price.", "author": "Allison Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "Always nice in person and fast with delivery.  Yummy sticky rice and mango.  Pad Thai is good.", "author": "sarah h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-29", "description": "The food is just ok, \nI wouldnt go if it's just the food, \nbut I have standard issues.. \nThe service is pleasant, and they seem quite accommodating.\nThe price is pretty good.\nThe atmosphere is also good, easy crowd, so be ready- sometimes you wait- or if it's just 2 of you, just eat at the bar and the drinks come faster: it makes everybody happier..", "author": "Jonas D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "I really like this place..  the food is good... at an amazing deal.. and the atmosphere is totally rad cool! \n\nFirst of all.. I absolutely love Thai food... I ordered the Pad Thai of course.. I mean if you are a Thai restaurant and you can't do that right.. then you need to go to Bangkok and work that out.   The Paid Thai at Joya was on point.. it was tasty, yummy and very fulling.  We also ordered spring rolls (very good, crispy just like I like it!)... calarami (surprisingly good for a Thai restaurant).... chicken satay (a little dry but pretty good with the peanut sauce)... and thai spare ribs (pretty good).   My friend had the Pad See Yue for her entree.. she thought it was pretty good. \n\nThe service was great!  Our server was extremely attentive and such a sweet heart (we def blessed her.. lovely!)  \n\nThe atmosphere was cool.. a young crowd.. overflowing with the new breed of downtown Brooklynites.  \n\nWhat I don't care for is that this place closes too early!  Geez if BK is trying to be the new Manhattan they need to first buy into the whole \"City that never sleeps\" idea.   I was staying at the Marriott in downtown BK for work and a friend and I skipped down to Joya like zombie's craving their deliciousness... only to find they were closed!  I mean seriously.. it was only around 10:45ish.  \n\nFYI - they close at 11pm Mon-Thurs, Sun and midnight any other night.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-17", "description": "Joya WAS definitely one of my favorite places‼ When I have family \u0026 friends visiting from out of town or just a night out with the girls it's one of our top 5 choices. But today Thursday, 4/17/14.... The OWNER.... ATTITUDE \u0026 RACIST‼‼‼‼‼‼We got there (my cousin visiting from out of town \u0026 our friend) the place was über crowded the wait was 45 minutes against my better judgment my cousin wanted to stay she was excited about dining there. We sat at the bar while we waited for a table and had glasses of wine. After a while, My cousin went to ask him how much longer for a table - he stated it was 2 tables ahead of us. (Another woman who asked the same question \u0026 was disgustingly nasty to the owner, he said nothing). We had our drinks- my cousin went to the bathroom \u0026 upon her arrival the owner arrived at the same time \u0026 said to my cousin \"you don't need to give me attitude because I am the owner\" we were all like  utterly confused we didn't know what happened... 1st things first as the owner that's not the way you treat paying customers... My cousin said nothing to him upon her arrival... \u0026 proceeded to talk to us as if we were his servants... I will never under God's green earth EVER go back there‼ and if you are African American and happen to come across a short Caucasian man with short cropped hair, (THE OWNER) if you're African American I wouldn't suggest you go there either.... In this day \u0026 age it's a shame... Thanks but no thanks. If I could give 0 stars I would! Stay away!", "author": "S W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "So good! Their portions are GREAT, the atmosphere is chill and relaxing, it can get a little loud. The waiters are fast and attentive and the kitchen is right there so you can see the hustle and bustle of the process, very cool. Good food, affordable for a casual dinner, works for me!", "author": "Liz P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "Same/Similar owners as Song, in Park Slope. And, thankfully, it is equally awesome.\n\nGreat americanized-thai food, at a very reasonable prices-- $7-8 a meal!\n\nAlso, have been unfailingly accurate with our tiresome menu alterations when ordering delivery. \n\nAll in all, a very bueno option.", "author": "Kathleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "I've been to this place several times. The food is great, the portions are large, and the price is right!", "author": "Sean R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Bartender was awesome!!! Very attentive and a very good Mango Martini!!!\n\nAppetizers were amazing!\n\nMango salad= Fresh mangos, nuts, lettuce, tomatoes. All very good!\nFried tofu= Cripsy with a sweet sauce! Yum Yum!\nShrimp rolls= Very good! A lot of shrimp.\n\nPad Se Ew and Pad thai = Portions are huge!!! Maybe share?\nEverything taste good! Each entree is like 7-9 dollars.\n\nHighly Recommend!!", "author": "Amy s."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}