{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-15", "description": "First time I went, amazed by inexpensive prices, huge portions and delicious thai. I love my satay with peanut sauce and pad thai. The mango martini was terrific.  Three later..I was still enjoying. Upbeat place, but drinks are where they get you. The cash only thing is a little difficult to manage when the drinks run from three to four and you know how that goes.\n\nWent back another time and main dish was ridiculously salty and lost any flavor of the food. Incosistency really ticks me off. Never went back.i'd prob. go back for some of those drinks.\n I rather eat at Lemongrass Grill which is simple, but I find the food consistently flavorful (without overdoing one ingredient) for a chain. Go Figure.", "author": "Stacey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-23", "description": "yup...still delicious!!!\nhungry Cleo love Joya!!!", "author": "Cleo J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "i don't know why everyone is talking about how \"trendy\" this establishment is...it's just dimly lit. \ni saw people from all walks of life when i stopped in there to inhale a quick chicken pad thai before seeing a movie. \nwe had to wait for about 10 minutes for a party of two so we grabbed a drink at the bar, which you have to pay for before you sit down-they won't add it to your bill. and everything is in cash, which is a slight inconvenience. \nthe food is damned tasty though. typically low lighting lends itself to make me further investigate what is in my meal because i trust no one ( a la x-files ) with my food, but everything seemed to check out. i had a simple chicken pad thai and it came out in about 5 minutes. we made our movie and i was full.\nsimple, fast, tasty, cheap. out bill was $15 without the drinks at the bar! what?!", "author": "Alice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Great place! went to Joya  4 or 5 times food was great every time .. soft Shell Crab which was on special was amazing. The place almost always has a wait which isn't too bad considering they have a nice bar.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-12", "description": "This place would get no stars if I Know how to do it.  Granted the food is cheap, and the ambience is hip.  The music is loud, deafening in fact.  If you look, the quality of veggies that they use for example are crap. The first time I went, the green peppers in the dish were old and half rotten.  I vowed never to go back agian, but of course I did, the carrots this time aside form the fact that they werent cooked enough, were not even peeled before they were used.    You cant mask everything with dim lighting and sauces ( well at least not for me, my dad owned a restaurant and was a chef).  Where I can give credit is that some of thier apps were ok.  But seriously, it sucks for other thai restaurants in the neighboorhood that are much better, but just don't get as much clientele.", "author": "M F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-29", "description": "Everything about this place is right; food quality, decor experience, and customer service was amazing.  The price is a bargain, the only problem is they only accept cash but something can overlook for the savings.  Their specialty drinks are amazing and ambiance music is upbeat and relaxing.", "author": "Augustin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-13", "description": "The quality of food is not as good as Lemongrass up the street, but the prices and atmosphere make up for it.  After observing the uber-hip atmosphere, I was scared to see the prices, but damn if they weren't absurdly low (it's an expensive neighborhood).  The food's good in the 'far-better-than-anything-I-could-have-made-at-home' sense, but not in the 'you-HAVE-to-try-this\" sense.  All in all, a great way to enjoy an affordable night out to eat.", "author": "Niles S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-09", "description": "I don't agree with Reba G. - well, ever - but, I mean, she's totally right about Joya. Until last week, I'd only tried the spring rolls as an appetizer (and yes, the sauce is totally drinkable), but turns out, the calamari is pretty perfect too. The spicy noodles with shrimp is incredible, and whenever I'm in a bad mood, the chicken pad thai is the perfect comfort food. And for only $7-$8?! Thai food heaven. Try to sit outside (it's quieter, and actually really nice), order a glass of wine (or one of their notoriously strong mixed drinks), and be prepared to forsake all other Thai restaurants from here on out.", "author": "Lesel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-25", "description": "The best thai I have had yet! I live right next to Joya and have eaten thai food all over the world and have yet to find a more flavorful place than this. I first tried the pad see yue and was not that impressed so I didn't come back for a few years. I gave it another try and had the pad thai this time and have been coming back for years ever since. The difference between their pad thai and all others I have had is the flavorful abundant sauce. All other pad thai seems flavorless and dry now. I also highly recommend the veggie pad thai, veggie spring rolls and a thai iced tea! They also have great curry and a nice selection of beers on draft.", "author": "Jill H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-04", "description": "This place is great.!!!  I went on Saturday night and they had live music.  It was a dj and the music was good for the restaurant (not too loud or weird). They told us we had a 45 minute wait but it ended up being 30 instead.  The host was really nice.  We got to sit outside on the patio which was good because it was cool out.  For dinner my friend and I started with the chicken spring rolls which were really good.  Then I had the green curry chicken while she had the red curry.  Both were awesome!  The house chardonnay was a very generous pour and not tasting either.  The prices were unbeatable but it is CASH only!  I will absolutely go back to this place when I'm in this area of Brooklyn.  If you are going to go I would go early and but my name on the list then wait at the bar.", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Came on a Sat night and waited about 30 minutes to be seated... the space is a lot larger then I expected.  Got a table in the back overlooking the open kitchen which is pretty cool.  I was pretty impressed watching the kitchen (2 guys basically) keep up with the fast pace of this place.  The food was spot on... really good Thai curries.  Awesome prices - cheapest meal in the area.  I don't think they take credit cards.", "author": "Dani N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-02", "description": "The food is rushed, and poorly flavored. The vegetables in all of our dishes were undercooked. The Tom Kha Gai (coconut soup) was heavy on salt, watery, and light on coconut flavor. It tasted like a brine, or a miso soup.The Pad See Ew tasted like greasy chow fun at a dollar Chinese restaurant. The red curry chicken with eggplant was thrown together so quickly that the curry flavor didn't get into the meat of vegetables, and it was watery. All of these dishes should be center pieces for the menu. What a disappointment. I've been to tons of Thai places on the west coast, and all but one in a food court were better than this.\n\nService was almost nonexistent, on a Wednesday night. The atmosphere that people are raving about is just a bunch of people yelling at each other over a tacky mix of music. At least the lighting is subdued.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-10", "description": "Great go-to, fun Friday nite place. I've been coming here for over 2 years, probably once every other month and the food is always consistently yummy, hot and fresh. The waitstaff and hosts are always accommodating and squeeze us in whenever possible. Being regulars definitely has it's perks. Pad see-yu and pad Thai are great and the calamari is crispy and delicious. Great neighborhood spot, every time I'm here I have a great experience. Don't get mad at them when you have to wait; they're obviously popular for a reason!", "author": "Alana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "I live around the corner from this place, but hadn't tried it until tonight. Why hadn't I gone before?!  Absolutely delicious, and I paid so much less than I would have expected to. Not to mention that there was this duck/mango fresh roll special that was quite possibly one of the most refreshing things involving duck that I have ever eaten.  Also, the beef + bok choi pad thai was superb. I will come back again, and again, and again.", "author": "Stephanie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-15", "description": "Good food, full bar, decent music. I had the glass noodles with shrimp and veggies... tasted yummy, i'll go again for sure. Its a little loud, so its not great for a first date or you are a talker. Unless you are a loud talker. My voice is little so I just got drunk and stuffed my face. Great place to hang with friends. We waited about an hour for a table though, that kinda stinks.", "author": "Miriam D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-02", "description": "I don't get what people see in this place.  Very average Thai food, hot and loud.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-29", "description": "5 stars for takeout, while perhaps 4 for eat in due to the wait and the unbearable noise. The food isn't authentic Thai, but it beats any of the other Thai spots in the neighborhood, and it's cheap to boot.", "author": "Jeffrey P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-07", "description": "Mostly delicious, but often inconsistent.  Concrete floor amplifies noise.  Nice backyard, polite servers.  Host often indifferent, sometimes rude.  Great prices, always crowded.", "author": "Brooklyn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "Judging by the huge variety and crowd of people who pack into this place on a nightly basis, I'm not the only one who's impressed by Joya.\n\nThis place is a neighborhood treasure. When you get home and you're tired, there's nothing like being able to order up a heaping serving of scrumptious Thai food for $6-8 that will easily last for two meals.\n\nIt's also a neighborhood hotspot: the inside can be a little chaotic, depending on the night--sometimes just to move past the bar to the kiosque to be seated can turn into a 5-minute affair--but, on the upside, it feels stylish, modern, and clean. The back terrace is lovely.\n\n For takeout, it also cannot be beat. They're efficient, friendly, and accurate with your orders. Also: curries and such come with white rice included (in a separate container) which in my experience is a rarity.\n\nHooray for Joya!", "author": "Max H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-30", "description": "This is an awesome place for Thai food in a wonderful ambiance. I love the big outdoor garden seating and I love going for lunch when it's not jam packed. There is a large bar which comes in handy when you have to wait so long for a table. I love their soups!", "author": "Sara W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}