{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "My go-to for Americanized Thai in a neighborhood with many options for such. Curries are consistently good, and the red and green curries have become somewhat of a comfort food for nights when I don't want to cook. Cash only and often a wait on busy nights.", "author": "Molly O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-25", "description": "one of my FAVORITES in the neighborhood... I've been going for 6 years.  The prices are great (though the last time i was there it seemed they were a little higher.) Bottles of wine are pretty cheap.  I take all my out of town visitors here and they love it.\n\nMango salad is the best- its rarely on the menu, but they always have it....", "author": "Jill Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Excellent place to stop and eat. I recommend the chicken pad Thai, had never had it till today and I'm already looking forward to the next visit here.", "author": "Carlos R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-02", "description": "how disappointing. i used to love this place. i was even here last month n the meal i took to go was great. today's meal was terrible. i had mussels in green curry (daily special) n shrimp massaman. our proteins were over cooked, rubbery, shrunken. our vegetables (in particular carrots) were old, hard, n bitter. finally, our rice was raw. my bowl was semi cooked, but edible (finding raw chunks every other spoonful). but other two bowls were completely raw. finally, we just asked for some noodles. our waiter was a little pushy n seemed annoyed with us for asking questions. this experience was just unpleasant. it will be a while until i return.", "author": "Miya A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "This is my go to neighborhood thai restaurant. The pad Thai is solid, but the thing that's really good is the mango chicken appetizer. They give you half a rotisserie chicken with a little mango salad and it's delicious. It's also super cheap.", "author": "Ethan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-30", "description": "BEST THAI FOOD IN COBBLE HILL, hands down!!!  the reputation speaks for itself....this place is PACKED 7 days a week for good reason...and that reason is.........GREAT FOOD FOR CHEAP PRICES!!!!\n\nthey can do the cash only business model because is is THAT GOOD and they don't have to succubi to the credit card business model that most restaurants have to resort to because they want to stay in business...joya's genourous food and drink menu speaks for itselft and regardless of the \"ratings\" they get food review sites like yelp, they will be in business for a long, long time due to their excellent food and very low food/drink prices.  Hands down, best deal on court st....try to find a better deal in terms of quality and value....I DARE YOU!!!  i've lived a block away for over 5 years and have tried all the local foodie establishments....nothing compares....joya is the shittteee and will always be a pillar of the neighborhood.  in terms or price and quality of food, nothing compares...thai sesame, EM (which is a long was away), thai chili, and lemon grass grill can't hold a candle to joya....this place is, and will forvere be, a staple of the cobble hill thai-food foodie community....everyone who lives here know this FACT and and that's why it's ALWAYS packed everyday day of the week.....FACT!!!", "author": "Eric H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Food is affordable and sooo good I love Thai food and had the spicy noodles which is drunken noodles delicious. They could improve in their drink selections I really wanted a lychee martini . the atmosphere was nice for girls night out or a cute date night. The spring rolls were good but greasy", "author": "Coleen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "Joya is a nice reliable Thai option. They have a pretty cool outdoor area, the food is reasonably priced, has inexpensive wine bottle options, food taste great and has a good overall ambience. I've been here many times, tried many dishes and have never been disappointed. Just one question Joya, why no credit card acceptance? - that's the only downfall I can say about this place. Tonight I was served the wrong dish by mistake. This was quickly fixed and the waiter even offered to wrap up the wrong dish hat I wasn't charged for, so that I could take it home. I opted not to, but thought that was pretty nice. Great place. Go for it! Good for dates or dinner with friends, what more can you ask for?", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "Delicious spicy flat noodles. Very friendly staff. Ice cold Brooklyn Lager. Simply yummie. A Cobble Hill staple for a reason!", "author": "Antony V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Good Thai food. Been going there for about 4 years now. And they haven't added really anything new to the menu. I always wished they would add new Dishes to their menu. But all in all. They have some good damn Thai food. The scenery is very beautiful and a very new age atmosphere. Good spot to take a date also.", "author": "Kaydon T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "I was craving fried rice on night and decided to stop by Joya for take-out. I've eaten at Song and National so I knew what to expect food-wise. The setting is very similar to Song. Since I was ordering take-out I didn't interact much with the staff, but they weren't very friendly--the hostess seemed very huffy. Anyway, my food was great and I enjoyed it in the comfort of my own home. I would probably go to Song or National before coming here again to eat in.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-21", "description": "Been here plenty of times over last 8 years. Used to be one of my favs and go to spot with friends, but last few times seems to be going down hill. They still have one of the best fried calamari which I get almost every time I go. Pad Thai wasn't too good this last time, didn't enjoy it much. I'll still go because it's walking distance from my house and hope that they recapture some of their past glory, just not as often as in the past.", "author": "Shawn H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-25", "description": "Order for pick up. Havent been to Joya since they first opened maybe 10 yrs? ago. May request that the dishes have some more spice if we find ourselves there again. In general, underwhelmed.", "author": "Malcha R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-12", "description": "Big portions, but the curry left my friend sick, and my pat see ewe was too...bland/seemed too filled with liquid.  I tried pouring hot sauce on top, but it didn't help.\n\nMy friends had the beef \u0026 broccoli, chicken fried rice, and spicy noodles and all felt that the food was mediocre.  We sat in front of the cooks, so we could feel the fire every minute or so.\n\nCash only.", "author": "Lili K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-13", "description": "12/30/2008 \n\nI love the decor of this resturant. They sometimes have a DJ playing cool music; the drinks are really good too. This place kind of got over populated so it is hard to just walk in on an evening and get a table. My favorite dish is the Pak Kraitum veggie dish.. I will order it over and over and over", "author": "James V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "The best American Thai in my book. Whenever I eat elsewhere in the city, I long for Joya. It's a fantastic and fun place to go out on a Tuesday or a Friday and great for take out (cash only!) Sometimes has a bit of a wait, but usually they are pretty fast and accommodating. It's always consistent and reliable and I've brought many out of town friends here who still talk about it whenever they think of visiting. A heaping plate of fresh and light pad thai, not over-gunked in peanut sauce, but rather heaping with veggies and supplemented with a wedge of lemon rings in at around $9. I will say once I ordered the half chicken to-go and when I opened it at home it was uncooked. Gross. But it still gets 4 stars for the other countless times it has rocked my world (maybe steer clear of the half chicken, though.) The guy who runs this place is also awesome and he gets kudos as well.", "author": "Zoe T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-14", "description": "Mouse in the house!  My wife and I went there for dinner this evening.  We sat in the back corner next to the corner table against the wall.  A couple sat next to us...it looked like their first date.  All of the sudden the guy just got up on the back lounge chair and stood on top of the lounge chair.  His dated looked at him like he had two heads.  He didn't say a word....he just looked all around the floor like aliens was going to attack him.  Everyone was staring but he didn't say a word.  He finally came back down to earth and softly said....I saw a mouse run over my shoe.  \n\nYikes!  All the patrons around him freaked out....I must admit I was laughing at his dates reaction.  She rolled her eyes and said I thought your shoes were on fire or something.  Needless to say I don't think he made a good impression with her....lol.\nNot cool when your date stands on top of the chair looking like a fraidy cat.  lol..... \n\nNow....back to the rodent.  I'm actually calm knowing that this is a problem with many NYC restaurant kitchens.  What was NOT cool was when the Matre'D came over and said well.....sometimes mice comes in, we can't help it.  Basically there was no urgency in his voice, it was biz as usual.  Also none of the waiters seemed fazed.  The couple relocated to another table but that lack of urgency is solving the problem leads me to suspect that there are lots of mice.....and they see it often.\n\nIn terms of the food, I've been to this restaurant more than several times.  The food is great but they simply use too much salt.  Each time we ask for low salt, it seems like they put even more salt.\n\nI'll think we'll take a pass for a little while until they clear up the rodent problem.  I hope Management will take the problem seriously.", "author": "Todd S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "This was my second trip to Joya; the first being around 3 years ago.\n\nFirst off the Appetizers. We ordered a Mango Salad that was fantastic; in fact, after finishing it, I'd wished I'd just ordered one for my main course.\n\nInstead, I went with my old school standby, and ordered the Pad See Ew (long wide, and thick rice noodles...imagine Pad Thai moving to America). In this case, it did not disappoint. The noodles were a perfect texture, and cooked properly (if perhaps served a little hot), and the wait staff was great.\n\nMy only real complaints?\n\n1) Like a lot of restaurants in the area, they only take cash.\n\n2) Unlike a lot of restaurants, there is virtually ZERO separation between the restrooms and the main dining area. While I usually don't take this fact into account, I'd had a reasonably rough night drinking, and couldn't pass off the sounds or smells to someone else as I ducked into relieve myself halfway through the meal.", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "Great restaurant! Reliable and always fast service (except Saturday nights when the weather is nice... the wait can be an hour). Food is quality. I always order the Pad Thai or combination fried rice. Ambiance is great as well for family occasions or birthdays.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "Whether for lunch or dinner, Joya is an awesome place to eat. I am a fan! The restaurant is clean, the service is quick and the wait staff are very friendly. \n\nHowever Joya can get a little loud and packed so be warned!", "author": "Neria S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}