{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "I eat their red curry at least 3 times a week! It's not because I visit the restaurant that often, but because the portions are so huge that I can make it last for at least that many meals, and it tastes so good that I never get sick of it. \n\nUsually, I just do take out and the staff are super friendly and efficient. The one time I actually ate in the restaurant, they were quite attentive and maintained the friendliness quotient.  All in all a solid, ultra-affordable, neighborhood Thai place.", "author": "Anjuli L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "I don't know why but I LOVE THIS PLACE. The food is great and reasonably priced. I love the chicken penang curry and the soups. The service is good as well and you get to enjoy your time without worrying about getting bad food.", "author": "Kan. J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-12", "description": "Alright, alright, so I used to think that I really loved JOYA and that they had great food for real cheap, but I went back last night and the food just wasn't as good as I remembered. Their green papaya salad was so weird, it was all sweet instead of spicy.  We also got some appetizer with duck in it and it seemed to be just a large chunk of duck fat with no actual meat (ew).  To top it off, I found a peice of glass in my curry on about the last bite (hope I didn't swallow any) but they did take off the price of my meal from the check.  \n\nThat being said, I'd go back to Joya because it's just so darn good for being so cheap.  I guess just stick to tried-and-true choices like pad-thai, spicy fried rice, etc.", "author": "cory b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-13", "description": "This place delivers when they feel like it. They deliver to our building everyday and I called on a Friday night to place an order and the lady told me too far for delivery. When I told her that they deliver here all the time she hung up on me. When I called back she didn't answer the phone. Never again will I order. Well not like they'd delivery anyway. The food isn't that good.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-13", "description": "I am always astonished when my meal at Joya (or their sister restaurant, Song) is over, and blissfully full of delish Thai goodness, I find how absurdly inexpensive the whole thing was. Only downside is that this place is consistently packed... like, even on a Tuesday night at 5 pm, but with good reason.", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-06", "description": "We ordered the small  fried calamari and when she came back it was with a huge plate the portions are great. We also ordered the skirt steak with broccoli and it was the best steak i have ever eaten. The prices are not what you would expect to pay at such a trendy upscale place. My plates averaged like 6 or 7 dollars. Excellent food.", "author": "Dolores M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "This is one of my favorite restaurants in this neighborhood. The food is amazing and the restaurant has a really nice ambiance. The one downside is that they don't take reservations so I almost always end up waiting. Other than that, awesome Thai food at really great prices!", "author": "Molly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "DO NOT GET TAKEOUT, GET DELIVERY! IF YOU GET TAKEOUT THEY WILL FORGET YOU, GUARANTEED, EVEN IF YOU ARE STANDING RIGHT THERE. THEY WILL SET YOUR STUFF DOWN RIGHT NEXT TO YOU THEN STAND AROUND TILL YOU ASK THEM \"UM, EXCUSE ME, IS THAT MY STUFF?\"!!!!!!!\n\nOkay, now that's out of the way (sorry, it happened exactly the same way twice)! Get delivery, they are mad fast and it's just as good as eating there, particularly as it's kinda stuffy inside. CHEAP! GOOOD! That is what you will think while you are shoveling the massive tupperware of curry with tons of chicken and the equally sized sticky rice into your suddenly voracious craw.\n\nSkip the appetizers, they're all honestly a bit greasygross and the curry is gonna be enough food to put down a horse. And it's like $7.50. Wow.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-16", "description": "Packed on a Thursday happy hour.  Trendy, loud, and very dim on the lighting.  Narrow yet gets a little more spacious toward the back.  Suggest to be seated in the back so that you can avoid the line formation from those busy staring-at-you crowd.  If you do wait, there is a bar.  The price is hard to beat, no wonder for the wait.  You can get full for $10/ person.  You can get stuffed for more than $10.\n\nDishing it out:\n\nFried Chicken Spring rolls 2.95: rolled with noodles, vegetables on a light wrap.  I was expecting a bigger crunch.  \n\n\nSom Tom Green Papaya Salad 3.95: shredded pickled papaya on a bed of romaine with cherry tomatoes.  It was not a matrimony.  The combo of coarsely chopped romaine and thinly julienne papaya were very oddly paired.  The dish lost its luster with the western romaine.  \n\nPad Thai 6.95:  The sprouts were set aside, so that you can mix it into the noodles, with a refreshing crunch.  Tasty, well executed.  \n\nWoon Sen 6.95:  Ordered with shrimp, and overcooked. In fact the whole dish was overcooked.  The glass noodles lost its gloss as it did not hold its form.  Al dente does not exist in Asian noodles but this was indeed cooked to death.  Poorly executed, as it was too much on the salt.\n\nIf I was to return it is because Joya offers a generous portion that fits the bill.  I would usually order two Thai Ice Teas but Joya got it right, I was content by ordering one Thai Tea.  This is truly the highlight, on my part.\n\nCome to Joya, on a tight budget and bring some of your buddies.  You would be thrilled that the tab won't hurt.  Just remember to bring the cash.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-14", "description": "tea too sweet\nfood too salty\nhot water too expensive ($3 for a glass)\nyou could go try yourself\nbut I suggest you save your money", "author": "Haruki F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-14", "description": "Great if you can get in.  The prices are great and the food very tasty and you get a lot of it.  It gets loud, but everyone is always having a great time.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "great vibe\ngreat spicy noodles with shrimp\ncrazy good mohitos.... thumbs up\n\n\nvery busy -good thing my cuz knew the host...", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-18", "description": "Sadly Joya has gone way downhill in recent days. Just ordered take out and had a terrible experience. Ordered, waited ten minutes and walked over to pick up my food. They told me it wasn't ready. So I sat at the bar for ten more minutes waiting before the hostess finally realized my food had been sitting there the whole time and gave it to me. Right, ok. Got home to find that the shrimp in my tiger shrimp rolls were NOT CLEANED. Do you know what is in there? You cannot serve people unclean shrimp! That's disgusting. If I lived closer to the restaurant I would have gone to get my money back. Also, the masaman was WAY too sweet. So just fail all around. I probably won't go back. The food there used to be so delicious. What happened, Joya?", "author": "Laurie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "Awesome Thai restaurant! They food is so good and the pricing is amazing. Cool feel in the restaurant, feels like a lounge. Wish they accepted credit cards.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "This place is fantastic.  I really don't understand how you could rate it any lower than 5 stars.  The food is INCREDIBLE and very inexpensive ($6.50-9.00 for entrees).  The atmosphere is really unpretentious and very inviting, with a nice bar, an open seating area, and a rear outdoor patio (like many Brooklyn establishments).  The bartenders are so damn friendly, they always end up buying me a beer when I sit down for dinner.  \n\nThis is easily my favorite restaurant in Cobble Hill, and is currently my favorite Thai place in New York.  That says a lot, considering how affordable it is.  If this place were in Manhattan, it'd be twice as expensive.  If it were in the Village, it'd be three times the cost.  But then again, that would spoil it.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "This is one of my favorite Thai spots in BK.  Once you are seated they serve the food pretty fast!  I love the chicken curry puffs and the chicken curry Penang dish!  We tried the pad Thai today and it was prob the worst I've had.  It was wayyyy to sweet!  I had to keep drinking water after each bite.  Also they need to do something about the front door!  It's so cold inside if you are seated close to the front.  We had to eat with our coats on and ordered tea to keep us warm when it was 14 degrees out!  Next time I will do take out! The cheap prices will keep me coming back though!", "author": "Nia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "not a fan of dinning in due to the noise level, usually take out\ngood food, great price", "author": "H S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "Never a let down. Whether you want a $4 beer in a cool space, or the most killer spicy noodles ever made for under $8, you came to the right place. I try to vary my order from time to time, and I have succeeded a few times, but I keep coming back to a few favorites. Spicy noodles with chicken, Panang or red curry, Tom kha.... all amazing. Not to mention, bottles of wine hover around $20. I never leave Joya paying more than $20 for an awesome and filling meal plus a few glasses of wine. Great deal, great spot.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "oh joya joya joya... brings me great joy!  i've been here for dinner on several occasions and one time for lunch.  every time i come here i think it's such a great deal, and then the prices for lunch just blew me away... essentially you get the same size as the dinner entree plus a freebie appetizer and the choices ain't skimpy.  i chose the mango salad for my app which was a hefty size.  i end up almost always getting the pat see ew because I'm addicted to those chewy noodles... something about the balance of their hot temperature and their retention of an inherent chewiness is just so gooood!", "author": "Cherie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-19", "description": "Went to Joya last night based on rave reviews from a friend. My boyfriend and I were really disappointed. The chicken satay are mediocre at best and so was the peanut sauce. I ordered the Gai Kratiam. I thought my elderly grandmother had cooked up a pot of vegetable and chicken in some chicken broth and sat the bowl in front of me with some rice on the side. My boyfriend ordered the spicy pork and pineapple fried rice. The brought him spicy seafood fried rice. He started to eat it, but didn't like the taste. He then picked up a shrimp and that's when I picked up the candle to take a closer look at his plate. \n\nOMG!! He is allergic to shrimp. We called over the waitress, who continued to apologize the rest of the night. She brought him the correct dish, but the taste was still not that great. \n\nI will not be returning to Joya. I will continue to go to Sea. \n\nThey only charged us for drinks and 1 entree.", "author": "Jewel W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}