{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "Joya is on the way from the F train stop on Bergen to my boyfriend's digs on Warren Street, strategically placed about 100 paces from the front door. We've been known to leave concerts on the Upper West Side early, drunk dial the Joy(a) and salivate on the train all the way to pick up our food. We've also been known to fiercely defend our menu favorites and try to persuade the other into agreeing that our dish is the best (no mine is!). I'm firmly in the Yellow Curry/Spicy Noodles camp and though he agrees with me about the Spicy Noodles, he's a fan of the Red Curries and most of the other noodle dishes. \nThe prices are amazing (you can feed the both of us for under $20), and the staff is cheerful and helpful. If you aren't taking it to go, make it an early bird special, especially on the weekends (including Sundays) because the wait can stretch to over an hour.", "author": "Bryce L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "Awesome food, lively atmosphere, good service. A satisfying meal guaranteed.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-11", "description": "Good atmosphere (no DJ when I went).\nHip decor.\nFriendly owner.\nDece prices.\nReally delicious food. The duck and mango spring roll appetizer special was mind-blowing, and my pad thai was one of the better ones I've had. My friend asked for his fried rice spicy, and he was more than satisfied!\nAll in all, I couldn't tell you specifically why I'm leaving a star off. I had a good time but don't  know if it will become one of my regular places.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "This place is awesome! Great food, awesome prices, and reasonable wait time. I crave Joya on a regular basis.", "author": "Angela D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "Literally every single bite of whatever you order at Joya is full of scrumptious deliciousness. I do not lie. Portions are huge, and though they only accept cash, the prices are extremely affordable at under $10 for most meals.", "author": "Shakti H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-12", "description": "This place has decent thai food but  do not expect to get served or have your correct order.  I went with my boyfriend on a Friday night.  We spent 45 minutes waiting for a table, after being seated another 30 minutes before we actually got food.  After all that our entire orders were completely wrong.  My boyfriend ordered pork, got chicken.  I am a vegetarian so I ordered vegetables, got chicken as well.  The waiter was totally unhelpful; when we tried to explain to him that our orders were wrong, he acted like he suddenly didn't understand English.  Needless to say, my bf refuses to go back to this place, and I don't blame him.  The only reason I am not giving this restaurant 1 star is because the food is halfway decent when prepared correctly.", "author": "Irina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "Is you are looking for tasty and cheap thai food, this is the place. Lunch was busy, but is worth the wait when u leave satisfied. Best of all paying less than $30 for 3 plates even better.", "author": "Yuki O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-02", "description": "I went and jumped for Joya with a few friends last week. I'm pretty sure it's owned by the same people as song in park slope, or it's a chain, but regardless it's exactly the same. The decor, menu, prices, everything. \nThat being said, this location seems to not be as busy and I think there is more seating here too. The food is really good, especially the pad Thai and spicy noodles, but the beef satay appetizer was eehh. Overcooked and the sauce was too thick and sweet. Overall though it's a nice place and it's cheap and you are getting good food with large portions. They also have a decent wine list and a specials menu.", "author": "Heather C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "Great place, a bit noisy but that is fine. Good cheap food. Service was great quick and very satisfied.", "author": "Trae L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-17", "description": "I was visiting my best friend in Brooklyn, and we wanted to get something cheap and tasty.  Joya was his solution and I was DAMN glad he suggested it.  \n\nWe went on a Thursday evening and it was definitely crowded.  We had to wait about 30 minutes for a table, but we decided to get ourselves a drink to tide us over.  The bartender (Billy, I think?) was awesome.  Drinks were tasty (and strong) and I discovered there was a chip in my glass, at which point he made me another whole drink even though I just asked for another glass to put it in.  Then he overheard my friend talking about how much she was looking forward to a thai iced tea and he proceeded to make her an alcoholic version, on the house!\n\nI'm not gonna lie - by the time I got to the dinner table, I was a little bit buzzed, and I was ready for some food.  Pad thai for $6.95???!?!?!?  Really?!?!?  Of course, I then had doubts about the quality of the food, but I was pleasantly surprised by how good the food was.  It also came out super quickly, which my semi-inebriated state was happy about.  \n\nAfter dinner, we went back to the bar to have one more drink with Billy, who proceeded to give us dessert on the house (it was my friend's bday just a couple days before) and some more tasty beverages.  They definitely helped keep us warm on the walk back, that's for sure.  \n\nOne star off because we tried to order takeout from them on Sunday night and had to call back 7 times because the line was busy every damn time.  Also, it is a tiny space, so it wasn't necessarily comfortable while we were waiting for our table, but they definitely made it worth the wait!", "author": "erica s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "Joya is one of our favorite neighborhood spots. Everything I've had here (calamari, spring rolls, whole bass, tom ka gai, pad thai, spicy noodles) has been excellent. The only drawback is the wait.....the area where you wait is pretty small and often packed, which results in people spilling into the dining room, standing awkwardly next to your table while you eat. But I haven't found better Thai in Cobble Hill for the price. The patio is pretty nice too. Don't miss the spring rolls!", "author": "Danielle P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-06", "description": "I really wanted to like Joya.  Friends of mine consider it their #1 favorite restaurant in the city, and judging by the crowds, a lot of people would lean that \n\nWe went last night, and while the food tasted good (we ate the spicy seafood fried rice and the shrimp spicy noodles), we both spent the rest of the night in considerable stomach pain, making lots of trips to the toilet.  Maybe it was the high level of grease in the food, or maybe it just wasn't all that clean?  Either way, two people with fairly strong stomachs still don't feel very good 24 hours later.\n\nThe mixed drinks at the bar are strong pours, so that's good, at least.", "author": "Chris F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-12", "description": "Serviceable \u0026 cheap Thai fare - much like most Thai in NY, aside from the bomb spots out in Queens. The grub's not too authentic, and not really that spicy or popping with flavors, but it's still decent quality and totally edible. That sounds like much more of a dubious compliment than I intend it to, but I'm leaving it anyways. HAHAHAHA. They do often have interesting special dishes, but the trouble is they usually sound better than they look and often don't feel very Thai. I had a skirt steak last time that was really just a skirt steak with some oyster sauce. Mehhhhh. I could spill some brown bottled yummies on a piece of meat just as easily. \n\nThe scene is pretty cool. They've got your standard gamut of mango flavored martinis and such, and you've generally got a hip looking crowd arouns the bar, or at least, Brooklynites with kids who purport hipness with their sartorial selections and hire babysitters so they can mingle with buddies who do the same. Either way they draw a nice looking crowd of folks and have a DJ playing tunes; said tunes are generally played at such a volume as to prohibit conversation. Don't go on a date with a low talker here. I did and I must've said \"what\" while touching my ear about 17 times. That basically sucked. I hope that when I DJ'd regularly I never had such an unknowingly malicious effect on some dude's opinion of some poor young lady. \n\nThanks a lot Joya!\n\nJ/K this place is fun and cool. But that story is true all the same.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-26", "description": "Best Thai in city. Great prices. Only wish they would take reservations because it gets packed.", "author": "Evan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "Came here for dinner on a Saturday night with friends and it was packed. It was a little uncomfortable waiting in the entry as there was only a small waiting area and no room at the bar to sit. The food is very reasonably priced. I would recommend the green papaya salad and calamari.  Both were excellent. I tried the beef pad see ew and beef red curry with eggplant and peppers. The pad see ew was great but the red curry was plain and the beef a bit chewy.  Everything worked well for this place and I'll most likely be returning soon.", "author": "Jared L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "My cousin is always talking about this place and now I see why. They took my friend and I here for dinner while I was visiting in New York and this place is perfect. Being from California I am no stranger to Thai food so I know what I am telling you when I say the food was perfect. The most amazing thing about this place are the prices. Everything was priced so low. This same meal in CA would cost me twice the price at half the portion. The ambiance of this place is also perfect. We ate out on the back patio and it really was a perfect night.", "author": "George M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "Dined here for the first time this past Sunday (2/17/08).  The food is not top end, but it is far better than average given the cost to dine.\n\nDid get very crowded very quickly, so expect to wait at least 20 minutes for a table.", "author": "Pablo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "The Thai food here is pretty good for the cheap price.  I've eaten and enjoyed the chicken seeweau (sp?) and the calamari (always fresh).  The mango martinis are pretty tasty as well!  I think the restaurant has an awesome vibe more so than its sister restaurant Song in park slope, however the food and drinks are still tasty.  I've actually turned several people onto this restaurant and they all keep coming back. \n\n\nI have no compliants about this restaurant however you can always expect there to be a wait no matter what day of the week you go.", "author": "Erika G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-02", "description": "Stopped by last night for dinner.  I can't really say anythng negative about this place.  Also a good crowd, good food (not the best Thai in NYC, but very solid), nice atmosphere (we had a 25 minute wait at 7:45p on a Weds to sit outside) and the prices are very affordable for the portions given.\n\nI live in Woodside and still find it is worth the trek there at least several times a year.", "author": "amit k."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "Racist:  I was so disappointed. I heard some good reviews and was very hungry. That is, until the host (who I've been told us the owner and manager) had a 15 minute conversation with a friend while I waited to be seated. I told the lady at the register that I wanted to be seated and she told me that I had to continue to wait for the unresponsive host. Only after a line started to form (maybe bc there were now white people waiting) did he see if I wanted to be seated. I tried to have a conversation with him but he seemed drunk! I am African American, and feel as though he didn't care to seat us bc of that. Maybe it wasn't about race as I saw some customers walk out without paying because they were waiting so long. Maybe everybody there is inattentive. The lady at the register seemed to agree with him as she didn't even ask him to attend to us. Never again. As a show of support for equality or good service, please choose another place to eat.", "author": "Chester A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}