{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "Never disappoints. I've been eating here for over two years, my bf probably since the restaurant first opened. Like most typical Asian restaurants, table turnover is quick and although they don't kick you out during \"rush hour\" they are quick to provide a check hinting that you should leave soon. \n\nThe food here is awesome. My standard Thai food staple. The owner is a really nice guy and he even offered one of our meals for free one time because they had mistaken our order. We typically go with the standard pad thai, chicken fried rice and the massamam curry (absolute favorite). On occasion, we love the mango papaya salad when it is in season and the calamari is great too. \n\nI'm a big advocate for eating authentic food cooked by people of their origin and I can attest that they are thai chefs as well as thai wait staff working here. Will be back in several weeks!", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "I'm a big fan of Joya. Really cute exterior and interior that is casual enough but feels like you're going to a nice place. Prices are great and I think the food is accurate to what you expect for American \"Authentic Thai\" food. Some dishes I've tried have been a little on the saltier side but that's subjective. \n\nI've never had to wait to be seated but I live in walking distance so I may have gone at odd hours. Everyone I've gone here with has liked it.", "author": "Madison K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "Good thai food but a bit far away in brooklyn ngl", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "This was a wonderful, reasonable Thai place with good service and quality food.\n\nWe had a special of roast duck with red curry, which featured some scrumptious and moist duck that was good but not life changing. The noodles and vegetables were also great.\n\nThe pad see ew was really great though. The chicken that came with it was nothing to write home about but the noodles and bok choy were amazing and really made my evening. \n\nThe service was very prompt and this place worked great for a quick dinner before going to an event at Bookcourt down the street", "author": "William W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-30", "description": "I was here last night for an anniversary dinner with my boy. I don't have too much to say that is different from what other positive reviews reflect, except that I wasn't expecting it to be so packed on a Monday night! I would definitely recommend making reservations, we ended up waiting nearly half an hour for a table.\nThe decor was minimal, and the lighting wad really cute. I liked the ambiance though the music generally what I'd go for. A lot of classic 80s songs. I will admit that \"Your Love\" is a guilty pleasure of mine though, so it wasn't all bad.\nLeaning vegetarian, I got the Pak Pad Thai, which I got with tofu at no extra cost, and my husband got the Tofu Pad See Yue. We were both happy with our food, generous portions and great prices, though the chunks of tofu were kind of big and spongy. Not really bad, but if they were smaller pieces they would have absorbed more flavor and worked better.\nGenerally a solid choice for Thai food. I can't say it stood out though, and I've definitely had better. I'm also just not a huge Thai connoisseur I guess, so that's why I could only give three stars.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-29", "description": "The venue itself is large, and has a sleek vibe. However it is incredibly loud if you're seated next to the open kitchen. I ordered a tofu Pad See Yeuw and my boyfriend got one of the chicken red curries. Unfortunately the food did not live up to the 4-star yelp standard =( My tofu was incredibly bland, the noodles were not well seasoned, and I didn't have a single floret of broccoli..just stalks? Boyfriend was not impressed with his curry either. The service was decent, but we will probably not return for the disappointing food.", "author": "Mannat K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Food is amazing.\nBut I'm tired of going there and it's closed.\nPlease update the web site", "author": "Joe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Joya is by far one of the best thai places I've been to in NY. It's reasonably priced, atmosphere is hip and the food is fantastic. I've actually planned my trips to Brooklyn surrounding a stop at Joya. The papaya salad is excellent and spicy noodles (drunken noodles) is always flavorful and cooked just right.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-25", "description": "Not sure yet... But I'm hungry. Well there is nothing Thai about your salad, or soup... Work on that. Are you people from Thailand? The drunken noodle is ok but come on drunken means it has sauce lots of sauce drunk on sauce... Where is the sauce?", "author": "Pedro P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "Horrible restaurant, horrible food! \n\nWorst service \n\nWeird employees \n\nManager and employees are rude and disrespectful. \n\nI will never return here. \n\nIf you want good Thai and good service try chance on smith street.", "author": "Ann b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "Still one of my favorite places to go to eat on Court Street. Went in last night around 6:40 PM and we were seated immediately. We started with drinks. A Thai iced tea for me (seems like the glass was larger than I remembered) and a glass of wine for my friend. Next up were appetizers. We decided on calamari. It came out fast. Lightly fried. Could have had a bit more seasoning but the sweet dipping sauce made up for it. Our entrees were good as well. I had the pad see ew with beef and my friend tofu curry. Both dishes were delicious. By the time we were leaving the place was more crowded with people waiting for tables. As always the music was loud but we managed to make conversation and not disturb the people next to us too much.  All in all an old favorite that I can always come back to!", "author": "Cortney W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "The food is over salty, the chicken came half warm and half cold, the drunken noodles came charcoal burnt. The waitress had the stankiest face and attitude since we sat down. You'll know who I'm talking about if you get her. You can't miss that resting I-hate-everyone-and-my-own-life face. She gave us our check before we were finished and stood over us while I was putting the money together to see how much tips she was going to get.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Super disappointed by the rude staff..... just not necessary in our neighborhood.  There are plenty of other Thai restaurants around here.", "author": "Dina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "After having a craving for Thai I stopped in to try out Joya and realized that the menu looked really familiar. After asking the server I found out that I have visited their other location in Fort Greene which I also loved! \n\nIt's a wonderful ambiance romantic enough to bring a date but without spending a fortune. The average price for an entree is $10.", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-29", "description": "I've been here twice. I consider it Fusion Thai. They have an outdoor area, but despite it being a warm day, they refused to sit us outside :( They have an open kitchen which is neat to watch.\n\nLet's talk food. I ordered soup, a noodle dish, and a fresh summer roll. All were lacking in taste and quality. What looked divine on the menu failed to meet my expectations when it hit the table. \n\nHow can you screw up Thai food, people? Really? No thank you. Not again, Michelle!", "author": "David A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "I like this place. They have good decor the food is decent although I ahave only tried their pad Thai and drunken noodle, I prefer their drunken noodle but the only drawback if I ask them for mode veggies than noodles they charge me $1 extra. I mean it's a little on the expensive side as it is. Anyways sometimes I have seen long lines that why I always prefer pickup here. \nGo here for a good drubken noodle but be ready to pay a little extra for it. But if you want to eat pad Thai, I recommend Lemon grass just couple block away from here, and if you want to eat something like a curry or something go to chilli cafe across the street from these guys. The prices are much more better and the staff is way more friendly.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Came here with a group of friends and had a great time.  The place is crowded on weekends but service is friendly.  Food was delicious with the exception of a drink I ordered a mojito; which in my opinion was much too sweet and syrupy.  I would have sent it back if I wasn't in a group with my friends.  I would come here just with friends because it can get very noisy, not great for a date.  Love the design of it; people usually get a little dressy here.", "author": "Annie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "Entrees are decent size but appetizers are too profit for the small amount they give. Taste is 4, environment is 3.5, and appetizer amount is 2.", "author": "Xiao G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Excellent experience!!!!! You have to try this place the ambiance is beautiful the food is on point and the service is excellent!!!!", "author": "Rite M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Some of the best thai delivery I've had in a really long time (via Caviar). Panang curry had the perfect balance of flavors, tons of fresh peppers and lots of really tender chicken - plus it was a generous portion.", "author": "Elise A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}