{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-15", "description": "As publisher over at brooklynexposed.com I have developed/fostered many amazing relationships with local restaurant/bar owners.\n\nHowever, last night I was subjected to the worst treatment I ever recall by one of Joya's owners (the white one, believe the other joyful one is Latin).  My intention behind writing this review is not to bash, but instead bring awareness to the fact that you deserve to be treated politely when patronizing a local business. And if not, take your money elsewhere!\n\nI've been patronizing Joya for years! The food is good, wait staff are friendly and you cannot beat the prices.  I walked in with a friend and inquired about a specific seat in the back, the owner said it's for four, then suggested a seat in the front - which I did not want.  With an attitude, he then took off and pretty much threw two menus on a table right opposite the bathroom (which I def did not want).  \n\nHe then walks back and asks \"what it it you want because I'm not in the mood\"  Truly, I was mortified because I am still blank as to what brought this behavior on and it was truly shocking because I first thought why is man (who doesn't know me from a can of paint) speaking to me in this manner. I am of the opinion this man should have simply informed me to wait a bit until the next table in the section I prefer becomes available.\n\nI believe he asked me what I want him to do and I said nothing, because I'm leaving. I called him an a*shole and left.  I also told him I am spreading the word about his ghastly and unprovoked behavior - so here it it.\n\nIn my opinion he should have never came out of his face like that...only he knows what the issue is and believe me...it's on him. What goes around comes around...because karma is a b*tch", "author": "Sharon B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "Ate here on a Friday night right before the rush came. I'll start with the pros.\n\nFood: Very tasty. The pad thai was very good, and spicy was an accurate description without being too hot. We also ordered the curry puffs which were great.\n\nAmbiance: Very cool. Great atmosphere overall. Decor is interesting. The place was clean. Didn't feel cramped. \n\nService: This is where they lose stars. It was quick service, but our waitress wasn't very personable. She showed up to take the order, and we didn't see her again until we got the check. The bus boys deserved the tip more. She also took the tip before we got up to leave, and we definitely weren't holding up traffic. It was just a quick date night.\n\nThe food is fantastic, but I wouldn't go back. I'll order takeout when service isn't important to me.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "My friend and I went yo Joya restaurant on Court Street..she ordered fish that was nasty...we quietly spoke with the waiter who spoke to the manager who rudely informed us that there was nothing wrong with the fish and we must pay for it...I would NOT go to Joya again!!! We just needed a better fish...btw..fish smelled spoil...", "author": "Naeemah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "Joya is the anchor of a Brooklyn Thai mini-chain which includes Song (Park Slope) and National (Fort Greene).  All three restaurants have a near-identical menu that is both tasty and shockingly affordable.  The dishes may not all ascend to Andy Ricker's ideal of what authentic Thai food should be, but everything I have had has been delicious and the price tag makes all three of these places regular go-to options.\n\nDifferentiating Joya from its cousins is a beautiful back garden shaded by sun-washed canvas umbrellas and nestled beside an ivied Cobble Hill wall.  The open kitchen combined with the fast stir-frying and intense flames makes for some pretty good dinner entertainment.\n\nJoya offers regular specials, which are usually inventive and quite good.  I most often stick with basics, however, and have never gone wrong.  The noodle dishes are classic, but well prepared and both light and seemingly greaseless.  Salads are fresh and a favorite pairs white mushrooms with a tangy chili vinaigrette that I want to put on everything.", "author": "Nick K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-27", "description": "(Le sigh) Oh boy. Let me set the scene. It was a Saturday night, circa 8 or 9 pm. We were hungry, so we called in an order after seeing it was rated pretty high on Yelp. We got a chicken satay, fresh thai summer roll, thai house salad, red curry with chicken, and a woon sen with chicken. I can only speak to the food I ate, so the rest will be omitted from this review.\n\nChicken Satay: Skip it. The chicken had a chewy bite to it, totally not fresh made. Now, in their defense it was very lean chicken. It could be better...and I've tasted better elsewhere...so skip it. (2/5)\n\nFresh Thai Summer Roll: I've had this type of appetizer at other places, and at Joya it had a really weird taste. My friend told me she saw tofu in it. I've never had it with tofu before. I am not a fan of their version at Joya, but perhaps you will like it. (2/5)\n\nRed Curry Chicken: Their red curry chicken was tasty. I prefer a spicier curry, but I understand that Joya caters to clientele with a more \"western tame\" palette. My only true criticism of their curry is that there was not enough chicken. That being said, their red curry with chicken was around $8......and the places I go to usually charge $15. A pleasant surprise in my curry was the eggplant....I loved it. (3/5)\n\nAs far as the restaurant is concerned, I love the decor and the ambiance. It has a sophisticated look, but a \"low budget\" price point....a wonderful combination. What I don't like, is the actual setup. You need to walk past tables and a bar to check in, or pick up delivery. That setup lends itself to causing a lot of traffic to build up inside. You know, people trying to get a table, running into others picking up, running into people at the bar, running into people trying to go to the bathroom. Ugh! I think it makes sense to have the counter in the front of the restaurant, near the door (Almost all of the restaurants I frequent do that!).\n\nForget service. There was one lady at the desk, who was cashing people out, answering the phone, and dealing with customer pick ups. She handed me the bag of food, but did not even ask me for my cash, or count it. I literally left the money next to the phone where she was taking an order, and left without her even acknowledging that I had paid. UGHHH.\n\nBottom line: I wouldn't oppose going there again, but I certainly would not go out of my way to visit. You pay for what you get, basically.", "author": "Carlos G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-10", "description": "3.75 Stars\n\nWhere I live there's a  LOT of Thai food (Queens REPRESENT!).\nBut I have heard so much about this place that I have to give it a try.\n\nFirst I felt like i was in Jersey, Not a good vibe, because It makes me think this place is to impress your date / have a good time with friends and not the food. Also a little too loud inside (not sure about outdoor space)\nPrices are reasonable for a place like this in BK.  \n\nOrdered my Thai Iced Tea - It was OK.  Usually it's super sweet, but this one was watery, not thick enough.\n\nMy dish was a pad Se Yu (or pad see eww) with Tofu - The Easiest and safest dish to order. Portion was pretty average.  Was not a big fan of it. FIRST the TOFU was in BIG CHUNKS!, by that means that you have to bite it or Cut it into small pieces (Unless you like to put the entire 2 inch triangle piece in you rmouth), The Flat noodles was ALSO in Big layers.  It makes me think they are too lazy to cut it into smaller layers, NO BUENO.\n\nMy Other half ordered a special of the day dish which was the Steak with veggies and rice.  Again, the veggies were into big chunky pieces that you have to CUT it in smaller pieces to eat.  A small bowl of rice with a large entree for the meal is not well balanced.\n\nOverall it's ok.  But not original Thai food.\n\nCASH ONLY!", "author": "Helena H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-20", "description": "Came here for lunch for the second time, and unfortunately this place has gone way downhill. My mom and I got a seat in the back patio which was quite nice, but service was extremely slow and inattentive. Our water glasses were never refilled, food took forever to come (which was quite inconvenient for a lunch break) and they seemed like it bothered them to have to serve us. \n\nUnfortunately food was not much better. We ordered two lunch specials, one with Fresh Summer Roll and the other with the Mango Salad to start. Both lacked flavor and seemed to be sloppily prepared. Our entrees were plentiful but very one note. I like sweet with my savory dishes, but the Pad Thai was just overpowering in sweetness. The fried rice was better but again very sloppy and needed a bit more flavor. \n\nVery unfortunate since I had such a good visit the first time I came here. I guess this place is coming out of rotation. I guess I will stick to Lantern in the area for my Thai food cravings.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Joya is superb and checks off all the boxes. Amazing ambiance, quality + reasonably priced food and great service. My wife and I consider this one of our go-to neighborhood spots, we love this little Cobble Hill gem.", "author": "Miguel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Great atmosphere and delicious food for an affordable price! Will definitely be coming back here!! Recommend the spicy noodles! Great date spot.", "author": "Pay P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-08", "description": "We found a HUMAN TOOTH in the vegetable spring roll upon delivery.  Terribly shocking and horrifying.  Please beware and save your money and stomach.  I have photographic evidence.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-07", "description": "If I could give this place negative stars I would.\n\nI can't even believe I am composed enough to write this review right now.\n\nJust ordered delivery from Joya.  Had ate there once before. It was fine, normal, mediocre Thai food.\n\nGot to the end of my veggie spring roll and bit into something shockingly hard.\n\nSpit it out, it was A HUMAN TOOTH. NO JOKE.\n\nJust spent the past half an hour vomiting.  Absolutely not okay, health services will be my next call.  A HUMAN TOOTH!!!", "author": "Ramona M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "This is a very good and affordable Thai restaurant. Very good ambiance. The flames coming out of the open kitchen are cool and entertaining. Nice vibe.  The patio seating is a plus as well.\n\nDon't like the cash only policy for such a restaurant.\n\nIn terms of Thai staples, the pad thai and pad see ew were well prepared but were not superior to those of some other Thai  restaurants I have been to.  \n\nMy fave noodle dish here is woon sen cellophane noodles, stir fried with shrimp and veggies : love the lightness of these glass noodles and the acidic factor of this dish, from the lemon.  Ironically, I do wish more of the aforementioned noodles were included as part of  the order. \n\nAmong the appetizers I would recommend tiger shrimp rolls, spare ribs, and the curry puffs.\n\nReally like the salmon fillet entree where the actual stand out are the brussel sprouts, carrying a great, roasted garlicky flavor. \n\nAnother one of my favorites is the the green curry with shrimp. It comes with a generous amount of good size shrimp and the heat of the curry sauce is just right.  Kudos to service for noticing I ran out of rice for the curry and right away replenishing my supply.\n\nAlso they have a rack of very good Thai chili hot sauce condiments for those who like it really spicy, but you have to ask for it yourself.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-02", "description": "We ordered delivery last weekend from this place.  On the plus side, ordering on the phone was easy and the food arrived very quickly.  Unfortunately, the food just did not stand up.  We got three things:\n- Shrimp summer rolls: These were mediocre.  Shrimp was slightly over cooked.  Also, it was served with a dipping sauce that I believe was deli mustard.  Odd choice.\n- Chicken pad thai: This dish was fine.  It was too sweet for my taste and there was very little vegetable in there.  If everything was this quality I probably would have given 3 stars.\n- Beef Massaman Curry: Beef was tough as shoe leather which really ruined the dish.  The curry and potatoes tasted ok I guess.\n\nOverall, very disappointing.", "author": "Mitchell G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "I like this place. I usually come with the family. The people are cool. The decor is nice.", "author": "Arielle P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-31", "description": "4 stars 800+ reviews? How?! Really disappointed with this place. I had high expectations judging from the reviews. This is not real thai food. You can tell the food is made from a variety of bottled sauces, not fresh spices. All 4 of the dishes I've tried had tons of unnecessary sugar, which lost the little flavor that was left. Lastly the menu doesn't have some of the proper dishes you should find in an authentic thai restaurant, definitely not for someone who enjoys fish. The only thing I liked about this places were the prices, which were very fair. Overall, wouldn't go back again.", "author": "Mouzam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-05", "description": "Great Thai! Worth the wait, but don't leave when they tell you 30min to be seated. They say 30 mins no matter how long in reality and then you will wait again. \nGreat portion size. Nice ambiance.\nCASH ONLY", "author": "Cydney H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-24", "description": "Joya is a great deal during lunch. The Spicy Noodle was super tasty and prepared to the desired heat level. Upon request hot sauce and other condiments are brought to the table to finish tuning your meal. \n\nThe restaurant is very clean with a trendy industrial decor and some outdoor seating. Our walk to the table took us past a DJ station, our friends said it gets quite loud and crowded at night.\n\nWe were all happy with our meals though they arrived in stages, a couple dishes were about 10 minutes behind the others. \n\nVery good!", "author": "Rich R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "Great food! Killer pad Thai and phenomenal curry. Super fast service and cute atmosohere. Definitely recommend.", "author": "Valerie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-08", "description": "Hip Atmosphere. Strong Drinks. Dim Lighting. Standard Thai Fare.\n\nWords that describe my visit to Joya in the Cobble Hill area of Brooklyn, NY.  Within walking distance to Pier 6, this Asian cuisine hub is a great dining option for dates, girls night out or a bar crawl.  Our table of two dined on fried spring rolls, drunken noodles and coconut curry shrimp with vegetables - accompanied by a pomegranate mojito.\n\nVegetable Spring Rolls...\n\nFlaky \u0026 fried goodness with the perfect amount of veggie filling; served with a ginger honey like sauce.  Priced around $2 it was filling and Americanly authentic.\n\nSpicy Noodle with Shrimp \u0026 Vegetable aka Drunken Noodles...\n\nVery yummy and smooth in texture, it coated my mouth with soy, lime and salt - very close to umami; inducing a tongue smacking sensation while it matched the plates aroma.  It was what I have come to expect from Thai cooking.  The noodles were were thin \u0026 wide and complemented the brown sauce and crisp vegetables perfectly. I would highly recommend this dish.\n\nFried Shrimp with Coconut Curry...\n\nThank goodness for the shrimp because this was the worse curry sauce I have ever had - it shouldn't even be called curry of any kind.  They should call it shrimp and coconut water.  This dish is not a standard on the menu and appeared on a handwritten \"specials\" menu; which was a wise move on the managements part because it was extremely bland.  The 8 shrimp were fried \u0026 coated with crispy panko but had nothing to bathe in because the \"coconut water\" sauce was too thin and lacked the yummy rich flavor Asian condiments generally have. On the up side, the veggies were perfectly cooked and the side of white rice was chopstick sticky ;o) The plate was priced at $12 but should be priced at zero and returned to the kitchen because it's like a mirage - looks good but nothing is there lol", "author": "Shelly F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "I really like this place. The prices are really low. The food is really good for the price. The food is good if it was pricier even. I have had better Thai food, in my life, but not in Brookyln. (By the way, why is affordable, excellent Thai so hard to find??)\n\nI dont know, maybe there is better Thai food in Thailand but I am fine with Joya since the commute isn't as far :)\n\nPerfect outdoor space for eating in the warmer months.", "author": "Jennifer S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}