{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "My love for Thai food is unexplainable. Pad Thai has been one of my favorite dishes since I could remember and Joya was able to make my night with their Pad Thai. I came here with one of my girlfriends. We had wine to start. We had the shrimp spring rolls as appetizers and also the squid salad which was delicious. She ordered the skirt steak with vegetables which was cooked amazing! I obviously got the Pad Thai which was also very good. Not the best but very good!  The service was great, the food came out quick and if we needed anything the waitress was there to give it to us. Kind of felt a little rushed but I can understand because the place is small and  they need to turn tables over.\n\nThe reason I gave them 4 stars is because they don't accept credit cards and that was a very big inconvenient for me.", "author": "Elizabeth F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "What a joya to eat there!  (sorry, had to).  Very nice atmosphere, especially given the price of their dishes.  Had the Chicken Red Curry (Kang Gai).  It was a good sized portion, fresh vegetables, and a great spiciness.  Only complaint was a bit too much saltiness for my liking.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-31", "description": "I am usually not a huge fan of Thai food, but Joya is the exception. Reasonable prices and large portions. Their calamari is the some of the best that I've ever had, and the sweet chili mango sauce is a good change from the usual marinara sauce. They also have a cheap wine list ($18-30 per bottle).", "author": "Jess W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "This place is actually one of my best kept secrets. Anytime someone mentions Thai- I get them hooked on Joya! The number 1 dish to get is the Woon sen/Glass noodles; or the tiger shrimp. There is absolutely nothing like it anywhere. Plus, the drinks here are always on point! \u0026 the setting is super comfortable \u0026 clean. If you're thinking Thai then there's only Joya.", "author": "Julia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "Most thai places in the city are pretty much the same to me, and this one ranks along with the rest of them. They have extremely cheap prices, their plate proportions are on point, and the environment is very chic!\nI would go there again because i really love thai food and is always great to find cozy little spots in Brooklyn! Plus the drinks are very strong so they are cheap on the alcohol.\nOnly con is at the end of the meal I had to run to a ATM because they don't accept cards :(", "author": "Kathleen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "Had lunch here on Saturday and loved it. This is a great space with outdoor seating and an open kitchen. \n\nMy friend and I shared fried calamari with a sweet/spicy sauce. As an entree I had panang curry. Delish delish delish!\n\nGreat place for a date!\n\nBeware - they only take cash.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-10", "description": "This place totally fell off over the years. Overly salted foods, loud music which makes people have to yell just to have a conversation, food comes way to fast...it's definitely all about turnover. I've been consistently disappointed the last three times I've been here.", "author": "Tatiana M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "The food was tasteless, the beef was very dry and the sauce isn't even garlicky. The wait was long, it was packed also. I do not mind waiting for good food but, the food in this place isn't even worth it. I wouldn't even eat it if it was offered to me for free. I should've went to a Chinese fast food restaurant and would've gotten way better tasting food. The one star is for the cute, nice and smiley waitress that attended us. If it wasn't for her then I would rate it 0 stars if I could.", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Incredible. Best Thai I've ever had and I have had a LOT of Thai in a lot of different cities, and I cook it myself. (A little obsessed.) The drunken noodles* - which are my go-to Thai entree - were the best I've ever had. It's also extremely affordable. My only complaint would be the loud noise level and long wait but the amazing food made it all worth it. It would be a great place for take-out if you don't want to deal with the noise/lines.\n\n*They're called \"Spicy Noodles\" here.", "author": "Anwesha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "Five starving girls.\nOne damn long wait.\nAt least three requests to \"step aside please.\"\nA curiously pompous host and a redeemingly sweet waitress.\nFour shared appetizers. \nFour scrumptious noodle dishes. \nSixteen candles on the bathroom wall.\nOne bottle of wine.\nThree doggy bags.\nZero credit cards accepted.\nTwenty bucks each!\nFour well deserved stars.\nMany more visits foreseen.", "author": "Mia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-26", "description": "Been a huge fan of Joya since it first opened in Brooklyn, many, many moons ago. Over the years, the consistent delicious food and amiable staff (even on DJ hipster night), has always been why we return. So many referrals of friends here :)", "author": "MetroGypsy NY C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "My favorite Thai place in NYC! Great Ambience (loud, trendy, dark). MUST HAVE: chicken pad Thai and curry puffs.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "This was my first time and I'm in love with the food and the service  and we ate outside. On a beautiful weather.  I'm coming back", "author": "Marco A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "I went wanting a quick pad thai after a long day in the library. Not feeling like a full sit down experience I perched at the bar. It took 15 minutes for anyone to acknowledge me. It then took another 30 minutes to get my food. The food itself is decent but the lack of attentiveness was more than off putting.", "author": "Colin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "This place is addictive. It's on the cheap side, without a cheap environment. It's got a nicely intimate atmosphere, great for conversation.\n\nThe food is so tasty! I usually get the drunken noodles and a Thai tea. The Thai tea is really good - a lot of places water it down too much, but if you like the tea sweet and milky and fragrant, like me, you'll like it. \n\nI don't live in the neighborhood, but I get Joya cravings often.", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "4.5 stars for this place.\nThanks to all the previous Yelpers, this place didn't disappoint (for the most part).\nWent outside to the seating area and enjoyed the sun.\nWaiters and waitress are responsive. Very attentive to customers inside and outside.\n\nWanted fried spring rolls, and the kick? \nWaiter: Sorry it's not available\nMe: Uh... what?\nWaiter: We don't have oil today\nMe: O.o''\n\nAnyhoo, ordered the Skewered Chicken, Grilled Steak and Fried Rice, and the Mamasan (I probably mispelled this) curry.\nSkewered chicken was ok. Had some peanut sauce and light veggie dip.\nGrilled Steak and rice looked really good. Very large plate. My friend couldn't finish it. Very generous portion of rice.\nMamasan Curry was smooth. Light coconut and mild. Comes with rice that should just be tossed into the sauce. It's so tasty. I ordered it with beef and it was pretty tough to chew.\n\nOverall, great place for lunch for the prices. Goodness, very affordable. NOTE: bring cash, no credit cards!\nHopefully next time I can get the fried spring rolls for the extra 0.5 stars.", "author": "Kenny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "After dining here, I have to say Joya lives up to its rating. It's no pretender restaurant with dual Thai and Japanese cuisines. They have a pretty simple but fully Thai array of dishes. I've been warned about NYC food prices but I found the prices rather reasonable here. \n\nTom ka gai comes in a large cup that I wished I had shared as opposed to each getting one. It was tasty, full of ingredients and worth finishing. \n\nSticky rice mango salad with half chicken. I wasn't sure where this one was going but the chicken was damn good. The mangos were not yet ripe. The sticky rice was sticky to the point of being a rock. But the chicken alone made the dish. \n\nThe chicken and broccoli sautéed in garlic was the worst dish. The garlic favors were muddled in the mess of gravy sauce. \n\nI'd have given Joya 5 stars had it not been for the host. He seems to know quite a lot of people, you can tell by his interactions. But these conversations extend at the expense of the diners waiting to be seated at open tables.\n___\nJan '12 Health Score - A!", "author": "Dennis L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "I've heard only great things about Joya, so my friends \u0026 I decided to try it out. It was everthing that we were told it was, plus more. The food was out of this world. My friends \u0026 I all ordered a different bunch of things. I had the spring rolls, the tiger shrimp rolls and the Kang Masaman - ok so I went a little overboard but I couldn't help it.\n\n My highlight was definitely the curry - Oh my God!! I'm gonna say that it was probably one of the greatest curries that I have ever ordered and eaten out of a Thai restaurant. Joya has such a great vibe to it. Servers are overly happy and friendly. Prices are awesome - crazy cheap. Wish I had tried this place sooner...Might just head back there with the girl tomorrow for dinner.", "author": "Markus H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-06", "description": "Service not very friendly or helpful in ordering. We ordered plain noodles for our 7 year old and they came out filled with onions, veges, and meat. The pork with spicy basil has nearly 0 spice so not enjoyable to someone who likes spicy Thai. I even ordered it extra spicy. \nThe noodles despite coming out wrong were tasty and price and atmosphere give this more than 1 star. There are a dozen better Thai restaurants in the area for only slightly more money.", "author": "Kay L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "I love the outdoor seating area in the back, but the food here was too americanized to my taste.", "author": "Juan J."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}