{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "This place is nothing to rave about.  The food is just ok.  It's inexpensive so it's not a complete waste.  The Tiger Shrimp Rolls are good.  The Thai Spare Ribs needed sauce.  The beef in the Nuur Kratiam (sauteed sliced beef with broccoli, cabbage, carrots and onions in a fresh garlic sauce) was tough. The Koong Kratiam (sauteed shrimp with broccoli, cabbage, carrots and onions in a fresh garlic sauce) was extremely bland.  I could have ordered this at my local asian restaurant and tasted a better flavor profile.  As I read in previous reviews THEY DO NOT DEVEIN THEIR SHRIMP which is very unsettling.  I guess you get what you pay for.\n\nAs for the set up of this place, I can't stand it.  When you walk in you assume you should wait there for someone to come seat you.  Actually you have to walk into the middle of the restaurant and wait to be seated there.  ARKWARD.  The host took a really long time to seat us.  The bathrooms are also located in the middle of the restaurant which I did not like.  As soon as you open the door the toilet is right there.  So if you accidentally walk in on someone they are giving you a full frontal view and the people dining behind you have the same view.\n\nNot interested in going back.\n\nNOTE: CASH ONLY!", "author": "Laura R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "I have been eating here for years and it is still just as affordable and reliable. I love the backyard in the summer, but even in the winter it will be packed. On a cold winter Saturday night at 9:30 there was still a half hour wait. The good thing is that bottles of wine are in the $20 range. You can eat like a king here and still pay next to nothing. It's the same menu as Song, but Joya came first. I have never had anything bad, I enjoy the specials but still opt for the all reliable, my favorite the Pad Thai. The spring rolls at $3 are a crazy deal and delicious. I recently had the Thai Style mussels and could have practically drank the broth. The skirt steak that comes on special (prepared a variety of ways) has always been tender. Most recently it was served with chinese broccoli in garlic sauce but I love it when it comes with red curry and pad thai noodles.\n\nThe only thing they don't really do here is dessert but the portions are so large and tasty you don't need it.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-26", "description": "Great food. Worst service ever and the owner is really rude. \nI had the masaman, it was a bit too sweet but i liked it.\nThey didnt know who order what, took 20 minutes to take the food off the table once we were done and another 10 to box and bring back our doggie bags.\nThe owner wouldnt charge our phone because he's been sued. Sounded like bs to me.", "author": "Mery W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-15", "description": "First time I came here was for dinner, and had a great experience. Place was packed with people, and lighting was dimmed appropriately for dinner. The chicken dish I had was enormously filling and tasted great, I think it was a seasonal menu item though, as I didn't see it the next time I came.\n\nAs for the 2nd time I came, I wanted to show my boyfriend what a great Thai place I found. We came for lunch on a nice day, and sat outside. Unfortunately, the outdoor seating didn't agree with us, as the mosquitoes would not leave us alone. I was bit a few times and could not enjoy my meal, so I had requested to sit inside instead. The food we ordered tasted no where close to what I had remembered, I barely ate my dish this time. \n\nWhat I'd like to know is, what happened to the place I first enjoyed?? Did the chef get changed, or did they stop caring? The time lapse between the first and 2nd visit was about 8 months apart...", "author": "Betty B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-10", "description": "Its a great Thai Restaurant. We were recommended by the local bookstore cashier. \n\nThe wait was quite long but then again it was a saturday night. We sat by the bar and had a beer and once seated we ordered our food. Im not very familiar with the cuisine so the waiter recommended and I took it and it was delicious. As everything on th menu because my husband ordered almost everything haha. They're generous dishes so I couldn't finish mine,. \n\nWes at towards the back and where you can see them preparing food which was cool and the view to the back yard. Its cozy place and low lighting.", "author": "Sindy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Joya is perfect for a date. Industrial chic with dim overhead lighting and candlelit tables, and it's always bustling with people. It has that fun, city ambiance. Such flavorful food and I'd say a good 95% of their menu is below $9.99. Whenever I go there, I ALWAYS order the fried calamari. No one makes it like Joya: light, crispy and tender; I could eat the whole plate on my own haha. *** TIP: Ask for it with plum sauce on the side! The plum sauce is a sweet and vinegary syrup-like sauce, like a play on sweet and sour, and it WILL change your life. Thank me later! :)\n\nService is awesome. It always feels as though you only wait a couple minutes before you realize you have your food in front of you; the chefs are so fast and thankfully their speed never forsakes the quality or flavor of the dishes. For the flavor, portions and price?! Joya is gold!\n\nFavorite dish is Woon Sen with shrimp: glass noodles perfectly coated in a smoky, garlic flavored sauce (not wet and not dry) + fresh vegetables. With a hint of freshly squeezed lemon they give you on the side, ugh, it's perfect.", "author": "Nicole R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Really enjoyed my meal here. Ordered the recommended mango salad, pad see yue(extra spicy), and veg spring rolls. All delicious.\nI was a little discouraged reading so many yelp reviews saying that Joya is far inferior to other Thai places, but I found nothing to complain about. Thanx Joya staff.", "author": "Collin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-06", "description": "I have tired with this place forever but, it has gotten worse.  The food is terrible now and the kitchen is unkept.  There is a smell of something putrid when you enter the space.  It's really nice in the summers to sit out back and have a drink but, I think even that will be played out next year. Your service needs a refresh, everyone's back to the dining area is insane.  No one cleared the table, asked if anything was ok, brought the check without prompts.  Awful, never again :(", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "My favorite thai food in Brooklyn! My favorite's are the mango salad and the panang curry. Everything here is super fresh and the vegetables actually have crunch- unlike most Thai places. Also, unlike most Thai places, the interior of the restaurant is quite nice. Very cozy and modern and they also have a beautiful garden space for warmer days. \n\nPlease dear god open up a place in Willamsburg!!!", "author": "Jack G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "By far one of my favorite Thai restaurants in New York City. The food is incredibly seasoned, the service is very fast and the restaurant itself is gorgeous. Tucked away in Cobblehill it makes for the perfect date night or Saturday night outing. A true gem.", "author": "Lola L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Really cute interior that is very sleek but welcoming. \nIf you're ordering out, the lunch specials are awesome. I recommend the Pad Thai and spring role", "author": "Gillian R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Went here the other night to branch out from our usual Thai take out joint. I was pleasantly pleased. The back yard is lovely and the food is delicious! We got spicy noodles with Mock duck and green cury with veggies. Both dishes were great and the curry had a good amount of vegetables in it, which is hard to find. Definitely reccomend and hope they deliver to me so I can go back to enjoying thai on my couch as it's intended.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-21", "description": "If I can give this place a negative rating I would. I've never had such horrible racial charged service in my life! The server didn't attend to me or my party at all. We had to chase him down with literally every thing. He got a tip reflecting that. Him \u0026 his manager Ariel told us that if we can't afford to tip him then we should come back! What type of service is that!! I advise no one to support this establishment!!", "author": "Chalon E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "Very good food but if you sit yo close to the kitchen you'll smell like Thai food for 2 days :(\n\nIt's very well priced and they also have a lot of specials. I go there now and then and have never been disappointed.\n\nOf note their paneng is boss but the green curry is weak!", "author": "Farshid R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Love Thai food and if I'm in Brooklyn it's no question im definitely stopping in here ! The service is amazing \u0026 the food is a 10 ! I'm big on customer service and the staff here is very attentive .  The Thai iced tea is a must try .  They have a regular menu but take a look at the specials people usually order from this menu , try the salmon \u0026 bok choy  ,or the whole snapper def the best dishes on the menu", "author": "Tasha C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-02", "description": "I'm disappointed :( my mom and I ordered a tom yum soup and mango salad to start. The tom yum was barely warm and salty beyond belief. I say that as someone who loves salty food! We asked them to warm it up but they didn't really even do it. Then we got the koong kraprow and a shrimp curry. My koong kraprow was really not good... The sauce was weird and the veggies felt very bland. My mom was not crazy about the curry. The mango salad was the best dish.", "author": "Lynn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "We entered this establishment to join family members after enjoying ourselves at the Barclays Center watching my brother play ball, Big3 League.  Family members were already seated and eating when we arrived, we were asked to wait while  our table was set up...7 minutes or so later, the owner/manager comes from out of nowhere to seat us and proceeds to start an argument with my mother about how she was rude and needed to be happier because his establishment was a happy place  we were very confused as to where this even came from, no one said anything to him or anyone else for that matter...he proceeded to raise his voice and was very much over the line of personal space, at this point I said \"You are not going to speak to mother that way\" he said he will speak how he wants it's his restaurant and told us the door was that way  ...we were very confused as to why this was happening and pissed so we left deciding our money wasn't worth spending there.   He was rude and confused and I will NEVER set foot in there again and will tell everyone I know to not go as well!", "author": "Tia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Absolutely perfect!!! I've been looking for a Thai restaurant similar to Noodle Head, a Thai spot in Pittsburgh! My roommate/friend insisted on going here, I was reluctant...so happy I went. Great staff and great food...will be returning!", "author": "Nkechi O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "One of our favorite places to order takeout. Predictable, cheap, and good noodles. Does the job when we don't feel like cooking or going out.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "I love joya the food n appetizers are amazing the price is very reasonable people should definitely check it out", "author": "Eddie A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}