{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "I've been coming to Joya for a few years and this restaurant never disappoints. Great food that doesn't cost an arm and a leg in this area is hard to come by. Joya wins first place in my book. Now that I live in the area, whenever I have a guest over, I impress them by introducing them to Joya. \n\nWalking in, you're in for a treat. The lighting is dim, the music is lively, and the decor is super cute. They have an outdoor seating area as well which is equally as cute and kinda romantic. The food is always really good. I usually eat in but the times that I've ordered take-out I was surprised by the consistency this restaurant delivers. My favorite dish here is their spicy seafood fried rice, but go ahead and try other things on the menu. I have, and never regretted it.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-29", "description": "Very impressed with  their backyard outdoor seating. Super relaxing and cozy with the pillows and umbrellas. Plus you don't get to constantly smell the kitchen inside. \n\nNot a huge fan of their Thai ice tea. Came in good portion but a little too \"chemically\" sugary for my taste. \n\nTheir appetizers are really what stands out. The fresh thai summer rolls tasted sooo refreshing with the cucumber, shrimp in tamarind sauce.  Great presentation as well. Loved the calamari dish!! Never had them come out  so crispy without having being oily. You could basically grab one without needing to wipe your hands. The plum sauce it came with  was the perfect. accoutrement. We ordered a small for 2 and we were starting to feel full by the end of it. \n\n\nFor entrees, I ventured out of my comfort zone and ordered the Kang Panang Gaibeef which included sliced beef with peppers crushed kaffier leaves in panang sauce.  My friend had the Kang Kyo Whan Gai with sliced chicken, eggplants, zuchini  in the green curry sauce, Both sauces were more watery than what we were used to but still had taste. Found the Panang to be more flavorful than Green curry. In both dishes, the meats were overcooked and lacked flavor (my beef slices were slightly tough and her chicken slices were white and blend) . Some of the vegetables were kinda old as well (carrots and eggplant were slightly browning). \n\nOverall, the entrees we had weren't that great (to say the least), but then again they weren't indigestible. I will still eat my leftover for lunch tomorrow. I think they kinda win with the seasoning on their sauces..cause it made me  forget about the other ingredients in the dish. Or it could be  I'm just a sucker for thai sauces...Haha!\n\nI looooove their portion sizes and their price. You can honestly be full and satisfied from the apps, share an  entree and still have enough to take home. For 2 apps, 2 entrees and 3 thai iced teas, our total came out to $38\n\nService was not great.  Our server lack any opinion and seemed more preoccupied with us getting our orders in quick. I can see why people complain of lack of service when this place gets packed. \n\n4 stars for decor\n3 for food\n2 for service\n\nStill look foward to coming back for more lunches.\n\nOh and like everyone says, CASH ONLY", "author": "Annie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "The food is wonderful, however their service doesn't meet the standard of their tips. They include the tip in your bill, and it's too high, and their service isn't that wonderful.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "Every weekend over the summer, I'd get food here with my family. This place is amazing and made me love Thai food. Everything they make here is excellent.", "author": "Aston G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Definitely cannot lose going here. Prompt service, even when busy. Delicious food. Nice atmosphere-- both indoors and outside seating. They have some pretty decent beers. This is absolutely a go-to if you aren't trying to spend a lot.... Or just in general.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "I would've given 4 stars b/c honestly the food was good and the decor is nice too. We didn't wait long on a Sunday evening and overall it was cool.\n\nThe only thing that put a damp on this place and probably affected my decision to return is the fact that egg shells were found in my honey pineapple fried rice. That's an absolute NO NO!. We told the server and she brought out a fresh new plate(maybe) LOL, but that's just not cool.", "author": "Lyn D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "This is definitely a great date night spot or even just a girls night with your friends. The ambience is so chill and the decor is phenomenal. \n\nThe veggie spring rolls are AMAZING. Also, try the pad Thai. The serving presentation was beautiful as well.", "author": "Tiffani G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Likely my favorite thai restaurant i've been to in the city.\nThe food is great and the ambiance is cool. Usually Im a pad see ew guy but I can't resist their pad thai. All the other food I've tasted has been great as well.", "author": "Nick B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Although the food was fantastic, the service was spotty. As I made my way through the restaurant to get the attention of one of the workers to get sat down, she simply said to wait for this man to get the name down on a list. So we wait 30 minutes. Then we finally get seated. Everything was great from there- just something to improve upon.", "author": "Cyrus S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "Extremely  average Thai food ! definitely the aunthentic taste is missing . No fresh ingredients and curries lack the richness of coconut milk. The one star is for fair prices .\n\nOverall very disappointing experience !", "author": "Supriya K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-22", "description": "Man was I disappointed! My friend and I came her because she has had good experiences, but mine was not so much. Don't worry, it hasn't hurt our friendship :)\n\nWe ordered summer rolls that were inedible due to dry blandness and chewiness. Like, I was concerned it would be a problem for my gut if I attempted to digest it.\n\nWe also shared a noodle dish that was edible. \n\nWe ordered house Sauvignon blanc that was drinkable. \n\nBut the server seemed like I nice guy who but should consider a different line of work. He wouldn't look us in the eye, seemed in a rush, didn't ask if there was a reason we didn't touch the rest of the appetizer, didn't even apologize when I expressed my dissatisfaction with the dish...my friend, a local, said that this kind of service was to be expected in Brooklyn generally.", "author": "Victoria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "This place is amazing like oh my gosh. We ordered the Fried Tiger Shrimp Roll: its really crispy and the sauce goes well with it. The Mango Salad: was really refreshing and the mango was sweet. The Tofu Tod: was average, its just fried tofu. The Curry Chicken: was balanced, not to sweet or salty. The thing is, I don't like curry anything but this place is a exception. Pad See Yue: was decent, taste about the same anywhere. But the prices are so cheap here!! Like the Fried Tiger Shrimp Roll was only $5.95 for 6. So amazing. The flavors is really nice and the restaurant is big. The service was okay. But this place is a A+.", "author": "Irene Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "Gentrified, white-washed Thai food. Don't come here. More time was put in the decoration than the actual food. This place is a joke. No soul, no life, everything is dead to the palette. \n\nThe most horrible dish we ordered was this fried snapper found on the \"special\" menu. It was overfried, dry, tasteless, and I feel sorry that the fish had to endure a horrible death for someone to cook that bullshit. \n\nThe \"spicy\" wasn't spicy at all.. maybe to people who don't eat any spicy. The reviews are written by people who don't know what real Thai food is. What a shame. \n\nThe smoking gun was that when we showed the waiter a Thai dish we wanted, she said \"I know what that is, they serve it at real Thai Restaurants\". So... this place is not real Thai...", "author": "Lucas R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "I've eaten at this restaurant before, but at another location here in Brooklyn. At that time I ordered their fried rice,  which is usually great. But this time,  things were different. The wait was long, which is expected since it was a Saturday night- no problem. After being seated, my friend and I ordered.  Food and drinks came promptly,  but lacked any flavor in both meals. He ordered Chicken stir fry and I had the Fried Red Snapper in curry sauce with rice.  The rice was extremely gummy, and my fish had absolutely no flavor whatsoever. It tasted like a fried oily mess. I tried to eat as much as I could, seeing that red snapper is a very meaty fish,  but they fried it so much it started crumbling. The only thing good about this meal were the tons of vegetables they topped my oily fish with, their appetizers and wine.  Smh..I will not be coming back here at all. Especially after the young lady (who wasn't even our hostess) showed our receipt to the woman who actually took our orders to show her that no tip was being left. ..and then came over and asked if we were leaving a cash tip!!.. How about no!! A waste of $62..(seriously??-the Person who took our orders and brought the food to us never came back to check and see if we needed anything, like most normal establishments)..this is so unacceptable..horrible..never again. .", "author": "Tameka P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "The food at Joya is fantastic -- I eat a lot of Thai food and their Pad Thai and Woon Sen are easily the best I've ever had. I can't speak to the in-restaurant service since I always order in, but  the food travels well and delivery is usually speedy unless it's a really bad time like 8pm on Friday in which case you should expect a wait from pretty much any place you order.\n\nMy only real criticism? I no longer ask for drinks with my delivery order since they *consistently* delivered expired sodas. I'm guessing they buy their soda at discount because it's very close to expiring...and lemme tell you, soda definitely goes bad when it hits the expiration date.\n\nSo - perhaps grab a soda at your local bodega if you want to enjoy it with your dinner -- but rest assured Joya offers the best Thai food in Cobble Hill, hands down.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Literally the best place to eat Thai food evvvverrrrrrrrrrr!! My favs are the green curry with chicken, spicy noodle with chicken, curry puffs, calamari, the mango salad, mussels, ugh everything here is bomb dot com.", "author": "Dina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "This food was banging! Joya has a great ambiance, large portions and great prices. Our waitress was extra friendly which helped, even though we only waited 10 minutes to get our food! This place is definitely our new go-to for yummy Thai.", "author": "Karen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "This restaurant is a great place for a date night or a dinner with a small group of friends. I was seated in the outside patio, which was nicely decorated. \n\nI shared the chicken satay, pad thai, and pad see yeu. All the food is good and reasonably priced. The portions were pretty generous as well. \nThe waitress was very nice and attentive. \n\nI will definitely be back for the house specials and cocktails.", "author": "Yen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "Never disappointed when I go here...I've frequented this place well over 10x's. This was my first dabble in the world of Thai food. \n\nThe atmosphere is a bit hectic depending on what time you go but the feel is relaxed and with the outdoors it can easily become your next chill spot.\n\nThe food is absolutely spot on. I've always gotten the drunken(spicy) noodles with chicken and shrimp but I've also tried their various curry dishes and I'm in love with Tom Yum soup and calamari. Just recalling all the good food makes me want to go there tonight... (sigh) the struggle!!!\n\nBottom line...GO!!! Your palate will thank me!!", "author": "Hope G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "Visit Joya when you're in Cobble Hill, and if you're not there it is worth the trip. They will not disappoint! Lovely food, inexpensive, and great service. What more can you ask for? I take pride in saying that Joya was the first Thai restaurant I visited, ever! I am glad to report that YEARS later, I'm still a fan of Joya. Here is where I discovered my undeniable love for Thai Iced Tea (which you should definitely try).", "author": "Bria A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}