{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "Rly nice place but the food was average. At least what we ordered: summer rolls and papaya salad. The green shrimp curry was ok. The prices are rly low and the ambiance is nice. However it is cash only and you can get out of the place smelling like fried chicken since it is an open kitchen.", "author": "Steph E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-14", "description": "Joya is mediocre to decent Thai food, but there are TONS of mediocre to decent Thai places in the area, and Joya is just one of them. I know it's on the other side of the slope, but the only place that has shown itself a full step above is AM Thai Basil. T Thai and Watana can be a half step, everything else (Joya included), in the words Big Daddy Kane, ain't no half stepping. \n\nGo here if it's convenient, don't expect too much though.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-17", "description": "Went there tonight for thai food and I liked the decor/ambience. Our fried calamari appetizer was pretty good. However when it came to main course, we had ordered a snapper special which we did not like at all! Could not even attempt to eat it. It was fried and cold with nothing asian/thai about it. We asked if there was any way possible to change the dish and were told that if it was just because we didn't like it they couldn't do anything. I understand that they couldn't cancel the entire item. I mean at the end of the day Snapper fish are expensive. Then again though as the customer who didn't even touch it a small courtesy discount or something at the end would have been appreciated. It's the whole point of being in the service industry.", "author": "K S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "Two words..Massaman Curry.  Went to Joya while visiting because it was close and it made it on my list to go to again before I left.  Definetly a place i will return to each and every time i am in NYC", "author": "Cory S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "When I lived in Brooklyn I ate here lots! Great every time!...especially for the price!", "author": "Tamitra T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "I am astounded that every time that I visit(mostly during evenings), it is fully packed in here.  And I mean sardines in a can!  But to escape popularity and crowded, my fiancee and I came by on an uneventful Saturday and secured ourselves a table for two without needing reservation, since it was lunch time, around 1 pm or so.  No need to wait, and plenty of room to find seating.  It was an interesting decor of exposed brick, fancy somewhat odd or refined taste art.  The waitress and waiters are very friendly and accommodating.  I got the pad see yew(not sure if I'm spelling it right) which was flat rice noodles mixed with leaves of basil and pieces of steak(a bit chewy) covered in roasted peanuts which were the best part.  Another time, that I went here, I ordered the pad thai which was delicious with a tart from lemon juice, sweet with a soy sauce taste, and very tasty. I like this place and love their prices.  I always get their Thai iced tea which is strong, iced, and has heavy rich condensed milk.   I would definitely come back.  =)", "author": "Polly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-07", "description": "I would have given them 5 stars if they didn't  jip me on my to go box. The took out all the meat and gave me not nearly a fraction of what I had left on my plate in a tiny to go box. Other than that great food and friendly people.", "author": "Jurrell H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "I love this place and probably get take out here a little too often.  My boyfriend seems to know everyone by name here, and they even gave us free delivery once when we were waiting in an ER because they felt bad for us. Talk about a real neighborhood joint!\n\nHighlights include: Cheap prices, tasty classic Thai food-for-Americans dishes, good cocktails, and a nice backyard dining area\nDrawbacks: Inside seating area is a little frantic and crowded", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "This Restaurant was recommended to us. We love Thai good so we decided to try it for lunch. My food was amazing, I got the red curry. My husband  also ordered the red curry, but they brought him something else. When we asked the waiter about it he told my husband he didn't order the red curry \u0026 walked away. No apology, he didn't even ask us if he wanted order something else. The wrong meal the waiter brought was nasty. Yuk! We were not happy with the customer service at all. I wish I could have given this place a more positive review.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Best thai food in the neighborhood. Pad See Ew, calamari, mango salad were all great", "author": "GUY W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-15", "description": "I LOVE IT! Great portions and great flavor! We had the shrimp, scallops and broccili pad thai and the beef asparagus with masamun cury over pad thai noodles. The thai iced tea was also really good and had a different spice quality to it than the thai iced tea here on the west coast. Next time I'm in NY I'm making the trip out for some more JOYA!", "author": "Charlie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-17", "description": "Amazing food, amazing service, and amazing prices. Exactly how a restaurant should be. I love Joya", "author": "Santiago R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "Incredible, Fantastic, Terrific...Just Great!!! With an almost Cult following Glen and Andrew the owners are just as passionate about their business as their customers. They have created the best secret in Brooklyn.Awesome Thai food , fast service and wonderful atmosphere...you wont believe the prices....\n\nJust look for the blue Lights and the crowds of people trying to get in.", "author": "Waleed A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "In this Economy...\n\nCame to Joya on a late Sunday afternoon.\n\nFirst impression, the decor of this place is trendy and very Brooklyn. Its got red brick walls on one end and old fashion fans on the ceiling juxtapose with the modern bar.\n\nThe portion of the food is BIG! The quality of the food is so so....but I would say good for your wallet...\n\nThey also have a nice back area. I would recommend this place for group outings!!", "author": "Michael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "win win.  good food and good prices + good crowd and cool vibe. great choice for some yummy food. great choice to go with a group albeit sometimes too loud to hear your friends and a long wait at times. either way don't think you will be disappointed.", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-12", "description": "Joya is a great Thai place for when you want something quick and cheap. I always go for my standard spicy noodles with chicken/shrimp and it is soo yummy. Its sister restaurant National is really good as well. Only con- cash only.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-21", "description": "While this place has certainly gotten a lot more crowded over the years, it's because it's that good.  Several times I've had the owner come by the table to make sure everything is great, despite the business.\n\nIn the summertime, try to grab a spot on the back patio. This pretty much always has a wait, but it's really nice.\n\nEvery time I go back to NY, Joya is on my list of places to eat.", "author": "Nina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-11", "description": "This place is absolutely amazing and every time  I have been, the food is consistent, fresh, and tasty. Only once when I went late on a Saturday night was it a bit chaotic and they forgot the flat noodles for about 10 minutes. The portions are well sized and very well priced. I have tried everything from curries, to seafood, and appetizers and it has all been very good. If you want Thai and have no clue which one in the area is good, this one should be your best bet. Be warned that they only take cash though.", "author": "Sam C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-28", "description": "Went on Friday night. It's Monday morning and I'm still in pain. Ordered the squid in basil sauce as an entree, something I've had before and know I'm not allergic too. I'll spare you the details but Worst food poisoning in my life. My friend had a spicy noodle entree and he did not feel well the next day either. We split tiger shrimp rolls and calamari for apps. Tons of Thai in the area that not worth going here again.", "author": "E K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-13", "description": "So when two besties, need to catch up on their dinner and a movie haunts. U venture to a cool spot to just talk and EAT. So we were both feeling Thai, and kinda lazy on how far to go after an end of the week hang. First off, walked in and didn't realize that the seating situation was towards the back. We stood there for roughly 10 minutes, before staff even asked to assist. When we eventually did realize who the hostess was, he told us a 45 minute wait. So despite a crowded bar, we did order two drinks. We asked for a bar menu, bartender said there wasn't a menu and showed the bottles behind her. So my friend ordered two drinks, after 30 minutes, we did notice there were some tables that opened up. Mind you, we were there roughly 1.5 hours prior to closing. We watched the empty table go unassigned. Two stools, opened up at the bar and starving foodies ordered calamari(based on a hot order pass us by). The calamari was hot, and flaky. I love that it was not heavily breaded and you got quite a hefty serving for two. After waiting so long, and still not a peep from the hostess, we ordered at the bar. WHY? Well we overheard the bartender tell another female duo that the kitchen was closing soon. UMMM??? I guess we did not warrant the same notification. I ordered the spicy pork and pineapple fried rice, and my bestie ordered the spicy seafood rice. I have to say that both had heat, and the portion size, quite large. I have to say that Joya did have a cool Friday night vibe, with music playing in the background. But they lost points for me, for the lack of attention to the patrons.", "author": "Nicole N."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}