{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-19", "description": "I LOVE Joya. I've been back many, many times since I first discovered this gem over a year ago. With Joya, the food is always consistent and the staff is so friendly! The only thing hectic about it is that they don't that reservations and its cash only. Otherwise, its alll good. REALLY. Its ALL good. I love a bottle of pinot grigio, an order of the spicy noodle with shrimp :) Try it out -- this place is kinda amazing.", "author": "Ms. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-24", "description": "absolutely delicious. our favorite thai ever. the prices can not be beat. i hope they never raise them!? we travel from manhattan to brooklyn JUST.FOR.JOYA.", "author": "mare r."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-26", "description": "Try NO stars! This place is awful! And it's sad because it used to be good. That is NOT Thai food, people! It's slop!  The quality went way down. I think the owners realized it doesn't matter, people will still come.", "author": "Dee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "it's awesome and cheap, and very lively inside. we split the tom yum koong soup (perfectly balanced between sweet and spicy), the green curry with beef (outstanding, i wish i could drink the sauce) and the glass noodles with shrimp (very good but nothing to go crazy over). i will definitely be making the trek over there to try more!", "author": "Caryn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-14", "description": "Great food at a GREAT price.  Joya is a go-to for free/very fast delivery and cheap eats.  When the weather is nice they have a great patio (with unfortunately small tables).  While there is often a wait for tables of four or more it is definitely worth it.  However, the inside can be loud with music and the kitchen.  I really like this place -- just wish the music was a little bit softer.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-24", "description": "We just got delivery from here after not having had Joya in some time. It was terrible. The Spicy Squid Salad was nothing more than lukewarm, rubbery squid pieces, barely dressed, atop wilted romaine... not a single chili or fresh herb in sight. The Panang Curry with Beef was mostly soggy overcooked green bell peppers, with a few pieces of tough-as-nails beef if you looked hard enough, and there wasn't a hint of spice (and only 1 limp lime leaf that had obviously been frozen). The summer roll came pre-cut and sauced, which made for a soggy, sticky mess, and it was also flavorless, again no fresh herbs to be found. The Spicy Noodles were ALMOST passable, although again, spicy is a misnomer here. The worst offense of all, however, is the fact that they sent us a takeout box full of overcooked, flavorless, PLAIN WHITE RICE!!! If you are a Thai restaurant, you serve Jasmine rice. There is no excuse for that at all. Never again. When are we going to get a decent Thai restaurant in the neighborhood? We don't need 100 terrible ones.", "author": "Todd C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "This place is very nice and the food is good. You feel like you are eating in a nice restaurant, but almost all of the entrees are under $10!", "author": "S K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-25", "description": "this is the best delivery thai we ever had!!! and it was so quick! the food is exquisite and full of flavor. everything is super fresh and definitely just-cooked, not reheated. and it's cheap too! from now on we will only order from Joya!!", "author": "Anastasia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-30", "description": "i have been eating at joya for about 4 and a half years now , its located right in the heart of the neighborhood i grew up in as a child and i must say the thai food there is very good. i like going back because its familiar. the only let down is that it always seems to be packed here , but i suppose its because the food is good and not expensive.", "author": "tara t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-16", "description": "It's true that Joya is often very crowded at night (though pleasantly quiet at lunchtime) and you might have to wait a long time in the tiny, packed front area to sit down, and once you do it might be so loud that you have a difficult time carrying on a group conversation, and your waiter might bring you out a bottle of white wine that has conspicuously not been chilled. But all of these minor inconveniences seem almost endearing given that this place offers one of the most absolutely delicious dishes that I have ever tasted. I never even was a particular fan of pad see ew before I went to this place, but now I fantasize about Joya's chicken pad see ew more often than I would like to admit... the noodles are just the perfect flavor and texture and consistency and taste especially amazing when the dish has just come out from the kitchen and is so hot that you almost burn your mouth. I have tried wholly unsuccessfully to replicate the joy of Joya's pad see ew at other Thai restaurants. It's very cheap, too, especially given the posh (if slightly overwhelming) atmosphere.", "author": "Emily W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "cheap Thai in a nice setting.  very good.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-06", "description": "Best Thai!  Everything from the curry dishes, to appetizers, to the noodle dishes are amazing...and very reasonably priced.  The wait for a table can be a little long, but delivery is very prompt.  They don't list mussels on their regular menu, but they are usually a daily special and really good!", "author": "Heidi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-21", "description": "o.m.g. the food here was so yummy. service was a little slow (reason it's not five stars), but the food was fantastic, and the space is cute and roomy. and most menu items are between 6.95-7.50, which is awesome. and portions are ample.\n\nwe had the calamari, which was not greasy at all and the small was easily split among three people. they don't have a drinks menu, but they have a full bar so we opted for some white russians which were fine. i got the vegetarian red curry and it was one of the better ones i've tried out here - spicier than red curry usually is, with a good variety of vegetables, and very tasty. i tried my husband's spicy noodles with shrimp and it was delicious - not at all greasy, and the chili basil sauce, though not that spicy, was really good. all in all, it was a win and we will definitely be back.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "best thai in this hood. food is cheap, but the atmosphere feels more expensive. always a crowd.", "author": "Brenna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-04", "description": "YUMMY! pretty much all I have to say is Pad Thai See Yu.. (hunt me down if I am wrong) Is the most scrumcious food I have ever tasted. I am making myself really hungry and think I might have to go Thai tongiht =)", "author": "susu y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-22", "description": "Amazing \u0026 cheap Thai food. Expect to wait a really long time (around 2 hours on a Fri/Sat night) to get a table, but as soon as you order, your food comes out super fast. If you live nearby, takeout is the best option, delivery is really quick and the food is just as good. We tried the pad see ew, yellow curry, summer \u0026 spring rolls, and veggie/tofu stirfry. All really tasty!", "author": "Jen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "every time i am in the area, i love to go to this spot. while not super authentic thai, it is de-li-cious. and, a plate is around 7 bucks. hard to beat a better than decent dinner, in a cute garden, for under $10. skip the weekend evenings, it gets way too crowded.", "author": "Mackinnon W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-19", "description": "food is just alright at joya. i think its hyped because of the atmosphere rather than the food. if you are hungry and want to eat right away do not go here. anytime after 6pm the wait for 2 people is about 45mins to an hour. i just dont understand how and why people wait. its just ok. the fried calamari is tasteless. lots of vegetarian options which is good and i must say their veggie spring rolls are good. it has some curry spice in it.", "author": "A E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-13", "description": "great food .. the best fried calamari.. will def go back", "author": "Erik A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}