{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "It's defenitely the most decent Thai place in the area... nothing special though. Will probably go back when have a craving for chili sause:)", "author": "Maria F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "Excellent thai food.  The Pad See Yew is the best I've ever had.  Great atmosphere and friendly, attentive service.  Knocked off one star for service that is \"too fast\".  We ordered and got our dinner 5 minutes later.  Not bad if in a rush, but too quick if on a date.", "author": "Sam E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "We ordered: pad see yu, pad thai, spicy pineapple and pork fried rice, tiger shrimp rolls, masaman curry, mango sticky rice for dessert and all were amazing. Tom yum was okay. We went with kind of a large group, and the vibe was a bit hectic. It was pretty noisy on a Friday night so it was hard to communicate. However, the service was great, the prices just right, and we would go back.", "author": "S. A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-15", "description": "The place is bleh. There's no hostess to greet you when you get in, you're supposed to somehow figure out to \"sign in\" for a table from some dude who's in the middle of the restaurant answering the phone. Once you \"sign in\" you have to travel all the way back to the entrance of the restaurant to wait. Ordered spring rolls and a pad thai, standard dishes. Both were terrible. Spring rolls were stuffed with some mushy concoction of noodles with a terrible texture. Pad thai was drenched in some awful sauce that reeked of vinegar and came with massive chunks of tofu that were way too chewy. The kicker was when it came time to pay - they only take cash.", "author": "Richard A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-29", "description": "Fantstic Restaurant. The food is great, very affordable for large portions. Actually, for the price, i thought that we would have gotten really tiny portions, but they were really huge. The servers were not very nice, the music is way to loud, and there is generally a wait. But i think it is worth it.", "author": "Aimee A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-18", "description": "I really wanted to like Joya and unfortunately will not be returning anytime soon.  The layout of the restaurant couldn't be more chaotic in that it's completely crowded with no designated host area to check in at.  It doesn't help that the host is completely rude and is chatting with friends ad nauseum as you stand there, practically tripping over other diners, waiting to be acknowledged.  He finally said \"yeah?\" to us rudely after ignoring us for a solid few minutes and then told us it would be a 25-minute wait.  It was a 40-minute wait.  We were lucky to get seats at the bar -- every single tap was empty except for ONE -- else we would have been trapped in the bizarre layout with all the other people being ignored by the host or bartender.\n\nOnce we were finally seated, our appetizers arrived immediately and our beers took a ton of time while mixed drinks were served to people next to us who had been seated after us.  The calamari was okay, but batter-heavy to the point where many pieces didn't even have ANY meat in them.  It was really just a plate of batter.  The vegetable spring rolls had some strange, unidentifiable flavor that dominated the entire roll (something mushroomy, maybe?).  The beef with garlic sauce was a plate of brown water that had no flavor.  The beef with red curry was decent, but not beyond anything at a standard Thai place.\n\nOverall, the experience was strange -- as if the only people actually served and treated well were friends with the host.  Won't be going back.", "author": "lucy l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "Love their prices. I always have the same thing. The half chicken, sticky rice and mango salad plate listed under the salad category. Large portions for only $8.99 any time of the day. Delicious, but since I have been having it for many years, I realize that it recently is not as flavorful as it used to be. Also,the music is really too loud so it makes it uncomfortable at times. But I still go back!", "author": "Gloria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "this is definitely one of my favorite restaurants. i literally order delivery from here at least 1x per week. the food is always great and the prices are extremely low.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "Having had and enjoyed their takeout, I decided to brave Joya on a Saturday night.  I put my name down for a two-top at around 8:30 pm and was told that there was a 45 minute wait.  Well, an hour and a half later, I was finally seated.  The bar with its tasty and affordable beers on tap made the wait significantly less trying, but seeing multiple tables stand vacant, set and ready to go, for up to 20 minutes did the opposite.\n\nThat said, the food here is delicious and so, so cheap-- a great value, and Joya definitely has a monopoly on the best tasting Thai on Court St.  The chicken satay, green papaya salad and summer rolls are sure to please, and you can never, ever go wrong with their pad thai.  Our food came out very quickly (if all at once, entrees and apps at the same time), but honestly with prices being so affordable and portions as delicious as they are generous, I can let those things slide a bit.  The decor is very nice and trendy as well, although the atmosphere is a bit boisterous and you probably wouldn't want to come here on a date because it can get very noisy and crowded.  Drop by instead with a group of friends for a fun and yummy night out before checking out the bars on Smith-- you won't be displeased.", "author": "Linnea N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "All this yelping is scaring me... I hope nothing ever changes about Joya.  I don't know how they make a spring roll so exciting.  Maybe it's the fact that you get two of them for $2.95.  Maybe it's the fact that you can identify all the veggies in them and they're FRESH like Will Smith circa 1991.  Maybe it's the sauce that I would drink straight up.  Oh - and nothing gets me like ordering a veggie dish -- \"and can I add tofu please?\" -- and then not seeing that obnoxious little \"+ tofu - $12\" on the bill.  I would wait in that line any day.", "author": "Reba G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-27", "description": "This place has GREAT food.  The prices are ridiculously fantastic as well.  My only complaint is the atmosphere.  I don't like feeling like I'm in a club while I'm eating.  It's hard to come here and be able to chat with friends.  What I prefer to do when I'm in the neighborhood is take food to go.  That being said, the food quality is great.  I haven't had anything I didn't like.", "author": "Leigh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "This is the sister restaurant to Song in Park Slope, so it's pretty much the same exact review. This is located in beautiful Carroll Gardens and the vibe here is a bit more trendy, as it's on restaurant row. The prices are still dirt cheap compared to its neighbors and I think they'll always keep that as part of their uniqueness. There's a charming outdoor seating area as well. The food is hands down the best Thai in BK.", "author": "Zinat M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-12", "description": "Best thai in town. You can't go wrong with the spring rolls. Only problem is a long wait.", "author": "Shaun A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "$70 00 + tips  for three, including  alcohol, it was fantastic   Authentic Thai,  a very good find!", "author": "Sam S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-04", "description": "It's trendy, and it's popular, but... why is everything soooooo salty? still, the price is good and the portion is large.  I have had better thai (and less salty thai), but for the price and atmosphere, I thought it was pretty okay.", "author": "Jonathan Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "I think we were pretty fortunate cuz we got there around 6pm on Saturday night \u0026 there were 8 of us. We got a table in less than 20 min, the food was like any other thai place (the calamari was chummy!) It was just a nice, dimmed place to eat \u0026 chill...not a place to talk deep or linger...wish it was in Manhattan but then its in nice nabe around Brooklyn Heights so I don't mind going out there (I think my roots are bit too deep in Manhattan, kakaka) My entr was similar to a chinese fried broad rice noodle, ahhaa, but its all good!", "author": "Kat L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-08", "description": "i love Joya!!!\n\nthis is mainly because its good and cheap.  its no where near being the best Thai food spot in NYC but best believe you can get a good meal (apps and entree) plus a few drink for like $25!!!  \n\nthe only down side is that the wait is just ridiculous!!!  the park slope location is as bad with wait time but be prepared for a 30-45 minute wait.", "author": "chichi n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-02", "description": "This is where the cool kids go to eat Thai and not hear what their friends are saying. It's pretty loud but hip and tasty. I ordered a duck special and it was fantastic but it's gone now...sigh...\nTake a date here if you don't like to talk and would rather just eat and stare at them.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "Pretty solid Thai food, the portions are huge, service is generally very snappy (once you are seated), the decor is pretty nice and modern. The prices are great: barely anything on the menu is more than $9. The inside is quite loud as the open kitchen is right there, but out back it's quieter (but with some awkward seating against the walls... the bench is a bit too high for the tables). Be prepared to wait a little if it's a weekend night.", "author": "Sean E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-24", "description": "Okay..I love Joya. I like it better than Song and for the most part, they  are similar. Perhaps it depends on who is cooking which night and I happen to luck out in Joya. You cannot beat their prices and the quality is simply great. I have not been disappointed yet.  I can rec. the pad Thai, the fried calamari, any drink - pretty cheap, Thai tea and most of their curries. You can ask for more or less spice if desired and they are happy to oblige.  I would suggest getting there early to secure a good spot. The place is smaller than Song, so the line of people waiting to be seated tends to reach some tables - that is the only annoying part. They also offer outside seating - plus.  Joya = great place at a great price.", "author": "C K."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}