{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "I love this place! I go once every two weeks when I am in the city. It is in a great neighborhood. This is just great especially their fried calamari which I also get everytime I am there. Also their Thai iced tea is awesome!", "author": "Christina J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-20", "description": "Okay, my love affair with Joya has cooled a bit. Two things: 1.) They never answer their phone, or you get a busy signal when you call, forcing you to call back repeatedly for about 20 minutes before getting through or giving up, and 2.) The food is hit-or-miss much of the time. Like, one night the woon sen will be light and stir-fried to perfection and overflowing with delicious veggies and meat...and then the next time it will be super heavy and dripping with grease and scanty on the veggies and meat and just generally sort of bad.\n\nWe still call them when we're up for a night of sodium-induced unquenchable thirst, but there's other comparable Thai in the neighborhood...and most of the other restaurants answer their phone, too.\n\nStill pretty okay but not as good as it could be.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "Joya=Thai place with a DJ. \n\nFor the Thai food, it gets 5 stars, it was almost a perfect representation of what I've eaten in Thailand, except for the portion sizes (bigger of course).\nFor the DJ, it gets -1. No offense to the DJ, he was a good DJ, there is just something unsettling about listening to loud house music while I'm eating. \nThe Kang Panang Gai is my favorite, it's extremely spicey-hot. A delicious Fire in your mouth. My husband (heehe) had the Pad See Yue and it was very delicious as well (not spicy). \n\nPrices are excellent.", "author": "Cassandra W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-18", "description": "This place used to be my go to place for Spicy Noodles. I still remember that heavy hit of basil I used to get from this place. I was here for dinner tonight and the place was packed. I ordered the same dish and all I can taste was the heavy seasoning (just a bit more than I'm used to). My mother ordered the beef Pad See Yue and I snagged a bite from her plate. Her beef was on the tougher side but flavor was spot on. After the dinner, she kept chugging glasses of water. I also felt the need to drink after her complaint. It could be placebo effect, or it could be MSG. Maybe the chefs had a bad day. Sister had the Pad Thai and that was fine. I would go back but only for their lunch.", "author": "Kenneth L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "Great Thai Food! The food was delicious... large portion and very tasty. The environment is very lay back. I had a few cosmopolitans to drink and they were very delicious too. \n\nThe prices are very affordable. I'm definitely a fan.", "author": "N D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "This the best Thai food I have ever had!  It's often extremely crowded, but well worth the wait.  The prices are good.  They have a cute outdoor space.  I go here every time I'm in Brooklyn.", "author": "Mary Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-27", "description": "Great and cheap (but crowded)\n\nIf you want your red curry Thai hot, they make it Thai hot...so make sure you know what you're getting into before you ask.\n\nThey have all the chiles a Thai restaurant is supposed to have \n   (Many Thai restaurants don't.).\n\nWhy they automatically offer chopsticks is something I'll never know.   Thai people normally reserve chopsticks for eating noodles, but I can get over that.\n\nThey have a cool DJ booth.\n\nThe outdoor eating space in the back seats 25 or so and is a real treat in the summertime.\n\nIn short, I love the place, and would highly recommend it.\n\nOh...and Brooklyn is the better borough!", "author": "Tony M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "Fantastic, fresh, thai food.  The flavors and menu items are really good.  Everything is made to order so it comes out incredibly fresh.  The food is not greasy, like other thai restaurants.  The atmosphere is very modern and trendy.  The open kitchen is fun to watch.  Try it, very good restaurant.", "author": "Ryan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "Having eaten at dozens of Thai restaurants across the country, I can say without hesitation that Joya is the best.\n\nThe food is amazing, the prices make it one of the best deals in Brooklyn, the wine list is affordable, the service is exceptional, and the atmosphere is perfect.\n\nIf I had to take someone from out of town to one restaurant, it would be Joya.", "author": "Danny D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-10", "description": "Pretty packed here on a Monday night. Atmosphere is dim and loud, they should have a hostess in the front here to seat people because the crowds at the bar waiting for a table block the waiters from seeing new diners come in. \n\nThe mussels tasted light and it was a bit above average sized portion. Spring rolls were generously stuffed with vegetables and they had a very thin skin, which I loved. I ordered the spicy seafood fried rice and it was on point. Mild spice with lots of shrimp, not too much grease. Tom yum soup wasnt memorable, I've definetly had better.\n\nThe prices are pretty reasonable, but in the end......Sripraphai in Woodside is still #1 in my book. Its just seasoned better and tastes more authentic.", "author": "Edna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "Great Thai food. Good portions. Accommodating staff. Courteous management. Owners recognizes my girlfriend and I. Treats us like VIP! Always warm welcome. Nice vibe. Cool spot for casual dates. Front has a bar. Fast service.", "author": "AL W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-12", "description": "Hard to believe this was my first time eating at Joya in all my years living in the 718. We arrived before 6:30pm and were surprised that the place was packed-okay it was Saturday but I have a theory: Now that it is after daylight savings time it gets dark and people don't know what the hell to do with themselves so they go eat.\n\nAt the bar we sampled a yummy pinot and were seated int he next 15-20 minutes. My friend ordered some apps from the specials menu-chive cakes (we share an obsession with scallion pancakes and i think the hope was these would be similar) She got green curry I opted for a salad and the pad see yew. I would have expected a salad with less iceberg type lettuce but I ate a  lot of it because I needed some roughage (a-hem) the spicy vinagarette was spicy indeed and there was a bit too much dressing. The pad see yew arrived and I could tell immediately it was a teeny bit burnt and oh so greasy. Burnt is not so good but greasy can be kind of delicious in its own way.\n\nThe prices are pretty cheap which is an upside. I would go back but not expecting to be blown away", "author": "Eve S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-01", "description": "Been eating here for over 10 years whenever I'm in the area....and it never disappoints! Such consistently tasty food and the prices are so reasonable for the serving sizes. Love their phad-see-yew. Mmm I can taste it now!", "author": "Rhee-views R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-03", "description": "be prepared to lose your hearing, and feel rushed while you enjoy some good food.\nreally cheap, pretty good food.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-08", "description": "As soon as we paid we were literally kicked out. The hostess was standing at our table with menus staring us down, waiting to seat new patrons-the table hadn't even been cleared! Guess this is what keeps their prices low...all cash and fast turn arounds! Really rude! It was very disapppinting, my friend and I were just trying to take our out a very good girlfriend before she moved away.  Really embarrassing to talk a place up and then be treated rudely. Food is always excellent, but clearly avoid Saturday and busy times.", "author": "Elaine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Great thai, ambiance and prices if you happen to be in the area.", "author": "George G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-10", "description": "Joya has great food and really great prices.  I have a few quibbles with the place, thus only 4 stars, but I'm mostly a big fan.\n\nThe food here is really good.  Though not the BEST I have ever had, it's up high on the list.  I especially love the Pad See Yu.  Their fusion dishes are definitely worth a try.  Delivery is always prompt.\n\nBecause it's right near Smith Street, the place is a hipster death trap on the weekends.  Don't bother going unless you want to wait for at least 30 minutes.  Also, it gets LOUD, crowded, and unpleasent at these times, even by NYC standards.\n\nJoya's delivery schedule is erratic.  I guess they only have 1 delivery guy?  So when he's not on duty, no delivery.  V. annoying.\n\nThe good far outweighs the bad, though.  Try this place if you like Thai, it's worth it.", "author": "Tempest B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-13", "description": "The food and service are great. You'll find the best Calamari ever  at Joya. I mean THE BEST,!!!!  Food never goes wrong, great outdoor setting for summer.. BUT (there's always a but  yeah), the decor and ambiance are really terribly bad. You'll honestly feel like you're in a dungeon and being tortured by the dj and cooks. It's too dark inside, and too loud for its size. \nFYI, they only take cash.\nDaiana Noel", "author": "Daiana N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-20", "description": "Thai food, having recently ousted Japanese food for the king of trendy Asian cuisine, is a delicacy that when prepared adequately can bring limitless pleasure. However, when it fails, well, makes you bitter 'cause you wanted delicious Thai food.\n\nJoya is an amazing restaurant. If you don't like Joya, chances are you don't like Thai food because you're a racist. Everything on the menu happens to be delicious and affordable. Additionally, the portions are very generous. As a fat person, generous portions are what I look for in a restaurant, and it's only a bonus that Joya happens to be delicious as well. Try the large fried calamari, it's huge, cheap, and delicious (incidentally, how I like my women). Did I mention it's cheap? 'cause it is.\n\nThe atmosphere there is fun. I happen to like loud, blaring house music because if there's one thing I hate when eating out, it's being able to hear other people chew. God, I hate that. So, on a weekend, don't worry, Joya's ambiance will drown out your lover's cacophonous chewing. Oh, and the delivery's fantastic, too, 'cause sometimes leaving the house is too dangerous.", "author": "Dan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "When I use to live in Cobble Hill, this place opened across the street from me.  Most restaurants in New York open and have loads of people come the first month or so and then it tapers out after everyone has tried it.  Joya has been around for a good 10 years and the crowds have never let up since their opening night and for good reason.  \n\nIf you want a place that has a nice (low lights) look, it's perfect for a date or friends night out.  They have gone through periods of DJ's and not but regardless the place is always jumping.  Nothing on the menu (and it is a miracle it has remained this way since they opened) costs more than 7.95!  (Almost to find a place this hot in New York with this low prices and great atmosphere is unheard of!)  \n\nI've gotten to know the owners over the years and could not meet a nicer bunch of guys.  The food is top rate Thai.  There is nothing on the menu I could complain about.  Personal favorites are the Spicy Noodles with chicken.  Mango salad (and I'm not a salad lover but this one is great!)  And - you will see a one page list of 'specials' that is handed to you when you sit down.  (Note: the 'specials' prices are higher than the menu's nothing more than 7.95 price - but well worth it and mostly in the 13.95 range).  I personally love their Skirt Steak (which always seems to be on their 'specials' page cooked with various Thai style veggies).  \n\nIf I had to say anything critical it would be that - at times it feels almost 'rushed' to clear your food and have you on your way.  Given the high volume of people each night (Monday nights can be as crowded as Saturday nights) it's understandable why they need to keep the turn over going.  It's not exactly the place where you can sit and talk for a while after dinner (unless you do so at their bar which in itself is a great spot to hang.)  \n\nThe white wine is cheap and good and after such a fun night of incredibly good food - and dining - you'll feel like you just left a party and can't wait to go back again.  Hence - the crowds - but you'll love being a part of it.  (Note:  if you are not in Cobble Hill and find yourself in Park Slope - go to their sister restaurant called SONG - same owners - same menu policy - same great food - slightly less appealing lighting (florescent strip lighting on walls) but all the same great crowds, fun and fantastically deliciously cheap food!)\n\nUpdate:  They now have a another restaurant in Fort Green called \"National\".  Same as everything above except the space itself is much smaller.  I forgot to mention that all 3 restaurants offer outdoor seating - nice in the warmer months!", "author": "Brion D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}