{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "This was my first time visiting Brooklyn and I picked this Thai restaurant for a quick lunch. When I entered, I was quite impressed by its interior, elegant and tidy. I was seated in their cute backyard and enjoyed a lot of sunshine.\nI ordered Tom Kha (coconut soup with shrimp). It tasted good, not too sour like most Thai places do. Pad see ew is my favorite Thai dish and theirs was really good. It had a large portion and was very fresh and tasty. What's more, the bill came out only $10! I was very satisfied with the food and the price!", "author": "Yaran S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-23", "description": "Just came here and was so disappointed. I've been coming here for years and now, they have changed their food's flavor profile to mostly sweet and salty. No spiciness whatsoever when we order something specifically called \"spicy squid noodles.\" Thai food is supposed to be spicy. \n\nAlso, multiple bowls of rice and their fried rice was cooked totally wrong. It was hard and disgusting.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Amazing food! I don't live in Brooklyn so I'm not familiar with this place, but my cousin lives around the corner and says the food is always really good.... I shared an appetizer with him and it was fried shrimp with a good sauce on the side. \n\nI ordered a dish and it had chicken and I think potatoes, with a coconut curry sauce. It wasn't spicy and it wasn't too sweet. I ate the whole thing, and it was a good sized bowl with rice on a separate plate. There was a lot of the curry sauce and the consistency was like a broth. I just took the spoon and a lot of the sauce on it as well as the chicken and ate it that way. I guess you could put the rice in the bowl and eat it like more of a soup if you wanted. My cousin ordered noodles with beef and some vegetables. The noodles weren't in the classic spaghetti shape. I could've eaten his plate too. \n\nIf you're going to have wine, you're better off ordering a bottle instead of by the glass if you want a couple glasses. Also, we called to make a reservation and since they were so busy they said we had to come in and put a name on the list and wait there. Very very busy but obviously for a reason. The wait was worth it, but it's just something to keep in mind. Maybe they take reservations over the phone when it's less busy. Definitely looking forward to eating from here again.", "author": "Martina D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "I have been to this restaurant plenty of times. And yes it does tend to be crowded however if a place has amazing food it expected right!! I love they're food.", "author": "Shanette B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-08", "description": "Outdoor space is romantic and cozy. Indoor space is chic and modern. Relatively cheap prices, but 'ain't no good if the food's no good.'\n\nFood was meh.  We ordered the chicken pad thai - way too sweet, had trouble finishing it. The chicken was cooked well though, but I'm assuming they froze their chicken so that it doesn't get overcooked. \n\nThe other dish Nuur Kraprow was utterly disappointing - not spicy despite the \"chili basil sauce\", beef was overcooked to a point that it was inedible. See attached picture that pretty much sums up the dish.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "I frequent this resturant when I have a craving for good Thai Fusion food. The food is consistent ad flavourful. My only issue some times is over seasoning and saltier food but most of the time offers a well balanced seasoning profile with out the addition of lots of fish sauce a big plus for my taste buds.\n\nAlways welcoming . always clean . always consistent.\n\ntheir soups do not make the mark but the noodles are always great. typical order will land you about 10$ good value for money.\n\nSCORE\n\nFlavour: 4 \nPresentation: 4\nAuthenticity: 3\nPortions: 5\nCleanliness: 5\nSpeed of Service: 5\nValue for Money:5", "author": "Umer A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "I love joya. The food is cheap and the drinks are good. I'm pretty sure they're cash only, though. I wish they had other kinds of red wine by the glass. We ordered mojitos and they were very good, not too sweet. My boyfriend and I ordered the fried calamari. It came with a sweet sauce that had hot pepper flakes, which gave it a bit of a kick. It was delicious. We shared the spicy noodles with chicken and a beef stir fry dish with vegetables in a chili basil sauce. The noodles were amazing! They weren't too spicy. The other beef dish was also delicious. I loved the variety of vegetables and it just had so much flavor. Overall, joya is a great place for dinner with drinks.", "author": "Jeanine Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-20", "description": "Not worth the money. Really dismal food.  I should have known better.  This neighborhood lacks decent Thai food.  The picture you see was exactly what I saw when opening the container.  Dry stringy white meat chicken, under cooked green beans in a watery curry sauce for $9.25.  Who's laughing?  Joya, because they don't care.", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Really good Thai food and reasonable priced. Recommend going and trying out the food. There was a wait, maybe like 10 to 15 min but it was worth it. Their Thai iced tea was delicious. \nI recommend the spicy noodles if you love spicy food. \nGood service as well!", "author": "Ana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Favorite place to go, when you in a mood for Thai food. Great service, great atmosphere. Food is always on top, never disappointed. Drinks are good too. Would recommend this place to anyone who loves Thai food", "author": "Olivia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "First time here, I really enjoyed my experience. Staff was very friendly and welcoming. I tried a multitude of appetizers and they were all good, really enjoyed the Spare Ribs, Calamari and the BBQ Wings special. My meal was great too. Very intimate setting will be coming back here. (Good date place for sure )", "author": "Craig J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "Go if you like Thai food\n\nPros: the entrees are good ( pad thai, curry must try).  The flavor are on the stronger side, but definitely one of the great thai food in brooklyn.  Atmosphere are good, have candles on the table, as well as good music.  Also great backyard seating for the summer time.\n\nCons: ingredients is not the best. You can both see and taste that the ingredients are not the freshest. \n\n-A", "author": "Andy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Really fun atmosphere and decent quality/pretty standard Thai food. We had a bottle of wine with dinner and enjoyed the spare ribs followed by drunken noodles. \n\nThey have an extensive menu with a lot of specials. Will be back to try more.", "author": "Natasha I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "service was very good and servers were kind, friendly and all the food tasted fresh..\nGood food, location, decor, service, as well as inexpensive! All the good reviews that everyone posts are true", "author": "Alen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Came Thursday evening for table of 4. Same great taste. I ordered the chicken pad see yue as usual and friends got the chicken pad Thai. Chicken was soft! Friends loved the Thai iced tea too. Our waiter was courteous along with the rest of the staff who greeted us when we came in and as we left. We sat for around 15 extra minutes after paying and they didn't shoo us away which was a plus. Customer service was a lot better compared to previous visit. They already placed water on our table and occasionally poured for us too - this may seem nothing to most people but this is due to a past encounter here with an annoyed waitress fetching us water.", "author": "Jamie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "Ate here last night. Wouldn't say it's the best Thai food ever, but wouldn't say it's the worst. The meal was decent, food was cheap (under $12 for dinner), and staff was nice. All the ingredients for an adequate experience, but no \"wow\" factor. \n\nGiving it four stars instead of three because I did enjoy the fact that you can get a variety of spices (including chili peppers in fish sauce) on the side to add a bit more of a kick. The decor is also super cool. Really liked the lighting fixtures.", "author": "Sana A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-25", "description": "The bf brought me and another friend here to finally give this place a try. His brother who was from Hong Kong wanted to try here years ago when visiting, but the wait just too long then, so they ended up having dinner in some restaurant across the street. The bf remembers the restaurant by the blue lights since it is pretty hard to spot the name of the restaurant on the streets. \n\nWe arrived at the restaurant around 8pm on a Saturday night and we were told there would be a 30 minutes wait, which sounded pretty reasonable for a weekend dinner in that neighborhood. There is a bar where people sat while waiting for tables just like the restaurants in the city.The waiting area isn't spacious enough for that many people, including families with baby carriages.... \n\nAnyways, we waited about 45 minutes for a table. \n\n\nHere was what we ordered: \n\n1) TOM KA (coconut soup with chicken, shrimp or tofu, broccoli and carrots) - we expected the texture of the soup to be a bit thicker...\n2) TOM YUM (hot and sour soup with chicken, shrimp or tofu, mushrooms, cabbage and onions) - it did not meet our expectation at all. It was not sour or spicy enough for a traditional Tom Yum. \n3) CHICKEN CURRY PUFFS (chicken and potatoes in a pastry shell) - Tasted alright, but is potatoes inside of the puffs supposed to be cold?! We could only assume these curry puffs were heated up by a microwave before being served to us.\n\nTHEN WE WAITED FOR AT LEAST 30 MINUTES FOR OUR ENTREES. \n\n4) Grilled Skirt Steak with Sauteed Chinese Broccoli in a Red Curry Paste - VERY SALTY. Couldn't really taste much of the curry paste. If we didn't order it off the special menu, I wouldn't even know that we were eating curry. \n5) Sliced Fried Duck Breast with Vegetables in a Red Coconut Curry over Pad Thai Noodles - Again, we could not taste the curry, wouldn't have known that we were eating curry if we didn't have the menu. Coconut? - could have been more coconut-y. And the lamb? It was kind of rough compared to my liking. Pad Thai Noodles? - Best thing to eat during this whole meal! (Amen!) \n6) Fried Whole Red Snapper with Mixed Vegetables in a Spicy Green Coconut Curry Sauce - Again? Was this curry that we ordered? and Coconut? - not enough. Spicy?!?! - Maybe they forgot to add the spice? The red snapper was fried, but didn't have enough sauce over it. It was just not what we all had expected. \n7) Thai Iced Tea - way toooooo sweet! \n\n\nComments:\nIf you ask why I don't have pictures of our foods this time, it was because none of us felt that any of the dishes deserve their pictures to be taken. The dinner wasted our time, waiting for a table, and then waiting for our foods, it really took a lot out of us. We finished our foods so that we wouldn't waste it, nevertheless, none of us enjoyed the dinner that night. Everyone left the restaurant so tired and so stressed out. What a great disappointment. \n\nIf you're looking to have some good and comforting Thai foods, I would have gone elsewhere. Perhaps it was much better in Joya years agoooo, but definitely not anymore. \n\nGood luck.", "author": "Lilian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Arrived at Joya one Thursday afternoon for lunch with my wife and family and it was a great time. This restaurant is great especially the back yard patio that I wish I got to take advantage of but it ed a bit cold that day. Lunch was delicious and service was excellent. This is a great date spot for couples and the prices are very doable.", "author": "Brock S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-05", "description": "When you think of Thai food, it's really hard to mess up.  I came here on a rainy Saturday night and it was pretty packed.  The atmosphere is similar to another Thai establishment-Song.  The place is dimly lit and has candles and a flower on the table, making it a good place for a romantic date.\n\nI had:\n\nThai Ice tea: it was pretty good, a little too much ice\nShrimp pad thai: they were too heavy on the tamarind sauce\nMango salad: the mangoes were not even ripe\nShrimp green curry: the curry sauce was amazing, the shrimp didn't seem fresh, tasted kind of funny, the rice was bad, it was hard and tasted like overnight rice\n\nService was okay, the lady was walking back and forth a lot.\n\nPrices are okay, most entrees under $10.", "author": "Bakchun K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "This place is usually a good time. My favorite dish is the drunk noddles with shrimp and I get it with extra egg and no vegetables. The calamari is also pretty good here. Everything is very reasonably priced and the quality of the food makes it a great place. The staff are also very friendly and helpful which is hard to find now in days.", "author": "Julie M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}