{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "When it comes to Joya, I'm rather boring. It's beef pad see ew and thai spare ribs every time. This place is good, cheap and they have some badass Thai gangsters in the kitchen stunnin' with blue tinted sunglasses.\n\nMy only qualms? Almost always crowded. And unless the owner is there, there's a rather bitchy queen manning the front who seems a bit too self-absorbed to pay attention to who's where on the list. Also, why are the take out portions so much smaller than the dine in portions? Seems a little suspicious to me... I would get up off the couch and go complain to someone if I weren't so grossly full. Oh well, there's always next time.", "author": "Alison C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "I really love Joya, I have no idea how they do it (volume I'm guessing), the prices are so low and the quality is very good.  I do find the spring rolls to be a little less than interesting, the veggie ones are just glass noodles!  No veggies at all!  And EXTREMELY oily.  They need to blot some of that before serving.  Most everything I have had here has been great, I especially like the fried calamari, pad see yue and the green coconut curry sauce.   I do find the specials are actually the weakest on the menu, the crispy duck we had before was bready and soggy and we had ordered a pumpkin appetizer that was undercooked, very hard. \n\nI never realized how big the backyard space, basically doubles their seating and it's nice back there, I prefer that to being on a sidewalk with ppl walking by and gawking at you! \n\nService is perfunctory and quick.  This is not a place where the staff even tries to pretend to give a shit about your day, its more about turning tables, but that's fine, I don't dine out to bore waitstaff with my life, that's what my companions are for!", "author": "sasha y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "Great food, great price. Can't go wrong, EXCEPT the long wait that you can expect on Thurs-sat nights. Otherwise an awesome place- you cannot go wrong with the mussels in broth!\nEnjoy!\n\nAlso- no Credit. Bring cash!", "author": "Gary B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-10", "description": "This place looks attractive from the outside but the overall experience was not as exciting as previously reviewed. We ordered a pad thai that was too greasy and mushy. The salmon and curry was okay. The  place is cozy though. They should get rid of the cheap paper tables cloths.", "author": "Daniel T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-31", "description": "Joys used to be just that - a joy of a restaurant.  Flavorful Thai food at reasonable prices.  But about a year ago something changed in the kitchen - for the worse.\n\nThe paad thai was once a staple - the glassine noodles were firm, tasty and infused with flavor.  Now they resemble the typical congealed glop of most Thai takeout joints.\n\nThe fried calamari was once crisp and light.  Now the fried crust is sodden with oil.\n\nThe ribs were once tender, chewy and fall off the bone delicious.  Now they are tough and the quality of the meat seems to have dropped off.\n\nThis used to be a staple for delivery or a quick and cheap meal.  What a  shame to see the quality drop so dramatically.", "author": "O U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-28", "description": "Spicy seafood fried rice is excellent.\n\nFried rice. Excellent choice everytime.\n\nSpicy pork and pineapple. All day long.\n\nThis place has NEVER done wrong by me.  \n\nOnly come if you like good food.", "author": "Mat H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-06", "description": "I think Joya is ok, the food is good, i think it could be better- they use a lot of fish sauce, but anyway the worst part is the lines and the annoying loud music inside- I dont want to go def I dont want to be in a club I want to eat my dinner...\n\nBut as far as food, its pretty solid, its good.", "author": "Caterina M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "Incredibly rude. Put the phone down on me without confirming my order, name, the total for the order, or payment requirements (cash only for delivery), leaving me unsure whether my order actually went through. I spent 15mins trying to get through again to confirm the order, and when I finally did get through, the hostess was dismissive and made no apology. I get that you're busy, but learn some common courtesy. I'll take my business elsewhere", "author": "Toby H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "Huge portions of delicious Thai food.  Fresh ingredients.  Good flavor.  Cheap drinks.  Why don't you accept credit cards?\n\nThis place is so cheap.  My friend and I both got entrees and split a bottle of wine.  $22 each WITH tax and tip.\n\nWill definitely be back if in the neighborhood!", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "I liked it. It was ok. They do Thai with their own twist. You can see and hear the food being cooked in front or back of you (depending on where you sit). The food was very quick and tasty. No complaints on the service. Atmosphere was ok but a bit too busy...nothing to go crazy about. I would recommend it if in the area for Thai but it is not like i am running back there. I ordered the calamari and the pad thai which was solid.", "author": "Carl L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "This place is always busy because the food is good, the portions are big and the price is cheap! Totally worth the wait.\n\nI haven't found another Thai place I like as much as Joya. I just moved out of Brooklyn, and I crave the food here! \n\nIf you order wine, you get a huge glass, but otherwise the drinks are just as expensive as the meals, and on the weak side.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-28", "description": "I ate here with a friend and the appetizer we chose was the  \"BBQ Thai Wings \". They were the best damn wings I've had in a while. I wish they were a main dish.\n\nI then had the seafood and noodle soup (with shrimp and squid) which was good. The squid was a bit tough to chew but other than that, good soup.\n\nI forgot the dish my friend ordered. All I remember is it was a curry dish. I tried a bit of it and found it weird tasting. To me anyway.\n\nI'd eat here again if I was in the neighborhood.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-30", "description": "I walked in and the place had a ton of energy. I've never been to a thai restaurant with so much energy and such a good vibe. The place was very inviting and the hosts/manager were friendly. I couldnt believe how reasonably priced everything was (probably because it's cash only). I had a curry which was delicious and not too heavy. The mango salad was delicious and they put a good amount of items in the salad.", "author": "Lori G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-25", "description": "You know, Thai is not tops for me.  I think maybe because in NY I have just never found great, great Thai \u0026 It all blends together.  Kin Shop, Kittichai, even Sriprapri, all fine, but not like making me rethink giving up burgers to focus more of my meals on Thai food.  But Joya is pretty perfect for what it needs to be  - same prices and mainstay dishes as the 1,000 other cheap Thai places around, but it does those basic things better.  Proteins are fresh, noodles are just the right amount of chewy.  Curries don't lie about levels of heat and depth of flavor.\n\nIt's really good,typical neighborhood Thai \u0026 anyone would be lucky to have this as their around-the-corner takeout joint.  It's definitely a cut above \u0026 I come back again \u0026 again.  Service is a bit slow or too rushed, can't find a good rhythm.  I don't really care, I'm here for the above-average pad see ew.", "author": "Talia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "the place has great food, at super cheap prices.... so expect to wait a while for a table on the weekends..... it seems its a good date place, for cheap guys to take their dates...hahaha... \nDrinks are a good  and service is great.\n\nIf your date takes you there..then u know hes cheap but has a good palate...lol", "author": "Olena P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-06", "description": "The food is undeniably good at Joya. Last time we tried a special appetizer (a curried puff), green curry, and one of the chicken + veggies in garlic sauce dishes. Don't ask me to remember which one, because there are at least a half dozen that have some combination of protein+veggie+garlic sauce. Luckily, even though we can never remember which one is which, they all taste good. They also make a killer Thai iced coffee--helllooo delicious condensed milk!\n\nThe only reason I didn't get them 5 stars?\nThe weird club-y/smoky atmosphere on weekend nights. \nIf I want to dance, I'll go to an ACTUAL CLUB. Or heck, even a bar with space will do.\n\nWhen I want to eat tasty thai food and have a nice chat with my husband, having crazy loud music blaring away and people crowding around the bar is kind of weird. \nI don't mind the crowding and bar in theory-just while I'm trying to inhale my food. \n\nBasically, I wish they would buy some space and expand so that I can eat my food with a little less jostling and noise. Or, I'm just going to switch to all takeout!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "Okay I went here on a Saturday night with a friend for dinner. \n\nThe Good: The food was definitely tasty. Although my Woon Sen was overcooked. The dish was great even the day after when I ate the left overs. My friend enjoyed his dish which were the flat noodles with beef and broccoli in brown sauce. \n\nThe Bad: The resturant was packed but that was to be expected on a saturday night Derr . But we had to damn near trip our waiter to get him to stop. The customer service was not up to par. There were long periods when the waiter was no were to be found...I mean dont chase me down later if you get a poor tip or no tip at all..You have to work for that. It's just that simple\n\nThe Ugly: Back to my friend's food. He later confessed to me that he enjoyed his food however he could not finish it due to a leaky ceiling. It was a rainy saturday so we expected to have a good dinner and some shelter from the rain NOT to be rained on in the damn resturant. When we couldnt take it anymore we moved the table over a few feet and it was all good FOR ABOUT 10 MINS! The ceiling was leaking again. At that point my friend saw a drop fall right into his plate... he was over the whole situation threw his fork down and said that it was time to go. \n\nThe only thing they brought really quick was the check!\n\nI will try Joya again...the atmosphere was busy and trendy however NYC is filled with many better options for Thai food sans the leaky ceilings.", "author": "Lish N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-25", "description": "I use to come here a bit more a couple years back and it was awesome...I went back a few weeks ago and I was a bit disappointed...I think some of it has to do with eating so much \"Room Service\" in Hell's Kitchen that I've been spoiled with my Thai food.... The food here isn't bad, just isn't want i'm looking for these days...", "author": "Nicholas R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-04", "description": "A fine Thai option in the neighborhood almost identical menu to Song in Park Slope.  Fast service and fair pricing.  Cash only.  The fried calamari was lacking salt and flavor.  A big menu with lots of options and I really like their soups.", "author": "Alice E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-26", "description": "Nice little Thai spot. Food is really good and inexpensive. They don't take credit/debit cards only cash.", "author": "Jemise W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}