{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "We dine here all the time...it seems to be the sister restaurant to Song in Park Slope.  The food is simple and good...and the prices are excellent.  Only downside for me is that they only take cash, and I'm the debit card QUEEN.  All in all though, it's a great place to eat.", "author": "Kerry E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-08", "description": "The food is pretty good, but the price points are what keep me coming back. You can't go wrong when a dinner for two including one appetizer usually costs less than $20. The only thing is that it gets crazy packed on the weekends and their phone lines are constantly busy. When that happens, I go to Ghang thai. Joya is not THAT good so I won't wait, and will pay the extra dollar or two for chicken with red curry.", "author": "M. P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "The food is good.  Service is fast.  The only downside is the wait for the tabe during the weekends.  Ohh, and they accept only cash.", "author": "Sheindel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-01", "description": "Went back with a group of 5.  Drank, gorged, and still loved me the Joya.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-06", "description": "Andrew \u0026 Ariel run the best restaurant ever.\nWe've been to many a thai place throughout the East and West coasts\nand hands down this is the best\nDoes it get crowded?, sure, but doesn't any place that's got a thang going on?\nAlso there is no sign on the front, sorta tells you something of how cool it is.\nFrom an architecutural standpoint, it's just a nice open space to be in, restaurant or not.\nLofty ceilings, exposed brick, everchanging artists on the walls, tastefull darker colors, polished concrete floor, creative lighting, outdoor deck, glass and metal walls, bathrooms, DJ, Bar, their  minimalist asian style just oozes hip city living. (crap I wish we could live inside)\nIn fact, they provided a lot of inspiration for our own brownstone rennovation project.\nWe sorta have juice there, so never wait too long for a seat\nTip, If you go there on the weekends and if it is crowded there are a gazillion other restaurants w/in a stone's throw\nWhen the weather is right, there's a nice outdoor seating area (and glass/metal wall so you can see the inside) that can hold a lot more poeple\nDelivery? I think it's Sun thru Thu, if you can even get thru on the phone, with all the background noise from the yuppies with the fancy glasses, dj, bar and open cooking going on.\nTruth is I think they deliver to be nice, they surely dont need the extra business\nFoodwise, Consistent fresh, good food.\nThe price is super low for what you get, they could double their prices and there would still be just as busy, but that isn't what they are about.\nAhh, we're in SF now, but we miss this place dearly, there will never be a replacement, love you guys\nG \u0026 S", "author": "G K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-19", "description": "Average at best. All about the scene. Prices are appropriately cheap for the quality of food.", "author": "Pavel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "So far the cheapest food I've had in Brooklyn. Two dishes and an appetizer: $25. Who cares that I couldn't hear my companion--this meal was a-rockin' and the check softly knockin'. Try the calamari.", "author": "Patrick G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-16", "description": "Great Thai food at a very reasonable price! I had some chicken with vegetables in a ginger sauce that was perfect. The Pad See Ewe was also good, although we might order it without the brocolli next time if they let us.\n\nThe environment is load, as they have up-tempo energetic music playing, although there were not very many people there on the sunday afternoon when we visited.\n\nDishes were about $7-$8 each. With water to drink, we spent about $10/person.", "author": "Isaac D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "This is some great thai food - great atmosphere, CHEAP (I paid $7 for the chicken pad see ew - pretty large portion), and the food came out incredibly quickly. Great spot if you're looking for some quick and tasty Thai food.", "author": "Tim N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "I love the food here! The drinks are tasty and the food is awesome. You can not beat the price and amount of food you get. Live DJ on weekends.", "author": "Jazmine D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-07", "description": "It's not that Joya is so, so good. Because while it's good, it is certainly not outstanding. It's just that Joya has got a great atmosphere and even better prices. But let's not fool ourselves. Pad thai is pad thai. If you put it in a dimly lit room with attractive Brooklynites, sure enough, people will come. Oh yes, they will come.", "author": "Lindsay K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-30", "description": "This is a great spot. Very very affordable thai food with a great ambiance. The portions are big enough or left overs and their drinks are pretty inexpensive. I had the half chicken mango salad for lunch for lunch the first time and the chicken was great. The mango was a little bit unripe but still had flavor. This time I ordered the shrimp pad thai and after adding some extra spice was very content. I would definitely hit this spot up again if I'm in the area looking for thai.", "author": "Anneka W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-18", "description": "Wow!  The food at Joya is fabulous.  The great tasting dishes, the large portions and low prices entice us to come here frequently. \n     The pad thai here is the BEST in this city!  I also love the spicy squid salad.  There are so many really low priced, daily fresh fish specials, that it is often hard to choose a dish.  \n    The service is quick and very efficient.  The owners Andrew and Ariel are most welcoming and appear to be friends with everybody in the neighborhood.The garden is a lovely place to dine when the weather is warm.  The restaurant is cozy and there are always beautiful flower arrangements on the bar.\n      I am so spoiled by the food here that I usually refuse when asked to go to other Thais in the city.", "author": "Felice S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "Delicious, cheap and out-of-control portions! I've never been to Thailand (I'm working on that) so I have no idea how authentic Joya's food is, but what I do know is that it is very, very tasty and the quality-to-price-to-quantity ratio is excellent. Weekday evenings are pretty chill and it's easy to get a table--weekends can be a bit off the hook with the djs and the crowds and the noise, so be prepared for a scene.", "author": "M T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "Wait wait wait ... they deliver!? Oh, thank god. I thought they didn't. Now I don't have to go back there to enjoy their awesome menu. I've eaten there a few times now and there's no rhyme or reason as to when it'll be crowded. So far, it's just always crowded. And loud. And it's not that the service is BAD, it's that it's just not very available. The food, however, makes Joya worth it. It's really reasonably priced. Their specials are great, typically. I had a green curry recently that was tangy and spicy and made me want to lick the bowl. Pad Kee Mow (great), lobster mango summer rolls (pretty good) and their ingredients are all top rate. Now that I know they deliver, I'm adding another star.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-23", "description": "Here is the thing.. this place is a conundrum... and let me tell you why.. the food is banging.. a phrase I do not throw out there lightly.. or often.. but.. I feel as though the owners of Joya had a debate, whether to open a \"hip, trendy\" club.  Or an amazing Thai restaurant, and thus they decided to combine the two.  There is a a dj spinning when you walk in the place.. uhh... on a Monday.  I mean I might be old, (although i think i am on the younger spectrum of the cobble hill residents).  But this atmosphere is very of putting to me...\nThat said. I gave the place five stars, because hands down the food is the best Thai I've ever had.  I usually get the spicy noodle, which as advertised actually have vegetables in them, unlike other  Thai places that consider one or two pieces of broccoli spicy noodles with vegetables.  \nI've been to that place in queens that all the foodies love... and this place, despite their identity confusion, blows them out of the water!\n\noh yea.. and they are dirt... dirt cheap!", "author": "Jess N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-14", "description": "From \"WOW\" to \"Meh...\"\n\nJoya is a block away from my apartment.  My family and I have been loyal patrons and avid supporters for years.  We probably ate there or ordered from there more than 100 times.  It used to be always great food at amazingly affordable prices.   Last 4-5 times it's been mediocre at best (and I'll spare you the details).  First 2-3 times I brushed it off, but by now I'm sure it is no coincidence.  They either changed chef, ownership, or just grown too complacent given their huge success these past years.   Last night's order was the last for me, until I hear differently from you guys.  What a loss... any great recommendation in the Court X Warren St. area?", "author": "Abraham S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "This is my favorite thai restaurant. All dishes are flavorful, fresh and inexpensive. They also have a bar and a DJ that plays live music at nights. I prefer to come here in the early evening hours to avoid massive crowds, noise and long waiting lines to be seated.", "author": "YumyTummy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-27", "description": "Joya has consistently tasty Thai food with quick service (once you actually get a table) and the prices can't be beat.  Try the mango salad - usually on the specials menu - it's big enough that I usually split it w/3 people, and I am a big fan of the spicy noodles.  It's a lot of food at a great price, but be prepared to wait for a table after 630 / 7 pm even on a weeknight.  The outside garden seating is great in warmer weather.", "author": "Hanna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "I found this place only because I asked a very friendly Brooklynite about a restaurant she lived above...  response - \"run away as fast as you can!  If it is good food you want this italian place is NOT where you want to be.\"  \"The best food around here is a hip Thai joint around the corner called Joya.\"  \n\nArmed with her strong recommendation, I trekked around the corner and 2 blocks down.  I was seated almost immediately and had to massage my neck from the whipping around as I soaked in all the dishes that were being served around me.  This hip and yet quaint place (though pretty loud) was packed at 7pm on a Monday night!  I came in with high expectations and was not disappointed.  The food is inexpensive and hands down one of the top 5 Thai spots in the city (sorry folks - but I consider Brooklyn apart of the city).\n\nThai style Mussels were amazing.  And what yelpers have written about the portions are on point.  The portions were massive.  My date and I ordered 1 appetizer and 2 entrees (spicy noodles and skirt steak).  We had 1 appetizer and took home about half of each entree.  I don't typically do leftovers but I will make an exception for Joya.  \n\nI only gave 4 stars because I had to run across the street to pay money to pull out cash from an ATM to pay the bill (what's with not taking plastic?)\n\nTo the random Cali transplant in Brooklyn - THANK YOU FOR THIS AWESOME FIND!", "author": "Peter K."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}