{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-05", "description": "If you enjoy having flies (yes, more than one!) go into your food while eating then this is the place for you! Seriously gross.", "author": "Carolina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-12", "description": "OK food, not OK service. Out of 4 (simple) orders, one was wrong. Not a big deal but then we waited forever for the right one. By the time the right order came, our food was gone (or let it go cold?). They didn't take the price off (fine) but then at the end of the night the waiter gave himself a 10$ tip from my change (really??). Annoyingly, I miscounted my money at first and still left him a tip. Mistakes happen, but that's a lot of mistakes by one waiter in one night. I have to admit it was a frustrating enough experience that, with all the great food around, I'm not sure I would go back. Side note - we were one of maybe 6 or 7 tables that had people at them, so a busy night isn't an excuse.", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "My standard is slightly lower for this part of Brooklyn, so 4 stars seems about right.\n\nThere are seriously limited fooding options in the area, which is unfortunate seeing as how I spend the majority of my waking hours going to school in this area. However, I was glad to find Joya on this cute street. Tucked inside the cold industrial exterior is probably one of the better lunch spots around.\n\nNot crowded at all during a prime lunch hour. No lunch specials, but everything is decently priced anyway. My large portion of pad see ew was ~$7.50.\n\nService isn't great (it took us awhile to get the check), but I do appreciate that the interior and ambiance is different from the uber-trendy Thai places in Manhattan. The exposed brick wall and simple decor is nice, and you won't have to sit through strange techno music here.\n\n**CASH ONLY**", "author": "Alice C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-22", "description": "I ordered the chicken and vegetables in garlic sauce. It just looked like they drowned everything in garlic sauce before they brought it out to me. The chicken looked very sappy (like how fingers look when you've been in a pool/shower for too long) . It tasted ok , slightly salty but i could not finish it. It was TOO wet if that makes any sense lol. The cranberry juice is very sweet, it tasted like cranberry cocktail with loads of sugar packets. Im too young to develop diabetes, i will not be returning.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-26", "description": "Rude staff and the curry (that I've been eating since childhood) made me actually vomit. Much better Thai options nearby (HopHap). Thai food is actually my favorite, and this place came highly recommended so that surprised me.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "Best Thai food, always reasonable prices. Good service. Just slightly loud.", "author": "Kensi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-22", "description": "My favorite Thai place anywhere.\n\nSeriously guys, stop complaining....what more could you want.  This place is dirt cheap and the food is delicious.  I usually start off with either the vegetable spring rolls or the thai spare ribs appetizer.  The spare ribs are absolutely delicious.  And the sauce must have some sort of awesomely wrong secret ingredient because I've often wanted to douse myself in it.  It is so good.\n\nFor entrees I usually get either the Pad See Yue or Koong Krawpow, both of which are delicious and have amazing portions.\n\nTheir garden in the back is beautiful and the inside space is really great too.  As far as the food and atmosphere go, I really can't think of any complaints.\n\nIt is really annoying that they're cash only, but you get used to it.\n\nAs for the service, get over it.  It's average 8 dollars an entree.  Sure they're not very attentive, but I could care less as long as the food and prices stay the same.", "author": "Charlis F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-05", "description": "I order Joya whenever I have a cold and want some comfort food :)  I must say that out of all the Thai places I've been to in the neighborhood, they are the most generous when it comes to portions.  The food hits the spot \u0026 also the prices are unbeatable.  The delivery has always been fast as well (About 30 mins or less).", "author": "K C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "Joya is perfect if you're looking for tasty, cheap Thai food - and quick. I used to live down the street from Joya. I'd call them to place an order for my favorite tofu green curry. By the time I'd bundled up for the cold and walked to the restaurant, my order would be waiting for me. Even in warm weather when I didn't lose time to bundling up, I rarely have had to wait longer than about 5 minutes if I had called in the order and walked over straight away. \n\nThe green curry is deliciously spicy and flavorful. I'm a bit of a spice wimp, so those of you who love love love spice may not find it spicy enough. The portion seems big as I have a hard time finishing the entire serving of green curry and rice in one meal. It even gets more deliciously spicy upon reheating! \n\nJoya seems like quite the scene on weekends. Every time I walk by during a weekend dinner, it's PACKED with people. Love the full bar, but wish they took credit cards. Full bar and cash only don't seem to work well together.", "author": "Kelsey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "Joya is cheap and SLAMMIN'! Brought one of my friends here after seeing such rave reviews on yelp. Even the special menu had some good prices. He had the skirt steak and I had salmon. Both DELISH! BEWARE: CASH ONLY!!!!!! It is now my go-to spot", "author": "Jessica J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-25", "description": "I've never actually eaten in the restaurant, but I've ordered carry-out and delivery plenty of times now.  This is the best Thai restaurant in the area that I've tried, and conveniently, it's also the cheapest!  I love the pad thai and the fried rice and the curries.  Never had anything bad here, and they are super quick (impressive given they are so busy, like, all the time).  And best of all, they deliver to south Brooklyn Heights even though it's quite a hike.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-13", "description": "I honestly did not really like it. I thought the staff was okay and the food was just not up to par to other restaurants I have been too. The outside patio seating area is nice and the vibe from the dim lights and restaurants were good just don't think I would go back and spend money on there food. I do have to say other people with me liked it but for me it wasn't all so great.", "author": "Adam P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Recently went out to Joya for a nice Thursday afternoon lunch with my girlfriend and a couple buddies. Well, 441 yelpers can't be wrong, the 4 star rating is well deserved. Really cool atmosphere, especially the outdoor seating all the way to the back. Perfect for a few beers and a delicious plate of PadThai or Spicey Noodles. Between 4 people we had 8 beers, 3 small apps, and 4 entrees and the whole bill didn't touch 9. Very impressed by the food and prices. Service wasn't great, but I'm not one to condemn a good restaurant for averagely friendly service. Definitely coming back.", "author": "Matthew V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "NOTE: I am NOT an expert in Thai food. I can't tell you if the food is authentic or not, only if it tastes good. \n\nI have been to this restaurant many times and I have seen it change over time. The atmosphere is very trendy with music playing and various picture frames on the wall. Everyone from graphic tees to blazers are welcome there. There is a full bar and the bartender can make a decent Gin Tonic and Mojito. There is usually a wait of a half hour after 5pm. The food portions have decreased over the years. Used to have to take food home now it seems to be an average size portion. Despite the change in portion size the food is still delicious. Fried calamari is lightly battered and comes with deliciously sweet dipping sauce. I would even buy extra at the end of dinner to take home. The spring roll is very light and flaky. The entrees are equally delicious. The pineapple fried rice was very tasty with the mixture of walnuts and pineapples made the dish very savory. The curry dishes were delicious as well. WARNING green curry is spicy RED curry is FIRE. The curry was well complimented with the assorted vegetables. All in all a great experience and I will be returning.", "author": "Richard P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "This is the other great Thai place in Cobble Hill.  The only real down side is it's cash only....  The food is spicy and well-flavored.  There's a decent wine list and the usual lineup of beers.  One standout thing is the specials: you almost can't go wrong.", "author": "Nathan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "I'm not a fan of Brooklyn but this area is nice!\n\nIn the mood for Thai food;this is the place to go! Great pricing but dont forget to bring cash only no credit cards accepted. It gets packed at night time so be prepared.\n\nAfter having a lovely dinner with friends or family you can go by the bridge with a loved one very romantic.", "author": "Sheena V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-14", "description": "Went once and the spicy noodles were mediocre at best. Maybe the place was talked up to me and then failed to meet my expectations or they just had an off night. Either way I love Thai food and I've had MUCH better anywhere else. I'll give them one more try but if it tends to be hit or miss it is definitely not worth it to me.\n\nUPDATE\n\nWent again and the food was still mediocre...nothing to write home about.\n\nWant really good Thai?? Check out Ghang Thai on Smith Street...now that's some good thai food! (especially if you like it spicy)", "author": "Dhaval T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "I live in Midtown, which means that I have to deal with really crappy overpriced food most of the time.  So maybe I'm reacting a little bit disproportionately here, but I thought that Joya was one of the best cheap Asian places I've found in NYC.  \n\nMy Brooklyn friend (yes, I'm jealous of your neighborhood--wanna trade?) told me that Joya was cheap and good, so I was expecting a grungy little place.  Surprisingly, Joya is a relatively classy restaurant with an open kitchen, a full, bar, and lots of natural light.  But the food is still dirt-cheap, with most of the noodle dishes coming in at around $7.  Can't beat that.\n\nI'm hopelessly hooked on the spicy noodles... perfectly charred flavor, if a little bit greasy.  We also chowed through chicken-avocado summer rolls, which were phenomenal, if of dubious authenticity.  \n\nAnd even the bathrooms were kind of charming.  Who knew that you could get a little bit of class with your $6.95 spicy Thai noodles?", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "I used to work near Joya and currently live not far from Joya. My ex-co-workers and I have probably have gotten food from Joya numerous times for dine-in and take-out during the day and during week nights. I really like the dimmed atmosphere at night and it is quite busy between Friday to Sunday evenings. As compared with other thai restaurants within Smith and Court Streets, I can tell you that Joya dominates as far as the amount of patrons, turnover, and price of food. I love Joya for the convenience, consistency, and the quantity of food for the price lower than all its competitors. Their foods are delicious but on the salty side. The service is hit and miss depending on how busy the place is. Ordering food on the phone is easy but not as helpful when you ask about substitution and other adjustments. The quality is on par but not the best. If you are looking for quality, I would recommend you going to Pok Pok or Kao Soy. SPICE on Smith and Warrent St is ok but I tend to stay away from chain restaurants if I am in South Brooklyn area. I have tried most of the food options on the menu and I like the skewered chickens and pai thai the most. Lastly, remember to bring CASH.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Best Thai in Brooklyn great food comes along with great prices places is always busy, especially on the weekends. I'd recommend anyone to this place you won't be disappointed.", "author": "Big D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}