{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-31", "description": "Ok so the food is amazing but the owners costumer service sucks. He wouldn't let me pack my own food and it's not my 1st time at the establishment. The 1st time I packed my own food. This to me was a big dill bcuz customer service is what the customer wants they get, period. I'm spending my money tf don't tell me I cnt pack my food to go home. Like I really wasn't  gonna b able to leave with my food if I didn't let them pack it like .", "author": "Spark A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "Came here for dinner with my boyfriend and it was average Thai food. The shrimp dumplings were good, the chicken spring rolls were alright, it was a bit dry. The chicken pad Thai was dry too. The chicken with jasmine rice special was really flavorful. The Thai iced tea was really good too. The service was great and the price was well worth it.", "author": "Lily F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Our most favorite Thai restaurant in NYC. It's very reasonably priced and food taste really good. I would say better than other high rated hyped restaurants.", "author": "Ferdous A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "Let me start with saying I have being spoiled by Somtum Der, which was recently awarded a one Michelin star, and all the other amazing Thai places in Manhattan (Kiin Thai eatery, Pinto, etc.). I have certain standard for Thai - basically just that I don't like bland Thai dishes. SO if my review sounds overly hash, do my a favor, go eat at Somtum Der. \n\nAfter watching a movie nearby, we did our research and decided to give this place a try. We got here around 6:30pm on a Saturday night, it was already pretty busy. Luckily a table was just leaving so we only had to wait for a little over 5min to be seated. We got the Thai spare ribs, spicy noodle with shrimp and pad thai with chicken. Thai spare ribs were very well flavored, meat was juicy and tender and fell right off the bone. \n\nUnfortunately, it just went downhill from there. My spicy noodle was a complete failure: (1) it was not spicy AT ALL, (2) it lacked the complex flavors from Thai dishes I'm used to, and (3) shrimp in there was definitely NOT fresh and it had certain ammonia after taste. To be fair, our waiter did ask whether I wanted spicy sauces, so I guess at least they acknowledge that \"spicy noodle\" was not spicy. Pad Thai, in comparison to spicy noodle, was better. Instead of being bland, it was overly vinegary. I've never tasted any Pad Thai being that sour. \n\nOnce again, not trying to sound like a snob, but this proves my theory that due to lack of competition in BK, I need to discount ratings by at least one star for a restaurant. In this particular case, a four-star Thai place in Cobble Hill is probably equivalent to a 2 star in Manhattan.\n\nThe positive? Two drinks, one appetizer and two entrees, the total bill with tip was less than $70. THAT is something Manhattan cannot compete with. But I'd rather pay up and enjoy something way better.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "The decor is industrial-chic with simple, clean lines - we loved Joya the moment we stepped in. I always judge an Asian restaurant by how it executes the pork, and was impressed by the tender, juicy and lean slices in my pad see ew. The BF loved his pad thai, and his chicken was just as tender. \n\nThe lunch prices are very reasonable, while the portion size is more dinner-like. I had plenty of leftover noodles to take home, but devoured all the yummy pork and leafy greens in one sitting, ha.", "author": "Amy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I loved this place!! From the food, to the location, to the decor, everything was amazing! You should know though that because of how popular this place is, some days may have a longer wait time (we waited about 40 minutes) to be seated so be prepared to wait! Sidebar you can wait by the bar and order some yummy drinks while you wait. I highly recommend the wine, mango mojito or the margarita to get your night started. (PS- these drinks are strong)\n\nWith that said: the food is to die for! Some highly recommended from my friends and I are the chicken curry puffs, fried calamari, and fried spring rolls as starters.\n\nThe chicken pad thai, grilled skirt steak and mango salad were absolutely delicious!", "author": "Lisenia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Prefix lunch is a great deal with well-portioned entree. The selection is quite large with plenty of noodle dishes and curries to choose from! The food was fantastic, flavors were intensive and it hits the spot!", "author": "Ye T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Living in the Gowanus area, this place has come to be my go to place for convenience, service, food selection and affordability. If you like Thai food well this place has to be on the top 3 you will have in Brooklyn or NYC for that matter. Service is very well, food selection is extensive with specials daily and alcohol choices are decent. For what you will pay I find it hard to beat from any other place close by. Hardly ever disappointed with their cooking. Just try to know what you want or are ordering to not be disappointed since the sauces and spices can have a kick that you might not enjoy.", "author": "Jared T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "I really enjoyed Joya.\n\nTo start, the ambiance, tables, lighting, etc. is great. This place is CLEAN and classy - perfect for date night. Or just any kind of nice dinner, I suppose.\n\nWe ordered a large order of calamari ($12) - the thai chili sauce it came with was delicious and the portion was huge. Unfortunately, the calamari itself wasn't the tastiest. It was a little on the chewy/tasteless side. But nonetheless, it was good for the price. And smothering the calamari in the yummy sauce helped.\n\nWe shared on thai iced tea - so good. The flavors were on point and it came in a large glass, so it was perfect for sharing. \n\nAs an entree, I ordered the Kang Masaman - chicken curry with zucchini, peppers, carrots. It came with a good portion of rice. It was spicy and hd a lot of flavors. I've never been a fan of cooked carrots, so I took those out, but everything else was good. I probably would not order this again, but I am happy I tried it. I have leftovers for dinner tomorrow night :)\n\nMy boyfriend enjoyed his entree as well - something with brown sauce, chili paste and shrimp. \n\nOur bill was about $44 with tip. Not bad. I look forward to coming back and trying some noodles.", "author": "Katharine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Solid good priced Thai food in cobble hill with super cute outdoor seating. Def would come back. Not the biggest menu for Thai food but it's definitely solid and if you want more ambiance, I would suggest it", "author": "Sacha-Avi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Joya why is your food so addictive without having MSG?  This is delicious THai, open modern setting, cooking in front of you.  No sign out front, but typically has a line.  Only downfall is cash only, and can get really loud at times, but prices, quality and speed are tops.", "author": "A W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "Great food but unfortunately horrible service.\nTwo friends and I came here on Saturday mid day for lunch/dinner. There was a large party of about 20 people and there were tables in the front of the restaurant empty and one table behind the large party. For some reason they sat us behind the large party which was very loud and cramped. We asked to be moved which wasn't a big deal what was, was our waitress who seemed to be bothered by waiting tables and had an attitude the whole time. She rushed us for our orders and didn't care to explain dishes we were unsure about. We ordered drinks an appetizer and our entree. Everything came out fine except for my friends entree which had a hair in it. We called over our waitress who then barely apologized and as she was about to walk away turned back which seemed to see if it were any of our hair on the dish. She came back pretty fast with a new dish. When we asked for the check nothing was mentioned and we were charged our normal bill with no apologies about what happened. It was an awkward situation to even have to ask if we could even get a discount for the troubles. The waitress rudely shrugged her shoulders and said \"well we gave you a new dish\" implying we should be happy about that. We asked to speak to a manager and that was when we were offered 10% off of our bill. Needless to say we will not be coming back here although the entree was tasty good service matters as well.", "author": "Becky G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Great place to eat and relax! Im big on prices BANG FOR MY BUCK and this gives it!!! i like that you can order things that might not be on the menu .. For example, i ordered the red coconut curry sauce with flat noodles which combines the rice sauce with the noodle medium!  Its only around $7-8 so for me, that's a bang for my buck! The calamari is pretty good here too. They offer two different sizes which is a great idea. Will def come again whenever Im in BK! \n\nThis is my favorite Thai place!!!", "author": "Christine Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-10", "description": "Joya was always a great meal choice if I wanted something affordable and tasty. There is a open layout, which includes an open kitchen and a cozy backyard space that takes you out of Brooklyn. \n\n-Fried calamari: bland with no seasoning in batter. The dipping sauce is the saver for this dish. \n\n-Tom yum soup: spicy but great! All the right flavors. However, the shrimp does not soak in the flavor of the soup. \n\n-Chicken fried rice: bland, squeezing lemon helps. \n\n-Spicy noodles: delicious especially after squeezing lemon onto it for added flavors. \n\nService is good. Sometimes getting your waitress' attention can be difficult. There is no cocktail menu and limited alcohol options. \n\nUnfortunately, after getting home and opening the box containing my leftovers I found a thick black hair mixed into my food, which is the reason for 2 stars instead of a 3.5/4 rating I would of liked to give.", "author": "Kavita C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "Came here a few months ago, the food was so delicious, and not too expensive. The restaurant was beautiful, I definitely plan on coming back", "author": "Al C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "The food is ok, tasty but nothing special. I had better thai food. The bar, the interior design and build out is nice, the outside garden sitting area is nice and the open kitchen is cool! Food was priced well.", "author": "Aric T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "This is special when you can do Thai in the afternoon eat real good Salmon, pad Thai noodles, mango salad or chicken soup! I'm happy:)", "author": "Robert J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Can we take a moment and analyze how reasonable the price is from Joya?! I LOVE THIS PLACE! \n\nNot only is their price cheap, but their portion is huge too! If only I live closer then I would no doubt come here EVERY SINGLE NIGHT.", "author": "Stacey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "I enjoyed my meal\n\nFor under $10, I ordered the coconut curry with chicken (one of the many listed; I think I had the manang one?). I'm a fan of coconut curries that are more milky and sweet vs spicy since this girl can't handle the kick. I was pretty hungry coming in so I devoured my dish real quick. My curry came with chicken, peanuts and potato. Super simple. So if you're looking for fancy with a variety of ingredients, maybe this dish isn't for you. But if you're craving a solid curry dish, I recommend this one. \n\nAlso, I'm glad I didn't have to wait as the restaurant was pretty full. \n\nOverall, I'd come back if I'm craving Thai curry but as a girl who has a lot more places bookmarked on Yelp, I don't think I'll have the intense NEED to come back asap but I would for sure come again some time.", "author": "Carissa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Even before I became a \"foodie\", I've been exposed to some of the top Thai Restaurants in NYC 'cause I lived in Woodside.  Places like Spicy Shallot, Sripraphai, and the great AYADA Thai.  \n\nIf it weren't for my Brooklyn-native girlfriend, I don't know if I'd ever come across what is now my favorite Thai Restaurant.  Fantastic venue in a beautiful neighborhood, friendly staff, and delicious food at a very affordable cost.\n\nFirst off, parking is plentiful, if you're commuting via public trans, the G/F station is a stroll away.  \n\nI was impressed the moment I walked in.   I almost felt like I should be dressed up to eat here.  The decor is hip \u0026 sophisticated, yet very simple.  Not many frills, a cool accent here and there which I really appreciated.  At the back of the restaurant, they've got the open kitchen which I always enjoy.  Not only does it express their confidence in their cleanliness, but it fills the room with an incredible aroma.  \n\nDid I mention they've got OUTDOOR SEATING!?  Though I don't typically enjoy dining outdoors in backyards because of mosquitos, I just couldn't pass on this opportunity.  You'll know what I'm talking about when you get there.  It's beautiful out there.\n\nFOOD!\n\n- Crispy Calamari ($7)\nA very solid app.  Crispiness done right and it came with a yummy sweet chili sauce.\n\n- Corn Fritter Cakes ($5 - 5 pieces) \nI was wow'd as soon as these came to the table.  They looked and tasted delicious!  Crispy on the outside, and fluffy on the inside.  Also, the sauce that came with it was crack!\n\n- 1/2 Chicken w/ sticky rice \u0026 mango salad ($10)\nA monster portion!  Perfectly roasted 1/2 chicken w/ some sort of curry rub, a deceivingly small portion of sticky rice \u0026 a heaping helping of mango salad.  This was not only filling, but packed with flavor.  Each bite produced a foodgasmic moan, there's no way this huge piece of chicken is THAT juicy.  I imagine that they made an extra effort to brine this thing over night.\n\n- Kang Masaman ($9)\nAgain, a huge portion of my favorite Thai Curry.  Presenting it in a beautiful bowl made the experience that much more enjoyable.\n\n- Beef Pad See Yue ($9)\nPerfectly cooked noodles w/ a delicious sauce.  The sauce was perfectly distributed throughout the dish leaving none of the noodles SAUCELESS.  The beef wasn't skimped and there wasn't too much scrambled egg in it.  Oh and... it was a huge portion.  No surprise there!\n\n- Thai Iced Tea ($3)\nNothing mindblowing here, but it was served in beautiful tall glass, and it was enough for my girlfriend and I to share.\n\nIt's honestly so hard to believe the price on the check because we've always left JOYA stuffed with food!  Thank you for existing, JOYA!", "author": "Glenn D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}