{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-05", "description": "It was okay. But just okay. I ordered vegetable panang this evening and wasn't sure what to expect after reading mixed Yelp reviews.\nThe food came fast, portions were huge, and it was pretty cheap.\nThe sauce was kind of thin, and my vegetables were waaaayyy overcooked. Not very spicy either. I'll most likely order from other places in the neighborhood before trying Joya again.", "author": "Casey M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-02", "description": "The one thing that does not change no matter what time of day you go is the place is always loud. Like scream across the table loud.  Also its so basic the food does not stand out. Its thai from a thai place thats it. The sweet chili sauce that comes with the under fried calamari is good. Also the duck and mango roll. Thats it.", "author": "Kareem S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-13", "description": "I picked this place for delivery based on yelp reviews, and really don't get what the big deal is.  First, I called several times throughout 30 min, and got a busy signal every time.  When it finally rang, I waited for literally about 20 rings before someone finally picked up.\n\nWhen I ordered, she almost hung up twice before I was done ordering - I wanted a drink, and to know the total.\n\nThe food: the salad was good-sized, but with the dressing were lighter.  Rama peanut sauce doesn't act like a good dressing for greens.  Yummy, but heavy.  I also ordered the Moo Kratiam, pork in a chili basil sauce with veggies.  Generally chili sauces are spicy, and this had absolutely NO spice at all.  Plus, the sauce was really watery.\n\nThe can of diet coke was delivered warm, and there were no utensils.  I'm staying in a hotel so that was a problem; I'm good with chopsticks, but salad is tough.\n\nNot bad, but nothing to write home about.  Maybe I just didn't order the right things.  2 stars = decent food, good value.", "author": "Rebecca T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "Well done Joya!!!!!!!!!!\n\nHaving dinner with  my husband.....\nOrdering Mojito..... OMG!!!! It was sooooo good and strong....\nSipping it with my salad and spring rolls....  delicious \nSO, by the time my noodles arrived .....\n1. I was drunk\n2. Get in fight with my lovely husband \n3. Finished my spicy noodles in 5 min\n4. Made a peace with him\n\nThank you Joya!!!!!", "author": "Maria G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "One of the better Thai restaurants I have visited. I ordered pad thai with chicken. Very flavorful and decently sized. We also ordered boneless ribs and chicken fried rice for the table. The rice was great and the ribs were ok. If I am ever back in this area, I would revisit.", "author": "G S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Has to be my favorite thai restaurant in brooklyn come here once a week always get the spicy noodles highly recommend it , place is super clean.", "author": "Daniel E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-26", "description": "I come here or their sister restaurant often for dinner (several times a month) as this is my go to thai spot.  However I came here last night and ordered the spicy noodles with pork- I should have known something was off.  The dish came out and the first thing I tasted was salt- then it all went downhill from there.  Few hours later and all day today and I have the worse case of food posioning I've had in years.  Joya you have lost a loyal customer.", "author": "Marina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "So as I work nearby, mostly all of my work crew orders take out from Joya at least 3 times a week. The same delivery guy is always greeted like family! (lol)\n\nI must say, I ordered the Fried Calamari and a chicken pad Thai, and boy was it mouth orgasmic! This was so delicious.\n\nI can't wait to continue to order more delicious food from them!", "author": "Beautiful Badass E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-07", "description": "I wasn't that joyful yesterday. I woke up extra refreshed due to daylight savings and was pretty excited to eat at Joya. Drove there at 11:45 am and whomp whomp it wasn't open. They don't have hours on the door so I figured they'd probably open at 12 or 12:30. That's ok, I'll get some coffee, do some shopping at CVS to kill some time. Come back at 12:30 and it's still closed. There's actually a guy cleaning the bar area but never makes eye contact with us while we try to figure out what time they open. We even call the restaurant but nobody picks up. Super hungry and frustrated at this point we ended up eating at another Thai restaurant a few doors down. \n\nWhat a disappointment. Why aren't their hours clearly posted?????", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "The food was so delicious  here I wish I lived closer to it. The service was excellent, as well - we never had to search for our waiter or ask for anything.  I'd highly recommend this place.", "author": "Giselle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "Joya is wonderful! Probably the best Pad Thai in the neighborhood. The tofu salad was very standard and it would be easier to eat if the tofu was sliced smaller. The red curry was delicious. Very fast delivery. Cash only.", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-25", "description": "Joya and Song are racist and discriminating towards  the minority . They are rude to customers ( if you are not white ) . They cater more to the white crowd . If only I could give them ZERO but with Yelp you have to give at least one . Service is very poor .", "author": "Megan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "This is my 2 nd fave Thai restaurant the food is always great especially their red curry spicy and creamy just the way I like it, they are always packed and never take credit cards a small price to pay for great food", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "visited once again and still AWESOME. The food is delicious and the spring rolls are legendary.", "author": "Jamie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "I really love Joya. Great service, great food, insanely low prices. The pad see yue and tom yum koong soup are my usual take out order, but I love the pad Thai, muscles. Fish dishes, I could go on and on. The folks at joya know their craft and they know it well. A top notch value in Brooklyn. If you love Thai then you have to go to Joya.", "author": "Dan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "Great food, great value,\nbut always overcrowded with long waits, hence only 4 out of 5\nGo early to beat the rush, like at 4m for dinner :(", "author": "Ken F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "Came to this restaurant with a fellow classmate. I told her that I liked Thai food and she recommended that this was the best Thai place that she has ever had.  I ordered the mango salad to begin which was very good. I decided on the spicy noodles. The portions are a very good size. I was not even able to finish all I just asked it to be wrapped up for work the next day. Service was quick the food came at a reasonable time. All in all it was a good experience I will definitely come back!!!", "author": "Mona W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-12", "description": "I loved my entree.  My dining companion not so much.  I will say that the service was terrific.  They removed an entree from our bill without being asked.  I'll return to give them another try!", "author": "S D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "it gets 5 stars because it's the most affordable and NICE and DELICIOUS restaurant out here. (will update if i find more)\nI ordered the green curry. It was just spicy enough with rich coconut milk and the curry blends with the vegetables and chicken very well! And it's less than 8 dollars + rice :) Love it for my student budget! and ambiance is also pretty trendy-like and fun.\n\nWill definitely go back to try all the different dishes that others mentioned! \n\nCASH ONLY!", "author": "Ai L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "Best Massaman and Red Curry I can find in the area. My boyfriend and I eat here a couple times a month at minimum. \n\nMy only complaint is a frequent busy signal when trying to call for delivery on weekends.", "author": "Meagan M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}