{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "So, this place has been reviewed by more people than my ex-girlfriend bedded, but whatever. I have something to add. I've been here a couple of times, and each visit was better than the last. Service is excellent, food is tasty and fresh, ambiance is definitely cool (although the DJ does sometimes blow) and I've spent more money at Starbucks getting coffee for four than I have on dinner for two at Joya. Now, for the centerpiece of this restaurant. The Tom Ka. Otherwise known as coconut soup. Now, I've had this soup at many other Thai places over the years, but this incarnation makes me feel all warm and cozy and young again, as if I'm suckling at my mothers teat. I mean, wow. Hearty, sweet, sour, mushrooms, coconut bits, lemongrass, peppers, tofu (or chicken) and this weird yet delicious root spice that I cant figure out. Wow. Really. Wow. Ok, thats the coconut soup. The Pad Thai, to die for. The duck rolls? Eh. The Papaya salad (papaya neek), excellent. I really cant complain about anything at this place, except that I don't want to eat here everyday and get fat(ter).", "author": "Isaac K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "I'm a big fan but the staff needs to be more socialable and on certain days you have towait but worth it. The price is great but needs work on there drinks. If you want greatthai food this Is the place to be full of flavor and portions are great as well.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "My biggest compliant about Joya was the wait .... and in actuality it was understood.. i did go 8 pm on a holiday. but that is the only complaint i have for Joya.The food was good service was fast and friendly ...and not to mention reasonably priced.  *I recommend the ribs... they were extremely flavorful ad tender.Spring Rolls were good also they curry puffs were light and buttery ummm umm good!!  I definitely will be making a second trip.", "author": "Andre F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Joya is my favorite restaurant, hands down.  My go to meal is the Tofu Pad See Ew (without the eggs- my preference).  Amazing.  I have tried this mean at other Thai restaurants and none have compared to Joya.  The prices are great, especially for the quality.  I love how you can see them cooking the food, takes away that little thought in your head about what the kitchen looks like.  I've heard complains about the delivery but every time I've had food delivered I've gotten through on the first call and the delivery was surprisingly very quick.", "author": "Lauren p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "Really good. And CHEAP.\n\nOur entire group of 5 ordered the Pad Thai and no joke it was on the table in 2 minutes on a moderately busy Tuesday night.\n\nSimple but pleasant decor.\n\nThe ONLY complaint I have is that I probably waited 20 minutes for the waiter to refill my water. Other than that great experience.", "author": "Mat B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "Delicious. Huge portions. Incredible food - best thai food I've ever had.", "author": "Aryeh N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-03", "description": "Came here expecting really good Thai food and it was only OK. I've had better thai food in the city. I got the pad kee mao and the tom yum koong. The noodles were mediocre... definitely not one of the best I've had. Really didn't understand the rave on this place. I like their decor and service was OK. OVERALL, like I said a few times already, Joya is OK.", "author": "Frances T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-30", "description": "A little bit of a wait, but some best Thai food I have ever had. Chicken Panang was fantastic.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-01", "description": "I've been back to Joya a few times, both dining in and for carry out, and the food just hasn't been up to par. The moo kraprow I had a few weeks ago was overcooked; the pork pieces were tough and dry. And the carry out tofu kraprow (I like what I like, okay?) was in a weaksauce if I've ever seen one. I've still heard that it's the best thai you can get in Cobble Hill, but I'm thinking I probably won't be back for a while.", "author": "Jessica E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-08", "description": "totally bourgeois... carroll gardens run off. \n\nbut good green curry with tofu and vegetables.\n\nok value for cheap and easy thai. go for take out.", "author": "emily ahn l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-24", "description": "Fantastic food, incredible prices, and good sized portions need i say more? No i don't think i do.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "Great cheap and sizably-portioned food.  Excellent value and a nice little nook out back.  Yes it is loud and bustling, but for 7 dollar entrees go cry me a river.  If this isn't a restaurant whose prices are perfectly timed I don't know what is.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "I love this place. Somehow, going there, I have never had to wait more than ten minutes (which was only once, the other times we were seated right away), and the food is always amazing. I'm a huge fan of the spicy noodles, though I don't really like the way they prepare their tofu (I get the one with tofu and veggies.) All the food is always very fresh, but it does not take long at all to come out. Their drink are also nice and strong. The best part about this place is that it is super cheap. You pay $7 for a pretty big portions of food. I recommend it.", "author": "Samantha N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-25", "description": "LOVE this place. Excellent food, always piping hot and plentifiul, excellent service, cold beer always, and cheap. If you haven't been, GO.  Prepare to wait about 20 minutes some evenings, but it's worth it.", "author": "rocky r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-27", "description": "This place is so overrated. I don't understand it. Service can be irritating and food is just bland. I've asked several times for spicy and it never has any spice at all. Last time I ordered the Pad See Ew it was swimming in oil and had no discernible flavor other than grease. Not worth it.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "*If you like getting where you need to go without ever getting lost, ride with John N.\n\nIt's quite possible that sitting in my head is a tiny man with a tiny laptop that is accessing mapquest 24 hours a day. Why do I say this? Because John N is never lost and he always finds what he is looking for. Case in point; Friday night after drinking only two vodkas (I was driving, and I'm responsible) at Mo and Craigs birthday party, Jayne, Gia, Andre, and I set out from lower Manhattan in search of Brooklyn Thai food. Joya was the choice. I've never been there, Gia and Andre have, but neither knew how to get there by car, and I thought Cobble Hill was the site of a battle in the American Revolution not a Brooklyn neighborhood. Of course that last part is a lie, John N is a borderline genius. Somehow, like a moth is drawn to a flame, we got there with almost no trouble at all. One slight detour at the Brooklyn bridge but other than that my superior driving skills once again proved, well, superior. Undeniable proof that John N is a walking Rand McNally. \n\nJoya has good food at good prices.", "author": "Bartholomew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-11", "description": "Thai food has always been my favorite cuisine, but I'm not a snob about it - I've never met Thai food I didn't like...until now. I just had take-out from Joya, and this was definitely the worst Thai food I've ever had. \n\nThe pad krapow (spicy beef with chili basil) had absolutely no basil in it and zero spiciness. The sauce tasted like a brown gravy my very-Caucasian family would make. Big chunks of carrots, together with the brown gravy - it reminded me more of Thanksgiving dinner than Thai food. I'm actually almost angry that they tried to pass this off as pad krapow when it is clearly NOT - it bore absolutely NO resemblance to any pad krapow I've ever had, either in Thailand or the US. \n\nThe som tom (papaya salad) was meh - lacking in flavor - needs some fish sauce maybe? And the pad see-ew gai was just ok.\n\nI do have to mention that I ate at Joya once before and it was fine that time - not excellent, but quite good. Maybe it was just so bad tonight because it was a crazy-busy Saturday? I don't know. I'll give Joya one more try - but definitely not on a weekend night.", "author": "Suzie Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "Great price. Awesome shrimp pad thai. I think the food here is not that authentic. It appears to be more catered to the locals.", "author": "Jude A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-05", "description": "Good, cheap, delicious Thai food!!  I have been on dates here, lunch breaks here, and out with friends here.  The wait has been a bit long on occasion but there was always room at the bar for us to wait.  Whenever I have Thai cravings in Brooklyn, I go here.", "author": "Leah D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-21", "description": "Slightly pretentious!  Gosh, am I at a club or out to dinner? Club, dinner, Club, dinner, couldn't tell.  Unless of course if you decide to eat outdoors in the very lovely garden.  Was that a bouncer?  Oh no that was the host....silly me for a second I almost thought he was going to deny me entry.  Did he hiss at me....biatch!   Might try it early on in the day, when I can sit outdoors and enjoy their delicious pad thai.", "author": "Wanda N."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}