{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "I live close to a Thai neighborhood in Queens but I still wish Joya is closer to me. I eat Thai food all the time and I have to say, Joya makes the best Americanized Thai food ever.\n\nBecause of jury duty, I was able to go to Joya, so far, 3 times this week. If it was next to the courtroom, I think I would gone to Joya even more!\n\nI went to Joya for lunch one day because we had a really long lunch break during jury duty. It is about a 15 minute brisk walk to Joya from the Brooklyn U.S. District Courthouse at Cadman Plaza East, according to Google Maps, it's .8 miles from the courthouse. \n\nI sat down and when the waitress gave me the menu...I didn't see a lunch menu, so I asked if there were lunch specials. She pointed to the menu and used her finger to indicate some of the items have lunch specials but she was not really specific!!!! I think she said the lunch entree includes a soup or salad. When she said this, I couldn't even comprehend what she was saying because she was mumbling. I could not tell if she said soup AND salad or soup OR salad. I found out the entree only comes with one or the other because I got only the soup. There was no other customers around so why is service so bad?!! They really need to print out some lunch special menus. The waitress didn't even mention how much the lunch special is. I didn't even know how much it was until the bill came, $10.02 including tax. Lunch service is haphazard. It's pretty annoying. \n\nThey are just lucky I love the food or I would never come back! \n\nI am not a person who even likes Pad Thai but I like it here. I've had the chicken and the tofu Pad Thai's at Joya and love both. \n\nI also had the Tom Ka soup with chicken which I loved. Next time I am going to try the Tom Ka with tofu. I am just not a fan of chicken in general but the chicken really doesn't add anything to the soup...matter of fact I thought it detracted from the soup. \n\nThe Woon Sen was okay. Nothing I would order again because the Pad Thai is a much better noodle dish...man, my mouth is watering as I write this review!\n\nMy jury duty adventures continue...", "author": "Sally W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "Never eat here with a large group of people they are not very welcoming. My first and last time in this place. The food was great\nbut management is horrible.", "author": "Say R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Came here on a busy Friday night but being on a solo date, I was able to nab a seat at the bar! \n\nI ordered the tom yum soup and pad Thai with chicken (I didn't know what the portion size was)\n\nMy soup came and it looks odd, maybe it was hipster tom yum? But it wasn't too bad, a tad bit too sweet for my preference.  I got 3 pieces of shrimp, which wasn't bad either for 4.5 (circa 2016) and it was a good bowl size, not a cup type of BS.  The soup was tangy and sweet with a fair amount of veggies.  Much lighter than most traditional tom yum soup.\n\nMy pad thai came after and oh my! IT WAS A LARGE PORTION OF GOODNESS!  For 8.95 (again, 2016), I was getting my money's worth!!  Although it won't win the presentation award, I was really happy with the amount and that it was hot like it just came off the pan.  My first bite, oh dear lord! I was craving thai and this hit the spot.  The tamarind sauce, sweet and tangy, so good!  The noodles were not overdone or too sticky to each other, good amount of sauce.  I would have to say that it was a bit salty, which means it's probably too salty for most people.  I literally drank all my water.  There was almost an equal balance of meat, tofu and bean sprout and crap and I LOVE when a thai restaurant has the 4 sauce tray with the pickled Thai chilies!!  LOVE!! This place won brownie points for that.  Even though it made my food even more salty =(.  The chicken coulda use a bit more time with the sauce during the cooking process as it was lacking just a wee bit of the flavoring.\n\nOverall, I had a good experience here, the service and the food.  If only some kid wasn't kicking my chair the good majority of the time....", "author": "Laurie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-04", "description": "Food is not the best and very expensive. Drinks are okay, good mojitos but be prepared to be chased down for more tip when leaving. Waitress literally argued with me \"So you're not going to give me more money?\" with her hand out. I'm all for generous tips if I receive good service. Also, tip amounts are suggested, not mandatory. Extremely unprofessional.", "author": "Elena D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-30", "description": "Both very blan I have taste better thai food not really to seasons don't believe the hype at all I am being very honest not good at all", "author": "Ron F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "Place was okay. Nothing special. My friends gave high praise of their food and I just wanted to eat out on a Sunday night. Prompt walk in seating. Service was pretty good and it got quite busy. I like that there was an outdoor option and open kitchen. The food came out pretty fast but it was either either over seasoned or too much of something that made the taste off putting. The thai ice tea was okay, pretty sugary. Calamari was crispy but overbattered. Papaya salad was pretty good. Spicy noodles weren't spicy but still decent. The pai thai had too much lime juice in it. Lastly the tom yum had too much vinegar. I wish I had checked my map of bookmarked restaurants around the area for an alternative.", "author": "Benny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "The food is excellent , never had a bad experience with the food. I usually go here about twice a Month and I have to say from drinks, to food, and service is always good. Try to go on a Tuesday they have a skirt steak, with Chinese broccoli and white rice it's sooooo good, pair it with a bottle of Pinot noir , you won't be disappointed", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Food is always fresh and has great flavor. I only order to go from here and still have had only great experiences. Best Thai place in the neighborhood without a doubt!", "author": "Robert R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "A few friends and I stopped in because we were in the neighborhood. it was a Tuesday night and there were seats immediately. The feel and decor is definitely upscale and on point especially for the price point.\n\n So I love thai so much I consider myself a critic. I ordered chicken with vegetables with curry, the noodles dish. It was between ok and good for me. however keep in mind I go to many Thai places. my girlfriend is vegetarian and ordered the vegetable pad Thai and I liked that more.\n\nOverall, cool place. Worth checking it out for sure.", "author": "Charles M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "I've been going to Joya for years now, and I've never had a bad time. With a bigger space than The National (its sister restaurant), Joya offers inside seating as well as outside seating in the back. Joya also takes cards now, which is a pleasant development.\n\nThe prices here are very economical compared to the portions; Joya's pretty much famous for serving huge plates of food for decent prices. The glass noodles, Pad See Ew and spicy noodes are great. For apps, the chicken satay is awesome, and it comes with a delicious peanut sauce. The Gai Kratiam is also very good and not too overbearing on the garlic. Pretty much - you can get anything from here and it'll be good. \n\nThe only downside about Joya is that it's almost always busy so plan accordingly.", "author": "Karsten V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Great thai food. It's the best thai meal I've had in awhile - it was even able to compete with some of my favorite Chicago thai spots. \n\nI got a glass of wine, panang chicken and a papaya salad. THe papaya salad was enormous and it was a great value for $5.50. It was sweet, salty and sour - tons of papaya, carrot and peanuts. \n\nThe panang curry had excellent flavor and was filled with delicious veggies (eggplants, zucchinis and peppers). The pricepoint was really reasonable and if I was a resident of Brooklyn, I'd definitely be back.", "author": "Xenu M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "Joya is the very first place that I ever had Thai food many years ago. At first I was obsessed with the place, but over time I stopped going due to seeing a roach there once right along the wall where me and my friends sat and also bc back then they didn't have many fish dishes that weren't shrimp based (i.e.: no salmon, bc I'm allergic to shellfish only). \n\nI recently moved back to the area and was in the mood for Thai and decided to give it another try. I sat at the bar \u0026 I ordered a glass of Riesling, the mango salad, chicken pad Thai and then a Thai iced tea. Everything came to $31. Not bad at all, especially because the portions were enough for me to have leftovers YAY. The Riesling was actually good and I'm very picky since most restaurants only carry American (WA) Riesling that isn't sweet to me. The mango salad was Delish, but I do wish there was more SALAD/lettuce! It was a lot of mango slices. The chicken pad Thai was good, only complaint is that the chicken did have a slightly \"burnt\" flavor. I think it was more like a \"blackened from the grill\" taste. I'm guessing that they grill it that way before tossing it with the noodles. Other than that, it was pretty good.", "author": "Bella L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "This place serves very good Americanized Thai food. I always come here with a date, have 30 dollars in hand (cash only) get the calamari (surprisingly good for a Thai spot), the spicy noodles (great flavor in the dish), and whatever else my date gets (usually a pad thai dish, also very good). Service is standard, try to get you in and out as fast as possible. No complaints from me.", "author": "King K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "EXTREMELY RUDE owner, terrible customer service. \n\nWe waited for over an hour with our full party there. The bartender and manager said a member of our party left the building, which wasn't true They sat other parties that came after \n\nWe ended up leaving.", "author": "Addy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-13", "description": "Did not enjoy the food I ordered at all: veggie red curry and tom kha soup. Would not recommend it. My boyfriend had pad sew (not sure about the exact name of this dish) that was ok.", "author": "Anna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I love this place. Ive been coming to joya for over seven years now since I went to school in downtown brooklyn.  \n\nThe must try is there spring rolls, those vegetable spring rolls are so amazing it comes with this dipping sauce thats the perfect split between sour and sweet. I mean I parked illegaly in front to run in and get some on the drive home from work?! There that awesome. The skewers and Thai rib appetizers are okay but definitley not worth it... munch on those spring rolls. When the fryer was broken one time out of the over 100 times ive orderd from there they acommodated me! There really amazing!! The lady that rolls the spring rolls has been there forever, and they dont use the frozen rice paper its the real deal. \n\nThe Pad See Ew Is amazing just so authentic! My standard order is mix it up a bit! Add that extra brown sauce, american brocolli and a side of white rice and watch as the hungry monster in your belly smiles and dances! Its just so great!\n\nThe thai tea is just so authentic and good. \n\nThe workers and the cooks are really from thailand. After traveling in thailand for about  a month in the villages and markets I can justifiably say that there food is authentic.\n\nIts so reasonable in regards to pricing. I mean 2 orders of spring rolls. 2 cokes. 2 entrees. Tip. APPROXIMATLEY 40 dollars. Like really?\nTHEY ACCEPT CREDIT CARD***\n\nThe owners are sweethearts! The interior decor is trendy with music, with a splash of romantic candle light and white tables. its always packed on the weekends but they take care of you and seat you as fast as possible.\n\nThe outdoor seating area has cushions, benches,tables, two really huge romantic trees. Candle light. I mean its an outside oasis. So romantic.\n\nDefinitley will continue to be a regular.", "author": "Marlena K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "Food and ambiance is great....simple and flavorful! The calamari. The summer roll tho... Meh... Not bad just different...Will come back!!!", "author": "Candace M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "The first time I visited this place, my gf and I were looking for somewhere for Lunch. We picked this place and immediately was taken away by the ambience. Neo Soul was playing, candles were lit and everything was clean and streamlined. We were seated immediately and ordered within 5-7 minutes. Food came out almost instantly.\n\nI MEAN HOT! \n\nSince then we have come back for lunch and enjoyed the nice patio and have tried several things on the menu. My favorite has GOT to be the wings!!!\n\nPortions are a nice size for under $11 dollars, beers and wines are reasonable. The wait staff is attentive. Two thumbs up over here.", "author": "Barry G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-27", "description": "We came here to dinner on the eve of thanksgiving day because we could not be bothered to cook a meal that night. We were surprised to find out that the place was packed with a 20 something crowd even with the foul weather of mixed rain and snow.\n\nThey serve contemporary Thai cuisine, I had the Tom yum koong with shrimps and Moo Kraprow; sautéed sliced pork with peppers, cabbage, carrots and onion in a chili basil sauce with white rice on the side. Nothing really stood out in my opinion. Although the food portions are huge, the food did not blow me away.\n\nIf you are looking for an inexpensive Thai restaurant in the neighborhood with an awesome ambiance, a separate full bar that serves cocktails and plays cool music while dining, this place is for you.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "I was expecting some nondescript Thai place, since yelp implied it was a really cheap place, but it's actually awesome! Amazing food and great atmosphere. They have a cute outdoor seating with lights and plants where my friend and I sat. \n\nI tried his hot and sour soup while he was away and it was sour and tasty, although I wish they had a version with coconut milk and lemongrass. We both got the green curry, which I think needed some more substance and spice, but was overall very tasty. And less than $10 an entree, I consider it a win!", "author": "Aries T."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}