{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-17", "description": "I'm having a hard time with this review... but I'll go for it. \n\nSo, there food is pretty excellent - the only downside I would say is that it's a bit greasy. At least their spicy noodles. I LOVE them because I don't really care about my weight/appearance/self but a friend of mine who is very health conscious felt sick after eating them. \n\nSo, on the one head - I love the food but can see how it's maybe not the BEST. But also, it's really cheap... most everything is $8. and it also has a fun atmosphere although I usually get delivery. \n\nApparently there's a DJ there at night - so I hope to try that out sometime in the future. For Thai food on Court St, Joya is definitely the winner!", "author": "Stacie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-02", "description": "I'm going to give you a review update in one entry. I used to LOVE Joya. Love, as in this was my favorite Thai joint (apart from of course the one in Chelsea Market). Anyway, it was my fave, and I frequented it at least bi-monthly. They had the best noodles, tom yom soup, and curries I'd ever had.\n\nSadly, I find that their quality has dropped. The tom yom sucks now, and has pepper in it (never used to) rather than the multitude of yummy shrimpies of yore. They also started charging more for shrimp dishes, explaining that shrimp is now \"on special\" because the suppliers made it more expensive. Understandable, but serve me a friggin decent dish here. They never clean the poop track of the shrimp anymore, which is damn gross. Appetizers also have become poorer in quality. Curries remain quite good, on the other hand.\n\nAs far as atmosphere, it's nice and fits the generic resto-meets lounge vibe of many thai restaurants. It is insanely packed at night from thurs-sat, other nights also quite busy. Lunch is a nice time to come. Also, for nicer weather there's a pleasant all fresco dining area that makes me happy.\n\nNote on take out: they almost never supply forks/knives/napkins. Also, it's hard to catch them on the phone, you may have to call 5 times.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-05", "description": "Meh...I've experienced much better. Sure, for the low prices you can't really expect much. But one at least hopes that a place can fry calamari successfully. I followed several reviews and decided to order what others recommended, big mistake. The Fried calamari was very chewy and came nothing close to being tasty. This beautifully decorated restaurant has nothing much else to offer but good service and well...beer. The vegetarian eggrolls were very greasy, the spicy noodles, though looked delicious, were far from it. The best plate from the night was the spicy coconut sliced pork curry. Still, I would not come back. FYI no cards accepted, just cash :)", "author": "Miguel H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-13", "description": "NOT VEGAN FRIENDLY.\nI've been here once, that's it \u0026 never again.\nAs far as I'm concerned being vegan is not a trend, so I don't care how \"trendy\" this place is. I went with my boyfriend, who is also vegan, near the end of our supposed vegan plates, my boyfriend spit a chunk of chicken out onto his plate...\nYUM!!, or not!\nI ordered Pad Thai, which was mediocre at best. The sprouts tasted dirty.\nCall me \"picky\", but knowing that cookware is not cleaned and vegetarian dishes are not cooked on separate pans is enough to repel me and all vegans/vegetarians I know for good!\nEven though they didn't charge us for the meal (which they shouldn't have anyway), just the thought of this mishap makes me sick!", "author": "Christine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-26", "description": "My first visit to Joya was very positive.  I was surprised to have to wait 20 minutes for a table for 8 on a Tuesday night at 9pm... no biggie.  We were seated in the back of the restaurant near the kitchen area and I noticed they also have a cute little intimate outdoor patio in the backyard.\n\nWe ordered a large fried calamari for our table and there were plenty to go around.  The chili dipping sauce was good and had a little spicy kick.  We also ordered mango salads which was refreshing for a warm humid night.  For entree, I had the fried whole sea bass and it was piled with Chinese broccoli on top of brown gravy served with white rice - no complains there.  The size of the dish was generous and very satisfying.  I also tasted the soft shell crab (thought it was a bit salty but overall the crab was big and cooked just right) and Woon Sen (very tasty but the glass noodles broke into little pieces).  For drinks, my friend ordered a lychee martini.. it was strong and not too sweet.\n\nFor 8 of us, we ordered a large fried calamari, 2 mango salads, a chicken satay, 8 entrees and a drink and the bill only came out to $144 including gratuity.. that's only $18 per person for a lot of food!!  I would definitely go back to this restaurant based on the good food, affordability and decor.  I didn't see any of the service problems some of the reviewers mentioned... sure the check came a little slow but we weren't in a hurry.  Overall, we enjoyed our visit.", "author": "May L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-14", "description": "Foods are decent. Only the reason why i giving 2 star instead of 4 star: manager or owner(?) he was plain rude. \nI asked for a baby high chair and then with an attitude he said \"???? I'll show you\" i didn't understand what he said exactly. In a while, another staff brought it with a kindness. \nLastly,i walked to the counter for a pay, he was giving me an another attitude: i said\"give me $10 back please\", he goes count the monies takes a while. I asked one more time \"just give me $10 back\" he said \"I KNOW!, I HAVE ????????? TIP\" i thought he was trying to say \" I KNOW, BUT I HAVE TO CALCULATE MONEY FOR THE TIP FIRST!\". \nOk i understood, but he shouldn't said like that. He could be nicer than what he did. He also never said like \"thank you\" or \"how was it?...\"no even eye contact'. \nIt's obviously shame on Joya if he is the owner of this restaurant.\nOverall, good foods, good atmosphere, good server, good location, reasonable price, ONLY THE MANAGER OR OWNER.", "author": "Jason H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "Best Thai Restaurant in the City. Great prices!", "author": "Daniele Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "What an obnoxious restaurant. I walk in around 7:30 and immediately am struck by the thumping miami style DJ music that is blaring. People are literally screaming to talk to one another. The staff (especially at the bar ) are completely charmless and were making not so veiled references to doing coke. When we sat down the waiter approached us every 2 minutes to see if we were ready to order.  I could go into more detail but I will never go back, not because of the food but completely because of the horrible service and atmosphere.", "author": "J.B. P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "Joya is one of my favorite thai restaurants. You get so much for your money's worth! I love the Pad se ew and the mango salad. They have great drinks as well. The only thing to remember is that is CASH ONLY! You don't want to end up on a first date with credit card only! This is a must for thai lovers! HIGHLY RECOMMENDED!", "author": "Joanna A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-23", "description": "Absolutely horrible customer service. And if you have any food allergies and ask about it, which my friend did, you will be told to cook the food for yourself, at home.It don't even matter how the food tastes anymore since the service left such a bad taste.", "author": "Keshav M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "I am absolutely in love with this place. It is surprisingly cheap in comparison to other places ($15 will get you an appetizer, an entree, and cover tip) and, given the portion size, you really are getting the bang for your buck. I usually end up here after a long day at the gym with friends because the food is so wholesome. Also, you will have your meal in about 5 minutes. The service is great.\n\nThe establishment itself is pretty relaxed. They usually have some calm music playing, low lighting, and nice interior seating. There is also seating in the backyard which is nothing too spectacular but is amazing on a warm breezy day.\n\nI highly suggest you try the chicken curry puff appetizer ($4.50) for a delicious start to your meal. I've had their chicken pad thai ($6.95) and you can never go wrong with that choice. I've also had a squid dish whose name escapes me at the moment but it was quite amazing as well.\n\nIf you're around Brooklyn Heights at all, definitely give this place a try. You won't regret it!", "author": "Anthony U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "\"I've been coming here for years. It's def my go to chill with spot with my girls \u0026  when Im craving some good ol  Thai food love love love. Never had a bad experience with their food Usually crowded on weekends. Drinks are good also !", "author": "Chrissy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "Huge portions, great prices, tasty dishes, and great bartender, this is a great place... only draw back is that they're cash only.\n\nThe food here is thai, but you're not getting Sripraphai thai but hell its still good, especially for the prices and portions you're getting!  The food is fresh and the taste in pretty darn yummy.  Nothing here is ubber spicy so there's nothing to worry about.  The mussels here are a must and the calamari is delicious too.  I've tried almost everything from the curry to the pad thai and they are all really tasty.  I especially like the beef salad and particular noodle dish thats sometimes on their special menu.  Aside from the great food, these portions are seriously BIG.  When I say big I mean like I eat 3 bites after sharing an app with the bf and I have to take the rest home.  And the leftovers make me incredibly full the next day when I have it for lunch or dinner.\n\nSo I've covered the tasty dishes, huge portions, and great prices, now onto the drinks.  I especially like this location because they have a bartender there who's awesome.  He's totally creative with his drinks and they are sooOooO GOOD.  His mixes are not on the drink menu and you just have to ask him to make some of his specials for you.  He makes this melon colada takes super!  Last time we were there, he said he bar tends there on Tues., Thurs., and Sat. but that may have changed.\n\nAlso quick thing to note, it gets packed here pretty quickly especially on friday and saturday nights, even the bar gets packed, so if you want to avoid the dreadful wait, come a little earlier and definitely don't come after 7:30 unless you have the patience to wait.", "author": "Red J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "Best thai in the area! Cute ambiance.  I usually look for hole in the wall places for more authentic food, but this place has amazing food. I tried the chicken pad thai which I usually find boring however it was very flavorful and delicious!", "author": "Maancy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-23", "description": "I was one of the first customers through the door when Joya opened, and I have continued to be loyal to Andrew and Ariel and their terrific restaurant ever since!\nMy only beef is that they became such a hotspot that it can be really hard to get a table without waiting...and once you are in there, most nights can get really noisy.  It is a very hard place to go for a private meeting or date!  I tend to go there more for carryout these days.  Their prices are phenomenal for the quality of the food and the portions, and the majority of their kitchen staff have remained with them since opening day- so the quality is always consistent.  To this day, it is still the absolute best Pad Thai and best Spicy Noodles I have ever had at any Thai restaurant anywhere- and I have sampled a LOT of Pad Thai...all over the country!", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "Put simply, I love Joya. It will always be my favorite Thai restaurant. I've considered moving, just to be close enough to get it delivered.\n\nSince many have already given it glowing reviews, I'll just leave my absolute favorite dishes:\n1) Massaman Curry w/ Chicken. A-ma-zing. It you want something substantial and delicious, this is the menu item for you. I also love peanuts, so finding them in this dish (there are plenty) is always fun.\n2) Chicken Pad See Ew. My go-to. Simple and delicious. Enough said.\n\nGo now. Seriously, don't delay. Expect to wait if you're going in the evening. And they only accept cash. I've always had a good experience with the bartender and even got a free drink for smiling. :)", "author": "Hilary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "Joya = Joy.\n\nFood is consistently delicious and cheap! I have tried pad thai, pad see ew, green curry, almost all of the appetizers, and a number of veggie dishes.  Nothing has ever ceased to impress.\n\nAs for the atmosphere, get over it.  The lighting may be low, it may be loud and crowded, and they don't take credit cards, but who cares?! I haven't had to wait more than 20 minutes for a table (weekend or weeknight) with different sized parties.  Well worth it for the price and quality.\n\nI brought friends here, I brought my mom here, and I would bring more if they didn't mind the trek to Brooklyn. Yummy in my tummy, and in my wallet.", "author": "Elizabeth O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-19", "description": "Went here w/ my friend and his family for his b-day.  1st thought was, OMG it's so freaking LOUD in here!!!!!!!!!!!!!!!!!!!  There was a little wait on a friday evening around 7p.m.  We went to the bar and ordered some champagne \u0026 beer as we waited for our table.\n\nEven though it's loud, you won't need to talk as soon as the food comes out b/c it's maybe the best thai food i've ever had.  They cook in an open kitchen.  The service is a little slow b/c there are just so many people there.  Besides that, I don't think i saw anything on the menu besides the specials over $9.  \n\nPortions were HUGE, and surprisingly VERY GOOD!\n\nWe ordered papaya salad, chicken \u0026 beef skewers, pad thai, pad see euw, beef salad (my fav), chinese broccoli, and 2 other dishes.\n\nI always recommend this place to my friends if they want really good thai food in brooklyn.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "Was in the neighborhood and saw the great reviews, so I decided to go here since it was close by (thank you iPhone)... it was fantastic. \n\nFood is most important here, but the place had nice decor and it was kind of cool that the kitchen was kind of an open area that you could see. Service was good and food came out fast too, but I was one of 3 parties present at the time. \n\nFood:\n- First, it was reasonably priced, for an appetizer that could have been shared and a curry dish that left me ridiculously preposterously full, I paid 12 bucks. Very reasonable.\n- Appetizer:  Spicy pork spring rolls, off of the specials menu. Super crisp without being greasy somehow, which was great, and they were really stuffed with lots of flavorful pork meat. Most spring rolls aren't so generous with the meat, but this stuff had substance, yet it was balanced flavor wise.\n- Curry: Kang Panang Gai (chicken panang). Good blend of sweet and spicy, without being too spicy. I liked it. Only complaint would be that the rice accompanying the dish wasn't amazing, maybe a bit dry, but the curry more than made up for that.\n\nOverall what I liked most was the appetizer I had, the curry was good but not way beyond other curries I've had... but the spring rolls were fantastic.", "author": "Amar P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "Edible but not great or super flavorful by any means. Decent if youre hungry but dont go for a culinary experience", "author": "kristina k."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}