{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Check my history, I don't give 5 stars but Joya deserves every bit of them. This is my, and I'd imagine many Brooklynite's \"go to\" restaurant. For the most part, this review is for all 3 restaurants (Joya, Song and National) which share ownership, decor and menu. Joya, however, I might argue is my favorite to sit and eat. Great vibe and an ill outdoor patio they use when its warm. \n\nThe food is great, simple and plain and you won't find a better meal for the price in the borough. My favorite dish is the spicy noodles but I've had everything on the menu and would recommend anything. The fried rice and pad thai are probably the two dishes I would skip. They're not bad but you can get similar elsewhere. All the curries are amazing and the spring rolls are a must add to every meal I order.  The mango salad is epic. Try it, holler at me if I steer you wrong.", "author": "Juan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-16", "description": "Mango salad, calamari and chicken egg rolls for the appetizers were all great. Chicken skewers with peanut sauce was very good. The skirt steak was delicious but the veggies were soaked in oil (which is how the meal is prepared) but not something I particularly enjoyed. Beers are only $5 and the appetizers are priced low (around $5-10). I went on a Saturday night around 8:30 and the hostess told us a 30 minute wait.... Which ended up being a hour because he decided to seat some regulars who walked in after me first... Which was extremely annoying seeing they only waited 10 minutes.. I understand the concept of \"connections\" but waiting an hour after being told 30 minutes bc you want to hook ur buddies up....SUCK. But yes I will return... Just not on a busy night.", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "Had a really great experience. Ambiance is super chill. And the food is really tasty and cheap! Best of both worlds!", "author": "Aqmeri A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "The Thai food from here is so good. I tried it for the first time a few months ago and now we come here often for dinner. The spring rolls are the best with the sauce it comes wit and inside the roll is glass noodles. My favorite dish from here is the shrimp pad see yuh and so far they have the best one I ever tasted. The portions are big and I could never finish my dish so I usually just take the rest home. The service is good and quick. I've never had any problems here with anything.", "author": "Susan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "I've been to their sister restaurant Song a ton of times and I'd have to say I like joya better.  The food and ambiance. I ordered the pad see yew, calamari, and chicken fried rice.", "author": "Susie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "I came here on a rainy Saturday night and the place was pretty full. Joya reminded me of the Thai restaurant Song that's not too far away. I think they are related and they are both popular places to dine at. The entrance, interior, and menu all look the same. But I had a better experience at Song and a terrible experience at Joya. I had the mango salad and shrimp pad thai. The mango salad had a lot of mangos, but it was just okay, nothing special. Now the pad thai is the worst I ever had. It was so salty and flavorless, just plain salty. How can a Thai restaurant mess up pad thai. And the shrimp had a fishy taste. The dish was just bad. The only thing I like was the Thai ice tea.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-11", "description": "My girlfriend and I had dinner here on one of her visits to NYC. It is very loud, over priced, non attentive staff, overly crowded and worst of all food was just meh. We came here based on all the good reviews on Yelp Idk what these people are used to eating but for us the vibe and food were nothing to write home about. Will never go back.Have been going down the block to Lemongrass Grill, food is less pricey and tastes amazing .", "author": "Charmaine V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Great flavor, quality ingredients, reasonable prices, and good portions. We love the decor, ambience in here, and staff are friendly and refill water a few times during your meal. \n\n4.5/5 - Green curry for $10 comes with chicken, a variety of vegetables, and is accompanied by white rice. Great portion. We really enjoyed this as it came very close to what we've had at this Thai place called Isaan Station in LA.   \n4/5 - The papaya salad for $5 has crisp texture, sweet, and spicy flavor, but could use some more sour flavor.  You taste the sour in the leftover dressing, but not as much on the shredded papaya. \n4/5 - Seafood fried rice. Lots of flavor, well-seasoned. \n3/5 - 2 decent size egg rolls for $3.95. A bit pricey for this portion, relative to other appetizer portions on the menu.  Taste was okay; more remnant of Chinese food than Thai food.  The wrapping retained too much of its cooking oil. It should be drained better from the fryer. \n3/5 - Chicken Satay. Meat is nicely moist. Peanut sauce was overly sweet/thick, and the vinegary sauce didn't have enough flavor.  Might taste better with some red chili.  \n\nI realize it's smart to sell fried appetizers and price them right, even if they aren't Thai foods. People order them!\n\nWe'll definitely be back. Flavorful food, good prices, and an enjoyable dining experience in NYC. Joya does a great job.", "author": "Hank D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-16", "description": "I come here often. I love that the prices are reasonable. I do think the staff should wear uniforms though, didn't realize who walked up to us until the guy announced he'll be serving us.", "author": "Maya N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-26", "description": "The good: outdoor seating (with pillows), inexpensive lunch special (appetizer and main for $9)\n\nThe bad: spring rolls were very greasy and the pad thai was too sweet", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-29", "description": "I've eaten at Joya MANY times: large portions, good, inexpensive. The pad see ew is my bargain fatkid standby ($8.50!), but that may be of the past.\n\nFor dinner, my friend and I ordered apps and two entrees. And we waited. If there's another description for Joya, it's \"quick\". Like you can order, eat, and be out in an hour. If that's your thing.\n\nAfter 30 minutes, we got our shrimp spring rolls, and my friend picks one up and a live beetle crawls out of it. Ok! We send it back. My friend, a picky eater and new to Joya, is bothered (admittedly!), but she decides to stay and try the cooked food.\n\nApparently, though, at the same time, there was a surprise health inspection of the kitchen, which shuts down all food prep. (It's a little too ironic.)(You know someone dumped that spring roll quietly.) We've sat for 45 minutes with only water. We decide to leave, and when we tell our server and the front of house - so not to look as if we dined and ditched - they both make this sorrynotsorry face and give us lame little waves.\n\nI hope the bug is enjoying that spring roll.", "author": "Audrey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "Things I Loved About My Lunch at Joya.\n\n1. The Spicy Noodles AKA Pad Kee Mao.\n2. The huge portions for not very expensive prices.\n3. $4 Chang beer. \n4. Sitting in the sunshine in the sweet garden.\n5. Being immediately seated because there was no crowd.\n6. The nice, comfortable pillows along the bench seating.\n\nThings That Mildly Annoy Me About Lunch at Joya.\n\n1. The fact that the menu outside is sideways. I realize it doubles as a sign for the restaurant, but it also means I have to step into the doorway to look at it, which inconveniences everyone trying to walk through.\n2. It's cash only.\n3. The bee who kept trying to drink my beer.\n4. The lack of a lunch special.\n5. The girls to my left, who insisted on telling inane stories with no discernible point.\n6. The fact that I didn't realize the portions were so huge, so we could've split an entree and a couple appetizers, and probably been better off.\n\nWhen I can't even come up with things I don't like, merely things that mildly annoy me, I think it means it's a damn good place.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-30", "description": "I'm back to write a second review.  I will never go to this place again.  I still remember the feeling I had leaving this place.\n\nIt's a shame that the manager can make the rest of the place look so bad.  What an asshole.", "author": "Dayne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Best Thai food I have ever eaten! My whole family, including two children love it here. The food is consistently awesome!!! We eat here about once a month and will continue to do so!", "author": "Maria A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Same menu as SONG in park slope. \n\nGreat spot for American Thai food for a great price. \n\nThe shrimp pad Thai is always great for about $10 you can't go wrong. \n\nCan get busy so be ready to wait for a little on Friday and Saturday nights.", "author": "Phill N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-01", "description": "I love this place! I would give it a five star if it wasn't for the wait. Other than that the food is amazing. Chicken pad Thai, spicy seafood fried rice, fried calamari and pork dumplings were so tasteful!", "author": "Ana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-02", "description": "Got the veggie spring rolls which had zero flavor and tasted like salad dressing on it. I got the pad Thai with tofu and didn't taste any flavor in the food at all. It was pretty bland. So many better other Thai restaurants out there. I like Thaism way better then this place. The only positive was the large portions.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "Cheap n tasty thai food.  Not hugely authentic, but in a good way :)\nMango salad starter was excellent", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "Simple the freshest tastiest Thai food .\nGreat staff. The place gets busy so be prepared to wait but it's well worth it.", "author": "Kenneth P. T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-06", "description": "So convenient and inexpensive...and so mediocre that I didn't finish any of the things I ordered:  coconut milk soup with chicken, green papaya salad, and chicken and vegetables in a fresh ginger sauce.  Of the three dishes, the last one was the best, because at least it had some slivers of fresh ginger that were tasty. The soup was very over salted and had a heavy fishy undertone. I know fish sauce is part of the flavor profile of Thai cuisine and it usually doesn't bother me at all, but here it was just too much. The chicken in both dishes was old and rubbery. The salad was tasteless. The soup and main course were also marred by big hunks of tough, unchewable onion. How can cooked onion be unchewable?  Usually I can salvage a bad Thai meal by pouring sauce over the rice and eating that, but even the rice wasn't good.\n\nSuch poor quality that despite the very reasonable prices I won't eat here again.", "author": "Pandora B."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}