{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-09", "description": "This place is just awesome... the food is really great, and really inexpensive... how I wish we had something like this here in Miami...\n\nThe spring rolls were awesome, and the pad thai was equally as awesome...\n\nIt is a bar/restaurant so its a little loud... but seriously, every time I go to NY I make it a point to come here... GO NOW!!!", "author": "Frank E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-27", "description": "I was a little torn about what star to give this place. A few years ago it would have gotten a solid 4 stars but it's just way more inconsistent than it used to be. I also think that coincided with Song opening in Park Slope.\nYou probably can find better Thai food in New York but this place is another \"scene\" type place for the neighborhood. Who needs all those Hell's Kitchen joints when you don't need to leave the hood? I usually stick to a few choices including the Pad See Yue with chicken or tofu depending on my mood. The summer rolls are tasty and the calamari does seem to delight folks. Plus, you can always get take-out and avoid the crush and you'll get it about 5 minutes after you order no matter what.", "author": "carl g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "Delicious, fresh-tasting, fast and affordable!", "author": "J S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-30", "description": "This will be brief and resoundingly positive. I have been coming since the opening as many of my friends live steps from Joya.\n\nIndustroChic interior. Amazing food. Great clientele. DJ spinning off-house, triphop, whatever. Fast Service. Prices, and I shit you not, are comparable to FAST FOOD. I have eaten apps and entrees, had multiple cocktails, two bottles of wine and the bill for 6= $106. Holy shit. The food is fantastic. \n\nThis is a top Asian cuisine, in a great neighborhood, amazing space, outdoor patio, great bar...for the price of a sandwhich. \n\nEach time I come, I am shocked at the quality and low cost. \n\nLone con----always crowded, but of course it would  be. If you could just stroll into Shangrila, wouldn't you?", "author": "Jonny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "Delicious Thai food and incredibly affordable. I haven't had anything on the menu that has not been good. The portions are big and we always go home with a doggy bag. They have a decent selection of beer on tap (for a Thai restaurant). Only negative is that the service can be a little slow when it comes to drinks and clearing plates. Additionally, make sure you bring cash, as they do not accept credit cards (I found out the hard way).", "author": "Chris O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "One of my favorite favorite Thai restaurant. I usually order something off their special menu, for example grilled salmon over Chinese broccoli, Skirt Steak with shrimp, along with Som Tom and Fresh spring roll. Fried calamari \u0026 mussels are delish!\n\nWhat I love about this place is that they offer Thai hot sauce(especially the one with finely chopped chili pepper in fish sauce).  Unfortunately lot of Thai places in NYC don't carry it.\n\nAlso I find staff there pretty friendly and I avoid going there after 9 PM 'cause it turns into loud throbbing, thumping club with bridge \u0026 tunnel people(Fri/Sat). During the day and early evening is nicer; music more rock-n-roll/alternative w/ locals.\n\n12/28/2013 Haven't been here in a while since I moved out of Cobble Hill. So sad that Joya no longer carries MY FAVORITE dish, Spicy squid salad. I was sitting at the bar, drinking white wine, but disturbed by little girls playing patty-cakes nonstop behind me.", "author": "Julee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-01", "description": "Really yummy and pretty big portions.  Also, the outdoor seating is awesome.", "author": "Val L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-18", "description": "Best thai at best price. Huge portions\nEating in a little noisy. \nCurrys and pad thai is great. \nOddly, calamari with spicy sweet sauce is great.\nAlso, skirt steak with chili basil sauce and vegetables out of this world. You wouldnt think at thai place.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "Good Thai food in Brooklyn - never thought I would find it.  The red curry was yummy, as was the Thai iced tea.  Must go back one of these days and try something different.", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "went here in november while we visiting my bf's sister in brooklyn. nicely priced thai food especially in NY when everything can get so expensive and portions are generous as well.  I had that pad thai. Similar to other pad thai but with the cheap price, makes it seem better. the calamari was surprisingly delious as well. however one thing that irked was that no one helped us when we walked in the door, had to go find someone and also, lighting was bad. I could barely see my food. definitely must try if in the area!", "author": "Kan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "This is some of the best Thai I have ever had. The ingredients are fresh and everything is cooked superbly. Any of the noodle dishes or curries are slamming. You can also choose your level of spicy, which is great when not everyone wants the same kick with their meal. Prices are super reasonable; most plates range around $7 or $8 with ample food. The service is not too great, but usually because the place is packed. You might have to wait a half hour or so on weekends to get a table, but it's worth it. Also a great date night restaurant since they have a low-lighted, modern decor.", "author": "Cecilia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-10", "description": "Calling Joya for delivery usually feels as futile as calling into a radio station for free concert tickets. Actually going to Joya itself is even worse. It is vaguely infuriating in the same way it is to go to an obnoxious club where you have to wait on line, the music is too loud, and the drinks are weak. \n\nI don't recommend going but I do recommend bearing the tedium of calling for delivery because the food is really good, the price is great, and the service tends to be quite prompt.", "author": "Liz W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "Great Thai food in cobble hill. Good selection of food. The stand out dish was a special for that day, the fried duck spring rolls. It was a little greasy but was delicious. Good lively atmosphere indoors, the small out door dining area was a little more relax and quiter, perfect date setting on a warm night.", "author": "Roberto W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "I took my girlfriend to this place for her birthday and it rocked. They have the best pad thai i have ever had in new york city. prices are cheap and the food is great.", "author": "Jeffrey Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-14", "description": "Nothing makes me happier than good cheap thai food.  My first bite of pad thai brought me back to my last trip to Thailand and that hadn't happened before....thats a good sign in my mind.  \n\nAll entrees for the most part were under $10 and with house wine at $5 a glass, our check was actually not a burden to receive.  It does get very busy with a wait around the bar so sitting in the back away from the chaos and seeing the kitchen in action was a bonus!", "author": "Amy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Insanely cheap and lots of variety. Came with a group of 7 on a Saturday night (granted the weather was abysmal), and we were seated promptly. I started with the spring roll, which had a nice sweet sauce. Then I had the mushroom veggie salad, which I picked clean. Finished with the spicy noodles, which was oily but good. I know this is strange, but the spicy noodles tasted like pizza. I don't know how to explain it, but maybe it is due to the oil on the noodles? Weird. At any rate, everyone left sated and satisfied on a cold and soggy night.", "author": "Mike O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-03", "description": "Was recommended by a local to try Joya to get the best Thai food experience ever.  They did warn me it would be extremely loud and that it was.  I wouldn't recommend going here to catch up with friends but I would recommend it if you're looking to indulge your Thai side.  I was beyond satisfied with my meal!  The atmosphere is very 'swanky' yet casual.  Love the centerpieces at the bar.  On the down side, the waitresses were not attentive and the seating is snug.  Other than that, great food!  Wished I lived closer.", "author": "Wendy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-27", "description": "I don't know why people are obsessed with this place.  It isn't good at all.  They share the same problems most Thai restaurants have, poor cooking, and lack of authenticity.  This place is a cheap imitation, a midget in the giant shadow of what real Thai cuisine has to offer.  Do not expect anything, literally anything, and you'll leave satisfied.  You'll be like \"Hey, Joya is great!  When, I'm hungry I eat food.  They serve food.\"", "author": "Charles P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "This place never lets me down.  The service is quick and attentive, the food is great and the prices are insanely cheap.  $7.50 for a Thai curry!  The decor is modern and cool.  Not surprisingly the place is always busy, so there is usually a short wait for a table.  The only complaint would be the cocktails were always a bit weak, but I just switched to wine, which is better value....nice large glass of pinot for $7, not bad.", "author": "Tim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "Friendly and reasonable, fresh and tasty, authentic tastes turned down for the American palate. Busy on Memorial Day and staff looked like they were enjoying it and working together well. They even had mango and sticky rice.", "author": "Steve N."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}