{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-30", "description": "I have not been here for a while. I was really looking forward to a great meal but somehow it fell short.  Maybe just an off night.", "author": "Amelie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-18", "description": "I jus got my delivery and the mango salad was just what I needed to remind me of summer. Delicious--making me feel like I could be sitting on the deck with a glass of rose!", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-18", "description": "Been coming here for 10+ years!! One of my favorite places. Very cozy, food is always delicious.", "author": "Tkny T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Came here for dinner and was really pleasantly surprised. The food was very tasty, the ambiance was really nice and they were really reasonably priced. We got fried rice, calamari, summer rolls, and a curry and all of it was presented well and large portions. What's not to like?", "author": "Quinn Li O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-03", "description": "I've never experienced such poor customer service at an establishment. We were standing in front of the hostess stand for 10 minutes when I said excuse me to an older Caucasian man with a Bluetooth ear piece. He was very unwelcoming, mumbled something under his breath and tossed the menus on the closest table. We noticed that he did this with multiple patrons. When our food arrived, we asked him for napkins. He lifted his index finger to us and continued to punch numbers into a calculator. He gave us the impression that he did not want to be bothered by paying customers. When my apple salad arrived there was a big piece of plastic wrapping in the salad covered in salad dressing. When I asked to speak to the manager, the waitress went up to the same Caucasian man with the Bluetooth headset. He rolled his eyes and refused to come to the table. The waitress returned to the table and apologized. She said it was the plastic wrapping that the greens were wrapped in when they were delivered to the restaurant. (So does that mean you guys aren't removing the lettuce from the wrapping to wash it prior to serving it?) The salad was removed from the table and our bill but the manager never came to the table to apologize. I would never eat at this restaurant again. There are so many other local options. The food wasn't even worth the terrible treatment.", "author": "Fernandez X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Food is delicious. Atmosphere is Chic. The prices are very affordable. Perfect for a first date, which you want to impress but not to spend an arm \u0026 leg. You can seriously order an appetizer, 2 entrees, 2 cocktails, and dessert for around $50. Love this place. Been coming for years. They used to be all-cash but now they take cards, if I'm not mistaken. \n\nPS. The ribs (appetizer) are to die for \n\u0026 The green curry is everything", "author": "Leslie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-27", "description": "Cool looking space with nice decor. The light fixtures were fascinating. I like their open kitchen where you can get a look . . . . oh who gives a hoot. \nTried their fried calamari which was decent. I'm not a seafood fan so decent is high praise coming from me. Boyfriend wanted it. He got it. He loved it. I ordered a Thai tea and fried tofu with vegetables in a green coconut curry. Thai tea was delicious. Perfectly sweet. The curry was ok. Not awful, but not what I had expected. It was not very spicy at all. Actually I was expecting it to be a lot hotter that it was. I actually got the tea because I was expecting a very spicy dish. It was also a little too salty for me. Most of the vegetables was bamboo shoots. I was expecting more of a variety of vegetables. BF got basil chicken. It was so salty. And way too much sauce. Uhg it probably brought sky rocketed his blood pressure. I couldn't take more than a bite of it.", "author": "Abigail V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-27", "description": "Going down hill =\\ the skirt steak came out well done. But the spicy noodles were really good. Kitchen was closing pretty early. Gonna give it another try.", "author": "Robert C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-04", "description": "Excellent food, but very bad service from the \"owner\"\n\nMy experience in this restaurant was not entirely satisfactory,\n\nIn days past and visiting with my wife in New York and as a good tourist eager to know the culinary greatness that New York has, visit this restaurant with my wife and a friend, we arrived and we did not find that we had to walk the bar completely that the host was somewhere else.\n\nJust when we found the host the following happened to us, a couple arrived after us and we listened when the host told him that his reservation was at 10 and they were a little bit ahead since it was 8:30 at night, this couple apparently They were known to the host. However we kept waiting for our turn as everyone, when we realized that the host had accommodated in our turn this couple who arrived after us, when we wanted to make the comment and explain that our time was also important to the host. this derogatively tells us that \"I have 18 years in the market I own 4 restaurants\" \"I can do what I want\" and in a more contemptuous way he asks us \"are you going to consume or what?\"\n\nWe because we are not of the conflictive type and to show him that we were simply to share and taste his food, we stayed and dined.\n\nI would like to clarify that the food and service of the other employees is excellent, good food and good atmosphere.\n\nbut regrettably this bad experience with the \"owner\" was not very pleasant.", "author": "Juan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-21", "description": "ROACH IN FOOD!\n\nLast night, I had dinner at Joya, and had a dinner special Scallops Pad Thai. I didn't finish the meal and brought it home for lunch. Today, I ran to the fridge to finish the meal which was sitting in the same bag that the restaurant packed it in. Microwaved the meal began eating it in my brightly lit apt and low and behold a ROACH in my meal. I called the restaurant several times but they didn't answer their phone.", "author": "Henry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "The restaurant almost does not have a sign\nI'm quoting from what some customers said as they were going in\nBut it was busy so it must be good\n\nWe eaten here before\n\nNo complaints\n\nFood is excellent \nThe shrimp rolls excellent\nThe steam shrimp excellent \n\nThe pad see ew\nI'm not a fan of this but my family is\nSo it is eww to me but to my family it is\nPad see ewceellent \n\nRestrooms clean\n\nThe owner or manager was smiling all the time and very helpful\nReminded me of mr krabs with sponge bob\nMoney money money.   .....    money", "author": "Javier M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-14", "description": "The Thai food here was about average, not bad. The space is nothing remarkable, plastic chairs and eating on paper place holders. Would only come back if there was no alternative.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Amazing place ! Trendy, hip, sexy vibe , great music and perfect ambiance for a Saturday night.  The food is outstanding ! We snacked on a bunch of appetizers and it was the perfect sharing amount for a few people . The fried calamari , chive dish and tofu selections were done to perfection . Fast service and the owner Glenn is great", "author": "Cristina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Joya\nNY BK Cobble Hill\n1pm Friday 10th February 2017\nFour Stars\n\nThe store front is unassuming but the place is rather expansive with garden seating in the back. Tiff and I sat in a table in the back. We shared a tom yum soup with shrimp, fried tofu, a papaya salad, and chicken Pad Thai. The food was good. The soup was large, semi-spicy with large pieces of shrimp. The papaya salad had a lot of shredded papaya, carrots, lettuce, and tomatoes. The taste was on the sour side with a light level of heat. The fried Tofu came our golden yellow color and we got an accidental dumpling which was quite enjoyable. The pad Thai had a brown color with nice sweet citrus-y flavor. Overall, it was good meal.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Had a great dinner with my girlfriends at Joya!  The menu offers an assortment of Thai faves, and the atmosphere is a bit intimate with a fun feel.  Our table enjoyed the Spicy Noodles (YUM), the Chicken Curry Puffs, and everyone just raved about the Fried Spring Rolls.  An excellent choice with large portions- great for sharing- and super affordable cocktails.  Will definitely revisit!", "author": "Mia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "Hands down . Great food awesome staff friendly owner I really have nothing negative to say about this place So awesome and the atmosphere is amazing", "author": "Fatima A B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Delish! \n\nLove their chicken panang curry and their peanut salad. I know peanut salad is a classic but it is a generous size portion. I normally never get pad thai as that is too classic/basic. Most people come to eat Thai food and just get pad thai and think thats it.. but I go to Thai restaurant for the curry.", "author": "Sherry W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "This is one of the best authentic Thai places i ever been, kitchen is open and you can see cooking everything, also if you are facing the wall and you don't like it don't worry you have a big wall mirror to watch the action.", "author": "Josue P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-02", "description": "I would say their alcohol is very worthy. I ordered a lychee martini, only $10 and I can tell it's not watered down. Food is also great.", "author": "V S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "I was in Brooklyn to see some of the Art with my friends and we decided to come here for dinner. One of my friends had never had Thai food so she was a bit skeptical but from the moment we walked into the place we fell in love. \n\nThe restaurant is so cute with intimate seating and candles on every table.\nSince it was nice we decided to sit outside where they had table and benches with pillows.\nI loved it. \n\nFor appetizers we ordered the Fried Calamari and Chicken Satay. The calamari was cooked perfectly and was not overly friend or greasy. The chili sauce that came with it was one of the best I ever had.\nFor entrée I had the Shrimp Pad See Ew which was so yummy. My friend who never had thai food tried it and thought it was amazing.\nMy two friends ordered the special of Salmon with mango salad and stick rice. \nFrom what I could see their portion was very generous and they both loved it. \n\nI will definitely come here again if I'm ever back in the neighborhood. \n\nOn a side note, the service was also excellent.", "author": "Andrea G."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}