{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-12", "description": "This review is strictly on the service. I would first like to mention that I have been coming to this restaurant for approximately ten years. It has always been one of my favorites due to the cheap prices and the quality food. But in my most recent experience, I had a run in with the \"owner/manager\" and he was very unpleasant. I am assuming that management was changed a few years ago. \n\nMy co-workers reserved a table and I was supposed to meet them soon after work. When I showed up, I sat at the table and asked the waitress for another round of drinks for the table and an appetizer. She hesitated and stated she had to ask the manager because my party had been there already without me, it may be an issue to add something after the fact. After about five minutes she proceeded to take the order. Then I told her I was ready to order my dinner, she told me no and I asked to speak to the manager. \n\nThe man came to the table, very unprofessional, asking what is the problem? I explained my concern, stated I was with my party, I had already ordered drinks and appetizer and wanted to order my entree. He said I would have to put my name on a list because there were guest waiting to be seated and we had been there for too long. I was confused because I didn't see a timed policy and either way, We were still spending our money on drinks and food. He then stated \" my house my rules, I would not come into your house and tell you what to do, so don't try in my house\". This is a very twisted mindset from a restaurant owner especially because this is a business, not your house, and you aren't doing me a favor, because I am spending my money. Needless to say, I asked him for the check and said cancel my orders, we will not be returning. he then stated \"he does not care\".\n\nBefore leaving I reminded him that customer service is your best advertisement, but I got the vibe that he was less concerned with me and my guests coming back anyway, hence the way the neighborhood has changed. They do not want to see too many of \"us\" in the area.", "author": "Alexandria B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "This is a great little Thai place and the location is perfect as its on the main street. The atmosphere is nice, and I love that they have outdoor space in the back. The pad thai is really good and we love the vegetable curry as well. The portions are also quite large, so you can either take extra for the next day, or just share a few dishes.", "author": "Trudy B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-19", "description": "Don't believe the prices, it's almost double when you go in and pay. I looked online and phoned to pick up. They have decided to update all their prices but didn't update their menu online.\n\nThe calamari was cold and dry.\nSticky mango rice was too hard.\nCurry was over cooked with the vegetable dead and lifeless.\n\nWould not have posted if food was worth the money. Sadly it was not. \n\nGood thing there is 5 other Thai restaurants in the areas. Plenty of other options.", "author": "L D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "Food was ok very inconsistent been here a few times it's hit or miss on some dishes the fried calamari was under cooked and my steak was over cooked the kitchen is open so it's weird to watch the cooks chewing I don't think I'll return place has gotten over rated over the years .", "author": "T F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "First of all.. Cash only. I found out the hard way :( but there is an ATM across the street at the bar. Anyways, a very cute Thai restaurant located in Brooklyn; there is outdoor seating (extremely cute). The staff was very polite, attentive and the service was fast. I got the seafood fried rice which by the way was soooooo worth the price. Loaded with shrimp and squid, large portion. The appetizers were so fresh, by far the best calamari I've ever had (and the sauce it came with was deliciously spicy). Thou there were many people here, I was surprised at how fast the service was. Definitely will be going back whenever I'm in the area.", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "This is hands down my favorite Thai food restaurant period! I have yet to try a better pad Thai anywhere else. I find that most pad thai is too dry but this is always saucy and delicious! Me and my husband always have trouble deciding what to order because we love it all.  The shrimp pineapple fried rice is another one of my favorites.  The Pad See Yue is always on point and the red curry is delicious! For appetizers we love the fried calamari and fried tiger shrimps.\nThe cocktails are also great, I love the lychee martini and my husband always has at least two Thai iced teas.", "author": "Diana F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Joya, you definitely brought me JOY.\n\nCame here on a date on a Sunday night, and I have to say, the food led to great conversations and a great evening for me.\n\nFirst off, we started off on two appetizers of fried tofu and curry chicken puffs. I wasn't too keen on the fried tofu, but the curry chicken puffs were another story. I'm usually one for spices, but I didn't taste much curry in this dish, although that was easily forgivable since I'm a big fan of crispy puffs. \n\n Our main course for that evening was chicken pad thai and massaman curry. As an ABC (American Born Chinese), I have had my fair share of Chinese, American- Chinese, Japanese, Thai and even Asian fusion under the sun. For me to say that I can enjoy Asian cuisine usually require a restaurant to amaze me. \n\nAnd Joya, passed the test. \n\nTheir chicken pad thai was made with great flavors. Mildly sweet, not very oily, or even overtly salty, and they absolutely did not  skimp on their ingredients. They gave a large portion (fitting for two; yay for dates!), that at the end of the night, we have had to brown-bag it home. \n\nOn the massaman curry with beef, another large portion with great distinctive flavor. Again, I'm big fan of spices, however, this curry can't be judged on its spice. It was smooth and mildly rich, perhaps from the use of coconut milk, and the beef was cooked perfectly so that every bite along with the potatoes made you crave for more.\n\nOverall, the ambience was nice. Hanging artsy light-bulbed lights with a touch of that Brooklyn feel that always draws the locals in.  Atmospheric setting that sits between formal and informal. They also have an outside patio for those summer months, however it was closed off that day due to rain.\n\nWould I come back? Yes; and that is coming a lot from a Queens girl.", "author": "San H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "Joya and their 2 other sister locations (Songs \u0026 forgot the other location name) are so amazingly good!!! They are my favorite Thai places to eat in Brooklyn. I say get there early because they are always busy! The sad part is the locations are pretty but small. Joya is bigger than the other two!! \n\nThe food, appetizers and Thai tea are really good! The Thai tea isn't too sweet and drinkable!! The food are freshly made and quick service!!! The food is tasty and light!!! The food isn't greasy which make it worth eating!!! I hate greasy and salty food!! \n\nThis location is hard to find parking but it worth the street parking struggle!! \n\nThe best thing is the prices are so affordable for tasty and healthy food!! Love it", "author": "Precious P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-01", "description": "This is the first one star review I've ever given.  I'm usually a 3-5 star rater on Yelp and rarely have a horrible experience.\n\nHere's what's interesting.  The food was good and we didn't wait long.  The ambience is nice and location is really good.  \n\nThe bad part:  The owner is a complete jerk who goes out of his way to be rude to paying customers.  I've never experienced such an unearned insulting by a supposed restaurant owner.  I took some solace in the fact that he was insulting a number of paying customers on the way out simply because he was having \"a bad night.\"  Our waiter apologized for the owner's behavior on the way out.  I can only imagine what it must be like to actually work for that ingrate.\n\nFour star food isn't worth an unnecessary attitude and insults by an arrogant, obtuse operator.   There are plenty of amazing restaurants in Cobble Hill / Carroll Gardens. \n\nThis is one you should avoid.", "author": "James E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-14", "description": "I will start off by atleast saying this places food is great. I loved it. \nHowever everything else was awful...\nThe service wasn't great. My food was 15 minutes late just because our waiter forgot to put in my order. My party was done by the time my food arrived.\nAlso they have this great idea called \"1 table 1 check\" ... So when you have a group where everyone is paying separately you have to sit down and use your calculator to separate everything amongst your party. Such a good idea...\nAnd our bill was wrong which also made this splitting experience difficult...\nDon't know if I'm coming back.", "author": "Beau W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Went there on a saturday night around 8pm, and we still got seated really fast. We got lucky and sat in their backyard. The food is inexpensive and delicious (we all took currys). I would totally come back, the backyard is really nice!", "author": "Feia N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-04", "description": "I used to live hear by and loved this place. I happened to be in the Neighborhood the other day and I stopped by. I don't know the management has changed or budget cut but their lovely fresh flower arrangement that always occupied was gone. The tofu tasted sour and when I pointed that out to the manager he was \"the chef said it tastes good, did you use lemon on it\" I was like I should know the taste of lemon and tofu going sour. wtf...very disappointed indeed.", "author": "tatiana H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "Joya is nice , the food was okay ,but my shrimp wasn't cleaned so that's why I gave it three stars .the atmosphere is very busy and noisy . It's always crowded it seems and busy . My spring roll was extremely greasy like it was swimming in grease. Joya is cool just not my speed .", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Joya is the best Thai food in Brooklyn Heights/Cobble Hill. The restaurant itself is beautiful, dim mood lighting with flattering warm lights throughout. They have an open kitchen, I loved being able to see the chefs! I have had the tofu pad Thai, and my personal favorite the spicy tofu noodles!", "author": "Christen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-17", "description": "The ambiance in here was very nice.I do like the fact I seen kids in here so at least I know its kids friendly.The place is very neat and clean,the service was pretty quick.Overall a good experience,the staff could of been a little more friendly but wasnt too bad", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "There's no shortage of Thai offerings on Court and Smith streets, and Pok Pok isn't far if that's more your thing. This spot really fell flat for me. \n\nPrices are ok, and the ambience of the space itself is very nice, but the food just isn't good. The tom kha soup came in a generous portion for $4.50, which didn't matter because it was so unbelievably salty I could barely get through the broth. Veggie spring rolls were dripping oil and the plum sauce was overly sweet and syrupy. The vegetarian pad thai was also too salty though not nearly as bad as the soup. Just overall too much salt and sugar covered up the flavor of all the vegetables and other ingredients. Bummer. \n\nTruth be told, Ghang Thai just down the block is a lot better for tom kha, and it looks super similar inside. Service there is super nice, too.", "author": "Annie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "Tom yum soup and pad thai were almost sickly sweet. Seems very Americanized. Won't be back.", "author": "Bonnie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-07", "description": "My last visit to on father's day.  I was really looking forward to the spring rolls which I've had at other Thai restaurants. When my order came the spring rolls were very thick and somewhat oily not to mention they had a very powdery taste and if there was chicken in it I did not find any. The crust was thick and not flaky,  I would rate the food and service less than desirable.\nIf you want a trendy atmosphere then this is your place, but if you want authentic Thai food and warm and courteous service try Cafe Chile you won't be disappointed.  Try it you'll like it!", "author": "Cherly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "The food was perfect. Dining room is beautiful and impressive. Went there on Saturday of Memorial day weekend. We knew the restaurant would be packed on a weekend so with had a late dinner. It was 10:30 at night, perfect time to go in. Our food was nice and hot. We didn't wait long to be served and the staff are really nice. So worth it. The price is just right. Loved this spot.", "author": "Issa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "I decided to give Joya a try from seeing the advertisements on TV. WORST DECISION EVER. My boyfriend and I got seated right away, however there were large parties there and we could hardly hear each other speak because they were SO LOUD. What really killed it for us was the fact that there were RATS ON THE CEILING PIPES RUNNING BACK AND FORTH. We told the guy who had seated us and pointed to where they were still running back and forth at but he didn't even seem fazed. We speed walked out of there and are never returning", "author": "Amanda L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}