{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "I've frequented Joya many times for lunch, try their spicy pineapple chicken - it's out of this world!!!! \n\nService is fast and always friendly. Your food is always quick and fresh so if you're pressed for time for lunch and dinner they're an obvious choice. \n\nThe atmosphere is chic and trendy and you can see the food being cooked if you're seated in the back. Tucked further away on court street it's easy to miss, but if you love Thai food this is a highly recommended.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-05", "description": "\"If it ain't broke, don't break it.\"  Joya used to be one of our favorite places. Unfortunately, they 'broke it.'  Amazing thai mussels - gone.  Amazing thai bbq wings - gone.  Amazing basil sauce - replaced w/ what seems to be a mix of curry and watery basil.  \n\nHopefully, one day, they will recover.", "author": "David F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "This place was really good. The food was simply delicious. I had the egg rolls as an appetizer and then I had one of the main curry dishes. It was very scrumptious. To me, it seemed to be a little expensive for what it was. The venue is very nice looking and fancy but their prices are on the higher side. My friends and I only had cash with us on that day. The total bill came out to $90 and amongst all of us we had $90 EXACTLY. So we paid the bill and we headed out the door. \n\nOnce we were out of the restaurant, one of the guys that works here comes chasing us down demanding that we return because we didn't tip. I came back and tipped him $5 with my credit card. He then proceeded to say that it wasn't enough because it had been a $90 order. \n\n1. I understand it's common courtesy to tip. But understand that not everyone is going to tip you no matter how large the order is. We simply didn't have the funds to tip. We're thankful we at least had enough to pay for the food. Some people will tip you nothing, and some people will tip you $100. So when you don't get a tip, DEAL WITH IT! It's not always personal and it's not always that we're being selfish, we simply don't have too much to give. Besides, your prices are already high.\n\n2. It's super unprofessional to run up to people and demand them to come back and pay for tip. And it's even more unprofessional to try and force them to pay what you want them to pay.", "author": "David M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-02", "description": "Reminiscing to my BK days when I once resided in this area. When my friends asked me for a Thai place to recommend Joya came to mind. I love the ambiance which is relaxed and not upscale but, with the exceptional customer service. They serve a decent portion of food that had us all packing it up. I ordered their red curry noodles which was a bit spicy and had me reaching for my beverage but, it was tolerable and flavorful.", "author": "Lidia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "I've been coming here for over 10 years and they're so consistent with quality and taste. Every time I come here I try and order something different and it's always AMAZING. \n\nStarted off with fried calamari and chicken curry puffs, great choices. Im a huge fan of their dipping sauce for the calamari. I also used it to dip my chicken curry puff. \n\nFor entrees we did a garlic beef dish with broccoli and carrots. I did the masaman curry, and my boyfriend did the pan ang pork. Everything was so delicious. We didn't leave anything on our plates. \n\nFood is always super delicious, service can be better but honestly the food is so good and comes out so quick I don't care about the service. Highly recommend to come here as much as you can. \n\nThey don't take reservations for parties less than 6 people, parking can be vicious on the weekends. Enjoy your experience, I know I did!", "author": "Julio G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "The food is great I love the chicken curry puffs and rolls!! It's a cute resteraunt too. The drinks are good too.", "author": "Hyacinth F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "My husband and I have been coming to Joya for over 15 years. The food, the service and the atmosphere is always consistent. Truly one of the best restaurants in NYC and our favorite Thai place. Sitting there at dinner today, my husband and I realized that same people have been working there since we started coming to Joya. Of course it's no secret why that is. The owners of the restaurant are really nice warm people. They treat everyone with kindness and make us feel at home. They extend the same treatment to their employees which translates into excellent food and amazing service. It is really nice to come to a place where you will ALWAYS have an excellent meal and ALSAYS be treaded warmly and with nothing but kindness. It helps that the food is amazing and reasonably priced. Highly recommend this place!", "author": "Aleks A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Very hip and nice thai restaurant located in cobble hill bk. The atmosphere is very nice, there's a bit of a bar scene. The kitchen is open partially and you get to see some of the magic happen. Denotes itself as a thai restaurant but definitely has some Chinese influences. Pretty authentic as well. Food is fresh and there's flavour.", "author": "Rivya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "Consistently delicious and perfectly priced dishes!  Modern inside with backyard dining option. The bathroom is always clean.  Fast and efficient  service.  A bit pricy, but splurge on the lichee nut martini to start your night off right!", "author": "Sara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "It's been some time since we've patronized Joya in Brooklyn.  What a delight \n\nWe enjoyed dirty gin martinis \nSpicy noodles were a good...\n Green curry was so flavorful\nSeafood spicy curry soup was  delightful \nSpare ribs with veggies in a Thai sauce - ribs were tasty and could just right, veggies were fresh and crispy.\n\nWe ordered three entrees and soup.  We had a ton of leftovers which were so good the day after.\n\n\nMust patronize more often!!!!!!!", "author": "Claudia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "We've been coming here for 20 years.  Restaurants come and go on Court Street - but Joya has remained timeless.  Our favorites are Pad See Yue and Kang Kyo Whan Koong and always with a chicken satay appetizer.  It's tasty, fresh food at the same prices of Cobble Hill circa 2000.  Nicest owners, chill atmosphere.", "author": "Valerie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "This place was amazing!!! I came here with a friend and we decided to share since we were told the portions were huge. We had the mango salad to start which had a citrus sauce that was a mix between sweet and spicy. We then had the seafood curry coconut. It was a huge portion filled with everything you could imagine. Mussels, Calamari, shrimp. It was great!!! Perfectly spiced.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "The food here was mediocre. I've definitely had better. I sat at the bar and the bar tender was not pleasant. Apparently they do not have a cocktail menu silly me for asking. The bar seemed to be a full bar, I was assuming a few flavors for martinis and cosmos. Drink I ordered was the mango martini (if I'm not mistaking they have 2 flavors which isn't listen on the menu) I had the shrimp and broccoli fried rice for my entree. Not much flavor, a few shrimps not cleaned properly, and rice very mushy. I must say it was freshly cooked, the temperature was very hot which I liked. The neighborhood is beautiful and a few things to do around. Chances are I won't be returning, but I'm not ruling it out completely.", "author": "Tanisha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-03", "description": "The pad thai is good. Curry is pretty good. The mango salad is super. This place is cheap and decent.", "author": "Thy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "I've been waiting to find a dinner spot in my hood that I just loooove and this place is at the top of my list right now!! :)\n\nMy friend wanted Thai and while a new place opened up closer to me, the amount of good reviews here was just too obvious not to come.\n\nI mean:\n+ yummy food\n+ I love the Thai tea\n+ cheerful staff\n+ modern look\n+ cute outdoor space\n+ in my hood\n+ awesome value\n\nDANG, Y'ALL. I love Joya and will be back soon. x3", "author": "Connie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Came here on a Monday night.. love this place right in the heart of downtown Brooklyn.. the ambiance was really chill with a dim lighting.. love open kitchens and they had a great one.. they have a full bar but no cocktail menu.. we started off with a number of appetizers including the mango salad, tom Kah soup, and calamari.. I had the basil chicken for dinner which was delicious.. would definitely check this restaurant our again", "author": "Shashank C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Had an awesome dinner here on a Saturday night. I think we got there around 9:30, it was still pretty busy which we took as a good sign. We did chicken curry puffs to start and they were phenomenal! Both entrees were also excellent. Lots of flavor and just the right amount of heat. The only downside was our service was pretty bad. It just took a long time for our server to check on us after food was delivered and when we wanted the check.  But overall, the food is great and good atmosphere! 3.8 stars", "author": "Alex I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "I love Thai fried rice so I'm always excited to go to a Thai restaurant. My boyfriend took me here one night and for some odd reason I didn't order Thai fried rice. I wanted to try something new so I ordered stirfry chicken (I can't remember the exact name of it on the menu, but the picture is attached). As soon as I receive my plate I was disappointed because it look like soup with a side of rice. I wasn't fond of the taste at all. My boyfriend ordered the Thai fried rice so that is what filled my belly a little.\n\nIf I return, I'm hoping that I will enjoy their food.", "author": "Ayaa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "I had the spicy noodle with chicken. It could've been a tad spicier but it was amazing. I will definitely be back and recommend.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "My cousin and sister chose this location because they love Thai food ! I'm not really a Thai food person but I must say that this location is very nice. \n\nThe venue is nice and very calm. I love the vibes here. \nThe food is very good. \nThe drinks is very good. \n\nI would definitely come back and recommend this location to a friend.", "author": "Elaine F."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}