{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "Recommended by a friend....hands down this is an awesome eatery in downtown Bklyn! The food portions are ridiculous--come to this spot with an empty stomach!! The dollar goes far here between the food/drink specials and combos!! On the weekends you get some music entertainment from the house DJ!! When it warms up, the backyard turns into a candlelit dining area--simply an extension of the main area...Gorgeous!!!! It fills up quickly so get there early!", "author": "Chante R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-26", "description": "Fantastic!  I love this place and come whenever I'm in Brooklyn.  The hot and spicy noodles are to die for!", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "best thai food ever! period", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "Love this place and its sister restaurant Song! The food is great and so are the prices! It really does not matter if you choose Pad Thai, Curry, or one of the specials you can not go wrong!", "author": "Letitia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "Worth the 15 minute wait for a table! Can't beat the prices (8 dollar entrees) and the serving sizes were plenty for a meal (and maybe leftovers). Loved the veggies in red curry! Could've done without the summer roll appetizer. Fairly loud inside. Guessing the outdoor patio was quieter. Will definitely go back for more!", "author": "Hilary F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "My boyfriend and I love this place. It gets crowded quickly though. We order out a lot and sometimes they get the order wrong, so double check. The food is always delicious though.", "author": "Dina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "I have never had a drink or bite I didn't like.  The owners are very hands on; perhaps that helps keep things very consistent. The massaman curry is sweet as it is spicy.  They find a delicate balance here.  The drinks are always fab and the fried calamari is a must.  Don't pass Joya by, stop in and be pleasantly surprised again and again.", "author": "James P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-31", "description": "great dinner prices!! got the pad see ew, and it was great. you can't really go wrong with pad see ew though.. but aside from the food, the venue is adorable, especially the outdoor seating!", "author": "S W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "So, I went there late one night when visiting a friend in NYC. Awkward trying to get seated, but after that...Wow...talk about huge portions! The food is amazing and the price is cheap for the amount you get! It's like take out prices...about $7-9 per dish. Watch out, though, they don't take off the tails on the shrimps so make sure you don't try munching down too fast. There's a rockin' house DJ that sets up near the bar and the drinks are reasonable in price (about $5 on up). They even have a Brooklyn Brewery beer on tap. The atmosphere is just awesome w/ the decor; it's like urban-chic meets Feng shui. Great food, great drinks, great atmosphere, just great all around. I'm definitely going to hit it up again when I make a return visit.", "author": "Elaine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-31", "description": "i ate there with my girls and it was a very nice experience, we absolutely love it. it was there that i was introduced to Thai food for the first time, and since then i've been hooked. the place and decor was awesome, nice and intimate, and lively ambiance. But a bit on the small side.\nand did i mention cheap? hell yes!", "author": "Vanessa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "We've been Joya groupies for about 12 years now and have never ever been disappointed.  Not only is the food outrageous, they have a full bar, fast service \u0026 great music all for an extremely affordable price.  My husband gets the Pad Thai all the time and loves it - I don't know what those other reviewers are talking about - they must work for the competition.  And really, if the food was that bad, wouldn't you send it back?", "author": "Regina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-13", "description": "I decided it was time for second chances.  While sitting at home on a rainy Thursday afternoon (waiting for a UPS delivery) I decided to give Joya another try.  After ordering the shrimp with green coconut curry and veggies, I was once again pretty disappointed.  The vegetables were so soft and mushy and there was way too much sauce (felt like I was eating soup).  The texture really turned me off.  On the plus side, the portion was so huge that it lasted me the entire day (lunch+dinner).  Sorry Joya, that was your last chance.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Joya is Amazing! I have been living in the neighborhood for 8 years and I can never get enough of Joya. I must eat there at least once a week! sometimes 3 times! the beef pad see you is incredible! the chicken panang guy is so spicy and so gooooddddd! the chicken fried rice and the chicken spring rolls and the calamari are my go to appetizers............ but really everything is good! and so affordable! the service is great the atmosphere of the restaurant is very cool without being pretentious........ there are not enough good things i can say about it! LOVE LOVE LOVE", "author": "Megan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-30", "description": "Joya is perhaps the best Thai food I've ever had. And on top of that, it is always the cheapest meal ever. I once went here with 4 people and the bill was $40 (4 entrees, water, \u0026 we shared one dessert). This is not a place for quiet conversation though.", "author": "Jacinda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "Very yummy! went there last night for dinner with a friend and enjoyed I love the cobble hill area as it is, but its funny this place also reminds me of Song which is located in Park Slope.. same owners maybe, but what I liked most is that it wasn't packed, \u0026 we didn't have to wait forever to get a table, perhaps because it was a week night, none the less I will be there again at some point. But no complaints what so ever", "author": "Ayanna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "love me some joya! small bar, but great to sit at. incredibly inexpensive food, yet amaaaaazin Thai! Sit out back when the weather's nice! try the chili basil sauce, also calamari \u0026 papaya salad!", "author": "Pat F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "This place is great...you get fresh tasty food for a really good price..\n\nI love their woon sen, curries and seafood dishes.", "author": "Sanabel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-26", "description": "I spoke too soon.  I really wanted to like this place.  It's good for the neighborhood but does not match the hype behind it.  I had their mussaman curry recently and was really unimpressed.  It was prepared with steak and the coconut milk was still very watery.  It's supposed to be prepared with stew meat and have a thick coconut milk sauce with coconut cream.  I also had the Pad See Ew recently and quite honestly thought it was kind of bland for Pad See Ew.  I definitely ate it, but I was kind of disappointed.  I also wasn't really impressed with their Tom Kha.  It was really missing the galangal/ginger  flavor.  It tasted like they just used chicken brother and threw in some coconut milk and hoped I wouldn't notice.  So I really have tried to like this place, but I'd rather go somewhere that made better Thai food than myself.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-07", "description": "A bustling Thai joint in Brooklyn.  Went here on a Saturday night.  There was a wait so we had some brews at the bar and people watched.  It was a nice night so we decided to dine on the patio.  Servers were a bit slow we waited 20 minutes before anyone even came to our table.  For appetizers, we had calamari - which I thought was bland.  I've definitely had better.  I had the chicken Pad Thai which was decent.  Nothing special.  Overall a cute restaurant but the food was just \"OK\".", "author": "Kim H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-05", "description": "When I walked in and told the woman I wanted an order to go she looked at me like I was crazy. (Just to clarify--yes, the do \"To Go\" orders) Though there was nothing bad about this meal there was nothing really amazing out it. The shrimp appetizer with plum sauce was definitely the highlight of the meal. Also the bathroom opens up right in the middle of the dining area, which I thought was really awkward.", "author": "Samantha G."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}