{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "Certain foods were amazing! (mussels) Some dishes were good enough to cover up my tiring experience. But others, not so much. I had the Pad Thai with vegetables; the rice had a nice flavor but the vegetables were actually bitter. \n\nHowever, the AC started to drip water droplets and they were falling into my food and on me! It was an awful experience. \n\nAdditionally, the place is incredibly busy. They got our orders messed up and we waited a while for our takeout boxes.", "author": "Julissa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "We came so many nights ago and had a great time. Cute bustling place on a busy street in park slope, we ordered a bunch of things I cannot recall now. The overall sentiment, I do however, remember. It was good and simple. Not overly complicated nor knock my socks off. It was the company that made it a swell night.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "I love that the food comes out quick but most importantly hot! We had the firecracker shrimp as an Appetizer followed by  the Fried snapper with curry sauce and veggies \u0026 shrimp fried rice. Everything was really good. Their Chai Iced tea and spare ribs was good as well. There is room for improvement in terms of customer service. Our waitress wasn't very attentive and did not check-in with us periodically. We found ourselves trying to get her attention a few times. Other than that everything was great.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-16", "description": "I frequent these establishments regularly. Most of the time it's National Thai. Last week we were in Joya two days (Sunday evening \u0026 Friday nite). The food, as usual, was great! My group ordered a few appetizers so I decided to take my food to go. I asked (as I usually do) for a to-go container and all hell broke lose. I was told that they don't allow customers to pack their own food to go. That was absurd because as I mentioned before I frequent one of these restaurants at least once a week asking to pack my own food is usually not a problem, so I know better. The catch is between the three restaurants, they interchange staff...so the staff knew me. This made me more puzzled. The surprise came when I eventually had to ask to speak with the manager. I was told he was busy. I'm assuming he would come over when he got a moment. The manager (who I discovered was the owner) never made it to our table. As my group was leaving I went over to him to address the situation and he became very dismissive and proceded to tell me that's his policy in all of his restaurants. If I didn't like it, oh well! I then informed that I would not be patronizing his restaurants any longer. My problem is he never acknowledge or even came over to our table to see what the problem was. The waiter was in distress because he said he was going to be fired. I could not help but to wonder if I was a different nationality, I or the situation would have been handled differently. Additionally, I consider myself a regular, I have never seen this man at any of the restaurants. Maybe that was a good thing!\nNevertheless, I refuse to spend my money where I'm not respected!", "author": "Atasha J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "This Thai is getting by...\nJoya is okay. I think they are adding some sort of sweetener/unnatural flavoring to the food. It just doesn't taste like fresh, real Thai food. Papaya salad was overly sweet. Basil chicken had an excessive amount of sauce...just didn't taste great. Sorry boo, but I'm not feeling you.", "author": "Via G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-13", "description": "Honestly, I was very disappointed by this experience. I read the great reviews of Joya and was excited to take my mom here for her birthday since she's never had Thai. The interior decoration was very hipster and lovely with Edison light bulbs and a cute outside seating spot. When we walked in, the restaurant was packed with people, but we were seated in about 15 minutes. \n\nWe were given a specials menu that was hand written and a regular printed menu. The specials menu was, in some ways, difficult to read. And they have a mixture of special appetizers and main dishes all jumbled up in there with no differentiation. So I ended up ordering an appetizer that I thought was a main dish, and thought that it was a main salmon dish that costs $17, but was completely something different - an appetizer that was $7. When they put it on the table, our entire table was very confused and we tried to clarify what we had ordered, what we had expected, etc. Three staff members had come over and just kept arguing with me instead of clarifying it. \n\nDuring our entire meal, it was very difficult to get our waitress's attention. She had not come over once to see if everything was okay or if we had needed anything else. By the time we were done with our meal, it took several tries just to get her attention to pack our leftovers and for the check. She packed our leftovers, one of which was a liquid curry, in one of those paper take-out boxes rather than the plastic containers. Needless to say, we didn't want to impose anymore so we walked out hoping it wouldn't leak through. That was for sure not the case. By the time we got home, the liquid had leaked through completely, as well as through the plastic bag that was holding everything. \n\nAfter getting our check, we waiting for quite some time for her to come pick it up, but she never did and we eventually went up to someone else to run our payment. Note: she was not the only waitress for the entire restaurant. She had other tables, but definitely neglected mine. So, I definitely give the service here a 1 star. \n\nIn terms of food quality, I was also very disappointed. We ordered the tofu appetizer, the tom yum soup, the salmon avocado mango roll, the mussels special, and the spicy noodles. The tofu appetizer was decent, the tom yum soup was salty, the salmon avocado mango roll I would not order again, the mussels seemed not fresh although the base was pretty good, and the only thing our table truly enjoyed was the spicy noodles. So I would give the food 3 stars. But our overall experience in the restaurant was 1 star, and I don't think I'd ever come back or recommend to others.", "author": "Bren W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-24", "description": "This restaurant white own restaurant was the worst experience I have ever had I would not recommend anyone specially black people to go here he is disrespectful and they have bad service.", "author": "James L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "One of my go-to Thai restaurants in New York. Their portions are decently large, you'll definitely be able to order family style and share different things. On weekend nights, getting a table may be difficult but don't worry... there are bar seats! Service may be a bit on the slower side but staff are very accommodating, ensuring you're enjoying your meal. I always have the spicy noodles whenever I come here, excellent flavor! But I always hated their carrots, it has a weird left-out-to-dry kind of taste. The green curry was a tad too sweet for my liking. The papaya salad is a heaping pile of papaya but I would prefer it to be less soaked in fish sauce. Although I have so much to pick at, I still like this place a lot! \n\nBut I must note, take out tastes extremely different than dining. I ordered the spicy noodles to go and it was superbly bland. They obviously forgot to put sauce or salt.", "author": "Celeste Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "I thought this place was great. Walking in, even just to pickup, I could tell the staff was kind and attentive and the décor of the place was very modern and sleek. I wouldn't have minded eating there for sure.\n\nI ended up getting a Thai curry, which was pretty good. Normally I don't get curries but tried it here and was not disappointed. Although I will add that a friend and I both got different curries, but oddly enough ours tasted pretty much the same. Not sure if they were supposed to or not but it basically seemed like we got the same dinner even though we didn't. Regardless, it was good. One thing I will say is I was not a fan of their spring rolls. Tasted a bit odd and definitely not traditional. I'd definitely come back to give it another go.", "author": "Ian G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "Modern space, good service, but all the dishes were over salted and chicken was dry in coconut soup and in pad tai. How do you screw up that?\nI hope they can fix it!", "author": "Cat P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "This restaurant has a beautiful ambiance and usually a set of polite staff. It remains one of my favorite Thai restaurants in NYC even if I don't come often enough. They have really good pad Thai and all of their other dishes are usually better than other Thai restaurants.", "author": "Susan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "I am deff a regular here. Everything here is amazing , service drinks food probably the best Thai place I've ever been to !", "author": "E E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Great Thai!! Highly recommended! Great staff and price is extremely reasonable. I got the pad Thai and my husband got the spicy drunken noodles! I wish I ordered his, they were both so good but the drunken spicie noodles have so much flavor!", "author": "Genevieve P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "My first time having Thai food definitely enjoyed it! The food was fresh and tasty. I had the Sweet Riesling wine very light loved it! I will be back", "author": "Dee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Best Thai in brooklyn! Joya has cool modern decor, and a lovely garden in the back. The staff always greets you with large smiles and sweet Thai hospitality. \n\nThe food is always fresh and tasty, comes out quickly, and is an incredible value! \n\nI like to share when I go there and typically start with the salmon spring rolls and mango salad, then get noodles (pad Thai and see ew) and curries (green!) \n\nI'm a bit of a snob with Thai food after spending 2 weeks in Thailand, but Joya's is as close to the real deal that I've found in NYC.", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Have been going to this place for years and order from there regularly... consistently high quality food and awesome experience every time. THANK YOU for hooking us up tonight- we'll be back soon!", "author": "Inna K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "I ordered through seamless. waiting through the entire ETA time, then called the restaurant. i was told that there was no seamless delivery person to deliver my food. the restaurant made no attempt\nto call me to tell me this. I understand that this type of thing might happen, but the restaurant could have at least called me to tell me what was going on. extremely poor customer service displayed by this restaurant.", "author": "Shane H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Authentic Thai food with a hipster zing. When you walk in, it doesn't feel like a Thai restaurant with the open bar and lighting. However the food is on point, the pad Thai must be handled by chefs straight from Thailand. It's a perfect little restaurant to have date night, casual and not too quiet in case it gets awkward... \n\nI ordered the kang nuur (green curry) with brown rice at no extra charge. My girlfriend ordered the pad Thai. We also started the night with papaya salad and some fried calamari which makes every meal better. The servers were also very friendly and welcoming throughout the entire meal.", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Joya has always been one of my favorite restaurants to go to. I've taken friends family and coworkers and every time has been five stars across the board.\n\nJoya is a sister restaurant to two other restaurants which are song which is located in park slope brooklyn and sea which is located in williamsburg. Out of the three joya is my favorite. \n\nUnlike the other two restaurants the food is consistently great here. Some reccomendations are:\n\nAppetizers:\nCalamari \nSpare ribs\nChicken or vegetable spring rolls\n\nMain entree:\nChicken pad see ew \nChicken fried rice\nChicken and oyster sauce (comes with veggies and white rice) \n\nFor desert the banana spring rolls are a must try. They are sweet banana spring rolls topped with ice cream and chocolate syrup. I wish I had a photo of it but it doesn't stay in site for more than a minute before I scarf it down \n\nJoya is a restaurant I will be coming to until I no longer live in brooklyn. Great food and chill ambience that is good for a romantic dinner, food with friends and even alone.", "author": "AMANDA R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "One of my all time favorite Thai places in NY. Everytime we are in NY, it is at teh top of our list to go to. GREAT prices and I just can not find pad-thai better anywhere else. You won't regret coming here. The locals will be waiting in a long line here on nights and weekends. Be sure to get yourself a reservation, or go early.", "author": "Anne M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}