{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Great place to eat and very generous with drinks! Lately food is not as great as it was couple years ago, but still 5 stars. Before it was 6 :)", "author": "Gregoriy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "Been eating here for about 10 years. Though it is common to find superb food in NYC, it is rare to find superb cuisine at a relatively cheap cost. The best thai food I've had in NYC.\n\nThe pad thai is a little bit different than how it was about 5 years ago; not as tasty (healthier?).  It is still excellent however the spicy noodle and curry are even better.", "author": "Joey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Thai food has become a staple in everyones diet lol. With that being said, look no further than Joya. Ive been comming here since 08 and it never dissappoints. Great prices, good portions and good ambiance. Outdoor seating in the back as well. 5 stars all around", "author": "Kessie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "I've been here many times past but it has been a few years since coming back to this place and I must say that they have not lost their quality of great tasting food. Tonight I took no pics yikes! but, I had a delicious serving of chicken curry puffs as an appetizer and spicy seafood fried rice as my entrée. Everything was so delish and now I'm reminded of why I fell in love with this place years ago. I will be back soon. Oh btw you can get a full meal for under $10 and end up with leftovers :-) awesome!!!!!", "author": "Kai M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-25", "description": "This place is okay. I gave them two stars because they have a lot of flies and my noodles came out burnt. Wish I had a better meal", "author": "Navina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Came with the wife had a great time...the wait was going to be long but we sat at the bar. I love the vibe of the Resturant first off but my wife got pad Thai which was absolutely amazing I can't believe it tasted that good and the size is the perfect amount I got the red curry with shrimp and eggplant which was great also had a nice amount of spice along with good amount of shrimp it was so delicious. I can't imagine another Thai Resturant worth visiting", "author": "Teddy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-03", "description": "Wow. And NOT in a good way. \nBland, bland, blaaaaaannnnd. Over-cooked everything; literally white pad-thai with more bean-shoots than noodles, and 3 teeny, sweaty little shrimp; chicken panang with three pieces of chicken, padded to the gills with bell peppers; and worst of all the heaping mound of chinese broccoli they made us pay entree money for (because they don't do sides and they don't serve vegetables with anything - again, peppers do NOT count as vegetables they are a fruit...) which was lifeless from overheating and drowning in a thick, weird sauce. \nIck.\nNever again.", "author": "Dora F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-05", "description": "Figured I'd try something I haven't had yet so I went with the sauteed squid with broccoli carrots cabbage in garlic sauce. Outrageous. So outrageous in fact that I was taking pictures of it when it was delivered to my table. \n\nSpring roll appetizer with shrimp, avocado and peanut sauce was new and delicious. They gave mustard as a dipping sauce which I didn't think would work, but wound up working just fine.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "This is by far my favorite Thai spot ever. I've been to some Thai spots in California, and Joya still beats it by far. My favorite dish is the spicy drunken noodles with shrimp. Pure heaven!!!", "author": "Rukayatu T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "So Cheap and so good! Didn't even have to wait for a table on Saturday night. The Massaman Curry was amazing.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "Very trendy the energy is good, food was fresh, not too heave and very tasty. Service was great. I would recommend everyone to visit this location.", "author": "Si P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "Competition is tough for good Thai food in this neighborhood with so many options within a couple blocks. Joya is good but not my favorite. Why I wouldn't give it five stars is because there is almost always a wait,  even on the weeknights,  the stir fry dishes are average with the usual medley of American vegetables and they have seating in the back next to an open kitchen.  It's interesting to see but somewhat loud and messy.", "author": "Spencer L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-03", "description": "Date Night!!!\n\nWe went there because Zagat said it was all that + tax. Well they only take cash. They have no drink menu (where they do that at?) And the mojito I ordered was huge and wasn't all that. The food is good. I am in love with they curry puffs which are huge! I had the crispy duck with jasmine rice my date had the whole red snapper. He liked it.  The place is too loud!!! It is a restaurant it shouldn't be that loud! They need some acoustic foam in there.  There is no place to hang your coat or purse..maybe they should get rid of the bar since they don't do cocktails use that space for seating.  No coat hooks to be found in the bathroom either. They have a wall of candles where not a candle was lit... I might have to stick with Qi and ThaiNY the search for more amazing Thai continues.....", "author": "veranda b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "So many portions! I guess that can be a blessing or a curse. \n\nThe thai iced tea tasted so good and the calamari was still hot when delivered to us. I know there are probably lots of choices for Thai food in Brooklyn but this place is really worth a visit. I had chicken Pad Thai and the generous portion just made me happy that day.", "author": "Alan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "This place was veddy nice. Great food at a great price and the service was top notch. highly recommended", "author": "Mitchell B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-30", "description": "First time I tried this place, and I won't bother to return. In summary: Basically the worst pad thai I have ever had (and I have eaten it a lot). Ingredients are obviously not fresh.\n\nWe went around 6pm when it was fairly quiet and people were arriving for dinner. I had the summer rolls; they were bland and refrigerator-cold, and very obviously they had not been made fresh.\n\nMy pad thai was also bland, and had a very distinct burnt taste, which turned out to be from the eggs, which had lots of black, charcoaly bits; after picking out lots of burned bits of egg, I decided there was no egg left, and the dish tasted burnt, so I told the waiter I would not pay for it. He merely took my plate away without saying nothing, but to their credit he did remove it from the check.\n\nMy friend's vegetable pad thai was very bland -- the tamarind sauce was hardly present, with none of the classic tartness at all -- and for some reason it was served with broccoli.\n\nI observed some other dishes being served to other people, and they did not look particularly inviting.\n\nLastly, while the place looks decent inside, the back garden looks like a cheap tourist destination. Very haphazardly decorated with plastic furniture, and they haven't even bothered to remove the price tags from their plants, which are still in their black plastic pots.", "author": "Xerxes X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "I usually have great experiences at Joya (great food, great prices, nice staff, hence my 4-star rating). But I have to say to Joya's management: your Sunday night bartender needs a major attitude adjustment. \n\nThe last time I checked, we bartenders (and yeah, I'm a bartender and server) make money by giving good service and being NICE. Your bar was closing in 15 minutes? Fine, we ordered, paid and tipped you. I know you wanna go home. WHY are you talking shit to the other two customers about us (and being extra obvious about it) when you agreed to serve us? Get a clue home girl. You catch more flies with honey than with vinegar.", "author": "Devan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "Awesomeeeeee and the prices are cheap as hell. It just gets packed with hipsters. No surprise there lol. Sometimes they forget to bring you water and you're stuck there waiting, dying of thirst. But the green curry is the best, and you can't go wrong with the pad see you (yea, that's not how you spell it, live with it.) Good stuff. \n\nInsiders trick: if you want Joya, but don't want to wait 30 mins for a seat, order out, they do take out!", "author": "Vito P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "This is the sister restaurant to Song in Park Slope. Very simple modern Thai restaurant. The food is very good and flavorful. Will definitely go back if in the neighborhood.", "author": "Peggy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "I only eat pad thai when i go to thai places. I was in Brooklyn for a night and this place was walking distance. The pad thai was good. I've never had bad pad thai so it's hard to say that some places are better than others. It seems very simple to make. I usually judge my thai food on price and amount of food. And Joya was cheap and gave me plenty of food. I was with 2 others that got other entrees and apps and they said both of theirs was good as well.\n\nThe only downside was that it is very loud. The place is very open(including the kitchen) and you can hear everything and everyone.", "author": "Mitch I."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}