{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-18", "description": "Dear People,\n\nWhen one of my peeps told me that he would travel from the Inwood all the way down to Cobble Hill for Thai food, I had to check his cred.\n\nEnough.  So, I decided I'd accompany him on his next venture to get the details behind the commotion he would create around this place.  Please note that 3 means 3.5 in this instance.\n\nFood (the most important part to me):  I started off with the Tom Yum Koong.  Pretty run-of-the-mill as far as other Thai places.  Spice was fine, good hint of lime, shrimp and mushrooms were fine.  \n\nNext up was the Pla Muk Krapow (squid in chili basil sauce).  The dish was decent, but a little too salty for my taste.  The squid was well cooked, not chewy at all and that is a hard feat to accomplish when not frying.  A decent dish.\n\nAmbiance:  Well.  Despite the music being blasted and having to scream all over everyone (do you really need a DJ at a Thai place) the decor and setting were typical of the Cobble Hill area, modern and trendy (brick walls, nicely lit bar, fancy pants, non typical mom and pop Thai place).  This was surprising because usually a place like this tends to be pricey and this transitions our move onto the next topic of...\n\nPrice:\nFor the person I was with and my food, plus 2 beers, our total contribution was $35.  Score. \n\nOverall, if you're ever in the neighborhood and need cheap Thai food in a funny setting, come here.  But, I will not trek a far ways for their Thai food. \n\nThanks,\nJoe\n\nP.S. - It gets packed in there, so bring a book, grab a drink, or have something ready to kill time.", "author": "Joey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-30", "description": "Went here once a few months ago. Had the chicken pad thai and it was delicious! We had some I think wonton appetizers and they were great as well. The prices cannot be beat. It was definitely lively on a Friday night but it didn't take long to be seated and service was good too. Will definitely be back.", "author": "Adana S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-05", "description": "So many other Thai places to go why not to go to Joya.  The food is good but the awful service leaves a bad taste in you mouth!!! Don't go!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "This place, no joke, lives up to the hype.\n\nMinus a star because they didn't answer the phone- I called on my way home, hoping to save time, but ended up having to stop in and order to-go.\n\nThe place was packed on a Thursday night, but it took less than 15 minutes for my veggie pad thai and spring rolls ($10.95, total). The spring rolls and sauce are to die for- next time I'm considering ordering 3 orders as a meal.\n\nThe pad thai was much creamier than most places- and actually has VEGGIES! Not just hunks of broccoli (ick).  \n\nThe place was beautiful, and the back garden looked awesome, too- it's definitely a place to take visitors for a good meal and a drink.\n\nCan't wait to go back!", "author": "Amber S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "Joya is an amazing deal, fabulous ambiance (a bit hard to talk/hear the other person) and some of the best Thai food I've had in NY. Highly recommend checking it out! The longest we've had to wait was 30 minutes on a Friday night at 10:30 PM (late dinner). During the summer, they have outdoor seating that's pretty nice too. Service is o-k, not amazing but definitely fast.", "author": "Maryam A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-03", "description": "Cheap, loud, huge portions, delicious food, great specials, well-run considering the crowds, best calamari EVER... I could go on\n\nTheir take-out can be hit or miss\nCash only\nI don't particularly like their outdoor seating area\n\nInsider information:  they take reservations for larger parties, i'm not sure how large though", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-07", "description": "Let me add what just about everyone else is saying:  Joya brought me a bunch of joya, especially when i got their fried chicken and mango salad special!  WOAH!  perfectly fried, crunchy and the tanginess of the mango salad totally set it off!\nMy favorite dinner partner had a curry noodle thingy that was also amazing.  The waitstaff is great, the ambiance is modern.  Oh and if you're seeing a movie at Cobble Hill Theater, its a perfect stop.  Oh and next door to the theater is a hot chocolate spot that is out of this world too.  Woah, so much to this yelp!", "author": "Paul Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "Okay the only reason why I didn't give them a five even though they deserve it, CASH ONLY AND the WAIT, could be anywhere from an hour to an hour in a half, but the food and atmosphere especially in the summer time is the best. If you want to impress your date with out killing your pocket take them here. If you have peanut allergy this is NOT the place for you dont waste your epi-pen. The food, the host  and the seating area outside is really nice you really get your money worth. Again CASH ONLY", "author": "Brooklyn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "Really this place keeps getting better and better on subsequent visits.  I would give 5 stars, but their mojito this time was very stiiff, but not sweet enough.  We had the duck spring rolls with mango and mustard, beef satay and the special salmon in basil sauce with green beans.  OMG the salmon was TOO DIE FOR.  I'm still thinking about it.  The duck spring roll was also a nice combination of duck, cilantro and dijon mustard with a sweet dipping sauce.  I really recommend anyone to try from their specials menu as both times going there I've had good luck with those.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "I am not a fan of Thai food but i love Joya. My friends and i use to eat frequently at their sister restaurant Song on fifth ave until we found out  there is one much closer to us. The food is amazing and they give large portions for cheap prices. The setting is nice and chic but i don't like how it can be very noisy. \nThe pineapple fried rice and spicy noodles has to be my favorite dishes. And the fried calamari is to die for.", "author": "Balanda J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "Favorite restaurant. Cheap \u0026 delicious thai food. My favorite is the calamari (cooked perfectly each time), spicy noodles with shrimp and pad thai. Can be a long wait if you go after 8. Cash only! You won't be disappointed!", "author": "Kelly V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-26", "description": "Delicious Thai made with fresh, quality ingredients. Fast, friendly service. Trendy ambience. A patio. All entrees are large and $7-8. Drinks are strong and cheap. Killer margaritas. Nothing less than a neighborhood staple.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "The best Thai food! So cheap, and you get a great atmosphere to boot! Be prepared for a long wait that usually isn't quite as long as the time given to you (it's worth it). You can walk around the block while you wait- it's really cute and there's an AMAZING chocolate place by the theater where you can grab hot chocolate or a sweet snack. They sometimes pressure you to get up and go as soon as you are done eating (understandably since there's usually a line out the door), but if you just make it clear that you're going to take your time they'll back off.\n\nOh, and did I mention HUGE portions, especially for NY?", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "Wow....I finally came here the other night to see what all the hype was about. This is a time when the food lives up to the hype and then some! I had one of the most delicious things I've ever eaten hands down. It was a special: Skirt steak with green beans and rice in a garlic sauce...outerwordly good. Melt in your mouth, insta-smile deliciousness. Not to mention that for my friend and I to eat and drink very well was for a total of 30 bucks with tip. You just can't beat that in the hill....yummm", "author": "amanda w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "I enjoy going out to eat as much as anyone.......but last time I checked my surname isn't Rothschild, so I can appreciate an affordable meal without cooking it myself at home.\n\nJoya provides tasty Tai food and a decent ambiance at a third of the price you would pay to dine out in  the city. Not to mention that one plate can easily serve two people. \n\nDishes are generally under $10 and I recommend the: \nShrimp Fried Rice $6.50 or Pad Tai $6.95 \n\nOur bill was under $50 for 4 ppl and I got to let someone else clean the dishes when we were done (sweeeeeet).", "author": "Gia V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "The\nFood is\nTasty and\nNot too costly\nWith a nice garden and friendly service.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-07", "description": "I can't believe it took me 6 months of living in Carroll Gardens to find this place on Yelp. The food was a definitive cut above everything I've ordered in. I find the delivery in this neighborhood to be pretty gross but this was a nice surprise the first time we ordered. I'm going to try it again now.. (just took it down from 4 to 3). Calamari salad inedible. Spicy noodles very very greasy.", "author": "Chauncey Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "My friend wanted to do lunch in Brooklyn rather than Brunch in the city.\n\nI figured I shouldn't be so selfish and not ever wanting to go anywhere outside the city or outside a certain area and so I decided I should go out to Brooklyn.\n\nI never been to this Bergen Street area.  I have been eating too much Asian food that I wasn't really feeling for any Thai but G really wanted Joya, so I went along with the plan.\n\nG decided to get a Mango flavour martini and I declined on any alcohol intake and decided to go with the regular Thai Ice Tea.  \n\nI tried G's Mango Martini and I am so glad I didn't get any alcohol because it was really strong...delicious but it had a real kicked to it.\n\nG ordered the Short Ribs - G raves about the short ribs here but I wasn't too crazy about eating ribs since I have a \"thing\" about eating things that comes with bones on your plate.\nBut I managed to get the meat off of the bones without much effort and G was right...they are good.\n\nG got the Chicken curry and I went with the regular Shrimp Pad Thai and let me tell you, I haven't had this good of Pad Thai for a very long time.\nThe noodles were cooked perfect and the dish weren't too dry and it was soooooooooooooooooooooooooooooooo good!\nThe shrimp tasted really fresh and I just love it.\n\nThroughout our lunch, G asked me if I thought the guy was cute...I said he's pretty cute for an Asian New Yorker but he's short.  Every time G goes to Joya, he's usually there and so G was curious about his name.  We ended up finding out his name is Gaeng.\nG kept on calling him over for things since G wanted to see Gaeng's face throughout our lunch.\n\nGaeng's was really nice and he didn't seem as though he was annoyed with us.  So service was really great and attentive!\n\nMy only complaint is that they don't have a set time on when they open on Sunday.  I had to wait over an hour by myself since G was late as usual.\n\nI have been converted...I would definitely come back to Brooklyn for some Joya!", "author": "Ro R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-23", "description": "I ordered the spicy seafood fried rice which was wonderful. Get there before 10:15 if you don't want to close the place down. Or else you'll be watching the wait staff clean up around you as you finish your phenomenal mango martini.", "author": "Kai-Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-26", "description": "Great food and SOOOO cheap.  5 people and we all had drinks....$53 after tax.  They gave us 3 drinks on the house.  HIGHLY recommend it.", "author": "Ray M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}