{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-02", "description": "We came to Joya for many years and loved the food, but the last couple we haven't because we live on Staten Island. The food and the drinks were always great, so when my wife had a job in Brooklyn, I asked her to pick up food and bring it home and I check d Yelp- and I was surprised to see a 3.5 star rating.  Our order was two orders of chicken pad Thai spicy, red curry and chicken satay. The two spicy orders of Pad Thai were disgusting. It looked like plain white noodles and some boiled chicken mixed in with with some bean sprouts thrown on top- just a white bowl, with white bland food in it. There was no seasoning whatsoever. We would have taken it back immediately but the drive made it impossible. My wife called the next day to speak with a manager but was informed that the manager wouldn't be in for 3 days until Thursday. Tonight she called and asked for a manager and he said (in a snotty tone) \"how can I help you?\" She said \"are you the manager?\" And he replied \"yes I am and I'm VERY busy\". She told him about what happened and his response was \"so\". She told him she was going to leave a review on yelp, but wanted him to know. He said \"I don't care what you do, I don't even read anything on Yelp, only yuppie assholes read yelp reviews, and we've been here eighteen- one eight- years, and my father is very proud of me, my name is Andrew so you can put that on there also\". She told him that his dad shouldn't be proud because he was rude and a jerk. He said he doesn't care- \"the kitchen makes mistakes, everyone makes mistakes, it's like my mom in her kitchen, she makes mistakes\".  She told him an apology and saying they were in error would have been a much better way to speak and he said \"well, you shouldn't threaten me\". She said \"what threat\", he said \"with a yelp review\"- and she said \"that's no threat, it's my right and duty\".  He reiterated he didn't care what we wrote, and that there was a line out the door and he would \"give you the money back for the 2 dishes\" (thus the one star in anticipation that he keeps his word).  He's obnoxious and a jerk and now I feel Joya deserves less than 3.5 star- because any manager that speaks to a customer like he spoke to my wife, should lose his job.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "You cannot get better than this place!\n\nWhere do I even begin. Well, this is my favorite restaurant in all of NYC. The prices are incredibly affordable making this the perfect destination if you're on a budget. (cash only though)\n\nThe food is INCREDIBLE. So fresh and tasty, and is always served very fast. The servers may not be the best, and it sometimes can take a while with your check but once you get the food, you can ignore all of that .\n\nThe ONE and ONLY time I had a bad experience here, the owner came out and comped my entire meal. I didn't even have to say anything to him, he just knew we didn't receive good service. The neighborhood around this place is also beautiful, it's the perfect spot for a date.\n\nDecor, food, ambiance, everything about this place is top notch.\nHighly recommended.", "author": "Austin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "I'm a big fan of Thai food and the meal I had\n here was amazing. The prices are really good and the portion sizes you get are huge (I had the shrimp fried rice and felt like I had barely put a dent in it by the time I was full). Also,  considering how busy it usually is the staff is very nice and do a good job. I also really liked the whole ambiance of the restaurant with its dim lighting and open kitchen, it all feels very intimate and this would be a great place to go on a date.", "author": "Kayah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Good Thai food is to die for, IMO, so I'd pretty much die for Joya. Not really, but the point is... their food is YUM. Oh how I enjoyed their Massaman curry! It's also such a plus when you can taste the freshness of the herbs in each dish. Cilantro, basil, lemongrass flavors were so notable.\n\nThe waitress was efficient... I wouldn't say friendly, but efficient works. It was a really busy Friday night 3/27, and the wait was about 15 minutes when we got there.\n\nFour stars since the appetizers were just okay. I'll definitely go back and would recommend.", "author": "Jeanine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "This is my go-to spot for a night out. The prices are cheap and the food is great. I don't think I've ever spent more than $20 including a drink. I LOVE the tom kha tofu soup, the pad Thai, drunken noodles, and several of the curries. I've never had a dish here that I didn't like. I've never waited more than 20 minutes for a table (they have a bar to sit at while you wait). I just love Joya. Yum.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "I am from California, and I have to admit, it's been five months and I still remember the dish I had as well as my wife's \"drunken noodles\". Only when we arrived, the server corrected us and stated it is now known as 'spicy noodles'. I don't care...I couldn't stop eating her dish and mine. I was such a pig... Oye!\n\nI still remember the cozy feel of the place. We dined outside and we were seated at these very small wooden tables under an umbrella. What struck me about this experience is the vibe I got from the neighborhood. It was an unusually warm evening and the lights and the people just sparkled. \n\nWhen we received the deep fried calamari, it was perfect! The curry bowl I had had a strong current of coconut and it was tempered with spicy curry. The flavors just kept going and I couldn't believe the best food we had so far, was this little Thai restaurant nestled in Brooklyn. \n\nI told the manager/owner, we just don't get food like this in California. I would tell people in California, there really is something magical about NY. My wife liked the flash of Manhattan. But between us, I gave my heart to Brooklyn. This place just sang in the attitude of what is NY...just damn good food...period!", "author": "Matt R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-24", "description": "Went there last night with a group of friends and my son . The food was okay but the service was horrible . It was my first time . The restaurant did not have no music. Some guy come in our table and was very rude . Throwing his 11 grand he spent on his couch . Who cares? Anyway my toddler was standing on the couch . Not convenient when no waiter offered us a high chair . Not a happy place !!! The absence of music is a turn off . Will not go back there !!!", "author": "Jhoanne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "This place gets an extra star because their portions are GENEROUS and it is inexpensive. It's not supposed to be authentic nor out of this world, but it's pretty damn good and like I said, the portions are crazily huge. Two people can share the steak over noodles, which coincidentally was my favorite, and both of you would be walking away stuffed. You would think Joya would sacrifice taste in lieu of giving you what seemed like an entire cat fish on a bed of crispy green beans for about $15, but you are wrong my friend, because I would order that catfish for dessert even though catfish is my least favorite fish.  \n\nI can bear the extremely loud ambiance because the calamari is cooked just the way I like it; lightly breaded and barley salted. One forgives the cash only policy because the dishes are so freaking cheap. You quickly forget the 45 minute wait because one bite of the chive cake and the spicy pork pad thai gets you to do the happy food dance. If you want a good deal and great food, mosey on to Joya and do your belly a favor and order the steak and noodles.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Man I just love this place. I could eat here everyday and never get bored or go broke! They have a great regular menu and special menu that has creative dishes. Last time I was here I had special grilled salmon with oyster sauce and some sort of Asian style broccoli. It was great. Very flavorful like soy sauce with hint of spice. My friend had some and enjoyed it too \n\nI normally get pad Thai, coconut curry with either chicken or shrimp, fried rice, calamari, springs, ribs and mussels. \n\nGreat ambiance good for solo dining, dates or groups. \n\nStaff is friendly, knowledgeable, understanding and accommodating. One time I had an issue with my curry beef not being as tender as I would like. But staff explained when beef is cooked on a wok its not as tender as pan seared beef. The beef tasted good! I just like it cooked a certain way. I would try it again.\nThey have skirt steak special that is very good and tense FYI. I believe that's grilled.", "author": "alicia b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "It was my first time at Joya and I came on a Saturday night with a few friends. The wait was about 30 - 45 minutes. We started off with appetizers: Chicken curry puffs, Papaya salad, Mussels and Fried Tiger Shrimp Rolls. The appetizers were very good and flavorful. The Chicken curry puff were my less favorite because it seem really basic and did not have much of a curry taste.. For entrees we ordered the chicken Pad Thai, Jumbo Shrimp and avocado Pad Thai, Nuur Kratiam and Salmon over green curry (which I believe was on the  specials menu). The portions of the entrees were good sizes. But because we ordered so much appetizers that I couldn't even make it half way through my entree and had to take it to go. Out of the 4 entrees that we ordered the two unsatisfying dishes we would have to say is the Nuur Kratiam and Salmon over green curry. The Nuur Kratiam's (sauteed sliced beef with broccoli, cabbage, carrots, and onions in a fresh garlic sauce) beef was super chewy and tough and as for the Salmon dish my friend said the salmon was very dry. The waiter was very nice and attentive which is why I gave them an extra star. But overall my friends rate it 3 out of 5 stars.", "author": "Cynthia Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "I love Joya! The place is chic, classy, clean, raw with amazing food! Service is great! The wait is much shorter than Song. Somehow I think their menu is very similar to Song, makes me wonder if they are owned by the same owner/family.", "author": "Akira N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-13", "description": "BF ordered the shrimp with garlic sauce and he liked it. Portions are pretty big, very good price.\n\nWhy the low rating? I ordered a noodle plate with chicken. Smelled pretty good when it arrived, but the chicken was served raw. \n\nIt was at night in the garden, so it wasn't until the fourth bite that I realized it was raw. It looked cooked outside, but pink. We showed the waitress several uncooked pieces. \n\nShe did apologize, and it seemed that they would cook a new order. When it arrived a few minutes later, it appeared to be the same entree--but burnt. You could smell and taste that the spices had been burnt after being cooked the second time around.\n\nI couldn't finish the plate--felt already weezy thinking about the raw chicken. They didn't charge me for my plate--but still I would have rather had cooked food.", "author": "Pacita H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-25", "description": "A run-of-the-mill mediocre to average at best thai experience.\n\nCame here for all the good reviews and left feeling unsatisfied.\n\ndecor/ambiance 3/5\n- This place reminds me a lot of Song for some reason. We were seated up front and at a fairly large table. No complaints here, but nothing special either.\n\nService 4/5\n- We were seated fast and had our water refilled often. Also the staff brought our food fast.\n\nFood- 2/5\n- Chicken Avocado Spring rolls- Not that good at all. The chicken was super dry. The \"roll\" exhibited a complete inability to maintain a circular form and fell apart within one well controlled grasp of chopsticks. Bleh. \n- Mussels- Although they provided us with a pretty decent amount and most did not contain sand in them, it was disappointing that there were some that indeed had sand. \n- Salmon Pad Thai- Nothing special. Also the Salmon was really really dry and cold by the time it came to our table.\n\nI've been to much better (and cheaper).", "author": "Edward Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "It's loud sure but fun.  The menu is huge and priced well.  The food is delicious and the staff is sharp and sweet.  My default hang.  Great place for a dining adventure.", "author": "Don G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-03", "description": "The food is not what it used to be. The shrimp was low  taste as if it came from a frozen bag. Veggies were half raw in the curry and the beef was hard and chewy. Overall you can tell that something is off. I will not come back there in a while. the waitress was nice though :-).", "author": "Zack E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Always had this as my Thai takeout via door dash. Fav food, fab food. Great service and pretty fast too. Quality of food is great. Thoroughly recommend this place. It's Thai heaven!", "author": "Zoe W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "Good portions and affordable. I always find myself ordering the drunken noodles every time I'm here.\n\nDownside: long waits during primetime dinner hours and weekends.and cash only.", "author": "Donald S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-26", "description": "I HATE to write a bad review for Joya because I've been coming here since it first opened and live in the neighborhood. However, I HAVE to because of what I recently learned from a long time waiter the last (for good) time I ate there.  This restaurant is noted as a place loved by vegetarians by Yelp and for ten years I was one of those vegetarians who also swore by Joya.\n\nApparently,  everything that can be made \"vegetarian\" from Pad Thai to Green Papaya Salad to Red Curry is made with FISH OIL and NOT made fresh to accommodate vegetarians as implied by the waitstaff agreeing to make these dishes \"vegetarian.\"  \n\nWhen I argued with my most recent waiter who said I could not have vegetarian pad thai by saying, \"I've been getting it here for years,\" he replied, \" They're lying to you.  It always has fish oil in it.\"\n\nNeedless to say, I was horrified.", "author": "Randi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "Have been here several times. The food tastes great everytime, the service is good and they are very inexpensive. \nBut they are in dire need of a CREDIT CARD MACHINE. Cash is a thing of the past", "author": "Matthew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "There is a reason why this place has been around so long. It's good! We ordered delivery from here and I'm happy to say that their pad see yu was chocked full of flavor, even with soft tofu as the protein. My 14 month old even gobbled up the greens in the dish. Delightfully tasty and so were the spicy noodles. The heat was mild for being \"spicy\" I guessing they know this neighborhood's heat index. The sauce was wonderful though, lots of galangal which lots of times gets missed in Thai food over here. The ginger chicken rice dish was a bit too greasy but again, no skimping on flavor. We will definitely order from here again.", "author": "Becky M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}