{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "I REALLY wanted to like this place, I really did, but the food not only disappointed me, but it disappointed all of my friends. The décor and service were outstanding and they also have an outdoor dining area towards the back of the restaurant. There's also a full bar right near the front entrance. For a restaurant with a full bar, you would think they'd accept credit cards, but WOMP! CASH ONLY. \n\nThe food is mediocre. The flavor lacked authenticity and should not be labeled as \"THAI FOOD.\"\n \nI had the pad thai which tasted like it was drowned in tamarind and fish sauce. My boyfriend had the steak which was on their special menu and it tasted just like the pad thai- drowned with tamarind and fish sauce. Not only that, the food were all very salty. After my experience with food in New York, I believe California is the one of the few states in the nation that has the best cuisine of EVERYTHING!!!", "author": "Charisma C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "I treated a friend (who recently graduated college) to this place last night .\n\nAtmosphere:  Nice and modern decor, lighting quite dim.  Indoors is pretty noisy, the outdoor garden is quite nice.  \n\nService:  Abrupt and quick, like most Thai restaurants I've been to.  Our appetizers and food came in maybe less than 20 minutes.\n\nFood:  Insanely good.\n\nFor starters, my friend and I had shrimp spring rolls, and a small plate of calamari.  Everything was incredibly fresh and piping hot, we had to blow on the food before putting it in our mouths.  \n\nFor entrees, I had the spicy noodle with shrimp, while my friend had one of the green curry dishes.  The dish has very strong garlic and fennel flavors, but it wasn't what I would define as \"spicy\".  That said, it was still very delicious and filling. \n\nDrinks:  We both had Thai iced teas, which was a creamy, sweet and refreshing treat on such an awful summer day.\n\nGrand total for both appetizers, entrees and beverages + tax = grand total of $36.90.  I could *not* believe it. \n\nThe only downside to this place, is that it's cash only. Otherwise, I highly recommend this place for meeting friends, or going on a date.", "author": "Kanika H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-27", "description": "I love ordering from here and going out to eat! The only complaints that I have are 1)The music is WAYY too loud. You can't have a conversation without yelling. 2)The staff doesn't check on you, they just bring your food and take your plates. 4)You're crammed in there like sardines! \nBut the food is great!", "author": "Kathleen Rae L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "Fun vibe, nice bartender, good prices. I'm glad they're not afraid to make the food spicy, that was a plus.\n\nThe food lacks some depth though. I got Panang curry. It was good, but didn't give me that umami depth I was looking for.", "author": "Matt B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "I had the pleasure of dining at Joya this past Saturday night.  The place was full of people, good food, and cheer.  I arrived with a friend at around 9 and we were worried that we wouldn't be seated right away, however that was not an issue. We also had preference of whether we wanted to sit in or outside, it was a warm summer night so we chose to sit outside and I am glad we did.  On the way to our seats I noticed the open kitchen where you can see your food being prepared.  Our waitress was very attentive and even gave us ample time to catch up before ordering our food without pressuring us.  I ended up ordering the veggie pad Thai w/o eggs and my friend ordered the spicy noodles.  The food was fresh and tasty, and came in a reasonable time.  The portions are huge and I couldn't finish everything on my plate but I def. took the rest home and I only ended up spending $13 including tip! Overall, the ambience is chill, it's the perfect place for a first date, and I will be returning!", "author": "Shiloh A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Yes!\nTasty thai food, nice atmosphere, very healthy portions, reasonably priced.\nDefinitely going back.", "author": "Gabor C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "In our final meal for our stay in downtown Brooklyn we went to Joya for lunch. We hadn't tried an Asian restaurant in the area and went with the Yelp recommendations.\n\nWe got there about noon and we were the first people there. When we walked in, the music was blasting out fairly loud. We had to search for a spot that wasn't that noisy. We had a fairly simple lunch, I had the Pad Thai with Shrimp (a lunch special) and my wife had the Pad See Ew (flat noodles with broccoli and a dark soy-like sauce) with tofu. Service was a bit spotty - there was only one waiter and he kept getting diverted with new customers coming in so we had some delays. It got better later in our meal.\n\nMy wife really liked the Pad See Ew - she said it was one of the best she's had in a long time. My Pad Thai did not come close to being good. It was overly sweet with a minuscule amount of shrimp. Both lunch meals were large portions. I left over half mine. I did taste my wife's meal and it was much better (and I ended up eating a decent portion of it).\n\nOn the upside, the lunch cost very little. I was surprised it was a cash only restaurant. I wish they had advertised that in the window. I didn't have that much cash with me so it was good that the meal was cheap.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "I love Joya!  Their Calamari is better than any I've ever had at any Italian restaurant.  Their pad tai is excellent!  They have a huge array of delicious curries.  Not only is the food great but, you can't beat the prices!", "author": "Greg A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "food was great service was amazing place is elaborate love it went there on a date beautiful scenery", "author": "J H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "I love this place. The decor is cool and clean. The staff is super friendly and the food is amazing. This is one of my favorite resturants in brooklyn.  Price is very reasonable.", "author": "T R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "Joya, Joya, Joya...I swear Joya would have gotten 5 stars if it weren't for their hot mess of a hostess. Don't get me wrong, she was super friendly and I'm sure she does her job well when she isn't under pressure. Let me break it down for you. A friend and I headed to Joya after an Ikea trip. We arrived at around 7:40ish pm on a Saturday and the place was popping. There was a 30 minute wait, so I left my name with the hostess and sat my happy butt down for the next 45 mins (I was really digging the food I was seeing..lol.) After the 46th minute, I went to the waitress and asked her about our table (we were pretty much the last ones standing at this point.) She apparently forgot to write my name down, but seated us moments after. Bless her heart...\n\nI had difficulty determining what i wanted to wanted to eat because I couldn't keep my eyes off of all the delicious dishes that were coming out the kitchen (that was conveniently located within the dining area.) We ordered the curry puff and thai spare ribs as an appetizer. The ribs were a little tough, but I still got down with them. The curry puff was AH-MAZING! For an entree I ordered the shrimp Pad See Yue. Mannnnnnnnnnnn, I was blown away by how delicious my dish was! \n\nCONCLUSION: Joya is delicious, it really is. The whole \"waiting game\" is a little frustrating, and be prepared to be on top of each other if you're sitting in the back of the dining area.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Great thai food and service! They give big portions and have great price tags attached! They always have new specials and remember its cash only!", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-21", "description": "It's alright. Nothing to rave about. Had the chicken/avacado summer roll (dry and tasteless), Thai ribs (also dry and tasteless ) and the only decent two meals: pineapple and spicy pork fried rice and veggie pad Thai. Also mediocre. We sat at the bar and it felt like the bartenders were watching us. Loud/younger crowd.  I could see it being great meet up for geoups, but personally not a fan. Most likely not coming back unless I'm in the area and all other restaurants are booked. \n\n[And NO, I wasn't on my phone writing a review or taking pictures  while the food was cooling on the table.]", "author": "Laura D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "Fresh and delicious thai food. Portions are very generous. Every time I've been to Joya it has been a pleasant experience. The lunch specials are extremely well priced. Service varies.", "author": "Pearl S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-06", "description": "Recently their food went downhill, the food was not as tasty as it used to be. The price went up as well. The pai thai is way over flavors with vinegar.", "author": "Barbie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "Came here to celebrate a friends bday who loves both Thai food and Joya! My first time here and the food was good. I liked that you could see the cooks preparing your meal. The waitress was friendly and attentive. I only took off a star because it is cash only. Womp womp womp", "author": "Lola O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "I use to love this place but the attitude of the owner sucks!I was a frequent customer  in the but since relocating  I have not been there in awhile.However a group of my friends wanted to eat good Thai food so we decided  to  go  toJoya because they never disappoint in regards to food . When I got there  I headed to the desk to inform the staff that we would need a table for six so the owner who was on the phone stated that we could not be seated until our entire party was there, this is standard procedures for some  restaurants.So  the three  people of the party of six  proceded to the bar to buy  three drinks.  Which we did! About 5 mintues later  the other three show up so I kindly got up to inform the staff that the whole party was here and before I could say anything  the owner puts his finger up and says you dont have to come back just sit down until you are called then proceeds to get back on the phone. My friend says to me that was rude then the owner proceeds to say very rudely  \"I am the owner and I am not rude I am just busy, if you think I am rude there is the door.\" What!! Who does that to people who spends their money in your establishment. That is not how business is conducted. If he was so busy how was he able to respond being so mean. What owner has such behavior. Of course we left and spent our money wisely at a restaurant that has better customer service.I would not recommend  this place base on the attitude of the owner! Shame on you!", "author": "Kim P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "I've dinned at the restaurant for years now and it will never get old to me. i love their outdoor seating, the food is always on point, the atmosphere is relaxed but can be loud when they are crowded and they have a full bar.", "author": "Rhenita C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "YES!!! As good as it gets! \nIf you are into authentic Thai food, this place is the one you are looking for. So far this is THE BEST Thai restaurant I have been to.", "author": "Nitin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-31", "description": "We were seated by the kitchen, which is fine BUT the cooks were not having a night. They were throwing the pots and pans obnoxiously loud. I get it, it's busy and hot, but throwing the pans in an open kitchen seems too much.\nFood \u0026 portions were great! And our waitress was very kind. \nI would happily add back the 2 stars when the cooks are in a better mood.", "author": "Jamie J."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}