{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "This has to be the same owners as Song in Park Slope.  Cheap awesome food...seriously my shrimp spicy noodle dish cost the same as my $8 glass of wine...what a steal!", "author": "Amelia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "Great decor and atmosphere. Food is delicious and super affordable. They also have a cute patio out back and inside you can watch them cook your food. Definitely my favorite thai spot in BK. Been here many times and will continue to come. The only downfall is that the servers aren't very personable but they're attentive and get the job done.", "author": "Allie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-03", "description": "A friend and I stumbled across this place and thought we would check it out. It had a pretty cool and sophisticated atmosphere. Since we decided to only order appetizers and drinks, the owner charged us $22 for one martini. No.", "author": "Sidra H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-01", "description": "CHEAP and TASTY describe this cool Thai restaurant in Cobble Hill. It's a solid 4 star place considering the value.\n\nThe vibe in this place is dimly lit and bustling indoors, chill and calm on the patio out back. The crowd tonight was mixed- young \u0026 old, black \u0026 white, neighborhood denizens and those who drove in or got off the F/G @ Bergen St.\n\nI've walked past several times before and it always seems busy in the evenings.\n\nThey had a 15 minute wait for our table for 2, which only turned out to be ten minutes.\n\nService was fast \u0026 attentive. We ordered the summer roll appetizer which was on the handwritten specials sheet on the table, and a small fried calamari.\n\nThe summer roll was awesome- it came with some hot mustard on the side which was a great compliment for the sweet \u0026 tart sauce it was served with. \n\nThe calamari came with a sweet chili dipping sauce, and there was more than enough for two.\n\nWe stuck with noodles- I went for the spicy noodles with shrimp and my girl got the noodles with beef and sweet basil.\n\nBoth entrees were really good, with gigantic flat noodles stir-fried with our respective choice of spices, meats and vegetables. We sat at a table near the outdoor patio and we could see everything going on in the open kitchen just steps away. Good entertainment for your evening as the fire leaps from the stove and the kitchen staff whirls around at blazing speed to cook your food.\n\nTotal for all of the above and a glass of Shiraz- $42 including tip. CASH only.\n\nJoya is definitely in the rotation for a cheap and tasty meal in the hood, especially if I ever have a large group to bring out to eat.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-29", "description": "Calamari is BAWSE!!!!!! \n\nService could be a lil better, it is what it is ... great portions \n\nBut cash only ... lame", "author": "Jerr W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "My parents loved this place. \n\nLet's back up a bit. Parents visiting for the weekend. They are Chinese, live in the Midwest, and embody all the stereotypes that you could possibly throw at that weird combination. That explains why when I took them to Recipe, they eyed the menu suspiciously with its fancy descriptors, were disheartened by the portion sizes, and balked when the server presented the check at the end of the meal. Granted, they enjoyed the food. But there are better ways to spend a Friday night than defending the value of your meal. \n\nFast forward to Joya. The parents left with full bellies, big smiles on their faces, and barely a dent in their wallet. And lest my ears deceived, Dad may have even complimented the food at least once and said that Thai food wasn't this good back in Oklahoma, and definitely not as cheap. \n\nBonus points for the amazing mango coconut sticky rice dessert. Subtract same points for the two times that I requested dessert menus and the waiter came back with the check instead. Service leaves something to be desired, but they are a victim of their own success with people spilling out onto the sidewalks just about every night.", "author": "Thalia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "Excellent Thai food! After staying in Thailand, I'm so proud that Brooklyn often offers better meals than one might find in the motherland albiet more pricey. They have a $10 lunch special try the spicy noodle and thom yum soup for an authentic bite.", "author": "Gigi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "I have a feeling joya and song are sister restaurants or something because the menus are very similar.  Anywho the food is great and the prices are too. We had curry puffs for an appetizer. They were amazing and i especially enjoyed the dipping sauce. I had the chicken in Basil spicy sauce with white rice. It wasnt spicy but the flavor was ON POINT! I wish I had noticed the Thai pepper tray though to add some pepper to it. My boyfriend had the chicken pad Thai and loved it. Thai iced tea also great.\n\nGreat portions, prices, and food! Oh CASH ONLY too BTW", "author": "Djinou J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "What can I say? This place lives up to the hype!\nCame here last night for dinner, and this time we scored a table outside. It was nice to have dinner outside, but the table was a bit cramped, and the bench is slightly higher than the table, so it was a bit uncomfortable to hunch over for about an hour. But besides that...no complaints. \nMojito - excellent!\nSquid salad - wow just orgasmic, fresh, tasty, and out of this world!\nSpicy noodles - excellent, and the basil is a great addition\nPork in ginger sauce - eh, just ok, but still very good!\n\nBTW...this place is CASH only.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-03", "description": "It must be love.\n\nI discovered this place years ago; I liked it then and I still like it now. Hands down one of the best Thai experiences you can have in the city. The food is very good, sizes are generous, and it's cheap! I wonder how they can stay in business but, hey! I'm not complaining!\n\nThe restaurant has exposed bricks and large pictures, and a full view on the open kitchen, which is something I always like in a restaurant. The main dining area can get noisy, but if you can score a table in the outdoor area, you will have a much quieter atmosphere, perfect for a summer date.\n\nThe last time I came here I had the spicy squid salad, which was very refreshing and really delicious! My only complain is that it wasn't much spicy at all, but I like my food rather spicy. The spicy noodles (sauteed fresh flat noodles, with mixed vegetables and egg in a chili basil sauce) were also a winner. Finally, VH (god bless her) convinced me to try the mango with sticky rice as dessert, which was fantastic! The mango was delicious, but the rice was amazing: I loved the combination of sweet and slightly salted flavors.\n\nOverall for a shared salad, two entrees, and a dessert, our check came to less than $30. That's amazing value for the kind of food you get.\n\nI also like to come here just for for drinks at the bar: a modern design that doesn't feel cold, tall glass vases with nice plant arrangements, and $8 pint-size mean mojitos.\n\nSo, yes, Joya: you get 5 well deserved stars!", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "Two words : On Point\n\nThose are the first words that came out of my mouth when I first tried Joya. \n\nFlavorful, Filling and Phenomenal service. \n\nIt isn't fusion. (thank god) I don't need my sushi to be converted into fish curry if the sushi didn't sell that great the day before.", "author": "Richard V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-01", "description": "Joya is a neighborhood staple that's always crowded, especially on the weekend. The Court Street restaurant offers out door dining in the backyard and the decor on the inside is modern. The calamari was fried perfectly but needed salt however my entree-Kang Panang Gai (cocunut curry sauce) would be pretty darn good if it offered more chicken. Overall, it's not heavily commercialized like Lemon Grass but decent Thai. Oh and it's CASH ONLY.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-20", "description": "Two stars because there was nothing wrong with the food (although the spicy noodles were not spicy, not even remotely), but my husband and I counted four strikes within one meal.  It also happened to be our first meal there, meaning it was probably also our last.\n\nThe four strikes, in chronological order, were:\n\n1.  The hostess said I could not be seated until the one other member of my party arrived, even though it was 6:15 and mostly empty.  Then I clearly saw two people walk in the door and up to a four-top that already had two people sitting at it.  They greeted each other with hugs etc., making it clear that incomplete parties do get seated.  \n\n2.  The bar has no rye!  At all!  And only Tanqueray and Bombay for gin.  Yeah that's a minor complaint I guess, but I was already annoyed.\n\n3.  When my husband did show up and I was having wine at the bar - you know, cuz they wouldn't seat me - they would neither accept plastic for the less than $10 glass nor transfer the tab to our table.  We dug around in our pockets for singles until we came up with the dough.\n\n4.  A mouse fell out of an air vent and onto the floor, in front of the hostess station and across from our table.  I don't know, maybe ten feet from us?  After a minute of uncomfortable silence - several additional customers saw this - some employee, hopefully not the chef, picked it up with his bare hands and ran away.  \n\nAfter the mouse, we just stopped eating, got the check, and left.  Like I said, food wasn't bad, but the mouse freaked us out and the inconvenience of all those policies - somewhat rudely and capriciously applied - really drove me away.", "author": "E S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "It's the best thai food in the neighborhood.  In earnest, the food is great and the servers want you to get in, get out, with absolutely no fuggin about.  I time dinner and try to beat the cock when I'm out and about, and this place always gets me to the spinach line.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-23", "description": "Ugh the fact that so many people are taken in by the club-like vibe of this over hyped restaurant makes me want to give it a lower rating but I'm sticking to a three.\n\nThe food here is cheap and decent, I've never had any complaints and they mix some pretty good drinks. The biggest turn off is how packed and loud it is. It's just Thai food people! There are decent Thai restaurants on every block in this area!", "author": "Lana V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-01", "description": "If you aren't vegetarian, Joya has excellent Thai food, served quickly, for a reasonable price. If you are, well... \n\nJoya's menu is incredibly misleading. The \"vegetable\" section is NOT vegetarian. Everything on the menu contains fish sauce- something I only discovered after eating there for years.\n\nI sat down to eat with an out of town friend, tried to order my usual Tofu Vegetable Red Curry (which, I'll mention, is excellent if you're ok with eating fish) when the waiter informed me that it was not vegetarian. I was disappointed, but flexible. I asked the waiter what was vegetarian on the menu- any other curry? Pad Thai? Salad?...Anything? To my embarrassment, we ended up walking out.\n\nPlease Joya, could you modify your menu and develop one or two vegetarian entrees? My heart pines for that red curry. Just not enough to make me eat anchovies.", "author": "E M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-27", "description": "Over rated. Big portions and great value but lacks authentic Thai flavors. I'm Thai and I know how to eat Thai. Over hyped and Americanized. Experience best Thai in Queens like Sripahpai and you would never return to this place. Promise.", "author": "Pam W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "This place is sexy and sleek, perfect for a date night. The food is on point and super cheap. Cocktails are $10 and strong! Cash only", "author": "Cerca T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "Outstanding, the decor is great and has a cool outside lounge. The food is decent and fits the price, you can get away with spending $40 on four dishes...and that's a lot food!\nDo try the mussel appetizer in lite curry \u0026 basil sauce!", "author": "Renn B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-10", "description": "The food was OK.  Not the best Thai food and was disappointed that they take cash only.   The service made me feel uncomfortable as if they were rushing us to eat inorder to seat other people.   And the ambience kind of sucks.", "author": "Darrel E."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}