{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-05", "description": "I know joya and song are under the same management, with that being said I used to love song so much and they've gotten worse over the years. I thought maybe I would give joya a shot to see if they still had that taste I loved from song. I'm so sad and disappointed to say that it was actually worse. I had a beef noodle dish and the whole thing lacked flavor. The beef looked grayish in color and one piece wasn't fully cooked. It was really unappetizing. Also I ordered a soda and it had a very strange after taste. I won't be back", "author": "Lucia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Sat outside.... it was a great atompshere. Excellent service\nFood was very good, good quality", "author": "Tracie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "The ambience is nice, they played some nice classic rock through the evening. Service was great and food came in pretty fast. The papaya salad was great and so was the red curry and fried rice. The servings are rather big and one has to have a huge appetite to finish all the food! The bill was very reasonable and the meal was totally worth it!\nI noticed they used too much broccoli in their dishes esp in the vegetarian variants, that kind of gave me an overdose of the vegetable. \n\nWe would definitely go back to this place again!", "author": "Chinmayi V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Joya is my favorite local spot for Thai.  It's affordable, fast, and a great vibe.  The only problem is it gets insanely crowded and the wait for a table on a Friday/Saturday night can push the limits of patience.  You cannot make a reservation.\n\nIn the summer there is an absolutely delightful back garden.", "author": "Patricia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "This Thai spot is as good as it gets. The portions are generous and the prices are fair. The place itself is trendy but classic at the same time. The food is tasty and has the right amount of kick. I also recommend sitting outside when weather permits at nights.", "author": "Jesse J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "Ok, so I think the word is already out on Joya, but it's AMAZING. Huge platters of delicious Thai food for around $8. Absolutely can't be beat. No one ever goes hungry here.\n\nThe services is also very good. Only downsides: there's often a wait (but they have a full bar), and cash only.", "author": "Marty H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "Ok, I'm the 640th person to review Joya, so there's probably not much to add. I'll keep it short and sweet.\n\nGood noodles (especially Pad Se-Ew), though a bit oily for my taste.\n\nSpring rolls (vegetable and chicken) are AWESOME! I could eat these before every meal.", "author": "Roy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "I've heard so many good things about Joya from my bestie, I had to try it.\nThe wait staff was very nice and we didn't even wait long for the food.  I had the Mango Salad and Pad Thai shrimp with chicken. Both the mango salad and the Pad Thai was really good. And the portion was so big I couldn't finish it. \nJoya doesn't have coffee :( nor do they have dessert. I brought in a cake for our group of ten people and the waiter brought us plates, spoons and a knife, they were awesome. The price was very reasonable for everything. \nTry it, you'll like it, I did.", "author": "Roberto C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "This place is located on Court St. in a nice area where all the prisoners are lol. So my boy has been trying to get me to come here for months now. He was saying how it's the best and I would love it yada yada. It's good not the best in my palates op. The ambiance is nice and the people are sorta friendly. They were scooping up my plate to clean before I put my fork down. I would prob return bit it won't be for a while.", "author": "Maurice R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-30", "description": "I really wish I could give zero stars but that isn't an option unfortunately. Yesterday 10/29/17, myself and my youth group went out to eat and we decided on Joya. As soon as we walked in, we informed a waiter that we are a group of 10 adults and two small children and was taken to an area with tables pushed together. The first problem was when we requested a booth instead of tables because we were with TWO SMALL CHILDREN and was told, \"No. We don't put large groups in a booth\" ???? I've never heard this in my life as booths are usually reserved for large groups but after trying to explain why we need a booth and the host not budging, we decided to let it go. ALSO, this was at about 5pm while it was POURING RAIN and the restaurant only had about two other customers, why couldn't we be accommodated? Second problem was when we asked for a booster seat/high chair for the kids and was told no. The host then argued with the father of the child and told him that he never puts his own kids in a high chair. Um ok? Cool story bro but we like to put our kids in high chairs/booster seats lol. FINALLY, the host realized that we were one person short and refused to let us sit and demanded that a group of 9 adults and 2 young children should just stand by the door and wait. I would understand this policy if the restaurant was actually packed but it was EMPTY. We told the host that our last guest was literally walking to the restaurant but of course, refused to budge and and instead kept yapping about \"policies\". I honestly felt like the host didn't want to deal with a group of African-American people and the whole experience left a horrible taste in my mouth. We had no choice but to go back into the rain again and head up the block to LEMONGRASS GRILL. And let me just say, it was a MUCH BETTER EXPERIENCE. We were accommodated immediately and treated with actual respect. PLEASE AVOID JOYA IF YOU CAN, THEY DON'T HAVE THE FRIENDLINESS OR HOSPITALITY REQUIRED TO RUN A RESTAURANT.", "author": "Abiola A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-13", "description": "For a Thai restaurant, this ranks above average for me.\n\nAtmosphere:\nYour neighborhood go to spot where all the cobble hill yuppies frequent. Definitely more modern/trendy than your other Thai spots. \n\nService:\nThursday night 730pm no wait. Say the two of us at a 4 person table. 2 minutes after sitting down the waiter asks what we would like to order (I suppose most people order the same things over and over again). Food came out quickly as well.\n\nFood:\nChicken avocado summer rolls - the roll fell apart easily. Chicken was a bit dry, avocado taste was a bit masked. Did not like the sauce it came with.\n\nMussels: yum! My favorite dish. They were plump, juicy and sandless. Also very affordable. (I think $9)\n\nSalmon on pad Thai - disappointed. Salmon was over cooked and pad Thai was much spicier than I had expected.\n\nOverall, even though the dishes did not blow my mind, this will be my go to Thai place in the neighborhood.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "I ordered from them yesterday. I specifically said, please make it spicy. It was disgusting.  No spicy, no flavor, just awful.   I know Thai. I eat it at least twice a week. This was terrible. Lemongrass is better. The one on smith, about 193 is better. This was terrible.", "author": "Micahel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-22", "description": "The first time I came here I had very recently returned from a trip to Thailand and I had already had some terrible food at other Thai places I previously thought were at least passable. I relieved and pleasantly surprised by Joya, everything was really good!\n\nI don't know if it's a destination place, but it is way better than most of the other Thai I've had in the city.", "author": "Sean M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-01", "description": "Big Thai fan. Frequenter of the Fort Greene location so was expecting this spot to be the same. Lovely outdoor space, attentive waiters, and a hair in your food. \n\nMy friend and I ordered a curry and noodle\ndish to split. The noodles were tasty as usual (Pad Thai - don't shoot me. I know it's the spaghetti of Thai food, but I love it). My friend was scooping out some more of the curry she was enjoying then BAM! Hair spotted at 2 o'clock in the bowl. Cue loss of appetite. \n\nWaiter replaced it but by then appetite had hit the road. I wound up taking home the new order. Thought they'd refresh the rice -\nnope. Thought they might knock a couple of bucks off the order - haha silly rabbit. Nope. \n\nI'll probably stick to my Fort Greene spot but am bummed that my friend was scarred by the case of the hairy curry.", "author": "Skye S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "I'm a big fan of Joya and its sister restaurant, Song.  Joya has great outdoor space, relatively cheap entrees, and some tasty drinks to boot.  The portions are large enough that I always have some leftovers and I have enjoyed everything I've tried from the menu.  Great date night spot, I've come here a few times before heading over to see a movie (maybe a 10 minute walk).", "author": "RG P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-06", "description": "WAITRESS AND MANAGER BADGERED ME FOR A TIP ON MY BIRTHDAY WHEN I WAS GOING TO LEAVE A TIP ANYWAYS. LISTEN TO THE STORY, BUT I DO NOT RECOMMEND THIS PLACE. THE RESTAURANT IS PRETTY BUT THE STAFF NEEDS WORK.\n\nSo my mom took me to a movie on court street then to dinner for my birthday.  I had heard okay things about this restaurant and I love any form of Asian food so I thought I would love it.  The food was subpar. The waitress was okay, the service was okay.  There was nothing that made me want to come back or be able to say that I enjoyed this place.  We had the Thai Summer Roll and the Tiger Shrimp Roll.  The summer roll had frozen vegetables in it, so I only ate one piece and refused to eat the rest.  My shrimp roll was okay. The sauce for it was actually better than the roll itself.  Especially disappointing because my favorite food is shrimp.  Our meal came up to $30 and some cents.  The waitress took FOREVER to come get the card so I went up to the counter and paid.  We then proceeded to put on our jackets, and as i was reaching for my purse to leave a 15% tip, the waitress approaches me with the bill, puts the bill in my face and asks if the service was okay? I said yes the service was okay I guess.  She said \"well the tip is not included\".  I then looked at her puzzled and said \"okay so whats your point?\"  She was trying to explain that we did not leave a tip using our card and that it is customary to leave a tip.  I said to her I am fully aware of customs however, I was about to leave a tip in cash and not using my card.  Long story short, the waitresss felt the need to approach us, basically forcing us to leave a tip that we were going to leave on the table anyways.  Then when I spoke to the manager about it, he started speaking of the \"customary 15%\" without full grasping the fact that it is DISRESPECTFUL for waitresses and waiters to force customers to leave a tip, or even ask to leave a tip.  How can one assume that someone will not leave a tip and badger them for it? Moreover, what if I had been someone that came in there with the last $30 I had in my pocket? Does this mean that I cannot have a meal and say thank you and leave? The manager said to me \"well you shouldn't come out to eat in my restaurant then\".  My last thing is that if a group of people come in and eat a meal and do not leave a tip, is you approaching them going to make them change their mind? Also, what if this group of people decided to come back the next week and spend even more money and bring more friends and leaves a big tip the second time around? But you would not know this if you scare all your customers away by badgering them for tips.  ALL IN ALL I DO NOT RECOMMEND THIS RESTAURANT.  THE STAFF FEELS ENTITLED AND THE MANAGER IS EVEN WORSE, BECAUSE BASED ON THE RESPONSES HE GAVE ME IT WAS OBVIOUS THAT HE WAS WELL OFF AND CARED 0% FOR CUSTOMER SATISFACTION AND FOR CUSTOMERS TO FEEL RELAXED AND ENJOY THE RESTAURANT.", "author": "Chanique R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "It's not a bad place and the price is also fair, very good atmosphere in there and I love the service pretty much, definitely will come back in the future.", "author": "Derek F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "So finally we met the owner of this place. WOW! He is so attentive and polite. Seen him walking around helping the staff and chatting with the customers that were coming in. This review is for the owner.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "Updated Review (08-14-16)\nJoya still looks great and fantastic BUT the food is now horrible. It used to be great and now it's terrible. I'm not sure if they got new chef's or if the old ones didn't leave the recipe book but the food IS NOT the same. I've been going to Joya's since 2012 and after 4 years I can say that I'm no longer a true fan. The wait staff are terrible as well.\n\nHowever, I can say that I had their Thai ribs recently and it was the only really good thing I've had out of the entire meal.\n\n                                   *************************\n\nGreat place with AMAZING food at an inexpensive price. The atmosphere is chill, very nice decor and scenery.  \n\nThey load your plate full of food, LOTS of food. So you get more than your money's worth. Unique sauces and spices that go perfectly with the food. \nThere's nothing left to say, I'm am now a loyal customer.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-25", "description": "The worst Thai food I ever had. Lamed curry, could't tell the different if it red or green or Panang.. or else, because it was just coconut milk with a tiny hint of chili paste (even I already asked for extra spicy). Stir fried vegetable was so so.. ;(. I can make it better. Service was ok... the waitress kind of rush, nothing special. \nVery disappointed.... will never go back again.", "author": "Kay B."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}