{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "the food here is great. try the specials! prices are inexpensive and I suggest you make a night of it and walk the neighborhood for dessert (its a great area). highly recommend it!", "author": "Casey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-12", "description": "Became slightly obsessed with this place when I first found it, but after having to wait forever every time I go I sorta have gotten fed up...granted, the food is awesome and the bartender (?robby?) is the best ever, but after dealing with the Napoleon complex owner and the ever growing crowd, its time to find another Thai place...but I will greatly miss you Joya...", "author": "Lametrious P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "Joya is the bomb! If you want well seasoned, fresh and tasty food I suggest giving this place a try. You will leave satisfied.", "author": "Shamek C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "Great place, good food and nice service. Very affordable and always friendly to our kids.", "author": "Vineel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-01", "description": "BEST CALAMARI EVER, BEST MUSSELS EVER, BEST RICE NOODLES EVER, Everyone is complaining about long wait times, shut up at least you know they are serving you fresh food and the wait is worth every second. I am a weekly customer @ Joya and I have no words, it is amazing. Full of flavor, good service, clean place. Better than Sea in Williamsburg.", "author": "Adam E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "Why do Thai restaurants tend to be so trendy in new york? This place is fa shizz... but good food too! And cheap... good date place for a cheap ass like myself... I tried the chicken wings and the pad thai... not 100% authentic but 100% tasty... I'l come back!", "author": "B L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "sad it took me 7 months of living in the city to find this place.. i love thai food and this place does it perfectly! the restaurant has a very nice vibe, although bc its so great it can definitely get a little loud during peak hours but that doesnt take away from anything.. the food is delicious, huge portions, and very inexpensive.. 8 dollars for an entree! love love love!", "author": "Gabrielle I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-03", "description": "I think it's the best Thai in NYC, at least that I've eaten.  It's especially good eating in the garden or delivery, as it's a bit dark/loud inside.  Otherwise, everything I've ever gotten there has been great.", "author": "John H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-28", "description": "Nice restaurant with huge portions of well, ok thai food. I like the decor but it is very popular and the atmosphere is noisy :) I think that restaurant would be better if less populated since it is such a small place and always crowded the waiters let you wait...", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-25", "description": "Great Thai for great prices.  With a cool atmosphere and open kitchen whats not to like.  If you prefer something more quite the outdoor seating is really quite nice.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-07", "description": "This amazing restaurant is by far the best Thai I've had in New York City thus far (okay...it's in Brooklyn, which if you ask me, is a better burrough anyway!). The place itself is poorly marked and if you didn't know what you were looking, you might think that it's a huge dive or doesn't exist. However, once you actually see the interior, you won't believe your eyes! The ambience of the restaurant is fantastic...lots of mahogany, exposed brick, big abstract art canvas paintings, and an exposed kitchen. The entire place is candle-lit but cozy, making it ideal for both a romantic dinner or a night out with friends. However, I haven't even gotten to the best part yet....the food! I highly recommend the Kang Masaman, which is so delicious that I haven't even dared to order anything else. Other friends have gotten the Pad Thai, spicy noodles, chicken and broccoli, and copious seafood specials and loved them all! The best part? Most of the HUGE entrees are under $10 and I had a vodka cranberry last time for a not-so-horrific-for-New York price of $6. If you get a chance and are in the area (or heck, it's worth a special trip) then absolutely check out this restaurant!!!", "author": "ash h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-28", "description": "I feel like I'm commiting sacrilige when I say Joya was not that great.  Fifteen to twenty min wait early on Sunday night didn't deter me, but the food did.  At first, I said the food was better than at sister-restaurant Song; the Tom Yum was great, the tiger prawn rolls just as excellent.  Bu the entrees did Joya in.  The initial bites were good, but as I ate more I realized it was not so awesome.  The pad thai suffers from the same sugar-laced faux pas as Song's, but worse -- all 4 plates were heavily loaded oil.  The flavor was good, but the grease left all of us feeling mehhhhhh....  I eat a lot of Thai food which, yes, requires oil to cook, but this was exceptionally oily.  Same great prices and gargantuan portions here, so I think the only thing Joya had over Song was that the noise volume was lower here and we didn't have to scream as much.  Heck, I'm tempted to dole it a 2.5 star.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-01", "description": "combination of price and quality make it a sure bet. i will admit that it is probably not THAT much better than any other thai restaraunt in nyc but if it tastes good and is inexpensive, why not go?", "author": "Brian T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-22", "description": "My favorite Thai restaurant of all time. Everything here is fucking awesome and it's CHEAP. The ambiance is great. During the summertime, they open up the back patio which has great seating and since it's nearly perfect out on a Brooklyn summer night, the whole experience is just awesome. I wish this place was near my house!!", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "I must say with the slew of Thai restaurants in the vicinity, its hard to decide which one to go to.  Joya, has done a great job distinguishing itself from the rest by offering great food at excellent prices.  I've been there about 10 times and its been great 8 out of 10 so it gets 4 stars.  I would stick to the curries and noodles.  The fish dishes are so-so.  The one other con is that it's too dark, I guess what you can't see can't hurt you.", "author": "Sang H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-18", "description": "This is not you average thai joint- before they started to spring up everywhere most thai places had bullet proof glass and a few fromica tables under harsh florescent light...Joya is the extreme opposite of this. You really have a dining out experience.  They ususally display local artist's work on their exposed brick walls, nice low lighting for intimacy and a lovely garden out back lit with candles.  The food is amazing and unebelievably inexpensive.  If you choose not to booze you can get out of there spending about 10 bucks for massive portions.  The specials are awesome and even their wine selection is good for such low prices (bottles start at about 22 dollars...a steal in restaurant world).  I only take away one star because it is very loud due to the exposed brick, concrete floors, and a dj that spins live almost every night.  That's just the geezer in me but I likes it how I likes it what can I say.  Usually I just opt for the serene garden when weather permits to escape the noise.", "author": "Katie Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-09", "description": "The food here is great, the portions are generous, and the prices are really reasonable.  My only complaint is that it is so offensively loud at dinnertime (and packed) that it's really not worth the trouble.  There are plenty of other Thai places in the neighborhood to eat in, so I would recommend ordering Joya for delivery or pickup only.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-30", "description": "Over crowded with the nastiest, most unprofessional staff.  There are too many nice restaurants in that area to be abused by people who do not appreciate their customers.  I walked out because I was so turned off by the nasty, unprofessional staff and I would never go back. I walked down the block, across the street  to a Japanese restaurant and they were more than happy to serve us with a smile.  It is a zagot rated establishment and the staff was great. !!", "author": "Paul I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "It is a perfect place for a casual dinner, fast service, inexpensive and delicious food. My boyfriend and I go there frequently because of its food and price. I had mussels for entree last night and it is so good that I want to have more tonight.", "author": "Jin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "we ordered dinner from joya often. very authentic and tasty. the portion is pretty generous as well. love them~~", "author": "Grace C."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}