{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Great food...if you catch it at the wrong time it takes awhile to be seated..if we hav the choice we sit outside, start out with the coconut soup and rounding it out with some chicken and shrimp pad Thai. Come to Brooklyn's finest Thai restaurant you'll thank me later.", "author": "Marcus V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-17", "description": "Typically had great experiences at this Thai Place but the first time I met rude owner Andrew will be the last time I eat here. I was absolutely embarrassed and mortified when he told my children they can't sit at the booth because they would ruin the furniture. This is not a child friendly restaurant. \n\nI wonder if this is a store policy for all children?", "author": "Crystal D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "One of the reasons I love Yelp is discovering little gems like this place. I honestly would have never found Joya if I was just walking around, or even consulted a restaurant guide or concierge. It's one of those places that you have to actively search for, since it is a bit off the beaten track. However, I really think it is worth going out of your way to try. \n\nWhen you walk down Court Street to find this place, you may have to do a double take. I had to walk up and down the street a bit and actively look in every building to find this place. The only advertising on the outside is a simple paper sign that says \"Joya\". No banner or anything else, just the basic sign. I actually thought for a moment that Yelp was fooling me, and that it closed and was long gone. But nope, it was there.\n\nI went with a friend, and I got the lunch special. It was two fried spring rolls and chicken Pad Thai, all for only 8.95. A very good deal for New York standards. My friend went with another noodle dish that came out to only 7.95, and again, very nice deal. Only problem was that it was a cash-only establishment. So please remember to bring cash, and there are a few ATM's in the neighborhood. \n\nThe spring rolls were alright, though I felt they didn't contain quite enough roughage inside. Mostly just noodles, and that's it. Luckily no human teeth (like a previous poster mentioned). The Pad Thai, on the other hand, was delicious. The noodles were nice and tender, not too soft and mushy. Chicken was pretty limited, but it was a nice compliment with the dish. Just enough spiciness and flavor too, so it wasn't overwhelming. \n\nService was friendly, and my water glass never went empty. Got our food in less than ten minutes, which is very good for a sit-down restaurant. Everyone there was friendly and helpful. Restrooms were clean and well stocked also, though a bit awkwardly placed (right in the middle of the restaurant, facing the seating area). \n\nOverall, I had a great experience here, and would definitely come back. What I like the best is that while coming here, I discovered the neighborhood (which I'd never been to before), and a few other restaurants that looked good. So not only will I come back here, but also to the neighborhood.", "author": "Sebastian K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "The food was ok \nBut I love the atmosphere of the restaurant very nice to go with a group of friends!!!", "author": "Miikeila H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "Cheap eats, large portions, HOWEVER the quality is not the best. I came in for some chicken Pad Thai that I craved and didn't get to have for a while. Decided to start with some Tom Ka(h) soup. Overwhelming amount of fish sauce, oddly sour, cilantro garnish looked slightly wilted and the leaves had brown edges. As to the Pad Thai, I am accustomed to it being spicy, colorful, with a good crunch to it from the peanuts. Again, overwhelming amount of fish sauce, oddly sour, non spicy, lacking color, there were exactly 3 pieces of egg (white part only) and 7 pieces of green onions, normal amount of chicken.* Yes, I did count because it was exactly that number without exaggeration. Noodles were definitely overcooked. Overall there was no differentiation of textures and, with the exception of the green onion, the dish appeared gray. There was no cilantro garnish, and it was served with a lemon, not lime, wedge.\nI have traveled all over the US and SE Asia, and I have tried pad thai in multiple locations, if that means anything. Everything about the food was lacking.\nThe interior tries to create a vibe that is inconsistent with the menu. Given the minimalist industrial decor and the patrons, I would say this place is geared towards non-Asian people who think of Thai food as something \"hip\". \nTo be fair, the food was edible (hence 3 stars) but nothing more.", "author": "Angel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Atmosphere: look at the light fixtures! Do not forget, not that they're hard to miss, but worth noting. Very busy on a Saturday night. We came around 8:45, and were given a 30 minute wait time but were seated within 20. \n\nFood: so good! And so inexpensive! I had the spicy noodles with chicken and friend had the pad Thai. Both were tasty, well cooked, and not too saucy. Heat was the perfect level on my spicy noodles, and there were tons of fresh veggies in the dish as well. Lots of leftovers for a $9 dish.\n\nDrinks: Went with sauv blanc. Thumbs up. I had a glass of prosecco and it came in its own personal bottle. Very cute.\n\nOpportunity to eavesdrop on first dates is a plus as well! AND they cover the table with paper so I hope your hangman game is strong.", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "Joya is a cute restaurant in Brooklyn Heights. I had a family lunch there on Sunday. The food was good. I got the spicy noodles with shrimp with the bbq wings and calamari. The spicy noodles weren't spicy but were good. Great portion size. The BBQ wings were alright and the calamari was great with the dipping sauce.", "author": "Añuli O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-06", "description": "The food is very well prepared and very delicious however I asked more then once to have staff take a picture and they have accessible nasty attitudes and say give them a second. They then proceed to stand in the corner and and stare me down not doing anything if your too busy why stand there and stare at me get the fuck to work. It never was like this here ever before. I guess I'll stick to the sister store next time for friendly service. The service was overall very unsatisfactory and I didn't even want to leave a tip. Not one time did someone come up an ask if everything was okay. Very pissed today", "author": "Steven A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Best Thai food ever. Period. Nothing has even come close to meeting the savory flavor of this place.", "author": "Gonzalo P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-10", "description": "Came here because of the number of reviews and since Thai is my favorite cuisine, I decided to give this place a try. Ordered the Beef Pad See Yue, which was delicious but I was very disappointed because what I love the most from Thai cuisine is their curries. I ordered the Chicken Panang Curry and it was extremely salty. I wasn't the only one who said it was salty. I could barely taste anything and at the end we had to take home the rest of the curry (which by the way I had to eat with lots of plain white rice). The place was nice and they offer a good menu but I would't come back.", "author": "Ga Hing C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "I have been coming here for the past 12 years or so.  This is hands down my favorite Thai restaurant.  The atmosphere is great.  The food is very good.  I usually start with the shrimp dumplings, and then move on to grilled salmon with white rice and mango salad on the side.  The menu is very extensive so take your time and chose wisely.  You won't go wrong.  The bartenders are friendly making the bar an attractive place to eat for a lot of single people, even couples.  Great place for a first date or catch up with long time friends.  The backyard is another go to option for dinners especially when the weather is nice out.  Do yourself a favor and visit Joya.  You're very welcome!", "author": "Sheldon A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "I've been coming here since 2010, this place was like a hidden gem. Once people started finding out about it, it became more known, the food quality started diminishing. It's sad I really loved this place. I went today and order a curry puff as an appetizer. I got it and it was frozen, legit frozen. They asked me for another one and I said no. They left it that way.  Once the bartender found out about it, he was like let me know how can I help, my boyfriend suggested a drink for me . He said no problem. Max the bartender was definitely an asset to the restaurant. He made our stay a enjoyable one and also tried his best to make sure our experience didn't leave a bad taste in our mouths. I was just disappointed that the quality in food diminished and  most of the staff doesn't care. This place was amazing food wasn't the best ! Had better Thai ! Hope this helps !", "author": "Vanessa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-26", "description": "I want to start off this review by saying the food and it's pricing is awesome I would have given this place five stars but I have to be honest there were two bartenders on duty one male one female The female that work the bar February 26, 2016 PM shift was very rude to me and a coworker she was very cold and came across like she didn't want to serve us we were about to walk out but the manager must have noticed and got us seated quickly the rest of the staff was A+ and friendly definitely made up for the rudeness of the female bartender Definitely have plans on coming back but don't think I'll be paying homage to the bar anytime soon.", "author": "Mann N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "I really enjoyed this gem in Brooklyn! Loved the Pad Thai and they have some good white wine. Do NOT sit by the front! It looks cozy but in the winter there is a mean draft. They have outdoor seating in the summer.\n\nGreat portions!", "author": "Hansel B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-02", "description": "I'm sure the food would have been fine if I'd been able to eat any of it ... especially since my friend so highly recommended it and said how popular it was. \n\nBut unfortunately it is one of those Thai restaurants where all their sauces have been pre-made and contain either or both soy sauce and fish sauce. The other dishes that did not already contain these were the entrees but none of the entrees were vegetarian/vegan. This meant a vegan gluten-free person like myself literally could not eat anything on the menu. \n\nSo we had to leave. I understand that this makes it easy for the kitchen to quickly put together dishes when they are ordered but is not good for serving anyone with food allergies or sensitivities. \n\nAt least our server was understanding and made the effort to go clarify with the cooking staff. And she understood why we had to leave. And the decor inside seemed pretty nice.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "I've been frequenting this gem of a place a lot lately with my daughter. All I can say is pad see yue! It is very very good here! Never ever disappointing, it's on my crave list for noodles.\"\nThe ribs are hit or miss so we don't order them anymore. This place has fresh food, you can see them prepping in a clean manner. Love this Thai.", "author": "Victoria M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-01", "description": "Wish I could give -0 star omg their food sucks! Now  I have food poisoning after I ate from there! I ate at so many Thai places \u0026 it's my favorite cuisine but their food is no where near Thai food more like a dog food! You must be wondering why their food is so cheap? Because it's SHIT that's why! Stay far away from this place if you want to live another day! Food is so bad omg unbelievable!", "author": "Safone A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "This place is a hidden gem! My cousin \u0026 I decided we wanted Thai and we found Joya. The ambiance is very relaxed with little candles on the table. Our waitress was kind and provided prompt customer service. We ordered the Summer Rolls as an appetizer which were pretty good but needed a little extra something. Then, I ordered shrimp, cabbage, peppers, and a side of white rice in garlic sauce. It was SUPER GOOD and I even added my cousin's sliced chicken curry sauce which made it even more delectable. I firmly believe any individual can find something they really love here even if they are new to the Thai food experience!", "author": "Steffi J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "I have to take a star away because they never refill my water. There's one or two waiters that stay on top of it but most don't. I come for the fabulous food and atmosphere, but it's a letdown when you're trying to get the waiters attention and they never stop by. It took 10 minutes to pay our bill and we had to go up to the counter because no one came by. \nOn the upside, everything they make is fantastic. I compare all Thai food to Joya", "author": "Danielle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Honestly, I like every dish I've tried at this restaurant. I've been going there for more than 10 years and the service and quality have not tapered. The food is cheap, but delicious, the decor is modern and welcoming, and the owners are fantastic. I can't wait to go back there.", "author": "Claudia A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}