{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "I love the simple decor and their open kitchen. \nYou can see the chefs in action.  \n\nStaffs are very gentle and prompt. \n\nFood portions is humongous and very reasonable We got fried wonton and fried calamari. Very crispy though not greasy. \n\nFor entree we have shrimp fried rice and their special - salmon with stir fried glass noodle. When we finished we have no room left for anything else.\n\n\nThank you Joya, you save us from dessert", "author": "Sirinthra A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "This restaurant use to be so much better a few years back. It seems as if they began using cheaper ingredients. I use to love going here and now i realize why I stopped. The entree I ordered wasn't flavorful, nor did it have much texture. This time when I was there, the air conditioner was broken and it was extremely hot inside, on a day that it was 85 degrees outside. I recall telling some friends they should definitely give this restaurant a try, but now I'd feel guilty if I recommended it to someone. Unfortunately this restaurant fell off big time ! \nNot much parking in the narrow streets around there, but there's always an empty spot by a parking meter nearby.", "author": "Simon R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-19", "description": "Took the 5 to Borough Hall and took a charming walk on a snowy Saturday night through Brooklyn.  Walk in and was not sure what to expect, it was just the closest place I could get curry so I went!! My favorite thing about the place was the atmosphere! It was dark so it felt like a scene out of a romantic comedy where the couple might not be the first date, but the second, where the couple starts to fall for each other.  The art was modern but not gaudy, and the kitchen was open so you could see the flames. It made me feel like I was just invited into a home for dinner. I thought of the style in Joya as the simple black dress girls who wear red lipstick; not flashy but subtly stunning. \n\nIt took me a couple minutes to get seated because of people doing take out orders, I was okay with it. Once seated, I was not sure what type of curry to get so the waiter guided me through the red vs green, I chose the KANG KOONG because I did not want to regret the decision the following morning.  I got it with the shrimp and the food came out within 10 minutes. One thing I thought was interesting was that the drink menu was written on with a pen! The  person who wrote it had nice handwriting but just something I did not expect.\n\nCurry: The flavors were great. It got me hooked on Curry again because the way coconut milk interacts with the spice, it soothes the soul and my throat.  I thought the veggies were sauteed to a nice temp so they did not overwhelm my mouth but just helped to soak up the curry.  I continued to add my rice onto it but I should've asked for more.  The waitstaff did not interact with me besides for taking my order, refilling my water once and to give/receive the bill from me.  I wish I would've gotten a little more interaction but it was fine, the food and whole atmosphere made up for it.  \n\nOverall: Exceptional environment + above-average curry + okay waitstaff = I'll be back :)", "author": "Jerrius J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-28", "description": "Came in on a beautiful Saturday spring afternoon and we chose to sit in the patio outside.\nWe ordered the thai iced tea, spicy noodles and spicy fried rice with chicken and pineapple. \nThai iced tea was standard, the spicy noodles was fine 4/5. \nThe one which was just pathetic was the fried rice my husband ordered. They literally served us some old rice, which had not even stir fried well. There were blobs of white rice (obviously hastily fried rice) and the quality of the rice was old. We sent it back showing that the \"Fried rice\" was not cooked, and they came back with a similar looking rice which seemed a little better compared to the one served initially!\nWaste of time and money. Better to stay away from this place. :/", "author": "Nisarga M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-09", "description": "Ordered the Mango Gai Yang on Caviar and as you can see the chicken is completely raw inside. Needless to say the entire meal will be dumped into compost bin. A real shame since I had such high expectations. And for an added bonus, the manager on the phone was rude and kept offering excuses instead of apologizing.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-11", "description": "Great atmosphere and the food was pretty good. Large portions and inexpensive. The calamari, which I usually look forward to, wasn't as flavorful as other Thai restaurants. But overall a good experience. I'd come back again.", "author": "Shamina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-07", "description": "Great sized portions for the price. I ordered the  green curry with chicken and it was decent. Hit the spot on a rainy cold afternoon. I wouldn't go trek out of your way for this restaurant but it does the job when you've got a Thai craving and you are nearby.", "author": "Kristy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Hands down the best Thai food in Brooklyn. \n\nThere's tons of seating in the restaurant, but they also have a back garden area with cute lighting. Everything on this menu is delicious and it's made with love and TONS of flavor.\n\nI've been coming here since 2008 and it never ceases to amaze me how delicious the food is. The price is very reasonable, especially considering the other food choices you have in the area.\n\nStaff is friendly and helpful and your food comes out in a timely fashion. Not sure if they take reservations, but there are usually seats available. In the off chance there aren't, you shouldn't have to wait more than 20 or 30 minutes max.\n\nOrder the tiger shrimp appetizer - highly recommended!", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Joya is my favorite restaurant. When I lived in the neighborhood, I used to order in all the time because their food is SO good and so reasonably priced. Once I moved out of the 'hood - I started going back all the time. My partner and I went there on our 3rd date and then returned every month for a year on our \"month-a-versary\" (yes, i know). The night we got engaged, my (now) fiance had all of our closest friends and family gather at Joya to surprise me. The staff was incredible and as always, the food was SO delicious and their wine pours are no JOKE! We love Joya and it will always be our favorite restaurant!", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-31", "description": "I used to come here often years ago when there was always a long wait, people out there door and quite frankly with the amount Thai restaurants that started popping up all over Brooklyn who has time for that. \n\nAfter a movie one night on Court st I suggested trying our old spot Joya. My bf immediately was like ugh, it's Saturday night it's going to be packed. I say eh, you never know it's been years. We go and lo and behold no line, no wait, good amount of people in the restaurant but not packed. \n\nThe decor is updated and more brightly lit than I remember it being previously. There is also a very nice backyard space. We ate outside it was lovely. We enjoyed our meals here as usual and the drinks were good. Staff was very attentive and food came out quickly.", "author": "Ayesha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Joya, I enjoyed ya.\n\nThis neighborhood itself has so many edgy.. modern.. even whimsical kind of spots to dine in, and despite that Joya is able to shine through. Upon arrival its almost late night club feeling before you meet the outside courtyard for eating and hanging out in the back. This place would be excellent for a date, night out with friends, but children should be left at home, let the adults roam free!\n\nAnyway, we started with the calamari and the barbeque wings, and if you follow my reviews, you know asian wings arent my favorite -but I have found them. The perfect mix of your traditional fried chicken wing in a honey sauce with asian flair. My father in law's favorite, my wife dislikes them(shes more of a Wangs and Bonchon type wing), and I had to take his side on this one. \n\nMy plate here was my favorite, did not stray far from what im used to, they have an excellent red curry sauce where the coconut really gets to shine. My wife had the green curry, which is not my typical choice, but her shrimp was not cleaned properly as the vein had remained in her shrimp. The steak and shrimp fried rice plate stole the show at the table presentation wise, the portion size is for two, has to be. And if youre afraid of trying new things and go for the pad thai -gotcha, thats super packed with flavor too.\n\nDespite the shrimp incident and a plate incident we had, I did enjoy myself and enjoy the food. The decor, the food, it all comes together nicely.\n\nAll in all very much enjoyed this experience and can see why its one of my mother in laws favorite places to eat. Will return soon!", "author": "Devon O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-11", "description": "The food was fresh and authentic. The only thing I didn't like was the furnitures. But hey, the price was reasonable.", "author": "Jeremy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-14", "description": "Food is not very good. \nService is the worst. \nWe came with a stroller, the manager didn't want us to go in the garden with a stroller for no reason specified. I then asked if they could turn down the volume of the music because we were with a very small baby. The manager was not happy about it, he turned the volume down just a little, the music was still super high for a baby. They were only 2 other tables in the entire restaurant so I didn't understand why he wouldn't turn it down a little more ... \n\nThe waitress was rushing us to order. She asked us to take off our plates while she was bringing the meals ... she wouldn't even come to our table when we asked for another drink. \n\nAnyway not a great experience. I wouldn't recommend this restaurant.", "author": "Hanna Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Joya, I am jumping for joya because I am super impressed!! I went with a friend yesterday for lunch and it was the perfect day to sit outside on the patio and dine al fresco. The breeze light breeze was welcomed and the patio and is covered with enough shade from nature. The restaurant and patio are modernly and comfortably decorated. The service was quick but not to where you would feel rushed, but for lunch it's especially important to have attentive and effective service pacing. My friend and I shared the small fried calamari to start and it was on point, served with a sweet and spicy chili dipping sauce. I ordered off the lunch menu so also received a papaya salad with peanuts in a yummy and slightly tangy lime vinaigrette dressing which I also shared. I ordered pad Thai with shrimp and my meal and the salad was a lunch special for $10.95. Yes, you read that correctly. $10.95 for an ample sized salad and entree. The pad Thai was one of the best I've had in a long time and there was a generous portion of small shrimp. My friend ordered pad see ew with beef and it looked amazing. Since he's Cambodian, he put a ton of spicy chili paste on it before I I asked to try it and didn't want to ruin my palate for the pad Thai but he raves about it. The water was filled without us having to ask and the bill was presented and collected in a quick manner since she knew we had to return to work. Yuck. Lol I look forward to another lunch trip there in the future.", "author": "Lesley O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "I celebrated my nephew's 22nd birthday here and we had an okay time.  Food took way too long to come out but the food was very good.  I think this place has the best pad Thai in the city but the long wait when the restaurant was not busy made me deduct several points.  The staff was only ok.", "author": "Lorianne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "I came here after my boss suggested that the food was good here. I came here with my family and my folks loved it. They ate everything and we had no leftovers. They had seatings inside and out and we took the seatings out. Outside, it is kinda dark but nice, and I loved the outdoor seating. Indoors is great especially if you're on a date and you're looking for a romantic seating. I didn't give 5 stars because Ive had even better Thai food and secondly they had just 2 dessert options which wasn't even that great (fried bananas and sticky rice). If you do come here try the red curry pad Thai, it is delicious.", "author": "Aishwarya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "Service -5 stars \nAmbiance - 5 stars (there's outdoor seating!) \nFood - 3.5 stars \n\nI always go to the same thai restaurant, super loyal as they always guarantee good food. My boyfriend convinced me to try this place as they have amazing reviews as well. Upon arrival, I was super excited to see that they have outdoor seating in the backyard. It was well set up, and the waiter was super attentive and friendly. They give u two menus, one printed and one hand written ( which was quite difficult to read as I see many other Yelp reviewers say the same thing) \n\nWe ordered the spicy flat noodles (which is the dish I MUST always get- but other places called this dish drunken noodle) and from the special menu- we ordered the fried catfish with Chinese broccoli and the BBQ chicken wings. \n\nThe wings came out first, my first impression was that it was over fried. It wasn't that golden crispy color, but instead a dark brown color. The flavor was there, even though they call it BBQ there's hints of curry as well. \n\nThen came the entrees- the catfish dish was pretty good but the thing that bothered me was their produce is not fresh. I was picking through the Chinese broccoli as all I find is black and yellow spots on the veggies which is sign of the veggies going bad. \n\nThe spicy flat noodle was definitely no where near what I expected. If you eat flat noodles a lot, you know it's not good when the flat noodles are all glued together as big lumps where sauce can't even get to. There was no bounce to the noodles and super greasy as well. They also serve it with a lemon which I have never seen before. We put some on to see if it taste better but it ruins the dish even more. Definitely not a memorable dish.", "author": "Meiki W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Live this place.  Plain and simple.  One of the best Tai Food restaurants in the tri-state area.  May even take the trophy.  Ya'll know what impresses me..\nJust get your butt over there and start enjoying life!", "author": "Bruce M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "Location: \nCobble hill has some of the best restaurants. Joya has some best Thai food representation \n\nPlace is large: they have bar session and even outdoor place for you to dine in. \n\nFood: had their spicy noodle. So good!!! \nThe lemon made the spicy noodle taste sour and spice and sweet. \n\nService: fast and nice. \n\nPrice: cheap. They have take out and delivery as well. \n\nOverall: highly recommend this place if you are in neighborhood \n\n4 stars.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "Medium spicy is really spicy! Please beware before you order medium spicy. The place is always busy and the service is slow during peak hours.", "author": "Nanda D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}