{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "My now husband and I have been regulars at Joya's since 2002 when we first met...   We have always been huge fans of this restaurant/ lounge and regulars (eating there at least once every two weeks.... at times once a week), great food, great drinks, very reasonable price, awesome service and very small wait time. \n\nI will say that our last visits have not been the best, the waiters who are usually very pleasant and attending were rushing this time around.  The wait was much longer than usual and the place really didn't have the feel it has for me in the past.  I always noticed the owners at the location, but for the past two or three years it hasn't been that way and it obvious its affecting the great feel i loved about Joya's. \n\nHowever the food still remains to be amazing and my favorites still are the apple martini and the chicken Pad Se Yu.  And ofcourse...no one makes a better calimari in my opinion!  I absolutely love the spice rack (which i have to admit my husband got me into).  I love the place and what i like the most about it is that you can be a couple, a group of friends or a family with children and still each one of these different groups will find the place to be very enjoyable and the food to be amazing!", "author": "Anna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "Joya is a great place to become a regular at. The bartenders are really nice and make delicious lychee martinis! Not too sweet, not too strong, just right!\nThe food is always amazing and very inexpensive.\nThe pictures hung add alot of character.\nBathrooms are kind of meh, that and the fact it is cash only is why it gets 4 and not 5 stars.", "author": "Melody G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Nice place, good taste, low price.\nBut so noisy inside, and the open kitcken makes me smell like a moving kitchen after the dinner.", "author": "Jinyang L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "This is a true 'mom and pop' Thai restaurant and as such there is nothing pretentious about the decor. The food was delicate, delightful and plentiful. We split an appetizer then split an entree and we were very satisfied with the great taste and the amount of food. Our server was charming, too. If you enjoy Thai food and don't...", "author": "Mike A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "Like the previous reviewers say, lots of vegetarian options. I usually order pad thai at thai restaurants but at Joya, I prefer the drunken noodle. Their fried tofu is delicious; I love the dipping sauce that comes with it. \n\nI love their patio in the back. It's nice to eat outside in the warmer weather. Portions are generous and prices are very reasonable. \n\nOnly down side is the wait. If we hit it at the wrong time, we could easily wait for 2 hrs before being seated.", "author": "J S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "Came here for lunch with a friend and the restaurant is really nice. The waitress was very nice and attentive. I didn't know they didn't have drinks as in soda, but only serve water. But they have a full bar, I couldn't take advantage of that..lol. I had the Tom Yum soup and the basil shrimp. I loved the soup! Just wished it was a little more spicy, and the basil shrimp was really really good. I don't have any complaints and my friend didn't either, he had the basil chicken. We both shared the fried banana and ice cream dessert. That was my first time trying it and its nothing to rave about but there was nothing bad about it either. Just a regular...dessert item.\nI'm actually looking forward to going back there when I'm in the neighborhood. Also its very affordable!!! \nI would recommend this place to anyone.", "author": "Gleni J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-10", "description": "Not impressed! Noisy atmosphere ! I went to Joya by recommendation! We shared the calamari that was just okay also had the mussels that where so salty the waiter took them of the bill,which was a good thing but my question is why did they come out of the kitchen like that? I don't think I would go back!", "author": "Charles D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "Pro's : Great food\n            Great service\n            Great atmosphere\n            And many more...\n\nCon's: Holy shit is the wait long!!!\n             Holy, holy, holy shit is the wait long!!!\n\nBut, its totally worth it.\n\nWord of advise, try to avoid going there on weekends.", "author": "Juan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Great food. Have wanted to try this place for awhile and it was definitely worth the wait. In a neighborhood where good Asian food has disappeared, this place should be around forever. I will be back.", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-14", "description": "ill start by saying this place is good and really deserves more of a 3.5.\n\neverything is good. but maybe thats just it... its just good. certainly great for the price point. you can definitely eat dinner for $8-$15. \n\nthe wait is always insane, though the service is good.\nportion size is good for how much you're paying.\nnever had anything i didn't like, minus a questionable calamari appetizer special.\n\nthis is a good place to go on a weeknight when you don't want to spend a lot of time thinking about what you want to eat. \n\namericanized thai food is always a safe bet!", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "This was our favorite Thai in New York and we lived no where near it. It was worth a regular trek from upper Manhattan and we regularly took friends and visitors to it. Just steps away from Smith Street's various attractions, it's the perfect combination of a great bistro atmosphere and an inexpensive Thai kitchen.\n\nJoya has a full bar (expensive but strong so it balances out) and good music (DJ but a nice mix, not crazy clubby) and very affordable Thai dishes that run the gamut from classics to fresh new ideas. Great calamari, hand rolls, and other starter temptations. There's also a nice little patio out back. \n\nFor someone who was never really a big Thai food fan, Joya brought me into the fold.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "Our favorite Thai restaurant.  Really cheap prices, outdoor seating in the back is great when it's warm out.  Inside it's kinda loud and dark, a bit club-ish for my tastes.  The wait for a table can be very long.  \n\nPro-tip: they deliver!  And they're super fast!  Skip the club and just order in :)", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Best Thai food ever!  Amazing spring rolls. I always get spicy chicken basil and my wife always gets chicken Penang curry at any Thai restaurant. Neither of us were disappointed. But surprisingly I loved her Penang curry too.  Everyone in our group of 6 agree that this was the best Thai food we've had.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-19", "description": "This is the best Thai food I've had in Brooklyn. Perhaps there's better, but I haven't had the luck of finding it. Besides, there is something to be said for consistency of quality, low prices, and mega-huge portions (every meal turns into two or three for me). The green curry and fried calamari are among my favorites/recommendations. I've heard that the specials aren't as good as the basics, so perhaps stick with those. Atmosphere, on the other hand, tends to be noisy and crowded and I've noticed certain patrons receive preferential treatment. All in all, my favorite Thai in Brooklyn.\n\nCash only.\n\nSister restaurant, Song, is located in Park Slope. The food is *almost* as good, but the wait staff is worse.", "author": "Lydia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "If you want a drink, beer will cost you $5-$7. The dinner menu is about $10 max and the amount of food is great. You really don't need the appetizers because you'll be full real quick. Overall this place is great. We got seated quick and served within 10 minutes. I'd defiantly be back here.", "author": "Ajesh R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-01", "description": "Yum!  I went to Joya with two of my coworkers for lunch last week.  We sat outside, which was very nice.\n\nOne of my coworkers had lots of dirt in his ice water, which was weird, but he got a new one.  And my diet coke tasted like something that absolutely was not diet coke.\n\nBut the food was delicious!  We shared Pad Thai, Pad See-Ew, and Spicy Noodles.  The Spicy Noodles were my favorite, but they were all delicious!", "author": "Carla K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-20", "description": "I can summon utterly no complaints about the cuisine or the prices thereof. The pad thai was plentiful, flavorful and less expensive than a breadbox. \n\nUnfortunately for Joya, sit-down restaurants typically involve some form of human interaction. It is in this regard that Joya falters.\n\nAs we helplessly waited for our check, disinterested looking staff members lined the wall, chatting amongst themselves. Our water glasses remained empty for unreasonable periods of time. At a restaurant who's cuisine espouses spiciness as a virtue, not hydrating your guests is surely a vice. The credit card thing is a little bizarre as well. \n\nIn sum: if you are in the mood to pay cash for good thai food and subsequently get treated like you don't exist after you receive your food, please, run (don't walk) to Joya. My feelings are too easily hurt for that.", "author": "Jimmy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-17", "description": "A club that serves food.\n\nIf you keep this in mind you are less likely to be disappointed. \n\nMediocre, bland food; Indifferent service, even when it is empty. \nI passed 4 other Thai resturants on the way there. \nI think I'll try one of the others next time I want lunch. \nBut if I'm in the mood to go clubbing and might get hungry later, this is the place!", "author": "Kim R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-31", "description": "I don't know, maybe I need to give this place a second try.\nWe were seated pretty quickly, but I almost died of starvation waiting to eat!\nWhen my meal finally arrived, it was way too spicy for me even to enjoy it.\nI'm far from a woos when it comes to pepper, but this was ridiculous.", "author": "Chrisi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "I dream about there curry!\n\nTasty Affordable Trendy.\n\nGreat place, Great food,\n\nService was slow, but the food made up for it, \n\nCASH ONLY!", "author": "Santo O."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}