{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "Giant roach and burnt food... No good combination. There are better Thai restaurants in the neighborhood to risk our health here. Gross.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Love this place!\nFood is delicious and prices are great.\nSpicy noodles are my favorite dish here. And it goes great with a mojito :)", "author": "Joan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "I started with the chicken curry puffs (2 puffs for $5). Wow, they were amazing. They were filled with a yellow curry paste, which had a really nice flavor. They came with a dipping sauce of red onion and cucumber, which was a nice sweet accompaniment to the puffs.  The actual pastry was fluffy and flaky. My entree was the chicken with peppers, mushrooms, and onions in a ginger sauce and came with a side of rice ($8.50). The ginger sauce was really flavorful and complemented the peppers especially well. Would definitely get again!\n\nAlso the outdoor seating is very nice. There are 4 large trees that offer plenty of shade and the decor is cozy.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "This was a good spot..I would def return. I only gave 4 stars because I had something amazing from the menu (spicy pork and pineapple fried rice)....but, my entre came with a mango salad. The mangos were not ripe. It ruined the salad for me but the fish was good. Everyone else at my table loved what they got. 2 got the skirt steak (huge portions) and the others got pad Thai and pad see yue which I will be trying when I go back. Also had the calamari for an app...it was good!", "author": "Samantha Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "Joya has the prices of a cheap Thai delivery spot until you arrive. You might actually turnaround be like, wait! I wanted cheap food not this fancy place. Joya's atmosphere is gorgeous and it's a great date night spot! The food is delicious, beautifully presented, and I'm a huge fan of their salad with the peanut dressing. It's so yummy!\n\nThey typically don't take reservations but if you have a big enough group, you can call ahead. The guy let me make one since we were coming in for a birthday group.", "author": "Whitney H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "The pad Thai is the best I've had. The prices are great. You get a lot of food for your money. Whenever we're in Brooklyn we like to stop in.", "author": "Erika M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "I cannot wait to go back here!\nI usually go to Sea for thai but this has become my fav thai place now. \nThe calamari was not good but the red curry pot, drunken noodles and another noodle dish my dad ordered was seriously good. The waiters are attentive. The food is not pricey and there is a short wait time on weekends. what more can you want?", "author": "Mehwish K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Along with the generous portions, the contemporary decor, and the attentive service, what I liked most about Joya was that my food was not too sweet. I find sometimes Thai food, especially Pad Thai, can be too sweet for me, but the food at Joya was delicious and very inexpensive. \n\nThe only reason I left a star off was that it was cash only.", "author": "Andrew W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "Food prices went up and the staff was very rude. I brought a friend from texas and was so embaressed that they didnt allow us to finish our meal before they started to remove the plates and food. The food was good but there were plenty of shells left in my plate  in small pieces from my clams very scary and painful qoth a few bites. Previously i loved this spot...but thinga change and I guess the customer service has changed with the times. So sad", "author": "Jenal J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-10", "description": "I am so disappointed with this place I don't even know where to start. We decided to come here because this place has a lot of reviews and figured we are making the right choice. When we arrived there was no one to greet us. The host or maybe Manager/owner was too busy talking to his friends at the bar to even notice us. When we went in search of someone to take care of us the guy we spoke to  told us to wait for the manager to finish talking to his friends. Really? okay!!\n\nSo eventually the manager pointed us to a table, didn't even walk us there but we sat down and patiently waited for him to bring the menus to us which took a while since he went back to talking to his friends. My boyfriend wanted to go up to the host desk to get the menus himself since it seemed that the manager was too busy to take care of the customers that pay his bills. As we sat waiting for the menus he finally made it over but instead of being nice to us he attacked us by saying \" Don't push the table against the wall because its new and it will get scratched\" then he proceeds to point his finger at my boyfriend and saying \" that means you\" since my boyfriend was resting his elbow on the table and his arm and shoulder against the wall. We felt so unwanted there but we decided we wont let that ruin our night. \n\nAs the night kept moving forward the people that came after us get service before us, the crispy duck was so dry we didn't even want to feed it to my dog in fear of it choking and as we are paying the bill the busser is yelling at us that they don't take debit cards. Cash only. Could there have been a note somewhere before we came in? we were lucky we had cash on us.  I worked in the restaurant industry and know that the cash only places lie on their taxes for tax evasion.  I hope IRS audits you guys. \n\nWhat I am saying is that this place is super over rated by hipsters that don't really like to travel for good Thai food. I will never come back here because this was a waste of my money.", "author": "Edyta G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "Lounge atmosphere with good Thai food. I do wish they had more dishes without fish sauce. Be aware vegans the only dish is the garlic sauce veggies. It's delicious!", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "I came here with a friend for dinner. It was awesome, love this place! The food is cheap and you get large portions. It is a bit nosey, but I didn't mind it. The atmosphere nice, I like the dimmed lights. I highly recommend.", "author": "Tashana J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Shrimp entrees are great. Entree portions are good for 1 person. Place is pretty popular so expect to wait a bit on weekends.", "author": "Arihant S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-07", "description": "I stopped here one early afternoon for lunch and ordered the Thai spare ribs, the spicy pork and pineapple fried rice and chicken spring rolls to go.  This clearly was my lunch and dinner especially since the food was so affordable. I spent less than $20 for my entire meal. woo hoo.  The restaurant wasnt that busy and its a cute cozy spot. The food was okay, definitely wasnt my favorite Thai meal but it wasnt my worse. I will definitely eat there again when I'm in the neighborhood.", "author": "Teresa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "Cute place inside but outside were toooo many insects. Young waitress server stoped is rudely asking for more money on her already given tip !!! I can't help but think how embarrassing it is for her to ask for more tip. Smh.", "author": "Naomi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-05", "description": "Um, hey. Joya isn't that good people. I'm giving it 3 stars because I don't stray and get crazy dishes. If you do, like my friends, you will be disappointed. Just stick with pad se yu or pad thai. You won't be disappointed. \nOther pluses that you might like:\nThai iced tea\nFried Calamari\nRegular green salad with peanut sauce\n\nsee where I'm going with this? Don't go too crazy and you won't be sad, looking at someone else's dish, wishing you got something else.\n\nAnd it's cash only...another strike.", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "Came here for father's day. The wait staff was excellent.\n\nThe meal was very reasonably priced\n\nMy masaman curry was way too sweet. I've had many a masaman curry from lots of different thai places in park slope, this was by far the sweetest i've ever had.\n\nI generally remove the potatoes, meat and nuts from the curry and add gravy to them + my rice to taste. One spoonful of the gravy was too much. \n\nMy dad felt his meal was was too salty. It was a stir fry that had peppers, onions and a meat.", "author": "LLroomtemp J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "I've been back 3 times. I just LOVE this place. \n\nStill don't like that its cash only, but you move on.\n\nThe Curry. Is. Real. \n\nget it. (Green Coconut Curry). Again, really affordable, a lot of food. You will not be disappointed.", "author": "Andres D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Joya is one of my favorite to go spots for inexpensive good Thai food. Everything on the menu is delicious and savory. The only flaw is that parking becomes nearly impossible during dinner time on the weekends and wait time can be up to an hour.", "author": "Carmen Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-18", "description": "I have been itching to eat here for weeks and hubby and I were finally able to make it! Yay! I read all the rave about the calamari and it was the calamari that made me want to come. I was extremely disappointed. The texture was great! Nice and flaky! But It did not have any flavor! It was like chewing crunchy nothingness. My heart was thoroughly broken over these $10, flavorless sea creatures. Since we had ours as takeout we were able to add a dash of salt and it made a great difference.\n\nOur entrees were good! I enjoyed the tofu pad see yu and hubz had tofu pad khing. My husband isn't much of a tofu eater but if he is able to praise this dish then they did a good job cooking it! I was also pleases with the spring rolls. Now those were good and if they weren't Joya would have received 1 star. \n\nThe atmosphere is adorable and romantic. We did not have to wait long for our takeout. We even waited outside but the food was ready and one of the employees brought it out to us. So kind!", "author": "A'Qlimiyah W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}