{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "This my and my boyfriends go-to spot when we want good food in a cool setting without having to wait or break our piggybanks! Joya has a great vibe with friendly staff and quick service. They don't usually take reservations so if you go during their peak times, you can end up waiting a little bit but that's a great excuse to grab a drink at their bar. My recommendations would be the Thai mussels, fried calamari (always crispy, never greasy), and tiger shrimp rolls for appetizers. For entree, you can never go wrong with their skirt steak special, it's absolutely delicious! I also love any of their dishes with shrimp, particularly with spicy noodles.", "author": "Stephanie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Hands down the best Thai food I've ever had (and I've had a LOT). And shockingly the most affordable! My favorite is the spicy noodles with chicken. LOVE! I always add extra hot sauce and peppers because I like it really spicy, but it doesn't really need it, the flavor is already so delicious. I live in Mount Vernon (40 mins away) and I will drive all the way to Joya to get my Thai fix. Worth it.", "author": "Jaclyn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "Let's talk about this! You're downtown BK and you don't know where to eat. Stop thinking get your *** to Joya asap! The curry flavors are tantalizing your palette. All the while you are trying to fight your instinct to pick up the bowl and straight up drink the curried sauce!! Spices must be marinated from the heavens and bought down to earth for this restaurant. My wife and I have frequented this place for years and they have never disappointed. Busy place and rightfully so. Keep in mind for a bit of a wait to be seated. Atmosphere is very chill and friendly in that part of town. Go there with absolute confidence my friends.", "author": "Steves V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Updated: proudly an \"A\" rating is shown in the window. Kudos! \nI had take out, tried an taken out of fried calamari. Surprised it was just as fresh, not soggy when i got home. \nI will be back, feels like old times.", "author": "Nikki B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "A local friend took me to Joya to try it out -- it was both of our first times and it was en-thai-sing! If I lived in Brooklyn it would definitely be \"my Thai place.\" I ordered the tofu pad see ew (my standard at Thai places) and this one is definitely in the top 3. The tofu was perfectly flavored and crispy.", "author": "Maria P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Wow! This place is the best! All the food are so good, and we were just surprised!!\nSpecially, fried calamari and fried rice are amazing! You'll love it! It's worth going from Manhattan! Please try!!!", "author": "Akane G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "BEST THAI FOOD I'VE EVER HAD! My boyfriend and I came in on a Sunday afternoon after visiting the Brooklyn Bridge. The ambiance was very modern, trendy, and laid back. For appetizers, we had the fried calamari and the chicken curry puffs. Talk about amaazingg! The calamari was so crispy and the puffs were so delicious and juicy. They made the crust just right and the vinegar side sauce just added more flavor. They had big portions because we were full off of that lol. For the main courses, we had the Pad Thai and the Moo Kratiam. The Pad Thai was extremelyyyy flavorful, it had a rich peanut taste to it. The noodles were cooked to perfection! The Moo Kratiam was also good. It had a zesty lemon flavor to it. The staff were friendly and fast, packed up my togo portions and everything. If I'm ever back in Brooklyn, I will definitely visit this place again!!!", "author": "Christie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Went with a party of nine on a busy Saturday evening. The wait was close to an hour long but it was well worth the wait because everything that we ordered was on point. I would suggest the chicken curry puffs, mango salad, and calamari as appetizers and the green curry and pad see ew were", "author": "Bo K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "Absolutely HORRIBLE,\nThe tom yum soup was way too sweet and nearly Luke warm.\nThe grilled chicken salad wasn't grilled, it was limp,and there was an inch of water mixed in with this nasty dressing, and the rice looked and tasted two days old after being put into a microwave.\nThe shrimp pad tai's noodles were mush,\nThis restaurant is awful!!!!!!", "author": "Derek R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-23", "description": "We had date night last Friday night at Joya. Appetizers were an avocado, salmon (with some other stuff) roll and spare ribs. It was just ok. The ribs were chewy and dry and not fall off the bone good. The sauce was good with them. The roll was ok but seemed like they were wrapped in a tortilla. \n\nDinner wasn't that good either. I had a chicken dish with garlic sauce with broccoli, cabbage and onions. The chicken was very chewy and it was like frozen chicken or frozen chicken that wasn't completely thawed out and they just cooked it. And the rice was completely undercooked. My husband's spicy chicken noodles were better but still not amazing.\n\nThey did have a nice looking outdoor area where it would have been nice to sit but we decided not to wait. \n\nOne saving grace was the waiter. When I only ate the veggies from my dish and left the chicken to the side, I told the waiter that the rice was undercooked and the chicken was terrible and he took the item off our bill.\n\nI'm not sure what I expected from a restaurant that I saw a commercial for in a New York City taxi.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-19", "description": "Ok. Ok. Get it. Mediocre food for drunken slobs. I am wit u. This joint rocks in that respect. Cheap date spot with active pickup scene by the counter. Barely passable food. But who needs that when you can eat and drink concrete atmosphere. Heh, paisan, how u doin? Dis place iz outta site. You goin.", "author": "Gif A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-29", "description": "Joya is so disappointing. Visiting the restaurant for food is better than take-out but be prepared for low quality regardless. Mushy soggy overcooked rice and vegetables. Ghang is down the street and is much better.", "author": "S F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-16", "description": "I think one stars is being generous.  I would have given Joya no stars if yelp would let me for the worst service and food I have ever experienced.  \n\nWe ended up sitting at the bar as the place was so disorganized when we arrived.  The bartender was not friendly at all and had no knowledge of thai cuisine.  We ordered two soups tom ka gai (chicken) and Tom yum koong (shrimp), a special chicken and avocado summer roll, and nuur kraprow (beef with chili basil sauce).\n\nThe soups and the summer rolls arrived first.   I had the chicken soup and when I tasted it and I asked the bartender if I could have some fresh chilies for my soup because I didn't like it and it wasn't spicy.  He proceeded to tell me he didn't think the kitchen had fresh chilies and would ask and placed that tray of pickled chilies various hot sauces in front of me.  I waited for a while and asked another server for the chilies and he told me the kitchen does not have fresh chilies!  This should have been a dead give away how the rest of the meal was going to turn out.  What thai restaurant doesn't cook with fresh thai chiles.  After that I sent my soup back having taken only two sips of it.   \n\nWe waited a while for the main course to show up and when it did the beef was sinewy and overcooked and again there was no sign of fresh chilies in a dish that clearly states it has chilies.  We ate a few bites and asked for the check.  \n\nThe bartender brought the check with the chicken soup still on it.  When we asked if he was going to take it off he said no,  the menu doesn't say spicy so I won't take it off.  I have been in the hospitality industry for over 20 years and I have never experienced this level or customer service or lack there of.  \n\nThe worst part is I called the manager the next day and she told me they never take anything off the check if you don't like it.  You order it you buy it.  This has been the policy for 15 years.  With this philosophy I am not sure how this restaurant has been around that long.  She also told me they are thai fusion and that is why they don't cook with fresh chilies.  Thai fusion?  Joya is the Panda Express of Thai food and that is being generous. Worst Thai food ever!!", "author": "Jenni B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "I stopped by here with...you know...my boyfriend prior to going to a little holiday get together.  You know, need some food to hold down the soon to be drunkness... and so it did.\n\nIt's a nice looking environment, a little tight space though but that could also be because it gets very crowded.  We waited about 15 minutes or so before being seated so we took a place at the bar and yeah, had a great amaretto sour.\n\nThis was the second time I been here, the first time I came here it was on a thursday evening and it wasn't as crowded.\n\nGetting seated... no water though? Hmm, that's okay, I had my amaretto sour to drink off.  Water would be nice though.\n\nWe had 3 dishes to eat off (don't ask for names of the dishes because by now I forgot): (1) spicy fried rice with pineapples and pork - delicious, (2) chicken with noodles (delicious), (3) some pork dish (no bueno).  \n\nI would recommend coming here, good food, great portions, and not expensive at all!  Good for a date.", "author": "Yulissa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "I've now completed 2/3 of the trifecta of Thai restaurants in BoCoCa (the other two are Song and National).\n\nLike the others, food at Joya is inexpensive and service is quick. There's also a nice sized backyard dining area.\n\nThe kitchen is completely open and there's an angled mirror so you can watch them work, which is incredibly impressive. I don't know how they do it, but even with a ton of delivery orders, it didn't take any longer than 10 minutes for our appetizers, and another 5 for our entrees.\n\nThe menu is basically the same thing at all three locations. I had the grilled salmon and Brussels sprouts special (just because I wanted to see what Thai Brussels sprouts would be like). It was really good. The sauce had a sweetness to it, and the sprouts were tender (and there were a LOT of them).\n\nAll in all, Joya is a great place when you're short on time or cash. Oh, and it's cash only!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "They got my takeout order wrong and then yelled at me in front of the whole restaurant. Ridiculous management", "author": "Deka M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "I decided to come in here to treat myself to some Thai food and I wasn't dissapointed. I ordered the firecracker shrimp and chicken pad thai which were both AMAZING. The atmosphere of the whole restaurant was chill and the bartenders and waiters made sure to ask how I was doing and get me my food quicker than I expected.", "author": "Anne B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-26", "description": "Absolutely underwhelming. Took my mom there last night and was so surprised by our experience based on the reviews. \n\n1. Mango salad had such a sour taste. I'm assuming the dressing had too much zest.\n\n2. Calamari and chili sauce was actually great! Kudos there.!\n\n3. Thai Tea had too much milk in it. But the flavor was nice\n\n4. Red snapper in coconut curry sauce. I was so excited to indulge in this. Boy was I disappointed. Snapper had little to no flavor and tasted a little undercooked. The skin was nice though. The coconut curry sauce was just okay. Nothing spectacular. Not much flavor. The vegetables and peppers in the noodles were pretty good EXCEPT for the eggplant. I love eggplant but the eggplant at Joya was simply disgusting. Not to be too gruesome but I immediately regurgitated the eggplant after one bite. I'm not sure if it was frozen for too long or what but it was horrid.\n\n5. Salmon Salad was extremely dry. No real flavor. \n\n6. When we asked for a to go container the waiter gave us a Chinese take out container which could not possibly hold a whole snapper. (I didn't eat much of it so I had a lot of leftovers). I told him it was not large enough so he literally gave me a paper bag as an option to put the food in. Wth. We went back and forth with the waiter for almost 3 minutes trying to convince him to give us an appropriate container. He then spoke to his manager to ask if he could give us a proper container who finally said yes. Why should I ever have to do that? Why does the waiter have to ask for permission to give a container? Ridiculous customer service. \n\nI drove 30 minutes to get to this place and I can confidently say I won't recommend anyone going out of their way to go to Joya. Beautiful decor though. Decent place if you just want quick bites with no flavor. If you're a lover of amazing food, keep searching.", "author": "Desiree S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-16", "description": "If I could give this place zero stars I would. \n\nThe worst Thai food I've had period. \n\nThere are prisons that serve better food than this place. Its basically overcooked, mass produced, heaped on your plate shit Thai food. \n\nAvoid at all costs.", "author": "Sonam U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "This was a bad experience. The youth of my church wanted to go out as a group so we called Joya and reserved a place for 4:45. We ended up getting there earlier then expected. When we walked in there was only 4 people eating. We asked to be seated in the back in a booth as that is easier for large groups. The owner responds \"no bc they don't do that\" when we explained it will be easier for us as we have two small children and 10 adults he simply said no. Then said we have to stay in the front and wait for one adult to come even though the restaurant was empty. He proceeds to get agitated when we inquire on how he is going to sit us due to the table not being set up for the number of us present. He then says we don't give high chairs for infants and that we are doing his job for him by asking questions and that he had the restaurant for 18years. My EXACT words was I'm trying to get an understanding on how you will sit us because it sounds like you will split our tables. His EXACT WORDS were \"you don't need to get an understanding\". No one was questioning his status or experience but I guess because we are African Americans and we're a large group he expected us to be \"trouble\"? We simply said forget it and went up the street to LEMONGRASS- where we walked in and was seated immediately with no problem with our group size or seating. Thank God it was walking distance.", "author": "Fatimat A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}