{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Today was my first time at Joya, waking in the restaurant really surprised me because it was beautiful. This place has outside seating availability which was comfy! \n\nI love the fact that Joya Offers large portion of food with a decent price. that's amazing because not every place is cool, I dislike the fact that I would pay so much for a very small amount of food. over all today I've purchased \"spicy noodles\" + chicken. I was satisfied and would rate the noodles 5 star. \nI was out all day with a starving belly therefore, I got to finish my plate today. The noodles and chicken were cooked well and soft. \nI've added  lemon to my noodles with gave a nice texture of sweetness. \n\nI gave this a 4 star because I came along with two other people that ordered Shrimp fried rice with pineapple \u0026 unfortunately they disliked this food to the fact that the pineapple was not fresh and rice being slightly hard. They came to this location many times and recommend it  to me because they had a good time at this place previously.", "author": "Jannu B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-14", "description": "best pad thai i've ever had. great prices, huge portions. service is always quick too!", "author": "Jenna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "Good neighborhood Thai joint. Very nice interior \u0026 excellent prices for where it's located. Also very friendly \u0026 professional staff.", "author": "Christopher K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "I've dined at Joya several times now and must say that it is one of the best Thai food restaurants in NYC, and quite candidly one of the best restaurants in this area of Brooklyn. The value, service, atmosphere, and extensive menu are unmatched. \n\nOn our most recent visit, we had the tofu tom yum soup ($4.50), grilled chicken skewers ($6), beef stir fry in chili basil sauce ($11), and chicken with green coconut curry ($11). Despite the affordable prices, the portions were large enough that we had leftovers for another meal. Everything was well seasoned and full of unique Thai flavors.\n\nJoya is designed like a modern, high end restaurant, but still had a warm and welcoming vibe. There is an extensive bar in the front and an open kitchen in the back, offering a glimpse of the chefs at work and the art of their craft. The outdoor patio seating behind the restaurant is also a plus, especially during the warmer months.\n\nThis is a must try restaurant if you're in the area and one of my go-to spots for delicious, authentic, and affordable Thai food.", "author": "Kevin Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-12", "description": "This is one of my close friends favorite places. I am not a huge fan but the food is good for the most part. \n\nI think that my biggest grievance here is the service, its OK and that's it. I have been here at least 4 times and that is the general vibe I get. They plaster on smiles and just try and get people in and out. I do think it is partially a language barrier, as most the staff I have interacted with had heavy accents and did not seem to be native English speakers.\n\nAgain the food is decent and if you are craving Thai and in the neighbor is not the worst stop that you could make.", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Amazing food and the outdoor patio is everything!!! They serve you 4 different kinds of hot sauce to choose from and it's amazing! Hands down, one of the best Thai food restaurants I have ever been to! Props", "author": "A F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Definitely a lovely place to bring a date. It's very nice and cozy. The atmosphere is very intimate and uplifting. On top of the wonderful scenery the prices are spectacular. Every dish is under $11. That's a bargain especially in this part of Brooklyn. \n\nMy Tom Yom soup was enormous and only $4.50. The portions are very large and the prices are so comforting. I can easily see why it's so popular.", "author": "Waheda I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "My favorite place for Thai food. The food is excellent and the staff are super friendly, especially if and when you become a regular. The atmosphere is super cozy, and perfect for date night. I recommend the mango salad and calamari for the appetizer. Their pad thai, pad see ew, and woon sen stand out from the surrounding thai places in the neighborhood (because there are quite a few to choose from) Their Thai ice tea is delicious and refreshing. The pineapple and spicy pork fried rice is a party in your mouth (pause) if you're looking for a rice option. My only pick is that their delivery isn't as good, so I'd opt to stay in.", "author": "Jen R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-30", "description": "A few years back, Joya was really good. The food was delicious. However, I did not have the same experience two days ago. We were five people and asked for a table. They wanted to squeeze us in a table of 4 without putting another table together. Meanwhile there was a table of 6 also available where we could have sat comfortably. I had a pad see hue and it smelled burnt. It lacked flavor and the soft drinks didn't have any fizz. \n\nAlso- my sisters phone had died and she asked if there was a way they could charge it for her since she was far from home and they said no. (It's 2017 and everyone has phones! Why can't you charge it) I do understand some places have their set of rules, but they were rude when they said it. If we are paying customers then have some decency. \n\nIn any case, I wouldn't want to go back because I don't believe the food was worth it. I've had Thai food in much better places.", "author": "Janelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "Good food, good vibes. Not too fancy. Open kitchen which i really like. No actual drink menu but there is a bar. Outdoor seating so bugs come in but i guess you can't help that.", "author": "Anastacia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I love this place!  Great food, large portions, decent price.  Can't believe I'm only now writing this review because I come here fairly often.  Good drinks.  We know to go in the early afternoon to avoid the wait.  My favs are the calamari, mussels in white wine sauce, beef pad see ew accompanied with a lychee martini....be sure to have cash-no cc accepted.  There's a backyard terrace for outdoor dining.", "author": "Zee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Went for lunch wth my best friend to joya and it was an excellent choice!! I had the vegetable pad Thai and was delicious . The decor is more modern and seating is comfortable..not too tight \nLoved it so much I took my daughter and hubby back for dinner and they loved it! Was super crowded bt the hostess was quick and got us seats in less than the wait time we were given. Everyone were extremely welcoming and polite ! Food really is super delicious and maybe the best Thai on my list thus far! I will definitely return and they are highly recommended !!!", "author": "Demora F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-27", "description": "I love food . I feel the prices may have gone up a little but still very affordable. I would definitely return.", "author": "Monty M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-06", "description": "I had the most unpleasant conversation with a  host named Quan working this afternoon shift. I mentioned to her that we were interested in making a reservation for a business meeting. She kept yelling on the phone saying that there is no need for us to make a reservation and that Fridays are too busy. However, she did not even bother to ask us the date of the event or occasion.  When I told her we would like a reservation for May 30th she responded saying  that's too far out why would you make that reservation.  When I asked her to speak to a manager she said that the manager could not talk to us about this. We simply wanted to ask if we could make a reservation for a business meeting and the way she handled this matter was so unprofessional. We will take our business elsewhere.", "author": "Luna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "Excellent!!! Food comes out relatively quick and piping hot. Spring rolls and Pad Thai are delicious. No complaints about the service. All this PLUS they're very reasonably priced. Its a win-win if you ask me.", "author": "Aga N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "Used to come here with my friends from high school but today has been my first time here since 2013!\n\nThe ambiance is great if you're looking for a romantic feel (especially in the evening) there's a nice candle on every table and most of the lighting is from a strong of bulbs. Now lets get to the food! My partner and I weren't too hungry so we shared a large fried calamari and spicy drunken noodles. The portions of both are LARGE! We considered getting a small calamari but opted for the large and we only ate about half. The spicy noodles are flat, long, and very wide. Again portions are great, definitely share entrées to get a little bit of everything. \n\nEverything seems great, why 3 stars?! I hyped this place up a lot to my partner and was a bit disappointed. Of course I know many things change over the course of 3 years but I was disappointed in the lack of seasoning in all the food... the calamari was great but a few pinches of salt go a long way (there aren't any salt shakers on the table so we were left with bland squid). The spicy noodles were not spicy AT ALL. This was great for me as I cant handle the slightest spice but my partner loves anything that brings pain to his mouth and was truly dissatisfied.", "author": "Anna Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "It had been a very very very long time since I had had any Thai in NYC \n\n1. Because I am always in Manhattan and let's face it there are tons of Thai restaurants \n2. Because I had a terrible experience at song.\n\nThat being said Joya converted me back. I walked in on a Sunday afternoon for lunch with my mom and sister. We were absolutely delighted with the food. I was extremely impressed by the flavored and quality of food. Not to mention how reasonably priced their menu is. Some of my favorites are pad see ew (I wish they made this with shrimp I'll ask next time I'm there) spicy seafood fried rice and of course the pad Thai. The calamari is super fresh and yummy. My mom couldn't stop raving about how fresh it tasted and how you could tell their oil wasn't super old and overused. On another occasion my husband ordered the chicken garlic entree with the jasmine rice... Super scrumptious!! Go to Joya!\n\nI can't wait to go back again! Not cash only anymore :)", "author": "Karla A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "So very happy we decided to try this place. Just a couple stops away from home so we ventured out into the cold to get our Thai fix. Definitely not disappointed.\n\nTo start, we had summer rolls. I would skip this. The sauce it comes with seemed ill fitting and there was nothing particularly good about this appetizer..\n\nOn to the entrees:\nWe ordered two specials: the prawn pad Thai with avocado and the chicken (white meat) panang (I think) curry with flat noodles. SO delicious. Both of them.\n\nI wanted to lick the plates and order two more entrees. I really really had to exercise all the self control in me not to order more.\n\nService was decent and interior was nice. Looked fairly clean, though the dishes and silverware were kinda dirty-- expected anywhere you eat out. The space is a sort of long railroad-style resto. I think there are individual bathrooms, but the place isn't that big so I don't think they'd need to have multiple stalls. The bar is in the front and the dining area extends and opens up as you walk further in.\n\nDefinitely will return and order a different app. Can't wait for the mains, yum!", "author": "Sandra Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-30", "description": "The foods were good just not enough choices. I felt rushed by the server, ambiance was cozy. Overall, it was a good experience .", "author": "Jane T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "Went here today after hearing great reviews. Unfortunately we never got to sit down due the rudeness of the hostess. When we walked in we asked for a table for 6. He said he would not sit us until everyone was there and we told him they were parking. He rolled his eyes at us and said nothing. Then he appeared aggravated when he was putting a table together. My mother asked if we could sit away from the front door and there were plenty of open tables in the restaurant. He said \" No, and if you dont like this table you can leave.\" He then said he doesn't pay attention to reviews and we could say write whatever we want\". Needless to say we walked out and went to Ghangi next store which was delicious. So rude and unprofessional, will never go back.", "author": "Lauren T."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}