{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-11", "description": "Our usual spot for Thai food.  I would dine-in only--I almost swallowed a used staple in my take-out food today.  I called to tell them, but they only said to \"Hold on\", and then left the phone off the hook for 10 minutes.  I'm guessing the person who packs the delivery also has the stapler nearby...I really don't want to find a new take-out place, but that was scary :[", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "Best kept secret, really good Thai food in a beautiful neighborhood I recommend the fried calamari and pad see yu =]", "author": "Noel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-25", "description": "Went here on a date, best Thai place I have been too because of yelp. The decor is amazing and did not need to wait on line, went on a friday night too. looks like a classic bar, but with a touch of thai. the outside lounge looks like a nice spot to drink and eat but unfortunately it was snowing. The price is very reasonable I only spent $30 on two entrees and appetizer. I highly suggest the Pad Thai w/ chicken. Hands down I will come back for more pad Thai please! \n\nTo get to this place take the F or G to Bergen st check GPS should only be a block over from the Bergen st.", "author": "Bryan Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-21", "description": "Great food, great prices, pretty fast service. I like. I had the spicy noodles (vegetarian) and my brother had the pad see yu (sp?) and both were good. The vegetarian spring rolls were awesome and a steal at $2.95. I'll be coming back. \n\nThe Thai iced tea was alright. Not bad, not great. And the margarita was pretty nice.\n\nBRING CASH!", "author": "Leandra W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-01", "description": "Delicious cheap Thai food!! \n\nInside is a little bit loud but you will see the kitchen with all the flames -pretty impressive. The outside area is quite and really romantic.\n\nI had dinner with a friend at 9:30pm: two big plates of fried rice with shrimp and vegetables, and noodles. Chai teas, and we spent $21!\n\nI will definitely go back.", "author": "Martina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "First time visiting... I must say I enjoyed the decor and set up the establishment.  The entrées and wine list,  reasonably priced.  The food,  which we had Shrimp Pad Thai and large order of Crispy Calamari... Was ok... The Pad Thai maybe had like 3 or 4 shrimps which was a low point for about the dish but the flavors were spot on.  I would have to say the downside of the evening was the two waiters checked on us every five mins... Which became annoying especially trying to hold a conversation.  I wouldn't have an issue going back... Might sit at the bar next time.", "author": "Ralph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "Fun spot, can't beat the price for the amount of food you get. You get good portions for these prices. Quality was there too.", "author": "M S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "where do I start! this restaurant was recommended by a co worker and ive eating here since then. This place is fantastic and cheap! I just ate here last friday and ordered two appetizers and two entrees and the bill was 28.00. IVE NEVER HAD A BILL MORE THAN 38.00 for two people. The food portion is amazing and I fell in love with the coconut curry. Every darn thing is good! The only reason i gave it a four star was because if your looking for quiet and intimate this is not the place. Its always loud. Hoever if you can around that you will have a great dining experience.", "author": "Demar P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "Superb pad see ew. Totally affordable. Completely filling portions. All for $10 at lunch. Love it. Service is friendly and super quick, and the decor is fun/dark/trendy.\n\nOnly downside is cash only.", "author": "Priscilla T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-31", "description": "I come to Joya every now and again when I'm visiting friends in the neighborhood. Overall, I've found the service is good, food is good, atmosphere is good. I've never been WOW-ed but never really disappointed, either. \n\nMy go-to thai dish is vegetable red curry (boring, I know) and that's usually what I order here -- they do that damn-fine. Can't speak to much else, but I say give it a go.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "If you like unauthentic Thai food this is your place. The Tom Yom Goong had shrimp and broth, but the broth was virtually tasteless. I had some special with shrimp and asparagus served over pad Thai noodles, but again, the dish was basically flavorless. Even ample heapings of chili paste did not help. Ordinarily Thai cuisine is flavorful and spicy with lemon grass and Thai basil being part of the recipe. Here sugar was the main ingredient -- and salt too. Hopefully this was just an off night.", "author": "Gary D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "Cool place to come with a date or have a bite to eat with group of friends. Decor was nice on the inside and in the warmer months their's seating in the back. I found its more for those who like quantity over quality. I wasn't impressed with the food. It was fresh But didn't have much flavor. Prices are very inexpensive.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Excellent food and amazing hospitality. My wife and I always have a good time when we go to Joya. I especially like that the owners are usually there and make you feel so welcomed. The atmosphere is also key very cool design and a diverse crowd with lots of energy. Love the dry spare ribs my absolute favorite. I suggest trying them with peanut sauce on the side. The prices can't be beat.", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Dim lighting, bar, outdoor seating, \u0026 sometimes a DJ, Joya is a great place to get dinner and drinks with some friends or your date. Food is very good and at affordable prices.\n\nFor exampleThe variations of fried rice is only about $6 or $7 and can easily be shared between two, maybe three people.", "author": "Miranda R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "Food was good the service can be better.  Its way to noisy wow it was loud. The place is beautiful,  but couldn't get over how loud it is.. my family and i really stopped talking because we couldn't hear one another", "author": "Ferial D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "Imagine a restaurant that uses fresh ingredients, not to heavy with the fat content, and cost about what a meal at McD would cost (minus the booze)...now imagine the food was actually good, now open your eyes...you are in Joya!", "author": "Paul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "We stopped in for a quick bite and got shrimp pad thai and chicken green curry. The portions were very big and prices are good. I've had better pad thai but the curry was pretty good.", "author": "Lynn C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "Dinner at this Thai restaurant on Court St. Was very good. You come here for a hearty meal, not for an intimate dinner. We had three different chicken dishes: Pad See Ew, Pad Thai and chicken in garlic sauce.  I also had the seafood soup, which was a meal in itself! Portions were generous and very reasonably priced. Recommended.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-02", "description": "Here are some words to describe this place:\n\nMediocre :: forgettable :: inconvenient :: bland :::\n\nThey do not have a drink menu...they only take cash...the service is fast but poor...the menu options are limited...dessert menu, non existent. Fried banana with ice cream and Mango Rice Pudding isn't a dessert menu.\n\nThe fried rice tasted super greasy and lacked taste, the skirt steak had NO TASTE!\n\nThis place will not see us again.", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "Excellent thai food at a reasonable price.  Portions are very good too.  One of the best in the area.", "author": "Matthew V."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}