{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "I've been here 3x and only succeeded in eating just once. \n\nThe first time, ordered take out and then they told me cash only. \nThe second time, came for dinner but there was a 45 minute wait and we needed to catch a movie. \nI finally gave up and came here after work and ordered take out. I called when I got off the Borough Hall stop and walked right over once ordered.  I ended up ordering the chicken pad thai and a small order of spare ribs. \n\nGot my food and 15 minute later, it was still soo good. For $15, I had a good amount of food. The pad thai was huge and the chicken was well cooked. Spare ribs weren't oily (like some places are) and they came with a side of thai dipping sauce. Still on the fence if this has better pad thai than Born Thai or not. Guess I'll have to try these places again ;) \n\nI'd love to come eat here but dinner service is always PACKED! Great decor, it's very sleek and sophisticated. They also have a small bar and its a fully stocked bar. But cash only (NOOOOO). \n\nOne day I will succeed in actually dining in this place. one day....", "author": "Jane R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "If you want a good and INEXPENSIVE meal - This is the place - no others come close.\n\nIf you dine in and it's crowded (and it usually is) - be prepared for some serious noise -you may not be able to chat with your friends - On the other hand - you can yell and nobody would notice!", "author": "Lynn M G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-12", "description": "3.5 stars.\n\nThis place is interesting - it's a really nice restaurant with very cheap prices that only accepts cash. It's like Chinatown restaurants, but with a very nice interior.\n\nThe food here is a bit hit or miss. \n\nPad Thai - Amazing. The best dish that I tried here. Definitely get this.\n\nThai tea - It's a really refreshing drink and reminiscent of milk tea. Do try this.\n\nPapaya Salad - Really good. I loved how the sweetness of the papaya balanced out the vegetables in the dish.\n\nPad See Ew - It was good, but generally overlooked for the Pad Thai.\n\nGreen curry - It was pretty good, though I'm not a fan of curries in general, so I didn't love it.\n\nAny Entree - Bad. VERY BAD. I got a beef stir fry dish (Nuur Kratiam) the first time and the beef was unusually dry. The vegetables also seemed a bit raw. The stir fry dish I got the second time (Pak Kratiam) wasn't any better, and basically drenched in a sauce that wasn't any good.\n\nSo while the pad thai may have warranted 4 stars, the other dishes were big misses. Be careful what you order!", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "Love Joya! \n\nThis is why:\n\n1. Inexpensive prices for large portions\n2. Quick service\n3. Good decor and fab garden area\n4. Best curry dishes I've had in years (but ask for peppers to add spice)\n\nPicky points of meh:\n1. Long waits at peak times (weekends)\n2. Cash only - ok, I get that it helps to keep prices down but come on!\n\nJoya comforts me so!!!", "author": "Katie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-30", "description": "Came here craving Thai and frankly just didn't satisfy.\nThe place was styled nicely enough and the service was good, but seating was a bit cramped and the food just wasn't anything special. \nOn to the next...", "author": "Dlanor N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "I was craving for Thai food, so my friend drove me here to grab dinner. We had almost missed the place because of a scaffolding outside the restaurant. We entered and the atmosphere felt really warm and yet a cute place to go on a date for. At the front there is a bar area and the dining area and kitchen is towards the back. We were seated promptly by our really friendly server.\n\nTo start we ordered fried calamari and Gai and Nuur Satay - skewered chicken and beef with peanut sauce. I am a die hard fan of fried calamari, so this dish was a must hehe. The calamari was really good - fried to a golden brown perfection. The skewered chicken and beef appetizer was also very good and the peanut sauce was delicious. Wished I can add peanut sauce to everything I eat...okay maybe not everything...don't think it will go well with my love for sushi and wasabi. Ew. \n\nOkay, so where was I? Right. Thai food. So my friend, a soup lover, ordered the Tom Ka Gai - coconut soup with chicken and mushrooms. This soup was good, but not great. Don't get me wrong, I really like...okay I love coconut, chicken and mushrooms, so this soup should have been like heaven for me, but it wasn't. It was just good enough for my palate, maybe if the soup base was slightly thicker? No, not thick like a stew or something, but maybe less runny?\n\nWhen I eat at Thai restaurants, my default entree would be a Pad Thai because I like to do a comparison between other Thai places. But this time around I did not order a Pad Thai, but instead I ordered a Woon Sen - sauteed glass noodles with chicken, mixed vegetables and egg. This dish was fresh and good. It's light and not overly salty. The portion was pretty big too, which I had to bag it to go.\n\nMy friend ordered Pad See Yue - sauteed fresh flat noodles with chicken, chinese broccoli and egg in brown sauce. He was originally going to order the Pad Thai, but after our server explained to him the differences, he settled for the Pad See Yue. The portion for his entree was pretty big too and he liked his food a lot.\n\nI like Thai food in general and was very satisfied this place was not a disappointment.", "author": "Sandy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "My top 5 favorites locations to grab a bit in nyc. the staff and management are always on point.", "author": "Kevin J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "Food - 5 stars \nAmbiance - 5 stars\nService feels rushed, if you're looking to have dinner and a long conversation you may feel a little rushed here. If you keep ordering drinks you should be ok. The wait at times can be out of control and they do not take reservations.", "author": "Liana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-19", "description": "Poor Customer Service  it appears the Owner is  very rude selective and there are better Thai restaurants in area without arrogance rudeness and impolite behavior from the Owner", "author": "Dawud H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "I come here with my boyfriend because we absolutely love Thai food. Best thai I've had in the are of Brooklyn so far. Intimate setting. A little crowded because its so popular. Food is incredible. I'm a lover of thai iced tea so a must order every time.", "author": "Michelle Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-05", "description": "When I am craving for thai food, Joya is the first place that comes into my mind. It is truly delicious, and worth the wait. Excellent food and service!", "author": "Ann S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-21", "description": "This place is always packed. Get ready to wait to be seated during meal hours. Lots of tables and seats tho. And in warmer days they open their backyard for some al fresco dining. The kitchen is opened so you can see the cooks doing their magic.\n\nThe food - is CHEAP and YUMMY. We love the curries, and the noodles (I always order the Pad Kee Mao with extra veggies) and the calamari.\n\nBring cash - this place does not take plastic.", "author": "Terk C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-21", "description": "For ambiance alone, Joya deserves a 4: It's very inviting and romantic both indoors and outdoors in their patio area, but it really messed with our experience that the service delivery was on rabid-high the night we went.  We were constantly pegged to order even though we asked for more time to look at the menu.  Each time we did that, our server would reappear within 30 seconds .into order in to order.  Quite annoying because there wasn't anyone other than us seated outdoors and a few tables indoors so we couldn't understand the rushing.  \n\nWe started off with the Salmon Spring Roll and the Chicken Massaman Curry special.  The Massaman Curry itself is very tasty, but the sauce was far too runny - so much so that the chicken looked like it was swimming around in a watered down yellow sauce and really took away from the visual appeal of the dish.  The Salmon Spring Roll was very mediocre - salmon wasn't all that fresh and the accompaniments were rather awkward.  We were still a bit hungry so we also ordered the Thai Calamari Salad.  This was my favorite dish of the night - very light, refreshing and they were generous with the calamari.  \n\nJoya is a good place to go if you're looking for something extremely quick, but don't want to do McDonald's/Burger King or any of the other fast food joints and the environment provides great romantic potential, but you'll be disturbed many times throughout your meal.", "author": "Crystine W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-06", "description": "Strange my 1 star review I wrote months ago is no longer on here.  Well, I will give it 2 stars now for the following:   nice outdoor patio, fast service, huge portions and low price.  But as for the quality of Thai food- it was lacking in any real flavor and for the both of us a huge disappointment.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-24", "description": "BEWARE!  This WAS one of my favorite Thai eateries in Brooklyn and I was so disappointed during my last visit this past Monday. We sat in the back of the restaurant by the opening of the kitchen. After dinner, we noticed large bowls of full of noodles piled up in the floor. I was appalled, shocked and so disappointed. No wonder the noodles came out so quickly... nothing like a bit of shoe smut in your food!!!\n\nIf this is not a health code issue, then i don't know what is. Joya has an A grade and at this point, I'm sure they bought it because they have major sanitary issues. I took pictures and video of it in case no one believed me and posted it as well. \n\n\nIf you don't mind eating from food off the floor, then by all means... ENJOY! As far as I am concerned, I will never go back there!", "author": "Rose F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "Great place, come here maybe 2-3 times month. Vary nice workers. But wish they could do something about the drunken noodles. Vary weird taste.", "author": "Nur H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "Joya, Joya, Joya. The food has decent if not pretty good taste but these guys are not as consistent as they should be, every once in a while you get some greasy food that you end up picking things out of. outdoor seating is a plus. Priced pretty well.\nUsed to be obsessed with this place until I found Lemon grass grill, a little closer to atlantic and has much better consistency, price and i must say the foods a little better over that way. \nStill a great place to dine.", "author": "J T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "This place is ALWAYS packed!!  I went on a Wednesday night around 7:30 and had to wait 10 minutes for a table.  I guess the weekend starts on Wednesday in Cobble Hill.  As expected, Joya continues to pump out solid, solid Thai food.   This is my go to spot and of course I recommend to anyone wanting Thai in Brooklyn.  Their daily specials change every day and are always eye-catching.  Their salads are really good and I especially love the flavor of their curry puffs.  \nHell yeah, I'll be back!!", "author": "Ava H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "My very first experience eating Thai food was at JOYA.  I've been eating here for years so it's only right that I write a review. The food is standard. Good but they aren't reinventing the wheel here. What JOYA has mastered is a dessert so good it feels like a lustful sin is being committed with each perfect bite. \nThe awesome delight I'm gushing over consists of crispy, deep-fried, spring rolls stuffed with warm, sweet bananas, topped with whipped cream and served with a few scoops of ice-cream. The chef  completes all of this gooey goodness with a chocolate drizzle and a cherry. The food ain't bad either. It really doesn't get much better than that.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "Nice location and ambiance is great. Food is freshly served with a decent portion size. Nice cozy backyard space with a lofty feel. I have been eating there for years but first time reviewer. Definately will continue to dine there.", "author": "Ayana J."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}