{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-21", "description": "3 of us went on a Friday night for dinner \u0026 drinks, we waited an hour for a table and had drinks at bar till then. The place was jammin.\nThe atmosphere alive, good looking people all around.\nThe ribs are incredible so order your own plate. You won't want to share these and only 4 come to a plate.\n\nOverall I reccomend. good place to start a night out.\n\nThe food was excellent all around. we ordered tapas style. The food was not expensive at all and fast quick service!", "author": "Joseph H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "I loved the food I ordered and it was very inexpensive.  My boyfriend wasn't as big of a fan because his food was not quite as spicy as expected as well as a little on the sweet side.  Still a great place for Thai.", "author": "Jesseca R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-16", "description": "One of my faves! The food is delish, some of the best noodles I've tried by far. Everything tastes beyond fresh and the prices are very reasonable. Joya is my go to thai joint in Brooklyn.", "author": "Monica Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-08", "description": "I took off a star just because the place is soooooo loud.  I feel like I could hear people better in a club. I always had to scream just to hear the person sitting right next to me. \n\nThe service was ok, no complaints, but we did have to wait for about 20-25 minutes for a table.\n\nThe food was average. I liked the mango salad, mostly because it was non-spicy, plus they put in a decent amount of mango slices.\n\nI got the pad see you, which was alright. A little too oily for my taste. \n\nThe drink was pretty strong and not diluted, so they get a point for that. \n\nWould I go back there? No. The fact that the place was so loud completely ruined the experience.", "author": "brb b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "My friend and I are from SoCal and were exploring Brooklyn and really craving Thai food so we yelped and found this place. It was pretty good. The customer service was great, the decor lovely, and the food was good. The Thom Yum Koong was delicious! The Pad Thai noodles weren't my fav, too crunchy for my liking, and the third dish we had (name I can't remember) was decent but sort of lacking in flavor. Overall I did enjoy my experience and my friend thought everything was delicious so that's why I'm giving it a 4 star rating. For me the food would be a 3-star the decor 4.5 star and customer service 4.5 star.", "author": "Shunya W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "I ordered lunch for me and my staff one day, and was pleasantly surprised. Their curry was amazing and prompt service was the best part. Really good food.", "author": "Daniela T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "I went on a Friday afternoon. It wasn't too crowded or anything, but there were at least five or six tables. It also looked like a lot of the orders were take out or delivery. We got to sit wherever we wanted so we chose a comfy corner booth. The atmosphere is really cute. Prices are really good. I didn't order anything to eat but the friends who did said it was really good. They had the fried calamari as appetizer and Pad Thai and some beef dish I don't really remember. Portions were pretty big and they liked the food a lot.\n\nThey also have a daily specials menu and the service wasn't bad. \n\nOne con is cash only which is pretty inconvenient at times. They also don't have a drink menu [like thai iced teas, coffees, soft drinks, etc.] I'm sure they have them but they are just not on the menu.", "author": "Kyri K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-24", "description": "Terrible. I used to love Joya - it's so affordable and it was very decent. Plus the space is cool and I like the garden. It always felt a little factory like and fast paced but that was fine. We ordered from there last night for pick up. My dish came with chicken, not tofu. All the vegetables were cooked into mush and mostly onions not peppers and other things. I'm not a vegetarian so I ate it but wtf.  My partner's beef and broccoli was dry. Hardly any sauce to speak of.  The broccoli tasted old/pungent and the meat was like leather.  The rice was complete mush - zero texture to it whatsoever.  The summer roll tasted OLD old - the shrimp tasted funky and nasty. And it had mustard sauce? WTF.  The papaya salad was the regrettable and forgettable best of the bunch but also not good. a couple raw green beans, hardly any tomatoes or peanuts, and the papaya shreds/carrot shreds were hair-thin and over saturated/soggy with vinegar. Never again.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-17", "description": "An in-depth review in a few words.\n\nTrennnnnnndy. \nPacked. \nLong wait. \nFull bar. \nQuick staff. \nPaper placemats? \nTiny tables. \nNew friends. \nImmobile chairs.\nNew frenemies. \nThai arrives. \nTastttttty. \nBill arrives. \nCheap!\nJoya?\nA-Okay!\n\nThe end.\nBow.", "author": "Sabeen A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-06", "description": "Seriously disappointing. Maitre d' kept talking on his iPhone while he seated us. And was rude when we asked about sitting outside.\n\nWe order a bottle of wine. Out came a single glass of wine. We explained, but the bottle did not come without another reminder.\n\nVegetable spring rolls were greasy. Mango salad was not ripe and not particularly Thai. Fish curry was decent, not distinctive. \n\nLots of show in the atmosphere, little substance. Large portions of mediocre food and low prices are what this place has going for it.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-27", "description": "How the heck did this place get such rave reviews?!?!  I've been wanting to try this restaurant out because it's received such high marks here on Yelp.  But the other Yelpers must've never had good Thai food before because Joya is nowhere near up to par, and I'm not saying that just 'cause my man and I were seated at the table right next to the stinky bathrooms.  (Restaurants should be smart enough not to put tables right next to toilets, or at least people sitting at those tables should get 75% off their meals.)\n\nWe both ordered Tom Yum Goong soup since it's one of our faves.  You get a huge bowl, but it's a bowl of sugar and nothing more.  No lemongrass, no spice (even though it was really red), all sugar water.  I suppose I'll give them half a point for at least using fresh mushrooms.\n\nI ordered the chicken pad thai as my entree, and, again, you get a huge portion.  Bigger is not better, people!  If it's not good, you still won't please me not matter how large you are.  The noodles were drowning in sauce, and I wanted to drown my sorrows in some real Thai food.\n\nMy bf is less picky about his food than I am, and he wasn't pleased either.  And I'm not pleased that my bf was right about something.  He's constantly annoyed that I have to Yelp restaurants before I decide to eat somewhere.  He said that just 'cause Yelp says it's good or bad doesn't mean it is so.  I trusted you Yelpers, and this is what I get??  My bf's never going to let me live this down...", "author": "JaShin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "You  know you're in the right place when you see that other Thai places within a couple of blocks are empty and Joya has a 40 minute wait.\nThey do what they do, and they do it well.\nThey have a full bar and the drinks are pretty good.\nwe love love love the spicy noodles and its what we order about 90% of the time. I've had various specials and have never been disappointed.\n\nOne think I've learned, there is a level of quality that Joya achieves on the regular and depending on who is making the food, it can be exceeded.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "It takes me back to Thigh Land.\n\n\nFood: The food was not greasy and well portioned. The menu selections was also extensive. I had Green Curry Chicken and it was moderately spicy with strong coconut flavors filling my mouth with every bite.\n\nValue : It's not that pricey, you'd get by with 20 dollars a person.\n\nDecor : It's dimly lit , and the dark colors give it ambient vibe ,but this place is always packed so there is no ambiance.\n\nOverall: Hmm Tasty! , for the location you'll feel like you're in Thigh Land.", "author": "Eeee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Food is pretty good, the prices are reasonable. The wait in the evenings is horrible though. \n\nI like their appetizers but have gotten mussels that didn't taste as good as the times before. I started going here before they had a busy clientele but now that they do the service is kind of slacking..", "author": "Rome Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-16", "description": "I gave it another try, due to Lucali's being booked for the night. \nNEVER AGAIN!!!\nOMG! This restaurant needs to fire their SASSY host ASAP!!! He is extremely unpleasant when it comes to dealing with customers, which is PRETTY important for a HOST. My family and I planned on having dinner for my birthday, 11/12. I called 2 hours in advance to make a reservation, to which they replied they don't take reservations on the weekend. Understandable.\n\nI arrived for my dinner but we had to wait for the entire party to arrive, Again, understandable.\n\nThe entire party arrives, and I notify the host. With an attitude, he states that he'll let me know when the first table is available. then he proceeds to ask, \"how many people are in the party?\" I tell him, \"6\".\n10 minutes later, he calls me and tells me the table is ready. As we walk over he brings us to a table prepped to seat 4!\nI tell him there's 6 of us, he then exclaims, \"you told me 4, this table cannot seat 6 people!\"\nI let him know that we'll just continue to wait in the entrance. I took it upon myself to walk over to Ghang Thai to see if they had any available tables and they did, THANK GOD!!!\nWhen I arrived back at Joya to let my party know that we can leave, I'm hit with the fact that the host offered us a table while I was gone but what they had done was push two tables together that weren't leveled on top and when my sister brought that to the host's attention he said, \"What's the big deal? You're just gonna sit, eat, and leave.\"\n\nARE YOU SERIOUS???\n\nI would never recommend this place, let alone go back. Ugh...", "author": "Ms. E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-26", "description": "The food was good here, however the service was hooooorible!  The server was unfamiliar with the menu and was dismissive, rude and had an attitude when I asked questions about the menu items.  The host and other servers there were short and unfriendly as well.  Worst of all when I spoke with the owner Andrew about the issues I had with the service, he was a bit condescending and had a very nonchalant attitude while discussing the whole situation.  I will NOT visit again and I definitely don't recommend this restaurant to anyone.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-08", "description": "I wanted to see what the big deal was with this place.  It's always mobbed outside, and the decor made the menu look swanky.  \n\nSo I took my girlfriend here for dinner after a long day at work.  We were both starving and the 30 minute wait didn't make things better.  After being seated we quickly ordered the Fried Tofu which was served quickly and inhaled ever quicker.  Tasty - ok, now where's our veggie Pad Thai?\n\nTwenty minutes later it's served and I take the first big bite - right into a piece of chicken.  \n\nThank you Joya for breaking my ten year vegetarian streak.", "author": "Craig R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "Great restaurant! I was here for lunch. Their lunch special includes an pre-course (1 out of 5 choices) and a entree (1 out of 6 choices), and the price and amount was so friendly. The green papaya salad was really awesome. I ordered an extra dun yam soup and it's great too. The entire resturant looks really fancy and expensive and the price is so reasonable. Love to go back again!", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "Came here for lunch. I ordered the pad thai with chicken and really enjoyed it! Tasty, not too heavy, flavorful and a huge portion! My sister had the spicy vegetable noodles which apparently weren't spicy at all. The veg spring rolls were really greasy. Service was a little spotty but the prices are cheap so it was kind of expected. With that said, I'll come back.", "author": "Lita J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "Great food and don't forget the Fried Calamari, who knew? The BEST Thai Ice Tea but hey, let's get some nicer wait staff, thus minus one star. Give me a break, who died? TRY to be a little bit more welcoming. Glass noodles are the bomb, Salmon Mango (on the spec ial for the day) was fresh and fab. No complaints on the food. HOWEVER, and this was hilarious. I had my own organic tea bag, never had an issue before. I asked for hot water and when the waitress spied my tea bag, she FLIPPED! We will have none of this in here so to speak. Ok, ok, it's organic, I like my own tea, not trying to cheat anyone here but Sheesh! It was the tone and outrage she communicated if you call that communication but whatever, all is fair in love and war. No biggie. It's the attitude of the waitress, we were less than thrilled with the wait staff,  but we left a big tip anyway and why? Because that's just how we roll. Get it; roll? \n\nSo go and enjoy JOYA, it's hands down super good.\n\nThen off to the Chocolate Room, am I allowed to comingle with the competition in the same review. Oh well, keep pushing that envelope, and so it goes. Oh yes, we shall return. Yes to both (leaving that tea bag at home, lmao!)", "author": "Michele R."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}