{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "Pad See Yue is the best I've had in ages. Love.", "author": "Amber R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "It's a Joy to order and take home from Joya..ok that was corny.\n\nI love the food..I really do...but it's super loud in there...I can't eat there.\n\nbut I love the food and the price so it deserves 4 stars! :)", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "The food here is great!  The portions are pretty big and it's CHEAP!!  One of the best places to eat in Cobble Hill.\n\nThe only downside is it does get loud on weekends but that's worth the hassle to eat there.  The food more than makes up for it.", "author": "Rob U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "good food but mostly good service! and cheap! nice patio", "author": "Lady C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-18", "description": "Nice place. Food is good, prices are fair. They take cash only. My baby took me here on valentines day. Wasn't a long wait. Nice spot to take a first date. All in all try the shrimp spicey noodles. Its good!", "author": "hertz p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "Ate here yesterday and I'm sad I didn't find this gem when I lived in Downtown Bk.  I've only tried the Pad See Yue so far and it was great!  I've got to say I have had better Pad See Yue at Lime Leaf on 72nd st. BUT the price was the same (7.50) for a more bountiful serving!!  Four stars for price in relation to quantity!", "author": "L. W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "really good thai\ncan get very crowded and noisy but overall nice place to have dinner before starting an evening out", "author": "Nicolas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-21", "description": "Some of the best Thai food! Period. And the price can't be beat! The pad thai and spicy noodle is superb!", "author": "Tristan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "Great food .. great prices .. only bad thing is the wait but def worth it", "author": "Dima L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "This is the Best Thai I have ever had.  And it was so cheap.  \n\nMy husband and I went tonight (Sunday).  There was no DJ but we saw the turn tables so we will have to go back on a better night.  Loved the atmosphere.  Dark restaurant.  Candle lit and small lights over head.  I think a bit romantic.  I love dark restaurant.\n\nFood was AMAZING.  We both had appetizers (short ribs and spring rolls) they were very good.  I loved the dipping sauce for the veggie spring rolls I got.  I had shrimp Pad Thai off another yelp review.   like that review i was soooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo good.  My husband had the Maui Maui chicken (sp) a coconut curry sauce.  It was so flavorful.  \nI had two Thai teas and he had a sprit. \n\nTotal bill $32.30  And our main portions were huge.  You get so much food for your money.\n\nA great date and inexpensive.  \n\nThis is my new fav. Thai spot.", "author": "Courtney C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-05", "description": "Great food, great atmosphere, great prices. I had the garlic chicken with chinese broccoli special, and it was delicious! Wish I lived closer!", "author": "Kent J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-12", "description": "One of my favorite Thai spots. Food and service great, drinks are reasonably priced. The wait can get a bit crazy on the weekend for dinner, but it's worth the wait. Check with them ahead of time. You can tour the surrounding neighborhood while waiting.", "author": "Raoul B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "This place is very good. My bf and I have gone there a couple of times and we always left quite satisfied and pleased with the food. The service is pretty good which is sometimes a rarity in Asian places. So I find this bit real comforting. I really love the shrimp wrap roll appetizer. I can have a few of those in one sitting. I can't wait to go back and try more of their rice plates.", "author": "Carmela B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "Hands down best Pad Thai I have ever had. The chicken was so tender it almost melted in your mouth and the noodles and sauce were just right.", "author": "D. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "I completely love this place, this is usually my go to place when I am thinking thai, along with their sister restaurant Song. I have never been disappointed, EVER@", "author": "Winston R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-06", "description": "seriously THE MOST OVERRATED SPOT IN BROOKLYN. Everyone dies over this place but it is so basic. I'm so sick of being dragged here by friends who claim it is the best spot. SO BASIC I can make better thai at home for so much less money and I'm friendlier.", "author": "Shirin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-25", "description": "A bit cramped, I have had better food, it's okay! Wish they had better customer service! Maybe next time!", "author": "Veronica A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-06", "description": "DIIIIIIIIIIIISGUSTING. Overrated. Crowded. Noisy.\n\nWho wants to eat food in a \"club\" atmosphere? I know I don't.\n\nI ordered ginger chicken and it tasted like soapy cigarette water. It was so bad that I took two bites (just to be certain) and then told them to bring the check. They removed my food. They brought the check out and my food in a to-go containers. I told them, \"I don't want that food. Throw it out.\" They looked confused but followed orders. I know they were perplexed. The food was just that nasty.\n\nThis was in 2007. I never went back. Who knows what the food or atmosphere is like now. I was so incredibly scarred that I wouldn't even so much as THINK about going back again.\n\nAnd I only went because everyone RAVED about this place.\n\nIf Joya were a guy, it would be a 50 year old loser of a virgin. WIth a comb over.\n\nDO.NOT.WANT.AGAIN.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-22", "description": "Maybe it was because it was a friday night and they were packed out (had to wait for about an hour for a table for 6, but we didn't mind because we were at the bar) but everything tasted subpar. The grilled steak was swimming in a broth that wasn't too good. The mussels had a fishy aftertaste, and overall, it was not an impressive experience. Nothing made any of us say \"Wow this tastes good.\" The only marginally good tasting things were the pineapple fried rice and the pad see yue. This place fell off, used to be much better. But the atmosphere overall was not that great either. Super loud, like a cafeteria lol.", "author": "Mila L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "i really liked it here. i got the tofu pad see ew and my friend got the curry chicken. she didn't think it was that great, so maybe stay away from that dish. but mine was very good imho.\n\nthe service was friendly and the atmosphere was nice, and it wasn't too expensive. the glass of white i had was yummy too. \n\nall in all it was good! so good in fact that i am going to dinner there now!!", "author": "Kenna T."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}