{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "Without a doubt the best Thai food in Brooklyn (and possilby NYC, but I don't want to get ahead of myself because I haven't tried it all yet). I find it hard to stray from the pad thai because everything about it is perfect. If I'm not ordering the pad thai, its always the spicy noodles with chicken. If you're dining at the restaurant, be sure to ask for the hot sauces. They won't automatically bring them unless you ask. The som tum (green papaya salad) is an excellent pair to any entree. The chicken spring rolls and calamari are also winning appetizers. My mouth is watering just thinking about it. \n\nIt can get crowded around dinnertime, but well worth the wait!", "author": "Halle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Huge portions! Ugh, but fuck it, it's a cheat day. \n\nThe atmosphere and dim lighting gave that romantic/friendly vibe to it. Waiters were very nice and attentive. There is a mini bar on the side for anyone who fancies a drink. Appetizers banged out from the kitchen fast. The kitchen was not confined in a separate room but was a part of the dining area, but big air vents suctioned any smell so no weird odor of food when one enters the restaurant. Ordered the large fried calamari appetizer ($10). The serving was huge even for my sis and I. But the calamari was fresh and the batter was light and crispy (no salt added) and a side of chili sauce to go with it. Definitely a plus. The pad thai entree ($9 each) we ordered (one shrimp and one chicken) came out in a reasonable time. The pad thai was popping with flavor (zesty lemon, tamarind sauce, peanut sauce). Better than the ones I've tried before and trust me I had shitty ones. Chicken was moist inside and shrimp tossed in the pad thai sauce as well. Overall, our bill came to about $28 which is not bad at all considering we got to take home extra food that we couldn't finish.", "author": "Aidan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "Joya is one of the funner bars and restaurants in the neighborhood. Sure, the Thai food isn't Pok Pok, but it is good nevertheless. \n\nThe atmosphere here is always energetic. The space feels very big and is usually fairly crowded. \n\nI love the cocktails from time to time, and their version of pad Thai is fantastic. I absolutely love the papaya salad and the tom yung soup is beautifully spicy.", "author": "Jamie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-01", "description": "I went to Joya the other night with my family, it's always been a favorite of ours. We have our staple  dishes including the chicken curry puffs, mussels and  the mango salad., it was good. We ended up taking home our entrees including veggie pad Thai and pork fried rice. When we arrived home I was so disappointed the entrees were so dry. The pad Thai used to be one of my favorites, I dont know if it was an off night but I was not impressed. My hubby and I have been coming here for more then a decade. We will give it another shot and update my review as needed.", "author": "Tracey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "Wow! This is by far the best Thai food I have had in Brooklyn!\nThe service is amazing! Lets start with the staff very friendly and courteous. The decor is dark and romantic to hip and fun! Great for a first date to dinner and drinks with friends. Now the food is mouth watering! I had the woo-sen with shrimp (glass noodles). \n\nYummy definitely my new favorite Thai restaurant in Brooklyn .....\nSea what?", "author": "Yanel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "JOYA BANGS!!!\n\nPeriod!!! I actually just recently went back for the second time and go totally different dishes and they too were AMAZING!!! Spicy Mussles, Pad Thai Noodles (Cliché thai but amazing here), Coconut Curry YUM YUM YUM!!! Wow...so good...and this place stays PACKED!!!\n\nThe prices are really amazing and the service is quick!\n\nBut the most important part is this is the BEST THAI IVE EVER HAD...SERIOUSLY!", "author": "Damon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Im not very experienced when it comes to Thai cousine but wow, this place blew me away.  I had the Thai spare ribs and the Kang Kyo When Gai with the green coconut curry and both dishes were fresh to order and full of flavor.  Im so glad we gave this place a try.  Well worth it! Does not dissapoint!!", "author": "Jacqueline S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Great place to come for drinks and noodles with friends. It's always packed and the food is really great- and affordable!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-22", "description": "Update!  Women on the phone yesterday told me that they don't deliver to my location.  Too far ( about ten blocks from metrotech center) But I told her I have ordered numerous times including the following week. She told me that must have been for lunch. But no it was for dinner. Than she gives me an attitude and says \"ok but it's going to take a long time\". So I hung up and ordered from Lantern. The food is a little more expensive but I think its tastier! Try the pineapple fried rice and the thai ice tea. Your loss Joya if you don't want metrotechs (fdny headquarters) buisness!", "author": "Paul L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-17", "description": "The OWNER IS THE BIGGEST DOUCHE EVER!!!!!!!!!!\nGave 1 star only to be able to let all of there patrons and future patrons know that he is a jerk and they shouldn't eat there.\nThe owner got pissy because we joined two single tables together in his half empty restaurant.  Ridiculous!", "author": "I.R R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-26", "description": "Service: 1 star - Hostess was nice and let us pick our own table, servers were very friendly.\n\nFood: no stars - Yelp let me down this time. I was expecting a food coma by the end of the meal but no such thing happened. I ordered the Moo Kra Prow (pork in chili-basil sauce) and E had the pork in ginger sauce w/ string beans. Couldn't finish my dish and i hardly touched my rice which is a bad sign because I'm Asian and I love my rice. The salmon spring roll appetizer was not bad but the fish sauce drizzle was overwhelming. Maybe I should have ordered a curry-based entree?\n\nSpace: 1 star - good design, has a backyard for summer nights, and the kitchen is out in the open.\n\nWill probably not be back. Yelpers, give me a call when a legitimately good Thai restaurant opens up in Brooklyn. 'Til then, Queens is the go-to place for delicious Siam cooking for me.", "author": "Ro C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Definitely my favorite Thai restaurant. I'm not gonna lie, but I've only tried their red curry and pad Thai (what I usually order in any Thai restaurant) and both are delicious! Price is great too! One thing I really like about this place is that I see their employees eating food from the restaurant. That's how I know that I can trust their kitchen is clean and the food is quality.", "author": "Es L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "The food is amazing!! I had the Thai basil chicken! It was great! Their service was really quick too I was very surprised since it was a Friday night and packed. My new go to Thai restaurant in Brooklyn!", "author": "Michelle Carolina V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-13", "description": "I was looking forward to going to this place for quite some time I have heard good things but the food was the beef was burned the dumplings had no taste and the noodles were under cook", "author": "Juan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Joya has an amazing ambiance as you walk in it is very romantically lit up.  Additionally, they have a very cozy seating area outside as well.  On top of that their service was great as my friend and I played musical chairs as we could not find the perfect spot to sit. When it came to food, I ordered the Kang Gai sliced chicken with eggplant, bamboo shoots, peppers and carrots in a red coconut curry sauce. The dish was so savory and the vegetables tasted amazing in the red coconut curry sauce! Delicious!! I downed it with a nice cold Brooklyn lager on draft. Will definitely come back to try other dishes!", "author": "Shaleem J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Amazing food... Budget friendly, never a long wait for seating and OK customer service.", "author": "Jammy J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-05", "description": "I just don't love this place. Been here twice (in case the first time was a fluke). Nope. Chicken was over-cooked (rubber) both times, and sauce had a weird taste one time. (Almost sent it back.) Luckily, several other Thai places in the neighborhood to choose from.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "Wow. This was an unexpected treat; from the curry chicken puffs to the check. How often do you get to write that in a sentence and actually mean it? I had the skirt steak special with Thai broccoli (aka \"broccoli rabe,\" only sautéd in a spicy oyster and garlic sauce) and my reason-for-living had the vegetable Pad Thai with a Salmon wrap appetizer, whose name I can't remember because I psychologically block all things Salmon. Blame it on a childhood move to Oregon.\n\nFast and low down?  Inexpensive with huge portions so large that any one dish could easily feed two hungry midwesterners; four hungry brooklynites; nineteen hungry Frenchmen; and the entire Ford modeling corral. And no skimping on the meat either in favor of the cheaper veggie portions! That's what rates the fourth star and earns my highest accolade for any place that serves vegetables. I do have standards after all.\n\nFast, courteous service and a great atmosphere is why we'll be repeat customers and frequent delivery patrons. Do yourself a favor and drop in. No need to dress up, but no need to dress down either. And yes there's a backyard, but it was just way too hot and humid on this day to endure such an affront while eating the spicy Thai.", "author": "Johny Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "Good eats. Even better prices. The shrimp pad thai is awesome. Real great texture and honey flavor. The Thai beer is pretty bland though, almost like a warm Bud Lite. Get yourself an adult beverage or hearty beer like a Blue Mood instead. Cash Only. Enjoy.", "author": "Barney C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "Ordered two orders of chicken spring rolls , which were absolutely delish. \n\nPad Thai was very good. Red curry was just ok in my opinion but had eggplant in it.\n\nInside is very nice and chic, especially considering each entree is 7.95!\n\nGrade a rating", "author": "Christina H."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}