{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Great service amazing food love especially the chow fun and fried rice, and Thai ice tea, nice place to go and the prices are amazing the food is delicious and the portions are great when it's nice outside there is outdoor seating which is enjoyable. Been here about 10 times and can't wait for number 11", "author": "Christina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "I've been thinking about this place for a year since I moved away from the neighborhood. Well, I was back in the area today and got some lunch. Well.. It hasn't changed the pad Thai was awesome. Although the spring roll was oily, I let it sit on a napkin for a few it was to go. Oh.... Try the mango salad.", "author": "Brian V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "I'm an idiot for writing a review of Joya, which is one of the most solidly reviewed places in the neighborhood. BUT since I've lived in the neighborhood for 7 years and been to this place dozens of times (not to mention delivery) I can't resist putting in my two cents--and an obvious five stars. \n\nThe one tip that I might add to my fellow Yelpers is that I've taken many out-of-town visitors here from various countries and walks of life (whatever that means...) and everyone raves about the food (regardless of what they order), the speed, the portions, and the price. If you live around here and you've never been to Joya then you should probably be smacked.", "author": "M M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "BEST THAI IN NYC. i am not usually a Thai food lover but this place really turned that around. i had the sweet chicken curry with a side of rice. i found if you poor some of the sauce on to the rice its delicious. The curry is sweet and flavorful and the Thai Iced tea tied the whole meal together. The tea was sweet and refreshing and yummy. \n\nThe location is a cute little place on court street right near the F and G trains and a few blocks from the 2,3,4,5 and R trains. the Noise level is little to nothing. The bathrooms smell great and are clean. \n\nI highly recommend this place if you want great Thai food.", "author": "Immy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "SOLID Thai food and nice ambiance where you can take a date or catch up with friends since its not too loud (plus, there's a full bar!)\n\nKang Gai - red curry with chicken - SPICY and DELICIOUS!\n\nWould definitely go again! Plus, Trader Joe's is a few blocks away for some after dinner food shopping!  ENJOY!", "author": "Cookie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "As a loyal HopHap patron I thought I had been going to the areas best Thai restaurant....that was until I went to Joya. From the food, to the service, to the decor, this place is a solid 5 out of 5! The seasoning and cook on all of the dishes are great. We personally love the Pad See Ew and the Kang Gai Curry. I really feel like you can't go wrong with any of the dishes. The third time we dined at Joya with some friends we had an issue (human error...we all make mistakes) but the manager took care of us and made sure everything was made right without us even asking. The level of service and quality of food here is absolutely wonderful especially for the price! Definitely check out Joya if you are in the area.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-22", "description": "Not the most authentic Thai restaurant, but it's hard to find anything authentic in this area - making it good enough to venture into if you're hungry. It's also pretty affordable, but not as affordable as authentic Thai restaurants typically are.", "author": "Rey N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-31", "description": "I was extremely skeptical of Joya after the bad food I got at HopHap, another neighborhood Thai stand-by.  Perhaps Brooklyn Heights and Cobble Hill just don't get Thai?  I'm happy to report that I was wrong.  Joya serves fresh flavorful Thai food at really good prices.  Thus far, I've enjoyed everything I've had: curries, fiery salads, tom gai kai. \n\nNot, it's not Sripraphai, the stand-out Thai restaurants in Queens.  Not even my old favorite Bangkok Tasty in Astoria, a well-run neighborhood eatery.  But it's pretty good, efficient and cheap.  I'll take it.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Joya oh Boya!!!  sorry guys, I just couldn't resist! hahahaha\n\nI really like joya!  The vibe in that place is lively all day every day... You can go on a Tuesday and it is packed with action!\n\nThere portion sizes are huge for the prices and the specials are dddddelightful... !  It is okay for kids even though it is loud... and the kitchen is in the main room...\n\nSome of my fav include: \n\n~Som Tom Gai Yang (green papaya salad with a grilled chicken quarter and skicky rice)\n~Fried Tiger Shrimp Rolls with a plam sauce\n~veggie pad Thai\n~Thai House Salad with a peanut sour\n~Spicy noddles\n~Mango salad\n~ and more of my glass noddles!!! OH yessss pleaseee\n\nEverything is good and they make a mean Martini too!!!\n\nBig parties are welcomed and yet another cash only place.... umMm\n\nGood Eats!  \n\nP.S. I am always so stuffed I never get to dessert... Can anyone tell me what's good????", "author": "Maritza S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-04", "description": "Visited from out of state and met by the rudest owner ever!!\n\nFor a celebratory lunch with family the 5 of us decided to go to Joya.  We came in around 12:30 to an almost empty restaurant.  The server \"greeted\" us and proceeded seat all 5 of us at a small round table.  When we ask to sit at the larger rectangular table right next to the round one, the \"owner\" rudely stated to us \"Why would we push tables together when there's a perfectly good table right there?\" as he walked his way out of the restaurant, nonetheless!  To \"push\" the tables together would have meant sliding it less than half a foot.  There was only one table being used by 2 people and one person waiting for take-out.  The restaurant looked like as if it were unfinished since tables and chairs were being unpacked by the owner and his help, which could have contributed to his unprofessionally poor attitude.\n\n3/5 stars with all the stars going to the server and the food.  The server, a young man did his job just fine.  The food was nothing spectacular either.  If I were to eat here again it would be take-out only since that is what seemed to continually happen during our stay.\n\nI am not sure how this place got the rating it has.  If it wasn't a celebration, I would have walked out on the spot and taken my money elsewhere!!", "author": "KenYetta A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Great Thai food. One of the best pad Thais I've had in the city. And the price tag was unbeatable ($9!). The portion was so large it lasted me 3 meals. Trendy environment and decor, too!", "author": "Gigi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "My favorite 1st date spot. Its a little cute place. Only bad thing I always forget (the 50million times I've been) is CASH ONLY. Besides that this is the Best Thai food in NYC in my eyes. I love everything on the menu. I wish the bar was more up to date with the drinks but they have all that you really need.\n\nAmazing food for very little price. If you go on a Saturday make reservations or get there after 9pm", "author": "Sean M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Joya always gets it right. I love Thai food and they know how to its done. Try the pad Thai, the fried calamari, Thai iced tea, spicy noodle dish, green curry (spiciest),  also the lycée martini are fantastic.", "author": "Emma E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "Really enjoyed Joya. Went with two of my coworkers after work. We shared the calamari, crispy duck entree, and shrimp with Chinese broccoli fried rice.  Everything was wonderful especially the calamari which is a favorite of mine.  I really don't like being bothered every 5 minutes during my meal by the waiter so service was good in that sense. They have a pretty good variety of wines and beers however their drink menu (which an actual menu doesn't exist for) is very limited to margaritas (which taste like screw drivers) and mojitos (my mojito was very good)\n\nI think this is a place to bring a date to or come with friends. \nWill definitely come back for the calamari and fried rice! Wish they were open earlier in the day for lunch to order take out\n\nAnd the cash only thing may suck!", "author": "A. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "I would give this place 3 1/2 if I could but there're no options for it. \nBeware- we came in on a Saturday late afternoon- staff was eating- bartender was eating on side bar and servers we eating near the open kitchen. Lost a point.\n\nLost another point because it's a Cash Only establishment. \nServer was nice\nPad thai with shrimp was good- a bit oily but good and steamed veggie dumplings were good. \nSpicy noodles were kind of bland. \nBut-\nGenerous portions at inexpensive prices.", "author": "Nicole A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-02", "description": "Joya Oh Boya!!!!\nI haven't found better Thai food in Brooklyn than this. Joya is fantastic food at cheap prices. Extensive menu, great portions. Place gets busy.", "author": "Vito D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Very good Thai food !! Very nice decor and outside seating is great. Try t eat outside.", "author": "Pat F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "It was my first time in the area and I was looking for some cheap eats. I'm glad I stumbled upon this place because I was pleasantly surprised by its beautiful ambiance, tasty drinks and great food. And best of all, the prices are VERY affordable! We went on a Wednesday evening and the place was jumping. \n\nTiger Shrimp Rolls app ($5): satisfying. Great plum sauce.\nSquid Pad Thai ($9): delicious and a very hearty portion size. Ask for the tray of thai spices; they gave the dish that little extra kick I was looking for.\nSpicy Noodles ($9): also very yummy, but not so spicy.\nAppletini: good but unfortunately had to send my first one back due to a hair floating on top. Gross, but not worth causing a scene over.\n\nI didnt get a chance to check out the outdoor seating section in the back so I'm gonna have to come back!", "author": "Jillian O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-04", "description": "I'll keep it simple. \n\nGreat Food.\nAffordable.\nIt's a bit loud but there's alot of people and it was never overwhelming\ni'll repeat my last point the food was great.\n\nNo complaints the waitresses and staff was very helpful explaining all the dishes.", "author": "Hannibal D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Nothing but great Thai food here.  I noticed the same special menu as National and later found out that Joya is another location, so you can expect that same high quality of food and service.  You really can't go wrong with anything on the menu, try getting there during lunch hours for great deals.", "author": "Joseph D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}