{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "Joya was my Friday night meal after a walk across my favorite bridge.  It was very packed; my friend and I waited about 15-20 minutes before being seated.  We got a table in the narrow section next to the bar; every time the door opened, I felt a cold draft.  You would do best to opt for a table in the larger/inner section of the restaurant.  \n\nWe ordered the small calamari, which could have passed for a medium-large serving.  Hey, I wasn't complaining after walking 2 miles for food.  We also shared the tiger shrimp kebab appetizer.  I forgot if that was on the specials menu.  The appetizers were deceivingly on point.  Our expectations for our entrees were definitely heightened.\n\nMy friend ordered spicy fried rice which she didn't much care for.  I had the pork in red massaman curry rice dish.  The rice was uber-hard, like overnight rice you would use to make fried rice.  The heat from the curry was decent; I like to err on the mild side with spicy plates, but this had a manageable 'kick' to it..  The menu was very affordable; you can have a decent meal for $20 and under.  They probably make more money off the alcohol than the food.  A glass of sweet Riesling, not the best either, cost as much as an entree dish.  \n\nI would consider returning, but I might just stick with the appetizers.", "author": "Jenn F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Quite...bad.\n\nI ordered a penang chicken, my favorite thai dish, and, interestingly enough it said on the menu that it was only chicken. I.e. - it was not a 'penang sauce with whatever protein you choose'. Yet when it arrived, the meat, from what I could discern, was some sort of beef-based product. Maybe boot leather, hardened by many months of combat experience and then dropped into the sauce?\n\nThe wife ordered a shrimp dish that, as she said, we could have made better at home with store bought sauce.\n\nReally kind of atrocious thai food to be honest - and its unfortunate because I was ready to be charitable just to have a good place somewhat nearby but this is pretty horrendous.", "author": "Sean K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "The food here is absolutely some of the best Thai I've ever had. Mango salad to die for. Top it off with the sliced duck and you'll swear you're in heaven. Do yourself a favor and come here.", "author": "Akeem J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-29", "description": "Very mediocre overall. Bland food. Pathetic quantities of shrimp and meat - not even 1 piece for 4 people in the curry.", "author": "Ramita T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-31", "description": "How do I say \"Terrible\" and \"Disgusting\" in Thai!  The food is mediocre at best.  The manager is the biggest scum bag I have ever met in my life.  Everyone who was eating in the patio area was eaten alive by mosquitos.  When the manager was told of this situation he rudely said ...\"There's nothing I can do about it! And brushed me off.\"  I have eaten all over the world and I don't think I've seen such poor sanity environment.  If you are going to have an outdoor space you need to spray effectively and control the situation.  Otherwise don't have an outdoor space if you clearly can't handle it.  I will be making a complaint to the Department of Health to address some other issues that raised major flags.  Eat at your own risk.  The owner is another Cobble Hill snob who needs to pay more attention to the people he serves and not his wallet.", "author": "Lola R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Very clean, \"A\" rating proudly posted on the door. Drinks are good, get enough for the price. Food is well portioned, very tasty, yet too much ginger for my taste. Steamed white rice was on point, warm and not too sticky. 85% of the menu was under $10 and we'll worth it", "author": "Jay Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "This place has changed,  only 3 or 4 years ago it would have gotten 5 stars.  I haven't gone there in a while. Let's see,  the bar tender couldn't add up more then three drinks at once, if this guy was part of the space program our biggest rocket would be a bottle rocket.  He would give us different prices for the same drinks but two seconds later he would recalculate the price again.  Anyway,  the food still looks good and the waitress was fast however the portions have gone down. I think the prices have stayed the same but even the people with me were saying the same thing. It was still a good time. One other thing,  the beer wasn't cold enough.", "author": "Stefan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "Although it can get pretty packed, the food is always amazing. I've been here numerous times and always waited patiently to dine. The staff is really friendly, courteous, and always checks in (and not annoyingly so). \n\nThe duck, fab. Calamari, cooked perfectly. Pad Thai, yes please. It's all great. And the drink selection is great. I definitely recommend.\n\nI gave them four stars because of the wait to be seated and how quickly it can get crowded. And, also because it's cash only. But other than that Joya is joyous.", "author": "Tyra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "One of my favorite Thai places in the area. Very cheap (dishes are about $9-14) which is extremely reasonable for the location. I have never waited over five minutes to get a table. They have a very nice outdoor patio that is open during the warmer seasons. My favorite dishes would be the curries, the pad see ewe, and the pad Thai. Great spot for a date or to catch up with some friends.", "author": "Wade C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "I've been coming here for years and the quality has stayed consistent. Great quality food, excellent prices and stellar service. Joya is doing it right. The calamari never disappoints and neither do the curries.", "author": "Kathy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "First time here. You can choose to sit inside or outside. Serving are really helpful and friendly. Had a nice steak fried rice here :)", "author": "Hao X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "I am a big fan of Joya, and have been for some time. I was actually really surprised when I realized I didn't review them yet.\n\nFor some reason, Thai food is something we always take-in, so I can't really comment on decor and service. But the food I know quite well.\n\nLove the spicy noodles! Get 'em with shrimp or chicken; either way you can't go wrong. I've tried several spicy noodles dishes from other neighborhood spots and in my opinion Joya takes home the gold. \n\nI recently had the veggie spring rolls-fantastic!! I could've popped a dozen of those things. And the tiger shrimp rolls are great too. Two appetizers definitely worth getting. \nAlso, love their soups. Very tasty, and leaves you with a clean feeling. \n\nKudos to Joya for excellent Thai fare!", "author": "Sara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "I wasn't planning on writing a review for this place because I already wrote one for song and they are the exact same place. However, tonight I ate two new dishes that I enjoyed so i felt the desire to express myself. \nI ate two new appetizers that were both really good. First I had the Thai spare ribs which were tasty. They were the dry and crispy kind which I really enjoy and they came with a nice tangy side dipping sauce which have it a nice zing. \nSecond I ate the chicken and noodle soup which was absolutely freaking amazing. It was so tasty that I didn't want to stop eating it. I devoured it in like 2 minutes. The broth was addictive!!\nAs for my main meal it was delicious of course. This place never lets you down.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "I always enter hungry and leave satisfied. The best Thai food in Brooklyn. Joya is the sister restaurant of \"Song\" in Park Slope, they serve the same exact high quality and tasty Thai food, their menu options at both restaurants are the same, both Song and Joya are equally good.\n\nJoya offers good food made with high quality and fresh ingredients at very very low prices... you will be in awe!\n\nYou must try Joya, they are best at what they do, you can expect greatness from everything and anyting that you order at this restaurant.\n\nTip: Make sure to order from their Chef's special menu.\n\nI recommend.", "author": "Leo L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-16", "description": "What's all the fuss about the calamari? It was the most bland calamari I've had. I suppose if you want a hip looking restaurant for very reasonable prices (starting about $8 an entree) in Brooklyn, this is a great spot. But I guess that is actually an asset because that kind of restaurant is tough to find in NYC\n\nBut the food is nothing to rave about. We enjoyed our red snapper. It was good, not great. Great tender fish, not much flavor.\n\nThe ambiance is quite noisy. Not a great spot if you actually want to hear your partner talking... but if you're date is going awful... perfect ... you have some annoying music to fill in the silence between your bland conversation", "author": "Fam L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-12", "description": "So this place LOOKS nice, however the service is quite terrible. The wait is exaggeratedly long. They are not listed on open table, nor do they take phone reservations...... So you're going to wait and continue to wait. THE SERVERS AND STAFF ARE RUDE!!!!!! So if you want to come to some place with a nice ambiance with poor quality service this is the place to go!\n\nBut the upside is its cheap and the food is pretty good.", "author": "Mizz R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "My husband and I moved away from Carroll Gardens 9 years ago but we recently went to dinner at Joya and were happy that it was as good as we remember if not better!  Extraordinary really.  And the icing on the cake was when I spoke to one of the owners he remembered us and warmly welcomed us back.Class act. What a great place--the food, the drinks (mmm, that mango martini), the lively ambiance and especially that after a long absence we felt like it was still our neighborhood favorite.  We'll be back soon!  Follow dinner/lunch with a walk to the Brooklyn Promenade and Brooklyn Bridge.  Fun!", "author": "Ruth G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-22", "description": "I've been here before and never had a problem but last night's experience was horrible. I came in with a friend after a long day. I was so hungry. The appetizers were ok the chicken curry puffs were delicious. \n\nI ordered the Pad See Ew with chicken which is my go-to Thai dish. It was good, much better than the curry mess my friend ordered. Her food was gross, shrimp and veggies swimming in a spicy, coconut mess. She took one bite and couldn't eat it. When she tried to send it back the waiter was really rude telling her that there was nothing wrong with the food. She couldn't eat it, it was seriously that gross. \n\nThe owner comes over and TOUCHED her whole trying to give us a lesson in running a restaurant. He went on to say some crap about how he doesn't usually comp meals or change them because he loses money. Rude! She gets the shrimp pad Thai but both of our appetites were ruined by the bad behavior. Never again!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "Everytime I dine at Joya, I order something different and everytime, it's amazing.\n\nAlthough it's fairly crowded, this place has traditional thai food which makes my heart smile.\n\nThe Thai Tea is so delicious, it's probably the only thing I ordered everytime I visit.\n\nHowever, this place is not credit card friendly.", "author": "Latoya W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "I have been to Joya multiple times, different time of the day and the food never seems to disappoint. I have tried nearly everything on the menu, absolutely great food!!!", "author": "Rebecca M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}