{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Had a really nice time here last night. The food was good and I especially loved the ambiance. While I was waiting, I had a nice chat with the owner who was very friendly and warm. Overall a nice place that I will revisit. Only wished that they take reservations but I can see why they don't given that it gets incredibly packed without reservations. Thumbs up!", "author": "S C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Large portions of food. Awesome reasonable prices. Food is well seasoned. Drinks are nice and strong. Romantic atmosphere. Fast service. Great service.", "author": "Angel N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "One of the best Thai restaurants in Brooklyn.... Cheap, cheerful \u0026 effective!! Quick, amazing service. And the food is always hot \u0026 fresh!!", "author": "Ashley G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "Joya is pretty popular Thai spot in my neighborhood. It isn't anything that exciting, but what it is is decent thai that is affordable and has large portions. I can usually split most meals into two which is nice ha ha.  I have eaten here for lunch a number of times and also dinner. Dinner is the more \"poppin'\" time, it gets packed and I often see a wait. I don't know how long the waits get, but I wouldn't wait to eat here. But definitely pop in, if you are in the neighborhood and have a hankering for thai.", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "Indoor outdoor seating, ambiance just right for any occasion. Traditional Thai open kitchen style. High chairs available for the babes. \n\nMenu: Appetizer and specials, regular meal menu and drink menu. (There is a bar)\nFood is tasty and affordable, love the Thai mussels, coconut curry and pineapple fried rice.\n\nBest of all Chocolate room is about a block and a half away, gotta try brownie sundae and chocolate layered cake. Yum!", "author": "Natalie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-26", "description": "Okay so I came here during an afternoon with a friend, place was pretty empty, yet the customer service was no where, where it should have been.\nWe both ordered the soup and ordered our food. Our waiter after a long wait brings out our soup and leaves again quickly, funny thing though he didnt leave any spoons, so i thought perhaps he went to go get them. Few more minutes of waiting, Yeah... he wasnt coming back, found one of the helpers and asked him for spoons for the soups he eventually brought us our spoons. Aside from customer service I have no complaints. The soup (kind of cold by the time I sipped it) was good and so was the entree, I had the Beef Broccli. \n\nBottomline, good food, bad serviice. Also note does not accept credit cards, so have cash on hand,", "author": "Abdus A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-15", "description": "I've been here a few times before and felt it was moderate. Like another review said, it's \"Americanized Thai\". My recent visit was ok. I ordered a salmon with string beans and eggplant. Sounded like a light dinner until it came drowned in a super flavorful gravy. \n\nI get it, they cater to a different taste. I'm down with modern Thai--apparently in Greenpoint :X\n\nI don't feel I'll ever come back on my own, but a real good friend of mine loves this place; so there may be a chance. If so, I'll remember to ask for less sauce.", "author": "Salina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-08", "description": "I was a little surprised that this place was rated so highly.  I liked the place, and in this area of Brooklyn there is not a ton of ethnic foods, so its nice to get something different.  BUT compared to other Thai places in the city (especially in Hells Kitchen where there are a million Thai places) this place is just ok.  Its reasonably priced, but so is almost every Thai place in the city.  I would go again if I was in the mood for Thai, although going to midtown isnt that hard either....", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "First visited Joya on a date.  Soon after I started working not to far and it's become a staple in my life. lol\n\nI get pretty much the same meals from Thai restaurants - Pad Thai \u0026 Pad See Ewe.  Both never disappoint.\n\nThe restaurant can get pretty loud during lunch, so I recommend after hours.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "Came here during the day on the weekend. Finally a seat since the last time we were there was at night and many of us yelpers know its impossible to get a seat. \n\nThe food was ok but nothing that justifies the prices. I've had better in actual Thai restaurants in Flushing and asian neighborhoods without the long wait and pretentiousness. The music at night blasts at nightclub volume levels. I feel like I should've brought my pacifier, UFO pants and glo-sticks", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "This has been consistently good over the years. We have visited too many times to count. The food is fresh. The service is always quick and friendly. The tabs are inexpensive. This has been one of the best, affordable, family friendly restaurants in the Cobble Hill area for years.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "Came here twice with a foodie date who swore this place. First time was Saturday night one time and it was so epically crowded it made \"human trafficking ships from Africa 1700-1800\" look humane and comfy. We dropped our reservation while watching diners trying to barely enjoying their time with deafening music and the waiting crowd or staff always 2 inches away from their forks. \nSecond time it was afternoon. Finally got a table and ate and to be honest have no idea what's the big deal. I've had better in less trendy hipster neighborhoods. Meh", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "When I walked in it was packed with a 30 minute wait. The staff was courteous and the hostess kept checking on us. We waited for a bigger table. We ordered the Fried Tiger spring rolls, the potato chicken puffs for appetizers. Food came out fairly quickly. For dinner we ordered spicy noodles with shrimp. It wasn't really spicy in fact I added chilli paste but it was still delicious. The fried rice with shrimp and Chinese broccoli was really good. My boyfriend ordered chicken and shrimp entrée which came with a side of white rice but was extremely soupy. The food was yummy and veer reasonably priced. We will be going back or even a to go order.", "author": "Meme B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "This place blew my mind- because of 2 reasons. The food, amazing.... and the prices are soooo cheap for NYC! Like, didn't even make any sense to me for how gorgeous the restaurant was, the vibes, the lighting, the decor, the location.. Such a dope spot.\n\nYou're literally good ordering anything. I'd get a few apps and an entree. And cocktails were affordable too. I will be back, and back, and back again.\n\nI've been here for a date \u0026 out with friends, and it works for both situations. Clean, great service, highly recommend.", "author": "Raven C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Great local Thai restaurant that my family and I love to dine at.. The food is good and reasonably priced \n\nNegatives- they need to accept cc.. And have a wider variety of beverage options", "author": "Rachelle-Jolie I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "Joya is absolutely amazing. I was told about this establishment a few years back, and I've been hooked since. Where do I start? The food is amazing, the service is good, the decor is beautiful, and the outside patio is a nice addition. \n\nI've been to several Thai restaurants, but nothing beats Joya.  The BBQ Thai wings are a MUST HAVE.", "author": "Hantz D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Favorite Thai spot in Brooklyn!! Food affordable with a great ambiance.", "author": "Simone Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "My favorite Thai restaurant! Every time I go to Joya the staff is attentive and friendly. I'm never disappointed by the food. The only thing I can say bad about this place is, I wish it were closer to where I live   But it's definitely worth the travel!", "author": "Kay-Ann S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-29", "description": "The waitress rushed me to order my food. Very rude. She told me they were closing in ten min. It took her 10 min to get back to me, 1 minute for me to order my food and throughout that 1 minute, she told me they were closing at least 6 times lol.", "author": "Mila J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "The most extra special delicious food and service all night long! And every single time! Anytime of day of night, any day of the week it's deeeelicious and cheap Thai love", "author": "Jeannie E."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}