{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Awesome!!  \n\nWent here on a sunday for lunch when visiting NYC and the whole group was impressed.\n\nThe space is very nice, you can see the kitchen (which is always fun) and there are large floor to ceiling windows in the back letting lots of light in. Great atmosphere.\n\nBy and large, the food was great. The hands down winner was the pad see yue, it was the best pad see yue I have ever had. So good. The kang panang gai curry was also fantastic. It was a bit on the spicy side, which I liked but was a bit too spicy for some of my dining partners. We also had the Mango Gai Yang. We were expecting a salad with chicken and mango because it is in the 'salad' section of the menu and were surprised when it came out just as described on the menu: a half chicken, a scoop of sticky rice, and mangos. But, we were so glad we ordered it because it was delicious! The chicken was so flavorful and cooked perfectly.\n\nThe only two dishes that we didn't love were the Fresh Thai Summer Roll and the Yum Koong salad. Both were okay, we finished them, but not the best I have had.\n\nDespite 2 dishes not being as great as the other 3, this place still deserves 5 stars. The dishes we loved were amazing and the price really can't be beat (entrees under $10!).  I will definitely return.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-09", "description": "Came here because we were in the neighborhood and had a hankering for some Thai.\nAmbience is nice. Place has a modern look. Dimly lit but relaxed. Definitely one of those places that try to wow with decor but drop the ball with the food.\n\nAppetizer: Thai Spare wribs- small, drrryyy. Meh.\nMain: I ordered the Pad Thai. Boyfriend got the Gai Kratiam.\n\nThe Pad Thai was average/below average.\nWith the Gai Kratiam, I pointed out how white one of the pieces of cabbage looked. Upon further inspection, it was rolled up wax paper. \n\nWaiter was sorry not sorry. It was deducted from bill and we promised not to go back.", "author": "Christina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "Excellent Thai food in the Cobble Hill area, with generous portions and outstanding service. This place definitely isn't at the same level of authenticity as Pok Pok, but still retains a solid blend of comfort food and cocktails.\n\nOur group shared the shrimp summer rolls, and for entrees we tried the spicy pork and pineapple rice, the chicken pad see yue, and the striped bass in massaman curry -- all delicious and at the perfect spice levels we'd requested. The chicken woon sen was probably the only miss of the meal, which lacked flavour and hosting strange proportions of vegetables vs meat. Bonus points for not loading up the dishes with hefty grease puddles. There was a mix-up with one of the orders, which our friendly server and the kitchen fixed in a short amount of time.\n\nJoya also has a gorgeous garden in the back, which is really lovely for outdoor dining in the summer -- I wish they could do something about the mosquitoes though, since we were ravaged by those darn bugs multiple times throughout the meal.\n\nCash only. Really?", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "Just go. Seriously, if you like thai food you are doing yourself a disservice by not going here. Food was awesome, prices were awesome, portion sizes were awesome and the service was awesome. \n\nOf course they can get crowded, it's too good to be a secret, but who cares!?", "author": "Ted E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "They make the best Pad Thai and trust me, I've had my share.\n\nWhen my bf and I don't know what to eat, this is our default. It's tasty AND cheap. I've been coming here for years and it hasn't disappointed.\n\nOther great items are the chicken spring rolls and the spare ribs. The spring rolls come in a pair and the \"small\" order of ribs has 4 pieces. Try the thai iced tea as well.\n\nThey have a sister location in Park Slope, named \"Song\". Same menu from what I gather.\n\nNote: (I don't think its changed but this place is) CASH ONLY.", "author": "Melody N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-31", "description": "What can I say, a nightmare dining experience! At one time I would have gladly given  Joya a 4, as I was a frequent diner there over the years, so were many of my friends and family. We have even dined there to celebrate special occasions, but now if I could give them a zero for food quality and service I would! I am now boycotting this establishment and I am recommending that others do the same. \n\nOn Tuesday 12/30/2014, myself and 3 of my friends decided to dine at Joya for lunch and the following happened:\n\n- We entered the restaurant at approximately 2:00 PM and stood in the front to wait to be seated. No one approached us. We had to seek someone out to seat us.\n- Waitress approaches to take orders. We decided to only order drinks as we were waiting for the 3rd party.\n- Drinks arrive and my friend asked for lemon for his drink, it never came. He had to get up and go to the bar to get his own lemon.\n- 3rd party arrives and we are told by the waitress we must order immediately without any explanation. All the while I am observing new customers being seated. So I'm asking myself what's big the rush?\n-Waitress hurriedly takes orders in a very impatient and abrupt tone of voice.\n- 2 of the appetizers we ordered arrived and were eaten, plates had been taken away by the bus boy when the 3rd one arrived. Had to ask for more plates from the bus boy. Must mention that the place was not even crowded!\n-Asked waitress for extra napkins and more plates, they never came, had to ask the bus boy to get them.\n-Asked for second round of drinks, waited and waited for them to come. Had to ask the waitress a second time for the drinks.\n-It's now approximately 3:00PM, we have eaten, are conversating and finishing our drinks when the waitress rudely plops the check on the table and demands,\"pay now!\" Still no explanation as for why the big rush.\n- At this point we had had enough of the rude, unwelcoming and rude treatment from the waitress. So, we decide to pay the check and take our leave. I must also mention that in spite of the poor treatment, we still left her a 20% tip!\n-Also, around this time we had observed a gentleman come in and unprofessionally proceeded to rag out an employee in the open, in front of customers. We assumed he must be the Manager/Owner of the establishment.\n-I asked this person to come over as we were leaving to make him aware of what had happened and complain that as a regular diner, I had never been treated the way I had been by this particular waitress. Rather than apologize and maybe offer us a drink on the house or comp us some of our meal, he proceeded to make excuses for her poor service! He claimed that they close at 3:00, but they were still letting customers in after we arrived! Also, does this mean that diners should be rudely rushed out! Greed was the primary factor here!\n\nNow, I could be wrong, but I did not see a sign indicating as such, nor did I see it on Menu Pages which I had checked the day before. Also, all the waitress had to do from the very beginning was say that this was the restaurants practice. We may have opted not to be seated rather than be rushed through our lunch.\n\nIn any case, one word led to another with the manager demanding that we, \"Get the FUCK out of my restaurant, I'm calling the police!\" We welcomed this threat as we had also observed that the Manager seemed to be under the influence. His speech was slurred, he was yelling at the top of his lungs in front of diners, and was extremely confrontational! We waited outside for the police to come, but as we suspected, it was an empty threat.\n\nThe poor waitress came running outside behind us apologizing profusely and pleading with us to let the situation drop! We felt sorry for her and any other employee at Joya who has to be subjected to the treatment we witnessed and experienced by this person! I told him that I would be making a review on Yelp and his response was that it didn't matter, he gets 100's of diners in his restaurant! With this kind of service and attitude, I'm not sure how long that will last! If he is not the Owner, we recommend that he be replaced immediately as he is causing Joya to lose business!\n\nI must also mention that after I got home, approximately an hour later, my stomach started bubbling and I ended up sick with diarrhea from eating the food at Joya. I think it may have been the greasy Sping Rolls we ordered as appetizers. Probably old grease! Diners beware! I will be reporting them to the BBB and Consumer Affairs as well!", "author": "Kim W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "I come to this restaurant at least 3-4 times a month and it's been a good experience until today I walk in and was disrespected by the owner himself. I walked in with my friends and sat in a table because that's what I do most of the time since the employees are so busy and can't seat everyone. The owner walks up to me and says \"This is my restaurant, don't walk in here like you own this place.\" Excuse me? Then he tells us to sit at another table. I could not believe this is the owner talking me like this. Is this how you treat your customers? Even if he wasn't the owner he has no right to speak to a customer like this. I felt too disrespected to stay there another minute. Not coming back to this restaurant again \u0026 if I knew the owner was such an unprofessional A'hole I would have never came. Good luck to this nasty, unhappy man with a disgusting attitude on running his business. You just lost a loyal customer", "author": "Ayesha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Just a great Thai food place.  If you want Thai food you have no reason not to come here.  Mint city.  Good prices.  Great vibes.", "author": "Harry F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "American Thai at it's finest. I have been eating at Joya for almost a decade (bragging rights? Perhaps.) and it is always a great place to order take out, pop in on a Tuesday night when you want to get out of the house, or take a crew for music, livliness and great consistent food.\nThe prices are awesome too.", "author": "Maia D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "The owner and service at this restaurant are terrible. Worst service I ever received in this area. Highly suggest to avoid. Not worth the frustration.", "author": "George W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "My wife and I come and eat here every time we visit the city.\n\nService is excellent and good is superb. Ambiance is great too. During mild and sunny days eating in the patio is a great choice. It is located in nice part of Brooklyn. Newly remodeled bathrooms, contemporary tile and style. Bar is average. Get here early it can get full really fast.\n\nGreat meal place for catching up with friends.", "author": "Greg D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "My go to Thai food restaurant. Great ambience. Good prices. I have and will definitely go back.", "author": "Jack A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Never disappoints, unless, the deep fryer is down and u can't get Tiger rolls! :-( .. other than that food and service are always great .", "author": "Brittany J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "Every time I leave joya I don't regret going. Yes the wait for a table on a Friday night may be from half hour to hour depending on what time yoy arrive. but after you order you food it will be on the table before you know it. Prices are very good and the portions are large. Love the back area!", "author": "Graziella O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-03", "description": "Compared to the other Thai restaurants Ive been to this one was just mediocre it seem like a hype for nothing. The calamari was bland, no seasoning the chicken curry puffs was too tangy for me, and my pad Thai was too sweet. It just didn't do it for me but the drinks we made well. Maybe I just went on the wrong day.", "author": "Fabienne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "For being a beginner at Thai food, the food is marvelous! I began with vegetable spring roles and the mango salad for appetizers. I don't know what kind of sauce they use for the spring roles, but I am completely in love with it. Though, I do wish they gave me more springs roles. Then for the main dish I had the Chicken Pad Thai. I don't order anything else now. (Be warned! If you don't like bean sprouts, this dish is NOT for you). \n\nTip: You are better off sharing a dish if you know you cannot finish a meal. Their servings are big, but is better to have more food then less. \n\nOn the other hand, the nights are busy! The music seems to be loud and, since it's crowded, you can hear other's conversations. You're lucky if you wait for a table or pay the check that it won't be crowded between the bar, the register, and the people coming in and out of the place.", "author": "Cole G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-11", "description": "Whenever I hang out with my friend Jas in Brooklyn, we tend to end up here!  They love her and we love their food and friendly service!  Let me back up and elaborate:  CHEAP and DELICIOUS food!\n\nYou really can't go wrong with anything you order.  Their pad thai is as good as any and their curries are on point!  I love that besides their regular menu, they also have a list of specials which all always sound appetizing.  Makes you wanna come here with a big group and just order it all!  Tried the crispy duck curry today to share and love it - the pineapples and peppers really made it special.  \n\nOnly thing that you should yield to i that they are CASH ONLY so don't forget to stop at the ATM before coming in.  Also, try to come when the weather is nice so you can enjoy their rear patio.  We always get lucky and never need to wait at lunchtime, but always see people chilling at the bar to be seated as we leave.  Drinks are cheap though so no worries - cheers!", "author": "Niki C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "Loud, slow and inattentive staff but amazing food and great prices.  Cash only is a deterrent but outdoor patio dining, wide drink selection and tasty appetizers put negatives aside pretty quickly.  One thing for sure is clear - this place is popular beyond belief.  Think long lines if not there when doors open...", "author": "Mr B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "Amazing Thai food portions, flavor, \u0026 prices! Industrial/metal ambiance. ALWAYS BUSY! The calamari appetizer is a lot of bang for buck and tastes great! The typical pad thai, pad see ewe, woo sen, drunken basil noodle, red/green \u0026 massaman curries, and Tom Ka Gai (coconut milk soup with chicken and mushrooms) were all tasty and portioned well! I even was adventurous and ordered green mango salad and it was delish! It is VERY loud in this place, but it's to be expected with all surfaces being hard. There is an outside seating area and is super nice in the summer time with fairy lights. Great place for a intimate date or even for your group to hear each other at table! VERY MUCH RECOMMEND THIS PLACE and the other associated that  ones in the area...SONG \u0026 NATIONAL scattered in Brooklyn! \n\n(so because of the level of noise and cash only I'm taking away a star)\n\nPS- CASH ONLY! Most of the time this bothers me, but it's so cheap that i don't mind!", "author": "Jaclyn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Joya is a fantastic Thai restaurant that caters to a dressed up or last minute casual spot to eat.  The atmosphere is chill and warm with the lighting and flames from the kitchen.  The price range is awesome, especially for the portions and quality of fresh dishes.  Check out my full video review here: https://corey-ashley.squarespace.com/talk-on-the-town/2015/1/11/joya-review", "author": "Corey A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}