{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Food is very good. I travel here from the bronx cuz I love their Thai food. It's very affordable as well.", "author": "Jenna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "Huge portions at reasonable prices, with a cute atmosphere to boot. Unfortunately, the flavor is not my jam. The tom kha gai and tom yum soup were far too sweet. The red curry and the spicy noodles were fine but lacking in the heat that I love so much in Thai cuisine.", "author": "Tammy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Best Thai food in the Cobble Hill/Brooklyn Heights area, hands down. Super affordable, great date night or just hanging with friends spot. The food is quick and their Red Curry Chicken and Vegetables Noodle dish is baller. It is also super affordable- Pad Thai and a lot of other entrees come in at $10 - $15, which is not typical for this neighborhood. Just as good as Song in Park Slope, which I believe has the same owners.", "author": "Kayla G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "I cannot agree with other reviewers more that this is the best Thai food in Brooklyn, hands down. They have great decor, a great outdoor seating area in the back, great service and when you factor in price, I don't know why you'd go anywhere else. I live in Brooklyn Heights and Joya doesn't deliver so I walk 15 min down there practically weekly to get my fix of Chicken Red Curry - go out of your way to go to this place!", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Joya is a cool and hip little place with excellent Thai food!  The place has a friendly and relaxed atmosphere, Prices are very reasonable and service is nice and efficient. We had (Appetizers) Papaya salad, chicken satay. (Entree) Chicken Pad Thai \u0026 Shrimp Pad Thai. (Dessert) Mango and sticky rice. All very delicious!!!!", "author": "Kelvin V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "The restaurant was a little hard to find because there is not a big logo with the name. The food was very fresh . Open kitchen so you can see the chefs cooking everything. Tried the fried calamari. The sauce made the dish tasty. The curry puffs was nicely seasoned . The spicy noodles had just the right amount of spice . Generous portions of food . Good value for the price . Overall nice Thai food", "author": "Margaret L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Vibrate, delicious and fresh Thai food. Check for daily lunch and dinner specials.  This is my go to place. Omg.. the appetizers are everything also!", "author": "Sherina D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-24", "description": "I went here with my bestie this past Sunday for lunch. She orders a meal with shrimp and veggies and rice.  She noticed that the shrimp was not deveined. Uhmmm yuck! She told them to take the food back and remove it off her bill.  They said they were willing to devein it right away.   My friend said no thanks, it should've been deveined already.  I really like this place, but you have to do better with the shrimp. :(", "author": "Maguy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-18", "description": "Good price, descent food. Nothing spectacular! We were seated immediately by the kitchen. It was fun to See the cooks make our dinner, but as I mentioned, it wasn't a memorable meal! We. I got the green curry with chicken and my husband ordered the drunken noodles. Both were just ok!", "author": "Shirin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "I love Thai food. I ordered the spare ribs and they weren't the best. I've had their pad Thai and fried rice here and it's wonderful. There is outside seating but wear comfortable shoes because it's Rocky but cute ambiance. The interior is nice as well but can get super loud when a lot of customers are present.", "author": "Jenn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "It's been too long since my last time here, so I wasn't sure what to expect, a lot can change in 7 years! \nThankfully Joya is still as good as I remember and the prices are still exceptional, especially when compared to what I'm used to paying back home for Thai food half as good as it is here.\nYes, I'm sure there are better places around but they must be doing something right having been in business for 16+ years!", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Swadeekhap.The best Thai food ever.Love the ambience.Their pad Thai and Tom yum is very authentic.Loved it.Definitely recommended.", "author": "Gino S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-20", "description": "Food is good but service is not. Was served tofu in my dish after advising I'm allergic to soy. The server said it was \"just a bean soy blend\". The were not happy about exchanging the plate. And were going to go into another patron's bathroom with a key without even knocking. Very unrefined service.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Great food, everything's always served scorching hot which is a huge plus, and very affordable.\n\nI love their green curry, flat noodles, and vegetable spring rolls!!", "author": "Bianca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "Had the Fried calamari as an appetizer but didn't enjoy it much as the breading was coming off and the sauce was lacking flavor. The temperature in the restaurant was 84 degrees didn't understand why management couldn't have adjusted the thermostat. Felt like I was eating in a sauna instead of a comfortable environment. Even the waiter was sweating felt bad for them. The main course was good but once again lacked flavor. Been here many times and am aware of how the dish should taste. Overall the experience could have been much better and enjoyable.", "author": "Rick T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-25", "description": "15-20 minute \"estimated wait\" took over an hour, and we never get seated.\n\nReally shouldn't be such a difficult task to fit two people in that amount of time, but apparently the guy working the door has no interest in returning customers. Some people left out of anger, lots of people were leaving during our never-ending wait, yet only one or two groups got seated.\n\nSomething clearly doesn't work here, it's probably the staff. Don't bother coming unless it's empty. There are too many other Thai places within 2-3 blocks distance, making going here a waste of time.\n\nAlso it's supposedly cash only, if you dare.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "I think this might be my favorite Thai place, period. I've been here a couple times in the past, but that was several years ago. I'm glad to see that there hasn't been a decline in food, service or overall ambiance! \n\nTo start, we shared a small order of calamari. It was a perfect size for us. Though they looked a little light, they were flavorful and the sauce that went along with it was tasty. They were crispy and thankfully, there weren't too many tentacles. He had the massaman curry with jasmine rice and I had a beef pad see yu. This was the first place that I ever ordered this dish, and since then it has become my usual order. It was a large portion, especially for under $10! I definitely had to take some food home. The noodles didn't stick together, the beef was juicy and I didn't mind eating the veggies in it. I regret not ordering a Thai iced tea, but that just means I have a reason to come back. \n\nMy boyfriend and I came in a little before 6, and there was no wait. Score! We were seated in the outdoor area, which was cozy. Since there weren't too many people around, it felt romantic. \n\nService was good - we were checked up on several times (not that there were many people to look after). Our waters were full and our food came out pretty quickly. Our food was packed up quickly and they dropped off our check in a timely manner so we could get out of there.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Modern and trendy local thai restaurant. Good prices, generous portions and friendly staff. However, their food is hit-and-miss. Overall, Joya offered a very satisfying experience. \n\nAdventitious lunch for 2 while we were in the neighborhood. Having reading many good things about Joya, we were not disappointed when we stepped in. The interior is beautifully modern; great place for intimate dinners and casual lunches. Lots of detail in their art hanging around the walls. Joya gives off a feel-good contemporary vibe. Their lunch specials are $10.00: anything on the menu + soup of the day/ house salad. We ordered the Massaman curry and Pad See Yue with a soup and a salad. \n\nMassaman Curry -- Probably one of the best Massaman curries I've ever tasted. The coconut and curry medley was perfect -- neither flavor was overpowering the other. The curry was creamy. The chicken was cooked to perfection. The amount of potatoes and chicken in the curry made it difficult to finish with just one bowl of rice. I ended up having to doggie bag the rest for another serving at home.\n\nPad See Yue -- Unimpressed. I have had way better pad see yue dishes in the past. My main qualm with the dish was the beef; the beef was way too overcooked. It was too tough and nearly flavorless. The noodles were also too cooked -- soft and almost soggy -- and too salty. A careless, messy contrast of a dish.\n\nAgain, wonderful atmosphere -- if I lived in the area, I would not mind coming here every week, if not to eat to just chill out. The food is my only qualm -- consistency is key and personally, I'd prefer not to play russian roulette with my food. With that said, Joya's still a winner in my books and I would not mind coming back.", "author": "Kenny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "I eat in and order delivery on the regular from here. You can never go wrong with the options! I even celebrated my bday here with a group of 8. It's a classy interior with friendly prices!", "author": "AR A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Met a friend here on a Tuesday evening around 7. The wait staff asked me to take a seat at the bar while I waited for my friend to arrive-be sure to have all persons of your party present to expect to sit down here. Once she arrived, it was easy to get a table. The food was incredible and reasonably priced. Definitely recommend this place as a top notch Thai spot in Cobble Hill. The only reason for not receiving 5 stars was I felt the waiter was not super attentive to us and we had to waive him down to get his attention, but this would not sway me from returning soon!", "author": "Kris I."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}