{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "If you like Thai food, you really can't get better than Joya. There is a reason why this place is always bumpin. The food is DELICIOUS (I always go for the pad thai, but I've heard great things about the spicy noodles and the curry dishes), the portions are huge, and the prices are low. The staff is very nice and service is generally pretty quick despite the popularity of this place. If you go at a peak time (dinner time, weekends, etc) you're almost guaranteed to have some kind of wait. But its worth it and you can grab some reasonably priced drinks at the bar while you wait. I have yet to sit in their outdoor garden area, but it looks pretty cool and I'll definitely be trying it out at some point. All in all, I say everyone should definitely try this place. Just make sure to stop at the ATM first though, because its cash only.", "author": "Natalia O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "Just went today with my girlfriend to this place. Nice restaurant, reasonably priced, and good size portions. Decor sucks and the place gets packed during evening hours. Not unusual to bump your head on someone's ass while you're eating and  they wait for a seat. My girl and I ordered the large fried calamari for 9.95 and it was big and tasty! We then had the spicy noodles and pad thai, both for 7.95 and we were stuffed after we finished. Our server was a real nice guy too.  Would definitely go back there.", "author": "Lars Lars P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "The best prices for Thai, well made drinks and good food. It's pretty popular and finding seating maybe a little tricky.", "author": "Shelly Ann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "Great thai!  They really should consider opening a location in Manhattan.  The spicy noodles are awesome, as is the pad thai, and thai beef.  The currys are a bit runny and light on the coconut flavour but overall still good.  \n\nThe atomosphere is eclectic and fun, but get ready to yell because it gets super loud in there!", "author": "Jen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "This is great for a cheap night out - solid Thai, and near lots of fun bars/movie theaters in Cobble Hill/Carroll Gardens.  Don't forget to bring cash (they don't take credit cards) and a little bit of patience (the wait is intense).", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "Amazing! Got vegetable spring rolls, spicy noodles with shrimp, and PAD thai with shrimp. 10/10. Delicious meal especially with their peanut sauce. They just need to accept credit and I'll be an even happier camper.", "author": "Obinna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "Awesome Thai food, and great prices!  The service is also great.  When it's nice outside, the courtyard in the back is a great environment for dining with friends.", "author": "Nathan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-17", "description": "I have been coming to Joya for years because their food is good and cheap. However, their service is horrible, particularly from the guy who takes your name for a table. He is obnoxious and rude and just not worth the hassle. There are a million Thai restaurants in NYC so I don't understand why he thinks he can talk to people as if he couldn't care less whether they eat there or not. The place is extremely loud, doesn't take reservations (so the wait is always at least 30 min) and doesn't accept credit cards. The ONLY good thing is the food. Otherwise, just not worth the inconvenience and certainly not worth the verbal abuse you receive.", "author": "Stella P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "So Good...So Cheap... I can fill up on an ap., entree, and drink for 20 bucks.  \n\nTry the green curry, and red curry.  Also they're seafood dishes are excellent.\n\nNoisy though, they have a dj.  I come home with a soar throut, but the meal all but makes up for it.", "author": "hannah h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-31", "description": "SO GOOOOOODDD!\n\nThis is a rare combination of inexpensive food, QUALITY, and most important, ambiance. \n\nThe interior is sexy, and you even have room to breathe.  The garden is beautiful in summer, spacious with cushions, and you feel like you're in someone's backyard.\n\nBEST THAI EXPERIENCE,", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "Quality thai food - not at all too salty but just right. Everything on the menu is super yummy you can't go wrong!\n\nThe Pad See Ew is amazing, and the Salads are fantastic. Honestly, this is the best thai place I've ever been to where the flavors are just right and not overpowering.", "author": "Helena F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "first restaurant i went to in nyc - brooklyn.\n\ni have a great memory from joya - maybe because the food was so good.\n\na lot of my friends in brooklyn recommended joya - they said the food was great and affordable.", "author": "Lily A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-24", "description": "Best place to order pad thai for less than $10.  Although you do have to call over and over and over to get someone, it's usually worth it.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-12", "description": "Awesome atmosphere and the best pad thai I've ever, ever had.  And I am one of those people that eats pad thai like 2 a month.  The noodles were cooked perfectly, not mushy at all, and they were generous with the onion, peanut and tofu.  The fried egg was a crispy, buttery surprise inside the noodles.  Service was patchy; we had to ask for a few things twice.  I hope to come back in the summer and sit outside!", "author": "Ava R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "Definitely a solid place to get good, inexpensive Thai food.  The only take cash and don't take reservations.  We showed up at 7:30pm on a Friday and only had to wait 5-10 minutes for a table.  Fried tofu was pretty good. Calamari was just OK.  Entrees were above average.  I had the shrimp spicy noodles which I would get again.  Almost nothing on the menu was more than $10 and in fact most was significantly below that.  For the price, it'll be tough to find a better place than this.  It's worth checking out.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "Great food, great prices, and good service. There is usually a wait and it gets packed but still a great place. Cash only!", "author": "Jinelle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "My first thai meal ever was here at Joya a couple weeks ago, and it was phenomenal, I've been craving it ever since. I ordered the fried calamari, spring rolls, gai kra prow and the spicy noodles. While everything was wonderful and cooked to perfection, the highlight of my night was the spicy noodles. I seriously could have had a giant plate of just those! I hope to find something just as good over here on the west coast.", "author": "Justin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "As a Thai aficionado, I'd def recommend  a pit stop to Brooklyn for their Pad Thai and green curry.. mouth watering! They also have neat specials and great prices.. but bring cash, no credit cards accepted.  The bar cocktails are pretty great.. and also be prepared to spend some time there as I've never waited under a half an hour for a seat for 2.  On warmer days they open their back patio which is intimate and cozy.. Oh.. and seating is very tight, so expect to have ppl listening in on your conversations!", "author": "Maria H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-18", "description": "I ordered a chicken and green bean dish with a garlic flavoring and what I got was a dish full of green beans with a few pieces of schredded chicken.  What a disappointment.  To make matters worse, when ready to pay I handed my debit card to the waiter who refused it saying \"cash only.\"  Why do they keep that a surprise and not post it on the window or menu for all to see?", "author": "Maria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-15", "description": "I love this place.  The food is great, cheap, and served in large portions.  The decor is clean and modern (no faux pan-Asian decorations), they often have a DJ spinning, and they also tend to serve pretty stiff drinks... oh, and those are pretty reasonably priced as well!\n\nThe only downside is that it's a tad noisy and in the summer it can get quite warm inside.  However, they also have a cool litlte outdoor seating area in the back.  All in all, this restaurant/bar is a winner.", "author": "Eugene S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}