{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "I am a frequent visitor @ Joya. I really enjoy this restaurant, it has great service and great food. Well actually you can take my opinion on great food with a grain of salt because. I love the chicken pad thai so I usually always get that. The only gripe I would have about joya would be its space. Its usually always crowded from Thursday through Sunday and has a very limited standing area which usually comes along with a 40+ minue wait. So if you're good with patience this shouldn't phase you as much as it does me. But once you are seated they seam to want make up for the inconveniance with great service. And once you start eating all of that goes out of the window. Enjoy", "author": "Alex S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-29", "description": "I think my friends in Brooklyn are getting tired of me visiting them because I always make them take me here.  Great Thai Food in a pretty cool setting.  Everything on the menu is suprisingly cheap.  They always have a  a great daily specials menu and the pad thai is out of this world.", "author": "Andre L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "When I first moved to the area, someone recommended Joya as one of the best cheap eats in town.  My husband and I went there recently mid-week for lunch... I was certainly not disappointed.  The spicy noodle dish with chicken is delicious and actually a bit spicy.  The mango salad was tasty and refreshing, but next time, I would ask for less dressing.  Definitely plan to go there again.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-22", "description": "Awesome atmosphere, awesome food, awesome prices.  Even though we had to wait 30 min on a monday night, it was worth it.  It lived up to the hype -- very impressed.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-05", "description": "Ugghh.... I don't get this place.  Went there for lunch last weekend so that I could eat outside.  Was NOT impressed.  The food we got was a little burnt and had been doused in too much garlic.  It also tasted like the oil hadn't been changed.  I don't get the high reviews of this place.", "author": "Kathy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "First thing to remember is that they accept cash only. After that, sit back and enjoy the food. I travel to NYC for business every other week and we have Joya on our weekly circuit of restaurants. It is great every time we go. I usually get the Drunken Noodles with chicken and it always leaves me fat and happy. Solid Thai food for sure.", "author": "Jammy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "Owned by the same people at Song, I expected good cheap food and that's exactly what I got.  Joya has a nicer atmosphere than Song but the food is just as good.  My friends and I shared bottles of Riesling and Pinot Blanc - and for bottles that were $22 and $23, they were great!  We started with the summer rolls (I've had better) and I had the Pad Thai with shrimp.  There were a lot of shrimp in the dish and they were fresh and nicely cooked.  The Pad Thai had a little too much garlic but overall it was really tasty and I love that they serve everything with lemon wedges - great touch.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "Food is tasty and decently portioned.  Prices are reasonable although the cash only thing is a hassle.  Expect it to be loud \u0026 crowded.  The only time it wasn't was when 2 friends and I went exactly at opening at 4pm.  Last thing I ordered was Massaman red  curry and it was delish.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "So very cheap and delicious. I judge all thai places by their masaman curry, my favorite dish. Often it's watery, bland, with undercooked potatoes. Sometimes restaurants throw in random vegetables that don't belong there... This one was a definite B+ with a zesty, peanutty flavor and well-cooked potatoes, skin on. Beer selection is small but passable, and the bartender was friendly. \n\nThe backyard seating is gorgeous on a hot summer night, cooled by some very tall trees. Watch out for the flowers falling in your curry.", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-06", "description": "Joya is one of my favorite Thai restaurants of all time.  I love the mussels and spicy noodles.  Although they may not use the highest quality ingredients, the dishes are full of flavor and extremely affordable.  Expect to wait for a table but the lively atmosphere and people watching will make the wait go by fast.  I wish we had a Joya on the West Coast.", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "My friend and ate here on a Sunday evening early, around 5pm. The place was already packed so we hovered around the bar until some bar stools were free and ended up eating at the bar. The food portions are enormous, I was expecting a meal 1/3 the size of the portion that I was served, and it is pretty cheap (especially if you take home leftovers and can get a second meal out of it). I had a tofu veggie dish in a light ginger sauce with rice. Delicious. The only negatives were the lack of available tables and it was kind of noisy.", "author": "Leanne L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-11", "description": "Reasonable. Ghang Thai seems the better joice by far.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "The Spicy Noodles with chicken are great.  Warning, however: familiar with chow fun?  That's what they are!  Huge portions.  A great house Zinfandel.  A bit of a wait for a table - no credit cards accepted.  Mood lighting (tough for us who are over 20).  I liked what I ate and will return.  Cheap cheap cheap!", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-21", "description": "This place is HANDS DOWN my favorite thai place in brooklyn! I get the same plate every time I come here or order take out and of course that plate is pad thai! They give you a very large portion and so I always end up making my food last for 2 meals. They deliver fast too! But it might have something to do with me living 6 blocks away, but still very fast. Also the prices are AWESOME!", "author": "Smalls D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Joya is at the top list of Thai restaurants in Bklyn!!...I love their big portions, ambience which is very hip \u0026 trendy, and their pricing is very cheap and affordable...Joya is a great spot to go with your friends, and during the summer love to sit outside and have martini's...:)", "author": "Dominique P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-17", "description": "A friend of mine who lives in Chelsea/Manhattan told me that this spot is the best Thai in NYC, so I had to taste it.  We were seated quickly, had great service, and the appetizer, curry, and pad Thai were all excellent.  The truly amazing thing about this place is that they deliver such high quality food with nice ambiance for low prices.  I think my curry was $7.99 for a large portion size.  Even the beer was cheap!  A full bar and outdoor patio seating make this one a true gem...not to be missed.", "author": "MarkAndMiranda C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-28", "description": "Joya - your food is good and reasonably priced. Now PLEASE, do something about your beer selection.", "author": "Sean T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-26", "description": "Here's a little hint...... answer your phones!  I've eaten your food a few times and its okay, but your place isn't that cool or your food that good that you can't staff someone to answer the phones and take pickup orders.  It's a problem.", "author": "b a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "You couldn't tell from looking at it, but this place offers great Thai food at really good prices.  Service was prompt.  \n\nIt's easy to miss because there's no sign out front.  You can tell by the line of people outside or the blue lights.\n\nIt can get really crowded.", "author": "J J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-01", "description": "cool looking/feeling place: industrial gray, DJ spinning, open kitchen. \n\nlunch on this pleasant March Saturday was not how I remembered Joya- maybe it changed, more likely my taste buds. The pad thai tasted 'burnt', was wet and sloppy, with too much fish sauce. Really disappointing, even for $7\n\nThe basic garlic/chili vegetables were uninspired and served with a side lemon wedge. I don't think I saw any limes on any tables actually.\n\nSince all of the meat dishes seemed to come with eggplant which is a favorite vegetable of mine, I asked them to do a side of eggplant however they wanted to. Did they soak the eggplant in water first? So spongy, I couldn't bother with more than 3 bites.\n\nI really don't know how you can screw up thai food- usually it just gets more creative with every new place in the city that you find. Joya must be preying on the convenience factor to locals of lower Smith St. \n\nIt's a walk from Joya, but try FAAN instead (on Smith, 2 blocks from Atlantic Ave.). You'll never go back, and they have great sushi to boot, not to mention take-out containers that won't leak all over your bag.", "author": "Mark S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}