{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "I am there so many times I am like Mr. Papagiorgio from National Lampoons Vegas Vacation.  They know exactly what I want which is the Chicken Drunken Noodle.  Their Chicken Drunken Noodle and their Pad Thai is the best I have ever had.  Also a friendly staff and prices you would expect for that area.  I can't comment much on eating in as I usually take out.  I am sure you will not be disapointed.", "author": "Peter V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "My fiance and I came in for lunch during a brief NY vacation and it hit the spot. Large menu includes all the usual Thai fare and it doesn't disappoint, with fresh veggies and not too much grease. Plenty of vegetarian options. There's a small, protected outdoor patio in the back, perfect for a spring or summer day. Nothing extraordinary but if you're in the mood for quality Thai it's worth the trip.", "author": "Kyle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Love this place! This is my go-to spot! If it's not this place it's Ghang! Been here quite a few times and sat at the bar and enjoyed my food peacefully. Try it!", "author": "Nancy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-03", "description": "Super friendly and fast! The food is great too! I had the spicy noodles with shrimp, and it was awesome! Huge portion for only $8?! Good in my book!", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-02", "description": "Got take out pad Thai, spicy noodles and spring rolls. None were terrible, but also not that good. Spicy noodles weren't very spicy and veggie spring rolls only consisted of glass noodles. Probably won't go back since there are so many better options in the area.", "author": "Alyssa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-06", "description": "I had dinner there this evening for my son's birthday . The food was ok no complaints there however, the waitress was horrible. She actually made us feel like we were annoying her. Never came to the table to ensure we were ok, it was an extreme inconvenience when we asked about the desserts. The nerve of her to expect a tip based on a party of five. I imagine she felt the tip was built in and had no intention of being even remotely hospitable. I paid the bill MINUS her $27.00 tip and I tend to be an over tipper. I will rethink my next visit there.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "I'm surprised I haven't written a review for this place yet!\n\nLOVE the pad see u noodles (i know it's spelled wrong...) with chicken.\nCool atmosphere - reminds me of a place called Song on 5th Ave. The place is small and the crowds/bar is loud so it's not the best place for conversation, but it's a fun dinner out and CHEAP! \n\nyay for Joya :)", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "OK, Ive been to this place on both hands more then i can count! i love the beef, shrimp,chicken pad thai with peanut sauce (extra please!!!) lol Great place and great atmosphere. totally a good place to have a first date or a group setting. as the other reviews say it is sometimes of a wait cause this place can be packed from 7pm till close. for me its worth the wait, i eat here about every two months on a norm with friends, and if im feeling thai we go about 3 times in 2 months and we go all out! \ni totally recommend this place for great thai and a cool place to eat were the atmosphere is pumping from the bar to the outdoor seating, cobble hill has a cool gem on its hands.", "author": "Jesse I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "Fantastic food and service.  I had the spicy noodles and pork and pineapple fried rice (I had planned for leftovers).  Both dishes were great and I will go out of my way to eat again.  Would share a picture, but the lights were down.", "author": "Marty S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-20", "description": "Let me tell you something. Four star is a joke... First off, the host has a major attitude.. for tourist not having power on his phone, he wouldn't allow me to charge it in the restaurant, when there is literally an avaliale plug behind him. Secondly, the fried rice was soooooooo salty, you can taste the ocean in there, not the freshness from the seafood, but the salty level as the ocean water, whoever orders it, make sure to see a doctor for angiosclerosis. So was the half-chicken special, the special stands for specially salty.. Anyway the four star review was overrated. Any of you ever come here, it's not some fxxking authentic Thai food, it's some salty greasy cheap take-out places in a fancy plate.. Don't let this restaurant ruin your night like it did to me.", "author": "Leroy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Always love coming here. The drinks and food are amazing. Unfortunately tonight we got stuck with a very rude and inattentive waitress. This was brought to the manager's attention and he took care of the entire situation. Waitress never came by to see if we needed more drinks; nor did she give the correct amount of boxes for the food. When we asked her to bring another she brought along the check. We called her back to let her know we were getting dessert, and while picking up the check she rolled her eyes and gave me a world of attitude. This waitress ruined what usually is an amazing experience. Hopefully no one else will have to encounter this. But thanks to the manager Glen for handling this situation. Her rude behavior doesn't reflect the manager, although he felt entirely responsible. I'll be waiting a while before returning to this location.", "author": "Charlie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "Absolutely wonderful.  Great food, service is fast, good pricing.  Mango salad and the calamari are a most have. \n\nThe only thing I would change is the cash only policy.", "author": "Eliana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "Joya has been one of the best most affordable restaurants of the last decade. This spot always delivers great food at an extremely reasonable price. \n\nVegetable springs rolls with tangy sauce are awesome.  As well as fried calamari, chicken satay etc\n\nI'm a huge fan for chicken padthai and there curry chicken.", "author": "Margo S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-05", "description": "Just sad...\n\nWhat the heck happened to this place? We were in the nabe on a Wednesday night and I remember this place was jumping years ago...alas it is time to give it up, Joya. The Pad See Ew looked like slop and my husband got indigestion. The host is a rude SOB and the only thing missing from his shtick was a velvet rope. We wanted to kick ourselves for not turning around and leaving. We stood there at the front of the restaurant and waited 5 minutes for him to finish his conversation with someone who ordered takeout. \n\nI heard that the owner's other spot is in Park Slope; I don't even want to bother. There are so many better Thai restaurants for me to discover.", "author": "Agatha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Food is great. I usually get the spicy noodles. It's awesome, everything is always cooked to perfection. Everything is priced well, the only problem is they don't take credit cards so remember to take cash!! Great food and atmosphere. You can't ask for anything better!", "author": "Kimberly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Updating from 4 years ago as they still have awesome food and now accept credit cards! I go to Joya more than any other restaurant in NYC because the food is delicious and CHEAP. My go to is woon sen with chicken and shrimp.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "The wait can get a bit ridiculous. But if you're patient and pull through, you'll get seated within half an hour. This place is very loud. The waiters don't come by very often to check on you, so when they do come, make sure you tell them everything you want. Extra napkins included. \n\nThe prices are very reasonable, and the portions are huge.\nI come here about once a month, so they must be doing something right.\n\nTofu Pad See Yu is the way I go :)", "author": "Jaslyn G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-11", "description": "It was good food and we even got in without waiting. Note to groups - they don't split checks. Then we had a rude waitress so that ruined the end of a good meal. I won't go back because I've experienced it once and the food wasn't so amazing that it would be worth going back. Also we tried the spring rolls and they aren't closed like regular spring rolls at the ends. It was literally just rolled. It was like a taco or something where everything can fall out. Another friend tried the fried tofu and no one liked it. She was thinking they'd be fried wontons but she said they were not solid enough. Don't know if it was the texture or what but they didn't go over well at all.", "author": "Sonya C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "I won't go into too much detail because there have been so many rave reviews about this spot. To make it plain, it's VERY GOOD! If you're a fan of Thai food, you'll love the authentic food at Joya. Portions are huge and food quality is superb. Beautiful outdoor garden to dine on a nice evening. Drop by if you're visiting the Brooklyn area. We'll definitely be back for a visit.\n\nCON: Cash ONLY", "author": "Rhonda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "Good food nice atmosphere even though it was busy it didn't take long for us to get in! Only problem is i ordered one thing an before the waiter i changed it an made sure he knew what i ordered but he still brought the wrong thing, but it was still very good!!", "author": "Mike D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}