{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-24", "description": "I love this place, my friend introduced me to Joya recently. It is my favorite restaurant. I love their vegetable spring rolls, mango joya salad and the pad see yu (not sure if I got the name right but its the flat noodles ha sorry). Thai tea is also awesome!\n\nI was once putting my name on the waiting list on a busy friday night when I saw a fight break out right in front of me. Somebody got sliced in the chin with some glass. But this has nothing to do with the workers or Joya, it was just the uncivilized hungry hungry hippos that couldn't wait to be seated.", "author": "Selin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Love it! Went back after a decade and it was just as good! Try it at lunch time, great specials and zero wait. Will be back!", "author": "Olive M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-08", "description": "I'm sorry that I have to rate this place a single star, but I am so disappointed. I won't go back to try anything else, as my first experience was so very sad. I ordered Pak Pad Thai, which is veggies, tofu, egg, peanut sauce, and noodles. I've had this in several places before and it has been very good. This was absolutely awful. I couldn't get past a few bites. It smelled like something my cat eats. Or worse. The atmosphere was so nice, but the food says it all. The waiter was nice enough to cancel the price of my order on the bill.", "author": "Christine A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Best thai food i ever had . Always fresh and made to order . I highly recommend the calamari and pad thai", "author": "Gene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-01", "description": "AWESOME.\n\nWalked into the place on a Wednesday night and the place was packed!  It was recommended by many people at work so I had to give it a try-so happy I did.\n\nI'll sum up my review quickly:\n\nApp: summer roll-subpar compared to any other's I've had\n\nSoup: Tom Yum Koong was unreal.  Great portion-bold flavor, decent shrimp portion.  One of the best soups I've ever had.\n\nEntrees: Gai Kratiam sauteed sliced chicken with broccoli cabbage, carrots and onions in a fresh garlic sauce-awesome!  Huge portion, dish was so fresh, clean, flavorful and well put together.  \n\nSpicy Noodles sauteed fresh flat noodles with chicken or shrimp mixed vegetables and egg in a with basil sauce.  I didn't order this-I'm not big into Thai noodle dishes, but got a great review.\n\nService was excellent-although I wish they indicated somewhere they do not take credit cards.  I have to walk 8 blocks to an ATM.\n\nPrices-unheard of.  Not sure how they do it.  These prices are lower than what you would pay in a middle class suburb.  $7.50 for an entrée?  Everything I reviewed came to $27.75 with tax-I would normally pay no less than $45 for what we ordered.\n\nGreat atmosphere and would make a great first date place (and cheap date as well ;) )\n\nThey lose a star for not accepting credit cards (and not paying 3% credit card fee and maybe Uncle Sam)", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Me and my husband love going to Joya. This is by far our favorite Thai restaurant in Brooklyn. The steak and spicy noodles (special) is a great dish.  Although the food has slightly decreased in quality over the years, we still love the restaurant.  Prices are great but cash only.", "author": "Mariia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-27", "description": "I left unfulfilled. I had an overcooked grilled salmon with coconut curry and flat noodles. The curry was very coconutty but not enough spices. The curry puffs are good. Those were good. I wouldn't go back. It didn't feel Thai enough. CASH ONLY.", "author": "Chelle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "delicious food for a great price!  A friend and I got pad thai and green curry with eggplant.  Both were delicious and the bill was only 16 and change!\n\nplus they have a really cute back garden seating area =)\n\ndefinitely going back", "author": "Christina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Delicious, cheap, and good quality Thai food. When I dined here, the Pad See Ew was simple and delicious, the calamari extremely fresh. My only complaint was that the calamari seemed a little soggy with oil, and although it was accompanied by a dipping sauce, it desperately needed some salt. \n\nThankfully, the food issues out extremely quickly, resulting in the restaurant's high turnover of tables. So if you want to eat at Joya, but are daunted by the wait, don't let any long lines spook you! That line that you peeped sneaking out the door is actually manageable, because Joya is very efficient in getting its customers seated within a reasonable time frame.", "author": "Nana Ama S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Went here 2 nights ago, very cool environment. The playlist was on point! I was singing \u0026 in a good mood the whole time. This was my first time \u0026 I tried the Woon Sen fried rice. It was very good. It filled me up pretty quick. The place was a little small \u0026 they didn't accept cc, but other than that I could definitely come again.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "Met a girlfriend here for a Friday dinner and had an overall positive experience. The food was good and not very expensive. We shared a tofu green curry (had a nice subtle kick at the end) and tofu pad thai. It was pretty crowded (waited 30 minutes for a table for 2 around 7pm) with a higher noise level but not over the top that I was bothered. I'll most likely make my way back here for round two!", "author": "Irene J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "I come here few times a month and I have tried pretty much everything on the menu...everything is so good! My fav are pad Thai, spring roll, curry puff , mussels and of course Thai iced tea! Yummmm def worth the travel to come here.", "author": "Lucy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "My boyfriend \u0026 I finally tried this place last night-- it's long been on our \"list\"-- \u0026 we both had a great experience. \n\nFirst of all, it's CHEAP!  Most of the entrees are like $8 or $9.  And the portions are BIG!  (Just look at all the people walking out with doggie bags. Go ahead!  LOOK!!)  The food was great too.  I got the pineapple pork fried rice.  The portion was enormous \u0026 it was very tasty.  It was a tad on the oily side, but I was still happy with it.  My boyfriend ordered the Kang Gai curry \u0026 he absolutely loved it.  He ate every last drop of that stuff!  He was ENAMORED with it!  I was getting jealous!!\n\nWe ordered the chicken curry puffs (a special, apparently) as an appetizer \u0026 the bill still only came to like, $22... TOTAL.  Of course we opted against having drinks that night, but that wouldn't have done much damage.  \n\nWhat's also nice about this place is that it's sleek \u0026 clean, with a modern decor.  The bar area is very hip (I hate that word) \u0026 seems to pack in a nice crowd at night.  The kitchen is exposed, which is cool.  And it looks like they have DJs spinning regularly, though not the night we were there, which is probably a good thing, as other reviewers say it tends to get a bit loud.  \n\nBut we had a very nice first experience at Joya.  We will definitely be back next time we want to go out for a quick meal without spending a fortune (which is often!).\n\nUPDATE: A few months after writing this review, my bf \u0026 I continue to come here A LOT.  And we're always happy with the food, prices, etc.  But here's one word of warning: do not ever call in order to pick up!!!  In fact, don't ever call them, period.  They are like, seriously incompetent when it comes to answering/working their phone.", "author": "Matt P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-11", "description": "I freaking love Joya. It's the first place I think about when I am hungry in and around Carroll Gardens/Cobble Hill. The food is consistently very good, the atmosphere is generally pretty relaxed, even on busy nights, and the staff is always friendly and helpful. If you don't care for the trendy-looking front area of the restaurant, there's always the patio out back, which reminds me of the backyards of friends' homes back in the Midwest. It's trendy and homey at the same time.\n\nDid I mention that it's cheap as hell? Yeah, that helps. Most entrees hover around $8.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-23", "description": "Oh dear. The first time I went to Joya, three days ago, it was terrific in every respect (service, ingredients, cooking, etc.). Today I went back, wanting to repeat the experience, but it was very different. Today's waiter seemed indifferent, very distracted, even though there was only one other occupied table (at 3 pm). I ordered the same dish of woo sen noodles with scallops, but today the scallops were small and inedibly rubbery, overcooked, consistency like erasers. The waiter never checked back to see how it was, so I had to go find him to report the scallop situation. When I did, he offered to swap it out for shrimp, which I accepted. That order came out much better than the rubbery scallop version, but not the standout of the previous visit, and on this second visit the veggies were almost raw, as though they'd been thrown in at the very end. No matter, I ate it anyway, but without the delight of the first time. No water refills this time, and generally no magic.", "author": "Dandelion F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "An all-around great place!  For starters, can't beat the prices. Affordable with excellent food, service, a great atmosphere, and convenient location. What else could you ask for? The place has become really popular over the years, so expect a wait during prime dining hours, but there's a bar (the bartenders make great specialty drinks) where you can hang out until your table is ready. There's also an outdoor seating area open all year round. The only reason I didn't give it a higher rating is because the menu is not unique - you won't find any specialty dishes or anything that would necessarily wow you. Just expect good food, good service, for a very good price.", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-02", "description": "I came here for a quick lunch on a sunday afternoon. Ordered the vegetarian pad thai and asked for No eggs.\nThe first time I was served chicken pad thai. Which i returned. The 2nd time I was served pad thai that was so sweet and syrupy, I couldnt make it past 4 bites even with spoonfuls of hot sauce. The only saving grace was that they did not charge me for it. Not coming back here.", "author": "Suruchi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "Oh Joya, you steal my heart.\n\nI look for reasons to go to Brooklyn to eat here. The food is amazing and affordable! Cash only.\n\nI'm a fan of the spicy noodles and the green coconut curry sauce - it's got a bit of a kick.", "author": "G R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-24", "description": "I've been coming to Joya for years! It's where we go for good and cheap Thai food whenever we are in the mood. I always order the same 3 dishes - Spicy seafood fried rice, Massaman curry and Shrimp Pad Thai. I've tried other items on their menu before when I went with big groups, but I still think those 3 items are the best.\n\nTheir wait time used to be horrendous years ago but it's not as bad anymore, probably because there are now more food choices in Brooklyn. It's best to go when the weather is warm and nice out so you can be seated in the garden area.", "author": "Pamela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "You'd expect this restaurant to be more expensive because of the location and the large amount of food, but it's exactly opposite. Had an appetizer and meal with a glass of wine with my boyfriend and it came to under $30 bucks. Getting a table is a bit of a wait on weekend nights, but I'd say it is worth the wait. The staff is also great and attentive. \n    **Cash only!", "author": "Diana A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}