{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "Food was solid but not memorable. Atmosphere was maybe too open for date night - think TGIF.", "author": "Jahbless U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-13", "description": "So 3 of us go to Joya and we had a really long (45 min) wait to get a table but the manager bought us a round of drinks and that made up for the wait! \nThe food was awesome!! The ckn pad thai was very tasty and the beef pad see wee was also really flavorful! \nThe apps (calamari and spring rolls)  were awesome and the prices are super cheap! \nGreat ambiance with really chill music and hip crowd. \nA great experience after all! We will be back!\nP.S. Its CASH ONLY!!", "author": "Deanna D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-29", "description": "Last time here, I was ill the entire next day.  I think there might be a reason why the food is so cheap ( read: low quality.)  Or maybe I was just unlucky, who knows.\n\nDefinitely not worth the infinitely long (45 minute-hour) wait on a weekday.\n\nBut thai food always tastes and looks better when you feel like you're eating in a dance club, right?", "author": "anni b."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-25", "description": "I can see a lot of the reveiws of this place are high but I just was not impressed. I have had much better Thai in NYC. Frankly I found the food and decor boring and Thai is anything  but boring so I am not sure what is going on there. The service was lousy to boot, at a table of 5 they brought 3 entrees out and the next two at least 10 min later, what's that? my food was cold before I could started eating. \n\nSummery out of 5\nFood: 2\nDecor: 3\nService: 2\n$ Dirt Cheap to $$$$$ Ridiculously Pricey\nPrice: $$", "author": "Amy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-28", "description": "Having read some awesome reviews on yelp for this place, I figured I'd give it a shot for delivery.  Unfortunately when my food arrived, I was presented with a bill that was 25% higher than the prices on Yelp.  When I called to let them know they charged me too much, all I received was grief and a defense that I HAVE to pay the price they charged me.  After about 15 minutes of trying to simply explain that there prices are wrong, only being able to speak to incompetent people with a very poor command of English, and no manager or owner to speak to, I was finally asked to send the food back, so I did.  Are they serious?  For a $5 difference, they would rather lose the order and a customer.  Do these people care about their reputation?  There are great places to eat in Carroll Gardens that actually care about their customers and reputation.  So sorry Joya has a crappy, incompetent, staff. \n\nIf what you are looking for is crap service, this is it.  I wish I would have had the opportunity to eat and review their food.  Maybe they would have received a much better review.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-08", "description": "Delicious food, but a bit crowded. but pretty much all of brooklyn is like that so, eh?", "author": "Jose V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-02", "description": "I like this place a lot, but I can't help but notice that they are slipping a bit in their takeout department. The last time I ordered from here, I noticed that their takeout wasn't as fresh as it normally is--the meat in my massaman curry was very tough, and the chicken in my spicy noodles smelled a little off. Maybe it was an off-night. \n\nIn terms of on-site dining, the price is definitely right--where else can you get a 3 course meal AND drinks all for under 25 dollars a person? Also their outdoor patio is adorable, and their atmosphere is great for both group dining and date nights.", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-20", "description": "Fabulous Thai food in great digs down in Cobble Hill.  It has the hip trendy dimly-lit vibe with no attitude.  The massaman chicken curry will rock your socks.  The spicy flat noodles are very good too.  Oh yes, and can you believe, the cooks in the kitchen are Thai, too?\n\nAll that, plus it's soooo cheap.  Every entree is $6-$7 each.  We ordered an entree, appetizers and a bottle of wine for under $20 a person.  What are you waiting for?!?!  It can be a bit crowded, but rightly so...", "author": "Stevey P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "Pros:\n---The pad thai is good\n---The pad thai is cheap (SEVEN dollars for a dinner?)\n---Nice decor\n---Good service\n---The atmosphere is fun, loud, kinda like a bar\n\nCons:\n---The atmosphere is fun, loud, kinda like a bar.  I wouldn't bring my grandmother here, but it'd be good for a big group of friends.\n---There can be a wait \n---If you try to order delivery, prepare to get a busy signal.  If you actually get through, their delivery is very prompt.\n\nI like this place quite a lot, all in all.  Sadly, so does everyone else.  :P", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Walked in somewhat late on a Friday night. This place has the decor of an upscale lounge. You could just go for drinks and sit at the bar. There is also plenty of seating and a really cute outdoor patio. We opted for the patio and were seated right away. Service was really fast and food came out really fast too. Food was good and then we had our check. The entire experience probably took 40 min- maybe too fast? We were fine with it because we were looking forward to heading home to bed. No real complaints. Would definitely go back.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "The one thing I loved about this place was how affordable and cheap the prices were for the amount of food they give you, however one thing that I didn't like about the dish was how oily it was. I didn't enjoy the paste because it was drained in only and just had the shrimp.", "author": "Hope B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "Agreed, 5 stars for the personality, the scene, and the 10 years of never raising prices. They always have fantastic specials, warm and fun staff, good-enough wine, great location, and the food is fantastic for the price point. It's the same price and (extensive) base menu as when I moved here 11 years ago, but I still enjoy it thoroughly with my friends and it never feels lame or sad like so many of the horrible places in the cobble hill/ Carroll gardens area. I have no complaints, great Thai food at great prices, if you are looking for a Balthazar or a Daniel, you shouldn't be reading this in the first place...", "author": "Brad D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-12", "description": "So my good friend from high school has been telling me about Joya forever.  Anytime me or one of our other friends would mention Thai food, it was always Joya this and Joya that.  Considering how inexpensive she said the food was, I had very low expectations of the food, place, etc.  \n\nBoy, was I wrong!  We went on a Friday night, and had to wait for about 20 minutes or so, not bad at all.  The atmosphere was far better than I had expected, and, while I found it slightly odd that they had a DJ that early and in a restaurant, it wasn't necessarily a bad thing.  The wings were out of this world!  The noodle dishes were all about 7 bucks, and GIANT portions.  Our total bill for 5 people, with tip, appetizers, 5 main courses, and a few rounds of drinks came to $85..$17 each.  \n\nBest deal in NYC I have had in a loooong time.", "author": "Fit F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-30", "description": "I think if I ever have to choose my last meal it would have to come from Joya. Simply the best. There are other reviews saying that the place is getting worse, that it is not the same... still. I vote for Joya. Two thumbs and two big toes up! Oops I think I strained my back. \nWarning! Friday is a bad day. Wait is too long, very crowded (popular)", "author": "Yasha M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-25", "description": "On my way back from the Westminster Dog Show, I thought it would be nice to fill my tummy with some Thai Food.  Off to Joya in Brooklyn which came highly recommended.\n\nThis place is very 'Grown and Sexy' with their exposed brick wall, dj booth and recessed lighting.  I felt bad that I left my turtleneck at home - I would've fit right in.\n\nAnyway, for food I ordered the chicken wings and the sliced pork in chili sauce. The wings had a nice tangy sauce and the chicken was ok but not too memorable.  The sliced pork was very dry, and had absolutely no spice.  My Baby Mama ordered the spicy noodles which were not spicy but very salty.  Maybe it said salty noodles and she mis read the menu...The best part of the meal was the Blue Moon Beer on tap.  It came with a tiny orange slice.  Deeeelicious.\n\nI don't think I'll be back.", "author": "RJ S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-27", "description": "Joya has been heading downhill, an opinion friends seem to share. My pad woon sen arrived promptly, but it was lacking in vegetables, sauce, and freshness. Service was good, but the dish was clearly made hastily. Let the cooks do their thing. I'd rather pay an extra dollar or two if that's what it takes.", "author": "Roger A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "I just simply love love love this place. I always order the same thing but just because is soooo good I dont want to try anything else; their pad thai, fried rice, papaya salad and fried calamari are just to die for, I get hungry just thinking about this place! so worth the trip to Brooklyn, yummy yummy yummy. I've must've been to this place more than 15 times since I found out about it. This place is CASH only and gets super packed on the weekends. I always get there early so I dont have to wait... If it is passed 8PM I won't even bother going because smelling all that delicious food while waiting for an hour to get a table would just drive me insane.", "author": "Paula E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-04", "description": "The selections were great at one point.. Not sure what happened. I think it instantly became a lounge once people realized they had a full bar \u0026 loud music. The wait is always overwhelming +  long. I typically order take out which is really quick \u0026 well organized despite the restaurant's crowd. \n\nI always go with a special- there are better thai places in bk.. ie. manee thai..but this may be one with the better ambiance + decor. Trendy rating - A+", "author": "Jul B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-16", "description": "Love this place. The Pad Thai, Panang Curry, and Ginger Chicken all standouts. Delivery is always fast and correct, a huge plus when you're starving after work.\n\nPlus, if you decide to dine in, the decor is great and the service is efficient.", "author": "Alia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-20", "description": "YAY!  MORE THAI!\n\nI thought Hyde Park had its problems with too much Thai Joints, but, well, they don't call Chicago the Second City for nothing, we again and again surmise.\n\nBut, hey, this place is one of the better ones out there.  I can't even place it in my mind, in terms of its geographical location in the physical world, but it's definitely the best I've had in the BK.*\n\nIf it weren't so popular that you didn't have to wait to be seated, and not in Cobble but Clinton Hill, I would give it a 4-Star.\n\n* I may add to this eventually, but Thai Restaurants I've tried in the BK are all on the same f'ing block (Myrtle).  Yes, Hyde Park and Clinton Hill share a secret bond that can only be interpersonally related to via the movie, Twin Falls Idaho.**\n\n** Rent it on VHS to simulate the atmosphere of the 90's.", "author": "Arthur O."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}