{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-10", "description": "Good. Fast. Nothing super impressive but a good standby. Curries are good - ESP the green one. Garlic sauce is light and not too thick - also a plus. Veggies are pretty fresh but the beef could have been better. Def try the chicken curry dumplings for an appetizer - those were awesome.", "author": "Robyn P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "Zzzzzz. That's not the sound of me falling asleep, but rather the sound of the mosquito plague that awaited me in the outside seating area. Granted, it was early evening and my blood must have been particularly aromatic...\n\nMy friend and I ordered the spicy noodles with shrimp (knew it would be just as good as Song's!) and some other special dish, bland noodles with mussels and shrimp in a watery sauce, a dish definitely worth forgetting.\n\nThe bottle of pinot grigio redeemed the lackluster dish and after the mosquito plague passed, the night ended on a high. Or maybe I'm thinking about the dessert we had at Sweet Melissa's, which I'm off to review now...", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-30", "description": "Nothing needs to be said.  The food is good, but the service is just ok.", "author": "Erving P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "food are great and big portion for dinner! only thing that pissed me off is they said $3 for a glass of WARM water!!! WT....first time to hear that service charge.", "author": "Innashirly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-17", "description": "I've been going to Joya for the last 5 years. Awesome food and cheap prices. Depending on when you go there can be a very long wait, but if you go there around 5-6pm there usually isn't a wait. \n\nThey have great spring rolls (my fav is the vegetable spring rolls). In my opinion the best thing on the menu is - Chicken and Squid with Chili Basil sauce. The spicy noodles are phenomenal as well. Honestly, everything is good. \n\nFor dessert you must order the mango with sticky rice!", "author": "Christina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-24", "description": "I've been eating at Joya once a week(min) for almost a year now. Out of all of the Thai restaurants in New York (including sea, spice, \u0026 land Thai) this is my favorite place for Thai. All of the other restaurants have been hit or miss but Joya has always been extremely consistent. \n\nI love their Pad see ew \u0026 my boyfriend loves the pad Thai. For an appetizer I used to get their calamari. It's great but its way too much \u0026 I hate wasting food. A small order can easily feed a group of 4. We now get the tiger shrimp rolls \u0026 Thai spare ribs. Which is great. I've never had any problem with service \u0026 since their service is normally so attentive I sometimes even tip the water/ bus boy also. \n\nThe restaurant is very nice for dates but I wouldn't recommend it for large groups or children. There isn't much leg/ standing room. I recommend going during the beginning of the week when it's not as crowded. During the end of the week you'll normally experience an hour wait \u0026 you'll feel as if you're standing in a packed night club (but it's worth it). I LOVE JOYA! Bill is normally around $30!!! (including to appetizers and 2 entrees!)", "author": "Tash C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-20", "description": "Really don't understand why this place generates so much traffic. Cheap, standard, greasy, more than likely MSG ridden Thai food. And the wait is just unbearable...", "author": "Julie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "Sometimes, just sometimes I get in the mood for Thai food. In Williamsburg, there are a few places to turn to fix this craving, but nothing that delivers every single time. Luckily, if I drive a little down 278, Joya will fulfill my craving now.\n\n\"NOW THAT'S A LOW PRICE!\" I wanted to scream this when the bill came after my meal stuffed my stomach. I have spent more at diners in NJ at 3am than I did for this large portioned meal at Joya. $28 was spent on one appetizer, one bowl of soup, and two entrees. This is where it's at.\n\nEveryone seems to know about Joya. It was busy on a Saturday night with at least a 30 minute wait. I knew this coming in and luckily, Joya has a great bar with decent prices to help you through the wait. A tall Jameson\u0026Ginger was filled 3/4 with liquor for $8. That's really nice. I had one and felt really great when I sat down for dinner. My girlfriends glass of Rosé ($7) was also filled much more than at other restaurants. Like I said before, NOW THAT'S A LOW PRICE.\n\nJoya moves people in and out at a quick rate. Once a table is done, someone comes over, wipes everything up, and new people are sitting there within 30 seconds. I'm not kidding about the 30 seconds either. They're fast. The food comes pretty quick too, so don't expect to sit for a nice long dinner. Joya is trying to get as many people to eat that night as possible. Joya is also very loud, but somehow with all the people talking and people in the kitchen banging, I could still hear my girlfriend perfectly. \n\nThai Spare Ribs ($5.50): Not bad, not great. It was worth the try, but I wouldn't order them again.\nTom Yum Koong ($3.50): Spicy, but very tasty. It would be great on a winter day.\nShrimp Pad Thai ($6.95): It was really, really good. It is a basic and didn't disappoint.\nSpicy Noodles ($7.50): Had a kick, but my girlfriend thought the kick needed to be harder. Very tasty otherwise.\n\nI'm probably not going to mess around with any of those old Thai restaurants around Williamsburg anymore. Instead, a 10 minute drive to Cobble Hill will be perfect with the cheap, delicious eats and large drinks. Great spot, despite the CASH ONLY sticker.", "author": "Frank F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-31", "description": "Great! There were 5 of us... we all got entrees, plus four appetizers to share, plus drank at least 2 beers each... and our bill was just barely over $100! What? Amazing. \n\nOur server was nice, the food came out super fast, and it was delicious. The portion sizes are so generous... we could hardly finish everything (but we did, don't worry).", "author": "Raven F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-22", "description": "Took my teenage nieces for the first time, they enjoyed the food but had to take home most of the food. I come here a lot and I gotta say although most of the time the food is very good , once in a while off of the daily special menu the food can be kinda ehh", "author": "Tommy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Super reasonably prices, generous portions, nice atmosphere. Really dig this place. Don't go changing.", "author": "Craig C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-27", "description": "My wife vomited three or four times on the 2 train on the way home after we ate here.\n\nShe has Celiac disease. So it was our fault for hoping that Joya could be gluten free--we knew we were taking a risk, just for eating at a place with a mixed kitchen (and everything is super cheap, so maybe we were deluding ourselves). But our server assured us repeatedly that the curry would be fine. \n\nThe food was mediocre at best--the salad had a strange chemical flavor. We realized something was seriously wrong, though, when my wife found several Pad See Ew noodles at the bottom of her bowl of curry. Twenty minutes later she was acutely sick.\n\nWe ate here several years ago, and the garden was lovely. Now it has a pile of chairs and trash in the corner and overall the ambience is dilapidated and dank.\n\nBottom line: the food is poor to adequate, but absolutely do not risk eating at Joya if you are looking for a nice garden or if you have any food allergies.", "author": "Ben B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "My wife and I have been coming to Joya for many years now. It's our favorite spot for Thai food. The place has a wonderful vibe. Service is always friendly and quick. The food is always excellent. For appetizers, I would recommend the fried calamari, spicy squid salad, papaya salad, and fried tiger shrimp rolls. Among entrees, their pad thai and pineapple fried rice are among the best we've had anywhere. The pad see ew and all their curry dishes are also fresh and delicious. Portions are very generous so bring an appetite!", "author": "Haim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "Full on props from this gangsta of cheap, high quality eats. Fly. Word.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "I ordered the large calamari and it tasted like rubber. I also custom ordered shrimp with string beans in red paste sauce. The sauce was watery and you can count the amount of shrimp in my order. This place has fallen off. Go to SEA Thai, it's much better.", "author": "Sadie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "Spicy noodles: huge portion, tasty, cheap. What's not to love?\n\nI like the decor--I've used that paint color in my own domicile, so perhaps I'm biased. \n\nI was a little puzzled why the menu only has beer and wine, yet there's a full bar. Is it because I was there on a Sunday at 6? Is this a blue law or something? My closet alcoholic brain is easily confused. And not from New York.\n\nThe cash only thing sucks. They do redeem themselves a bit by being fast, both to bring food and to wrap it up.\n\nBut I definitely want to come back and try some of the other things on the menu. And one of those giant vodka bottles in the back. I'll bring cash, I promise...", "author": "Eva F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "Great food,good friendly service.... Fried calamari ,good,pad Thai and pad woon sen,good,mango salad, good!", "author": "Marsha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "I had tiger shrimp for an App and it came with a nice sweet sauce. I also had shrimp fried rice which was very good.  The restaurant was very dim and calm. Mango Margarita was excellent.", "author": "Kesha J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-03", "description": "THE FOOD HERE WAS PRETTY GOOD, BETTER THAN YOUR HOLE IN THE WALL THAI JOINT.  THE PRICES WERE ALSO SURPRISINGLY LOW.  THE ONLY PROBLEM...\n\nOh sorry, let's stop outside.  That's better.  The only problem was the loud music.  I don't understand how anyone could turn the music on that loud and think \"Yep, this is what people want when they eat Thai food.\"  While I liked the food, I can't see myself ever going back unless they fix the noise.", "author": "Andy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-05", "description": "Yay Joya! I am a big fan and have always had a pleasant experience here. The food is good, prices are even better and the space looks much fancier than it really is (in a good way). No credit cards, people, they are cash-only. Also, go at a random time because it gets hella crowded!", "author": "Amy C."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}