{"aggregateRating": {"reviewCount": 1263, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "By far the best Thai restaurant in the area. Very reasonably priced menu. The curries are my favorite and they always have great specials available. Love the ambiance with the open kitchen and backyard seating!", "author": "Kelsey S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-03", "description": "A lot of Brooklyn patrons love coming here for Thai food... And while it's decent Thai food for Brooklyn... Queens still have me spoiled for better Thai cuisine where I'd rather hold off my cravings to troop to Queens. Btw; this is the sister store of Song which is also in Brooklyn and you can also find my review on them there!\n\nFRIED CALAMARI - calamari was chewy and rubbery.\n\nDUCK CURRY - w/ pad thai noodles and mixed vegetables, the curry flavor was pretty good but the duck was too dry and bland.\n\nBEEF MASSAMAN CURRY - again, the beef was extremely dry even more than the duck.. The massaman curry base was average.\n\nPAD SEE YUE - just like their sister store Song, their pad see yue is a true dish you can't go wrong from them. People loves it, and yes it was pretty good but the more we are it and got to the bottom of the plate it started to taste sweeter and sweeter.\n\nSlow service, nice modern ambience, good portion and inexpensive.", "author": "Monica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "My go to place for Thai in Brooklyn. Really enjoy their grill chicken and pad Thai. Their side menu is always unique and has delicious options. Gets crowded for dinner. But worth the wait or reservation.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Prob ate here like a hundred  times through out college life. The first time I ate here I used to always get the Spicy Noodles which were bangin'. Now I moved onto ordering their Thai Curry's and I am pleased. The other night my BF ordered the Fried Red Snapper with coconut red curry it was amazing I tell you! Also for appetizers try the coconut calamari !!!\n\nThey always have good service when we get there the food always comes out on time with such great quality. \nI know there are other Thai spots on the same block but NOTHING beats Joya food and money wise! There is usually a wait on the weekends that's because it's worth waiting for than to go to the other spots.", "author": "Sigma U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "We ordered take-out from Joya, so this review is solely based on the food. You should know, if you're ordering take-out, they DO deliver! I have to say, I was really excited to try Joya because the menu looked very authentic and after living in Thailand for some time, I am always craving \"the real stuff\". We ordered multiple dishes: \n\nSom Tom: honestly, the worst green papaya salad I have ever had, and I don't say that lightly. I have made som tom at home several times and I honestly don't see how you can miss the flavors so extraordinarily. It was way too coconut sugar heavy and very light on fish sauce and citrus (lime) flavor. AND it was not spicy at all with no authentic dried shrimp. Very, very disappointing. \n\nPad Thai: Also way too sweet! In Thailand you have the option of adding \"condiments\" to your pad thai: chili sauce, fish sauce, bean sprouts and sugar. It tasted like Joya's version of pad thai had sugar all over it. \n\nWoon Sen: glass noodles with chicken and egg, the dish was okay, but nothing to write home about. \n\nSpicy Noodles i.e Drunken Noodles: not an authentic Thai dish but definitely the best entree that I tried! I would order this dish again, but definitely increase the spice. I was shocked at lacking in the spiciness factor all of our dishes were.", "author": "Rose L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Joya! We LOVE Joya! This is a very trendy Thai restaurant in Brooklyn. \n\nWe discovered Joya in summer 2013 and we have been going back ever since. It is a treat for us. We love the special Thai spare ribs (and the dipping sauce), fried calamari, mango salad, green papaya salad, Pla Muk Kraprow, and spicy noodles. \n\nThe heat from the wok makes everything taste better than other restaurant. If you happened to sit near the kitchen area, you will know what I am talking about. \n\nThis place has good cocktail drinks too. So do grab one while you are waiting for a table. If you are going between Thursday and Saturday, do go early because it gets crowded quickly.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "My family and I went to Joya to celebrate my sisters birthday. We've come here many times, and the food is always excellent, and the prices are so cheap. \n\nFor appetizers we ordered chicken curry puffs, vegetable spring rolls, and calamari. We ordered two orders of the spring rolls and chicken curry puffs because there is only two per order. SOOO good. The chicken curry puffs are my favorite. \n\nFor my entree I got the special they had that night, the steak and spicy noodles, but I got my noodles not spicy, it comes with vegetables in it also. I've gotten this special before there, it's so good. The entree is huge, no way to finish it all. \n\nThe prices at Joya are ridiculous, you really get so much food for the price of everything. I'll definitely be back at Joya soon !", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "I love this place. It's one of my favorite go to spots to hang out after work for the prices and the food. The ambiance and decor makes the spot even better. If you're looking for and affordable place with great tasting food then this is it.", "author": "Samuel W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "Big kudos:\nHuge menu w lots o choices for veg heads, meat eaters \u0026 in between @ an average price of like $8\nFull bar. Great wines by the glass. \n$4 fresh crunchy big papaya salad special \nLoved my Spicy Noodle w only veggies - chock full of a variety of veggies like sting beans, broccoli, bean sprouts, mushroom,\u0026  basil \u0026 egg- enuff for 2 meals!\nLove, love, love the trifecta of spice condiments!\nModern interior, Comfy seating, low lighting, cool tunes, chill ambiance\nand the NYC coveted outdoor garden seating! \n\nNot my fave: \nNo cocktail menu- no cool lemongrass martini or mango spicy Margarita? \nSmall dark bathroom\nCurt, brisk service bordering rude", "author": "Debrin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "Vegetable spring rolls: mushy and tasteless.\nTofu Pad Khing: big pieces of fried tofu, no seasoning.\nSpicy Noodles: almost no chicken, lots of onions instead.\n\nOverall very poor experience, cannot recommend.", "author": "Nicholas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Love this place. Food is great. Staff friendly and helpful. Great Authentic Thai food. Prices are Good. Would definitely recommend this place.", "author": "Fakreya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "I visited late on a Thursday night. It seemed a bit busy but we were able to sit almost right away and were able to choose our table. The food was really good and huge portions. No one could finish their meals. We had the  calamari to start, spicy noodles, the shrimp fried rice, and vegetable fried rice with tofu. The dim lit atmosphere was nice as well. The service on the other hand was very sub par, which may be a thing because I saw the table across from us looking and trying to flag down their server as well. Our server took a while to come to the table initially, then forgot one of our drinks (that was the only drink ordered at the time) tried to go back and forth with my dad about not having a sauce for his fried rice instead of just telling him what sauces were available so that he can choose one. Then when our food was packed up it wasn't labeled or anything so I literally had to open each one to see what was whose and dig through the fried rice to find out which was which since we had 2 orders. All in all the food was good.", "author": "Catiana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "Oh oh- back to three-star status- and I'm being generous.  They're destroying the consistency of the food at this well-known establishment-\nOnce again the prices of been raised the quality of the food and the portions have gone down.  This used to be an excellent Thai restaurant but now- after this evening's meal I somehow doubt that I'll be back.\nthis was our go to place for the last three years for Thai food.  The quality and the recipes are inconsistent now and it's very sad to see a favorite restaurant go down the drain.", "author": "Susan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "We went here because of soo many friends suggesting it and they were right!\nOther posted pics are accurate. \nIf your not looking for it you will miss it. \nClean, fresh, friendly and great Thai food. We got Calamari, it's a light batter and needs the sauce they give. \nWe also got Shrimp Pad Thai and Spicy Seafood Fried Rice, both were great!\nBar is basic, no great deals or great beers. \nThey have outdoor seating in the back and would love to come back when that's open. \nBathroom is sharp and clean. \nPrices for what we got were reasonable. \n$29 for the 3 dishes and we took a Togo bag. \nWe will go back!", "author": "A H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-08", "description": "Honestly, I used to enjoy coming here but one night, I encountered the owner who was beyond rude and honestly had a prejudice again my friend and I so I will no longer recommend this place to anyone.  He ignored my friend and I when we called him over to try to speak with him. We were not acting belligerent or out of character in any way shape or form (as some of you may be assuming).  I finally had to walk up to him and started speaking to him a low voice and tried to just ask him why he was ignoring us. He just dismissed us, told us he was eating and didn't want to fight and that he can speak to his customers however he likes.  Literally....so, if you decide to go, hopefully you don't have to encounter any nonsense from him.  But I do hope someone takes this review seriously and stops giving him business. ‍", "author": "Chrys V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "The food at this place is amazing! Its very cute and cozy PERFECT for dates. In the summer there is outside seating in the back which is pretty nice as well. The FOOD is made in an exposed kitchen so you can see your food being made from where you sit. At night the trendy little bar at the entrance of the bar is buzzing!\n\nThe MANGO salad is scrumptious! It has an awesome mix of two types of lettuce, red onions, cherry tomatoes, peanuts, cilantro, fresh sliced mango with a little tang! Topped with a lemony dressing that is refreshing and the entire salad EXPLODES with flavor in your mouth.  \n\nThe pad thai is amazing with chicken, the noodles are cooked to perfection with fresh bean sprouts its one of the most popular dishes! Soy substitute for you vegetarians out there! Also if you want something spicy try the spicy basil flat noodles!\n\nThe 5 stars I'm giving this place isn't for fine dining, because its not. The 5 stars is for the cozyness of this restaurant and the food at an affordable price! The perfect place for a intimate dinner and drinks at the bar after", "author": "Rima K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Great food, great drinks, great service, great atmosphere.  A place to go with the wife or the whole family. My favorite Thai place in Brooklyn.", "author": "Paul R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-22", "description": "Joyas used to be a favorite of mine, however this visit left nothing to be desired. Food was rushed so the taste was mediocre. In addition I asked for a plastic fork and was told it's only for dining out, the boss will get mad. T__T  While plastic utensils are mainly for dining out, I don't think I should be given such a poor excuse if I am asking for one. I am sure it's not a common request dining in and don't think I should have to explain the logistics to my request before being given one. It was extremely disappointing and I will not be back.", "author": "Qual M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Yum, yum, yum!\n\nMy friends and I came in here for a quick dinner before heading to the movies. Beautiful area, beautiful scenery, and beautiful decor in the restaurant. The food was fantastic! We all enjoyed our meals. I ordered a margarita for $9 and it was good. Not sure it was worth $9 though. More like $6 or $7. \n\nThe food is very inexpensive and our bill came out to under $40 for three meals, plus my drink! This place has good food for cheap. My only peeve was that since we sat outside we were greeted by mosquitoes, bees, and flies. Not exactly the most pleasant eating experience. However, the food and atmosphere is so nice that the bugs do not pose a major problem. \n\nI will definitely make an effort to come back here before the summer's end. The food is delicious and they give you a great portion for the price!", "author": "Tashana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "This a good restaurant that won't break the bank. The calamari appetizer never disappoints and contends with the best of them(Italian or Thai). We get it ever time we go, and it's the best.\n\nAll the entrees are good, and the portions are big enough where you will need a doggie bag. Definitely a good value.\n\nMy only critique would be a lot of the dishes taste similar, as they use similar ingredients. \n\nDrinks are good, and there are enough options to satisfy most.\n\nDefinitely worth checking out, and a great introduction to Thai food.", "author": "Matt K."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Joya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "215 Ct St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ybE5XMpV6GhdlOJoIBUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182223484"}