{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "Good ..fast service\nAnd clean\nTheir 20$ dinner special that include soup and\nYour choice of desert..you cant beat it with a stick..", "author": "Sonja G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-04", "description": "This place is Way tooooo expensive and it's just a diner \nI ordered a steak salad nothing special and a small cup of chicken noodle soup which was only a can of Campbell's and my bill total was $35.66 they charged me for the tomato's, the onions, the cranberries and the cumbers please tell me what does the salad come with \nPlease explain this never again", "author": "Shaunte W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-29", "description": "Too expensive.\nIts only a diner!\nBreakfast prices are just too high!\n\nExpensive\nExpensive", "author": "John S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-07", "description": "Breakfast food is so easy to make. I always feel like a huge putz spending $35 for one person on a waffle, a couple eggs, bacon, milk, juice, tax, and tip. Thus my 3-star rating. \n\nStaff was friendly. The restaurant is quite spacious. I was surprised by how many tables were available this past Saturday morning, but that was due more to the huge size of the restaurant vs. it not being busy.\n\nIf you're looking for a diner and are willing to pay typical NYC diner prices (not cheap these days, especially compared to delis or fast food breakfast places), I'd recommend this place.", "author": "Drew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-06-01", "description": "Nice dinner in Brooklyn serving a decent breakfast. Positives are quickly seated, food is good served hot. Negatives are stingy on things like napkins refills on coffee no straws and waitress never returned to the table after plopping food down on the table. 4 stars based on taste and quality of food. With a little effort by staff and a little much generous offering of simple little things I'd give it 5 stars. I guess Brooklyn prices should be expected. So friendliness and enough ketchup and jelly 2 stars. Food quality and staging 5 stars.", "author": "Robert W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-25", "description": "After a few more visits to the New Apollo Diner, I've decided they are A-OK in my book. \n\nThe Old Apollo:\n\n-Diana Ross \u0026 The Supremes.\n-Billie Holiday.\n-The Jackson 5.\n-Stevie Wonder.\n\nThe New Apollo:\n\n-Surprisingly high prices, but correspondingly huge portions.\n-Solid food for the most part. \n-A good spot for a baby because everyone's seen way worse in here. \n\nAt the end of the day, the New Apollo is a diner, and pretty decent one. Service is quick though, and unlike everywhere else you want to be, you won't have to wait to eat eggs on Sunday unless the Brooklyn Tabernacle is just letting out around the corner.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "The Food Was Horrible. I Wasted A Good $30+ Eating Here. The Waitress Made Me Feel Uncomfortable. It Made Me Feel Like I Shouldn't Be There. Only Things That Was Good Was The Water AND Lemonade.", "author": "Tisha W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-30", "description": "I give this diner 4 stars because the waitress, Amanda and the busboy were so attentive and quick to serve. I had the corn beef hash with scrambled eggs with juice toast and home fries. That was $13.75 number 5 breakfast special. My brother had the number 4 special scrambled eggs with juice toast and home fries.  Also sausages were added for $11.75. With tax our order came up to $27.22. We gave a tip also...so I think for breakfast specials, this was very pricey. The breakfast was ok. The waitress was sweet and attentive as was the busboy. Kindness goes a long way.", "author": "Vivian V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-20", "description": "If you need sit down breakfast in downtown Brooklyn, a solid choice. I liked my eggs, turkey sausage, iced coffee and toast. \n\nIt does feel pricy for a diner but consider the location. I took a work breakfast here with a client so it wasn't my money; however, not sure I'd want to shell out the full prices they have listed.\n\nI did find a black hair in my food before I started eating. I asked for them to re-make the entire plate and they did it quickly/professionally and apologized. \nDespite this if you are ok with the price... a solid choice. So, 3 stars.", "author": "Gretchen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-02", "description": "The only thing upscale about this dump isits exhorbitant prices. Here's the real deal food was just ok. Service  was good the staff was attentive and helpful. These guys are the only game in town. They should be killing it but there not. With them its the ownership. There the ones who are  bbn \n Ml\nMl stifling the business.", "author": "Eugene D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-15", "description": "Greeted to a warm welcome and a nice atmosphere. Service was fast and friendly. Pancakes were soft and fluffy but were lacking a bit in flavor. Eggs were a tad bit lacking in salt but salt shaker was provided at the table.", "author": "Miguel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-15", "description": "The place it self is welcoming and nice .  Pancakes a bit fluffy but were lacking in flavor. The Eggs were lacking in salt.", "author": "Citlali M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Hands down best diner in the neighborhood- forget Carroll gardens or iHop. Bright open space with a top notch service and all your diner faves 5/5", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "Great and big greek diner, perfect for brunch. Plates are very good and big, price is ok, and very good service too.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-26", "description": "It's a Saturday morning, and they have Faux News on the TV. When I asked if they could change the station,  they said they don't have the key or some such nonsense. This oatmeal is amazing, but if this is the owner's choice of TV viewing, I don't think I will be back. I plan to clarify that on the way out...because I *am* THAT person.", "author": "Lorraine W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-04", "description": "Must be a diner exclusively for the 1%. How do you justify a salad for $25.  A SALAD!!! It's a friggin diner! Skip it and go make a tuna sandwich. You'll hate NY less.", "author": "Walter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-29", "description": "No server !!!!!!!!!!\n\nA woman just came to assist me without any greet just you ready to order after waiting for over 10 minutes. She wasn't my server but she took my order anyways. \n\nEveryone in the section where I was sitting was requesting for service they weren't receiving. One gentlemen was waiting for his check since I arrived, another lady was wanting to place her other, and the third gentleman was wanting to place a to go order. No team work for real in this diner. Our server finally came and didn't greet me as well. She just ask did I order already and tried to pull the menu from under my hands. These servers are not of Quality!!!! I think it is very basic of a server to just say HI, Hey, Hello, Good Morning before asking to take my order. I am not for anyone that doesn't know me especially when I'm a guest in their establishment to call me baby, mommie, papi, sweetheart, etc. \n\nIt was one server name Felipe in the restaurant that just so happened to walk pass and kindly said \"Hello! How are you? Are you enjoying everything.\" I wish I was sitting in his section because he seemed so friendly in comparison to the other staff.  \n\nThe tables are so freaking close I literally had to push and pull my tables back and forth to let other guest in and out from their tables. They should just removed one table to give the guest more room.\n\n I order the Split Decision which came with both French Toast and Pancakes. I love the concept because I can never decide if I want French Toast or Pancakes, so this was perfect for me. I also order scrambled egg with cheese. The food was just as awful as the service was. Well the French Toast was some pressed down bread with 3 large scoop of cinnamon thrown on top. I'm not chef but could have whipped up some better French Toast then that. Glad it came with a Pancake which was okay i was able to eat it. The best thing there was the eggs. I wish I would have just order like 5 eggs and been good. \n\n\nYou can't call yourself DINER and not serve some good breakfast food. First and last time going there!", "author": "Dominique I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-23", "description": "They pretty generous with the amount of food provided. It's a diner - nothing special. Inexpensive, given the area. I.T was very clean and the staff seemed nice. The only thing that threw us off is that our waitress rudely gave the check In the middle of us still eating. I wanted to order coffee but no longer wanted to after check was presented without permission. \nWould return if i was in the area but wouldn't go out of my way.", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Got tea and cake this time. Servers are nice. The cake slice is enough for 2-3 people. And it has something in it that should not be there. Makes the strawberry shortcake taste like soap or come other chemical", "author": "Yaffa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "As diners go, they are very good. You can't go wrong with a burger, an omelette, sandwiches... I haven't tried anything too fancy here, but aside from a bland side of gravy for my fries, everything was enjoyable and reasonable.\n\nGood coffee.", "author": "Richie G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}