{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-26", "description": "Mediocre at best. If its fried you're safe. Burgers, eggs....fine.\n\nGreek food or salads? Just terrible.\nCobb Salad had none of the staple items found in a Cobb,  most blatantly omitted was REAL BACON, they used in stead, bacon bits. No BLEU CHEESE NO AVOCADO NO EGG. It had lame iceberg, and generic chicken.\n\nI tried these guys three times in a neighborhood that should and does provide customers,  but every meal I've had here was just so bad for a NYC diner. \n\nThe staff is friendly and competent,  its the menu and the recipes that omit major ingredients that seem it's aimed at cost cutting. I don't blame the kitchen  either,  but the head chef or whoever controls that menu needs to get it together. Look up actual recipes on Google and there are so many better ones than what you're using. Even the Greek food is so badly presented, the Tsaziki sauce was the absolute worst thing I have ever tasted. I am Italian,  and it was like tasting tomato sauce that was made of ketchup water and garlic powder. \n\nWorst diner I have ever been to, nyc born and bred,  J resident since 2003, come to the Tic Toc on rt3 as your first stop on how diner food should be.", "author": "Stuart T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "Decent food, fast service. My main complaint is that I ordered a salad from the salad list and ALL got was chicken breast and cottage cheese on a lettuce leaf??? I wouldnt be so confused and disappointed if it was actually listed that way. Then the manager came and spoke to me like I should have KNOWN that this is the way a salad from the salad menu is plated. Dont get the salads or have questions about misleading menu items and you might like it here.", "author": "Kelsey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Great diner.  Food is fresh and quickly delivered... great bakery with delicious cheesecakes.", "author": "Travis F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "I've been here twice and have been pretty happy with food. I order the usual ham omelette, pancakes, side of bacon. My daughter and I come here for breakfast and it's wonderful.", "author": "Saidy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Was in Brooklyn for work after having missed breakfast. Went to New Apollo where id been before. They have a lot of build your own breakfast options. I had an omelette. They had over a dozen options for fillings. Also they have substitution options if you don't want home fried potatoes. So it's great to go if you like building your own breakfast. Food is good. Not spectacular.", "author": "Larry W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "I had the BBQ salmon salad and French fries with a friend here as we grabbed a quick bite before shopping in Fulton mall. It is a typical diner with typical diner food. The servers were friendly and accommodating. We had a slice of carrot cake for dessert that was okay. No wow factor but I do have to say the salmon was very good and tasted fresh. I enjoyed the barbecue sauce on it as well which I have never paired together myself but worked in this. I also enjoyed the salad since it had these green leaves I can't remember the name of that look similar to watercress and are very good for you. If I was around the area I would come back for a quick bite.", "author": "Astrid M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "Walked in at 11am multiple tables and booths available. I asked for a small booth and was told no because it's almost lunch time(really where in another time zone like Greece)and they need the space. Mind you the place is 3/4 empty.  I come to this place several times a month. NEVER AGAIN!!!", "author": "Rich D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "I've eaten here for the better part of 7 years. Spending a huge chunk of time in this place it feels a bit like home at times and other times like the stepsister that everyone wants to leave.\n\nFood wise I'm always satisfied. It's a diner.. so breakfast and burgers are what i stick to. It's the service that can be a bit tricky. \n\nSo the feeling like home times is when they give me more than 1 splenda to sweeten my coffee, they always refill my coffee, they ask if everything is alright, and give me the bill without asking. The feeling like a stepsister times is not getting the splenda I ask for 4x's,  getting the wrong coffee or none at all, and waiting until i have my 1st born to get the check.\n\nNight and day...I know. However, I will still come b/c it's home.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "I love diners. There aren't enough in BK! Had a delish grilled cheese and home fries. My lunch date's chicken wrap was not quite as good but I think they do the basics very well.", "author": "R L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "I have been to this diner for more than 10 years. It is great, the service, food, and waiters. I would recommend this diner to any and all. Keep up the great work!!!", "author": "Hamani H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Nice quiet diner.. Large selections on the menu and it's $3 less if u dine withing 5pm to closing. Great service and good price.", "author": "Russhane P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Great service and delicious food no complains, would recommend it to family and friends. Nice decor, visible from the outside.", "author": "Ileana R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-06", "description": "Sunday Brunch @ Apollo\n\nFor a party of 2, less than 10 minutes wait, I like the sound of that because I was ready to eat! It is  a popular location right around the corner from the Brooklyn Tabernacle Church.\n\nI ordered the the Spinach and Avocado Cheese Omelet. Well done, they were a little stingy with the avocado but it is ok. The cheddar cheese and the eggs were A ok.\n\nMy mom ordered scrambled eggs with corn beef hash. I love the corn beef hash. So basically I eat most of her food :-).\n\nWe shared the meals and really enjoyed each meal very much.", "author": "Sheri S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-25", "description": "Tasteless food and staff not really interested in their jobs. \n\nWent there twice, unhappy with the experience both times. \n\nGreen peppers in all of the egg based foods and the lox for bagels where frozen.", "author": "Elli H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-14", "description": "One star for the cleanliness and the extra room they have now, one star for the attentive hosts/servers.  Cheesecake is very good also but like another person said, food was partially under-cooked.", "author": "Kathy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-25", "description": "Regular tasting things here. . All three people I was with eggs were cold. .like it was made first put to the side and then everything else made. . They give u juice in the size of a shot glass", "author": "Tasha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "We stopped in after church service at Brooklyn Tabernacle.  Breakfast was delicious! Service was wonderful! Sat down immediately.  Will highly recommend this diner. Beautiful interior. Great portions. Constant refills for coffee. The whole staff so kind and upbeat!", "author": "Geri H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-06", "description": "it was cool and ok for the price. The waiters keep trying to give me coffee every 10 seconds.....", "author": "Travis S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "I am a fan. I'm a new fan.  I had been scared to go in here for a while now for a few reasons: \n\n1) They're in a great location, I was afraid they'd be snobby like many spots who know they got it good. \n2) I use to come here as a child. I liked it.  I'm an adult now, they've remodeled. What the heck will I find? \n3) If I don't like it, then I just lost the only diner in the area to eat at. \n\nI am happy to announce that The New Apollo Diner has very good food!  \n\nMy husband and I came here once not too long ago for dinner.  He had the Apollo Burger and I had the Fajita Panini Platter after seeing another patron get served one. I have to start by saying that ordering a Mexican Fajita at a Greek diner has to be one of the biggest mistakes............................ I make a lot.  I crave fajitas  pretty everyday and sometimes when I go into a diner, I just can't help myself.  They always end up being so bad, I don't finish them. My husbands wallet, resents me.  However, I did it again this visit to The New Apollo Diner, and for the first time, I ENJOYED a fajita platter at a diner. The chicken breast was real chicken breast, no pre-packaged frozen pale chicken strips.  The platter came hot, well presented and big.  The Apollo burger which comes with mushrooms, guacamole, lettuce, tomato and your choice of cheese was also delicious! \n \nWe were won over. \n\nSince then we have come back two or three times, I have switched it up with the Philly Cheese Steak and have been really impressed with that platter as well. \n\nTheir staff is professional and give organized service.  They're not exactly the cheeriest crowd, so besides the super sweet hostess at the entrance don't expect tons of smiles in the serving staff.  It's not that their rude or mean, just more on the serious side. I originally confused it with disregard my first visit but have observed them a bit and see it's that their mind is on their job deliverance, not so much sucking up to patrons. \n\nI recommend this place.  They are clean (literally I have seen the staff wiping the walls down checking for any sign of dust). Their prices are okay for the area, they're food comes fast, and they're professional as far as diners go.  They have AWESOME desserts which they advertises as being baked on the premises.  Their neat glass cake display allows for seeing and picking your choice.  I have had two or three desserts and they taste fresh and creamy. The strawberry cheese cake is delightful!", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "For starters I really didn't like the fact that the guy who looked to be an owner or manager told me I had to order something to use the bathroom. I know this is customary for some businesses, that's understandable but even after informing him that I will be dining in he said \"you have to order first\". Would've gave atleast another star because I've been here several times and I like the food here but that was just ridiculous! In my opinion it was like I was being called a liar! They are very attentive here and the same manager looking dude did come around to check on me later on which I love when I'm dining out!", "author": "C.J. F."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}