{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-03", "description": "Nope. Too pricy for terrible angry service and meh diner foods. Boo. I've tried over ten times, so shame on me. Hardworking bus staff. Clearly terrible mgmt. Rotting from the head.", "author": "Chad L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-12", "description": "Staff is always friendly and seating is ample.  Their menu is humongous so there's something for everyone.  However, as diners go, the food is mediocre (underseasoned and mushy, though the portions are generous) and the prices are a bit steep.  The best value on the menu in my opinion is the bagel with lox.  I'll return for the lox bagel and the lovely staff.  Just don't come in expecting a mind-blowing gourmet meal.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-06", "description": "Ordered delivery preorder the evening before, for delivery at 10:30 am the next morning. It arrived at 7 am.  This place needs to pay more attention!", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "I love breakfast. No matter what I've done for dinner and when I called it a night, I wake up early and hungry. Found this large diner and it was looking pretty busy on a Sunday morn. I just assumed we'd have to wait a bit for service and food. Wrong!  Greeted immediately. Coffee soon there after. And before my first cup of coffee was consumed, here are our breakfasts, generous sized and hot. If I return to Brooklyn, this is where I'll be at 7am.", "author": "Alvin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "I like this diner a lot because its clean, spacious and comfortable and the service is always friendly and quick. I order breakfast foods which are always good, though I haven't tried the rest of the menu. Coffee is good too and quickly refilled.", "author": "Eli A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "Service is a 10.  Food is fresh, simple and satisfying.  My new favorite diner.  Plenty of elbow room.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "I had wonderful service ; I honestly wish I could remember her name . She was an older Spanish woman . Anyway she was wonderful and the host was wonderful . Food was great. Only downfall was Gabriel . Working in the hospitality business has taught me a lot about how to treat guests - and he should retake a class on his customer service . My friend asked about a dish and what comes with it and he immediately responded we close at 10pm - it was only 900 pm. I'm definitely coming back and will specifically ask to not be seated with him .", "author": "Julissa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "Best spinach pie in town. Very comfortable tables and friendly service. My friend ate the Musakka and he loved it. Nice environment and good prices.", "author": "Fob B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "I went today to the New Apollo Diner and thought I would have a great meal ... so I don't eat meat and ordered their Waffle with walnuts, whip cream and strawberries with a side of sweet potato fries.  As I was eating the waffle I bit on a hard object thinking it was the walnuts but I almost chip my tooth. I realized it was a piece of a bone!!!! \n\nI spoke with the manager and she said sorry and acted like she was going to do something about it. I started eating the fries, not only did it taste soapy there was bits of fried chicken attached to the fries.. so seems like the oil isn't cleaned before using it again. The manager came back and offered me a piece of cake or juice like I want to eat anything else there!!!!\n\nI said shouldn't it be taken off my bill and she said \"no.. that's why I offered you cake\" \n\nAre you serious??!!  I am absolutely disgusted at how they handled the situation. Never going there again.", "author": "Keetia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-31", "description": "This diner has a lot of variety of meals and amazing bakery treats. I would recommend, it's great place to have breakfast and take out for dinner. I had the chicken Alfredo, it was a large portion that could feed 2 people!! I wasn't a fan of the chicken but overall I had different meals that were great. \n\nYou must have their cakes!!", "author": "Leyann S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Me and the wife at Apollo's restaurant we having brunch.....   Awesome meal. We come back again.........", "author": "Dwayne Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-11", "description": "My first time coming here was years ago before the renovation and before they had a bathroom upstairs!!\n\nI used to come here just for the strawberry shortcake, which is pretty good.\n\nSo my first time eating here was a couple weeks ago for lunch. I ordered a cheese burger deluxe that came with fries two onion rings a pickle and cole slaw. It was ok, why? Because the burger didn't have any season, BLAND!! very disappointing, because it looked really good!! Ibdud get my strawberry shortcake which is always good!!\n\nSo guess who went back for lunch two weeks later? Nana wanted a pastrami sandwich so we just had to go here. So I decided to try something different. I ordered a california chicken wrap, grilled chicken, lettuce, tomatoe, avocado,and red peppers. AGAIN it was BLAND = ( I was upset because I was really hungry! The fries was fresh and the onion rings is always good! My grandmother said they probably don't season the food because a lot of elderly people eat there lol uh who cares i want SEASONED food, I'm not in a hospital!!\n\nShe my grandmother enjoyed her pastrami sandwich as always lol i did have a bite and it was good!! \n\nI tried a new dessert as well i think it was called Napoleon first time and it was okay!\n\nThe staff is REALLY nice. From when you enter  until you leave. I think I'll give them another try  maybe breakfast or dinner?\n\nFood * * \nService * * * * *\nSpace large clean and wheelchair accessible", "author": "Iesha M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Classic, no-frills diner that has everything you would hope to see on a diner menu located in a neighborhood void of any other diners so hallelujah that there is at least ONE. \n\nBreakfast consisted of an egg cream (try one of you haven't), three egg omelette with spinach and feta, and an egg/cheese/bacon bagel sandwich. Service was fast and friendly!\n\nOnly comment is that this diner is quite expensive! \n\nAlso, they really slather the butter on the toast so ask for dry or on the side if you prefer a normal amount.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Ive been to a lot of diners because I have picky eaters for children and New Apollo is a top notch solid bet. I always order a turkey club on rye at a diner for lunch and this was probably the best I've had.  Ample serving of bacon, the tomatoes were just and stayed in the bread, just the right amount of mayo and the turkey was moist breast meat-- real sliced. Service was fast and friendly. I would make this a lunch stop after every visit to the transit museum only blocks away.", "author": "Erin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-01", "description": "Service is very hit or miss, but overall it's a nice place to eat. I usually come here after church on Sundays. It's definitely a family oriented place and you can a pretty nice size meal for a reasonable price. I've only been on Sundays and it's usually pretty busy but you can still be seated quickly.", "author": "Allyson A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "The diner is very clean and serves large portions. Breakfast is really good and the menu is HUGE! It's like a novel with stories (or food in this case) from all over the globe. The deserts look amazing and am looking forward to going back and trying a few of them. My waiter was fine. I've noticed other reviews complaining about their wait staff, but when I go the waiters seem to be attentive.", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Haven't been here since they renovated. Full breakfast and great service. Wait was minimal and the food was fresh and delicious.", "author": "Cheryl H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "I've been dying to visit this location and never thought that on my wedding weekend I would finally get that chance. It was well worth the wait the service was amazing and the food was amazing as well. I will definitely be returning to this location with my wife and children.", "author": "Stringer B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "Used to enjoy this diner.  Never going back. Asked for a booth and was denied for reasons that were weird.  Waiter was unfriendly and she was impatient with us.  Needed to tweak an order roughly two minutes after we placed it and was given an unpleasant attitude. Was just an uncomfortable experience. So many other places to spend our money.  Is what it is. They'll survive, but not with my business.", "author": "J D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "We were refused coffee in a disposable cup (because of  kosher needs,which we explained to both the server and the manager) We were told we'd have to leave and then could have a take-out cup.We offered to pay for the cups, but were told \"No\". It takes a certain type of person who would refuse 2 elderly people on an extremely hot summer day a place to sit for a little while with a cup of coffee.It seemed as if respecting someone else's religious needs was so distasteful to them.", "author": "Irwin T."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}