{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-26", "description": "Lapin and I came here on Saturday for breakfast. We were seated right away as the restaurant wasn't very busy. Lapin ordered the He-man with coffee and I got the 3 egg  omlette. The food was okay, just the standard diner fare. Our waiter wasn't very attentive but that should be expected with most diners. Although, I think he was annoyed that I only ordered an omlette and nothing else. The prices are a bit expensive for a diner but in line for the area. I don't think I would be rushing to try this place again.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-13", "description": "Food service was super fast. Staff is attentive and courteous. Good diner food. Would def come back/recommend.", "author": "Margarita G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-02", "description": "Good breakfast at a great location for me.  When I'm in this neck of the woods, I'm usually traipsing through one of Brooklyn's cavernous municipal buildings or otherwise dealing with the bureaucratic nightmares of the People's Republic of Brooklyn - and yes, I'm a Democrat saying this!\n\nSo getting some grub and being on my way in no time?  you get a thumbs up from me.  But folks, beware, the restrooms are at the bottom of the stairs, so give yourself some time ;)", "author": "Mike E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "I love going here to get brunch on the weekends. I've been going here since they opened and I always enjoy the food.", "author": "Truth H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-17", "description": "I ordered a bacon cheese burger deluxe with a small coke and boy I tell ya, when I looked @ the receipt . I couldn't believe I paid close to $20 for  a burger that cracked my tooth. I told them I wanted it medium well, I received well done, that burger was so dry, and the fries were limp and warm as if they was reheated in the microwave. Needless to say I was very disappointed and will not be eating there again.", "author": "Latasha N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "Pretty gross...poorly cooked eggs, rubbery sausage, weak coffee, and soggy french toast. \nThere's too many good brunch places in the area to give this place a second chance.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-05", "description": "Horrible service...\nHorrible food...\nHorrible experience...\nThat is all...\ncome here if you're passing by and just want a cup of tea/coffee. Hopefully, they can at least do that right! The two stars is just for the convenient location and being open 24 hrs...\nUghh...\nBooooo!", "author": "Nakia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Excellent breakfast specials. We came here 3 times during our stay in Brooklyn. Service for taking order and food arrival are great. Food is wonderful. Only reason for 4 stars and not 5 is it took a long time to get our check and pay. If u come here, don't be in a hurry. Otherwise, good pancakes eggs French toast etc.", "author": "C F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "I can't believe that in these times 2016 the restaurant has no knowledge and has no gluten free options especially with people now being concerned with their own health. OK I was unable to get gluten free toast  with my omelette but besides that the food had no taste.  As a rule I never add salt to my meal and I found that I needed to use both salt and pepper ,still didn't work NO TASTE", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "Food was not very good, under cooked meat and one order had hair in it. If you go there be prepared to be underwhelmed.", "author": "Rhonda R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-07", "description": "I had no issue with service. The older man who seated me was friendly. The server barely made eye contact but I didn't have to wait very long for anything which honestly is more important to me. HOWEVER, the food was not very good. I ordered a bacon burger triple sandwich and it was so dry, I couldn't eat it. The beef patty was tough and rubbery. Fries were okay and the pickle was good. Actually the pickle was the best thing on the plate. That's pretty sad.", "author": "E G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "What you would expect for breakfast place. The breakfast specials were a good options. However, the fruit juice that's paired is only 4 ounces a bit extreme If you ask me. The home fries were excellent and paired nicely with the onions and peppers. The entrees sizes are fairly decent.", "author": "Marquez B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-13", "description": "I've been coming here for lunch during my internship down the street. I mean it's a diner. You don't go in expecting anything outside of diner fare. But the food is good, and the service is quick and friendly. Pretty much what I'm looking for.", "author": "Mj G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Favorite Greek diner in Brooklyn. This place almost makes me enjoy going to court! Not really...", "author": "Greg F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-23", "description": "IHOP is no longer up the block. Livingston diner is up the street though. I prefer them.", "author": "Tristan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-24", "description": "Steer clear. poor quality food, did not honor order specifications, WAY overpriced for what you get.", "author": "Kim D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-14", "description": "While walking to the train, I realized that my drink was ripping through my paper bag. I walked in to this restaurant and asked the woman at the hostess desk for another bag. The woman snapped and said \"not for you\". I thought There was a misunderstanding. I couldn't conceive of anyone being that rude or mean especially for a plastic bag...so I said \"you won't help me and you can see this\" pointing to the bottom of the bag. She again said \"no\". Not sure if she's a bitch, or racist, or both.\n\nI went across to BBQs and asked the same question and they couldn't get the bag fast enough. I told them what happen across the street at Apollo and they apologized to me for being treated that way.  She is very foolish, I only support Brooklyn business's and I'll make sure everyone knows about this.  Think twice before giving this woman and restaurant that supports her any mother.", "author": "Alia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-12", "description": "Its a diner serving diner food. When im in d area and in need of something ro fill me up. Ill stop by but not going out of my way to go there", "author": "Dinah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-21", "description": "A few minutes ago, while eating a delicious veggie omelet and home fries from New Apollo Diner (the closest diner to my job), I decided to check out the Yelp reviews. In a sea of solid 3 star reviews I see a 1 star review where this lady is complaining about finding hair in her omelet.  As luck would have it, as I go to take my next bite I see something stick straight and black poking out... I thought *no way, couldn't be!* When I pull it from the omelet, it's a coarse stick straight black hair. I'm SO mad.  The people are friendly and the food is tasty, but now I can't bring myself to finish it or look at it.", "author": "Mary G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "Super expensive for mediocre food and the host refused to let me use a booth despite the place being empty.", "author": "C S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}