{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "My ratings for diners are on a different scale from other places. And really should be judged on 4 areas: Friendliness, freshness, Fullness and fun. And, on those counts, New Apollo scores an A+ in all areas. I love the staff...and i always leave totally satisfied (for the rest of the day).", "author": "Shira R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-03", "description": "I side eye all you people who go to diners and order meatloaf or something inane like that and \"are shocked, just shocked!.\" that it tasted as good as diner meatloaf can and will taste. Diners should be judged based on different criteria. \n\nThat said this place is pretty pathetic. I really wanted some of those Great Grains pancakes from IHOP so me and my friend made the journey only to find that it was closed. So we settled here. Truthfully nothing here was bad. Eggs, home fries, toast - pretty hard to screw those up. Whole wheat pancakes weren't good but definitely edible. Halfway through eating I looked at my friend and said these aren't diner bang for your buck prices. We could have easily gone Down Smith street purchased the same amount of food for. 2-3 dollars more and enjoyed it exponentially more than this ambiance deprived dreck. \n\nSkip it. Better value and quality to be found elsewhere. And this place is hella busy as well.", "author": "Raya F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "Nothing bad to say about this place, recently renovated, great service, great food I come here all there time, and the owners are great people", "author": "MIKE S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-25", "description": "Ehhh...\n\nPlace is a straight mad house during the lunch rush. \n\nBecause of that, the service and food isn't the greatest. Matter of fact, the food is \"okay,\" but the service seriously sucks. The waiter took forever to take my order. Took forever to bring my food. Took forever to bring my check. \n\nGot it? Yea....ummm, I'll skip it next time.", "author": "Edgar S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-13", "description": "I LOVE this place. The menu has an overabundance of options, which is at times a little intimidating but I have never had anything here I didn't absolutely love. The owners are incredibly friendly and always behind the counter at lunch, greeting you with a smile. I work around the corner, and I'm always able to get in and out within my hour allotted. Most places in NY are not too thrilled about splitting checks (which I still don't understand), but this place is always accommodating, and we generally go in with groups of 4 - 6.", "author": "Anne-Marie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-18", "description": "Once again, the only time I visit a diner is if I want breakfast in the middle of the day. And on that note, New Apollo Diner doesn't disappoint.\n \nThe service is usually quite fast. That's why I come. I generally visit on my way from my job's medical department and I need to be in and out so that I don't go over my allotted travel time. I can get and eat a full breakfast in about 20 mins. Pretty good.\n\nBreakfast is pretty hard to screw up. So it's good overall. The only thing non-diner about this place is that they hawk some kid's fundraising candy at the cashier rather than nice soft mints. *Sigh*", "author": "Karen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-27", "description": "Disrespectful owner...I have eaten here many times but yesterday I went with my best friend who flew in from Texas and is pregnant. We asked for a table, man said 5 mins, I said ok, going out for a smoke while we wait. Long story short, my friend had to use the bathroom and he said not until she pays for something  and told her only if she had a medical condition, she showed the sono (which she JUST had taken) when I came in he said your friend didn't want to sit, which was weird because she kept saying she was tired and hungry, so I went to ask her....she told me what happened and when I asked him why all the trouble he yelled, I asked for the owner and he said it was he, which I found hard to believe but whatever....I WILL NEVER BE BACK AGAIN....wish I could give a negative star #", "author": "Tenaya G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Love this diner. We come here all the time after church. The entire staff is great. Always extremely nice and helpful. Typical diner fare     You can't go wrong with breakfast. I tried the whole wheat waffle for the first time today. Pretty good. Not as delicious, light, and fluffy as the regular waffle but still really good.", "author": "Lenny W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Used to go here alot in the 70's and never had a bad meal. I went here a few weeks ago and what a pleasant surprise to see and taste that it is still on point. The menu has a great selection and everything we had was perfect. Definitely worth a visit and I will be back.", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-01", "description": "Breakfast is pretty easy, but what can I say - I had a great experience.\n\nI ate solo, so no cramped table. Ordered 2 eggs scrambled, homefries and toast, and coffee. Coffee was refilled before I could finish a cup, and the eggs were out before I could pull up Facebook on my phone. \n\nEggs = great. \nHomefries = decent. \nToast = hard to screw up.\n\nStandard breakfast, standard diner experience. Fast service. No waiting (I went at 10:20 am on Sunday - any later and it's jammed). Nice staff. \n\nI'd go again.", "author": "Dos T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-14", "description": "your run of the mill diner, eggs \u0026 home fries were good but corned beef hash was poorly seasoned \u0026 thus i wasn't able to finish it, very unappetizing the way it came out...if you order coffee expect 3-4 different people asking if you'd like more every 15-20 seconds...staff is otherwise pretty gruff", "author": "Larry B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Think of exactly what you want in a diner, then make it affordable, renovate the inside, and add pretty great service. This is the New Apollo Diner. Food was delicious and fresh. They have just about every kind of food you could possible want. The inside is bright and clean looking. Fantastic. I may catch myself making thee trek from FiDi to Brooklyn just for the Apollo.", "author": "Dan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-04", "description": "As a Greek-American from Central New Jersey, Land of Diners, my people are Greek Diner People. Coming in the door, New Apollo Restaurant is decked out with the obligatory white statue heads and Greek island wall hangings. MY PEOPLE.\n\nThe menu is enormous. ENORMOUS. They have daily specials, and generic diner sandwiches, and they also have an extensive selection of Greek food. ...MY PEOPLE!\n\nMy boyfriend teases that I spend so much of my energy hunting down Greek food around the city and so much energy being disappointed. \n\nWhile true, I have learned from ample experience not to expect too much. I am fully cognizant that Going to a Diner to Order Greek Food is seriously hit or miss while Going to a Diner to Order Two Eggs Over Easy With Homefries and Sausage Links is almost always amazing. That said...the food here was really pretty awful. What can be said is that the portions are HUGE and cheap! The daily specials are often mutli-course meals with a really great salad (ok, half of it was red onion. My people, you understand...) and a slice of cake from an enormous selection of cakes rotating in a glass. Generous! \n\nHowever, all quality of relative Greekness aside, my boyfriend's plate was dry with tomato sauce from a jar, and my plate was cooked in way too much oil and greasy. Our food just this side of the line between \"OH MY GOD THIS IS SO GROSS IT'S INDULGENT AND AMAZING\" and inedible.\n\nAs my Jersey instinct wins out always, I'm sure that I will be back for cheap diner food. Also, lousy food or not, I have such affection for the over the top Greek decorations. Feels like home.", "author": "A S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "There food is always good. They have nice ppl and fast service, but they are expensive.", "author": "Redgem M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "This is a typical diner as far as food is concerned, but they get you with all kinds of added prices. Do you want decaf coffee instead of regular? You are going to pay more. Want poultry sausage instead of pork? It's extra. There are all kinds of extra fees, but overall it is cheap. I was there for breakfast, so can not review lunch or dinner. While it is nothing great, it is not bad. Not too greasy. Surprisingly the coffee was good. I rarely say this about restaurant coffee. The combo meals are priced very well complete with juice and  coffee or tea. Not sure if I will come back. Not because it was bad, but because there are so many more places to try.", "author": "Duane S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "we only did delivery...so can't say much about eating at the place..\n\nThey have daily specials on the menu.\nwe ordered:\n\nGreek Salad: not bad\nBaked halibut: not bad with tomato sauce over rice - huge portion\nTurkey Soup: so-so\n\n\njust a standard diner food...nothing special", "author": "Grace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "Stopped in her for breakfast before my sisters soccer game at LIU.\nThey had plenty of breakfast options but I was in the mood for something other than the standard eggs and bacon, so I decided on the bagel platter for 1.\nBeing from Detroit I'm not the best judge of bagels and lox but my bagel platter was delicious.\nIt came with a fresh plain NY bagel (I'm assuming baked in house as all their baked goods are) with a HUGE slab of cream cheese, a pile of smoked salmon, lettuce, tomato, olives, onion, and cucumber.\nEverything was fresh delicious and since it's a platter I had fun playing with all of the toppings creating different bites.\nPlus the platter was VERY affordable especially for NY standards.\nMy families breakfasts looked delicious as well- especially the bowl of fresh fruit.\nNone of that filler cantaloupe crap, fresh strawberries, grapes, blueberries- the works!\nI would definitely return when I'm in town.", "author": "Kristin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "I've passed this place by a bunch of times. I'm not really a fan of diner food or decor. But recently I was going from 120 Schermerhorn to 350 Jay and only had a small window of time in which I could eat, so Apollo Diner it was (since it was on the way). Clearly, my expectations weren't high.\n\nLet me tell you, this place has the best home fries I have ever eaten. EVER. They were that good. I had the side order, it was $3 and it was enough as a side for 4 people. \n\nThe seating is cramped, as another reviewer mentioned, but the service was fine.", "author": "S R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "I'm not going to stay away from this diner they have all the best of every thing there and whatever you chose on the menu you decide .", "author": "Tonia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "Huge menu.  Great breakfast wraps and we all shared a plate of pancakes.  Good stuff!", "author": "Jason G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}