{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "This place looks amazing after the renovation. Food is pretty good for a dinner and their portions are big. Service is ok.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "New Apollo is your standard diner. The new renovations really allow much more room for serving customers with larger parties. It was packed Sunday morning (the after church rush crowd), but we were seated quickly. It would be nice if they were 24 hours still, but still a great place.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "Amazing for breakfast, lunch, or dinner.\nAlways seated promptly and host or hostess does check in at least once after the food gets to the table.\nAll the items I seem to order are able to feed to really hungry construction workers.\nThe liver and onion dinner option blew me away as far as presentation, texture, flavor and how big the portion was especially since it came with sides.\nThe combo Greek platter is huge and extra homemade tzatziki is a definite must.\nThe hungry man/beat breakfast platter is my go to when hungry and need to eat...\nFast, courteous service with a smile.\nThis is just a hint of what to expect...they always surprise me in a good way...\nOh check out the desserts on your way in and get some to go.", "author": "Papilindo C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-27", "description": "I usually never write reviews as I'm dining.. I typically wait and do them while commuting to work, but this place irked me a little. It's a Monday morning and I decided to take a mental health day off, and venture to the gym, then afterwards decided to get a bite to eat at the diner.\n\nI browse the menu and opt for choice number three (two eggs, juice, grits, tea, and whole wheat toast) for $4.75 sounded like a good deal. The server didn't seem to welcoming or interested in his job, but hey, maybe he has a case of the Mondays. The food comes out rapidly and I am ready to dig in. I grab for the toast and notice one of the butters on the plate was open and used. I guess they just take condiments from people's plate and re-use them. \n\nMy second issue is the food itself; the eggs and the grits are not very good. The grits don't seem well cooked at all and the eggs are equivalent to McDonalds. \n\nAll and all, this place needs to work on the customer service and the food. It's doubtful I will ever return here.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "This is a dinner. The menu has the usual sorts of dinner food. Open face sandwiches, pastrami, burgers, pasta etc.\n\nOpen well lit space with the usual banquettes along the wall. The service is quick and the food was perfectly fine for a quick brunch, dinner or lunch without the wait. Simple as that.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Each time I come here I have an amazingly large \u0026 delicious meal! The food always comes fast \u0026 it's very fresh. I usually come for breakfast with my boyfriend and we've never had to wait to be seated. The waiters are so attentive, your drinks are never empty \u0026 they make sure you have everything you need.\n\nBreakfast food is probably what this place does best - the omelettes are what I usually get - and they come out in less than 10 minutes each time. I've also tried the pancakes which were good but as sad as it sounds IHOP holds a special place in my", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "Convenient and standard diner fare. Food came out quick for a party of six.   Breakfast was good, but ensure you clarify portion size.  I thought I was getting a side order of home fries, but I received enough for two.    They do have turkey bacon options in lieu of pork bacon and the wait staff is very attentive to your needs. I recommend, but I am not the biggest breakfast person.", "author": "Jay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Staying at the Brooklyn Hilton and got tired of the same breakfast every day. Diner just 2 blocks away and wanted some good old fashioned Challah French Toast. It didn't disappoint- excellent thick eggy french toast! Crispy bacon as requested and excellent service with a smile. We'll be back!", "author": "Jeff B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "This place is a pain in the ass. The menu makes no sense. If you order a burger,the lettuce, tomatoes, onions etc are not included. We're not alone in thinking this is ridiculous. The table next to ours asked about the extra charges on their bill and the hostess came over and yelled at them. Aside from the hostess, the staff are friendly but very slow and our guy forgot to bring out part of the order. Bathrooms were gross.", "author": "Kim D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "We had a very nice waitress..pleasant and accommodating. \nThe chicken soup was very good. My roast beef dinner was good...but dry. Had been under the lights too long and the edges that weren't covered in gravy were hard and dry. There was cabbage and carrot but no sauce or flavoring on it. The mashed potatoes and gravy were great.\nEgg cream was so good I stopped in the next day for another.\nWe also had muffins...one choc chip and one blueberry. Both very dense and dry. Disappointing because they looked great.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-25", "description": "Disappointed in this place. I came here on a rainy Sunday morning waiting for my gym to open. I sat down and soon after me several couples filed in getting their breakfast before what looked to be their religious service. I overheard customers saying \"Geez...nobody wants to serve us?\" Since I was done, I walked up and told the servers and manager...you have several families waiting to be served...they have been here for a while. They looked at me with a rolled eye and made no moves. Terrible customer service. Never getting my money again.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-07", "description": "It is a clean, and friendly diner with a nice accommodation. However, when it comes to the food that was ordered I could say rather disappointing. It cannot call itself greek when it can barley cook a proper gyro and serve it with proper tzatziki. The gyro was falling apart, and the pork was not well cooked. As for the tzatziki, it was a foam like composition and it's taste was awful; far from what traditional tzatziki tastes like. It can do better.", "author": "Mary R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-07", "description": "I pass by this diner every Wednesday and Friday night. I have not stepped foot in this diner until NOW. The decor is very relaxing and music that was being played is a good mix. So this gets one star.\n The waitress comes over after 10 mins. She never told me her name. How does staff expect to be praised by good service. So with that being said. Zero stars for the waitress. \nNext is the food. I ordered the chicken parm platter. I got chicken noodle soup for starter. I have to say VERY DISAPPOINTING!! They definately have salt in it after i was told they dont put salt in it. So its probably vendors. The  noodles HAHAHA! What noodles. It was bits of noodles. I talked to the manager who happened to be URSALA. She was very condensening. So i cancelled the whole order. I have pictures of the chicken noodle soup so i am sorry no chicken parm for me. Maybe i should go to a pizza shop.", "author": "Giselle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-05", "description": "Been here almost 5 times, each time it took them at least 10 minutes to take my order even when the restaurant was not busy. But I've noticed that the white customers were served speedily. No coincidence that most (of course not all) of the white reviewers on here have the place at least 4-5 stars, just scroll and see for yourself.", "author": "Abigail T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "The best STRONG COFFE IN BROOKLYN \nI wish I can give million stars but yelp aloe only 5", "author": "Lenin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-10", "description": "Pretty much a typical NY diner.  Service was a little slow.  \n\nWe ordered the bagel platter for one and eggs over easy with toast and sausage.\n\nI requested an everything bagel, not toasted for the bagel platter.  When the platter arrived, plain bagel and toasted, not what I really wanted but wasn't going to send it back for that.  Really generous portion of smoked salmon that was very fresh.  They serve it kind of odd, cream cheese on one half of the bagel, salmon on the other half.  But nothing that a fork and knife can't fix.  Wish they served it with red onion and capers or olives I do like those added ingredients, but I still enjoyed it.  It is served with cucumbers, tomatoes, lettuce, and thousand island dressing which I think is an unique touch, that I enjoyed.\n\nEggs over easy were cooked perfectly.  The sausage that is served is amazing.  It is house made and has the just amount of spice to it.\n\nNot a bad place for breakfast, lunch, or dinner.", "author": "D W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "I love me a little divey diner. I use to work in this area and knew this place was just what I was looking for at the early hours of the morning after a bender! It's just that super cheap and guilty pleasure the stomach craves. I am not a party animal but when I do stay out past my bedtime this is the cure. \n\nThere was plenty of seating the first time I went. I did happen to go at the crack of dawn. The breakfast special number three is the route I like. Juice, potatoes, 2 eggs (over medium for this chica), toast (rye is what I want) and a good 'ol cup of coffee. I got plenty of refills. And the cream comes in those tiny little containers. It may not be the best coffee ever or the organic/local route but sometimes you have to get real and get back to your roots. \n\nWarning: I came here recently and when church was out the place got bananas and there was even a line forming. I would suggest coming here not during the church breaks.", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-21", "description": "We came here after visiting Brooklyn Tabernacle one Sunday afternoon. The food came out fast, but was very underwhelming. I ordered the french toast, with eggs and a side of ham. My sister ordered silver dollar pancakes, and my father ordered a spinach and feta omelette.\n\nThe omelette tasted like feta was the only flavor they used to season the eggs. The french toast was very bland, and the ham on the side was really two slices of processed deli meat that was charred on the grill. My sister received 20+ tiny pancakes, varying in all shapes and sizes, and plopped on a plate.\n\nThe weird thing to me were the coffees. The unflavored coffees were bottomless. Flavored coffee wasn't. Whatever. BUT they gave us two cups of unflavored coffee, and one little pot of flavored syrup...... so why not just sell the syrup on the side and let me order bottomless coffee? *rolls eyes*.\n\nWith all of the amazing potential NYC has for brunch spots, I think I may have to pass on coming back.", "author": "Angel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "There French toast is everything. I'm currently debating if I should go down there in a uber for some", "author": "Jimmika R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Service was great. Food was horrible. My children for the first time didn't eat their food.", "author": "Nicole G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}