{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "We arrived on the train from DC and were hungry.  This place fit the bill.  It's not fancy, but it fulfills expectation of a diner. Very friendly and fast service.  Tasty food.  Whit you'd expect from a diner.  We are going back for breakfast tomorrow.", "author": "KEN K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Great spot to have a good breakfast, lunch and even dinner. Won't break the wallet and you do leave full and satisfied as the portions are very generous. Wife and I did burgers this visit along with mozzarella sticks and shrimp cocktail. All were good, especially the size of the shrimp. Next time, they have to remember to serve the shrimp cold, but was still good regardless. Of course, will be back.", "author": "J A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "We're in town visiting relatives and friends. We had breakfast the previous morning in the hotel which was miserable. Cold, oily and ill prepared. But I digress. This morning we had eggs Benedict. The food was delivered hot, fast and the order was correct! The eggs were perfectly cooked and the hollandaise was spot on. The English muffin was not the brand you'd find in a store but it looked like either they make it or it is made for them. I had fries with breakfast and they were very good also. The only negative was the knife and fork were pretty cheap but we made do. If you are looking for China plates and sterling silver flatware, move on. If you want a delicious breakfast for a reasonable price delivered hot this is a diner for you.", "author": "John B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-13", "description": "Mmm, gyro plate.... tons of gyro meat and a nice greek salad. A bit on the pricey side since I got the plate rather than just the sandwich.\n\nI had a lot of fun watching the pies spin around and around but by the end of my meal I was too full to try that cheese cake. Maybe next time I guess.", "author": "Franklin D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-03", "description": "Let me start off by saying that I only came here because to my disappointment Dallas BBQ was packed beyond belief with an estimated wait time of at least an hour and a half. No thanks. The closest thing was New Apollo Diner, and after being charged a whopping 10 bucks for one hour at the nearby marking lot, there was no way we were going anywhere else.\n\nThat being said... kinda wish we would have just taken the \"L\" on the money spent on parking and gone anywhere but here. The menu was packed with options, none of which sounded the least bit appetizing. I settled for a chicken breast sandwich, after all, how can you mess that up right? ... WRONG. The meat was very dry,chewy,  and you could tell they used cheap sliced cheese. The prices were HIGH, not what you would expect from a diner. Honestly, we probably would have been better off with going to IHOP up the street. \n\nThey get 2 stars instead of one because the customer service was good.\n\nWill not return", "author": "Marla B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-23", "description": "Pretty standard issue diner.  \n\nIf you're coming for breakfast, you can get a better meal for the near the same price at any number of nearby restaurants on Smith.  \n\nIf you want a standard issue diner experience, this place fits the bill!", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-03", "description": "I know it's probably wrong to write a review if you've only eaten the desserts but their rotating cheese cake and pastry display right in front always beckons me and I've tried a number of them. \n\nThe cheesecakes are usually incredible. I would say with confidence that on occasion I've eaten cheesecake here that is the best I've ever had. However....on other occasions I've had the cheesecake taste like refrigerator air...and was very disappointed.. Why?!?!\n\nAnother diner classic, their almond horn, is also really good. Sticky outside, soft and chewy in. Yum.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-05", "description": "Food here sucks. Stopped by here for lunch with a friend cause this was the closest diner to school now since Celeste is closed. I ordered a turkey burger and it was completely dry! No flavor at all. Service was slow and sucked too. Staff on the other hand was very attentive with my friend's coffee... Everything else was just not good. Come here for other food items on the menu. Don't get a burger here. Ain't worth it.", "author": "Bonnie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "Everyone should have a diner like this in their neighborhood. Great, quick service, fresh food, expensive menu, recently priced, I can't say enough.\n\nAs far as food is concerned, the eggs I got were a very generously sized portion.", "author": "Ariel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "This is the spot for my friends and I. We go to school nearby and if we need some food in our stomachs this is where we go. It's always crowded around lunch time, any time honestly, given the location. The food is typical diner food. The first time I ever came here I got the Moussaka which I had never tried before. Very good and filling; I couldn't even finish it. The Boss Burger is the way to go. The Turkey burger is pretty dry. Milkshakes are awesome (one of my friends is a somewhat of a milkshake connoisseur and he loves them here). Don't get the cheese fries. My other friend ordered one time and it was just a slice of american cheese not completely melted over some fries. Very disappointing. \n\nIt's just an awesome place to hang out. The food isn't great but not bad either. Service is wonderful. Everyone is so nice here!", "author": "Glenylis P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "Had a nice late evening meal. Very good gyro. Pleasant service.", "author": "Karl B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-10", "description": "Nasty person at the register! Charged me $2.00 for tea wanted .35 for honey! Keep your fckn tea! I just needed to use the rest room!", "author": "Linda S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-30", "description": "This is a no-frills straight forward diner. My boyfriend and I were hungry and IHop on Livingston closed down so we walked in the other direction (we craved breakfast that bad lol). The staff was friendly, the food was fresh, and the prices were good. I will def come back when I am in the area and I'm in the mood for eggs and pancakes.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-11", "description": "Hi all,\n\nUsually I hate leaving bad reviews, but...... This place is RACIST!!!! They treat black people like second class customers. They sit you at the back. Then act like you are too short to notice, or too black to see. I sat for about 20 minutes before getting up to leave. The waitress didn't even apologize or anything. She just watched us get up and leave. It took a customer that came in AFTER us to tell the staff that we were there.\n\n\nI'll give the owner/manager this....He is very nice and professional, but that needs to translate to his staff. The staff, predominantly hispanic, are RACIST. I have seen time and time again them act nice to any Hispanic, or any ethnicity of lighter complexion, so nice. But let it be someone African American, NOPE!!\n\nIts 2014...the color that matters is green.\n\nDisappointing.\n\nBLACK PEOPLE DO NOT SPEND YOUR MONEY HERE.", "author": "Patamon N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-21", "description": "Good for a quick cup of coffee. Today is the first time I ordered breakfast not impressed. I usually have lunch when I eat here. The service is quick and attentive. The environment is clean. The menu is extensive and can be very pricey even for simple items. Check it out if your in the area. I wouldn't suggest you travel out of your way.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-31", "description": "There was no wait to get in and also the waitress was quick.  We got a nice booth on the corner next to the windows.  I enjoyed my bacon, cheddar, and egg on honey wheat wrap.  It was hot, flavorful, and delicious.  It made a great breakfast for the brisk, cold day before the hurricane.  :)  I would definitely come back.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-24", "description": "Last monday i had a spinach omlet for lunch. It was pretty good. By that afternoon i was so sick. I was in the bathroom all night.... i didnt have any thing else that day so it had to be this place....I doubt very seriously that will eat here again", "author": "Phylicia K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-21", "description": "Came here once, and i won't go back. Sure, i can rant endlessly about this place, but i rather not. It's better to be silent, and let the world continue its circle. This place is beyond words, and will be the end of this era we call life.", "author": "Marina F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "Disclaimer: I only had a piece of pie and my friend only had a beer. \n\nWe stopped at New Apollo with the intentions of visiting a local bar, but after walking the Manhattan Bridge we were too pooped to go any farther. So we came for a bite before heading back home. I ordered blueberry pie (which was made on site) and he ordered a Budweiser. Obviously a Budweiser is a Budweiser, but the blueberry pie was pretty subpar (majority flavored jelly, lacking many actual blueberries). It was also $4, which wasn't really worth it. The prices for other items were pretty steep for diner food too...\n\nAlso, the service was crappy. They looked genuinely unhappy to serve us. But the manager thanked us for coming in as we left and it was a clean, peaceful diner environment amidst the bustle of Brooklyn Heights. \n\nIn all, it wasn't a terrible experience, but I wouldn't be rushing to go back either.", "author": "Alyssa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-08", "description": "The food was pretty decent. It was the service that made me give this diner two stars. First, the waitress came over to take my order from behind another table. After she took my order and gave me my food, I didn't see her at all. Second, I did not get a refill on my coffee once. I had to ask another waiter to fetch my bill.", "author": "Angie M."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}