{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "I was at Housing Court across from the New Apollo Diner. I had been there on numerous other occasions. I still find it to be the Best Diner in Downtown Brooklyn. I like the ambience of the Diner, very customer friendly and the dining areas are open which gives the customers \"space\" to eat. \nI had the Mushroom Burger Delux which was very tasty and sumputous to eat. The only drawback was the A/C was on to high and even though the outside tempature was 80°, it was colder than that in the Diner. The other drawback was the Ketchup Bottle was empty and never replaced as I suggested. Go there for the food and atmosphere, I am sure you will enjoy it just as I have.", "author": "Joseph W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Went here for Sunday brunch. The diner was crowded but we had no waiting for seating. \nThe 'new' is still evident with the decor. Very inviting atmosphere.\nService is good. \nI ordered the Chinese rice with chicken. I should've bought all my family. The serving was huge. BUT, it was also delicious!", "author": "Steven M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-22", "description": "walked in starving... left hungry.   The customer service is AWFUL!  The hostess, whom I will refer to as URSULA (the fat evil sea witch with white skin, red lipstick and jet black upside down nike sign eyebrows from Little Mermaid movie) looked at me replied  \"YOU STAYIN' OR YOU GOIN?\"   \n\nDid I say I was starving?  cuz I swear it took everything out of me not to reach for Ursula's neck!  So I called on Jesus and he told me sit down and eat before I got out of character.\n\nI sat down and ordered breakfast food.  The guy who took my order brought my food to me within 10 mins.  I only ate my eggs and toast.  My coffee was bitter and my bacon was as cold as my ice water!    But I couldnt complain to my server because he never never came back to check on me.   EVER!!  And they have the nerve to expect tips?  sigh\n\nSpeaking of tips, this place is CASH TIPS ONLY.  I dont carry cash so I actually left without tipping.  I went to the drug store, got cash back - went back and tipped my water lady because she was the only one there who was nice to me.\n\nI ended up taking the pancakes and cold bacon to-go and placed it next to a homeless man sleeping on the 2/3 platform.   The server, service and Ursula all sucked.", "author": "Mia D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "I decided to drop by for a quick lunch about a week ago thinking the food would be delicious. You really can't mess up turkey burger and all American French fries, right.  Boy was I wrong.... This turkey burger was next to the worst turkey burger ever. The turkey burger was undercooked and gross. The French fries were okay. The waitress was excellent, so she got a great tip... I had my food packed to go because I didn't eat anything but the fries. As soon as I got to a waste can, I threw it out....", "author": "Vanika M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Food was good.Service was prompt and efficient.Portion size huge had to bring food home.Nice and spacious even when sitting near other patrons there is still plenty of space.Kinda pricey for a diner however but def worth a visit.", "author": "Lucius J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "The one star is because I had to put a star rating. There was hair in my food and when I stated it the waitress was beyond annoyed and rude. With no desire to eat my  food after seeing the hair in my food I spoke with the manager who told me they will not take fault once food is on the table. He said it could have been anyone's hair!!!!!! This is my first time and last time at this terrible dinner", "author": "Kat C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-23", "description": "Nice menu selection, huge portions. Enough to hold me until Thanksgiving Dinner. My partner in crime loved the coffee, he had 3 cups. I liked how the menu was set up, it was easy to make selections. You chose Eggs or an Omelette, then a Protein with toast and fried potatoes included. An order of Challah French Toast easily feeds 2-3! The hotel recommended Apollo because it was in walking distance. If this diner was in my neighborhood I'd be a regular!", "author": "Kenya H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "This morning I had a good hearty meal. I always knew of this place whenever im around Downtown Fulton area so i finally decided to get breakfast that consisted of corn beef hash, 3 sunny side-up eggs, home fries, and 2 pork sausages. Everything was well prepared. Not salty, nor greasy. The only issue i had is with the price which came to about $16.00; However it was a hefty amount of food given. In fact, I could barely stay awake during my morning shift at work.  lol... Nevertheless, i might be going back tomorrow morning depending on how I feel about spending my money at the moment... Oh yeah and because of my DIET. How do i keep on forgetting that I'm on a diet? *Shrugs shoulders*", "author": "Chanelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "I have eaten there for ten years now. It's close to where I work. The food is consistently great if you order diner-type food (e.g. hamburger). I have not tried their dinner specials. The wait staff are very pleasant.  When it gets busy, your waiter or waitress may pass you by BUT I ask the staff to go find my server to pay the bill. I've met the baker and I've only had a stale piece of pound cake once. The owners are exceptionally attentive to regulars. They are always patient with all customers. I have never been rushed from the table no matter how crowded it got. They are especially kind to the disabled.\nI have some tips: always ASK what's in it if this is your first time ordering it. If you hate pickles, have allergies, ask about it. Never ASSUME that item will NOT show up on your plate. If you need to leave your seat, let one of the staff know you'll be right back. You'll never lose your stuff that way.  For me, it's one of the last great diners in Brooklyn. 100% better than Junior's.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "Ordered turkey dinner since I'm solo today (new to NY). The turkey is moist, gravy is well seasoned, mashed potatoes have good flavor and moisture, cream of turkey soup is amazing, stuffing is a little too sweet for me (made with apple, just a preference not bad taste), salad had great elements  (onion, green pepper, carrots, cabbage and iceberg). Also it came with a delicious slice of strawberry cheesecake. Best of all the portions were for 3-4 so I have leftovers! I'm super impressed with delivery time (20 min), flavors and portion. Not like home but excellent none the less!", "author": "Vanessa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "As most reviews states this is a typical NY diner. I am a fan because when I was pregnant with my son I always ordered the turkey burger deluxe. We've moved away since but when we do come to visit I make sure we stop by and order our turkey burger deluxe and to my surprise my son loves it. Memories I guess (lol). \n\nI also like their breakfast. :-)", "author": "Vonye B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "The service here sucks. The waitress came once, and literally abandoned us... she brought part of our food, but forgot some stuff. We had to call 2 other waiters to bring the missing food. The food was good.", "author": "Pedro O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Very good restaurant!\nI have eaten there twice time.\nThe prices are fair: Not too high, but not too cheap.\nThere is a menu including a salad, a soup, main dinner and desert for $ 16,95.\nYou won't go home hungry.\nAnd everything is housemade.", "author": "Daniel E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "I love this place!  Came here for breakfast and back for a late dinner one day.  Our breakfast came out fast and to our requirement (no onions).  Service was attentive and I thought the price was fair for the area.  My dining partner was underwhelmed with his pancakes but he lsaid they were just okay.  \n\nOur dinner though was great.  This place has an extensive menu - extensive.  I got an eggplant sandwich with my choice of bread.  The eggplant was cooked perfectly though I would have liked more sauce.  It was on a soft roll and served with cole slaw and a pickle.  I ordered a side of potato salad as well.  First off, there was a ton of food.  The side order of potato sald was huge.  It was a little bland but it was homemade and made with real mayo.  And we added some salt and pepper and it was fine.  These types of foods are so esoteric anyway.  My dining partner got a wrap with mango, avocado and vegetables and his order came with fries.  He loved it.  We also took a slice of lemon meringue pie to go.  It was massive with a good 3 inches of meringue and lemony curd.  \n\nThis is a Greek diner.  You can have things your way if you tell them.  We got excellent service each time.  The evening manager was very friendly.  The owner was very friendly.  Is it perfect?  Yeah, the coffee is a little too strong, the eggs weren't perfect but they put out a consistent meal each time.  If I want a 5 star meal, I don't go to a diner.", "author": "L. R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-01", "description": "Don't go here if you want a true hot meal to go. They will rush your food out quicker than McDonald's. Bacon egg and cheese sandwiches comes out cold every time. Go to the deli next door for a true warm breakfast sandwich in the morning for half the money and better taste.\n\nBread - rock hard\nCheese - straight out the fridge hard\nBacon - like a slim jim\nEggs - slightly warm but not completely cooked", "author": "David V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Excellent service and great food. I love the staff especially Rosie, Ceasar, and the owner. All are very kind. I've been eating here for years and bought all my family and friends there. They love it too. Would highly recommend. There has been a price increase due to their recent renovations but for nice service, delicious food and clean bathrooms, you can't beat  it!!!", "author": "Dara K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-16", "description": "I love diners, but this was very disappointing. It took 10 minutes to be greeted by a server, who we barely saw during the meal. I felt the busser should have received the tip, as he was very attentive. The food was bland, and I found a hair in my omelette. It happens, but on top of the other things I wasn't pleased. Decided to give the baked goods a try to end the meal on a possible high note, but as I tried to break off a piece of my pastry, it was so hard it cracked- completely stale and dry. The dining room was packed, so I'm sure it has a loyal customer base, but I won't be back.", "author": "Meredith S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-27", "description": "Definitely a decent diner with good seating, atmosphere, bathrooms and menu.  Service is pretty good and it's right near Kings Civil court.  Works for a quick lunch and they'd likely let you charge your phone if you've got an iPhone.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "Not bad for a diner.  Very nice on the inside especially for a 24 hr place.  I have a soft spot for Greek diners.\nThis place was good but a lil pricey.\nI had the Chicken Souvlaki \u0026 fiancè ordered cheeseburger deluxe.  Both were good...the food was hot \u0026 fresh..the chicken was well seasoned but the tzatziki was bland \u0026 needed seasoning.", "author": "Connie O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "Ever since the renovations the food seems to taste much better. Service is still okay. Our waiter didn't seem very friendly but he wasn't rude either. I had the fish sandwich looked small but it was enough to satisfy me for the afternoon.", "author": "Laurel R."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}