{"aggregateRating": {"reviewCount": 179, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-24", "description": "I went there for dinner last night since Dallas BBQ was packed.    Overall, food wasn't too bad, but this is NOT the place to go if you cannot step in their door by 8:30pm....  So we got there at 9pm and was NOT told they will be closing at 10pm.   \n\nAfter we got seated, the waiter didn't even wait 2 min for us to order our food... That's when he said (somewhat rude), \"kitchen close in 10 min, you need to hurry up\"... Fine, we respect their business practice....\n\nI had the shrimp parm while my husband has the dinner special which includes soup, salad, entree and desert.  The whole time no one stopped by to clear the dishes from the soup / salad, no one refill our water...etc...  We finished our food at 9:40pm and waited and waited....   FInally at 9:55pm some other waiter clear our table.... We ask for the dessert (which was INCLUDED in the dinner) - guess what, that same old waiter said \"No dessert, we closed\".... At the time, there were still 5-6 tables left.....Seriously?   \n\nDon't get me wrong, I respect their business practice in closing at 10pm... Don't blame the customer if they failed to attend to meals...  Use some common sense wouldn't hurt.   \n\nAlong with that rude service, I never return to this restaurant....", "author": "Honest R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "If I'm here, something bad has happened. It's a block away from Kings County Criminal Court and across the street from Housing Court. But in times of need, New Apollo delivers a very good version of classic coffee shop comfort food and quickly. The cakes spinning temptingly in the front display are always fresh, with props to the chocolate marble cheesecake. The burgers are good and the extra-crispy bacon that came with my over easy eggs yesterday was perfectly well-done.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "Food was good for a diner,  but overpriced . Large selection on there menu . Clean establishment", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-14", "description": "Today was our first visit and boy I hate to admit but I would not recommend this place to anyone. I orders the bbq ribs with rice which came with salad and soup and dessert. Soup bowl was super tiny...Wow looked ok and quite a few pieces of ribs but when I bit into the ribs... total disappointment. It was dry and tasted old. The salad was ginormous. I called over the waiter which was very polite and asked to change my order. I opted for the meatloaf. I've definitely had better. We also had ordered Bolognese and fetuccini wow horribly drenched in oil. When we for a second time called over our waiter he said we would have to speak to the manager, which at this point wasn't an option being that it was our second complaint. She came over and we explained and showed her the oil under the pasta.. she rudely said it's from the meat. Never have I eaten a plate of pasta drenched in oil. Wow she asked if we wanted to replace it. HELL NO. And to think we still had dessert to go. We asked for it to go. I ordered the strawberry cheese cake and my child asked for the chocolate cake. Which was actually chocolate mousse cake. Which was blah.. and the cheese cake wow another frigging dissatisfaction. Please fix up the food and we might change the grade. Lol which we won't be around to taste it. Sorry for the \"Cook\". Embarrassing.", "author": "John D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-06", "description": "This diner did not impress me at all. The food was overprice and taste like cardboard. So i won't eat here again. And the service was bad. I got a western omelet and it taste like western crap. So don't go here", "author": "Hector S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-24", "description": "I came here today because I'd just \"eaten lunch\" at Sottocasa and left thoroughly disgusted and underfed. So I wanted to get full for very little money. Apollo Diner didn't punk out like a bitch, either. They sold me countless dozens--a hearty pile, in fact--of silver dollar pancakes, a pretty big order of bacon, and a diet coke for less than $12. That's value, brah.", "author": "Pedro S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "I've been to this place a couple of times. Can't complain it's a Chinese restaurant that has been around for years. The food is great and their drinks are fabulous. Very affordable the place is not fancy can not expect the best service when you are eating at a take out that turned into a dine in.", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "I'm a huge fan of diners. Having lived in south Jersey for awhile, I've been to quite a few. Apollo Diner is terrific.  It's a tad pricey as diners go, but the portions are large, the food is fresh, and the service is pretty quick, considering this place is always crowded. One of my favorite places to eat in downtown Brooklyn.", "author": "Lee W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-27", "description": "I needed a quick meal and decided to give this place a try.  Not knowing the quality of the food I figured an egg and cheese omlet was a safe bet.  Anyone can make a decent omlet and the eggs have to be fresh.  Boy was I wrong.  This place can even do an egg omlet right.  After waiting almost 1/2 hour , the order finally arrived.  The omlet had miscroscopic morsels of cheese and the potatoes were undercooked.  When the waiter asked how everything was, I told him the the omlet had virtually no cheese so he called over the manager who not only didn't believe me but was extremely nasty to boot and blamed me for not complaining earlier. Who needs this? \n\nThis place has it all.  Lousy food, poor service and a nasty manager.", "author": "Mark C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-28", "description": "This place is right across the street from the Brooklyn Housing court. I used to eat here whenever I had to go to the Court which was quite frequently in the early 21st century. I had always been satisfied by the quality of service as well the food. Unfortunately after the renovation both are in extreme decline.\nNow the place is cramped, the wait staff totally clueless. This used to be a place with great fresh diner food. What I received as chicken fingers tasted like they were real fingers amputated from a dinosaur ancestor of a real chicken fried in a batter normally used for fish uuuggghhhhh. Jade had Pastrami if that is what you call it suffice to say she only had two bites before she asked them to wrap it up for our cat. When we tried to feed it to the cat she looked at both us with the hurt eyes as if saying \"I thought you loved me?\". I know this is just Diner food  but in my opinion\nI think the cardboard boxes this food came in would have tasted better.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-05", "description": "After wandering through Brooklyn in search of Cake Man Raven red velvet cake only to find that they had no individual servings (cupcakes or slices),  I had exactly 15 minutes left of my lunch hour to eat.  I reluctantly stopped into Apollo, which was right across from my meeting.  I had shared an egg on roll for breakfast with a co-worker from Apollo, which was not bad, but had been looking for something a little more special/interesting for lunch.  Alas, an ordinary Yelp it would come to be.  This diner was packed at both breakfast and lunch time, and for good reason, I soon found out-- it's fast and the food is better than average diner food.  I enjoyed my tuna on toast and french fries.  The takeout took under 5 minutes, so I was back with time to savor every last golden fry.", "author": "L C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-20", "description": "We came here for breakfast one day wanting a change from the normal.  Food is good, nothing amazing, but not bad over.  Cool thing is you can get grits instead of your potatoes!", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-28", "description": "April 27, 2012 around 7ishpm. Seated immediately at booth that holds 6(just me and my cousin Yvonne).\nWe both checked the whole menu but, for some reason zeroed in on a Dinner Special: Broiled Beef Liver with Onions with choice of mashed potatos, baked potato, french fries or yellow rice. Meal comes with Soup(we had Lobster Bisque), Salad, and dessert,and coffee. $15.95 each.\nWaitstaff works very well together and Hostess visited our table a few times which was very nice.\n  Lobster Bisque was tasty and not too thick or too watery just right.\n  Salad with Bleu cheese dressing, had chuncks of bleu cheese and nice and smooth n creamy.\n  Broiled Beef liver and Onions was broiled just right not at all gamey and was fork tender(not HARD) onions were sweet and had a tad of bite left to them.\n  Yvonne got both desserts to go...so can't comment on those.\n  Other patrons were very friendly and we all shared some small talk here and there... great time and meal overall.\nDEFINITELY A SPOT TO RETURN TOO!!", "author": "Chino P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-08", "description": "Solid, basic diner food. Quick service, lots of choices, relatively low prices for large portions.", "author": "melissa g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-11", "description": "so i like to judge a book by its cover...i would have never thought of coming here for drinks!!...a date said they have really good mixed drinks, and guess what?...they actually did haha...so yea i didnt eat anythin but i did sip on some fruity drinks..loved it\ndrinks-good\ndate-ahaha...see ya dude", "author": "Sahara D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-01", "description": "This place seriously deserves ZERO stars.This is THEE WORST DINER FOOD I HAVE EVER HAD. DO NOT ORDER FROM HERE. \n\nOur fave diner Park Plaza is temporarily closed so we decided to give this a shot. We order 2 eggs benedict, pancakes with a side of turkey bacon, sweet potato fries and some grapefruit juice (free from GH). Okay first - this is the worst eggs benedict I've ever had. I dont even think the eggs were really poached, more like its like sunny side up. The yokes were all over the place by the time it got here. I asked for the hollandaise on the side, it was DROWNING in it. A big runny basically unappetizing mess. Second, my sweet potato fries were soggy and disgusting. Obviously were not made fresh. Reheated from yesterday or god knows when. Didn't try to the pancakes.. Side of bacon.. not that great, on top of that they really charge you $5.75 for 5 slices. I can buy a whole pack of turkey bacon at the store for $3-4.  Lastly, the free grapefruit juice was not even juice. Its more like grapefruit drink. All sugar basically. \n\nBOTTOM LINE do not order from here. It will be a supreme waste of money. Order from Park Plaza instead.", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-06", "description": "Their food is above normal typical diner fare but stay away from their cakes especially the Red velvet.  I had been craving for a slice of red velvet cake for weeks and decided to stop in here since it is so beautifully displayed.  Firstly the red is closer to pink in color and the taste (let's just I could not eat the whole slice and it was not for feeling stuffed).  And to make matters worse the cake was stale.", "author": "Jessie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "New Apollo Diner is the perfect diner! I love this place. Even when it's packed, I never had to wait long for a table. Staff from waiters to bus boys to managers are welcoming and although not overly friendly, they are attentive, polite, quick, and smart. It doesn't take long to get your food at all. The place is always so clean and pleasant. The food is typical diner fare, but delicious, fresh, wonderful. I especially like the whole wheat pancakes. Usually I get breakfast stuff (eggs, pancakes, etc.), but last time I went we had a Reuben sandwich and Greek salad, both were great. Their menu says they bake their own baked goods (I never tried their cake, but it looks good). Everything about this place is great--food atmosphere, people, price (not extremely cheap, but well priced and portions are large)--all just great! I only wish it was closer to my house!", "author": "Eve B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "The New Apollo Diner is the best place to eat in Downtown Brooklyn! It cannot be beat!  From the delicious food, large portions, and excellent service, you will be completely satisfied.  The owners are always present and willing to please the customer.  The waiters and waitresses always make you feel at home.  An extremely large menu gives you many choices for breakfast, lunch and dinner!  I eat there everyday and will continue to do so!", "author": "Irene M."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "New Apollo Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oNpY-pnoz-RC018rdgEcwA/ls.jpg", "@type": "Restaurant", "telephone": "+17188585600"}