{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Amazing, authentic Italian. My family has been enjoying Lillo's coffee and breakfast treats for several months, and we finally made it for dinner this evening. My daughters and I each ordered a pasta dish - ragu, truffle cream and gnocchi with tomato sauce. They were all incredible- the gnocchi in particular, best gnocchi I've ever eaten! Lillo, the owner and chef is a gem. The space isn't fancy but the food is spectacular! He also does lots of takeout if you don't want to eat in, but no delivery.", "author": "Alexa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Heaven. Absolute heaven. The gnocchi with butter and sage is seriously the best I've ever had. I could eat the Grande Bellezza sandwich every day, maybe twice a day. Don't let the fact that it looks like a hole in the wall throw you. The food is 5 Star.", "author": "Alexa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Every item I ordered I enjoyed.  Sandwiches.  Pasta. Pastry.  All hit the right spot.  It looks like a weekly habit to come here and enjoy the food and try another item from the menu.  My company all enjoyed their dishes.  No complaints.", "author": "Eddie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Food is awesome and the owner is a really nice guy.  I have had the gnocchi, squash dish, the soups and the pastries.  If you are in the hood stop to see if you can get a table or do take out.", "author": "John F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-21", "description": "A pleasant little Italian place with decent food at fair prices. The owner is a character in the nicest sense of that word and his presence adds something to the experience. They serve no alcohol nor can one bring wine/beer. As far I'm concerned Italian food without wine is like spaghetti without sauce, so we'll not be rushing back.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Fantastic sauces, pastas and salad.  Great little casual spot with reasonable prices and solid service.  I wish they would either be a BYOB or have a liquor license.  We saw a lot of people pick up dinner as well, so that's an option in case their little restaurant is too crowded.", "author": "Dina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Oh how I am so thrilled to have stumbled upon this little gem of a cafe! I've been there twice so far and twice the gentleman at the counter has been so friendly, greeting me with a buon giorno- how authentic! Coffee is perfection as well as the confections Lillo serves. Try the bombolini alla Nutella-- I legit died and went to heaven eating it! I can't wait to bring people here to try it out!", "author": "Elle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "I'm obsessed with this place. It's a hole in the wall. It has I think four tables. It has mouth watering pasta, ingredients are fresh, and the cappucini are made with love. Did I mention the pastries? Yeah he makes pastries and cookies too and they're delicious. I'm headed there now.", "author": "David R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "The fettuccini was delicious! I definitely recommend it to anybody who wants to eat authentic Italian cuisine", "author": "Gardy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "*Real* Italian food.  Great sauce. Great meatballs.  Recommend in highest terms.  Cash only, so come prepared. It is worth it.", "author": "Radiot R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Home cooked Italian food. What is there not to like. Had porcini fettuccine and eggplant pasta. Finished with homemade cheesecake. BYOB is always great too.", "author": "Borah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "This coffee place is absolutely fantastic! Finally an authentic Italian bar in New York City! I really felt like I was in a bar in Italy. The owner is from Rome and he is very nice and he cooks everything himself with fresh and imported ingredients from Italy. Here you can find delicious croissants with cream, marmalade, Nutella like the ones you can find in a bar in Italy. He also offers a variety of food for lunch and dinner. I bought two croissants with cream and they blew my mind. He made the cream from scratch in the morning and you can taste the authenticity and freshness of it. I highly recommend this place not only for breakfast or coffee but also for lunch and dinner. I will definitely coming back! Bravo!", "author": "Ester L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "This place is the real deal, it is what having a meal prepared for you and friends with care is all about. Don't be in a hurry, enjoy the atmosphere, and Lillo himself. Everything is delicious, love the artichokes, pastas, salads and sandwiches, but leave room for dessert, you won't be sorry.", "author": "Gina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Delicious meals in cute Italian restaurant with friendly service and personal attention from the chef. Great fish, chicken, pasta, deserts, you name it. A favorite place.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "When you think you have tasted the best Italian cuisine in the city, you feel so guilty when you stop to this gem because you think how much you have missed already. It feels like home having the most delicious Italian dishes. \nLillo, the owner and the cook of the place treats you like a royal, and his Roman touch in each of the dishes makes you yearn to taste everything. \nI would come back to this place in a heartbeat and spread the world to all my buddies. \nKeep up the great job, Lillo!", "author": "Al H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Delicious fresh pasta and huge portions! Feels like you are in someone's kitchen (in a good way). Service is not particularly quick-- not necessarily a bad thing but not the best if you are in a rush. The owner takes all orders and brings your dishes out so there is care in everything!", "author": "Liz P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "This is a gem of a place.  A little bit of Rome in Cobble Hill.  Unfortunately for my waistline the hazelnut cookies are incredible.  The sandwiches are huge and tasty.  Coffee great.  Delicious homemade soup, other pastries - a nutella donut, pasta dishes.  Hmmnnn-mmmm.  A great addition to the neighborhood.  Food cooked with heart.", "author": "Theresa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "We went here for dinner with another couple tonight and the food could not have been more delicious. This place is a very rare gem in New York - it basically looks like a coffee shop from the outside (and also is one) - authentic and unpretentious and tiny, with food that is out of this world delicious. The pasta is insanely amazing, as is everything else we had -- prosciutto and artichokes and caprese. And between the inexpensive dishes and the fact that it's BYOB, this place is an incredible value. The whole experience - from the owner that waits on you to the delicious food - was awesome. Highly recommend!!", "author": "Elena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Authentic Italian experience.   Everything is homemade and well executed.  Memories of my Italian Grandmother's kitchen.", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "We stopped in for coffees to sit down and get out of the sun and we couldn't have been more pleased with our choice. Such an adorable \u0026 cozy atmosphere. The man who made \u0026 served our coffees (who also might be the owner) was friendly and charming. I'm looking at their website and drooling over pictures of their food. Will have to come back for a meal.", "author": "Amanda N."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Lillo Cucina Italiana", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "331 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l80GiX53bqunBKoHIy35fQ/ls.jpg", "@type": "Restaurant", "telephone": "+13477630899"}