{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "We came to Lillo to eat dinner with some friends who live out in the area in Brooklyn. At first, we weren't quite sure if we had the right place, as Lillo looks more like a coffee shop if you peer in the door, as opposed to a sit-down restaurant. However, there are a mere handful of tables that are crammed in where you can sit down, and even though it was relatively early for dinner (around 6 PM) when we got there, we still had to wait for about 10 minutes or so before scoring a seat. It's a bit of a neighborhood secret, from what I understand, but judging by the fact there were a few more folks waiting outside when we left - as well as people carrying wine with them (no liquor license does not equate to BYO, folks...this place doesn't do booze regardless of the source) - it seems like more folks are catching on. The decor makes it feel really homey inside, and don't come in expecting the place to be done up in any special manner. Lillo himself is basically in charge of taking the order and bringing out your food, so as a one-man show, it can be a little slower - but probably just like it is were you to be eating in Italy.\n\nThe food, though, is absolutely delicious. I haven't found myself down to Rome yet, but talk about an absolutely divine cacio e pepe - it's done well here, and $14 gets you a giant heaping plate of pasta with freshly-cracked pepper on top. Despite having a generous amount of sauce, the noodles (spaghetti in this case, from what I could tell) still held up and didn't get anywhere close to as soggy as some American-cooked pasta can get. It's probably the best rendition I've had anywhere. All of the other items I had a bite of were delicious as well - whether it was the gnocchi (it's as pillowy as everyone says it is) or even the cabbage as an appetizer, which I was skeptical about but which actually had a really nice flavor and a texture that was moist but not soggy. And for starters, it's hard to do better than buffalo mozzarella with basil and tomatoes...yum.\n\nThis is really a spot where if you want to make it, you should get there early or simply be patient. The meal might take longer, and the facilities may be limited, but there's a lot of Old World charm in both the care put into the simple plates, as well as the vibe of being in a cafe that looks like any other old-school NYC coffee shop but actually makes amazing Italian food.", "author": "Asuka N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-16", "description": "Come on people. This hype is absurd. The place is decent. The food is nothing special. \n\nThe most unique thing about this place is that there are no reservations, no list to put your name on, and no one to tell you how long until your table may be ready or where you are in the queue, because none exists.  So if that gets you going and really jazzed for some average Italian food that you could easily replicate at home, I get your 5 star rating. \n\nBottom line: Don't believe the hype. If this spot wasn't in BK, but was in say the east village, it wouldn't get so much dap.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Cute little Italian restaurant offering fairly price pasta dishes. All of the pastas range from $13-$16 and come in good portions. The sole waiter is an Italian guy who is really pleasant and friendly. The place is really small and therefore, if you're not lucky, you may end up waiting a long time. We were a group of four and ended up waiting for one hour and a half. The waiter could have seated us much much earlier if only he had seated other parties of two in a different manner, and combined two tables together. For that reason, poor table management, we ended up having to wait outside for 90 minutes. Overall the food is great and reasonably priced (almost cheap for New York). However, because of the overall wait and experience, i think a 4 star rating is fair.\n\nOn a side note, I would also like to warn everyone that the restaurant has NO bathroom. Therefore, you should come prepared!", "author": "Matteo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Overall, if I lived nearby, this would be my go to pasta takeout! The pasta is fresh and cooked deliciously. We got the cacio e pepe dish, which was a big hit. It has the perfect mix of cheese and pepper and is a respectable portion. The other dish we tried was a special: truffle fettuccine. This was good (pasta was cooked perfectly), but it has a milder flavor, and I would try something different next time.\n\nBe aware that there is no official waitlist. It depends on Lillo to remember who came first, which makes it difficult if you want to leave and grab a drink somewhere during the waiting time. \n\n**there is NO BATHROOM at this restaurant, so plan accordingly.", "author": "Marleigh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "My friend recommended we check this place out while I was in Brooklyn and I'm so glad she suggested Lillo's!! The restaurant is very charming and cozy with only a handful of tables. Probably isn't an ideal place for big groups. We came for lunch on a Saturday and were lucky to get a table immediately. My friend and I got the grilled artichokes to share. I got the boscaiola and he got the gricia. The food was so soo good! Everything was fresh and simple. The prices were also fair (esp for New York).", "author": "Kimsa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "This is such a lovely place to dine. Do be prepared to wait a while for a table, as this is a small operation and people like to linger over their meals. I do recommend eating in -- while the decor isn't much to write about, the overall ambiance is wonderful, because of Lillo's wonderful hospitality and good humor.\n\nDon't think of this as a fancy, formal fine dining experience; imagine you have a wonderful Italian uncle whom you visit once every few years, and every time you see him, he treats you as if you're his closest family member and wants to feed you to make up for all the time you've been away. That's really how I'd best characterize Lillo's brand of spiritual generosity. He treats everyone like an old friend, and wants you to have a great time!\n\nMore importantly, the food is awesome. Nothing is fussy or overly conceptual; mostly you'll find Italian classics (or Lillo's interpretations thereof). The pastas are all fresh and amazing, and it tastes like what I imagine a sophisticated Italian grandma's cooking is like. Get the artichoke appetizer for sure -- super tender and with a nice bit of char. And you can't go wrong with any pasta on the menu; we got the pasta boscaiola and a lovely rigatoni and both were so full of umami and warmth and delicious flavor.\n\nSince this is mostly a one-man show, with Lillo doing most of the serving, bussing, and a lot of the cooking, there can be some lapses in consistency, so come in expecting that this will be more like a small-bistro, mom-and-pop-shop experience. Have patience! Pretend you're in Italy (practice your Italian with Lillo!). And most of all, just enjoy.", "author": "Natasha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "This place is tiny and super no frills - they don't even have a restroom! But the food is delicious and that's all that matters. We split the caprese salad which was super refreshing. Then we each got a pasta - cacio e pepe and pink gnocchi. Both were good but the cacio e pepe blew it out of the park! It's also a pretty good portion so I had to take some of the pasta home. If you're looking for authentic Italian in NYC, look no further than Lillo!", "author": "Divya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-21", "description": "Tiny Italian spot right off Atlantic Ave! Upon first glance you might think it's just a coffeeshop but the extensive pasta menu and crowds during meal hours prove otherwise. \n\nService is brisk and to the point and soon after ordering, plates full of steaming pasta arrive on your table. We tried the Cacio e Pepe and Gricia, both with similar cheese, butter sauces but the first with loads of fresh grated pepper and the second with a flavorful pork, like bacon. The portions were large but easy to finish because it was so delicious. \n\nEnded the meal with an espresso, which is made fast and Italian style. We loved the milk candies at the end too!", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "We loved every bite of our meal. The mozzarella starter was the freshest, most delicious cheese we've ever popped in our mouths. Same for the pasta dishes. The gnocchi tasted like little pillows of fluffy goodness. The meatballs in parm sauce were a delight. And we wiped the plate clean with the yummy bread. Having eaten across Italy twice, we thought our meal ranked within our top 3 ever. Loved and can't wait to come back!!", "author": "Kate M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "Grubstreet recently reviewed Lillo and I am so happy that they highlighted this neighborhood gem. It's in Brooklyn Heights but it feels like a nice cafe in Rome. It's a nice stroll from the subway and once you arrive, you feel like you are stepping into a nonna's kitchen. Instead of a nonna, you find Lillo. He is one of the sweetest and warm man you will meet. You are welcomed immediately and time to look at the menu. \n\nThere are lots of pastas and sandwiches to choose from. There are some pastries to choose to end the meal as well. The pastas are all made in house and with lots of love. You can taste the love that is added to each dish. We ordered meatballs with peppers, sauteed mushrooms, pink gnocchi and the fettuccine with speck and zucchini. Each dish had something special about it.\n\nThe meatballs are so tender and the peppers are so soft that you barely need to chew. They add a sweetness to the dish. The mushrooms are out of this world. It's a simple dish that has so many layers of flavor. There is the usual meatiness you get with mushrooms. However, you can also taste the wine that it was sauteed in. It is just a joy to eat this dish. \n\nThe two pastas that we ordered, the fettuccine was the favorite. It was creamy and cooked to the perfect al dente. Each bite just slipped down with a smile. The gnocchi was creamy as well but a bit dense to my liking.  There is a hint of the beet that added some earthiness to the dish. \n\nThe restaurant doesn't have a bathroom and it is a small space. If you come, when it's busy you will have to wait. I would do it. I would travel for this food and I do.", "author": "Eve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "This place is outstanding!\n\nMy review could stop there bc everything was wonderful- from the atmosphere, to the handwritten menu, to the one man show that this place is- and of course, the food. I had the pink gnocchi which is colored by beets, and they were to light, fluffy, pillowy goodness with a light butter sauce over them, finished with Parmesan cheese. Do I need to say more?\nMy friend had the branzino (fish) which was served with chopped potatoes, peas, and cherry tomatoes and finished with a white wine. \nAlso had a hot chocolate to finish, and all together came to just over $40. In this area, in such a small authentic place..just wow!\nWill absolutely come here again!!", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "I almost don't want to write this because I'm afraid of the word getting out as to how FANTASTIC and AMAZING this place is (difficulty in getting a table though means word is probably already out anyway!)\n\nI felt like I was back in Italy in this tiny coffee shop/cafe from the vibe, menu, chef, owner - The food was as good if not better than what we had in Rome and Florence. \n\nIt was just my husband and I and it was very hard to not be gluttonous​.  Everything on the menu looked amazing and it was hard to just pick 2 dishes! \n\nThe dishes we ended up settling on were the Cacio E Pepe and Fettucine Porcini - both such complex flavor profiles with a kick you wouldn't necessarily expect.  The chef let us in on his secret ingredient but I was so entranced in the meal that for the life of me I can't remember what it was! I just know that it is unlike any cacio e pepe I've ever had and probably will ever have.  \n\nThis has absolutely become our staple Italian​ spot and won't be going anywhere else (unless we can't get a table!)", "author": "Anu K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "All the reviews speak true!!  Food is amazing, authentic and comforting.  \nBe patient with getting a table and service.  The owner does it all.   We will be back!!", "author": "Lauren V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Great food! I could eat there every day. Lillo is a sweetheart and very kind.\nThe desserts are my favorites.", "author": "Isabel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "Where do I begin... the simplicity of this restaurant is what makes it so special. The venue itself is cozy. If you want to win cool points on a date, bring them here. \n\nThe pasta is delicious. I make it a point to try a different pasta each visit. So far I've had the  Fettuccine al Porcini, Cacio e Pepe (had a bit too much pepper) and the pasta dish with eggplant. The eggplants were cooked to perfection. The thing about these dishes are they are as close to authentic as you can imagine. You feel like you're eating a home cooked meal and that's what makes this place pretty solid. \nI found the caprese to be quite delicious as well. The tomatoes are sweet and the basil is always very aromatic.\n\nThree things to keep in mind: \nCash only\nNo BYOB\nPossible long wait times but totally worth it. \nThe neighborhood scene will keep you entertained and great for people watching. It just so happens that there's a guy walking around playing the harmonica as I write this review. *shrugs* \n\nThe gentleman running the restaurant is so kind hearted.", "author": "Hinda E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "I was visiting NYC and found this 5-star Italian place around Brooklyn Heights - one of my favorite areas during the trip.\n\nThe restaurant is cute and cozy. It gave me a sense of being home and the owner talked to you like a friend. I did see quite a few come back customers.\n\nI had the Fettuccine Porcini and Gricia Rigatoni by recommendation. The sauce and the texture of the pasta were just perfect. I can taste the freshness of the pasta. It was chewy and soft at the same time.\n\nDespite that there was sand in the Fettuccine Porcini (I'm still thinking about how that happened as the main ingredient was mushroom), I'm still willing to give it 5 stars considering how much I'm missing it right now!", "author": "Ying Ying S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "My friend who lives around the corner from this cute little restaurant and introduced me to this restaurant declared that the handmade pasta was so amazing that she had been there three times in the last two weeks that she found it. Wow! What a hearty recommendation - so of course I had to go with her. \n\nWhen we arrived at 6:45pm on a Saturday evening, we were surprised to see that there was only one filled table. The chef/proprietor/waiter told us that all five of the tables were actually booked, but we could sit if we promised to be done by 7:30pm. When I looked around, I saw that all of the tables had these adorable hand-drawn signs (replete with stick figures!) for the reservation number and time. We'll know for next time! In the meantime, we gladly sat down. \n\nMy friend already knew what she wanted, but I had a serious struggle with all the choices. I hastily made a decision because I was pretty sure I couldn't go wrong (after my friend raving about it :p). \n\n+ Speck \u0026 Zucchini Fettucine - So good! Super creamy, great al dente fettucine, fresh zucchini and tasty speck. \n\n+ Penne Boscaiola - I didn't know what this was, but I saw mushroom and bacon and I was sold. When I looked at it online, SeriousEats says that it's tomato-based, but the dish I got was actually cream-based (which I secretly prefer). I loved the mix of mushrooms and of course the bacon was great. :) The penne was a little more al dente that I was used to, but I thought it was great.\n\nOverall, the service is great, the place is super cute and homey - it has a real neighborhood vibe going for it - and the pasta was fantastic, especially for the prices. I'd definitely come back!", "author": "Liana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "Amazing. Incredible. Unforgettable. Authentic Roman comfort food. 'Nuff said.\n\n...(extra words that Yelp forces me to write)", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-13", "description": "Popped in for a mid-week pick-me up with the family. Small space, but they were accommodating with folding up the stroller and putting it on the side. \n\nWe had the cacio e pepe and the fettuccine with speck and zucchini. Both were delicious! Fettuccine was like an amazing mac and cheese. Cacio was great...a little spicy! We also had a green salad, which was arugula based. Very good...and the table bread was also great. Very soft and fresh. We finished with a bomboloni and cappuccino! The perfect evening. \n\nHoping to go again soon, or at least pickup some food to go.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Everything looks legit in this place. The gentleman running the store sounds like he is straight off the boat from italy. Very nice guy. He suggested the fettucine with speck, zuchini, and cream sauce. \n\nThe pasta was beautifully made. You can tell it was homemade. I probably would have liked it a little more al dente. I was also surprised the pasta was oversauced which is an american thing to do. The italians usually just dress the pasta enough to taste and not drowned. With that being said it was a beautiful dish and the flavor was there so cant complain. It was not the lightest dish but very good flavor. \n\nI will be back to try the other dishes. This is the kind of place that brings me back to italy.   Cant give it a 5 stars but a solid 4 stars.", "author": "Nicholas G."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Lillo Cucina Italiana", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "331 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l80GiX53bqunBKoHIy35fQ/ls.jpg", "@type": "Restaurant", "telephone": "+13477630899"}