{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "We found Lillo Cucina Italiana (LCI) one night by accent. It was super cold out and we were going for Japanese at Hibino next door when we found this spot. We originally stopped in for a pastry after dinner but after speaking to the owner, it was clear we needed to come back. \n\nStepping into LCI was like going back to Italy, this restaurant is not like dining elsewhere in NYC. The food is excellent, simple, cooked to perfection and delicious. Simple is the key here, which many people believe is the key to authentic Italian cooking. The owner used to be a pastry chef in Rome and in addition to his homemade pastries, his pastas are also fresh and made in store.\n\nLCI is definitely like walking into Italy, it's a small, cute place with one waiter, the owner who also helps to prepare your food. Eating there is an authentic Italian experience, you sit relax, have a drink, chat and enjoy your time there. Fast food it is not. If you're in the area and in the mood for good Italian food, go to Lillo Cucina Italiana, if you're not in the area, still go. We loved it and will definitely be back.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "This was the best Italian food I ever put in my mouth. I think about it regularly and will be visiting again ASAP. The owner is as authentic as one can be and makes great recommendations. Definitely make this a stop for any pasta lover.", "author": "River M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "Delicious. Had an early dinner on a Sunday and really enjoyed the pasta. We had 3 dishes - the caccio e Pepe was the winner.", "author": "Fran A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Autentico Autentico Autentico!  Such authentic Italian food, it's like you're on the streets of Sorrento stepping into this hidden Brooklyn gem.  With a few tables you are in the kitchen of Lillo from Roma.  \n\nA first time delight for me and I certainly will be back, I'm pissed it took me so long to find!   Mangia!!", "author": "Michael V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Found this place completely by accident a few months ago and it was a pleasant find. Coffee is amazing, food is fresh and always delicious. Have to love the ambiance and friendly atmosphere.\nAnd best of all, you get to practice your Italian with Lilli the owner.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "This restaurant is perfect. It's literally the best gnocchi I've ever had (spinach gnocchi in cream sauce). The Cacio e Pepe is both simple and complex: it's also the best I've ever had. There's no alcohol but that SHOULD NOT prevent you from going here. The menu changes everyday I believe (?) so there's no excuse to visit over and over again to try new dishes. Also, the owner is there and wants to ensure you enjoy your meal to the fullest. He's an absolute sweetheart and will explain anything you have questions about. \n\nWhat you need to know: I believe that it might be the best pasta in Brooklyn. You can go to the hippest restaurant with the most talked about chef and drop $30-75 on a dish trying to improve upon pasta or replicate a perfect Italian dish  -or- you can go here and have the best thing you've ever eaten for $10-24. \n\nThe space is small so expect to wait to get a table. It's absolutely worth it. It's also cash only so come prepared (there's an atm at the deli across Atlantic ave)", "author": "S E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "Pleasant vibes. I enjoyed the food and service at Lillo's. It was awesome to see the the owner of the restaurant actually greet and tend to the customers. Food was delicious.", "author": "Syed M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "A little gem in cobble hill with only a few seats you're def going to get you're authentic Italian food fix. This place is On the list for The best of New York where locals eat Owner Lillo was kind and offered great service and food! I had the ravioli porcini in cream sauce and the meatballs in cream sauce which did not disappoint! Food was soooo good! Will get be coming back to enjoy this local spot again!", "author": "Kina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "A great neighborhood gem! Went here for dinner and I'll be a regular here. Everything was phenomenal and cooked perfectly. The pasta was the fresh made with love! Try the meatballs for an appetizer they were better than grandmas at Sunday dinner. If you are a fan of gnocchi look no further and order the pink gnocchi!!", "author": "Max D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "Lillo has the price point and vibe of the small trattoria you think lurks around every corner in Rome. A small hideaway with textbook caico e pepe and pillowy gnocchi, Lillo is impossible not to like. And the vibe delivers - Lillo gives you space and time to relax with your food, Lillo's saunter reassuring you this is time to savor.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Wow wow wow. This place is speechlessly amazing. Super authentic and delicious Italian food made by Italian chefs. The owner is from Rome and treats his customers so well. I had forgotten what good pasta can taste like until this place.\n\nInstant favorite!", "author": "Austin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "We ordered the fettuccine con porcini and gnocchi. The food and service was really good.", "author": "Kenny V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Lillos is my favorite Italian food in all of NYC. Whenever I'm in the mood for a great pasta, I come here. Lillo himself is great too.", "author": "Kyle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "Try the puffy-as-clouds, crisp as can be, absolute perfection that are the bombolini (handmade donuts filled with Nutella and other things) they're truly *Extra* in my book. Tip: try with a tiny espresso and enjoy in the park across the street.", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Really solid food done simply.  The type of place you yearn for if you have been to Rome and then felt depressed coming back to the US.  I hope it stays exactly the way it is, the format is great, Small first come first serve, no reservations, no groups, just a simple hood spot.  As a professional cook, I only wish that I would be fortunate enough to learn and be this mans apprentice in the kitchen.", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "This another hidden gem. The food is absolutely delicious. Everything I've tried here has been fantastic. The coffee also is perfectly done. I've been here during the day for a light snack and in the evening for dinner. The atmosphere is always pleasant. The owner is really nice, and a really good cook. Highly recommended.", "author": "S R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Was very much looking forward to trying Lillo but left feeling torn. On the upside, the space is warm (literally and figuratively) and there's a congenial ambiance. The owner, Lillo, was engaging and voluble, like a classic Italian host. \n\nThe food itself was a mixed bag. The fettuccine con porcini was delicious, though there was slightly too much sauce. The flavors were rich and robust, and the pasta was cooked perfectly. On the other hand, the eggplant parmesan verged on inedible. It was drowning in sauce and the cheese (mozzarella, which seems more Italian-American than true Italian) wasn't even melted all the way through. The eggplant itself was bitter and just not flavorful. \n\nWe'll definitely be back but will stick with the pastas, as those seem to be the sweet spot at Lillo.", "author": "Brooklyn I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "It's good.  Really good, but I am dropping one star for service.  With the delicious food being produced  here, I think service could be a tad bit better.  Three tables that ordered after us received there food first.  The waitress even put down someone else's order in front of us then quickly took it away.  I probably wouldn't have cared if I was drinking wine but a sober pasta night can make me overreact.  Regardless gnocchi and Cacio e papi was high quality.  I did see many people popping in for takeout which sounds like the perfect way to enjoy some fresh pasta.", "author": "Ang M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "Truly exceptional. The pink gnocchi was easily the best gnocchi I've ever had. Highly recommend and will be back often!", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "I noticed this cute little coffee shop before but first time I went for lunch today and was amazed by the variety of dishes that are served in such a small setting: salads, pasta, panini, homemade pastries...I wanted to try them all but finally settled for the porcini fettuccine which were phenomenal probably the best pasta I have had in NY, full of flavour and generous portion too.\nAs others mentioned already there are only a few tables and if it stays that popular the lovely guy who runs it will need to open a restaurant soon. \nSo happy to have finally found a favourite Italian in Brooklyn what a great addition to the area !", "author": "Jenny G."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Lillo Cucina Italiana", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "331 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l80GiX53bqunBKoHIy35fQ/ls.jpg", "@type": "Restaurant", "telephone": "+13477630899"}