{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Treasure chest..great things HAPPEN in small places. His Chicken milanese  is spectacular thinly pounded cooked to perfection. His pastas are good, sandwiches even better.every day he bakes croissatini which are delicious.Lillo makes his own Italian cheesecakes the perfect way to end a meal. This is a lost art ITALIAN CHEESECAKES. It's a small place no bathroom wait  till you get home  it's worth it.", "author": "Eugene D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "This is everything a neighborhood cafe should be and much much more because of the quality of the food! We loved everything we ordered - the best gnocchi I've had anywhere, light and fluffy, just heavenly! The beef meatballs were equally delightful with an airy texture and just the perfect tomato sauce. Please do not leave without trying their fettuccini porcini! This place is small but exudes that comfortable, relaxing pace of a worry free Sunday morning. So happy that we stepped into this neighborhood gem. Definitely coming back!", "author": "Clair M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Stumbled upon this place on an outing with my cousin and we were SOOOOO pleasantly surprised! Food is great, owner is sweet and courteous and food is delicious!", "author": "Milka A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "The shuffling, bandannaed Italian fella who runs the place is a good natured gem and his chef produces simple, quality Italian fare at very reasonable prices. The home made pasta is always fresh and cooked to perfection with subtle sauces. \n\nIt's a two man operation so don't expect a quick in and out job, but do expect not to care about the wait after you've eaten the merchandise", "author": "Sam D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Lillo, both the restaurant and the man, is a gem. I've never wanted to learn italian so badly. \n\nSO and I go weekly for dinner and are never disappointed. \n\nOur favorite dish is the Gricia pasta, incredibly rich and always cooked to perfection. \n\nYou cannot go wrong starting with a caprese, carciofi, prosciutto, or meatballs. I haven't had a bad pasta dish either: cacio e pepe, lasagna, Bolognese (fantastic), and others that I'm forgetting the name of unfortunately (will update review later)\n\nMilenese e pollo was juicy and crispy and big, good to share with a table each enjoying some pasta. \n\nFinishing up last night I finally ordered an espresso which was outstanding. Rich and complex, sugar not needed. Looking forward to going more for coffee now. \n\nService is always friendly, portions are generous, and prices are very reasonable. We normally spend $50 including a nice tip and have some leftovers. \n\nCash only. No byob.", "author": "Greg M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-22", "description": "Growing up here Italian-American, I've eaten at my share of Italian restaurants in New York City and surrounding areas.  Lillo's is simply the best.  The restaurant is small and charming, and every single thing we tried impressed.  Get the meatballs - you won't regret it.", "author": "Michael V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "Obsessed. If you want a piece of Italy in New York, this is the place. The pasta is out of this world - fresh and light and the cappuccino's are epic.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Honestly, the best and most authentic Italian food I've had in NYC. He's got a simple menu with amazing ingredients. Everything I've had there is great, from the sandwiches to pasta to soup, you name it. The coffee is fab too. I eat there at least once a week!", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Yes yes yes!!! After hearing about this hidden gem, decided to take the trip from Jersey. Well worth the traffic I had to endure on the FDR!", "author": "E J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "I have to start my review saying that I'm a REAL Italian! I was born and raised in Sicily And I have bene living in Nyc since 2013. Tonight for the first time in 5 years I feel like I was in Italy again. Lillo is an amazing cook! His food is just ridiculously good tasty and genuine! He is a super nice and welcoming and humble man. It's a pleasure to have dinner to this place. The experience is unbelievable. The place is very small so it felt like we had  a private chef cooking for us. Pics speak for themselves. I'm just worried this restaurant will be very very popular soon and we would have to stay in the line hours and hours outside before to have a spot. Lillo deserves all the success ever.", "author": "Giuseppe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Hands down the most authentic Italian restaurant in NYC. I lived in Italy for many years and just like the man himself Lillo's food is straight out of Rome.\nPasta is high quality, generous on the sauces and perfectly al dente. Gnocchi is also top class and oh so delicate in texture, none of the chewiness you will find in most Italian restaurants. \nThis is our home away from home these days. Kid friendly and Lillo will go out of his way to make your child welcome and accommodated.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "It was amazing. Love how authentic the food was. We ate every las bit. Super small inside, maybe 6 tables, but I enjoyed the quaintness.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "The food was amazing! We had the meatballs and mushroom fettuccine, and a buffalo mozzarella salad which was extra delicious. We also ended with desserts. The owner is very friendly, and seems to be running everything. The atmosphere is great (not too loud or dark). It's well worth the wait, don't miss out.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "This place is fantastic. \n\nRun by the owner, Lillo, who is charming, genuine, and welcoming. Food is exceptional, as others indicated. Place is a small: 6 tables. Order and sit down. \n\nPlease come and support a local small business. Way too hard to survive in our community without a lot of support.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Absolutely magnificent! The owner and chef immediately made us feel like family. The pastas were all homemade, fresh, and delicious. We had the grilled branzino (not on the menu), gnocchi \u0026 fettuccine, and all cooked to perfection! We felt like we were sitting in Lillo's home in Italy. Truly a charming little spot. This place is going to have a line out the door in no time. Take advantage while you can...before the word gets out. Which clearly this review won't help much with that. Damn it.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "This place is the real hidden gem that we all seek to find. A small authentic Italian cafe straight out of Rome. The proprietor is a gentle giant and a no fuss attitude. The menu is basic but entirely delicious, makes me feel like I'm on vacation in Italy. Great pasta selection at affordable prices. Be warned, there's no Liquor license or BYO which is probably for the best since there isn't a restroom.", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "Best Italian food I've ever had! The gnocchi is delicious, as is the puttanesca and the cannelloni. Lillo is very warm and friendly. The restaurant is a small cozy place with just a few tables.", "author": "Caroline S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "In a small place on Henry Street, you will find the biggest and most authentic Italian flavor. Their dishes are a true delight, their sauce are at their point, pasta is fresh. recommendable", "author": "Ale V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "I'm not sure I want to reveal this neighborhood secret to the public... but Lillo, the owner, deserves it. Tiny cafe-restaurant with one-on/one service by the owner-chef. Delicious, simple, authentic cuisine at a good price + BYOB from across the street = tremendous value.", "author": "Ron R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "If you're someone who knows the difference between real food (especially Italian food) and what is served in the majority of places in New York, come here.  If you want to be duped at another Italian place for triple the price, then don't come here.  More room for me!", "author": "Michael F."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Lillo Cucina Italiana", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "331 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l80GiX53bqunBKoHIy35fQ/ls.jpg", "@type": "Restaurant", "telephone": "+13477630899"}