{"aggregateRating": {"reviewCount": 85, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Cozy and welcoming. The portions are perfect, prices can't be beat, and the food is tasty, authentic, and fresh. Food is prepared somewhat simply, and leaves you clamoring for more. The al dente pasta is cooked perfectly, with a thick chewy texture that comes with quality pasta. The rigatoni gaica hit the spot, hearty and a little on the salty side from the bacon and parmesan, which were complemented well by coarse black pepper. The linguini with speck was lighter with a mild zucchini flavor to the cream. In the mood for thick and savory, I preferred the heartier gaica that evening. I plan on returning to try more dishes from their extensive, primarily pasta-based menu. A small joint, get there early if you don't want to wait, but not when I'm there so I don't have to wait! They seem to do a lot of takeout as well. Their namesake cake moves quickly. We didn't have a chance to try it because they ran out but will when it's next available. All in all, they don't need to change a thing, except maybe a larger space at some point so I wouldn't feel guilty about hunkering down and ordering two meals for myself.", "author": "Kay T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "I found this place when I searched for an Italian coffee shop, because I needed a really good cappuccino and we all know Italians make the best ones. We walk in and the place is very small, with about 6 tables all close to each other. All the tables were taken and there were also a few people waiting for takeout. Me and my friend ordered our cappuccinos and after 20 minutes they were still not made. The owner was taking orders, making coffee and cleaning tables all by himself. The funny thing is, is that we didn't even care about waiting 20 minutes for a coffee because the place had such great vibes. It felt like all the tables were talking to each other. There were two Italian families from the neighborhood that were introducing themselves to each other, my friend and I were talking to the table next to us about what they had ordered because the pasta looked and smelled absolutely delicious. There was a couple that was pouring a glass of their wine to another table. It was like we were eating at someone's house!\n\nAnyhoo, the cappuccinos were very good. We also had ordered an Italian cheesecake which was great. The owner was very nice and welcoming. Four stars because I have not had dinner there yet but I definitely will be returning soon.", "author": "Virginia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "I noticed this new restaurant in my neighborhood a couple weeks ago, but didn't get to check it out until today. Very cozy and friendly. Although I've never been to Italy, this is exactly the kind of place I'd hope to discover there. I only tried the zucchini parmigiana (they use real Parmigiano-Reggiano), but it's prepared simply with fresh ingredients and has a great consistency. Every level flavorful. So good! I'm definitely going back soon. My compliments to Chef Giampietro (Lillo).", "author": "Ronnie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I had a private birthday dinner at Lillo Cucina Italiana, and it couldn't have been more wonderful. The restaurant looked beautiful and Lillo was a superb host and even better chef. All of my friends were so impressed, the meal was amazing and overall it was a perfect party. The food was delicious and fresh - thank you so much, and I cannot wait to come back to this new neighborhood treasure!", "author": "KK G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Your lasagna, polpetti, zucchini \u0026 baba are exquisite. Thank you for an incredibly delicious meal Lillo.", "author": "Pamela R."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Lillo Cucina Italiana", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "331 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/l80GiX53bqunBKoHIy35fQ/ls.jpg", "@type": "Restaurant", "telephone": "+13477630899"}