{"aggregateRating": {"reviewCount": 38, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-14", "description": "This location is cool but not as cozy as the Tompkins street location\nI ordered the hothouse chicken with Cole slaw. The server arrived with mac and cheese. I reminder him of my order and he returned with Cole slaw but it did not seem very fresh and I love their cole slaw. It was also lacking flavor.\nI also had the very delicious brownstone drink. It was a nice after shopping dinner.", "author": "Dionne H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-09", "description": "Stopped in on a whim before a show at BAM.  A we got a seat right away but waited several minutes without so much as anyone asking if we wanted a drink.  By then all the remaining tables filled up and the staff didn't seem to know how to handle the rush. I had to stop the host and ask for someone to take our order.  He said he could take the order but then didn't ask if we wanted drinks. I noticed that the table next to us also had to get up and ask the waiter to take their order.  We also were never given salt, pepper, or ketchup.  And our drinks finally came after I was done with my meal!\n\nThe food was good. I had a chicken sandwich (very crispy) my wife had the burger.  \n\nMaybe you have to go when it's not busy, I don't know, but the service kept this from being a 4-star review, and almost made it a 2!", "author": "J J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-25", "description": "Peaches HotHouse is nice, but not a great dinner by any means. I came for dinner with friends and there was plenty of seating in a nice quaint restaurant and our server was quick, attentive and nice. Unfortunately, they were only doing their premade cocktails so we couldn't order any well drinks outside of what is on the menu. No problem for me because the drinks were absolutely splendid! \n\nFor food, I ordered the HotHouse chicken with salad, cornbread, and a side of Mac and cheese. I got the \"hot\" chicken - which is the middle option (not mild and not super spicy). The chicken was HOT!! I really enjoy spicy food and often cook with peppers at home but this was way too hot for me, maybe the chef put too much pepper on mine (it looked like a powdered pepper on top). The Mac and cheese came out a bit lukewarm and a bit dry. The salad was fine; a typical spring mix with some type of vinaigrette. \n\nFor the price, I would probably try somewhere else. If I'm back I will probably stick to the mild fried chicken and cocktails.", "author": "Fredrica A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-03", "description": "Peaches, what the hell happened to you? You used to be the pinnacle of fried chicken in Brooklyn, and now you're a shell of your former self. Did you grow too much too fast? This location used to be Smoke Joint (which was pretty okay in terms of BBQ), so I was excited to learn it would become the latest incarnation of Peaches HotHouse.\n\nToo bad it's nothing special.\n\nI ordered the hot chicken and French toast (brunch item) and got it \"hot\". I use quotes because it was barely mild. I don't understand how it's a step away from their hottest. I know back in the day (when the original Peaches opened), they used ghost peppers, and they definitely tamped it down (probably for the gentrifiers), but this was way too many steps down. It's possible they gave me the wrong order, but the receipt definitely said \"hot\" on it so who knows? Also (and this is personal preference), but hot chicken should be made with hot oil and not just dusted hot pepper on top. That's the way they do it in Nashville, and that's how I do it at home. Powdered is just not the same.\n\nIt also came with way too many pieces of French toast. It was good but too excessive, especially with the ultra-sweet peaches in syrup on the side.\n\nService was also pretty slow. We ordered coffee and it didn't show up until we were almost done eating. And also, it sucked.\n\nThe Bloody Mary was good, but the mimosa was like 3/4 filled. They should either fill them up all the way, or use smaller glasses cuz it's not a good look.\n\nI will say the space is as nice as ever, and they've preserved the Guy Fieri tag on the wall. But I probably won't be returning.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-06", "description": "My fiancé and I were really craving some hot chicken after eating Gus's all weekend down in Memphis. We googled and found Peaches is one of the only places in NYC that offers it.\n\nVia caviar we ordered the hot chicken sandwich, crab pasta and gumbo. Unfortunately the chicken sandwich wasn't hot at all and tasted nothing like what we were craving. It was good on its own as a regular chicken sandwich though. The gumbo was delicious and had plenty of sausage chunks in it. The pasta started out very tasty but by the end was pretty salty.\n\nOverall the food here was good but not what we were looking for and the chicken not as advertised. Our search for hot chicken in NYC continues.", "author": "Julianne G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "Beware of uncooked chicken. Decided to visit the new peaches and it was an unpleasant experience. The best chicken sandwich in town was not properly cooked through and I got food poisoning. The next morning I woke up and it was a disaster. I also tried my friends grits and shrimp dish which she didn't even eat. The gravy to the grits tasted like peppery. No taste to the grits and the shrimps were ok. Can't mess up shrimp. The server never checked up us. No ketchup or salt and pepper for my fries. The brownstone drink was the only good thing. The experience was awful. I would not be returning.", "author": "Shanelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "The owners of Peaches and The Smoke Joint just closed The Smoke Joint at this location and reopened it as the second location of Peaches HotHouse.\n\nLike the original, they are especially known for their fried chicken, in particular the hot Nashville style one they serve. I knew I wanted to try this, so we got a regular fried chicken sandwich, regular order of fried chicken, and the hot chicken with French Toast for brunch.\n\nAll of the chicken came out with no spice, and it's easy to tell by sight since Nashville style should just look dangerous.  I double checked with the server and he assured me it was hot chicken. I took a bite, and it was definitely not, so I asked another server and he shook his head and confirmed it was definitely not. Instead of remaking it, they juat brought out a little cup of dry rub seasoning, which was a definite bummer.\n\nAside from the service hiccups, which is sort of understandable given the new location, the food is all very solid. Especially the chicken.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-10", "description": "Come for the chicken, stay for the friends!  This is their 2nd location to their outpost in Bedstuy.  If you're craving the hots chicken, this is where to come!\n\nWe were able to get a seat at opening on a weekend night, and it did not stay empty.  We ordered both the hot and regular fried chicken, Mac N Cheese, Brussel sprouts, and charred broccoli salad.  The chicken - OMG - such great flavor, texture (crispy thing spiced batter, juicy inside), and love put in every piece of chicken!  Not for the faint of hearts in terms of eat, but well worth the pain!  Mac N Cheese and sprouts were well seasoned and cooked properly, the charred broccoli was more like steamed broc in vinegar soup.\n\nStaff is friendly, but could be a tad more attentive.  Price point is about right for this amount and quality food.\n\nSO GOOD!", "author": "Ignatius L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-13", "description": "I'd like to say Peaches HotHouse is a welcome addition to the neighborhood, but I think they have a few kinks to work out first. My partner and I went to dinner on a Saturday night, a couple of weeks after they opened. We arrived around 6:30 and sat at the bar because the tables were occupied. There was a limited beer and wine menu and rum punch on hand. The bartender said they would be expanding those offerings in the coming weeks. \n\nWe ordered the fried chicken (hot) with a side of mac and cheese and broccoli. First of all, the fried chicken as some reviewers have said was not hot at all. It wasn't even seasoned. With that being said, it was still good fried chicken. The crust was crunchy, and the breast was juicy. The sides were fine, but nothing to boast about. The mac and cheese reminded me of Velveeta. For dessert, we ordered the bourbon cake. Unfortunately, it tasted like it came from a package. \n\nHopefully they can add some cocktails to their menu and work on their sides and dessert because the space and owner are nice. And the location in Ft. Greene really can't be beat.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "Well my sister, my son and my cousin went here for a Pre-Mother's Day brunch. We were seated quickly which was great. We all ordered the brownstone punch which was great. I ordered the Jim Cade with my eggs scrambled well with cheddar and an order of hot chicken. My Jim cade came without the cheddar eggs so I alerted the waiter which was very nice. He took it back then brought it back to me swiftly but another disappointment. They basically heated up cheese and placed it on top of the eggs. I literally picked the cheese with my fork smh. I let the waiter know so again he took it back. I felt bad but this was wrong and not appealing. On the 3rd try the cook got it right.. We all ordered the Jim cade but had to ask for syrup, salt, pepper ketchup not a good look at all! The hot chicken was tasty no complaints on that. My cousin ordered the shrimp and grits which was very spicy and made different from the other location. And the grits were cold. The other location makes the shrimp in a cream sauce this one was tossed with peppers and onions. I mean overall wasn't a bad experience but I would go back to the other location in Bed stuy sorry. Again the waiter was nice and very accommodating but the food lacked Peaches flair.", "author": "Dee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "OMG! This place has some of the best food ever!! I ate here for brunch and had the hot chicken and French toast. Best chicken and best toast that I've EVER had IN MY LIFE! The chicken was seasoned and fried to perfection and was juicy. The French toast had a delicious crust on it that was sweet and crunchy. I opted to have seltzer water mixed with pineapple juice for my drink and it was very refreshing. I highly recommend Peaches.", "author": "Courtney W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "Was in the mood for dessert and decided to go too peaches hothouse for dessert. My best friend and I had the ice cream sandwich and it was to die for. The bread was lightly toasted, drizzle with light syrup and confectioners sugar. The vanilla ice cream in the middle was delicious. Didn't have food this time around , but will def come back for the dessert. The waiter was very attentive.", "author": "Maggie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "Yay! You mean I don't have to travel all the way to Bed Stuy any more to get my fried chicken fix? Yes, please, and thank you! So Peaches Hot House Fort Greene took over the old Smoke Joint location. They've only been open for about a month or so at this point so my friend and I wanted to check it out ASAP. I've been to the hot house in Bed Stuy many many times since I used to live in the neighborhood but I don't anymore so when I heard there was a new one opening up I was elated. \n\nMy friend and I came in on a Friday night around 6pm there weren't many people dining at the time so the service was speedy and generally attentive. We both ordered the fried chicken($16). I had the regular and she had the hot. She admitted that the hot was a little too hot for her liking while I felt like the regular was perfect and I got to splash on some hot sauce as I pleased. We both had the Mac n cheese for sides and split an order of French fries. I had a piece of cake for my dessert which was excellent and came with a big dollop of whip cream which I was an absolute fan of. \n\nWhile the food and cocktails we had were all on par I have to give a 3 rating for 3 reasons. While our server was pretty attentive he didn't bring over extra napkins/ wet wipes until almost the end of the meal. We were eating fried chicken with our hands; therefore, we definitely needed a few more napkins. Also, while I was walking back from the restroom I overheard whom I assume was the manager at the time talking to one of the employees in what seemed to be a very negative way about the basement being a mess and how it needed to be cleaned, blah, blah, blah. While this may have been true it just left a bad taste in my mouth, made me feel bad for the employee, and made me a little uncomfortable. Even if that conversation was necessary to be had I feel like it shouldn't have been had in a space where patrons could hear. Finally, this location simply doesn't have the same neighborhood/ cozy vibe as the original. Maybe the atmosphere and vibe will shift as business picks up but nevertheless I'll definitely return for the food that's fo sho! I'd also recommend this place to others who are looking for a spot before or after an event at the Barclays Center or BAM.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "Everything from the natural light to the wonderful service...perfect. Adding this to my must revisit NYC list. The hot chicken and French toast is incredible. The avocado toast is a perfect starter, too. I love this for a breakfast/brunch location! Fun music, cute servers. Couldn't ask for more.", "author": "Cara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "A very key corner in Ft Greene has morphed into a new Peaches and its not just hot chicken they are serving. They are serving up some mad Southern flavor with twists. They gave the place an update white washed the walls and viola.\nThe hot fried chicken or catfish or shrimp with a side is a deal. \nI went a healthier route.\nAte;\nSalmon avocado sauce and roasted tomatoes $22\nSides of broccoli and Brussels $12\nThe spicy lime salmon has everything you want with your seasoned fish-juicy roasted tomatoes and tasty avocado sauce.\nChile broccoli and vinegary Brussels made a delish meal. Service is super  friendly. I once trudged through snowy streets to try that Nashville hot on Thompkins Ave, and it's all that, but this new spot sends Southern to a whole new level!", "author": "Franny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-13", "description": "Peaches! Hmmm i was so looking forward to trying this place. Came on a tuesday nights with some friends. They don't have happy hour drinks. Drinks are $10. We got fried green tomatoes appetizer. Love the thin layer of corn meal, it was light and crispy with an arugula salad on top, bacon on the side. Shrimp and grits: Grits were nice and creamy and shrimps were perfectly cooked and seasoned with a nice kick. Chicken sandwich: It was nice and crispy. The chicken is well cooked and crispy but very oily, which was a big turn off. I wish the had let it rest on top of a piece of paper towel before putting it on the bread. The bread was amazing, sweet and salty, soft but with a nice chew. It came with a bed of greens. And of course, the hot fried chicken. It was hot hot hot. Chicken was crispy and perfectly cooked. Service was so so although the waiter was very patient while we calculated the bill. Overall, very nice sandwich. Not sure I'll be coming back any time soon.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-07", "description": "The Server walks over to me after 5mins of waiting.\n\nHe points at me.......\n\nI guess that was my cue to place an order.\n\nI suppose that's how The Fonz would take an order if he had a restaurant. He couldn't keep up with his section so everyone would get up and ask any available servers to help them. Not great service.\n\nChicken was good, mac was good, cocktails were good.", "author": "Red J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "Such a cozy and lovely little spot. Perfect for date nights or small group brunch. Avoid coming here with more than 3 or 4 people....the wait may be brutal!", "author": "Nk U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "Crunch of their fried chicken and spiciness of the dry spices will have us coming back.  Ordered the hot chicken extra hot, chicken sandwich and chicken and toast.  Extra hot is pretty spicy and we love spice, burns at the mouth but is a slow burn that cumulates with every bite.  Chicken sandwich is tasty complemented with a salad for a dose of healthiness.  The French toast was very thick and the granola crust added a good texture.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "Great service, delicious fried chicken sandwich that clearly uses really high quality chicken, and a nice space with a great location in Fort Greene. The kale chickpea salad starter was also fabulous.\n\nI hope they expand their drink offerings as they ramp up. I will also say that I ordered the chicken \"hot\" - I love Nashville-style hot chicken. I have a pretty average spice tolerance but this didn't even make a dent. I guess I'll have to order it \"extra hot\" next time.", "author": "Joe G."}], "servesCuisine": "Chicken Shop", "priceRange": "$11-30", "name": "Peaches HotHouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "87 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/e5z4Ig5wmc6UO7CqoEPZzw/ls.jpg", "@type": "Restaurant", "telephone": "+17187971011"}