{"aggregateRating": {"reviewCount": 38, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-16", "description": "Food was delicious my drink was strong and great how I like it good soft music playing in the background nice date spot or even family dinner date I wish my shrimp was a little more jerk but it was still good not sure if I wld return but it wasnt a bad plc", "author": "Gwendolyn O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-11", "description": "We came here for Mother's Day 2019 understanding that there are no reservations, something we're always apprehensive about because there's no guarantee of wait time. For a party of 5 around 6 o'clock on a Saturday, we waited 45 minutes to be seated. Once we got seated, we were promptly given service for drinks and appetizers, which arrived rather quickly. But, our server took a very long time to return to our table and take our order, only to return nearly 25 minutes later saying, \" Don't kill me but I misplaced your order. Can you tell me what it was again?\" At this point we've waited 45 minutes to sit down and another 30 minutes seated to find out our order wasn't even in yet. We finally received our food over an hour later, only to find it to be underwhelming and not good enough to justify the lack of decent service. We originally came here when the location was called SmokeJoint; and although it's located in the same place, HotHouse hasn't retained the satisfaction and authenticity it once held. We understand that things can get hectic when it's busy, and we're not the type to make a scene,  but we couldn't help but be visibly upset and overall disappointed with the experience.", "author": "Dondrey P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-25", "description": "This review is for delivery via caviar. I got the fried chicken sandwich and it was so salty I could not finish it (and I am a person who eats the salt off the salt rim of a bloody mary). Additionally, it was so greasy that I couldn't even eat the bun because it was literally sodden with grease. The sandwich had not a lot going on, no lettuce or pickle or anything even on the side. Kind of a bummer.", "author": "Felix C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-29", "description": "Decided to check out their Fort Greene location for an overdue dinner with a friend only two weeks after this location opened. The space is large, warm and inviting and the chicken was juicy, crunchy and delicious. The best part was that they didn't rush us, even though we sat there for about hours catching up on everything that couldn't translate properly on chat/text/email. \n\nDefinitely bookmarking for a future date.", "author": "Ki G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-17", "description": "Meh. \n\nThe location, ambiance, pricing, and portion sizes are great. But the food itself and service are average. Plus there is only beer, wine, and rum punch at the moment. \n\nGreat, roasted flavor to the short rib dish, but the meat was overdone and dry in t. Neither my date nor I cared for the sides. The sweet potato lacked spice; the broccoli was overdone and unimaginative (definitely not spicy OR charred); the coleslaw was soggy and really sweet. Service staff was polite but clearly unseasoned and clumsy (forgot items, checked-in before we tried anything, hard to catch). \n\nI can't recommend this spot - especially with such great options in the area.", "author": "Jolene H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-05", "description": "I went to this location and was extremely disappointed. For starters the menu was different. A side no longer comes with a the chicken/fish/shrimp meals, instead they now give you a \"salad\" and up charge for a side of your choice. Second, I was charged a fee for \"white meat only,\" which never happened before. Last, this location does not have the signature BBQ sauce (which is a requirement if you get the chicken 'hot'). The staff was dumbfound when I asked for it. Overall the meal was decent but it definitely wasn't the Tompkins Street location.", "author": "Erica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-23", "description": "So this review is based on only one visit and maybe we experienced none of the things other Yelpers have complained about because it was a Tuesday and kind of slow, or maybe Peaches has just worked out the kinks.  The space itself is pleasant but nothing fancy.  Our server was great: helpful, friendly, and adorable.  I liked that the menu was limited and I also liked that we could swap out sides (for example, I got the greens instead of the side salad)., and that we did not have to pay extra for all white meat on the chicken platter. We started with the hummus, which was very tasty.  The chicken is to die for: crispy, juicy, and not at all greasy. I ordered medium and it was pleasantly spicy; next time, I'm going hot.  The cornbread was big enough for two to share and it was great too.  Portions are generous.  I think next time I'll either skip the starter or get two starters and share the chicken.  We shared a chocolate brownie dessert four ways.  It too was quite good. I. Looking forward to a return visit.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-28", "description": "Came here for brunch. Really enjoyed the Chicken and Toast. It's a boneless fried chicken breast plus french toast. I enjoyed the Nashville heat on the chicken, spicy but not overpowering. It comes with a small side of cinnamon apples. Will come back again!", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-29", "description": "Well yesterday was COLDDDDD hubby and I ventured out....on foot to have a bite at around 1145am.... To beat the lunch rush! Well lo and behold they're CLOSED!!!! I checked the website and Yelp AGAIN and they\"open\" at 11am...... We as a people HAVE to do better!!!! I don't think we'll be back... If they couldn't bother to open or change their message to reflect the non opening then our hard earned money can be spent elsewhere!!!! After all we do live in the mecca of restaurants and take out of Fort Greene....", "author": "evangeline j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "The food was great, and the staff was very nice, I made reservations for 10 people weeks in advance with email communications. I was very nervous, because the reviews were all over the place, but I was pleasantly surprised. I will visit again! Soon.", "author": "Ketryna A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-31", "description": "I wanted to love it. It was billed as the best chicken sandwich in the world... and perhaps that was the issue...too grand a name creating impossible expectations. The batter was tasty but there was too much of it covering too little meat. The thigh piece I got was dry small pieces of meat between huge chunks of fried batter that made it impossible to eat. My wife and kid were happy with their meals and we had a great window seat...but I was not into the food. Sad cause I can literally see this place from my window...", "author": "Sydney K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "I should start out by saying that I love fried chicken and I don't really do spicy...so their regular chicken was perfect for me. The greens were slightly spicy for my little white snowflake taste buds, but they were seasoned well. Our server (I think his name was Travis?) was perfectly attentive and unobtrusive. And that cornbread...you should go there just for the cornbread. It was perfection.", "author": "Lorraine W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-30", "description": "Only reason this review has two stars is because of the server Edwin. Everything else about this is trash. I miss Smoke Joint. Despite the name, it is nothing like the Bedstuy location. The prices are a lot more and the food quality less than expected. The drinks recommended by Edwin, Mango Cognac was amazing. The Mac n Cheese tasted like Velveta Mac n Cheese. The fried chicken had no taste at all. Just bland as a piece of paper. Eating the food just made me nauseous and angry. I am extremely disappointed and under no circumstances will I step foot back here.", "author": "Anthoneil L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "They have done a great job remodeling. The dining area is now open and warm. The staff are very friendly and attentive. The sides are excellent! Unfortunately the fried chicken is very, very bland. I ordered the hot chicken and it didn't even taste like salt and pepper had been added. The server brought hot sauce, but it didn't make up for the tasteless chicken.", "author": "Samuel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Food, service and ambience make this place A MUST GO TO. It was super difficult to choose from their very unique and appealing menu, but if you start with the fried shrimp or dry rub chicken wings you wont be disappointed. The \"best chicken sandwich anywhere\" is exactly that! Chase all that with their Rose wine and you'll be left with no other option but to write your own finger licking review.", "author": "Lu R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "Disappointed.\nI was ignored at this restaurant.\nThe waiters walked by me and did not attend to me, so I seated myself.\nAt the 10 minute mark, a waitress said, \" I'll be with you shortly.\"\nShe continued to serve other people.\nAt the 15 minute mark, I slowly got up and headed out the door.\nThe restaurant was not at all  busy or half full.\nTotally Disappointing !", "author": "Randy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-13", "description": "I have eaten at other B\u0026G restaurants and this newest one does not disappoint. Formerly The Smoke Joint, Hothouse is the newest iteration in the B\u0026G restaurant group. Sampled several dishes as my friends and I shared from each other's plates. Fried Green tomatoes with bacon were outstanding. Pork so tender and flavorful. Go jerk shrimp and grits if you like spicy. And whatever you do, save room for dessert, those were over-the-top as well. You will leave satisfied, full and glad that you chose to eat here.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-17", "description": "Food was alright. Had the short rib and grits and the house noodles with pork to start. I would not recommend the noodle dish. For $18 i can make my own spaghetti, season with soy sauce and add whatever leftover meat I have in the fridge. Throw some fresh cilantro on top to make it look special. Yup, that's all it is. Short ribs were tender and had a good amount of meat to the dish. Flavor was not special but this was a passable entree. Service here was bad. We were seated and then forgotten. We were repeatedly ignored and had to track someone down to order, then to ask about our order, then later to order more drinks, to pay the bill, get our cards back. At each step the wait staff would just whizz by without stopping, or literally make eye contact but then not check in. Totally frustrating. It's strange to feel invisible when all you want to do is give someone your money for a glass of wine and some dinner.", "author": "Odetta S."}], "servesCuisine": "Chicken Shop", "priceRange": "$11-30", "name": "Peaches HotHouse", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "87 S Elliott Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/e5z4Ig5wmc6UO7CqoEPZzw/ls.jpg", "@type": "Restaurant", "telephone": "+17187971011"}