{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "We're at the Greene Grape ANNEX for coffee and breakfast, but did not get a chance to stay. We wanted breakfast, and they had stopped servicing breakfast the place was a nice coffee shop which was one among many in the neighborhood. I will have to visit the next time I'm in town.", "author": "Phillip A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-14", "description": "Unfortunately I had a very bad experience here. The staff was not very welcoming which I can understand when it's busy. I informed if they served oat-milk. A question I regretted right away. The girl behind the bar was very snappy. Anyway. I was ordered a almond matcha latte. In now way the beverage met my expectations. The powder wasn't wel mixed and my drink was full of gravel. I literally needed tot gag when I drunk it. Now I know how  a tea of \"Roland Garros tennis field\" taste like. \n\nI can't say anything bad about the interior. It was kind of dark. Which I liked very much. It had a very nice fall feel. So I'm sure this was a one time bad experience. But I owe you guys my experience.", "author": "Bram Michaël C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-12", "description": "Please read my review on the Original Annex. \n\nI asked about those amazing blueberry scones and kale baskets today and the barista frowned and said \"ahhh you remember? Those were heavenly. Unfortunately that baker is no longer here. So our scones are different now... Those were a different level\".  \n\nI concur. \n\nI ordered an egg muffin (asparagus, 1 mushroom, almond meal, feta). It was horrific. Wayyyy too salty. It was the only flavor that I could taste. \n\nThe only good thing about the new spot is that it provides people with laptops a place to squat for hours. \n\nTheir food has nosedived into mediocrity. Also, they are playing the Britney Spears soundtrack on a Saturday morning... This is Fort Greene not Williamsburg, damn it.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Spacious cafe with a robust WiFi connection. Downside is some seats are pretty cramped and your WiFi expires in one hour until you make another purchase. They have good coffee and also a couple of vegan baked good options. Good place to hang out but be ready to make purchases on the hour if you need to use their WiFi.", "author": "Vicky J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Had an amazing kale salad here... That's right, they're making salads with kale now!*\n\nIt's also great place to work, good energy, a lengthy green tea selection, coffee, and a lot of people posting up on laptops at shared tables.\n\nThey could use some more outlets though, and having to ask for a wifi-ticket makes me feel a little dirty. \n_____\n\n*For anyone reading this who has been in a coma for the past 10 years.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "I sat with my comedy co-writer, across from one another at the communal table, discussing our upcoming show. Include a musical sketch, spoofing \"Talk Dirty to Me,\" called \"Talk Nerdy to Me\"? A catchy idea. But a quick Google search, on the wifi supplied on a slip of paper when you make a purchase, showed that a group had already spoofed it in Star Trek costumes, plus a Huffington Post science podcast had taken the title as well, and t-shirts were everywhere. But our idea was four women calling Tech Support, turned on by the competence at the other end of the line. Was that different enough? Was there still room? The sauce on the egg and bacon biscuit was extraordinary.", "author": "Soren K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-23", "description": "Stopped in for a quick cup of tea and treat. The tea selection is ok- about 5 greens, blacks, and herbals (nothing too fancy or inspiring). The desserts range in price from $1.50 for a cookie (the chocolate chip oatmeal was perfectly oaty and not too sweet) to $6 for small artistic tarts. I had a coconut macaroon that was good, not too sweet or sticky. \n\nThe space is huge and there are picnic tables out front. The staff were friendly enough.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "I went in the afternoon to have an afternoon snack and to study. The cafe is quite spacious and there are lots of tables to work at. They have a nice no-laptop area and great sofa seats right next to wide windows. I stayed at a large table to work (ended up staying like three hours!), and it was a very enjoyable experience over all. There are two bathrooms that are quite clean and a water dispenser as well.\n\nI docked a star because of the food I ordered. I got a cup of hot chocolate and a buttermilk biscuit - the buttermilk biscuit was tasty, but the hot chocolate tasted a bit diluted and the cocoa powder sank to the bottom. \n\nOverall a great, cozy cafe!", "author": "Ellen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "The best coffeeshop for getting work done or people-watching in this whole swath of Brooklyn-- and that's coming from someone who's willing to go far out of his way.\n\nFood all the time, beer and wine at night. Cushioned seats if you're not laptopping, a few different little areas for laptop use. The platonic ideal of breakfast sandwiches before noon. Counter staff who will go out of their way for you, and who deserve thanks and ~TIPS~ for deftly, calmly handling some pretty entitled people, myself included.", "author": "Seth M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Great space.  Ample seating but yet still feels cozy and warm.  Love the decor and multiple seating areas (i.e. front lounge area, by the bar, dining section with no laptops allowed and communal picnic tables).  Good selection of drinks (non/caffeinated and alcoholic) available.  Food and snack is on the pricey side but likely priced for those to stay 1/2 the day using their laptops and charging station.  Mix periodicals are kept near the front of the cafe.", "author": "Angela N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "No decent gluten free pastries. When I went there this morning they only had a cauliflower egg muffin that was a bit strange. I didn't like the cauliflower in it. There was no sweet pastry option (muffin or other) available, which is what I really wanted and what makes the most sense for a coffee shop. My favorite cafes have a range of options that are gluten free but appeal to everyone since the quality and flavor of their cookies or muffins is so good.\n\nI have been a longtime customer of their sister businesses: Provisions and Greene Grape, where I have been pleased with their service and products.  I have enjoyed coffee here for a long time, and it is very good. \n\nI hope that they will improve their options!", "author": "Lucy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "I really just dropped in to see if anyone reviewed the most amazing breakfast sandwich! Which, I don't believe anyone has. So... I love this place. It's got spots to sit and work, and it's got a super friendly staff. But really, hands down, my favorite breakfast sandwich. I know that the ingredients come from the local Greene Grape Provisions market, and they're always fresh and delicious. The sandwich is on a hearty english muffin, has egg + bacon, but really the scallion tomato jam and the siracha mayo make this thing. It's really just so delicious. I want it for every meal of the day (but that's a bad idea). It also comes in a veggie option. But I love bacon.\n\nThe bacon egg cheese hand-pie is also super tasty. \n\nCoffee is great. I prefer the hot to the cold brew, personally. \n\nSolid go-to in Fort Greene for a quick coffee/breakfast/email break.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "I like the concept of a laid back bar table (NOT a dive bar) coming together with ample pastry options, good sandwiches, and decent coffee. There are a handful of cafes doing this already, which is still a rare sight in New York, but the fact that this one is in Fort Greene (four subway stops away from me) means that there is absolutely no excuse for me to miss out.\n\nI didn't go to the bar so I'm not sure about the bar lady, but the guys serving coffee was pretty darn chill - I even tipped, which I never does at cafes, considering their good attitude and how long I'm gonna sit my butt on one of their tables, camping out with my laptop.\n\nThe cafe au lait (my staple order) was nice - good texture, and enough milk that I know they didn't mess it up with lattes. You wouldn't believe how many cafes make mistakes like this. My cinnamon donut was meant to temporarily quench my hunger, but I came to like it a lot! It is sugary, but unlike your typical glazed donuts, it won't leave you feeling guilty about yourself for rest of the day.\n\n30 minutes of WiFi is on them, which is a pretty good gesture since so many cafes don't even make internet an option anymore. I feel a little bad that after the time limit I immediately switched toward my cell phone hotspot, since I heard buying an access code isn't that bad either.\n\nIf I lived closer to Fort Greene, I would've made this place my home. But for now, coming every now and then on chilly weekends sounds like a good plan.", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-17", "description": "This review is only in regards to this cafe as a place to get work done. There's limited space in which you can have a laptop, two large tables and an alcove with three or four seats. I came in on a rainy Tuesday afternoon was able to get a seat but also tried to come in on a Sunday one time and it was super packed. \n\nTwo things I didn't like \n1) the lighting was dim so the place is pretty dark after like 4 pm in the winter :-/\n\n2) the wifi code was supposed to last 90 minutes but it was expired after only an hour... \n\nPositives: they have a large selection of drinks and the staff was decent", "author": "Jassie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "As someone who makes coffee for a living, this has got to be the worst coffee I've ever had. I ordered an espresso which was served to me in a cappuccino cup, the cup was so unbelievably filthy (see photo) it was shocking. Couldn't believe someone would actually serve a customer in a visibly VERY dirty cup. \nI also ordered a cortado, which was barely warm, I would go as far as saying cold and tasted bitter. Lastly my flat white was un-drinkable, cold and so much foam on top I thought I was back in 1995 for a minute. \nSuch a shame as the atmosphere is lovely.\nOne guy who appeared to be the chef (?) was pretty nice about it, but the other guys didn't give a flying f*ck..\nI know sometimes cafes have bad days, but..just wow.\nThe granola was good.", "author": "Gianna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "At first glance, the Green Grape Annex is like any other annex: \"a subsidiary building or an addition to a building.\" But man, is that second glance a doozy!\n\nThe staff is fantastic. And the food--the food is franktastic! Let me explain.\n\nThey have a little known specialty, endemic to the couture culture of the Brooklyn foodie. Ask for the \"hot dog soup,\" a vegetarian stew with a uniquely piggy flavor. Oink! Wow, do we \"pig out\" when we go to the Green Grape Annex! My girlfriends love it.\n\nMake sure to ask for Austin; he makes the best \"hot dog soup,\" or \"frankfurter stew\" as the villagers colloquially and affectionally call it.\n\nLet me know if you tried it, and keep your eyes peeled for my forthcoming blog, \"Chorizo Chowders and Hot Diggity-Dog Deals\"!", "author": "Jake R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "Great food!! Didnt realize they sold food until recently and its a game changer. If the prices weren't so high I would definitely give it 5 stars.", "author": "Sand Ra N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "Finally a study spot near by me! Love this place. The music is nice, calming and conducive to studying and doing personal work. There's also good selection of wines to do your work with if you prefer that over coffee, but coffee/tea is also available. \n\nThe place is nice but gets really packed and I suggest that you have your laptop fully charged before coming here or you may not luck out to be near an outlet.", "author": "Marybelle P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "This place does the Brokelyn wine deals and has a FANTASTIC rosé: not at all bubbly and yet still refreshing. The ambiance is weird: sort of a place to study but like if you want to concentrate you probably need noise canceling headphones. The music is sort of loud, sometimes white moms bring their babies with them (?), and the actual \"comfy\" seating is so sparse you're honestly just going to end up on a tall bar stool staring out the window. Decor is minimal but agreeable. Come for the drinks.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "A freelancer's heaven or hell. Wi-Fi is paid -- one item for 90 minutes. This place is ALWAYS crowded, but if you're working, you're in good company. It's big, and there are lots of places to work. The food is really surprisingly good -- even for us gluten-free folk. The coffee is decent. There are often tons of families here. I love it because Greenlight Bookstore is just across the street! This place is a favorite of mine if I'm ever up early enough to snag a coveted table seat.", "author": "Kelsey W."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Greene Grape Annex", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "753 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/5gjfCtspGqcOBrXXVmRb4A/ls.jpg", "@type": "Restaurant", "telephone": "+17188584791"}