{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "Get a table outside, post up and people watch. Very knowledgeable and engaging bartender was there on sunday. It was a blonde woman. I like it there.", "author": "Jean L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "came in here for a warm beverage. The place is very homey and relaxing. i felt like I was in someone's living room. I had the latte and it was pretty dam good. great flavor balance. good spot to chill and work.", "author": "Luis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "This is one of my favorite spots in Fort Greene. It's a \"watering hole\" of sorts, where locals gather and/or work. It terms of food \u0026 drinks, I suggest the dirty chai and egg \u0026 bacon sandwiches. Also, the farro bowl with bacon (note: you have to ask them to add the bacon) is bomb.", "author": "Gordon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "I like the Annex a lot and I never want it to go away. I use this space often for work and meetings, and have always been satisfied with the amount of seating, the availability of outlets, and the quality of seating. Food is really good for a coffee shop and coffee is, well, really strong.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Found this place the other night while looking for a place to hang with friends. Very warm and inviting atmosphere, I loved all the plants and their style of decorating! They carry a good brand of tea and I like that people can also get alcoholic drinks. Friendly staff. Would definitely come back here.", "author": "Julie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "I had an awesome experience here.  I came early on a Sunday and snagged one of the comfy couches in the window.  The service was excellent, as was the food and espresso (I had an Americano and oatmeal).  Cool location, lots of seating choices (communal table, couches, regular tables, etc).  Great place!", "author": "Eva C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "Racist staff. Particularly this bearded shorter white man who works the counter on Sunday mornings. He should treat ALL customers with more respect.", "author": "Marce F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "Couple things: \n\n1. I never take the time to post on this site...I do it here because I think you need to know something about the Annex before going there. \n\n2. The annex is an amazing place, if you can avoid one thing: \n\n3. The woman who serves the coffee is the most OBNOXIOUS, abhorrent person I've ever had the distaste of interacting with. She speaks loud enough to where even bose headphones cannot drown her out. She has zero respect for the customers she serves, and zero enthusiasm for her job outside of fraternizing with her coworkers at inhuman volumes. Her presence alone is the only reason I will never go back to the Annex, despite the fact that the space and the people are amazing.", "author": "Prav C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Cheddar chive biscuits and other treats.  Good coffee.  Free wi-fi (90 minutes with a purchase). Lots of places to recharge your devices. I enjoy their music selections but oftentimes it is way too loud.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "I love love love this spot!  It's so cool that you can get coffee, tea,  beer,  and snacks from one place.  And I love all the plants.", "author": "Zahra A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-03", "description": "a lot of seats for you to choose, at bar, long table, couch...etc. cozy place but kinda loud. hardly find a power supply to charge laptop. and the wifi is not real free, you have to purchase something then will get an access code for 90 mins wifi. it's a strategy to stimulate people buy anything to keep wifi activated, but it is not friendly at all.", "author": "Harvey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Wonderful spot for hanging with some friends or chilling on your laptop. I highly recommend the coffee cake muffin , so good!", "author": "Rose R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-10", "description": "I really like the work space and selection of beverages. \n\nMy complaints are that the staff are kind of unfriendly/seem to have attitude issues. I can take my business elsewhere and not have to deal with pejorative hipsters who remind me of Barry from High Fidelity. \n\nLastly, they used to have a good food selection esp. for evenings (i.e. a cheese plate, mixed olives, mac \u0026 cheese...), but they changed their menu and now it's limited to overly dry sandwichespastries or a crock of pickles. Wtf? I like the idea of a cheese plate with my wine much more than a brownie, thanks.", "author": "J T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "The Annex is a neighborhood coffee shop slash bar.  It's set up nicely inside with various options for seating (many of the seats are no laptops allowed to keep the turnover high), including a bar, low stools along a big communal table, booths, and couches.  There are a few plugs in the laptop friendly seating areas but it's best to come fully charged.  It's a popular place for people to go to do work (free wifi, ask for the password), to meet for a chat with a friend, or to grab a coffee and breakfast before heading to work.  It also picks up again around happy hour with some drink specials.  Prices are on the more expensive end (no surprise there).  They've got a variety of muffins, scones, and quiche (I loved my bacon cheddar corn quiche--so delicious), as well as coffees and teas.  The bar selection looks pretty diverse as well.  The staff was super friendly and helpful while we were there too.  Hope to come by for lunch or in the evening sometime soon!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "I like this place, I really do, but it's so impossible to find a place to sit that I don't even bother walking by here anymore.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-03", "description": "Good place to do a little whistling while you work. It can get a little loud sometimes, so bring headphones. Also have your laptop fully charged before you get here. Not many outlets. Good sandwiches and decent beer selections in addition to the usual cafe options.", "author": "tanya s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-08", "description": "Disheartened by the Annex today. I was very excited to spend the morning there researching for an art history paper and purchased a skim latte and frittata ($8)... only to realize that 90 minutes later, my WiFi expired and they wouldn't renew without another purchase! I realize they need to maintain turnover, but there were plenty of open seats. Not a good vibe from a place I used to love (is this a new policy?). Knowing me, I probably would have needed another snack soon--but am not thrilled about being strong-armed into a 90-minute snack timeline. This is Fort Greene, not Manhattan.", "author": "Eve C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-24", "description": "The food and coffee is fine, but I waited over 20 minutes for a sandwich. I understand that each sandwich is made individually, which is great, but were they making the chicken from scratch at the moment I ordered it? If something is going to take that long there should be a warning on it. I thought I'd be in and out in 30 minutes, so I wouldn't recommend this place for anything quick. Also, wifi lasts 90 minutes and you get one code per purchase, so if you want to stay for more than 90 minutes don't get all your treats at once.", "author": "Anna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "I have to agree w the other folks here who complain that the music can sometimes be way too loud. Otherwise though, this place is amazing. It's flooded with light, crowded with people getting stuff done, has excellent coffee and great snacks. I love it.", "author": "S J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "One of the few independent coffee spots I've found in New York with a proper seating area to get work done.  It does fill up, and sometimes the music is a bit loud for 11:00 a.m. on a Sunday.  Cafe Grumpy coffee is great.  I love this place, I just wish they'd add a soy milk pitcher at the cap station.", "author": "Michelle H."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Greene Grape Annex", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "753 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/5gjfCtspGqcOBrXXVmRb4A/ls.jpg", "@type": "Restaurant", "telephone": "+17188584791"}