{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Mad love to the barista who made my little one his first hot chocolate! He loved it! \n\nOh, and the lattes are amazing. Seriously. The smoothest in the area.", "author": "Erika G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "This is probably my favorite cafe to hang out working on my lap top or reading a book. It has great food for both lunch and breakfast. I've also had some drinks at the bar here before walking to a concert. I came her often over the summer since I used to work over in Brooklyn. Even though I no longer work over here whenever I am around the area I make it a point to come back. The service is quick and the people are super sweet and full of love. The atmosphere is warm and welcoming. I highly recommend this place!", "author": "Charlsey C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "Very Unprofessional Customer Service\n\nAlthough they close at 9PM they begin breaking down LOUDLY a full hour beforehand. This includes one employee in particular who traipsed from one end of the dining area to the other singing along uninhibitedly to Meat Loaf's Bat Out Of Hell that was playing over the stereo, which was also too loud, as usual. She also opened the front doors, ostensibly to air the place out, except that it was 54 degrees outside! Treat your customers with some respect! Considering the prices people pay here, the service is kind of terrible.", "author": "Rich W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "Disclaimer: I'm pretty picky when it comes to coffee and tea-I've been drinking and making both for years and really get into it.\n\nThe interior of this place is pretty cool. It's pretty big with lots of communal tables and lots of room (for a local coffee spot in Brooklyn) in the front area. Whoever decorates here is lots of fun: colorful flowers and mirrors everywhere-yet doesn't distract from the relaxed vibe. Seems like a good place to get work done or have an intimate conversation. \n\nI know, sounds like a 4 star rating except every time I go I try something different and it's always meh. This is just for coffee, I haven't tried the pastries (which look really good) or sandwiches or anything. \nI got a latte once and it was just that, a latte. Nothing really more to recommend it except I drank the whole thing and didn't totally regret it at the end, but I didn't exactly enjoy it either. (I know, sounds so picky and if you are cool with whatever coffee then you'll probably be fine!) \nLast time I was there I got a green iced tea and it was ok. A little watered down tasting, not a very clear favor to it.\n\nSo that's the story. It's fine. Not amazing but not bad either.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-03", "description": "A friend and I were taking a stroll through Fort Greene on a cool December afternoon. I don't live in BK, but since my friend was visiting from Spain, we decided to wonder through some neighborhoods that I don't usually frequent. Since it was actually quite cold outside, we were in the mood for a warm drink to carry on our walk. We stopped in front of Greene Grape Annex, I \"Yelp'd\" it, and we went inside. It's a pretty large space with a variety of seating options. There were people catching up with friends, eating, reading, and doing work on laptops. It was pretty full when we walked in, but given the number of people inside, it wasn't too loud. Two women were working behind the bar; one taking orders and the other making drinks. They worked super fast, and the line moved quickly! My friend and I both ordered hot chai lattes. They were good -- full of flavor, not too sweet, and with a little spicy kick at the end. I'm not usually in Fort Greene, but if I find myself in the neighborhood, I would stop by again.", "author": "Chi E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-22", "description": "Meh. Very nice ambiance and the communal table for laptop work is a nice touch. But the lighting is very dim and I couldn't find an outlet in sight. \nOver expensive green tea latte and slow loading internet (I like the concept that you have to ask the barista for the wifi password so people don't perch all day but c'mon now!)\n\nI try not to be that persnickety Brooklyn native constantly bemoaning gentrification but places like this make me feel less bad about keeping it real on that front.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-13", "description": "Would not come again.\n\nIf you're an avid coffee shop go-er, you won't be satisfied with the Greene Grape Annex.  On a hot sunny day, you walk into a warm and poorly air-conditioned shop that smells like burnt bacon.\n\nSpace: It's big and there are dedicated tables for laptops. On the surface, it looks like a freelancer haven but the tables are tight and it's way too crowded.  Beware, this is a one-hour wifi per purchase place and the wifi is incredibly slow.\n\nCoffee: I had the Cold Brew.  It's expectedly expensive at $4.50 for a 16oz.  The coffee was really, really bad.\n\nService:  This was probably just my experience but the cashier guy was pretty rude.  He grabbed my credit card out of my hand and wasn't nice about it at all.\n\nYou don't have many options in Fort Greene but, even so, stay away.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "Productive vibes study café. Affordable drinks. Open late.\n Ice Hibiscus Tea $2.50. Delicious and crunchy veggie-hummus sandwich that's around $8 but is very large and filling.\n\nTables not always clean.\nFew tables don't allow laptops.\n1-hour only free internet.", "author": "Marium A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-20", "description": "Very cute cafe, loads of space. Visited on a Friday at 2:20 pm. Ordered a toasted sandwich that took 20 minutes to make. They don't know how to multitask - the food prep guy completed the order before mine and waited around while it was cooking before even starting my basic sandwich. I saw the barista with very long nails handle the bag of cold brew with her bare hands - I wonder how many bags of coffee that contaminated.", "author": "Oluwa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "This place is amazing! I was recently working nearby for work and this place quickly became my go-to for a light lunch. Everything I had was delicious, especially the butternut squash and avocado toasts", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-05", "description": "I unfortunately have to give this place 2 stars. Don't get me wrong, it's a solid place to get work done but not for an extended stay. I had to purchase something every time I wanted to use the Wi-fi which I found ridiculous and turned me off. (Because of this, they've lost a customer. Wi-fi should not be based on purchases in a cafe.) People are trying to get work done so an hour of wi-fi is simply too short. Also, the wi-fi is pretty unreliable - I kept getting kicked out of the network which is not good. Lastly, their customer service is lacking. Some of them behind the counter are nice but overall, a cafe should feel warmer. \n\nI ordered a Paloma, Matcha Latte and a Plum Brioche - pretty decent.\n\nIn terms of work environment, there's an abundance of outlets but the area can get tight. Also, because people must purchase something to use the wi-fi, the work table gets filled with empty cups and dishes that are not picked up or cleaned by any staff. The music is also loud. It reminds me of a bustling open office but I prefer a more quieter environment so I will be looking elsewhere. \n\nWith the mixture of poor customer service, lack of cleaning the work area and a purchase of an item every hour in order to use the wi-fi, I will never come back here again. There are a plethora of better cafes - so Greene Grape Annex needs to humble itself a bit.", "author": "Annette C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "I like the space. It's inviting and cozy. What I don't like is the fact that you only get 1 hr of wi-fi when you purchase an item. The chai iced latte was good but I ended up just purchasing 24 hr wifi access for $4.99 when my hour was up rather than buying ehh food items that end up more pricey.\n\nRidiculous wifi model although it at least offers wi-fi unlike Hungry Ghost down the street.", "author": "Leilani L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Decided to visit Greene Grape Annex to kill time while waiting for  my table at Brooklyn Moon Cafe to be called . I sat at the bar, which I had the coffee cake and a half/hlaf (lemonade/ice tea). The coffee crumb cake was delicious, not to sweet just right. The half and half was good as well. I really enjoyed the items in which they were not high in sugar , in which I'm not of super sweet things. Can't believe I never visited Greene Grape Annex in which I always pass it. After reviewing the menu , I will definitely give Greene Grape Annex another visit.", "author": "Maggie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "I love this place.  It is a cafe. It has brunch. It does drinks and happy hour. I mean, can you ask for anything more?  The vibe is so relaxed by clean and yet brooklyn but also cozy. Annex gets it all right on. Went to see a movie at BAM and we were looking for the after movie drink spot and so glad we walked in here.  I had been here before with friends and didn't realize they had adult beverages so it was a pleasant surprise.  Their double chocolate sea salt cookie was chocolatey with that beautiful touch of salty goodness. The French 75 was crisp and refreshing for a hot summer night. The Rioja was dark and smooth. The staff were super friendly. We will definitely be returning for coffee or brunch very soon.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-27", "description": "Such a disappointment. \n\nI didn't like the latte or olive oil cake I had, although that alone is not what soured me on Green Grape Annex. \n\nThe customers it seems want to sit and have coffee or food and work on laptops. Many of the tables, however, have no laptop signs. My friend and I bought $20 in coffee and cake after which we realized that the only tables available had \"No Laptop signs.\" Our decision to meet at GGA was for a working lunch, get some things done, chat, enjoy some treats. We couldn't.The staff was fairly cool/rude about it, and in the end, it was neither a productive or enjoyable visit. \n\nWe would have been there for the same amount of time either way. We spent the money and in truth getting us to stay longer would only have meant spending more.\n\nI understand camping is a financial problem, but so is not finding a way to accommodate paying customers. Rather than having rules about table use, you could just set a time limit on campers - 2 or 3 hours max - something like that. \n\nComing here just wasn't pleasant, and I think its fundamental to the seating rules and the staff. We won't be back.", "author": "Luke L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "Annex has a really cool cafe vibe to it. Looks like a great place to plug in headphones and get work done. There's shared tables and more cozy couches and stuff in the corner. They also have a limited food menu as well.\n\nI stopped in for their full strength cold brew (tip: tell them what strength and what size you want and they'll be appreciative). It was definitely strong. Pretty good.\n\nWill definitely stop by next time I'm in the hood.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Enjoyed drinks here on a Saturday night. I had the Rioja, which was great, and my wife had a cocktail which she enjoyed. Service was friendly and very good. \n\nCoffee shops are not a typical place to hang out on a Saturday night, but we had a great time here. Good place to meet up with a group of friends.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "I have one specific gripe. There's a barista there who LOUDLY and REPEATEDLY uses the F-word. \n\nIn regular conversation, mind you; she's not cussing at customers. You can hear her above all the buzz of machinery n conversations. \n\nThis is not a nightclub. It is not a bar. Forget cool. Forget hipster. \n\nPeople bring their kids here. Unacceptable for an employee to talk like this.", "author": "Chrissy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Great coffee and food when ever you are in Brooklyn get an americano and annex sandwich yummy", "author": "Kamal K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Get the toad in a hole. A delightfully fresh brioche bun with an egg cooked sunny side into the center. Sweet and filling!", "author": "Dominik D."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Greene Grape Annex", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "753 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/5gjfCtspGqcOBrXXVmRb4A/ls.jpg", "@type": "Restaurant", "telephone": "+17188584791"}