{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-13", "description": "This place was the first place I ever had avocado toast and it was delicious. The food options are pretty simple but they have great ingredients. It can be very loud, and also hard to find a place to sit. Maybe get it to go and sit somewhere else.", "author": "Brigette K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-18", "description": "Review of doing work here:\nLoudness: I would say it is pretty loud. Lots of people are doing work, but just as many people are enjoying their time. With earplugs that control the volume up to 32db, you are fine.  3/10.\n\nOutlets: neither of the two outlets near me worked. My seat was if you walk in and take a right, you will see a long table on your way to the bathroom. My back was to the counter next to the column. Because my outlets didn't work, 3/10.\n\nBathroom: There are two of them. Both were fairly clean.  I went twice and never had to wait longer than 3 minutes. 9/10\n\nTable height: if you are average height (I am 5'9\") the tables are at a good height for writing and typing. It was also not wobbly which makes me happy. I also never had a weird occurrence of accidentally touching the feet of the person on the other side of the table, although I had four different people sit across from me. 10/10\n\nChair comfiness: I was seated in a nonbacked chair. I think these are strategically placed to ensure you can't sit forever but I stayed at the coffee shop for more than 5 hrs and it was fine. 6/10\n\nLighting: 3/10. Very dim lighting which at this time of the year (mid to late November) made it difficult to see my notebook after 6 pm. The windows are ideally made to bring in the light so during the day, it was wonderful.\n\nPaying: No card minimum which is great. They also take cash and have tax included in the beverage price. So $2.50 for a 16oz beverage with a 20% tip is $2.96. 8/10\n\nCoffee: Stumptown. Fairly strong dark roast? Not really that great at breaking down coffee types. 7/10. \n\nHours: Daily, open during the hours of 8am-9pm. 10/10\n\nWiFi: You get the password when you make your purchase on a slip of paper. Make sure to ask for it. Without it, the spectrum wifi was shotty and so was my cell signal. I have Sprint and with LTE I was downloading at a speed of 1.72mbps/sec which feels like death. 4/10\n\nFood: Tried none of it BUT this guy in front of me got an avocado sandwich and it smelled great. Saw a lot of people order soup and essentially lick the bowls dry. Based on those two impressions 9/10. \n\nOverall: a good place to do work. Just kind of busy and make sure your items are charged or else you might need to go back to pen and paper. 72/110 =0.65*5(because 5 stars is the greatest it could be)=3.27 star rating which I cannot give. Since it is not greater or equal to 3.5, round down to 3.", "author": "Jerrius J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-17", "description": "I've been to this place quiet a lot now and I have mixed feeling. I usually get latte or ice coffee and both are ok. They have good selections for brunch/lunch and the ones that I tried are so far good. My only complain is how loud their music is. I know this place turns into more like a coffee/bar in the evening but even daytime it gets pretty loud with their music. They have beautiful interior so hope they keep the music a little less loud!", "author": "Eileen. J. K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-13", "description": "I am a frequent and long-standing customer. It gets very busy but with a bit of patience I can usually carve out a spot for me and a pal. Coffee is good, pastries super yummy. Main gripe is with staff, which could be a bit friendlier while being more efficient, and with the dearth of reusable mugs. Please buy more mugs! I'm sure I'm not the only Brooklynite looking to reduce plastic waste, but if I'm eating/ drinking in, i should never be getting disposable cups or plates.", "author": "Julie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "Second to last day in NY and we stopped in. Son needed to get some homework done before getting back home so he worked on his laptop while sipping coffee and having breakfast. I ordered a latte and the avocado toast (my fave dish back home) while my wife and I chatted about upcoming vacations. Ambiance was chill. Music was also good. Awesome work tables and a lounge area in the corner with comfy chairs. ATM inside. Overall, looks like a cool neighborhood coffee shop I would frequent - if I lived in the FG area.", "author": "Familia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "The avocado toast here is da bomb. It has feta cheese and purple onions, and you'd better order it with bacon because it's crispy and flavorful and just the best. The side salad has some great dressing, though they did drown it a bit this last visit. I've also tried their matcha latte and mint tea and they were both wonderful. The space has many seats and a communal table with plugs for electronics, as well as designated tables with \"no laptop\" signs. Ask for the wifi code and they'll give you a few wifi tickets with passwords so you can sign in. Overall this place is great whether you want a yummy lunch, quick drink, or to sit down for some quality tech time or studying. Highly recommend.", "author": "Celia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "A lovely, plant and light filled spot with good coffee and good food. The inside is all blue and white, complimented by potted plants in every corner. It's a pretty big place with lots of tables and benches.\n\nThe coffee is Grumpy or Oslo, and it packs a punch. Cold brew is very strong with a deep flavor- highly recommend.\n\nThey have lots of toasts and bowls if you're hungry, and the squash + feta toast was delicious. Comes with a lovely little side salad and is a perfect size for a lunch. \n\nIf you want to come here to do work, beware that they have some weird rules about where you can sit with laptops and how you can get WiFi. Hence why I would recommend it more for getting together with friends, but to each their own.", "author": "Annabelle V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Fort Greene is always a taste of the good life. They don't have just a coffee shop. Nope. This place is like a coffee oasis! I could lounge here all day. \n\nThe place is super modern, comfortable and the design pieces are spectacular. I love the paint splash wall. I am super into the window island with comfy seating. The place is white with navy blue splashes that add a book worming Greek island feel! \n\nDon't even get me started on the pastry case. Oh mama! Let's talk variety of muffins, told in the hole hole! And damn the Almond Scone here is off the hook! It's crumbly and delicious and has that hint of lemon that I adore. My latte was creamy and strong! I could not have been happier with today's choices. \n\nThey also have a variety of sandwiches to pick from including the must have Avocados Toast! I made a point of stopping in here for a great start of my day before entering the depths of the dreaded DMV!!! Woof!", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-18", "description": "I asked in advance whether they had a particular specialty good. They said yes. I made the long trip over only to find that they didn't have it. Infuriating.", "author": "Greyson A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I love a great cafe where I can sit and read a book or get on my laptop and get some work done and Greene Grape Annex fits the bill. The atmosphere is great, not too loud, and I felt comfortable. Plus added benefit is that they are open late (9pm), while most cafes close around 6/7pm. \n\nWill continue to return to the gem in Fort Greene.", "author": "Clarice H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "This neighborhood spot in Fort Greene has a wonderful ambience for grabbing a cup of coffee, a pastry or casual meal, and reading a book or meeting up with a friend. The drinks are affordable and decent. Seating abounds, from lounge chairs by the window and bar seating to a communal table and individual tables. Some tables are reserved for no-laptop use, which I can appreciate. \n\nMy biggest gripe is that the place offers wifi on a limited basis--one needs to pick up a unique code, available for only one hour of use. While the staff readily offers additional codes upon request, I'm sure this system has the intended effect of limiting the stay and number of workers (like me, on occasion). Outlets are also somewhat limited, thereby making more prolonged stays inconvenient.", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-13", "description": "I love this place. It reminds me a bit of my college's main library. The large glass windows allow sunlight to make everything bright instead of the dull, depressing flourescent lighting some other cafes have. There are different niches depending on what you're there for -- a big table where most people have their laptops, smaller tables for groups to chit chat. The food there is really good and really cheap, too! I've had their toad in the hole and their breakfast bowl, which I loved. It's nothing special, but it satisfied me. I also had a cortado and even though the barista who made it for me was a bit unfriendly/unresponsive at first, I didn't mind, I don't go there to make friends. \nI wished they had free unlimited wi-fi though. The one hour limit is understandable, but you also have to pay for it?! Yikes.", "author": "Heidi V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-20", "description": "Batista named Brittany, condescending and rude. Too many unsavory moments in our exchange. I grew up in this neighborhood - and have been a customer at Green Grape Annex since they opened. Brittany was humiliating and dismissive. Will never support this business again.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Great casual spot to work or meet up with a friend. \n\nExcellent, locally roasted coffee. Fantastic pastries (jam bar \u0026 hole in one biscuit thing)\n\nLove the grain bowl \u0026 the breakfast sandwiches too. \n\nLots of outlets to plug in and designated \"no laptop\" tables as well.", "author": "Ria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "This place is super cute. It's in a nice location, and has lots of seating. I'm from out of town and just needed a place to sit and charge my phone and read a book for a little bit, and this did the job! No requirement to purchase anything to use the space. There is also WiFi here. It's definitely not a quiet place, if that's what you're looking for. The music is rock/heavy metal (at least right now). The music itself isn't too loud but combined with general chatter it's not a quiet environment. There are tables/chairs and also some lounge areas with loveseats \u0026 booths. I'll probably be back, this place is very cute!", "author": "Folasade A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-01", "description": "Great, bright, airy cafe with lots of tables, chairs, lovely decor, and nice music. I had a delicious 4 green salad with pulled chicken, almonds, and grapes (ya, it was $12 but it was a lot of food - see pics.) The food came out fast and hit the spot. I also ordered a gluten free pumpkin pie with graham crust. Deelicioso!\n\nThe drawbacks were\n* i had to clear a table of leftover plates and cups to sit down even though it wasn't that crowded in the space and the table had been empty for a while (i know because i spotted it when i first came in and it took me a while to decide what to get)\n\n* at one point it felt like i was in a nursery what with all the huge strollers and crying babes\n\n* theres a super loud blonde lady that works behind the bar who kept disrupting the calm atmosphere with her boisterous voice. I kept wishing her co-worker would stop engaging her because she would reapond as though he was a whole city block away (ok, that may be  a slight embellishment, but she really is LOUD)\n\n* a little light on the choices", "author": "Camille H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-02", "description": "I love Greene Grape, and sometimes I come here to meet a friend, but it's always so stressful to order here. The menu is ok, and the coffee isn't too bad, but the employees make it so stressful. Everyone seems anxious to get rid of you, even when there's not a line.", "author": "Kristine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "The food and coffee and drinks are nice. However I wish I could give this place a 3.5. The service is definitely less to be desired. There is plenty of space to work but I wish the service was better.", "author": "Vicki G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I'm personally more of a tea drinker, but I love this coffee shop. It's super spacious, has a ton of natural light pouring in, plenty of different seating options depending on what you're coming there for, and they have things zoned off to prioritize certain zones for certain activities (i.e. the tables are a no-laptop zone so that people coming in to chitchat have space, while the large table in the middle is perfect for people aggressively typing away--and lots of power outlets to recharge your devices). They also stay open late-ish (9?).\n\nFYI, the downside is that this isn't your average Starbucks and wifi isn't free here, so you have to either pay for it via the provider, or get a 1-hr code with your purchase, but the upside is also that this isn't your average Starbucks (much better!) and taking up a seat = renting space = space isn't free = you gotta pay a little bit :)", "author": "Tina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-15", "description": "Can you please change the music or turn it down??!\nWhile this place has decent food and a comfy place to sit to do some work, the loud music is a real turn off. Also, most of the staff look kind of grumpy and maybe there's one waitress or runner, who is actually nice. When my good came the guy just plopped it beside me without a word and I said thank you but he didn't even acknowledge me.\nThe other turn off is the wifi, kicks you off every hour and you have to get another password at the register, I mean one of the biggest appeals of working in cafes is the wifi, don't they know that?\nAlso, did I mention, the music is terrible? It sounds like a loud dive bar and that isn't conducive to a nice chill working atmosphere in the middle of the day.", "author": "Lubaina C."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Greene Grape Annex", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "753 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/5gjfCtspGqcOBrXXVmRb4A/ls.jpg", "@type": "Restaurant", "telephone": "+17188584791"}