{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "I once saw a funny quote which has stuck with me since (probably because it resonates): \"I drink coffee until it's appropriate to drink wine.\"  True words, and the Annex is an awesome place to do both of those things.  Unlike some other spots in the neighborhood it's not really a restaurant so you don't feel weird just ordering drinks.  It's huge with lots of coze corners and tables, has free wifi (and the connection appears to be quite strong, I had no problem using it on a crowded Sunday) and a great selection of decently priced wine and beer.  I haven't come early enough to try the coffee out but I bet it's good too!  They also had croissants and some other light food that looked good.  The only critique I have (and it's a small one) is that the music is really not conducive to quiet studying--when I was there it was really loud old-school hip-hop.  I thought it was great background music but if you need a quiet place to focus, I'd try the Hungry Ghost up Fulton a bit.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "Good sandwiches/baked goods, but the menu is a little sparse, with no breakfast options. Excellent place to get work done. The coffee's fine but nothing special. The best part about it is that the space is nicely designed. A little elevated seating area near the front has comfy couches. There are a few outlets around, and wifi always works.", "author": "Ilya A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Cool atmosphere. Very friendly waitstaff. We had an excellent business meeting there in a super creative vibe.", "author": "tom c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "This is seriously the prettiest coffee shop I've ever been to.  The design is incredible.   There is no bad seat in the house.  Staff is helpful, genuine, and kind.  Other than that--prices are fair and treats are tasty.  Ideal location.  Happy to keep buying things just to pay admission to hang out here.", "author": "Meg W."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Greene Grape Annex", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "753 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/5gjfCtspGqcOBrXXVmRb4A/ls.jpg", "@type": "Restaurant", "telephone": "+17188584791"}