{"aggregateRating": {"reviewCount": 104, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-07", "description": "Ordered a tea and some wine, can't mess that up. Hot water + Tea Bag and Glass + Wine Pour. The music is a bit louder than most cafes, but I didn't mind it at all. \nAll in all, average place with quite a selection of teas.", "author": "Em L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Decent place for coffee, pastries, and catching up with friends. There's one long table that is a designated \"laptop use\" zone. All other spaces are for other patrons, which is kind of great. \n\nVery roomy, which is rare for coffee shops in nyc so that's great. Coffee is good. \n\nThe music is kinda loud, and it plays electronic house music at 11am. So that wasn't my favorite. Definitely bring noise cancelling headphones if you are in need of a quiet space to concentrate.", "author": "Jeenie Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "The grilled cheese is really good! It has a spice to the sauce.  My tea was more than Starbucks, but nothing detrimental.\n\nThere's a lot of natural light and the layout is an open space concept which I love.\n\nBe sure not to stop at the first counter by the menu to order. The register is near the bar chairs. I learned this the hard way, and I saw quite a few others commit the same crime.", "author": "Janell M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-05", "description": "It's tough to find a great local coffee shop with lots of seating these days. This place has great food, service and coffee, plus plenty of room. One major problem: their internet is totally unreliable and if you're trying to work that can be a huge problem. I can't count the number of times I've made a purchase and settled in to work only to booted. The number they give you for customer service doesn't work. Tough when you're on deadline!", "author": "Kira G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "You'll be surprised how many people are working with laptop. It's a good place to do your work. \n\nMusic is pretty loud, so if you don't like that, bring your headphone.", "author": "Akane G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "Nice atmosphere and great food and drinks. Tumeric Ginger Latte is my fave! Quinoa salad was really good. Will be back!", "author": "Karen W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-08", "description": "This is an enormous coffee shop with absolutely no free place to sit. I think people must camp out the night before and wait for the doors to open in the morning so they can snag a seat and never ever leave. There are some tables reserved for \"no laptops,\" but those are full of people reading incredibly long memoirs. Many times I have gone in wanting to get lunch and then leaving without ordering because I didn't want to eat standing up. The few times I have gotten food to go, it's been ok.", "author": "Kay M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "An egg sandwich and a coffee for $14 before tip. Smallest egg sandwich in nyc for 3 times the price. Had to eat somewhere else to actually get full. Ridiculous.", "author": "Wade V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Greene Grape Annex can make all their coffee drinks with soy! Yay! I love the really yummy soy latte, much better than Starbucks. The environment is well-lit, relaxed and comfy, with a cozy seating area by the window. Most of the clientele is laptop users. The only rule is no laptops at the counter. I concur with other Yelpers that the music is loud. It was hard to hear my own group's conversation. The restrooms are unisex, clean and well-stocked. Wifi is free, ask for the password.", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-22", "description": "The new lunch menu. The worst. What reasonable shop ends their brunch menu at noon, on a Sunday? Furthermore, a sitcom on IFC could be written about the staff. I'd rather watch it on TV. \n\nI can't blame a shop for their clientele, however, the place is so crowded with everything that is the worst about Fort Greene, that having a relaxing visit is next to impossible.", "author": "Jared G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-23", "description": "I am sorry. I really wanted to like this place. I usually am really pragmatic about how I review and think about coffee shops, but the music in here really really turned me off. \n\nI like Prince. Everyone likes Prince. Prince is awesome. He makes everyone's lives 30% more sexy. Prince on full blast in the middle of the afternoon in a coffee shop? No. \n\nMinus Four Stars - the music was entirely too loud. It overpowered headphones and person-to-person conversations. The two things coffee shops are meant for.\n\nThe agreement in coffee shops is two-fold:\n1) It is a place for socializing.\n2) if you want to work independently... put in headphones to block out conversation.\n\nThe music made both those things impossible.", "author": "Nathaniel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "A solid place to sit down for a coffee and some work. There were very few electrical outlets. There is a large communal table where you can do work as well as couches that are closer to the outlets. There are also tables that are only for chatting/reading and no laptops.", "author": "Monica Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "Sep 2016 Update:\n\nI come here on the regular for my morning coffee and at night sometimes to work. Food and drinks are mostly solid. Morning staff are awesome, there are a few old timers who know what they're doing and are nice, service-oriented, and super competent.\n\nNight staff the last few months are a different story. At the risk of sounding like a total asshole, there is a woman who runs the show most nights and she drives me so nuts its sometimes made me avoid the place. She's reasonably competent but not terribly efficient, and alternates between halfway ignoring customers to talk to her friends at the bar and feigning attentiveness by punctuating every sentence with \"sweetie.\" It's maddening.\n\nOn the upside, the farro bowl is really fucking good.\n\n--\nPros: beautiful space, free wifi for 1.5 hours, excellent coffee, wine, and food, friendly and attentive staff.\n\nCons: the music is so loud sometimes! That's their prerogative, and it may even be strategic in order to keep people from lingering.", "author": "Florecita M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "I'm on a mission. To find coffee shops in NYC with great espresso drinks (duh), food that is more than banana bread, wifi \u0026 a fun working atmosphere. You know where i'm going with this don't you?\nThis was my first trip out to Fort Green for a meeting, and am glad it was here. Had it been a Starbucks I would've probably scrapped it off my NYC list forever. But Fort Green won. Along with memories of a good Blue Bottle latte, cheddar scallion scone and friendly baristas. \nAlso, despite the number of people working on their laptops, the place was quiet \u0026 flooded with sunlight. Brownie points for that.", "author": "Shuchi M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-01", "description": "Ordered cappuccino and some sort of pie with bacon, cream ext. They've reheated it, but not to piping hot temperature. Eat nothing else all day. Result - 6 hours later puking my guts out. Fever 103.6 F. I felt like I was dying. My sheets soaking wet. Thankfully neighbor brought Advil - I'm alive. Heat your food properly catering industry people! Might not be so lucky next time.. Quite pricy too.", "author": "Nat D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "Great coffee.  Great ambiance.  Great music.  But come on, 90 min of internets per transaction?!?  If you want to chill for a few hours and get some work done -- go to Starbucks.  That sucks.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-19", "description": "I have frequented this cafe for a while now. As far as coffee, food, and work atmosphere go, I have generally been very pleased. However, an unfortunate event occurred tonight, and I don't expect I will be going back.\n\nMy girlfriend and I were drinking coffee and doing work at a table (nearest the to the bathrooms, and in clear view of the bar/counter), when a large group of noisy teenagers came in. They headed straight for the bathrooms, and those who did not go in congregated around our table. One boy sat down across from us and told my girlfriend how pretty she was (unnecessary, but thanks for the compliment). Then he kept loudly chatting with his friends. OK, that's also fine. We tried ignoring them, and continued on with our work.\n\nThe next thing I know, I am being sprayed in the ear with an aerosol can. I assume it was hairspray, though it could have been bug spray. I don't know, and it doesn't really matter. Anyway, I turn to the girl who just did that, and I ask her what the heck she's doing, and she just scurries away to the bathroom. I look around to see if anyone working there is paying any attention, and I give a \"are you serious?\" look at the guy behind the counter who is watching this go down. He comes over and tells them, \"Sorry, I can't have you spraying our customers in the ear.\" Fine. That is *literally* the least he could do, but at least the staff is acknowledging these kids are being disruptive.\n\nNow it's clear we have three options: try to ignore them and hope they go about their business, move to another table (or ask them to move), or leave the cafe. We give them the benefit of the doubt that these are just some kids being kids, and we try to ignore them and go about our work. It's about this time that one of the boys comes out of the bathroom, poorly trying to conceal all of the toilet paper he is stealing, and joins the first boy (\"you're so pretty\") across the table from us. Immediately they start telling my girlfriend they \"want to get her pu$$y\" and that I \"wasn't giving her the real di¢k.\" I cast another \"really? Are you serious?\" look at the staff, get no response, and my girlfriend and I decide we're going to change tables.\n\nThat's when the first boy chimes in, to my girlfriend, \"If you leave, I'm gonna hurt you.\" I say to him, \"What did you just say to her? Are you threatening her?\" He ignores me. We say we're leaving (though I don't feel entirely comfortable going outside, seeing as how we are outnumbered and have just been threatened, even if it was only by a bunch of kids). By this point (I assume they have all the toilet paper they can handle and/or are attracting enough attention through their obnoxiousness) they realize it is time to leave.\n\nMy girlfriend and I are pretty upset at this point. We felt annoyed, harassed, and threatened, and nobody working there seemed to care about what was going on. I can't blame the cafe for having the occasional annoying patrons, but I can be upset that nobody working there made any attempt to get them to leave once they became disruptive. Even if I give them the benefit of the doubt that they somehow didn't notice everything that was going on, they should have at least been more vigilant.\n\nBefore we left we told one of the workers (he might have been a manager?) what had happened, and he said he \"would be happy to kick people out, but I was downstairs\" and \"what do [we] want [him] to do about it?\" I guess he's right. What do we want him to do about it? Perhaps not sound so dismissive of our ordeal, or perhaps offer so much as an apology? Whatever, we're not getting bent out of shape over any hurt feelings. I would just think that a customer service establishment would show a little concern for the wellbeing of its patrons while they were in its store.\n\nOther than that manager making us feel like we somehow inconvenienced him by relaying our bad experience, none of the staff were mean or anything. And whenever I have been there during the day (with different staff), most everyone has been very pleasant. I like the shop, but after my experience I can't see a reason I would head back there over other nearby spots.", "author": "Steven R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "- Dope music (Wu-Tang, Dr. Dre, and the likes)\n- Yummy food (Had the farro salad and it was so good!)\n- Tasty teas (Try the green and licorice one)\n- Wine and beer available \n- Comfortable seating areas\n- Laptop free zones\n\nDope little spot and I'll be back.", "author": "Dani J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "I wrote a book in this place. The ppl are the best. And it is incredible for work, for pastries and for lunch.", "author": "asya j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-03", "description": "Coffee here is well priced (I think it was $1.80 for a small) and the baked goods are tasty ($3 for a croissant). The space is spacious, decor is nice and bright, lots of windows \u0026 plants. Workers are friendly.\n\nBut, a note on the seating: It is plentiful and I don't even mind that they ask for people to leave some seats to those not working on laptops. However, I think I would have been upset if it was more crowded when I was looking for a seat and couldn't find an open laptop seat, since I came with my laptop in tow. Not to mention that people in the non-laptop seats were talking on phones, typing away on tablets, etc. I mean, c'mon.\n\nSeems to me it'd be better to ask people to *limit* their laptop use in certain spots. That way, they'd know they should jump for a laptop seat when it becomes available and wouldn't hog up those seats all day (which is essentially what the policy is intended to do) rather than kicking laptop users out altogether.\n\nChange that and I'd lean toward 4 or 5 stars.", "author": "Cassidy P."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Greene Grape Annex", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "753 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/5gjfCtspGqcOBrXXVmRb4A/ls.jpg", "@type": "Restaurant", "telephone": "+17188584791"}