{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "OK, so Henry's End is no secret since it's been around for like a BILLION years, but it might be a secret to YOU, dear reader. If it IS new to you, (shhh) keep it between us. Don't share this amazing secret with anyone else...!\n\nI've been eating at Henry's End since I was a Little Person. Though you'll be sitting amidst WASPY Heights' families who all look like they Summer on Cape Cod and drink G and T's (and probably do!) they are still a lovely bunch of customers, as is the waitstaff. Couldn't be nicer. The famous Bonnie is a Brooklyn treasure. Also a writer, I hear. She will make you feel like you've come home. Simple as that. \n\nI couldn't count, over the years, the number of Chicken Lemonese I've eaten, but let me tell you: There are less chickens in Brooklyn Heights because of ME. This dish is the shizzle. Or, since it's made in Brooklyn Heights, it's the Hizzle. \n\nThe Ozark ribs? There's a genius somewhere who created this spicy smokey sweet BBQ sauce, and I want to say, \"I love you man/woman\" just for that sauce. Ribs fall right off the bone. Come ON now! \n\nThe mustard seed crusted tuna? YES please. It's everything you want in a tuna steak. They caught that mo'fo' eight MINUTES before you sat down. \n\nCrab cakes for appetizers for sure. \n\nI haven't had dessert in years, I get too full! I will update nxt time I'm able to find room! :)", "author": "Scott R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "The food and wine selection was excellent.   I loved there lamb dish and I must say they have one of the best selection of deserts I've seen in any restaurant.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "Henry's End is my favorite sort of restaurant. Simple menu, high quality ingredients, well prepared. It's not cheap, but you get what you pay for without it hurting too much. Try the duck or the steak. The chocolate mousse will shoot your diet to hell but you won't give a damn.", "author": "Liam C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Busy place, plan to wait, food was very good- a bit slow to prepare - kitchen is pretty tiny. Prices are reasonable. I will return when in the area.", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "My go to Brooklyn Restaurant.  I live on the Upper West Side and happily take the train here when I want an amazing meal.  Totally recommend the Mustard Tuna and Mud Pie.", "author": "Joanne N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-06", "description": "TERRIBLE FOOD!\nWas so excited when I read the Yelp reviews and **** rating but was very disappointed. Nothing special at all. When my boyfriend walked in he turned to me and said \"Are your mother's bridge partners having an event here?\" The place could have been cozy but it just lacked in every way, sadly. \n\nI had the crab cakes which tasted straight out of a can with a triple helping of jarred tartar sauce added. Deep fried- way too long- into oil-soaked, sitting under a warmer for hours, mayo balls with hard fried crust- and the idea of crab. I would only expect this caliber of food on a beach boardwalk and it would have been better there. The crab cakes were- in a word- disgusting. \n\nI also had the sole. It came soggy. It was battered in a flavorless egg and flour coating and came swimming in a pool of butter lemon sauce. Not even the sauce had flavor. Come ON- how can a lemon butter sauce lack flavor? The obligatory side of overcooked rice pilaf and frozen vegetables- reminiscent of 1970's airline food- came to the side. Nothing had flavor. Nothing was special. I was starving- it would not have been hard to please me.\n\nThis didn't seem like an off night- I'd advise you save your money and go anywhere else.", "author": "Alicia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "I love this place.  It is so quaint and the staff is very genuine.  I wouldn't mind becoming a regular here.\n\nLast night's dinner was delicious as always.  Even the parental units agreed and the last time they dined here was 2.5 years ago.  According to my Dad they make an excellent Manhattan. \n\nI've had chicken, fish and pasta here in the past and have always been very content.  Last night's lamb sirloin with homemade spicy BBQ sauce and mashed potatoes was out of control.  If it was proper to lick the plate to show my enthusiasm of the dish I would have licked mine and the BFs clean.\n\nThe Persian lime pie was a delicious and refreshing way to end such a great meal.  Can't wait to go back!\n\nP.S Join their mailing list.", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "Salmon with three-mustard sauce.\nTruffle fries.\nMelt-in-your mouth snowpeas.\n\nI know the point is the wild game menu, but when the offerings on the regular menu are this good, who can think about the rest?", "author": "Michele W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "This restaurant was a great find.  Atmosphere is very quaint  and intimate. My boyfriend and I were feeling adventurous and went during their Wild Game Festival. The waitress was very helpful in describing the items and giving recommendations.  We had the Gnocci with wild boar and the Mixed Game Grill which came with rabbit sausage, elk chop and wild boar belly. The Wild Game Festival is definitely fun for those that enjoy exploring the unconventional cuisines. Overall,  a combination of quality and exciting food choices, with great service and ambiance makes this place a win.", "author": "Tanya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "Pretty crazy that my original review is from 2008--seems ages ago!\n\nHeaded to Henry's End with the husband and in-laws. Pleasantly surprised that we were able to get a very last minute reservation at 8:30 pm on a Sat., but glad we thought to call ahead. I guess I'd forgotten about the size of this restaurant (sooo tiny). \n\nOrdered a lovely bottle of petite syrah, and a medley of dishes. I loved my buffalo, and the husband enjoyed his mixed game plate (except perhaps for the venison sausage, which we both agreed was strangely sweet). In-laws raved about their sole and duck respectively, and we each tried a different dessert. I really enjoyed my banana pudding, although I hate to admit that I might almost like Magnolia Bakery's a tiny bit more. I think the banana pudding here should probably win though, if only because it isn't a frighteningly fake yellow color! \n\nLeft full, and very  happy that we moved a mile away. We needed that walk to work off the huge meal!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "The food-value proposition at Henry's End has fallen even further. The vibe is still wonderful and the convenience factor remains, but the food has really fallen off. \n\nTortilla Crusted Shrimp on zingless \"chipotle mayonnaise\" and lifeless guacamole was a complete joke nevermind a wallet-buster. Still, the Corn Crab Cakes ($12) are plump and delicious, so it's not a complete lost cause.\n\nThe lamb sirloin ($25) hits a single, chewy at medium-rare, dull note. The Steak Diane ($27) is a small hunk of meat doused in some brown sludge. You get a pathetic little airplane portion of peas and potatoes with your entrees.\n\nYou get the sense that Henry's End is struggling (sign up for our free birthday rewards program!). \n\nI still like this place, but now we're batting with an 0-2 count.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "If the patrons are indication of how great this place is, then the fact that the guy at the table next to me has been coming to the place for nearly 20 years and drove in from Long Island just to eat here should be pretty telling.  There was a 30 minute wait when we arrived and we were told to hang out at the wine bar while we wait (which is awesome).\n\nFor dinner, we had the duck and three mustard salmon.  The three mustard salmon is one of the best fish sauces I've had in a long time.  Between that, the bottle of excellent Cabernet that the waitress suggested and an amazing chocolate confusion (yep, that's the name) dessert, it was a fantastic meal.  It is reasonably priced and well worth the trip.  If I had to add a negative, it would be the tables are really \"cozy.\"  But that's to be expected in NYC.  I highly recommend this place and I will be going back regularly.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "My husband and I have been enjoying this restaurant for nearly 35 years and the food is getting better and better. Last night, our darling waiter, Isabel, even put in a special order for me: fiddlehead ferns and morels, sauteed in butter and beyond delicious.", "author": "Lili A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-16", "description": "Wonderful wait service, but the wild game wasn't all that wild\n\nNever listen to Google map's direction service. I was coming from midtown so it told me to take the F train to York St and walk 9 minutes over to the restaurant. Besides getting lost (this place is right underneath the Brooklyn Bridge, so a lot of the streets end on one side or the other of the bridge), and taking about 10 minutes to reorient myself, I still have to walk like 15 minutes because last I checked, I can't walk through walls (or walls that are part of buildings) . I had to criss-cross many streets and walk through many underpass to finally find Henry St. It might look close on Google maps, but it certainly isn't logical and they didn't take in account that it was 10 degrees that night.\n\nThe simplest and most straightforward way to get to this place in a winter day if you never been here before is the 2 or 3 train Clark St station (I went back to the city that way). Once you get out of the elevator, it will take you less than a few minutes to orient yourself and its about a 5 minute walk to the restaurant.\n\nWhen I finally got to the restaurant, the place was on the quiet side. The waitress was really nice and offered a lot of suggestions on what to order. We came here for the wild game festival, where you can eat anything from rattlesnake to lion (as the waitress mention they had once). The problem is it comes down to what they can get their hands on at any time so the wild game menu can really vary from day to day. I was really looking forward to the rattlesnake and the kangaroo, but they had neither of those items that day. So here's what we ended up ordering.\n\nWild game pate - good, gamey, I forgot what the waitress said was in there\n\nBBQ python salad - The salad tasted good, but I can't say the same for the python. It just tasted like BBQ chicken, except it was chewier. I really wouldn't have known it was python if you didn't tell me.\n\nGrill game Plate (wild boar belly, quail, elk chop) - a good variety, I like the wild boar belly the most, but then again, its not much diff than pork belly. The tremendous amount of fat makes anything good. The quail is good, plenty of dark meat, so it was tender and juicy throughout, but being Asian, I had quail more than your avg person that would try this dish. The elk chop was definitely new to me. It really had gamey taste, which I didn't like too much. I like the fact that I tried it, but it was my least favorite of the dish\n\n21 layer crepe cake - This dish got us talking about how you can fold paper more than 8x (and that was busted by Mythbusters with their football field size paper), but the crepe was really lack luster. I can't even say it tasted like crepes\n\nChocolate Confusion - A good amount of chocolates with more chocolate syrup drizzle on top and a scoop of ice cream. This was way better than the crepe cake\n\nCall me when they have the Kangaroo, but I hope they serve it in a unique way so it doesn't taste so bland (like the BBQ python salad).", "author": "Jack N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "Great ambiance, not pretentious at all. Packed full house. Ate the duckling with mushrooms and lingonerry sauce. Good,  but would not pay $25 for it.", "author": "May T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Never had a bad meal here!  My husband loves the game menu.  The duck is delicious, as is the chicken stuffed with goat cheese.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "WOW where can I start about this amazing Brooklyn treasure! \n\nWe were the first here for dinner and were met with the warmest faces and kindest people! Our waitress was Bonnie who by herself is a treasure! she has been waitressing at Henrys End for 20+ years. She was so animate when describing the food and how it tastes and the texture. I loved watching her speak! \n\nThe food was sooo good! I was nervous about eating boars stomach or any kind of liver but let me tell you they both have to be the best thing I have ever tasted in my life. I also had the organic chicken encrusted in almonds yum yum yum!!!!!!!! \n\nThe dessert called the chocolate confusion just hit the spot! i never had a brownie taste so good and the texture was amazing i think because it was made with pudding,\n\nI definitely will come back here again after i save some money because it is quite pricey but worth every single penny!!!!!", "author": "Tahani O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "This place is amazing!  Great atmosphere and surprisingly has various delicious options for a vegetarian.  I had the sour cherry soup and heirloom tomato salad...was better than any vegetarian restaurant in the area.  I had roasted vegetables with polenta as main dish and that was perfect as well.  I can't speak for the meat dishes but everyone I was with raved about them.  The best part....dessert. The 21 layer crepe is to die for!  Do not leave without trying!  Also service was amazing and very kid friendly.  Love it here....we come from Boston but this is our #1 choice when in the area.", "author": "Sandi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "Boy, that was a great meal!\n\nWith a group of five guys, had two bottles of wine, four steaks on the table and one salmon. Had dessert too.\n\nIt's a great space, great neighborhood, service was excellent.\n\nI highly recommend.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "We were visiting from California and looking for a place to eat in Brooklyn Heights.  We found Henry's End on yelp and decided to take a look.  We got there around 20 minutes before they opened and while taking a look at the menu posted outside just about every person that walked by told us we had to eat there.  We weren't disappointed.  We all had the wild mushroom soup and it was awesome.  I had the elk chops and they were right there too.  The service was perfect.  It made for a great finish to the day.", "author": "Bob K."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}