{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "I love this place. My son is nuts about the lamb and has fries with them sans truffles, my daughter loves the game menu and has broadened her horizons so to speak, the steak au poivre is to die for. The prices are pretty fair considering how much food you get - and I mean, you get a lot of food on that little table! - and it's for both casual and special occasions. They are also especially kind to my disabled son and if you can't get your waitress for some reason, the manager is extremely hands on and will take care of you.", "author": "Jj D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "In the past 10 years I have been to Henry's end probably approaching 24 times. Even since I moved from NY to NJ , I have still celebrated many special occasions there. I remember the first time I approached the door, I thought, \"Is this a bar?\" I do not return for the ambiance or the service which is always prompt.  It is about the food, which is some of the best anywhere and at a great price.\n\nBe sure to go for their annual wild game festival. Their mustard crusted elk chops are my favorite dish of all time.", "author": "Schiffon W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Absolutely delicious!  I loved every single morsel of the meal.  They have some really cool gamey options on the menu that are atypical of NY restaurants.  Would definitely go back!!", "author": "tania s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-11", "description": "The experience of dining here couldn't be any better. From first entering the restaurant you are treated like family. There are no signs of white table cloths or pretension. The dark walls and low lighting enhance the feeling of relaxation. Over the windows and above the bar hang multi-colored Christmas lights. A neon sign hangs on the wall towards the back of the dining room...and with the colored Christmas lights gives the place a \"no-nonsense\" and mid-nineties nostalgia (in a good way, I promise).\n\nThe wine list impressed me. You could easily find a great bottle of wine to accompany your meal for about $35 or you could blow your paycheck and get one for $500...they have everything in between. I went for a 2007Joel Gott Zinfandel. It was juicy and spicey and full of jammy, blackberry flavor and paired perfectly with our entrees.\n\nI went with the Wild Mushroom \u0026 Lingonberry Duckling with portobello and morel mushrooms, shallots, thyme, brandy and lingonberries. It was perfectly prepared, seasoned, cooked and presented...some of the best duck I have had. My friends had Chicken Lemonese (breaded with romano, and served on a rich, lemon cream sauce) and Blackened Lamb Sirloin (spiced lamb sirloin, seared and sliced over garlic mashed potatoes with a bar-b-q glaze). Both dishes were excellent. I would be happy with anything on the menu after trying these options. \n\nI'd go back here in a heartbeat...it was wonderful from start to finish. Afterward you should take a stroll down by the river and enjoy one of the best views of Manhattan", "author": "Tony L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-15", "description": "I can never understand why a popular, busy restaurant can't spare a few dollars to RENOVATE!  At least paint!  I found the restaurant crowded and dirty.  \n\nFood was just Ok.  We ordered from a special menu for valentines day.  The oysters were fresh, my husband ordered stuffed quail, he said it was ok.  We both ordered filet mignon for our entree.  It came with some brown sauce over it, but lacked simple seasoning like SALT and pepper. When the restaurant is rated $$$, I shouldn't have to touch my salt shaker, which I did numerous times.  The confused chocolate dessert was ok, but confusing...appropriately named.  I just wished I didn't see the food runner's thumbs on the plate of every dish he served.  Ugh!\nGlad I tried the restaurant but I have no need to return.", "author": "Susan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "This was our first visit to Henry's End (on our wedding day!) and it was a lovely place to celebrate with good food and wine. We arrived on the early side and it was already bustling with regulars (as other reviewers have noted, it's a romantic place with a neighborhood-y feel). The menu is large but our server helpfully directed us to his personal favorites on the game week menu. \n\nWe tried the shaved Brussels sprout salad which was good though a little underwhelming (the pomegranate seeds were a nice touch).\n\nWe also tried a small plate of gnocchi with boar ragu which was flavorful but a bit tough (I may be forever spoiled by the exceptionally tender and flavorful veal ragu tagliatelle that I ate earlier this summer at Au Pied du Cochon).\n\nFor the main course we shared a venison special with spinach and sweet potatoes and the duckling with mushrooms and lingonberries. We also tried the turtle soup from the game week menu.\n\nThough nothing knocked my socks off, everything was well prepared and flavorful. Henry's End was a great place to celebrate in a relaxed, warm, romantic atmosphere.", "author": "Sara E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-19", "description": "I really enjoyed my meal. Great atmosphere and it was a very clean establishment, especially the bathrooms. The people in my party were not happy with their food, but I certainly was! I started with the goat cheese salad (DELICIOUS), then the blackened lamb in the bbq glaze w/ mashed pottatoes (DELICIOUS), followed by the white and dark chocolate mouse (DELICIOUS). My meal was perfect", "author": "Nina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "Two of us came on a Tuesday night at 6, and we were the first table.  It quickly got crowded in a hour. (I guess normal people eat dinner at 7).\n\nI had the prix fix menu, mixed green (fresh), mustard crusted tuna (absolutely amazing), and apple cobbler (yummy).  My friend had the BBQ shrimp (tasty) and duck with wild mushroom (I don't like duck in general, but he liked his dish).\n\nThe decor was cozy...I loved the exposed brick wall and open kitchen...Of course with all open kitchen, you smell like a kitchen after!\n\nI would love to go back and try their gamy stuff!  :)", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "I have been going here for a very long time. I have never been disappointed.\n\nIt is a great place for a date, very romantic, though not a first one. It is a little on the pricy side.\n\nMy favorite is the gaming menu, this place is not for vegetarians. Ha!\n\nThey have an exceptional pairing of wines that changes with the menu. There is also a great selection of whisky.\n\nTip: They get busy quick, I usually call to reserve a table so I don't have to wait.\n\nThis is a small restaurant and a bit crowded, but the food is well worth it.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "My first 5 star review.\nWe wanted to try Henry's End for the food but were a little concerned about the hipster rep, small tables and cramped quarters. We come to Brooklyn from Montreal  every month or so to visit our children and grandchildren and Brooklyn Heights is our preferred stomping ground because of it's proximity to our hotel.\nAt any rate this is not Patty Duke's Brooklyn Heights, (you gotta be old to get that reference), its chic, expensive and popular beyond belief, Henry St. a local jewel, choc full of eclectic and exciting culinary choices, all lined up over a block or two.\n\nWe decided on the Italian restaurant next door (which doesn't take reservations) and were surprised that it was overflowing on a Sunday night. Peeking into Henry's End next door we spotted a table and decided to jump at the chance.\nWhat a serendipitous choice!\nThe food was quite simply fabulous. Every one of the four main courses ( sorry read: 'entrees' in America) was daring innovative and quite delicious.\nService was above par and the noise level was such that we had some fine dinner conversation.\nWe were never rushed and enjoyed our best meal in Brooklyn so far. \nWe shall continue sampling other great local restaurants on our return trips, but will surely return here to enjoy some of Brooklyn's finest plates.", "author": "Justan A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-23", "description": "I can't believe this place is rated so highly.\n\nI went to dinner with a friend here. We were seated at the table in the far back, with a window to the back concrete area, complete with a view of the pigeons and rats running around. It smelled a little funny from the beginning, but we decided to stay.\n\nFirst of all, for a place know for wine and beer, their waitress poured our beers with great fanfare, but clearly doesn't know how to properly pour a beer from bottle to glass. The ratio we're going for is not 60% head, people, with it rising over the edges of the glass. I would have preferred to do it myself, thank you.\n\nWe ordered two appetizers for a light meal. After a while, we were brought a basket of somewhat limp-looking bread. When the appetizers finally arrived, both of us took a few bites of our respective dishes, looked at each other, and agreed this would never happen again. The crab cakes were mostly filler (no lumps of crap) and tasted like they had been in a freezer far too long. I couldn't stomach more than a few bites. The only comment my friend made about the bbq shrimp was that it was \"weird,\" and commented that \"now we know not to come back.\"\n\nAll the while, every time the cooks fired up a new dish, the smell grew more intense - both smoky and sour and really very off-putting.", "author": "Katie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "My lady took me here for a nice night out. For my first time out in Brooklyn Heights, she definitely chose the right place. Although the restaurant is a little small, it's dim and pretty. The food was wonderful and the server was so sweet. I'd definitely recommend this for a romantic night out.", "author": "Skye F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "I just went here last week for dessert and coffee with a friend, and the service was absolutely fantastic. My friend and I sat down, ordered our dessert, and our coffee was on the table immediately with bread. \n\nBread. Before dessert. \n\nHad I died and gone to heaven? \n\nThe butter they serve with the bread here is so fresh and delicious...I seriously didn't realize there was anything wrong with the butter I have at home until I tried this butter. The dessert did not disappoint, either. Whenever Henry's End has a dessert special, I strongly recommend that you order it. I got the mudslide pie and it was decadent but not too rich. \n\nThe waiter and waitress who served us were really kind and unobtrusive. Henry's End has a great vibe...it can be trendy and Brooklyn chic, but ultimately it is incredibly homey. If you're in the neighborhood you absolutely have to try it.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "This is a great foodie find. Nothing fancy inside, except some serious eats. It had a comfortable, laid back feel.", "author": "Gail P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-18", "description": "I really really really wanted to like this place!\n\nI heard so many good things about it. I was over excited to finally go in and try it...\n\nThey were having an off night.. our food took over 45 minutes to come out. Service was good but spotty. Our waitress was lovely, but she was overwhelmed.\n\nThe food.... the food was just OK. I had the lemonese veal, I did not realize that the lemon creamy sauce was going to be covering the whole plate. I had to take my veal off the plate so it wont be soaked in it. The sauce was way too tangy for me, so I couldn't eat it. The veal piece on the other hand was delicious. My husband had the sirloin lamb, which was really good.\n\nWe did have appetizers and desserts, nothing to yelp about.. very ordinary.. \n\nPortions are on the small side and you have to pay to get sides like potatoes and greens... honestly I don't know if I would go back, there are many other options in NYC that are excellent and have the same price point. \n\nI am very upset to write this review, but Henrys End just didn't do it for me..", "author": "Sera A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Came here twice for the Australian game food theme they had going on. The elk \u0026 kangaroo were def my faves. The boar was good but it was slighty a bit too much sodium for me. Place is smaller but has a great ambiance for the perfect romantic date night. I would without a doubt come back again! Great food \u0026 hole in the wall.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "Great little restaurant tucked away in Brooklyn heights. I had the Cesar salad, which was delicious, it had anchovies and a very rich dressing as a real Cesar salad should. For the main course I had the black crusted lamb, my cousin had the walnut crusted chicken and both were perfectly cooked and seasoned. The customer service was also amazing, everyone was exceptionally nice and friendly. Can't wait to dine here again the next time I'm in town.", "author": "Eva H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-15", "description": "I applaud Henry's End's attempt at a wild game menu. The food was tasty, if a bit traditional. It would have been even tastier if the game were allowed to show through more with less of a heavy dressing and preparation. \n\nWe really enjoyed the...\n\nTurtle Soup - robust and warming\nElk Chop - tender with a bit of gaminess\nBlood Sausage - one of the best I've had\n\nService was good, welcoming and friendly. Space was very cozy. Atmosphere was warm and informal.", "author": "Stan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Came here with the lady and my aunt, uncle and cousins (who are from out of town).\n\nAtmosphere:\n- Unassuming, not pretending to be anything fancy - just putting out amazing food to regulars\n\nFood:\n- I had the veal with brussels pancetta and sage - it was fantastic\n- Some nice sauteed veg came on the side\n- This place is just solid good food\n- Looking forward to trying out the game menus come this winter\n\nService:\n- Service was good, no complaints\n\nDrink:\n- Had some wine.  No complaints.  Decent selection of good beers\n\nOther:\n- Another spot you will be happy to call yourself a regular at.  I will certainly be back soon enough.\n- Good spot to bring ppl from out of town who will be impressed with the food but still want to be casual\n- This place has been here forever - check out the news articles in the bathroom", "author": "Matt B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "I came here with two of my childhood friends by one of their recommendation .\nThe place is cozy, nothing \"fancy\", but comfortable.\n\nService was ok... Food was tasty .... Until my friend sitting across from me spotted\na HUGE cockroach on the wall right behind my head!! Jumped up, tried to keep it quiet and called the waiter over. He killed it and simply said \"Well that's New York for you!\"\n\nUnacceptable!!!! I was nauseous!! Called the owner over and here's where my greatest disappointment came .... He wasn't apologetic. He said \"We have an A rating and we are pretty careful.... We haven't seen one in about TWO YEARS\" No apology nor big attempt to make things right. If it were my business I would have comped dinner, apologized profusely and would have done anything to win the people back .\n\nNEVER again!!! Food was delicious but this was unacceptable.... Especially the way we were treated by Mark, the owner!!", "author": "Gail G."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}