{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "We popped in Henry's End for a quick family dinner on what turned out to not be a quiet Saturday night and we're very satisfied. If you decide to go, you won't be disappointed.\n\nWhen I walked into Henry's End, the decor, layout and lighting all felt familiar. The more I think about it, Henry's End reminds me a lot of any small restaurant you've seen in a movie or TV show. It has that small, family run fell, where everyone is related or connected and care a lot about their business. And it shows in everything from the foods to service to style. The menu at Henry's End changes regularly and you can find new specials on cocktails and entrees while the regulars persist for people who want to return. I had the Buffalo Hanger Steak entree with comes with a side of truffle fries. It was excellent. The meat was cooked perfectly exactly as I had asked and the sauce was very tasty without being over salty or sweet (as can be the case with demi-glasses made for these kinds of meats). Buffalo can be a tad gamey for some, but I found their style and preparation to be excellent.\n\nIf I had to make one complaint, the presentation in most of the dishes is rather simple. It's clear the team at Henry's has decided to focus on flavor rather than appearance. Not a bad thing in my book, but it's something you might notice. Overall, we had a fantastic dinner and will definitely return. If you're in the area, definitely stop by for dinner. If you're close by, definitely stop by for dinner. If you're looking for a fun night out, stop by for dinner! But check OpenTable for a reservation as they can get busy.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "My favorite restaurant in the U.S. is Henry's End!  Back for my 3rd visit tonight.  From the moment you walk in the door you feel right at home.  The servers know the \"regulars\" - and even if you aren't one of them, they make you feel like you are!  The menu has a huge variety.  We happened to visit during a time when they feature wild game.  One of us tried the antelope - it was tender and tasty.  One of us tried the crispy rabbit over mashed potatoes and a mushroom gravy - to die for! One of us had an item on the regular menu the veal with morel mushrooms.  All dishes were perfectly prepared and served.  \n\nThank you Henry's for another memorable dining experience - we plan to return on our next visit to NY.", "author": "carol e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "I used to live in Brooklyn Heights about 30 years ago and ate there. It's still as good (and popular) as it was then. Food is excellent as is the service. Whenever I go back to NYC, I make it a point to stop in. Three times ago with my son, two times ago with my daughter, and last time with my new wife. Can't recommend Henry's End highly enough.", "author": "Peter B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Fifteen years.  I've been going there for fifteen years at least a couple times a year and it's just as good now as it was in the beginning.  Such creative food, they have introduced me to so many different kinds of food I never thought I would touch.  Every person I've introduced to this restaurant was completely blown away. Staff is courteous and professional.  I feel like I'm eating in a close friends restaurant. \n\nMud pie. You need this. Yummy and I'm not really a desert person.", "author": "M R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "My boyfriend found this restaurant on Yelp so we decided to go. The atmosphere in here is nice and cozy. The kitchen is open so if you sit by the back you can look over and see the cooks preparing the meals. \n\nI ordered the Prix Fixe menu, Spring Onion soup, which was good. As an entree I had Walnut Crusted Chicken Breast with a side order of mashed potatoes, it was amazing! And for dessert I got the chocolate banana bread pudding. It was good and was enough to share with my boyfriend. \n\nMy boyfriend ordered the Mixed Game Grill which featured elk chops, stuffed quail, and rabbit sausage. He's the more adventurous one when it comes to ordering different things. He really loved this dish! \n\nI would definitely suggest this place and I plan on going back!", "author": "Caroline J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "Great find! Excellent service and food. The pistachio salad was amazing and so was the mustard seed tuna. Can't wait to come back.", "author": "Rose G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "Enjoyed Thanksgiving dinner with the family excellent food, service. A little tight but will happily coming back.", "author": "Tom R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Henry's End is the best restaurant I have been to not only in NYC but anywhere. They have such an extensive menu and EVERYTHING I have tried is amazing! Their wild game festivals is the best! I love trying their variety of wild game. This is the first place I have tried Kangaroo and it was amazing. I highly recommend this restaurant for anyone who is considering it you won't regret it!", "author": "Alison S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "A true gem in Brooklyn Heights. Highly recommend the ribs, tuna \u0026 veal milanese. All six people in our group left raving about the food \u0026 wine.", "author": "Meghan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Great customer service, went with a group of 12 last Saturday to experience the menu everything was amazing, 5 stars", "author": "Nicholas A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Going out of my way to give this restaurant 5 stars.  Tucked away in an unassuming facade, the food, service, wine, and experience is all exceptional.  Everything here feels very lived in, but not worn.  People are packed in tight enough that you can't help but notice your neighbors' meals, which can definitely be a plus given the menu and variety offered.\n\nWhile Henry's has a fair bit of renown for their wild game and somewhat exotic menu options, the simpler chicken, fish, and beef are always delicious.  Most items on the menu are rich, filling, and well portioned, drizzled with sumptuous sauces and served with a side of rice for soaking it up when you just want one more taste.   \n\nThis place feels so familiar and friendly that I can't help but come back every few months with my wife.", "author": "Nathan W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "Went there on a \nSaturday night with another couple.  First of all it's very loud.  It's was also crowded which I thought was a good sign.  The food was not good.  My husband and friend ordered the duck which was awful. It was beyond tough, also food was luke warm, and the fig and pear salad contained 1 fig cut in half and 4 very thin slices of pear which saw better days. Never Again!!!!", "author": "Linda Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-27", "description": "Great old school vibe with delicious, creative fare and friendly service. Nice selection of beers and vintage wines by the glass too. It's a relatively small place and the food is a bit pricey but if you don't mind that it's a great place.", "author": "Yamileth H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-09", "description": "Went there once and It was good. Decided to go back. It was at 9:40 and they close at 10. When I got in, the hostess asked the chef if he would still serve us and we heard him ask how many people we were (we were two) and he said no thanks. If they don't want to serve us, we don't need to go back.", "author": "Charles C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "A friend recommended this place. My wife and I were in town and wanted a nice place for an anniversary dinner. I was a bit concerned when the Uber dropped us off.  The front was bleak looking. There was no reason for concern.\n\nThe manager and serving staff couldn't have been more attentive and professional.\n\nThe decor isn't fancy or romantic. The place is small. But, the food and service more than made up for that.\n\nThe food was incredible. A wide variety of imaginative selections. We wish we could have sampled more. I guess we'll have to come back.\n\nThe service was excellent.  The food well prepared and served promptly.  It doesn't get much better than that.", "author": "Charley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "This place was great. Great food and wine. I tried Kangaroo for the very first time and it was surprisingly good! The service was excellent, our waitress was prompt and friendly. The wine selection was very impressive. I would definitely come back.", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-20", "description": "Came for dinner on Saturday night with reservation.\n\nWe got duckling, veal, and steak entrees, and a shrimp and country pate appetizer.\nEverything was tasty, fresh, well cooked. It deserves 3.5 stars really... but not enough to round up to 4. \nThe steak was just a little tough. The duckling entrees were GREAT, I'd recommend those. The country pate was OK, great portions, came with all the fixings. I don't think I'd come back, but I had a good experience.", "author": "D M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-19", "description": "My last visit to Henry's End was about 40 years ago.  It is still keeping up.  The menu has changed somewhat, but the quality is still high.", "author": "Tony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "Enjoyable steak, crowded but warm atmosphere.\n\nMeal:\nReally enjoyed my peppercorn steak.  Nice cut of meat, prepared well.  Side dishes are modest in size, but still enjoyable.\n\nService:\nWaitress was friendly.  Service was a little slow, but our water was kept topped off all night, which we appreciated.\n\nEnv:\nHad to squeeze around tables as the restaurant was cramped.  But that is part of the atmosphere.  Reminded me of a Boston North End Italian restaurant setup (long and narrow).  But I wouldn't want to table in the back, about a foot from the bathroom door.  Makes for an uncomfortable moment for both parties..\n\nRecommend.", "author": "Douglass W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Updating to include some photos.  My prior review still stands.\n\n\"When I want Duck - this is my go-to place.  It's ALWAYS good - and we're talking for over 30 years always good!!\n\nDining in - tables are really close together - Tables for 2 can be difficult to hold all the plates - you're better off taking a 3d wheel and getting a table for 4!\"", "author": "Lynn M G."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}