{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-18", "description": "Food was hit-or-miss, and menu items could have used more descriptions.  Also, the prices were steep and didn't justify the quality of the food.  Two bright spots:  extremely convenient to the A/C train at High St.; the Mrs. Mud Pie dessert was phenomenal", "author": "Bret H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "i've always been a self-professed carnivore (my absolute favorite meal when i was younger was steak) so Henry's End is right up my alley.  sadly we missed their winter festival -- though i won't make that mistake next year! -- but the meal we had was quite good, even if it wasn't their strongest season.  i selected the duckling in a raspberry sauce, and what particularly struck me was how the sauce did NOT overpower the taste of the duck -- my fear was that it would be too sweet, too dessert-like, and not enhance the flavor of the meat. but oh, was i wrong. they've perfected that balance, and i was quite pleased. because duck is delicious.  meanwhile my bf had the shortribs, which were also excellent, and the only thing i didn't care for was the game meat charcuterie that we ordered for our appetizer -- i'm an open-minded eater, but some of the stuff on the plate was just a little too weird for my tastes. but i was still glad we tried it, and it definitely doesn't deter me from going back.\n\nalso good to mention that they have a nice selection of wines by the (affordable) glass, as well as bottled beers, and our waitress was awesome.  i'm gonna take a guess and say that she's been working there for a while -- she wasn't young -- but she was so enthusiastic about the choices we made while ordering that we just got even more excited about our food.  i like personable service, and we definitely got that.\n\nprices are reasonable - entrees around $20. so, not cheap, but definitely not the most expensive place in the neighborhood.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "Upon browsing the menu as a new and cautious patron, there were some things that looked fantastic and some that made me want to vomit just a bit in my mouth.  Ended up with the elk chops and it was wonderful.  The portion size seemed small but really filled me up.  Nice atmosphere.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-12", "description": "This is the only really good restaurant in Brooklyn Heights.  Try the grilled vegetable, polenta, and balsamic vinegar appetizer.   The fish is always fresh and well seasoned (although the sauces are a bit too heavy and rich for my taste).  And the service is amazing -- personal, knowledgeable, and full of character.  When it gets crowded, let them take you the wine bar down the block.  The appetizers there aren't any good yet, but they have a good wine list and the bar is very pleasant.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "Absolutely one of my favorite carnivorous haunts in the city. Henry's End is a cozy, intimate, typical Brooklyn Heights neighborhood place; it almost feels like a hunting lodge with its wooden interior. They make fresh stocks daily, and you will taste that in their very rich sauces that they serve over their meat dishes - the last time I was there, I had a hangar steak au poivre dressed with a mustard cream sauce. Another recent highlight was a bourbon glazed rib eye topped with a corn salsa. These subtle riffs on classic main meat dishes are what really sets this place apart. You may also find wilder meats on their menu, like elk chops and venison, but that varies seasonally. They tend to have many seasonal specials on their menu, and those can change week to week too, but they are all good! They also have excellent pasta dishes - everything is rich and hearty and great here. The service has all the charm a Brooklyn neighborhood spot should and then some - they have a loyal clinetele from all over the city that visits them regularly, and you will see the patrons hugging and kissing the waitstaff on entry. This and Noodle Pudding and Brooklyn Heights' contribution to the best kept dining secrets in NYC. If you are into good meat dishes, you will be thrilled you came. Not to mention they have Sam Smith's beer.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "One of my favorites in the city - LOVED their pan roasted vegetables - and butternut squash soup, and their fried chicken - which is much memorable than some of those high-profile southern restaurants that serve fried chickens.  Their food makes me happy afterwards.  And I can't say this about many restaurants.", "author": "L B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-25", "description": "Love this place! Great food, great service. By far the best restaurant in Brooklyn Heights.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-12", "description": "After reading reviews on Yelp and Zagat, I was psyched to try out this restaurant.  We ordered the bbq ribs, veal with garlic, and crab cakes.  Except for the ribs, everything was kind of bland.  The veal seemed overcooked and the crab cakes seemed like they had crab filling.  We had the apple cobbler for  dessert.  It seemed like it came out of a jar.  I was a bit surprised because the prices were on the high end of Brooklyn Heights.", "author": "Lester L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-31", "description": "OK, Henry's End is probably not going to be your idea of paradise if you're a vegetarian. That said, however, it's got some of the best food around, dished up in a neighborhood joint by some of the friendliest staff around (I've been going there for 15 years now) without any white linen tablecloths or hushed silence to be found. A recipe for a great relaxing meal out. The core of the menu is comfort food deluxe -- fried chicken is one staple. It's a great place to go for duck (a massive piece of meat, and in addition to the three staple glazes, which include lingonberry, there is always a special) and their steak au poivre is to die for, with a cognac/cream-based sauce. If you're violating your diet, try the delectable lobster cream pasta or tortilla coated shrimp. The veal is excellent... I could rhapsodize endlessly. In the fall, you've got an opportunity to check out the game festival, which is a mixed bag of everything you can imagine being edible that you've never actually tried eating. (Bison? Elk? Boar?) I'm a big fan of the game pate, served up with a lingonberry sauce and some excellent grainy mustard. This is one place that I take all visitors to Brooklyn to, and now some of them make treks from Westchester and Queen's every so often to check it out. Chocoholics rave about the chocolate-based desserts; I'm a big fan of the Persian lime pie. (Ask, and you'll be told that Persian limes are slightly smaller and sweeter....) \n The food is probably four stars; I rated it five because when you eat here, it's like you've shown up at a friend's home. This is the best kind of neighborhood restaurant imaginable. \nOne note: no reservations for tables of two, so if you go on a weekend, go early or be prepared to wait for a table. They will do take out, as well.", "author": "Suzanne M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-27", "description": "Oh what has happened?  This used to be so fine.  Is it the chef problem?  Chefs are coming and going.  Is it the economy?  Portions are small which is almost ok because they are mediocre.  And the vegetables are a joke as is the pilaf.  Pilaf?  It's white rice and ice cold.  The prices however are up but the quality is down.  What can I say the service is excellent, but sigh it is an old dowager down on her luck.", "author": "alex s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-27", "description": "Ok, talk about a very interesting menu for the adventurous spirit. This restaurant lists seasonal game on their menu. From duck, to venison. Came here one night looking for something different than the usual. The menu itself is very interesting, even if you decide not to go for the seasonal game options. The space is small and a bit cramped, but cozy none the less. The waiter was very knowledgeable and attentive to our questions about the menu. The STEAK AU POIVRE was a very good option to select. It was cooked very nicely and the sauce was not overpowering but complemented the dish.  Appetizers also were on point. I cant describe it all as it has been some time since i visited Henry's End, but it was very good experience which I'd like to venture again sometime. This is a little jewel in Brooklyn heights and the locals seem to be very fond of it, but the looks of the crowd and the wait to be seated on a Tuesday night. Be adventurous... Henry's End will not disappoint.", "author": "Orlando E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-09", "description": "I would not go back to this restaurant.  We ordered the BBQ shrimp appetizer which included only three shrimp for $12.  The BBQ sauce was good, but nothing special.  My husband ordered the duck with mushrooms and lingonberry. Not too good. Duck is usually quite tender but this must not have been a good piece or something because it was chewy.  I had the fried chicken and it was good.  Our dishes came with rice pilaf. I wouldn't go back because the menu items are boring - the duck is prepared the same way with a choice of three different sauces, the same could be said for the veal, and the random rice pilaf that came with both of our dishes didn't go with the meal at all and obviously did not require any thought from the chef.  While it is a cozy restaurant the custom neon sign has probably been there since the restaurant opened and probably nothing has changed since then including the menu.  I'm glad I can check this place off my list, but I will not return.", "author": "Vicki H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-16", "description": "So so so good. I felt so warm and cozy at this place. Looks like a log cabin. Wine list is excellent, and surprisingly well priced. Chicken wrapped with goat cheese and fig jam was the best chicken dish I think I've ever had. Juicy, tender chicken breast rolled around flavorful soft goat cheese. The fig jam complimented it perfectly. My boyfriend got the mixed game plate which he licked clean. Our waiter was informative and patient (we had a little trouble deciding what to order due to the extensive menu). My favorite place to eat in Brooklyn Heights!", "author": "Geri C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-14", "description": "Some days good ,some days bad.  It depends on the chef of the evening.  Joey who is on during the week is the best.  Sometimes ,sigh ,the food is cold and obviously oldish.  Send it back at that time.  The vegetables are horrible always and the rice is dreadful.. That said this could be a great restaurant but often isn't so complain...  You will get results.", "author": "Cool N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "incredible dinner--they have a wild-game feast from October thru March. Their snapper-turtle soup with Sherry? DIVINE", "author": "Ki W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "cool vibe, good people, food wasn't even close to worth it IMO, but i'm not expert in wild game", "author": "Chris J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "I've been going to Henry's End since its early days and have never been disappointed. The warm and welcoming people there offer up delicious food and a wide range of wines and beers. On our most recent visit, this past Thursday, my husband and I went to celebrate his birthday. Our appetizers were delicious--he had the country pate (from the Game Festival offerings) and said it was the best pate he had ever had; I had the wild mushroom salad and it was perfect. Our entrees were also wonderful. I, tempted by the lobster risotto that accompanied the salmon, ordered the salmon and my husband ordered the Alaskan Cod. The cod was a bit spicy for his taste (he doesn't go for any spice at all), which made me very happy, since I really liked it and was hoping to share it with him. We traded our entrees and I got to eat the cod and a good portion of the lobster risotto (and there was a nice amount of lobster in it!) and he got to eat the delicious salmon. And then there was the matter of desert. We got the Chocolate Confusion--a combination of brownie, chocolate praline bread pudding, hot fudge and vanilla ice cream--together with a decaf espresso and a decaf coffee. We thought it couldn't get any better than that. And then a friend sent over the Persian Lime Pie, which really made it a birthday celebration to remember. \n         And as the days grow longer, we start hankering for the best-ever soft-shell crabs that Henry's End has . . . and the fiddlehead ferns . . . and the morel mushrooms. With our first bite it will be confirmed--spring has arrived again. In the meantime, we'll comfort ourselves with the warming and wonderful offerings of their winter menu.", "author": "Joan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-30", "description": "I've been eating at Henry's end for a little over 10 years, and the quality has steadily gone down over that time. Their winter game festival is still kind of OK, but overall, the level of cooking is now mediocre at best. For some reason they've taken to grossly over saucing everything - perhaps to mask the declining quality of the raw ingredients. A recent filet mignon had quite a bit of sinew in it, and rare tuna was slightly funky - not outright spoiled, but not that fresh. You might be tempted by their Prix Fixe menu - don't be. In a display of complete lack of graciousness, they remove the vegetables from their prix fixe offerings, then offer to return them for an exorbitant price. Aside from the stinginess (potatoes cost pennies!), it makes for a very poor plating, and casts an unpleasant pall over the meal. Really guys, if you can't afford to throw a vegetable on the plate, don;t offer the menu! Their desserts are huge, but at the level of a decent diner. This used to be a place to go for a treat, but it is sadly no longer worth the price, even if someone else is paying.", "author": "Zando E."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}