{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "After reading reviews this sounded like the perfect neighborhood spot to take parents visiting from out of town. The restaurant itself has a great small wine bar feel to it, nice lighting, good amount of space (no sharing conversation with the next table), good attentive service and solid menu. We started with the charcuterie- great array of a pate, and some other cured meats that were all yummy. A few of us did the $25 three courses- great deal! Between the table we had a few different salads the favorite was the brussels sprouts salad YUM. My husband had bufalo short rib ravioli to start- quite the starter with a rich sauce, amazing but a little rich for an app. I had the salmon with mustard and  lentils- always a fab combination, it was cooked perfectly, well seasoned, perfect temp, I was very happy. Other dishes at the table included a veal entree, chicken with shallots and tuna, everyone was impressed by how well everything came out. We were also not short on wine, that's for sure :) By the time dessert came I could barely breathe but do remember something chocolatey and delicious. So glad we finally discovered this spot in our neighborhood and will definitely be back!", "author": "Amy J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-30", "description": "Made my first visit to Henry's End a couple of weeks ago. Perhaps, after hearing so many raves about it, I had unrealistic expectations, or perhaps I just hit it on a bad night. The cozy, rustic, atmosphere is wonderful, and the bartender can mix a mean cocktail, so compliments are due, I found the menu exciting (albeit a bit pricey for a neighborhood haunt) and was torn between a couple of different dishes...always a good sign. I started with the wild mushroom salad, which was really excellent. As a main course, I opted for the sole with the lobster and tomato cream, as another member of our party ordered it before and raved about it. When the fish arrived at the table it was clear the it was not fresh fish, as there was a slight tinge of odor to it...not awful, but still noticeable. Also...I have my doubts about it being sole; if it was sole it was the thickest piece of sole I've ever had.  At first bite, I was inclined to believe the fish was also frozen, and not fresh catch. Trust me, I know my fresh fish...I grew up by the sea. I ate as much of it as i could, but just couldn't get through the mushy, grainy texture of the fish to finish the meal....disappointing at best. I then ordered a banana pudding that arrived in a martini glass. Without exaggeration, there was two inches of pudding topped with five inches of whipped cream....nice presentation, but it took three tries to reach the pudding through the mountain of topping. With that said, I will give it another try; every restaurant has a bad night. Thumbs up for atmosphere, and service.  Here's hoping the next visit is a better one.", "author": "S. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "This is one of our favorites - have been coming here for 5 years and love this restaurant! It is underrated. Their veal and duck is fantastic and they have a really nice wine selection. This is a real winner. \nPS - If it's your birthday, you get a complimentary meal!", "author": "meredith p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-09", "description": "The ideal restaurant.  A diverse yet classic menu that features expertly executed dishes at reasonable prices.  The atmosphere and staff are friendly, unpretentious and perfect enablers for a long, boozy evening with friends or a casual date out.  The Ozark Bar-B-Q Ribs, which I tend to order as an appetizer although they're also available in an entree portion, are perfect, not too fatty and slathered with a sweet/spicy sauce that warrants mopping up with whatever is left in the bread basket.  For those who like their food spicy, the West Indian Bar-B-Q Shrimp never disappoint.  \nEntree-wise, the Veal Morel and Sole Citron are favorites.  But, for staunch and adventurous carnivores like myself, Henry's End is at its best with its October-March Wild Game Festival, a constantly changing selection of masterfully prepared Venison, Wild Boar, Reindeer and Elk.    This is a restaurant that takes its specials seriously and offers lots of them.  I've been going to Henry's End, at the advice of a friend who lives in Brooklyn Heights, for over six years and have never been bored or anything less than delighted.", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-06", "description": "came here for a friend's birthday. tried the venison on their wild game menu. it was delicious!", "author": "Elaine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "We moved to Brooklyn Heights a few months ago and had walked past Henry's End many times without even noticing it - the edifice is quite unassuming, as are the surrounding businesses.  A foodie friend, hearing that we had moved to the neighborhood, excitedly asked us if we had tried HE, after which we decided to drop by for dinner. \n\nThe interior design suggests that ambiance was not at the top of the management's mind, but there is something authentic and charming about this - especially as compared with plenty of other locations in the area that have a cultivatedly insouciant air that is mostly a front.  The lurid, unironic 80s neon sign on the wall is enough to tell you you ain't in a gastropub, you're in a Good Restaurant that Serves Good Food.  \n\nI ordered a glass of Chenin Blanc and the Chicken with Bleu Cheese Sauce, Walnuts, and Pears.  My husband ordered salmon, about which I could say more, but my memory is completely clouded with the deliciousness of my own meal.  After sampling a bit my husband declared my dish \"Chicken Pancakes,\" which is pretty accurate: the pears seemed baked or sauteed in a buttery sauce that evoked the spiced richness of pecan pie and Belgian waffles, and the chicken was moist and encrusted in a subtly sweet breading.  The bleu cheese flavor was imperceptible - I was expecting the moldy bite you typically get with this ingredient, but I think it rather contributed to the depth of the dish.  We also ordered the asparagus with goat cheese fondue (really just a mild and rather chalky goat cheese sauce drizzled on top).  The asparagus was perfectly al dente, and while the sauce didn't contribute much, I don't think it really needed to.  The dishes came with rice and haricots verts, which I largely ignored and enjoyed my entree.  Even the breadbasket was fresh and flavorful. We had already made other plans for dessert, but I watched a few items headed for other tables and found myself envious.\n\nPrices are mostly under $20 for an entree.  Be prepared for tough deliberations about your order, though - it's an extensive menu with many options to tempt the adventurous diner.\n\nMake a reservation in advance; it's a cramped but congenial space, and the service is no-nonsense and efficient.", "author": "Leah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "Please don't read this review, there's plenty of other ones that are a lot more objective.  \n\nI'm not kidding.  Please don't ask me to say anything imperical about this place.  Since moving away from Brooklyn I've been dreaming about the Chicken Lemonese and the Three Mustard Salmon--two dishes that are as good as anything I've eaten and that I can't get anywhere else on the planet (as far as I know).  Two dishes I could have every night and not get tired of.  But the menu is much bigger and full of other delights.\n\nI've driven two hours to wait another hour to have my fix.  The owner smiles when he sees me.  He knows me, he knows he has me in my clutches.  I can't do anything about it, and I'm not sure I want to.\n\nI don't know if there's a heaven, but if its like this place--good conversation, friendly people, one fascinating delight after another (the wine list is one of the many things that have won awards); a perfect date place just steps from Fulton Ferry Landing or the Promenade, a great place to bring a group of people and share each other's food--then this is my kind of cosmos.\n\nIf there is an imperfection, it is that sometimes they experiment.  And the experiments are--at their worst--fascinating.\n\nI needed to write a review so I could add this to my list of favorite places (a list of one).  I feel I've failed as a YELPer because I can't write the epic love poem that this place deserves. Forgive me.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "I visited Henry's last evening and found the atmosphere warm and friendly. The wait staff was attentive and the manager Erik was very accommodating. He spent time with us and his recommendations were excellent. I had a duck Ruben which was warm and moist. The duck was delicious and the they used an excellent quality Swiss cheese. My date had pork chop which was perfectly cooked and served over fresh steamed spinach. \nI recommend Henry's and plan on going back for their jazz at Saturday brunch", "author": "Jack R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "I've been going to Henry's End for close to 20 years. The steak diane is one of my favorite meals in the world. Henry's End also has great specials, great appetizers and a great wine list. The place is small but not cramped. The wait staff used to be top notch. They had all been there for years and were friendly and extremely knowledgeable. I had a waiter that I had never seen before. He was rude and seemed to want to be anyplace but at the restaurant. The food is too good to let a tard like my waiter ruin the experience. I just hope he is gone next time I come.", "author": "joe y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "This is my favorite restaurant in Brooklyn.  The food is always amazing.  They don't rush you at all, they let you savor every course.  The desserts are to die for.  The only problem is how close all the tables are to each other---but that's New York!", "author": "Cara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "Bustling little restaurant allows one to eat and see the kitchen at work. Inviting wine menu, including several selections by the glass.  Waitress allowed us to sample one before choosing, admitting that it was a \"bit diffierent.\"  While my wife sticks to her staple pear/walnuts/blue cheese chicken entree, I enjoy trying the game options.  Last time tried the wild mushroom \u0026 lingonberry duckling. Incredible!!!  In the past ordered a steak MR and came MW. The chef agreed and cooked me new one.  B-day special is a plus.", "author": "Danyak D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Upscale food in a casual atmosphere.  The tuna tartar and bbq shrimp are delicious.", "author": "Brenna G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-01", "description": "What's a veggie girl supposed to do when all her friends want to do is eat meat? Nay, not just meat, but WILD GAME? Well that girl can eat the most delicious platter of grilled vegetables and goat cheese polenta with a very tasty glass of syrah. All if omnivores in my party were please with their food, especially the pheasant ravioli and the mixed grill. The waiter was a hoot! Very attentive and personable!", "author": "emily l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-18", "description": "Great night spent here on a cold January evening. Good beer, good food, great waiter.", "author": "Tim G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "My husband and I came here last night for my birthday and the food was absolutely delish! The first time we ate here, I wasn't too crazy about the dish I had ordered. I believe I had gotten some kind of duck but it was very fatty and gamey. My husband had gotten the 3 mustard salmon and he said it was amazing. Last night we came back so that we could try out their wild game festival. My husband ordered the Elk, I ordered one of their specials, Canadian Salmon with lobster risotto with a champagne vanilla sauce. Both dishes were outstanding! His elk was soo good. Not gamey, not an ounce of fat on it and cooked to perfection. The sauce which was made with wine and the natural drippings from the elk itself, was so delish. My husband soaked it up  with his bread once he was done with his chops. My salmon was perfectly cooked and the skin was so crunchy. The lobster risotto was also cooked perfectly with big chunks of lobster in it. The champagne vanilla sauce, although a little on the salty side which made me drink about 3-4 glasses of water, was outstanding. When I eat out, I hardly ever finish my meal. Last night, my plate was empty. The only downside was they didn't bring us any sides but truthfully with the amount of food that was on my plate and the size of his elk chops, we didn't really care. We are definitely going back in October once their game festival starts up again!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "Customer service is always how I guage a business of any kind, because nothing is more important than how you are respected as a customer. Whether you are a first timer or eating there for maybe the 300th time (I think it's about that) the owner Mark and the entire staff do everything possible to ensure you have a great dining experience. Yes the restaurant is cozy, I prefer to see it as charming- but the food is 4 star, the wine list varied, excellent and reasonably priced. Oh and the customer service? The reason I have been patronizing this place for 30+ years. Henry's End is everything you look for in a neighborhood restaurant.", "author": "bruce s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-17", "description": "The only thing that attracted us to this place was the early week wine tasting  menu. The wines weren't bad if had ever found out what they were. The waiter grumpily threw them at our table. When we asked what they were, he shouted something back indiscernible from three tables away. The appetizers arrived. We got the West Indian BBQ shrimp and the scallop salad. The first seemed like frozen  shrimp, canned corn and a jar of BBQ sauce, the later included only 2 tiny scallops despite the price. Our mains were even more disappointing, poor cuts of meat, blandly prepared and overcooked. The desserts weren't bad but he service never improved. The highlight of the evening was a night cap in the Henry st alehouse a few doors up.", "author": "Oliver J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-20", "description": "atmosphere was great and the menu offerings were entertaining.  wait staff somewhat slow but very accommodating to my gluten-free guest.  tuna tartare and turtle soup were disappointing. tuna was covered in sweet thai chili sauce that could have been from a bottle.  the turtle soup with sherry topper was mostly interesting as an idea - the flavor was mundane  it seems this place caters to the palates of the regulars, not what is hip in terms of cuisine flavors and preparations.  however, the menu was intriguing enough to merit a possible future visit.  Boyfriend will love wild game options.", "author": "Katherine P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-17", "description": "we all had the prix fixe menu it sounds good for 30.00 3 courses but entrees do not come with anything you must purchase sides if you want, the chicken was very good with apples and blue cheese , the salmon with herb crust was also nice , but my duck with the honey glaze the skin was not crispy the meat was well done and swimming in sauce , the truffles fries were very nice, i will give them another try maybe get something off the regular menu and see if it comes with any accompaniments", "author": "T A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-28", "description": "Funky, friendly, and cool. Family-owned since forever. Go only for the entrees and the wine- the rest not worth consideration.", "author": "Allie B."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}