{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-22", "description": "i knew it was love when the waiter plunked down a bottle of sherry next to the turtle soup--ostensibly to cool it down in case it was too spicy.  (it wasn't.  it was delicate and delicious and unlike anything else i've ever tasted).\n\ni came here specifically for the wild game menu.  i tell ya what, the rumors are true.  it is completely mind blowing.  the meat--- OH THE MEAT!!  the mixed game grill came to the table with a trio of things i'd never even considered eating but now that i'd seen it on a menu, was ITCHING to try.  by far, the elk chop was the table favorite.  tender, savory, fragrant.  so good, we unanimously agreed to dispense with etiquette (and silverware) to gnaw the bones clean.\n\n2nd best was the braised boar belly -- the most delicious bacon-like substance i've ever tasted.  crispy on the outside and perfect!  no wait, i take it back... 2nd best was the venison sausage! Spicy and juicy.  or wait... maybe the boar stew.... \n\nAh, forget it.  i don't even have the verbal capacity to describe everything that found their way into our tummies.  it was all outstanding.\n\naccompanying each entree was a side dish containing the least amount of items that could be combined on one plate and still be referred to as a \"dish\" -- two forkfuls of rice, a bite each of cauliflower and carrot, and a singular, halved, brussels sprout.  fine by me.   after all, i came for the meat.  the less distractions, the better, in my opinion.\n\nwe heard rattlesnake and kangaroo will be featured before the festival ends -- i'm already planning my repeat appearance.", "author": "Mag M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "I found Henry's End accidentally, trying to find a good restaurant to visit with my parents.  If I lived in Brooklyn Heights, I'd eat here once a week!  Despite the wild game menu that everyone raves about, I usually get their salmon.  Whether it's salmon with lentils, salmon crusted with crabmeat, or their salmon moroccan (my husband's favorite,) it's always perfect!  Their weeknight prix fixe menu is better than any deal you'll score during restaurant week -- $25 for three courses, and well worth it.  Their persian lime pie is a great way to end the night.  In addition to their fantastic menu, one of the best parts of Henry's End is the staff -- always welcoming, friendly, and accommodating.  We've visited several times over the past year and feel like we've been regulars for years!", "author": "Jocelyn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-06", "description": "I could spend my review reiterating everything everyone has already said about Henry's End (the game! the wine!), but I figure I'll mention something that hasn't really been focused on much: this place is great for vegetarians, too!\n\nI'm not a huge carnivore, though I have indulged in the raspberry duckling, the lobster penne, the fig and goat cheese chicken, etc etc.  What I usually get at Henry's End is a huge pile of vegetarian-friendly food.  Their beet and warm goat cheese salad is incredible - I order it every time I go.  Right now, they've got a pear-raspberry soup on the appetizer menu that is divinely creamy and full-bodied - do they put butter in it or something?  Can you do that to fruit soups?  I don't know, but it's amazing.  Artichoke and lemon soup?  Check.  They do lovely seasonal vegetable sides sometimes too - this spring, they had fiddlehead ferns.  They've got a wonderful pesto, and their roasted vegetables over polenta are supreme.  And, of course, the wonderful desserts are all veg-friendly - get the Mr. or Mrs. Mud Pie - HUGE slices of ice-cream based cookie-crust pies.  Top it off with an espresso - beautiful.\n\nSo vegetarians - do you have a beloved carnivore eager to try Henry's End?  Don't squirm out of the opportunity - you'll be glad you went, too!", "author": "Charlotte C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "This is an intimate place that has an air of competence without pretense. It has served delicious seasonal food since way before that was the \"in\" thing to do. The prolific, small kitchen is within view of the diners. My salmon was cooked perfectly, \u0026 the wine suggested by the waitress was a fine complement.", "author": "Xenia U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "This place is fantastic.  Nothing pretentious about it, and the motherly waitress whos name escapes me is always there to please.\n\nWhat rules about this place is their fall/winter wild game menu, they call it their wild game festival i believe.\n\nVery well priced wine menu, with a chalkboard for specials by the glass every night.  \n\nUnless I'm mistaken the current chef owner was a dishwasher their a long time ago and worked his way up.  Cant beat that!", "author": "Jared P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-12", "description": "We were there on a Saturday night, and strolled in around 8:30, prepared to wait for a considerable wait, but our under fifteen minute wait was the right note.  The minimal waiting time was enhanced by the helpful and genuine attentiveness from the staffer who updated us with wait times upon finding out that the table we were waiting for had not ordered dessert.  All that said, the food was so good, that even an hour long wait would probably have been worth it.\n\nWe started off with the wild mushroom salad from the regular menu and a special app of the shaved brussel sprouts, bacon, pecorino \u0026 pomegranate salad.  Each selection was perfectly on point.  The wild mushroom salad was warm and rich and garlicky (though BF thought perhaps a little too much oil with that garlic).  The brussel sprout salad was well prepared, to appear like a frisee, and had delicate, well-complimenting flavors - from the smokey bacon pieces to the sweet fresh crunch of the pomegranate seeds. \n\nFor mains, we both decided to sample the wild game menu, which has been extended to continue until Memorial Day.  BF tried the wild game sampler platter, which included rabbit sausage, elk chops with a mustard seed breadcrumb crust and wild boar belly with pomegranate pistachio chutney.  The lowest point for him was the rabbit sausage, which he expected, saying he did not order for the sausage, and felt it simply tasted like any other good sausage.  The pork belly was reported as pig 2.0, with a perfect combination of fat and sweetness in the meat, enhanced by the flavors in the sauce.  The elk chops were the star of his plate, and is being coined as one of his new favorite meals.  The meat was tender and perfectly cooked and didn't fall into any trap of being typically too gamey.  I went with the penne with venison sausage, butternut squash and hazelnut.  Perhaps it was a safe choice in the realm of wild game, but it was still delicious enough to not care.  The sausage was spicy and sweet simultaneously and the sweetness of the squash highlighted that hint of sweetness in the meat, while the hazelnut added a bonus crunch and richness to the dish.  \n\nThe service was pleasant, attentive and yet unobtrusive throughout our meal.  The atmosphere is warm, cozy, and food-focused without being stuffy in the least.  To be sure, this won't be the end for us at Henry's...", "author": "Victoria L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-25", "description": "I like game.  If you don't, this probably isn't for you.  Cozy, small, intimate.  The kind of place that doesn't have to pretend about anything.  Great wine list, and attentive, unannoying staff (sime might mistake this for snootiness, but I never liked a server saying, \"Hi, I;m Amber and I'll be taking care of you tonight...\").  Yes, the desert choices are skimpy, but you don't come here for desert.  Love it.", "author": "Morgan I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-07", "description": "We had a delicious meal here. We came during the week and took advantage of the price fixed menu (M-TH). Service was fantastic, the food was even better. I think the appetizers were the highlight of the meal. I had macadamia nut crusted shrimp in a peanut sauce with some kind of apple/pineapple/cranberry mash, and he had braised short ribs in a wonderful BBQ sauce. We will definitely return to try some of the other fantastic looking menu items.", "author": "Meghan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "Went to Henry's End to kick off my BD celebration. My friends and I were treated so nicely by the staff.  The meal was super delicious. My compliments to the chef for a wonderful dinner.  Looking forward to coming back.", "author": "Abbe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "The BF and I had been told we HAD to come here, and when my parents were in town, we finally decided to try it. \n\nSo we got there a tad early and they politely asked if we wouldn't mind going to wine bar next door to have a drink, and they would come get us. We were totally fine with this, since they don't have a bar, and they came and got us very quickly. So we started off well..\n\nThe food, service and management was great. We all got different things and loved all of them. My dad and BF tried different wild game entrees and we're so impressed, while my mom, my sister, and I keep it basic, but still loved it none-the-less. The waitress was super nice, always attentive and put up with my dad's \"dad jokes\" (we all know what thats like). The manager or owner was very nice too, he was the one who came and got us from the wine bar, called us a cab after our meal (yes, suburbanite parents refuse to walk a few blocks) and was overall, very accommodating. \n\nI would definitely come back here. I don't think you can go wrong with anything on the menu here!", "author": "Dee E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-19", "description": "This place has all the elements reminiscent of an old world Brooklyn bygone era. I can understand why it has been a neighborhood establishment these last 35 years. Keeping the menu classic \u0026 the qualitity of the dishes consistent is what makes them successful.\n\nThe steak here is absolutely amazing! So thick, tender, \u0026 juicy...it's definitely one of the best I've had anywhere. I am also impressed by their extensive award winning wine \u0026 beer list. There are more selections here than an average liquor store.\n\nThere's nothing trendy or pretentious about this place. The crowd is pretty tame, older, \u0026 the atmosphere is suitable for family gatherings. \n\nThe quality of service you get here is comparable to most 5 star restaurants in Manhattan....with credits given to that old school charm they've maintained all these years.\n\nFood \u0026 service equally deserve 5+ stars!", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-01", "description": "Love love love this place.  If you're into game, go.  If you're not, there's still a ton to chow down on, including numerous adventurous chicken dishes and lovely fish dishes.  Do not miss the ribs.  Incredible.  Also amazing: the wine list.", "author": "Meryl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-06", "description": "What  a great place.  Yes, the menu is a mecca of game and interesting meat.  The wine list is excellent, with several big, bold fruity wines and smoother New World wines.  I had a terrific mustard-crusted tuna steak that was perfectly medium rare with a crusty, crunchy coating of stone-ground mustard.  They used pan juices, wine and more mustard to reduce down an intense and thick mustard sauce.  It was lying on perfectly steamed bed of fresh spinach with soy and mustard oil.  It was just excellent.  The waitress was fantastic, friendly and using terms of endearment and she is absolutely Julia Child's doppelganger. No kidding.  That unique side-of-the-mouth diction as well.  The dessert of layered crepes with custard was velvety and light.  The only weak point was the espresso.  Tasted more like brewed drip coffee to me so had I been expecting that it would have been perfect.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "We had a lovely evening at this place. The restaurant is very cozy and comfortable. The wild game menu was interesting and there was a good wine selection. I had the stuffed quail and my husband had the veal. Both were delicious. Our service was excellent.", "author": "Ann M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-04", "description": "I went there after a long walk on the Brooklyn bridge. There was no Wild Game plate that day, so my bf and I ordered the dinner combo. \nMy appetizer corn calamari patty was a bit too salty. but the sauce came with it was creamy enough to tone down it a bit. My rib was cooked very well. It melt right away in my mouth, but it was also a bit heavy on the sourness. Again, it is an appetizer, so the acidity wasn't that big of a problem here. and it help to tone down the fattiness of the meat. \nMain courses were Soft shell crab, veal (forgot the long name) it came with a very creamy sauce with some diced tomato. i thought it was pork first, since the way it was prepared was deep fried with coated flour, then simmered with the sauce afterward. It made the texture of the meat taste more like pork. it was a okay dish. Not bad but not wahhh ~\nMy bf's plate (soft shell crab) on the other hand was so delicious, the seasoning was just right. Not too salty and very savory. Americans don't cook with MSG or Chicken Essence Powder often. The savory of this dish came from the freshness of the raw material ( crab). The only thing is i wish there were some vegetables on the side. \ndessert were okay okay. Again, this is not a bakery or a dessert hot spot. Mine was meshed banana with whip cream on the top. Maybe they know it is lacked on texture, it was top with few crispy granola. but it was still too muddy. Almost like a warm banana smoothie... :( The whole experience was average. Their service was really great. I will go another time when they have the Wild Game menu on again.", "author": "Nai W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-01", "description": "Took my mom here for her birthday once.  I remember the food being really really good, but also pretty expensive.  Food worth the price though, basically the standard I judge things by in NYC.  You'll get what you pay for here.  From what I recall they didn't take reservations, was about a 30 minute wait maybe.", "author": "Rob K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-10", "description": "this is the restaurant i love best.  they have a great menu, you can find just about ANyThing on their menu--everyone in your party will be satisfied.  I LOVE the servers--you don't often say that in nyc but these folks are wonderful!!  and!!! you get birthday treats, if you register for their birthday club (or whatever they call it) within two weeks of your birthday (within 7days before or within 7 days after) your entree is on them!!  love love love henry's end!!", "author": "sveta k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-13", "description": "I went here looking for good American cuisine in the Brooklyn Heights are. FYI -- this is not really BH, it's closer to DUMBO. Nevertheless, the food and service were both excellent, if not a bit expensive. The atmosphere is very old fashioned. I enjoyed my meal but I wouldn't go out of my way to come back.", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-05", "description": "Bar none - my absolute favorite restaurant in Brooklyn Heights. The manager is terrific, the wait staff is friendly and helpful and the food is wonderful.", "author": "Mere M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-06", "description": "After asking for some restaurant suggestions from some long-term Brooklyn Heights locals, I was steered to Henry's End.  The restaurant was packed, and the tightly-packed tables made one an unwilling participant in dinner conversations at the surrounding tables.  The lady next to me was wearing a lovely perfume, but, I didn't really feel like experiencing it.  With this in mind, and the rather poor air conditioning on a blistering evening, I was pleased by the friendly service and delicious food.  The Steak au Poivre was delicious, in a delightful sauce and my dinner companion's soft-shell crab was excellent, albeit a bit too much butter/garlic, which overwhelmed the crab.  I look forward to going again to see if it lives up to the first impression.", "author": "Edmund R."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}