{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-17", "description": "Great little place for a delicious meal! The food is amazing and great service! The Pears, Walnut and Blue Cheese Chicken is incredible. My husband really enjoyed the Blackened Lamb Sirloin. I will definitely come back here when in New York again.", "author": "Tammy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-08", "description": "Thinking of Henry's End makes me misty.  Was taken to dinner there by an uncle of a dear friend.  Uncle Andy was originally from Chicago, but became a true New Yorker.  Having lived in Brooklyn for over 30 years, Henry's End was his favorite restaurant.  We had a lovely bottle of chardonnay, make that two bottles!  For our meal we had a delicious salmon filet, prepared w/ middle eastern spices.  I've tried to duplicate it at home; I've come close and it always reminds me of strolling through Brooklyn Heights.  What a wonderful neighborhood treasure.", "author": "Janet S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-27", "description": "I went to Henry's End last night, and I have to say that I was a bit disappointed. I heard about this place awhile ago and was intrigued by the whole Game Festival thing. After reading various reviews I decided that I would order the Duckling with Lingonberry and Mushrooms. While the skin was crispy and the meat very tender and moist (not oily or fatty), I thought the flavors were lacking (bland). I also ordered the tortilla shrimp dish. I loved the chipotle mayo with the shrimp - it had a nice zing. The shrimp were not greasy at all. I didnt really feel there was a need for the guacamole alongside, as it had a very subdued  flavor. It just seemed like mashed up avocado with no seasoning. They did include lemon wedges, so maybe I should have squeezed a bit of that on the guac to add more flavor. I would definitely order that again, maybe the meal size portion.\n\nI liked  the decor of the restaurant. It had a very homey feel. The place was small - smaller than it looks on their website. (our table was about 3 inches from the one next to ours).  It was very crowded, and there was a wait when we arrived, but we were seated within less than the 5 min we were told.  The first thing that struck me when we entered were the amazing smells. The kitchen was almost right there in the open (not a separate room).The service was attentive. Our waiter was extremely patient and answered any questions we had about the menu. \n\nI like the idea of this place, but was a bit disappointed with the food (for the price - almost $100 for 2). I would like to go back to give it a second shot. Any recommendations for what to order?", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-05", "description": "Elk, Boar, Snake? I'm there!\n\nI was very excited to try their wild game menu but was disappointed by the way dishes were prepared. The entrees were drowned in an overpowering sauce and I couldn't taste what I was eating.\n\nWild Game Pate - tasted like head cheese rather than pate. Hard to tell what meats were in this.\n\nBurmese Python Salad - tasted like Char Siu (Chinese bbq pork). It was very dense and sweet.\n\nQuail - best part of the meal. Like a very tender young chicken and they deboned it which was nice. It was flavorful and juicy.\n\nBoar Belly - exactly like Braised Pork Belly which is not a bad thing.\n\nElk Chop - mildly gamey red meat. Tasted of iron and mineral, like a piece of liver. Quite good would definitely try this again.\n\nSides were good but came in very small portions. Desserts were not good at all. The 21 layer crepe was soggy. Chocolate Confusion (chocolate bread pudding) was too chewy and firm for my taste.\n\nOur waitress was very nice \u0026 friendly though. We had 2 bottles of wine and total came out to $66 a person.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "This is a true gem!  The fare is American and you can choose from a variety of meats - no vegetarians here.  \n\nTough to get a reservation last minute so get one at least a week in advance.  It's a small and intimate place that has such an extensive menu of delish dishes.  I went in January - middle of the Wild Game Festival - and you can choose from the regular menu or get adventurous and try something wild.  I choose the South Texas Antelope and it was delish!  Other plates to try are the chicken with pear, walnuts and blue cheese.  It's the most popular dish!  Everything is great and the staff is so friendly and helpful.  \n\nI will definitely be back to take out friends or out of town guests - there is something for everyone!", "author": "Cathy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-06", "description": "Excellent!  I went there last night with my mom (who is also a foodie) and everything we ate was delicious! I will keep my review short and sweet because our dinner was just that that. Go, Go, Go. \n\nI have lived in brooklyn all my life and I cant believe I hadn't checked this place out sooner. My mom wanted to lick her plate but couldn't because we were in public! \nGo and enjoy:)", "author": "L. W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-08", "description": "In spring of 2005 I was dating a girl from Brooklyn Heights. The romance did not work out but one night we dined at Henry's End and I can say that this restaurant is the best thing that came out of that relationship. I put my name on their mailing list and every year around my birthday I get a voucher in the mail for a free entree. For the past six years I have dined at Henry's End on my birthday weekend and it has been an affair to remember. Chef/Owner Mark Lahm began his career at Henry's End in 1981 as a dishwasher and busboy. He eventually became a waiter, then manager, then chef. In 1986, he graduated from the Culinary Institute of America and took over the restaurant and Henry's End has become one of the best kept secret foodie destinations in Brooklyn to this day. The 2006 Zagat awarded the restaurant a score of 26 for food and an earlier edition stated \"this is why they built the Brooklyn Bridge\". In 2002, Mark and his staff hosted an event at the prestigious James Beard House. The restaurant has a cozy cabin-like feel but with taller ceilings adorned with fans and neon lights. The spacious open kitchen allows for diners to watch their meals come to creation methodically. Tables are a little tight together but in this environment it adds to the dining experience rather than detracting. The staff is very friendly and treats you like family even if it's your first time at Henry's End. Chef Lahm crafts entrees like chicken with pears, walnuts, and blue cheese, and blackened lamb sirloin over garlic mashed potatoes. Warm up with his New Orleans turtle soup and sherry. Make sure to visit Henry's End in the fall and winter (October-March) for their famous Wild Game Festival, where exotic game dishes like the herb-crusted elk and pepper-crusted venison and roasted wild boar are legendary. As an appetizer, the restaurant does offer an Assorted Wild Game Charcuterie of which, on this visit, included buffalo sausage, partridge sausage and Muscovy Duck pâte. Antelope, bear, kangaroo and python salad are also among the ferocious fare available at this white-tablecloth Brooklyn Heights standby. The restaurant is also known for its great duck dishes. The ducklings are braised in their own natural juices until they are flavorful and fork tender. Then they are boned and the fat rendered until the skin is delightfully crisp. The accompanying sauces include raspberry, or honey and ginger with soy and scallions, or a wild mushroom lingonberry sauce with shallots, thyme and brandy. To entice recession affected diners, Henry's End has been offering a $25 three course prix fixe on Mondays thru Thursdays with wine pairings for an additional $14. The restaurant also features an award winning American wine list. Chef Lahm carefully selects an eclectic wine menu for his offerings. On this night a 2007 Amador Rose was paired with scrumptious al dente crab and lobster ravioli. Diver scallops faired well with the grape tomatoes and a 2006 Dr. Frank Rkatsiteli varietal. Moroccan Grilled Salmon topped with a compound butter made from cumin, cayenne, mint and scallions and served over garlic mashed potatoes was a wonderful healthy option. \"Drop-your-fork\" delicious spinach sautéed in garlic went great with cauliflower, capers and cranberries. With the main courses, we indulged in hearty sides of arugula and roasted beets paired with a 2007 Van Ruiten Chardonnay. My Duck with Wild Morel \u0026 Portobello Mushrooms \u0026 Lingonberries Sauce, shallots, thyme and brandy melted in my mouth as I swirled my aromatic glass of 2005 David Bruce Petite Sirah. The meal crescendo included a Valrhona black and white chocolate mousse and an apple golden raisin cobbler covered in a light and flaky almond streusel crust. Our diligent server Nate paired our desserts with a satisfying glass of Fonseca Bin 27 Port. Dinner for two with birthday discount, tax and tip was $120.", "author": "The Jedi Foodi E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-24", "description": "One of my favorite places period.\nI usually go for the wild game when it's in season (their elk chops are to-die-for and their turtle soup is delicious) but recently I went just for a regular dinner. The place is small, noisy and crowded but also very friendly and cozy. The service is warm and friendly and the waiters seem to be around always, they even know their customers by name. Food comes pretty quickly and they are very responsive to any changes (i.e. mashed potatoes versus french fries, etc). I highly recommend their Steak Diane (huge pieces in a wonderful sauce) as well as their wild mushroom salad. Ask the waitress for recommendations.", "author": "Marina V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-24", "description": "Henry's End is a small place with intimate lighting. I went on a Tuesday evening around 8pm. The atmosphere was okay. The crowd was full of \"mature\" white Americans. Not much diversity in age or race. I had the pre fix meal. I wasnt quite fixed though. If you get the Honey Ginger Duck its 3 dollars extra. The duck was average. It tasted like high-end Chinese food. Sweet and sour duck. I wouldnt recommend it. My bill was over 80 bucks for 2 fixed meals, and it wasnt worth it. My date had the Veal, and he liked it a lot. The food is not awful, just quite average for the price you pay, oh and its BORING in that place!", "author": "Raena W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-05", "description": "Great food, great atmosphere, waiter put our whole party on one bill, two different tables. I guess that's a New York thing.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-24", "description": "Went here because it was one of the only Brooklyn Restaurants open for Thanksgiving. The service was disorganized, with food coming out at different times without the promised sides. Although the service OK, we had to keep asking for the sides, drink refills, and other service. The food was hit and miss -- the buffalo steak was tasty, but the turkey dinner was fried, not roasted as promised on the menu, and our steaks were overcooked. Finally, the prices were no bargain, although they were not out of line with city prices. But charging for refills on the children's sodas was a little over the top. Don't recommend this place, especially on holidays.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "I had the prefix with corn crab cake, duck and chocolate mud each with 3oz of wine pairing. Tasting sensation was unexpectedly good. I got more than paid for.", "author": "Queenie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "I went here once for my Dad's birthday. The food was great, everything was fresh and delicious. As a main course i had the black pepper crusted new york strip. It was very tasty and flavorful. The sauce they put on top was also really good. My dad had the same steak as well and he enjoyed it. My girlfriend ordered the duck. It was average, not bad but not great. My brother had the fried chicken which was pretty good. Overall we all enjoyed the place and thought it was worth trying. The only negative is the price. It's quite expensive - especially if you plan on having a few drinks.", "author": "Keith L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "I am addicted to the Chicken with Walnuts, Pears, and Blue Cheese. It's nearly impossible for me to order anything else, but when I do, I'm never disappointed. Going to Henry's End is always a treat, and on my dining-out scale lands between local standby and special occasion. It is consistenly the best restaurant in Brooklyn Heights.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "had a great dinner here friday night.  first time going.  called in a reservation about half an hour before going, and they had our table waiting for us (despite an otherwise packed house), so that was really nice.\n\nthey have a pretty nice beer selection from a variety of countries, so we started with some of those.  our server was fantastically friendly from the start and gave us her (solicited) opinion on a bunch of dishes.\n\nwe started with the ribs as an appetizer.  they were super tender, and the bbq sauce is very original.  the bread basket was also delicious, with some standard italian bread w/ sesame seeds, some of that hard and delicious crusted artisan(?) bread and some nice sesame seed breadsticks.\n\nfor entrees, we had the liver pate, lamb and fried chicken.  the pate was fluffy and decadent.  not a regular thing for me, but i definitely enjoyed a couple bites.  the lamb was also great -- cooked to a perfect medium rare, juicy and served with a sauce similar to the ribs.  and the fried chicken was just insanely good.  crispy on the outside, juicy on the inside and perfectly seasoned.\n\noverall, a 4 start dining experience.", "author": "noah g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "Been going for the Wild Game Festival for over 13 years now. Elk chops invade my dreams!  A friend even got them for dessert one year (me - never... Need to save room for the Mrs. Mudpie). But the hidden gem?  Maybe the best (and by that I mean both quality and most reasonably priced) wine list in NYC. Go. Have a great time.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "What a unique place to eat! I'm not sure I would want to eat here every night, but I was impressed with the atmosphere and menu. If you are into eating hard to get animals like kangaroo and turtle then this is the place for you! I stuck with \"safer\" items (mixed field greens and Moroccan salmon). The salad was great - very fresh, cold and crisp, right amount of dressing. The salmon was OK but not fantastic. It was cooked perfectly, and you get a decent sized portion. The Moroccan sauce was a little too much for me. It was very strong and extremely oily. I would have been happier with half as much, but I was able to push it away (minus the oil). The vegetable side (when I went it was snow peas) was also very oily. It wasn't bad, it just could have been a lot lighter for my taste.\n\nThe others at my table gave mixed reviews. No one seemed to like the corn crab cakes - lacked flavor and didn't seem fresh. The ribs were \"just OK\" (coming from a Texan who is \"used to more meat on the bones\"). General consensus was that the desserts were fantastic. So no complaints there! I got the Irish coffee, and it was great and strong.\n\nWe had a table of 6, and the service was great. They were pretty packed for a Tuesday night, and we still got great service. Our order was taken promptly, and our food arrived hot and fairly fast.\n\nJust one comment, they don't let you substitute or change up the menu at all. This isn't something that would dock them a star (it is NY, after all), but it is something to keep in mind if you are a picky eater or have food allergies (e.g. you can't substitute rice for potato, etc.).", "author": "S H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "Lovely neighborhood place that has always been pleasant and comforting in a sea of pretentious crap. Steak is great, but so is the game, the fish, and the service. The birthday post cards always bring a smile to my face. I make the trip to the Heights just for Henry's End.", "author": "C Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-30", "description": "At  one o'clock in the morning our circle of friends received an urgent email. Somewhere in Brooklyn Heights, there was a restaurant that serves BBQ rattlesnake salad!!\n\nOnce Shaun sounded the alarm I made reservations at Henry's End which has a Wild Game Festival menu on from now through February.\n\nThe restaurant itself, on the cusp of the Heights and Dumbo is an inviting, quaint place filled to the brim even on a Sunday. The intoxicating smells from the kitchen, the hum of happy conversations, and the old brick walls add to the ambiance.\n\nAs for the food, well, the rattlesnake was not on the menu (the site did warn that the menu changes due to availability) but we still found a lot to write home about.\n\nWe shared two game charcuteri plates, with game terrine and a rabbit and venison sausage. I had the turtle soup, an unexpected tomato based concoction with a soupy chili texture that pleased as well as it surprised me. Others opted for the best Caesar salad anyone at the table had ever had.\n\nI followed my soup with the rabbit sausage pasta, a very spicy dish which is possibly one of the tastiest pasta dishes I have had at a restaurant in ages. Friends partook in the venison stew, a mole-ish rich and dark dish of epic flavors. Jim was the most daring when he ordered the kangaroo steak and was well rewarded for it. The meat tasted a bit like pork, but fuller, more tender, and sweeter.\n\nEven though we were quite full we all managed a few bites of a 21 layer crepe cake (a former brix pick and one I can never resist). Make your reservations now while the wild game festival is still going on, but the regular menu is, I am sure, just as satisfying.\n\nhttp://www.brixpicks.com/", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "This place was actually our plan b for the night but I'm so glad we ended up here.  \n\nGreat service.  The hostess/waitress seemed to know the whole neighborhood.\n\nI highly recommend the:\n\nCorn Chowder\nMustard Seed Crusted Tuna\nDark and White Chocolate Mousse\n\nEnjoy!", "author": "Analia A."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}