{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "The food is amazing! The only reason I'm giving 4 stars is because we sat at the back, closer to the kitchen. Considering its a small, local bklyn heights place, the closer to the kitchen you are, the hotter you're going to be.  But I definitely recommend this place!", "author": "Alex A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "A restaurant with such an enticing menu that it was hard to make a choice. It's a lovely, cozy small restaurant with a good wine list- perfect for my first visit to Brooklyn.", "author": "Nancy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Perfectly cooked steak. Interesting ingredients and selection. Great service. Good date spot.", "author": "Kristopher D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-10", "description": "They need to work on their dessert menu. \n\nAnd maybe not put soy sauce in EVERY dish. \n\nBottles of wine range from 28 to 1100$. And I am not kidding about both prices.", "author": "Dareen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-13", "description": "I'd been looking forward to eating here for some time. The prix fixe seemed like a good deal. Well of course it was significantly more by the time you use the numerous \"upgrades\". \n\nI'd been out of town for a bit so the gf and I sort of went a little nuts. The service and ambiance was great. The food was ok. Had an institutional feel to it for lack of a better term. I know that's harsh. With drinks and all of our 'upgrades' to the prix fixe menu we ended up spending $150 - That's sort of a lot to not be a bit more wowed.", "author": "Will D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-08", "description": "I'm 25 years old and I first went to Henry's End 20 years ago.  I've been going back ever since, now with friends and dates instead of my parents.\n\nMy step-dad took my mom here on their first date, Bonnie was their waitress, and now she has my cellphone number to call me for my birthday (to celebrate and get a free entree!).  \n\nHenry's End is the one restaurant in New York where I think I've tried the entire menu.  I certainly have my favorite dishes - tortilla crusted shrimp, southern fried chicken, elk chops, mrs. mud pie - but this is the kind of place you're safe to try anything.  Even their vegetables taste better than most other restaurants.\n\nWhen I graduated from college I celebrated here and Marc (the owner) accommodated one of the largest parties the restaurant ever allows - 10!  It's a cozy, very special place I recommend without reservation  (but definitely make reservations!)", "author": "Jenna O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-20", "description": "Well, came with high expectations based on the reviews here--expectations which were pretty much dashed. I'd seen the ambitious menu and the not cheap prices and so was a bit taken aback at the place which looks like a midwestern family restaurant; you know Christmas lights and lots of wood. The servers were friendly but not particularly well dressed: think dockers pants, polo shirts. Hey, I told myself, don't judge a book by its cover. \nSo I ordered the duck in raspberry sauce while remembering a brilliant version I had in Burlington VT. Out comes half a duck lying in a gloppy pool of brightly colored but tasteless gravy. The meat had a wet, kind of spongy, texture: fried while frozen? Meat didn't have much flavor either. It came with a ludicrously small serving of rice and a few florets of cauliflower. \nMy friend ordered a fancy sounding veal dish that he said was like something his mom made--and she ain't no chef..\nDunno, maybe I went through a wormhole into an alternate universe...", "author": "Ron H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-18", "description": "There are a few things that make this meal stand out as one of the best I have ever had in NYC.\n1) I was seated before my entire party arrived (this scores major points with me, especially at busy restaurants.  I despise when I make a reservation and can't be seated until everyone arrives.)\n2) Lindemans framboise - the only way to get mom to drink beer, and always a indication of good things to come.\n3) Turtle soup.  Sounds gross right?  I was pretty worried when the waitress suggested we add sherry to the bowl.  But guess what - turtle soup is pretty fanfuckingtastic.\n4)Tuna entree. I order rare tuna often and this was by far the best version I have had in NYC.\n5) Mrs. Mudpie.  Well helllloooo healthbar.  You are looking fine tonight!\n\nConclusion? One of the best restaurants in Brooklyn, Manhattan or anywhere- well worth your money.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-23", "description": "From the old-school waiters and waitress (Hi Bonnie) who've been there for 20-some years to the well-mannered owner Mark, this is a place where you quickly become family to the staff.\n\nThe atmosphere is cozy and intimate, but also nice and loud, so you can confess your love to your partner but not worry about anyone else actually hearing it. I've been going here on and off since I moved to Brooklyn 20 years ago and have NEVER had a less than stellar dining experience.\n\nFrom the lobster penne in tomato cream sauce to the chicken dishes to the steak, it's always on the money. The Prix Fixe is a steal and I highly recommend the apple cobbler with a scoop of vanilla for dessert.\n\nI no longer live in Brooklyn Heights (or even NY for that matter) but whenever I make it back to Terminal 5 at JFK, I can almost smell the scent of Henry's End singing to me like a Siren. \n\nBon Appetit!", "author": "Jay S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "Best spot for exotic meats. They don't just serve the unusual meat, they take it up a notch and use delicious flavors to compliment.\n\nGreat for special event/group dinner/date.\n\nStaff and owners were terrific. They were friendly and responsive to feedback.\n\nI look forward to going back.\n\nDon't forget to sign up for their birthday club (buy one/get one entree free.)", "author": "Liza K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "All I can say wow.  One of the best steaks I have ever had in my life.  Great service and nice little spot.  We loved.", "author": "Andy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "The food is worthy of 5 stars.  The deductions come from the \"ambiance\" and the menu offerings.\n\nThe kitchen is open.  If it were the kind of place where food-prep is some form of entertainment experience, I could accept it.  But in this case, it seems like building walls may have impacted the number of tables they could fit and the traffic path of the waitstaff (and maybe caused even more ventilation issues).  Aside from not looking pretty, the real problem is that the restaurant gets very hot and overly aromatic.  \n\nThe regular menu does not change.  I thought every conscientious establishment in Brooklyn was on-board with seasonal eating!  But aside from wishing they used more local ingredients, the food is really heavy.  Delectable on a chilly late-winter night after a walk over the bridge, but not what I'll look for on warmer days.\n\nSo, I'll be back... next winter, wearing clothes that I don't mind having to clean immediately after my visit.", "author": "J C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "Went here with local friends. Great service and wonderful food. I would gladly go again.", "author": "Milton G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "Cozy spot with delicious food made for an excellent date night!  Definitely worth the subway ride from Manhattan...\n\nOnly slight downside was the waitstaff, a bit slow and unconcerned.  Regardless, the food was amazing and the restaurant set the stage for a great night out.", "author": "Brett M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "We came here for the Wild Game festival that happens only during the winter months.  The restaurant is cosy and inviting and our waitress was so spunky and nice.\n\nThey have a great wine list, which appealed to the 2 wine aficionados in our group (watching them haggle back and forth about wine was quite entertaining to watch, even though I didn't have a clue to what they were saying).  Needless to say, the white and red they chose went beautifully with the food.\n\nI had turtle soup and to me, it tasted like liquid lasagna.  It was good but the turtle meat was chopped so finely, I can't tell you what turtle meat tastes like.  My friend had some shrimp coated with toasted black and tan sesame seeds.  It was good but I wouldn't order it again.\n\nFor my entree I had the wild game platter, which consisted of an elk chop, stuffed quail and wild boar belly.  Elk, to me, tasted like really lean beef but without that beefy aftertaste.  Methinks I like it.  But somehow it was rich so I was glad I only had 1 chop.  The stuffed quail was nice and tender and who can go wrong with boar belly!  \n\nI definitely want to come back and try the regular menu.  The menu had quite the range, including duckling, which I have to try.  It was such a fun experience and the restaurant made you feel right at home.", "author": "Jane N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "There are already a lot of great reviews of this place, and I'd like to echo those.  Just wanted to add one more thing - don't be afraid to order chicken. \n\nThat's right. \n\nWho goes to Henry's End and orders chicken? The bane of a proper chef's menu? THIS GIRL. Well, what can I say, it sounded delicious (stuffed and with a chipotle aioli) and I don't eat red meat.  I had been telling my (carnivorous) eating companions about this place for ages and so I had to go along when they checked it out. The dish was DELICIOUS and my steak-and-duckling-ordering companions were both eating off of my plate for half the night. \n\nWould definitely go back. And maybe order the duckling next time!", "author": "Priti T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-07", "description": "My husband and I have been eager to eat at Henry's End based on all the good reviews, however my experience will not have me going back again.  \nThe prices would be reasonable if you knew you were getting a great meal; however for our $100 bill we had a main dish each, 2 beers for my husband, and 1 glass of wine for me and nothing was particularly outstanding.  The wine is carefully measured out giving me the impression they do not want to be too generous with anything.  I ordered the veal Morel which had more sauce than meat on the plate.  The sauce itself was incredibly thick and sweet, and the mushrooms had been reduced to unidentifiable black chars.  My husband had the pork chops with mashed potatoes; but again the amount of sauce and breading on the meat makes it difficult to know exactly what you're eating.\nOverall a very disappointing meal.\n\nI will say that the ambiance of the restaurant is very cozy and inviting, and all the tables were occupied so there MUST be something that keeps people coming back - but I will not be spending my time finding out what that is.", "author": "Darcy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-18", "description": "The only word that comes to mind when I think of Henry's End is 'mediocre'- decent food, in a decent atmosphere, with decent service, although a bit over priced. I was surprised that there was such a crowd as the quality of food was not worth the money being spent. I ordered off of the Prix fix ($30) and had a salad of 'mixed greens' (literally a plate of mixed greens, aka different types of lettuce, with three cherry tomatoes) to start, the duck with honey and ginger (an extra $4 for mushy sauce) as my main, and the mud pie (not a mud pie at all, but rather an ice cream pie) for dessert. In addition, the bread sticks in the complimentary bread basket were a bit soggy, obviously stale from having sat out. On second thought, maybe this is more of a 2.5 star kind of place? Despite the downfalls however, it was a pleasant enough experience and the flavors made up for what the (at times questionable) texture was lacking. I do not plan on returning although judging by the packed dining room, Henry's will be around for awhile... All in all I wouldn't recommend this restaurant as there are better, less expensive, options in the area.", "author": "Lila Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-08", "description": "My boyfriend and I just moved to the area and have been checking out the local restaurants.  Lastnight we took my parents to Henry's End and were pretty much embarrassed.  It's a good thing we prefaced the meal with \"now keep in mind, this is our first time eating here too\"\n\nThe area and decor is charming and very comfortable.  We are not snooty diners and love restaurants that look more rustic and serve amazing food, so upon being seated we were looking forward to the experience and really WANTED it to be a good one.\n\nThe first thing we noticed was that the service wasn't great.  Our server (don't know his name since he never introduced himself, but we called him \"Justin\" since he looks exactly like Justin Timberlake) was very quiet and seemed pissed off to be there.  When he took our orders, he asked my mom and me how we'd like our salmon cooked, but failed to ask my boyfriend how he'd like his veal cooked, and refused to substitute sides (which is fine, I understand sometimes they are not allowed) in an almost appalled way.\n\nThe bread was delicious and the drinks came out fast, but I have reason to suspect I was not served the Pinot Noir I asked for since it tasted more like a Cabernet, but no problem - I just passed it over to my boyfriend and ordered an iced tea.  Our appetizers came out - Ceasar salad, mixed greens salad and crab cakes.  The salads were average (how do you mess a salad up?) and the crab cakes were AWFUL.  They were hardly crispy on the outside, quite mushy on the inside and the chunks of corn inside obviously came from a can.  My dad put it best when he said they were just bland and lacked the \"kick\" crab cakes need to make them outstanding... Okay, no matter... we move on to the main course with open minds...\n\nThe main courses were TERRIBLE!!  My mother ordered the Morroccan Salmon which came with powdery dry \"garlic\" mashed potatoes which did not taste like they had a bit of garlic in them.  The salmon was a bit overcooked even though she asked for it medium rare and it was drowned in sauce (the sauce was good, but too much).  I ordered the herb crusted salmon which was cooked well (medium well) and actually okay, although my boyfriend says it wasn't prepared well since it was a bit \"fishy\" and didn't taste fresh.  The sauce was delicious but unlike my mother's dish, they did not give me enough.  It came with a very boring arugula side salad that I didn't even touch.  My father's penne with lobster was decent - he said there were enough large chunks of lobster in it which was nice.  My boyfriend's dish had to be the worst - he ordered the veal special with goat cheese.  It was barely luke warm, an extremely small portion and the sauce tasted like a watered down BBQ sauce.  He ate it because he was starving but said it was pretty bad.  All of our entrees came with a side of DRY rice (uncle ben's I presume) and extremely salty undercooked greenbeans.  Very very disappointing.\n\nOf course we skipped coffee and dessert, and the total bill for two iced teas, two glasses of wine, three appetizers and four entrees was $160 including a measly 12% tip which wasn't bad, but way overpriced for the awful food.\n\nI don't know if we just went on a bad night or what, but needless to say we will never go back.  For those of you looking to try something in the area, the Brooklyn Heights wine bar on the corner of Cranberry and Henry and Noodle Pudding right next door are way better choices.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-30", "description": "A serious disappointment.\n\nThere was no game on the menu when I went there, the service was poor and the food was very heavy and uninteresting.  The best things I can say is that the wine was nice and they gave us free dessert.  Otherwise the decor is terrible and this place is overpriced.", "author": "Buckner G."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}