{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-01", "description": "I have been eating at Henry's End for decades. The food is still excellent, but the service has certainly slipped. Once I sat down, it took 15 minutes for a waiter to approach me even though the restaurant was only half filled. Then, once I was finished with my meal, it was at least 20 minutes before my dishes were removed and I was asked about coffee/dessert.  Maybe one of the problems was that appeared to be no one bussing tables.\n\nHenry's End is still worth a visit, but be prepared to wait.", "author": "Louise J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "If you want a brilliant dining experience, be pampered with great service,  all while enjoying amazingly prepared food...Henry's End is for you. So many restaurants in NYC...and we've been to this restaurant twice in two weeks...it's that good! Our first meal we enjoyed sharing the Kangaroo Potstickers, and the Duckling with Wild Mushrooms, shallots, thyme, and lingonberries. With this we enjoyed a bottle of Tempore Joven 2004, from Agagon Spain. Everything was amazing. Our second trip we shared the Buffalo Hanger Steak with Housemade Steak Sauce and Truffled Fries. Oh WOW...Tender steak! This night we opted for beer and enjoyed \"Two Roads \"Road 2 Ruin\" Double IPA Stratford Connecticut,\" and \"Oskar Blues \"Old Chubb\" Scotch Ale Brevard, North Carolina.\" They complimented this meal well for us. Our server, Mike on both nights, was exemplary. And the little inside scoop...the restaurant name is because this restaurant is where Henry Street ends. Go figure...So Very Clever!", "author": "Jan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "Delicious. Top notch food. I will definitely be back! It is one of the best steaks I ever had. My boyfriend loved the Cajun spices used in his dish. Great place!", "author": "Melanie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "I have been going here for around the last 15 years. A great restaurant with great service and even better food.  I have never had a bad meal here- the steak au poivre is to die for (I often like to order a side of mushrooms with it).", "author": "Ann K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Customer service is great and I loved the annual Game Festival. My favorite plate was the kangaroo kebabs! It is a very intimate restaurant and I would definitely go again.", "author": "Britney H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Have given it a very good review in the past and some of the things I said then still hold. Good food, very good service.  But there hasn't been an inflation and my income has not increased, but Henry's End now fancies itself high-end and has raised its prices such that prices start at $28.00.  Since then, I have gone to the great semi-outdoor restaurant two or three doors down when I can get seating or walked over to Montague St to eat at Armando's which is on a par price-wise of Henry's End but has *really* good food and far less noise!  Sorry, but I ended my thirty-five year advocacy of H.E.", "author": "perry w."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "Henry's End could be a worthwhile destination if you're seeking to eat exotic game meats like Elk, Kangaroo, etc...  Other than than access to these hard to find dishes I'd be hard pressed to find a reason to go here.  \n\nThe first issue is that the restaurant is tiny.  In itself that might not be too bad but it is so narrow that the tables are close enough that people moving about can't help but hit your chair.  The second issue with this is that the noise level is atrocious.  I have no issue with a decent level of chatter but it was hard to even hear the person sitting next to me - a small space with brick walls basically traps sound. \n\nThe second issue is service.  The servers were very friendly and professional.  Unfortunately, they are hampered by a tiny kitchen resulting in some people getting served before others - if the food isn't ready they obviously can't serve it!  \n\nIf you can get past the noise some of the food is pretty good.  Our table enjoyed the ribs, moroccan shrimp, elk chop and veal.  Steaks were cooked properly but you're not getting a steakhouse grade cut with great marbling so they're a bit dry.  We didn't order separate sides because rice pilaf and green beans were included.  We SHOULD have ordered other sides because the pilaf was dry and flavorless and the green beans were undercooked (hard, not \"al dente\") and looked like they had gone straight from the market to our table - no preparation.  The wine list is okay but the prices were a bit steep.  For example, Turley Juvenile Zin ($20 from the winery) at $69.  \n\nIn my book there are better places to go when you want to spend around $100 per person on dinner.  The whole combination of food, atmosphere and service is just okay - not great.  \n\nTo be fair, the restaurant did hesitate to take a reservation for our group of 8 indicating that they probably knew the size of the room and the size of the kitchen would make it difficult.  Had we been a table of 2 (probably the only size table they should have) it might have alleviated some of these issues - but I still think there are far better places for the price point.", "author": "Robert O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "I had the pleasure to dine at Henry's End twice so far. The first time was in spring and the second time in fall. They have different seasonal menus. The first time I had a delicious salmon and cous cous dish.\nThe second time me and my boyfreind went there unaware of their wild game festival. So it was a pretty fun night because we had to decide between stick to the usual or venture into... Kangaroo meat! We had the kangaroo and it was very good, tender with sweet notes of berry (since the marination) and served with sweet potatoes and spinach. \n\nOur wild board pappardelle were also great, I felt like I was in Italy for one second!\n\nThe wait staff was impeccable, both times.\n\nI really like the atmosphere of Henry's End, there's something special quite cinematic about it, almost a vibe of what you imagine  Brooklyn was years back.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Wanted a nicer meal near the river while staying in Brooklyn and stumbled upon Henry's End. The exterior does not do the interior justice. A nice, intimate spot with a friendly wait staff. Had a great cocktail, Bee's Knees and the mustard seed crusted tuna was to die for. 4 stars because we had to wait just about an hour for our food but if you're there with the right people the time will fly. Would go back.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "My favorite restaurant! I come here every year for my bday and this year my hubby forgot my bday coupon, but since this place is top notch they honored it anyways! Great customer service \u0026 great food. I love wild game and this is the one restaurant I found that serves it and is so tasty! Can't wait for the next wild game festival!!!! You make my bday dreams come true!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Ate there last night. Management very accommodating.  Got there almost an hour early from reservation but were seated immediately even though seating was in short supply.  I got the sole citrus.  It was excellent.  My son and husband got the strip steaks cook to perfection. Son has celiac disease and there were gluten free options which he was happy to see. Even the clientele were friendly.  Must be where the locals dine. Would eat there again.", "author": "Linda V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "If you are looking for the hottest, flash in the pan restaurant, on the bleeding edge of Brooklyn dining, this probably isn't your spot.  Come here and you'll sit amongst locals of all ages, you'll find a 30years of excellence award on the wall and newspaper reviews from 10 years ago. If you are looking for great food and an authentic experience that can stand the test of time, make a reservation now.  Well known for it's game dishes (try the charcuterie!), Henry's delivers on the exotic (kangaroo potstickers) and the staples (ribs).  Even the rye cocktail was amazing, and my glass begged to be refilled... ok, maybe I really wanted to keep refilling my glass, but you know what I mean.  Not trendy, but won't disappoint. *late addition* after consult with my fellow diners, I do need to note that while we all loved our meals the ribs we quite dry and a little too drowned in sauce.", "author": "Neil F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "A slightly eccentric restaurant with a strict reservation policy, my expectations for Henry's End were sky high. I had been told about interesting cuts of meat and a menu that will raise your eyebrows. Honestly, besides a few unique steak cuts, I was disappointed how contemporary the menu was. I don't know what Henry's End is. It lacks the complexity and depth in flavor of high end cuisine, despite being priced like one. It honestly feels like the menu could do with a modern refresh towards fresher, more exciting ingredients. As it stands, it reminds me of something out of the 90's. That's not a bad thing but again, at what they charge, it should be better.", "author": "Daniel Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "My last visit here was back in 2013 to have the Steak au Poivre and it was just absolutely fantastic. In another life, this was my own little personal kitchen, a few blocks away. Unfortunately, now I live in California. I know I am a bit late leaving this review but I know many of their signature dishes haven't changed and I just had to leave a review upon reading a complaint about the 'presentation' of the dishes. Which is all in the beauty of Henry's End. \n\nSomeone else was complaining about the presentation? Simple dish? How do you want to spruce up a dish like Steak au Poivre you genius? Do you think the Chef should put some pink boba on the side or maybe add taro creme to a classic such as Caesar Salad? Maybe some unicorn fairy dust to spruce up your Southern Fried Chicken?\n\nI totally get it, okay? People like something new and exciting. You want to see some fairy dust in your pink unicorn latte. I totally get it, but here's the thing... You see, some things aren't meant to have pink dust and purple creme dressed all over the dishes. Some things are classics and just... Well, my father used to say to me... 'Son, don't fix what ain't broke'.\n\nNow please, travel the world over and dine at wherever you want for that latest food craze and when the fad has passed, you will always want that Steak au Poivre. Made with so much love for life and love for the fellow human. Which cannot be found or replicated anywhere else, except at this quaint little restaurant down the end of Henry Street.", "author": "Robert V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "You could pass its nondescript storefront by but you should NOT!  I had the honey-ginger duckling, my wife had the Steak Diane.  Both were incredible.  The duck was the best I have had for years (and there was a lot of duck consumed in those years).\n\nAlso, the mashed potatoes were creamy and dripping with butter.\n\nLike the Terminator, \"WE'LL BE BACK!\"", "author": "Jim N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "This is a beautiful restaurant that has been around for decades.\nThe truffle fries pair well with the steak au poivre. \nI enjoyed the walnut crusted chicken finished with a blue cheese sauce. Yum!\nMake reservations!", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "Really a 3.5 --wish we could give half stars. Very cozy, small establishment , just wished the food was a little better. Both of us ordered the prix fixe. Scallops were good, sole was nothing special, but soft shell crab linguine was delicious. The desserts were underwhelming -- apple cobbler was very mushy on the inside.", "author": "Ron W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Very accommodating and friendly. The food was pretty good too but I don't know I just felt like something was missing, maybe it was the service...but because it was so friendly, the wait made it worth it. I would go again.", "author": "Patti K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I've eaten here a number of times and also suggested it for work team dinners. The food is amazingly good - ESPECIALLY the wild game when it's available. Their elk chops are fantastic - the desserts are rich and the service is above excellent. It can get a bit crowded or loud depending on the time and night of the week - but this place is definitely worth visiting (I'm getting hungry just thinking about the food while writing this review).", "author": "Peter P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Just became a big fan of this place! Steak and vegetables were very good, and I loved the mud cake!", "author": "Danhui X."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}