{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "A true gem of Brooklyn Heights! A very unique menu featuring many fresh \"game\" meats (I.e rabbit, deer, duck, etc) which maintains unbelievable quality and is well worth the price. \n\nFood: I had ordered the a mixed plates with duck, rabbit, and venison and everything was impeccable. My friend described his chicken as best chicken if his life. \n\nDrinks: short but fantastic beer menu featuring local gems. I ordered wine special which was excellent and fairly priced.\n\nService: really amazing service. Wait staff was very attentive and genuinely cares we were satisfied. \n\nVibes: My favorite part of Henry's End is it is not pretentious. To have this level of food and service it is refreshing to have a relaxed unassuming atmosphere.", "author": "Mike G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-10", "description": "The mustard chops weren't welcomed, thank you--\n\nI ordered the elk chops; they had an excessive, overpowering amount of mustard. I enjoy and can handle well spicy foods, but this was an overkill. I was tearing up, and couldn't taste the meat allegedly exquisite meat underneath the mustard. Shame on the chef!\nThe black sea bass and the consommé were alright, to be fair.\nNice Pinot Noir, ok.\n\nOverall:\nBah.", "author": "Florence N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "An update for the new location: The food was just as amazing as it was at the previous location. Despite only being a month into their new location service was seamless and it was great to see mostly familiar faces from the old location. There is also a nice bar area at the new location. So happy to report that they are keeping up with the good work. We had the tuna orecchiette pasta, the mushroom duck, the fried chicken, gazpacho, and goat cheese salad. All very very good!", "author": "C. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "Great little spot that has only been in its new digs for 3 weeks! We did make a 6pm reservation, thankfully we did because we would have been waiting for a bit. We were greeted by the owner, who sat us on the patio! We were out celebrating our anniversary and they delivered on every aspect of the meal. Nice \"Crisp\" brew to start off the meal. Crab cakes, Shrimp app with some delicious combo of flavors. But wait there's more...Chicken, spinach, goat cheese , fig jelly...mic drop, pick it up; Steak Diane that you could have drank the sweet flavor that blanketed the fine cut of meat. Side of asparagus and real buttery mashed...there is no way we can do dessert, but we do coffee. The special anniversary dessert was delivered which was a nice touch, much appreciated! Price point was in line with the food quality, service and experience. We are from out of towners but felt the urge to write this review because more people need to experience this little gem that has been doing it well for a long while.  5 out of 5 stars", "author": "Ben F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-24", "description": "A new friend in the Heights suggests that we eat local so I immediately scan my trusty Yelp app to reconnoiter the area.  We lived here in the mid-80's but by now, things have changed!  She's not a big fan of tomato-based Italian food, in an admonishing tone, says \"it's the nightshade family!\" It's fine. Anyone who reads my posts knows that I'm an Italian food junkie, but I'm in a mood for something different.  After hemming and hawing, we walk up to Henry Street and decide on Henry's End.  Charlie the dog is lying near the entrance and gives us a friendly greeting. I ask him if he'd like a martini and he jumps up and wags his tail. My kind of dog!! It's a fairly nice evening so we decide to sit outside. My friend's been under the weather but agrees that we should order a nice bottle of red wine. Matthew our waiter suggests a montepulciano and it's superb. We share a walnut vinaigrette salad with mushrooms. It's a perfect starter. The menu has two duck entries, we each order a different one.  My duck is Asian style honey ginger, Crisp skin, not fatty at all,  almost like Peking duck. I love it.  My friend's duck is more ragu style, with mushrooms, equally delicious. The conversation is animated and flowing.  But wait, something's missing! We realize there's no side dish. We signal Matthew who apologizes and offers to get us sautéed asparagus on the house.  He also offers free dessert. Wow what a nice gesture!  We top the meal off with apple cobbler and tiramisu. Coffee and espresso. Gee what a great meal!  We'll definitely be coming back!  Good night Charlie wherever you are!", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Went here because they have \"game meat\" which sounded really interesting. Well, I finally had kangaroo - it was diced meat in a pasta wrap. Not really that interesting. Tasted like chicken.\n\nSo that was sort of disappointing. Still, the food, ambience, and conversation was wonderful... we did have duck, and a few other interesting meats that were truly tasty.\n\nAs non NYC folks in Brooklyn, we engaged with a man who did reviews of many many NYC area restaurants - he did a blog, and was into the many hundreds of restaurants.... he said this was one of his favorites.\n\nOverall, we had a great meal (twice) and had a great time. Good food, good wine, ate kangaroo... what more could you want? ;)", "author": "Dan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "KenScale: 8.0/10\n\nMy wife Jun and I go on a double date from time to time with my former co-worker and her husband (an avid foodie) to check out new restaurants. Ever since the couple had a baby, it has become a bit more challenging to find a place that could work for the next restaurant trips. The couple lives in Brooklyn Heights so I asked them if there is any restaurant in their neighborhood that is convenient for them to meet up for dinner before the summer's end. The foodie husband said Henry's End which I had never heard of until that point was his all-time Brooklyn Heights favorite. I was certainly intrigued and took on their offer to come visit Brooklyn Heights to visit the restaurant. When Jun and I walked in, I had an impression at the moment that I was inside a dive bar with exposed bricks and a very quaint décor. Not that the venue's vibe really matters for me; Jun and I dislike places with fancy settings but food that turns out to be underwhelming more than places with humbling settings but have very delicious food. And surprisingly the food at Henry's End turned out to be quite good.\n\nThe menu at Henry's End is a loose group of New American dishes with locally sourced ingredients and influences from different parts of the country. The dishes here tend to be on a more rustic side. Jun wished the sauce were slightly less sweet, but still very much enjoyed the barbecue ribs whose texture was more or less perfect. The shrimp sautéed with spicy Andouille sausage was also very nice for an appetizer, with a Southern style that was hearty and satisfying. Jun, always a duck meat aficionado, ordered the duckling honey-ginger that the foodie husband highly recommended. I stole some bites from the duckling and it was cooked quite aptly to give the texture that the duck meat must have to shine at a dinner table. On the other hand, the main dish that I had ordered, veal scallopine sautéed with roasted garlic, lemon, capers and basil, was a little bit too aggressive in the seasoning department even though the meat itself was gently prepared. Don't skip desserts at Henry's End! You have two different versions of mud pie, and the Mrs. Mud Pie version that Jun chose was absolutely decadent with vanilla and Heath Bar Crunch ice creams on a Graham Cracker crust, topped with hot butterscotch sauce. Same goes for the delightful Persian lime pie, consisting of fresh lime pastry cream on a Graham Cracker crust. While neither dish looked too healthy, we didn't mind feeling a little bit guilty and promised each other that we will put extra efforts into our gym classes for the rest of the week.\n\nI have no idea how difficult it is to snag a reservation at Henry's End but the restaurant was mostly packed with local Brooklynites during our Wednesday meal so booking in advance seems like a good idea. As noted above, the décor and atmosphere of the restaurant might scare you off a little but I suggest that you get comfortable with embracing the old-school vibe of this place. The wine list at Henry's End was quite a surprise; I didn't expect to see so many bottles, many of them from California, from older vintages all the way to the 20th century at bargain prices. There are also daily wines by the glass available that you should take advantage of. Henry's End is one of those restaurants that if you live in the neighborhood you would want to come back again and again for a reliable dining experience. Jun and I certainly would love to come back again to try other dishes and explore the wine list.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-25", "description": "Henry's End just opened in a new location, so this review should be considered with that in mind.  The food was tasty. I had steak au poivre, grilled asparagus, and fries (which should have been mashed potatoes but they ran out.) Service was gracious and attentive.  They comped me the potatoes. My major issue is with the atmosphere and the noise level.  The space is very plain, and I had to shout at my dining partner across a very small table.  Likely operations will improve, and perhaps atmosphere with some design work. However, I think the noise levels will be difficult to resolve.", "author": "Lon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-30", "description": "2 of us went to Henry's end on a random Wednesday and it wasn't too packed. A little chilly outside (rain was coming soon) but we decided to sit outside anyways. Table was a little rocky because we were on a slant but manager fixed it right away. Service was impeccable - manager and all servers were quick and friendly and knowledgeable. I did the 3 course pre-fixe for $42 and got the soft shell crab, sole citron, and the apple cobbler. He got the ribs app and the 15 spice steak medium. I liked the soft shell crab but he didn't love it. Ribs were supposed to be sweet and spicy but they weren't spicy at all. Before I decided on the sole, I asked many questions about breaded dishes and didn't want any of them. But when I got the sole, it was entirely breaded. You would think that if I went against all the breaded things, I wouldn't want that. The steak was okay but really chewy and the spices were a lot. I loved the apple cobbler - he doesn't like sweets. I got sparkling - can't go wrong there. He got cocktails - didn't complain. Overall - a bit overpriced and not the best for the money. But it's is Brooklyn Heights so rent is prob expensive ‍", "author": "Sara-Lee R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "Amazing food. Very traditional dishes and cozy ambiance. Anything you ask for is delicious. Wine list has plenty of great wines. Love the truffled French fries.", "author": "Dol O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "Henry's End is a classic in the area. We came in recently to celebrate a 40th birthday and the food was as amazing as usual. Sadly, the service was horribly slow and not at all like I remembered. When spending over $75 a head I expect better. \nThey seemed to have a large group/event in the back during our visit, so that might have been the issue. Specifically-it was very long periods of time to get someone to take drink orders or food orders the entire night. I gave up at a certain point and just drank water. I probably would have ordered at least two more drinks than I did had anyone come by. \nOverall the dinner was over 3 hours which felt like an eternity given the gaps in service, and I left with a sober birthday husband, which was not the goal. \nDespite this, the wild game festival is really the big reason to come here. The selections are all extremely hard to find in NYC and amazingly cooked. \n\nFood wise, to start our group had corn chowder with bacon, ostrich potstickers, and the game charcuterie plate - game pâté, wild boar belly, Rabbit Rillette, Wild Boar Bacon Jam. These were all pretty awesome but the ostrich was the true standout. The corn chowder was creamy and amazing. I'm from New England, so it's hard to impress me with corn chowder and Henry's did. The charcuterie plate was just ok-it came with very few pieces for spreading so we ended up digging into the bread basket to be able to finish it. \n\nEntree wise, the walnut crusted chicken breast with sliced pears has always been my favorite dish here. It was really perfect. This dish is very sweet. The pears on top of the chicken taste almost candied, so I recommend it if you have a sweet tooth. My group also had the mixed game grill which was elk chop, stuffed quail, and rabbit sausage which got rave reviews. The desserts-apple cobbler and persian lime pie were just ok. The lime pie was far more flavorful than the apple cobbler. I did love the vintage style glass bowls there were served in. \n\nI had high expectations for this special dinner and the food met and exceeded it. I just wish the service had.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "Outstanding! Very talented chefs they have create an outstanding, robust menu. Not a lot of tables and, filled in on a Wednesday night. People like atmosphere, I like food.....this is the place for the latter. I heard they were moving to accommodate more guests after 40 + years. I hope they bring the charm this place had.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-13", "description": "Pricy for the food they serve.\nDon't like there strict reservation policy.\nWaters make you feel like your just a costumer.\nThere food an service is not worth the price.", "author": "Dale S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Since recently visiting my fiancé's aunt and uncle in New York I have fallen in love AGAIN! I want to now move to New York with my honey and kids and be able to visit Henry's End all the time! \n    I got the lobster penne because I  am addicted to pasta AND seafood and I wanted to see if they could impress me! \n     100% AMAZING!\n          Also, I overheard some people talking about the game meat in the fall so I hope we can make a trip out in October sometime!!!", "author": "Mandy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "An old stand by on Henry Street in Brooklyn Heights consistently serving great food for many years. They also serve Game Meat every fall. You can't go wrong with what you order. The steaks are particularly very good.", "author": "david l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "Such a nice place with great service and wonderful steaks.   The au poivre is a delight, ample, tender and flavorful.  Sides were delicious and wine excellent.", "author": "Felix H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-11", "description": "This used to be our favorite, a neighborhood gem, but as the prices have gone up the quality has declined.\n\nWe're a pass there are much better places in the neighborhood.  \nI've gone there for two decades but no more.", "author": "phil p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "I overhead one of my students talking about the wonderful meal he had at Henry's End so I just knew this was the kind of place I needed to bring my boyfriend. We've been to Henry's End twice now. Once last summer and most recently last week for the 2nd phase of the Wild Game Festival. \n\nThe Wild Game Festival is definitely a very special dining experience. First of all, the service you will receive no matter what time\nof year will always be exceptional. The restaurant is on the smaller side so if definitely recommend making a reservation. We had a reservation for 6pm. We arrived a few minutes past 6 but were seated right away. \n\nThe kitchen is open so you are exposed to the sounds of the chefs working and you can see that they are working very hard to prepare very special dishes. For appetizers we ordered the kangaroo potstickers and the game Charcuterie Plate. The potstickers were delicious and you would never know it consisted of kangaroo meat if no one told you. It tasted kind of like pork to me. The game Charcuterie Plate consisted of rabbit sausage, pork belly, and Wild Game pâté. All was very good. For my entree I had the crab stuffed chicken while my boyfriend had the elk chops. Both entrees were delicious and packed with great flavors. \n\nNeedless to say we will be back. Hopefully soon for the 3rd phase of the Wild Game Festival. As each phase has a different menu. I definitely recommend Henry's End. Also a sure to sign up for their Birthday club as you will receive a $25 coupon for your birthday.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "A great place. I first came here to celebrate hubby's birthday and we came back to celebrate my birthday here. The atmosphere is dim lighting and close quarters. We experienced great meals and great service both visits. The service is very attentive and they listen when you inform them of special occasions. You get a free entree for your birthday if you sign up with them. \nThey are known for their wild game festival and their usual menu has wild game specials. The regular menu is also great. Portions are generous, I believe we took doggie bags home both visits. There's no bar area at Henry's but there is a bar on the corner, one storefront away, which came in handy because it Poured on my birthday.", "author": "Dina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-05", "description": "Very unique restaurant in a great location, a block and a half off the Brooklyn Bridge. The restaurant is not large, and was well packed on a Saturday night.\n\nThey offer a unique experience in that they offer a large selection of \"game meat\" in a very well-prepared manner. I tried the:\n\n1)Turtle soup - Delicious. Tasted like a chili. Not at all gamey.\n2)Kangaroo Kebabs - My favorite thing that I ate. Tastes exactly like high end steak. Juicy, tender, and not at all gamey. If you told me it was beef I would have believed you.\n3)Elk Chops - Everyone else I was with loved them, but I don't like gamey  tasting meat, and there is certainly a gamey aftertaste to the elk chops. I was not a fan. \n4)Venison sausage - Solid sausage. Taste unique. Not particularly strong flavor, but enjoyable.\n5)Quail - Great. Tasted unique. Not exactly chicken but close. The texture was different as well.\n\nThe desserts were also great as well. the Mrs. Mud Pie was a generous portion of ice cream, on a bed of caramel with a nice crust. Delicious.\n\nThe service was good. Not the best I've had in that there were several times I wish I had more water, but they did pass by a few times to check on us.\n\nThe only deduction is for value. This is a pricey place. I certainly enjoyed some of the dishes, and I was able to scratch several things off my food bucket list during this meal. I would come back, but I would do it with the intention of trying other exotic things, rather than try the same things I've had already.", "author": "Noel Y."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}