{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "Who's got game?  Henry's End does!  \n\nThey have an annual game festival from October through March and boy, were we excited to try antelope, elk, and reindeer!  The selection changes daily so it's likely that not all the options will be available.  We started with the elk, which had a lovely seasoning though and we also had the tuna, which was pretty good - the soy sauce made it a bit too salty though.  The vegetables that came with the meals were amazing.  We started with the warm crusted goat cheese, which was divine!\n\nThis place is great for all occasions!  We came here for my birthday and also with the boyfriend's parents, who loved it!  The staff is friendly and helpful - many have been working here for years!", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-27", "description": "I came. I ate. It was fantastic. Got a table right away on a tuesday night, had a super nice waitress who gave us the skinny on what to order off the wild game festival menu. Between the perfectly cooked antelope, the bodacious mixed grill and the pheasant, I was in carnivore heaven. All the sauces were perfect, as were the delightful side of mashed potatoes, rice and snap peas. A great, well priced bottle of wine topped off this absolutely fantastic meal. If you wanna mix it up and try some really superb meats you can't find elsewhere, I'd have a hard time believing many NYC joints do it better than these guys.", "author": "Alex E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "What a great neighborhood find.  Walking around BK Heights, looking for something new, we both said \"Oh yea, I've heard about this place.\"  In we go, Sunday around 8ish.  We got a table no problem.  The decor is nice, rustic, with an open kitchen and a bar that looks like a charming do it yourself construction.  Nice selection of wine by the glass/carafe/bottle.  \nThe menu.  Wow.  Definitely a place for the food adventurous.  Lots of interesting combinations and proteins.  It happened to be Wild Game Fest when I was there and they had some great selections from Elk, Buffalo, Quail, Rabbit.  I ended up going for the stuffed quail.  It was amazing.  Done with radicchio, pancetta, some sort of balsamic reduction.  So so good.  My friend got the cod with lobster risotto.  Also amazingly delicious.\nI can't wait to get back here and try something else.  A little more expensive than I had planned on for the night, but totally worth it.  Would be a great place to make into a regular date spot.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "A rare gem in every way. Perfect. Food...ambiance...Proximity to the promenade. This place has \"date material\" written all over it. Shared a few dishes: Fried chicken, lobster pasta, salmon and crab cakes appetizer. Everything was AMAZING. Caution, the fried chicken dish is big enough for two people. It's an insane amount of food. I already can't wait to bring people back.", "author": "Gene E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-16", "description": "I went to Henry's End after having heard about it for years.  I used to go to the restaurant they had in Soho called New Deal.  I remembered the Game menu they had once a year in the 80's.  So I decided to try the game menu on this visit.  First I have to say the service was good and the food tasted good and was well cooked.  Unfortunately I didn't find the game memorable or exceptional.  I am not sure what I was expecting, I had the Charcuterie and the Danish Venison Stew.  while it all tasted fine it could have been any other meat.  Judging by the way everything was prepared I can tell the overall cooking is wonderful.   I would definately go back for the regular menu but I don't think I would make a treck to brooklyn for the game menu.", "author": "Raymond P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-23", "description": "Henry's End is the perfect date spot -- the setting is cozy, rustic and not pretentious in the slightest. It's in a charming neighborhood and is easy to get to from Manhattan.\n\nThe food is wonderful -- some might say too simple, but I think it's old school and that's a compliment. Hearty, bold flavors, and good cuts of meat/fish.  And the wine list is very good; mostly American wines and some great, affordable options by the glass.\n\nI recommend the Salmon Moroccan -- it's spicy and sweet, seasoned with cumin, cayenne pepper, mint and scallions.  It comes with garlic mashed potatoes, too -- delicious.", "author": "Katie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-10", "description": "POOR service, over-priced, filthy.\n\nWe live in the neighborhood and intended to try Henry's End for a long, long time. We hadn't gotten around to it because there are so many other great restaurants in the area. I repeat- there are so many other great restaurants in the area. Henry's End was a disappointment. Service was poor- our waitress inexplicably left us sitting there for over half an hour without taking our order or giving us a bread basket. At one point we flagged her down, but after we asked a simple question about sides, she turned her back on us and ran off without letting us order... just as we were opening our mouths to say what we wanted! As another reviewer here wrote, the waitress seemed a better fit on the staff of Applebee's. She was wearing 4 inch long florescent green feather earrings (totally unprofessional at a restaurant of this price range). Finally the host felt sorry for us, came over and took our order himself.\n\nFood was inventive with many game meats but over-priced compared to several wonderful places nearby that serve inventive and impeccable food.\n\nAlso, Henry's End was filthy. The bathroom floor looked like it had never been mopped; visible dust balls were hanging off the walls. It reeked of frying oil: our coats needed to be dry cleaned afterwards- further adding onto our already overpriced bill.\n\nMy friends- don't waste your time and money on this place.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-08", "description": "My friends and I were taking a walk over the Brooklyn bridge for my birthday and wanted to find a place for dinner nearby. When a quick Google search led me to Henry's End's website and I saw the words \"wild game festival,\"  I knew I had to check the place out. \n\nI had read some reviews about some of the more exotic game (such as kangaroo) not being available but it was on the menu last night; we did go pretty early in the festival, which I believe begins at the start of October. \n\nOn the server's suggestion, I ordered the mixed grill, which consisted of an elk chop, wild boar belly, and venison sausage. It did not disappoint. Everything was delicious and properly cooked. (It is really easy to overcook many game meats.) My less adventurous friends chose chicken and pasta dishes that they enjoyed. To give you an idea of price, my game platter was about $30; my friend's meals were more around $20. A prix-fix $25 meal is available Monday to Thursday and includes an appetizer, entree, and dessert. (There are some game items on the price fix menu, although the wild boar penne has a $2 surcharge.) \n\nThe atmosphere was casual and cozy. I saw several couples enjoying what I imagine would be a nice, low-key date night. While crowded and somewhat loud, I did not feel cramped at all and had no problem enjoying some lively conversation with my friends. \n\nMy friends arranged for a birthday candle in my banana pudding. While not the sort of place where all the workers gather together to sing (thank G0d!), the enthusiastic server presented the pudding dish in a plate that said \"Happy Birthday Carli\" in chocolate along the rim. \n\nMy review is only based on one visit, but I really enjoyed myself and hope to return before the wild game festival ends (I believe in February, but don't quote me on it). It is very close to the Brooklyn bridge (one of my favorite walks in NYC) and a great choice for a fun grown-up birthday dinner.", "author": "carli e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "Had Moroccan Salmon and it was amazing!  The fish was cooked perfectly - pink \u0026 moist and the skin crisp \u0026 crunchy.  Tasted the Lemonese(?) Veal - yum!  Beer selection was ok but could be better.  Server gave our table a couple free desserts to sample which was very nice.", "author": "Surly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-03", "description": "Henry's End is the definition of a 'local gem.'  Cozy, warm, and worn in around the edges but sophisticated enough to impress the palate and delight the senses.  \n\nAround 15 tables, a tiny bar, and a semi-open kitchen are tucked into the narrow space.  The closeness and transparency make for an atmosphere that is somewhat like being in a familiar family clubhouse on the backstreets of a Northeastern town in a bygone era.  Because of the 'warm' feel, Henry's End seems like a cozy sanctuary from chilly New York nights.\n\n The menu is a treasure -- both entrees that I sampled were excellent and mouthwatering (steak au poivre and chicken w/ goat cheese, fig jam).  Presentation was unadulterated, simple, non-gimmicky.\n\nOur server was friendly, comforting, good natured.  He seemed rather young and may actually have been the son of the woman managing the place.  \n\nHenry's End patrons are Brooklynians joining their families for dinner, meeting their loves for dates, or reconnecting with old friends around good meals.  This spot has none of the icy cold standoffishness that so many 'scene' establishments think is necessary to match high quality food.  \n\nBottom line: go here with company with whom you wish to eat well and keep close to you.", "author": "Erin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-31", "description": "If, like me, you live in NYC and you love game, you know that casual, affordable restaurants that serve game are few and far between. Which is why I couldn't wait to try Henry's End when I heard last week that they offer a number of fairly reasonably-priced game dishes each fall.\n\nI started with a duck over frisee salad that was dressed with a vinaigrette and garnished with a handful of huckleberries and, if I remember right, some nuts (?pistachios). The tissue-paper thin duck slices were spectacular, with a nice smoky flavor. The kitchen went a little overboard with the salad dressing, however, it was really soaked and too vinegary.\n\nFor an entree, I had the mixed game plate, which included an elk chop, venison sausage, and a cut of roast wild boar. The elk chop was perfectly tender, but the flavors in which it was cooked (I think there was a blend of mustard with garlic, along with a sweet sauce) didn't quite mesh with what I was hoping for. The venison sausage, too, was a little too sweet and had some spices (including ?cloves -- not sure) that didn't quite work for me. The boar, however, was delicious, and I wish I'd had more -- a nicely crispy crackling skin over juicy meat, with flavorful layers of fat.\n\nThe restaurant is small, narrow, and dark -- it looks like a bar that has been converted to a restaurant. Some diners may appreciate being able to sit directly across from the kitchen toward the back of the restaurant (the kitchen opens right into the dining area, although a counter blocks the view of the cooks' hands), but I felt the smells made the restaurant feel too stuffy.\n\nService was about what you would expect from a casual neighborhood restaurant. The staff were very friendly. Most of the tables were occupied when I arrived around 7pm, although I was able to be seated immediately. My server was a little distracted; when I asked for more bread, she said she'd bring it, then disappeared and apparently forgot about it. (One of the breads was very, very good -- I think it had fennel seeds and raisins.)  I also found butter smeared on the side of my bread basket, apparently left from an earlier diner's meal.\n\nOverall, a few hits and a few misses. I really like the idea of Henry's End, but would need to give them another try before deciding on whether the execution meets their potential.", "author": "Aris F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "We've been here a handful of times and it's always been a fun experience.\n\nOf note - they have a remarkably well-priced and solidly stocked wine list - you can get some great bottles for very reasonable prices. Also, if you duck, steak and game, they have some great meats that are always very well done (i.e. elk, etc.) Further, service is always laid back, solid and relaxing - this is one of those places that you end up wanting to order another bottle of wine just so you can hang around and nibble at your plate, share stories with whoever you're with and just kick it.\n\nAlso great - they'll take down your name and birthday (if you want) and mail you a card every year for a free entree - a simple, but really thoughtful, touch that wins points in my book. All in all - a great time.", "author": "Ron S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-27", "description": "2 friends and I went to eat at the wild game festival.  We had the charcuterie plate (venison pate, rabbbit sausage, bison sausage), a delicious soup with bacon almonds (I believe it was a rutabega apple soup?) and then I had the wild game grill which had boar belly, elk chop, venison sausage which was delicious.  They first brought it out with breadcrumbs on the elk chop, which was never stated, and I had to send it back because I am gluten intolerant, but they were VERY accomadating, and got a fresh plate quickly without the breading.  Very very god food. Also they had a lovely Oregon Pinot Noir that was amazing, a berry flavored Pinot, not too dry, which went very well with the wild game! I'd definitely go back!", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-24", "description": "Honestly, Henry's End is very average.  Great atmosphere, wonderful and knowledgeable wait staff, but the food was just meh.  Based on reviews and the recommendation of the waiter I ordered the caesar salad  and duck with wild mushrooms and lingonberries.  The duck wasn't tender at all (actually quite tough for duck) and the sauce was good, but nothing spectacular. The sides served with it were just simple rice and sauteed snap peas. I honestly expected much more in the way of flavor and quality.  I have to give props to the place on their wine selection - nice (albeit brief) wine list with some nice reasonably priced selections.  Would I go back - maybe, but I'd be inclined to sample some of the other great restaurants in the area first.", "author": "Marcus Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-13", "description": "Went for \"exotic game meats\" dinner. Elk was great, Kangaroo was not impressive, Venison Stew was flavorfull. Mashed potato, and other sides were pretty tasty too.  Unfortunately we just cant \"rave\" about it because we did not feel a spark of energy from the interior or staff.  Every single one of the staff was pleasant and efficient.", "author": "J H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "My BF and I went to Henry's End for the Wild Game Festival.  They had some really unusual things on the menu.  We had the turtle soup, which was good with a little kick.  I had the mixed game grill, which had the elk chop, venison sausage, and wild boar belly.  The wild boar belly was a litle more gamey than the regular pork belly, but that was my favorite on the plate.  My BF had the kangaroo...very gamey.  The BEST part of the dinner was dessert - I had the mud pie and he had the 21 layer crepe.  He still thinks the 21 layer crepe is the best dessert he's ever had.  I think he might even dream about it every now and then.  LOL.  We'll definitely have to go back for the regular dinner menu and see how that compares.", "author": "Yukie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "From start to finish, a very pleasant experience.  The staff was wonderful and the food delicious!  We had the Caesar salad and turtle soup to start and both were yummy.  My boyfriend had the platter from the wild game menu featuring the Elk chop, Wild Boar, etc.  He loved it!  And my veal was amazing.  We were too stuffed to try the desserts but they sounded great and will have to try them next time around.  Great beer selection too!", "author": "Irene Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "So my wife used to be vegan: she started a couple years after we began dating and held out for 4 years or so. She recently began eating fish - still no land animals or dairy. This was the first place we went to after she came back to fish. \n\nIt was cold and snowy, back in Dec. '09 when she and I first went. I had been twice before several years ago and knew what to expect.  We've returned once since. the most recent time we had to wait around for like 20 minutes for a table, but they brought us wine and we just chilled. It was a little hectic because we were forced to stand in front of the coat rack though...\n\nAnyway, my darling spouse will vociferously espouse the brilliance of the \"Grilled Tuna with olive oil, garlic, tomatoes, scallions and capers\" which she has had both times we went. Likewise the Wild mushroom salad. \n\nI enjoyed the wild game mixed entree both times, but since it had different stuff each time (except the best part, the wild boar belly, which was on both) I think it counts as two separate experiences. The herb-crusted elk chop was very nice, the venison was even better, the stuffed quail was pretty good but lacked something in comparison, and the boar belly is out of this world. And there was some kind of sausages one time that was quite well-made, if not as spicy as I'd prefer. \n\nThe wine list was affordable and well-stocked. The service is nice without being pretentious or overbearing, though maybe it's just the one tall older lady with the smoker's voice and cough who we've had both times as our server that I'm grading and not their waitstaff as a whole. The exposed brick and warm light make it an attractive place to go in cooler weather.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "delish! how did i not know this place existing right down the street from me? \n\n...maybe it was kept from me on account of my hips. \n\nanyways, really casual, walk right in, but rich food, took a lot of time perfecting dishes. i recommend the duck. desserts were just as good.", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "When you see this restaurant for the first time, it looks a dive bar from the outside.  When you enter the restaurant, it looks like a southwestern saloon -- a bit dark, with brick walls and neon signs.  It took us by surprise... we were expecting a more modern, bistro-type setting.  It's a small restaurant with an open kitchen, but they manage to keep the place very cool and comfortable.\n\nThe food was very, very good.  The steak au poivre was the best I've had in a long time.  The bread assortment they bring before the meal is great -- had to stop myself from eating the whole thing.\n\nGood and attentive service.  We look forward to going back.", "author": "Cynthia S."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}