{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "Went here a few weeks ago with my aunt who is VERY picky with her food. This place is TINY TINY TINY. You can here conversations from the open kitchen, and all the tables around you. We ordered the duck and the lamb, both were absolutely delicious HOWEVER, this restaurant is very expensive. They do serve you a HUGE portion, but I think they'd be better off serving slightly less food and charging less as well. Each entree was $30-37 which isn't great for everyday eating. The wine list was ok, I ordered a glass of rose for $8 and it tasted decent.", "author": "Lillian E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "The minute I walked in, I was blown away by how good the place smelled.  The aromas from the open kitchen were wonderful.   This is a small low-key restaurant on a strip of restaurants in Brooklyn Heights.  As an appetizer, I had a special, a (hot) potato and watercress soup with blue cheese.  A decent sized-portion (but good enough that I could easily have eaten more). My main course was the walnut crusted chicken breast with pear.  Also delicious.  The menu didn't make it clear, but the main dishes came with rice and a vegetable.  The desserts looked wonderful, but I didn't have room for one by the time I finished the meal.  My dining companion had the fried chicken, and the portion was ENORMOUS.  She took half of it home.  \n\nWheelchair accessibility notes:  I would not recommend the restaurant for someone in a wheelchair.  There is a step up to get in, then a turn and two doors to go through.  There is very little room to maneuver.  The two tiny bathrooms would be very difficult to navigate in a wheelchair, and I'm not even sure that a wheelchair could pass down the aisle to get as far as the restrooms anyway.", "author": "Meg S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Took my family out here, had a really nice feel (real old school Brooklyn Heights place). The menu had a good deal of variety,  and a fairly extensive beer and wine selection. \n\nThe service was good, waitress was very nice and attentive.  We were one of the last tables, but they didn't rush us out the door.\n\nThe food was excellent and came in decent portions. The warm goat cheese appetizer was pretty memorable.\n\nThe deserts were just okay, pretty small and nothing to write home about \n\nOverall,  very good experience.  Parking was easy to find. Would definitely recommend this place to anyone in the area.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "Went to Henry's End after cancelling a reservation elsewhere in the neighborhood and so glad we did!  We were sat on a Friday evening within a few minutes, despite the dining room being packed.  It had a great vibe and we enjoyed our meal from start to finish.  \n\nStarted with some fresh bread and breadstick selection, shared the crab cakes and a salad for appetizers.  Crab cakes were some of the best we've ever had!  It was plenty for two people to share, really fresh, you can tell it is very high quality crab after the first bite.  For entrees, I had the sole citron. Wow!  I've had this dish here before, several years ago and it tasted exactly how I remember.  Crispy, buttery and light with just the right amount of citrus.  I really love this dish.  My friend had the orrechiette and said it was also very good.\n\nThe portions are pretty large here, we were able to take home some leftovers and enjoy it the next day.  What I really loved about this place was how consistent it is.  Great neighborhood spot that has kept a reputation. Very happy to see them still busy, especially in an area where you see restaurants opening and closing everyday.  \n\nGreat job Henry's End!", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "Henry's End is a quaint little restaurant tucked away in a charming neighborhood.  Although it's venue resembles little more than a tastefully decorated corridor, the quality of its food is unsurpassed.  Your taste buds will begin to believe again, at Henry's End.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "I have to dole out a 5 star for this amazing place. Not only is the food excellent the waitstaff are extremely courteous and sensitive to every diner here. This place functioned like a well oiled machine, our courses came out with such perfect timing. We started with some Crab cakes, whoa, utterly amazing. I could have just ordered these....... just kidding, because for my entree I had an amazing mixed gamer grill, which included quail, elk chops, and elk sausages. This was superb, but the standout were the perfectly cooked elk chops. This is perfect meat, better than any beef I've ever had. It was superlative food. My family ordered from their regular menu, tortilla flour crusted shrimp (amazing) and stuffed chicken (also amazing). Another very special aspect of the restaurant is the beer list- it's thoughtfully curated with many nods to local breweries, but with some great beers from all over the country. You can see that whoever put this together really believes that beer deserves the same emphasis as wine at fine dining establishments. Henry's end is a special place. It's unpretentious, yet in my opinion it can stand up to any NYC michelin starred restaurant. It's a place with great food, great service, and simply put authentic charm. If you're going out for a splurge or special occasion, it's my advice to consider this place. I can't wait to return.", "author": "Will R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Absolutely love the food here. Great ambiance and the wine pairings are always spot on!", "author": "Jay G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-08", "description": "Popped in here after seeing Grimaldi's had an insane line and found a pleasant surprise.\n\nAtmosphere: Cute, very Brooklyn Heights / DUMBO. (Brick, wood, old pictures)\n\nFood: My girlfriend and I both got the prix fix ($30 per person). She had the crab cakes, salmon / arugula, and key lime pie. We loved the crab cakes as they actually tasted like crab meat and not the typical more breadcrumbs than crab. The salmon was very good and I am comparing this to both salmon I have had in Northern Europe and the Pacific NW. The keylime pie was so-so.\n\nI had the mesclun salad, scallops, and banana pie. The salad was good but very typical. The scallops were wonderful but the side corn was only so so. I loved the banana cream pie.\n\nOverall: I would rate this 3.5 or so. Good meal, nice atmosphere, OK price ... But nothing gave me the urge to return.", "author": "J I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Immensely impressed by this restaurant. Service was great, food was even greater. Went here with my boyfriend on a Tuesday evening around 7:30pm, sat right away in a cozy table next to the kitchen...it's an open kitchen so this was pretty cool. Great selection of beer, mostly local. We shared a pasta special: linguine with soft shell crab - DELICIOUS! so much flavor!...as well as the Tortilla crusted shrimp which came with the best side of guacamole ever. Dinner we shared a chicken special with dried cranberries, peaches and a blue cheese (hint of it) marmalade type, and it tasted like Christmas. We got the side of brussels sprouts with andouille sausage which was perfect. Everything was so flavorful and I will be bringing my friends and family back to this establishment in the future!", "author": "April S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "the place is small and you can feel the warmth since the very moment you cross the door. It is located within walking distance of the New York Marriot at the Brooklyn Bridge, where I stayed due to a summit. \n\nYou should reserve your table before coming down since, as I stated before, the place is small. \n\nThe food was delicious and the service was great. I definitely want to come back and try all of the steaks available.\n\nI think I could take a girlfriend here ;)", "author": "Cristóbal G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "It was a delicious dinner.\n\nWe didn't order anything from the Game (meat) festival, Marco C. ordered duck with wild mushroom and berries and I went for the prefix (Mon-Thur, $25). The prefix consists of appetizer (I had butternut squash bisque), entree (Mustard seed encrusted Tuna) and dessert (Persian Lime Pie).\n\nThe duck was simple and well done, the skin was crunchy and the meat was moist. The bisque was good and my medium cooked tuna was tasty and very \"mustard-y\". The Persian lime pie was the perfect finish with the tartness to wrap it up. The portions were generous for a prefix, I couldn't finish all my entree and I shared my dessert. I was very full at the end of meal. The duck dish was big, my fiance had a hard time finishing it (I help him a little, who can say no to a nicely cooked piece of duck with berry sauce!?). \n\nNext time we will share a prefix plus another side and appetizer.\n\nThe waiters are quiet and no-frills but they are attentive, refills your water all the time. You can tell the kitchen was on full throttle, despite the restaurant being almost full, our food came out quickly. You won't find elegant or romantic decor at Henry's End, but you will find good food that's for sure.", "author": "Isabella W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "I had a great experience here. The beer list has some great selections to choose from. You can't go wrong with Chimay. For our appetizers we had goat cheese and beet ravioli, a BBQ-y/spicy jumbo shrimp, and tuna tartar. The ravioli was not very substantial or flavorful, but the shrimp was awesome.\n\nFor my main course, I had chicken coated with ground almond, on top of bleu cheese, and topped with sliced pear. It was phenomenal, although I wish the bleu cheese had a stronger presence than it did.\n\nAll in all, a great meal and a really nice, mellow atmosphere.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Went here for a double date on a Friday night. They do accept reservations for parties of at least 3.  We were seated promptly.  The restaurant is cozy, and by that I mean the tables are pretty close together.  Not so much that you can't have a private conversation, but you definitely may have people pressing your chair in to get by if you haven't scooted your butt close enough to your table.\nWe sampled a few items off the Wild Game Festival menu, which I'm listing in order of favorite to least liked.\n1) Spiced Antelope with a Lingonberry Sauce, Sweet potatoes and Brussels sprouts.  This was the best dish of the night.  The antelope was incredible.  Melt-in-your-mouth tender, perfectly medium rare (though more on the rare side).  The  mashed sweet potatoes were creamy and paired perfectly with the meat.  The brussel sprouts were caramelized but still had a nice bite to them.  Delicious all around.\n2)  Mixed Game Grill - Wild Boar Belly with pistachio pomegranate relish, herb crusted Elk Chop, and Rabbit Sausage, served with a very small plate of rich and steamed veggies.  The rabbit sausage was very good, although it was not browned at all and the grey color of it was kind of sad.  The boar was delicious.  The elk chop could have used a bit more seasoning, but it was perfectly cooked (medium rare).\n3)  Danish Venison stew with caraway mashed potatoes.  This was alright.  The venison was nicely cooked (very tender) and the dish was early and flavored, but a little bit one-note.\n\nWe also had the Wild Mushroom Salad (regular menu), which was good, but not outstanding.  \nAs a side, we did order the truffle fries, which were fantastic.  They used a very fragrant truffle oil, and the fries were perfectly salted and perfectly crisp.  No soggy pieces and no burnt pieces.  I could easily say these were the best fries I've eaten in my entire life, and I have eaten truffle fries before and I have been to Pommes Frites and other places where people say they love the fries.  These were better.\n\nWe were too full to order dessert, but we did order a bottle of the Zinfandel.  A bottle is only a few dollars more than a half carafe (which pours about 3-4 glasses).\n\nGood service.  Friendly waitress.  Water glass was always promptly filled.", "author": "Ann D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-26", "description": "I can't say that I was super impressed by the food. The small plates were pretty good, although the mains weren't anything to rave about. I had the sole citron and my partner had the steak au poivre. The steak turned out to be too tough and my sole was over breaded. For the price, I was hoping for something better. Henry's End is fine for a neighborhood drink or appetizer, but that's about it.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "My first turtle soup ever was delish! Nice atmosphere--hip and jumping crowd. Amazing food and a nice bottle of wine.  The only thing better was the company.", "author": "Martha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Henry's End was the first restaurant I ate at, after moving to the neighborhood over 11 years ago.  It's still my go-to special occasion restaurant!  Food is consistently high quality and fresh, the wine list is reasonably priced and offers a nice variety, and the waitstaff are courteous.  NYE's prix-fixe offered some regular menu fare, along with some delicious options I hadn't seen before.  I had the wild boar Ragu, grilled salmon with lobster risotto, and chocolate banana bread pudding.  SO good.", "author": "Jen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "We loved everything we ate which included BBQ Shrimp, Salmon cooked in 3 different mustards, wild mushroom Duckling, fuel greens also with tasty roasted wild mushrooms and the delicious mud pie for dessert!  The manager Albert was warm and took amazing care of us!  Highly recommend!!!", "author": "JR H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "As Ms. Tabatha Coffey says (20 times an episode in disgust), \"WAOOW\". This is place if you like your flavors extremely strong and meats well-seasoned. I'm embarrassed that after living in the area years ago (granted, as a broke college student who went to Henry St Ale house for a big night out) I never thought to give this place a visit. \n\nOur server recommended the Moroccan Salmon over the Mustard Salmon which was a better complement to all the bites I was stealing from my girlfriend's Chicken Lemonese. \n\nThe meat preparation here stands right up to any Michelin-starred place I've been. \n\nWill be back asap for the turtle soup!", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Great food,  reasonable price and a casual atmosphere. It's small though so probably worth getting a reservation or you may have to wait a while.", "author": "Matt A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "I've always been curious about the annual Wild Game Festival at Henry's End. For historical reasons.\n\nI'm used to game meat. Every time I go to Sardinia, Italy[1], I would eat some sort of game. Usually wild boar; some times fowl. The curious thing is that hunting season is in the winter, and I am usually there in the summer. How do I manage to eat fresh wild boar when it is illeg...aheam! \"unusual\" to hunt it in the summer? According to my relatives, it would seem that wild boars have suicidal tendencies. I've heard tales of wild boars jumping in front of a car, then being finished off with a monkey wrench, and skinned with a Swiss Army knife in the bathroom of a public camp site. Whatever the origin of the meat, the end result has always been spectacular.\n\nRoadkill never tasted so good.\n\nHenry's End is rather nondescript, and the overall vibe is a welcoming \"old school, no frills\". The only notable feature is a neon sign/skyline behind a transparent plexiglass cover mounted on one of the walls. It looks like a relic from the '70s that probably has now achieved national landmark status.\n\nThe wine selection is rather impressive, with 25+ white wines and 70+ reds[2]. My choice for the evening, however is a bottle of Aventinus (12% ABV): a wonderful doppelbock with a dark ruby color, a creamy head, and a yeasty-bready-fruity taste.\n\nAs appetizer, my dining companion and I shared the Pheasant Ravioli ($10.95; $21.95 as main course) with caramelized fennel and pistachio nuts. The ravioli were nicely presented in a dense, creamy sauce. The filling was very flavorful, and the flavor of pistachio balances nicely the delicacy of the pheasant. The end result, however, was a bit too dry.\n\nFor main course, I had the Mixed Game Grill ($33), which included Herb Crusted Elk Chop, Wild Boar Belly, and Rabbit Sausage. The dish is served with a Madeira-and-veal stock demi-glace that is a rich orange in color and slightly sweet. The elk was excellent: elk meat is very lean and tender, and the wonderful crust[3] enhanced the flavor without overwhelming it, while at the same time maintained the meat nice and juicy[4]. The Wild Boar Belly was nice and fatty, very tender and juicy. The Rabbit Sausage, however, was bland and didn't live a lasting impression.\n\nThe Elk Chop dish ($36.95) that my dining companion had, came with the same demi-glace as the Mixed Game Grill. I found a bit surprising that they would use the same sauce for the two dishes; in fact, that sauce might have overwhelmed the flavor of the rabbit sausage.\n\nUnfortunately the Wild Game menu does not include any more items that I have seen listed in the past and I would have loved to try, like BBQ Rattlesnake Salad, Antelope Au Poivre, and Reindeer. venison is gone too. Nevertheless, kudos to Henry's End for serving a solid, albeit limited, selection of game meat.\n\nKeep your excitement and expectations at bay and you won't be disappointed.\n--------------------------------\n[1] The land of my ancestors.\n\n[2] The cheapest ones at a very reasonable $35-36 a bottle.\n\n[3] A mixture of breadcrumbs, capers, extra-virgin olive oil, garlic, Tabasco, chives, thyme, tarragon, rosemary, parsley, and anchovy.\n\n[4] Ask to have the elk medium rare.", "author": "Matteo R."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}