{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "Food and ambient are amazing really friendly staff. I have the NY strip steak and the sauce was fantastic. Real food. :-)", "author": "Joey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "Tried their exotic meats and was a bit dissapoited but experience was nice,  turtle soup and alligator sausage were my favorite.  Drinks and desert were delicious.  Portion are small and is a little expensive.   I will be back to try their regular menu soon.", "author": "Turquoise Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Took my daughter here as we explored the neighborhood as she starts at NYU.   Perfect service fantastic food could not ask for anything better !   I highly recommend.  Great service and very creative dishes for a small quaint restaurant !   You will not be disappointed!", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "Henry's End features a good selection of tables in a relatively dark atmosphere. They serve some interesting chicken, fish, veal and meat dishes, but also have a Wild Game Festival menu.\n\nI ordered the Syrah and Green Peppercorn Kangaroo since I've never had it before. It was ok, but nothing too special. There are more items than are currently listed on the restaurant's website, so call ahead for details.\n\nGet a table in the middle of the restaurant so you're not near the back where the bathrooms are, and at the same time not at the front where the hot/cold weather blows in the doorway. Also at the front, people might be standing waiting for a table, and if you sit at a certain table a waitress might have to reach over you to grab wine or beer out of a refrigerator.\n\nThey only take reservations for large groups.", "author": "Jordan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "Henry's End Restaurant. One of the gems of Brooklyn that I go to when I can, because it is a little heavy on the wallet, but I think it's worth the dough. For a good portion of the year (mostly winter), they have their \"Wild Game Festival\", which is totally my thing, love me some wild game. The wild game menu items change, but they are posted on their website, saying what is served on what day. I've eaten kangaroo in a red wine sauce, and it was heavenly. Animals usually taste a little bit of what they eat, and since kangaroos eat mostly fruit, berries, and plants, the meat itself had a fruit-like taste. It was good.\n\nI've also had the herb crusted elk chop, served with mushrooms and fresh spring vegetables, and that was great as well. The flavors really complimented each other, and the elk chop was cooked just right.\n\nThe wild boar belly was also good, think bacon, but with distinct differences. The turtle soup I've had on more than one occasion and it's never let me down. The rabbit is superb as well. The owner is usually there and greets me by name, which is always welcoming. Bonnie the waitress is one of the sweetest old ladies that always treats me like a grandchild, and warms my heart. She's great and has been a fixture there for a while. So, servicewise, it's wonderful. Food-wise, it's fantastic, confused after reading some bad reviews of Henry's End, maybe those experiences were just flukes, because everytime I leave there I have a full belly and a smile on my face.\n\nI'm also a part of the 'Birthday Club' which entitles you to a free dinner entree with a max. value of $20, which is valid a week before or after your birthday. When I went for my birthday it was the first time I went there outside of the \"Wild Game Festival\". I ordered the wild mushroom \u0026 lingonberry duckling which contained portobello and morel mushrooms, shallots, thyme, brandy and lingonberries. The duck was cooked perfectly, crispy skin, tender, moist, flavorful meat. The dish really worked out, and my compliments to the chef.\n\nI will continue to patronize Henry's End Restaurant, especially during the \"Wild Game Festival\". Definitely in my Top 20 restaurants in New York City. I highly recommend giving them a try.", "author": "Scott K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Great quality food in an intimate setting. Likely one of the best wild salmon entrees I have had in some time. We also had the shrimp tacos, roasted vegetables, crab cakes topped off with the chocolate hazelnut dessert.. Everything was prepared very well.", "author": "Warren P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-19", "description": "I love this place. None of the pseudo-chic trappings i see in many a 'nice' Manhattan restaurant, this place is short on pretension and high on excellent game food. The service was old-fashioned, as others have pointed out, and brusque without being rude. I prefer that kind of service to, again, its Broadway-musical style counterparts in much of Manhattan. \nI went on my birthday and the staff was kind and considerate enough to put my name and a candle on our desert of their own accord. Great place, one of my new Brooklyn favorites. I hope to be there again soon!", "author": "Stavros P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "I haven't been to this place since 2003. When my friend suggested dinner in Brooklyn Heights, I thought it would be great to revisit a place that left me with good memories over ten years ago. So much was still the same but I could tell that years had gone by.\nOverall, the food was tasty, the service and staff gave a homey, warm and comfortable feeling and the crowd was down-to-earth. I didn't enjoy smelling like the kitchen even after I left the restaurant. But, I would definitely go back for dinner again.", "author": "Sonya F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-13", "description": "Went on a Tuesday night around 8pm. Got a table immediately for 2, but the place was pretty busy and LOUD. \nPretty decent wine menu (some older vintages and great stuff by the glass)\nGood beer menu too. \nI got the Salmon with asparagus and lemon risotto (medium rare). It was cooked past medium but it was still pretty delicious. I really enjoyed the salmon skin and the risotto wasn't too overwhelmingly lemon-flavored.\nThe duckling with wild mushroom and lingonberry was a very large portion and tasted amazing. My dining partner thought it was a bit dry but to each his own.  \n Great service but the place was packed too closely and again, it was loud. Not as suitable for 'date night' as I had imagined.", "author": "Yon L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "I have a love for trying out new types of food and food experiences. Because of this, one of my biggest vice is to try out food with exotic strange meats.  Of course I have boundaries where I would say no such as endangered animals and man's ( and woman's ) best friend, etc, but for the most part I am more then game for trying something at least once.\n\nA few days ago on Yelp talk, there was a thread on \"Uncommon Food - What and Where to get it?\" and this place was mentioned.  One look at the menu and I knew I and a similar minded friend had to be there.  According to their web site, every year starting on October to March, they have a Wild Game Festival of dishes made from exotic (to Americans) meats.  \n\nWhat they have rotates year by year and week by week.  According to the super friendly and very patient waitress (I had so many questions about the food and the festival ) named Bonnie, they had lions, tigers, and bears (Oh my )over the years.  Ok, I was kidding about the tiger, she actually said hippo.\n\nSadly, because I was eating here at the very end of the festival, the menu for this event was very limited.  I was so looking forward to the Rattlesnake Salad, and kangaroo from this year too.  What was available though, was amazingly good.\n\nTurtle Soup Cajun Style:  A little like a cross between a tomato soup and chili.  Turtle meat is usually a little tough and chewy so they grounded the meat till it was the consistency of ground beef to make it easier to eat. It was mildly spicy.  The soup by itself was good but what made it amazing was that they provided a bottle of sherry on the side to flavor the soup as you like.  Alcohol in your soup, what a combination.\n\nMixed Game Grill: This plate consists of a Herb Crusted Elk Chop, a Wild Boar Belly, and a Stuffed Pheasant.  \n\nThe Elk Chop, as other reviewers noted, were the highlight.  Done medium rare, the meat was much more tender then most beef steaks.  The top of the Elk Chop were covered in a Herb \"Crust\" as they called it and adds a nice flavor to the tender meat.  \n\nThe Stuffed Pheasant was a tiny little bird half  the size of most people's fist.  It was filled with a combination of spinach and bacon. Again very tender and the bits of bacon in the interior adds a nice bit of porky saltiness to the meat.\n\nThe last item, the Wild Boar Belly was good but was the weakest of the three. Pork belly is a very hot item in restaurants right now because of how soft and buttery it is.  This dish should have kicked ass because  wild boar have a more intense flavor then domesticated pigs and despite the fact that you could taste that in this meat, I believe it would have been improved if it was softer.\n\nThe Mixed Game Grill also came with a side of basic rice and steamed broccoli.  I agree with the other reviewers that this was a disappointment.  Nothing wrong with it but considering how tasty everything else was, I expected something a little more exciting then what was provided here.  Maybe give me wild rice in some kind of sauce at least? \n\nI enjoyed this meal and is excited to see what interesting meats they have planned for future festivals.  I'll be there for sure. Now could someone provide some info on where I could get some nicely cooked garment insects too?  Yumm....", "author": "Wing L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "I took two of my friends here for what was supposed to be a very special birthday meal. My friend Beth turned 40 and Cindy, 50 :-) The three of us each had an appetizer, an entree and a dessert and Beth had a glass of white wine. The meal was delicious, well made, balanced and filling. The service was nice and attentive. It was also nothing special. The bill came to $300. Meh. For that price I expected more.", "author": "Sooz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Walked in with my husband and son on a Friday evening around 6. We were seated right away. This place is really cute and romantic. A great date spot. Got the wild mushrooms for an appetizer - AMAZING. Main course was a special- chicken with some type of mango avocado salsa-- also delicious. My husband got the soft shell crabs which he really liked. Also got the chocolate cake (amazing) and banana bread pudding which my husband said was good not great. Service was responsive and friendly. Really no complaints, would go back. \n\nOne thing to note- we brought a stroller and sat in probably the only table that would work with it. They were very welcoming to us bringing a child, but the layout isn't very condusive.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "Henry's End is a charming little place with some really interesting dishes. We were on a mission: find a place that serves game meat. This place was great. \n\nI ordered the Game Cassoulet (Duck, rabbit sausage, merquez sausage over white beans) and my friend ordered the Mixed Game Grill  (Elk Chop, Wild Boar Belly, and Rabbit Sausage). My dish was a little on the salty side, but otherwise, I loved it. The duck was crispy on the outside and tender on the inside and the sausages were really flavorful. We ordered the 21 layer crepe at the end. oh man. it was so good. If you're not in the mood for chocolate, then get this. \n\nOur waiter was also attentive and nice.", "author": "Maya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Yes, it is that good.\nFirecracker shrimp were large, perfectly cooked and spicy.\nDuck was perfect, moist and crispy skin, no fat, off the bone.\nSauteed soft shells were excellent, buttery and lots of flavor.\nFriendly, knowledgeable, and appropriately attentive service.\nThe best.", "author": "Paul C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-20", "description": "More hype than flavor. I was so excited to eat here.And it appeared I was not alone in this feeling. Had my dish been cooked to order, I would have given it three stars. But who wants well done meh salmon? (I thought not.) My dining companions had meat, and both enjoyed their dishes. (I sucked it up - the experience, not the food - of course, but seriously.) So, if you like pork or beef I would say try this place. Just don't, whatever you do, order expensive medium rare salmon. Or, bring an electric carver. The sides were good, but quite small and not a good value.", "author": "Leah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-09", "description": "One of the worst meals I have ever had. I had some seriously high hopes after reading the wonderfully written menu and seeing that there were a bevy of specials on offer for the evening. I was dining with my girlfriend and her ten year old son who has been broadening his palate lately thanks to the fact that we have eaten at some decent (definitely not fancy) restaurants as of late. I don't know if he will ever trust me again after he had his first scallop ever and it was cooked to the point of a pencil eraser and completely devoid of moisture or flavor. A $15 glass of low-end chardonny was the only mildly palatable thing placed on our table. The rice that was served as a complimentary \"side\" would have been alright if we were in prison. Don't go here. The cooks all look strung out and they clearly don't care about what they are serving.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-11", "description": "I have often thought Henry's End was expensive but well worth it, given the wonderful food. I was recently there a few days after a visit to The River Cafe. Dinner for 8 at Henry's was about the same price as dinner for two at the River Cafe. \n\nAnd though the cafe's food and service are elegant and formal which Henry's end definitely is not, I can't say that The River Cafe was worth the money, while Henry's End has always been more than worth it. And, I've been eating there for well over thirty years. \n\nA truly enjoyable dining experience.\n\n(No restaurant is perfect and I've had the occasional unhappy visit. No matter.  Henry's End has long been one of my favorite places to eat.", "author": "Barry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "Amazing venison dish!\n\nCame here on a Friday night w my sweetie. We both enjoyed the wild game festival. My venison was tender and perfectly cooked (I like my meat rare) and his elk chops were even more tender and just as well seasoned. The only gripe I had was lack of sides/veges that came w the dish. For the price, I expected more garnish and vegetables w the dish.", "author": "gwen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Just finished a great meal at Henry's End! Took advantage of the wild game menu, not as wild as we were expecting, but great nonetheless.\n\nStarted the meal sharing a bowl of the turtle soup, somehow in my mind I imagined this to be like a chowder, but to our surprise it was hearty and rich, almost like a chili.  The flavors were more Indian than Cajun in my mind, but really good and satisfying!\n\nFor mains I got the southern fried chicken.  Not on the wild game menu, but highly recommended from our waitress.  More interesting flavors than you typically taste in fried chicken, with cinnamon and garlic! Yum!  My husband got the wild game mixed grill, with elk, venison sausage and wild boar belly.  All were great, but the wild boar belly was for sure the star of the show!\n\nAll in all a great meal, we'll be back when it's kangaroo time! Check the website to see what the specials are!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "appetizer: ozark ribs BAM! KICK BOOM!\nwest indian bbq shrimps\n\n\nsteak au poivre- i hate mustard but damn the sauce was fab.\n\nservice: supppppppppppper good.", "author": "Davina L."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}