{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Very tasty, elegant food. Well prepared and served. Wine is great and service is good.", "author": "Alice B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "One of my favorite little pubs. Good variety on tap with cozy old school bar atmosphere. Perfect for meeting friends after work.", "author": "Lexie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-07", "description": "Came years ago and loved it but didn't have the same experience. I will try again because I love the vibe and coziness. Had a steak and it was cooked fine but sauce was bland. My friend ordered the sole thinking it would be baked or sautéed but it came out with three huge pieces of fried fish. Waiter was consumed with the couple to the left and our bottle of wine should have been decanted 4 hours to make it drinkable and it wasn't inexpensive. Shouldn't have even been on the menu. Know this is a standby and probably is more consistent when you go more often.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "A terrific, old school vibe and good service in Brooklyn Heights. The spicy margarita was a bit too spicy, even for me; aside from that, dinner was warm, cozy, and tasty. The crab cake appetizer was a winner, as was the unique cold sour cherry soup. The sole citron entree was the lightest offering from the prix fixe and was nicely citrusy and a large portion of fish. Dessert was a small - in a good way - lime tart. We left stuffed and happy, a nice combination for the train home.", "author": "Will V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Ate here tonight for Father's Day (family of four) \u0026 had a great experience! The food was delicious \u0026 the service was far above average! \n\nThe waiter was fantastic \u0026 very knowledgeable about the menu as well as the drink pairings \u0026 daily specials. \n\nHere's what we ordered:\n\nAppetizers \n1. Pan-Roasted Vegetables with Polenta \u0026 Balsamic Glaze- So yummy! The glaze was just the right amount of sweet. The polenta was cooked perfectly. Nice assortment of in-season vegetables. \n2. Ribs- Didn't eat these, but my brother said they were fall-off-the bone tender. They didn't last very long on the table either! \n3. Pecan Crusted Shrimp (Special)- I didn't try the shrimp, but they were served over a corn \u0026 chipotle salsa which was very good.\n\n\nEntrees\n1. I had the Southern Style Fried Chicken- It was out of this world. Perfect crispness on the outside \u0026 still juicy and tender inside. It was a large portion, too! I took some home. I really liked the spice blend they used with hints of clove, nutmeg, and cinnamon. \n2. My brother had the Peppercorn Crusted Steak. Cooked perfectly medium-rare \u0026 served with a Dijon sauce. He had a side of Truffle Fries. \n3. My father ordered Two Softshell Crabs: The Basil Butter \u0026 Tempura Battered. \n4. My mother ordered the 18 Spiced Steak \u0026 it came with an awesome Apple Chutney. \nEveryone basically cleaned their plates. The waiter was very accommodating to special requests: My brother asked for his steak to be served without the sauce on top. My father had asked for two different style Softshell crabs, instead of the menu stating that they come two crabs to an order with one preparation or sauce. There were no issues with these requests.\n\nDesserts\n1. I had the lemon sorbet. Very refreshing.\n2. My father had the 21 Layer Crepe.\n3. My mother had the Banana Pudding. The butterscotch sauce was on point! \n4. My brother had the Mud Pie.\n\nI think the best part about this restaurant was that the owner was actively involved in the service and checked in with all of the diners throughout their meals. His name was Mark. He also informed us that (since parking is nearly impossible) there are coupons to print off the website for 50% off parking in the lot across the street. Also, it started pouring out of nowhere \u0026 some people from the street came inside to wait it out. They didn't even stay to eat, but he offered them napkins to dry themselves off in the meantime. \n\nWill definitely recommend \u0026 will definitely be back!", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "For over 40 years Henry's End has been a jewel in Brooklyn Heights. The great food and service is so consistent you'd think it was run by Ray Croc, yet it has a great neighborhood personal feel that is special.", "author": "Adrian P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Absolutely AMAZING! A must have. Me and a friend enjoyed a burger and hot wings. The fries were to die for!! Easy to miss while walking but worth the search. Will be definitely returning !!", "author": "Jerrica J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Place is pretty much a hole in the wall. Almost missed it when I was driving by. When you walk in, they do look pretty \"unassuming,\" however, the food definitely made up for it!\n\nHad the West Indian BBQ shrimp and the Salmon Morraacan (both were great!  \n\nMake sure you try the mudslide as well!\n\nWill definitely be back for Round 2!", "author": "Joseph J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Henry's End is an institution.\n\nThe dining room, though cramped, is very clean. The staff are affable, knowledgeable of the menu, and eager to create an enjoyable dining experience.\n\nThe fare is simple in its presentation, but big on taste, combining lovely ingredients and bold flavour combinations.\n\nThe wild mushroom salad is perfectly seasoned, the greens slightly wilted by a warm vinaigrette, and loaded with umami from the savoury mushrooms.\n\nThe wild mushrooms also make a wonderful appearance in the wild mushroom and lingonberry duckling. Though the duck was ever so slightly overcooked, the skin was crispy, the fat rendered nicely, and the balance of salty, sweet and umami in the sauce was delightful.\n\nAlso on offer are classics of previous decades including a Steak Diane, as well as a shaved salad with Green Goddess dressing.\n\nHowever, the signature of this restaurant is definitely the wild game festival.\n\nThe mixed grill is a triumph of meat with bags of flavour, combining an elk chop cooked perfectly, succulent boar belly, and a spicy andouille sausage of alligator. Each by itself is wonderful, though admittedly, the andouille is shamelessly outmatched by the elk chop and the boar belly. They are served with a savoury chasseur, or hunter-style sauce, rich with bone stock and reduced wine flavours, hints of tarragon and marjoram, and a slight acidity of tomato - a perfect accompaniment.\n\nTruly, Henry's End has not squandered its reputation for clean preparation of classic ingredients and elegant flavours.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Amazing. I got delivery and it was packaged perfectly and still tasted great. The lobster cream penne is the best pasta I've ever had. Actual chunks of lobster but not too heavy. Yea it's expensive, but totally worth it!", "author": "Madd S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "I've been going to Henry's End for the past 20 years and I've never met Henry. Or any Henry, but I've never left without being completely content. The gaming menu sounds exotic with the turtle soup and wild boar etc. but it's not so scary. It's as if you thought to yourself,\"Self, I think this filet mignon (at whatever fancy restaurant) is fantastic, I don't think there is anything better!\" But there is. The whole gaming menu at Henry's End! Do the sampler with some nice red wine and expect to be rolled from your seat to a cab or wheel barrow more completely full of food and contentment than you could ever imagine possible.", "author": "Fred H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "I dined at Henry's End last night with two friends. We could only get a 5.30 PM reservation when they open but that was perfect. We had just seen the free BargeMusic concert (family concerts at 4 PM on Saturdays) and took a 10-15 min walk to get to Henry's End. It's autumn so we came for the beast feast.\n\nWe were seated right away and the service was friendly and knowledgeable. We appreciated our server telling us 2 small plates and 2 entrees would be plenty for the 3 of us. The place really filled up. There was a pleasant buzz, however, it wasn't so loud that you had to shout and the tables were far enough apart that you couldn't hear your neighbor's conversation, nor they yours.\n\nWe shared two small plates - the yak sticks and  the pappardelle with wild boar rage. Both were excellent.\n\nThen we shared the kangaroo with sweet potato, spinach and sour cherry sauce and the elk chops with frisbee-bacon salad and fig/pomegranate. Again, both were excellent.\n\nWhen the portions came, it didn't look like they'd be enough. But we had food leftover!\n\nWith a modest bottle of pinot noir, the F\u0026B bill came to $181 for 3.\n\nA very nice experience all the way around!", "author": "Francesca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "This place is about the food. There are plenty of places in BK Heights that are more hip or have fancier decor, but if you`re more interested in what goes into your mouth than interior design, than this place is well worth a try.\n\nThe restaurant has been around for decades so it has a nice old-school atmosphere. I loved the slate tables.\nCame here on a Friday night without a reservation. They were packed, so we had to wait. They have a nice wine bar two doors down where you can go for a drink while waiting and the waiter will come and pick you up when your table is ready. Great!\n\nWe had a Caesar salad and the Game Charcuterie Plate from their Annual Wild Game Festival menu. The salad was great and the game pate was amazing.\nNext we tried the duckling with wild mushroom \u0026 lingonberry and the steak Diane. \nBoth great, huge portions of meat, pretty spicy and saucy.\nFor sides you get rice and string beans by default, but they have a selection of veggies that you can order. We  completely filled up on the meat, so we didn`t need anything extra.\nWine selection was good.\n\nOur waitress that night had been working there for 3 decades and she was super cool.", "author": "Gabor C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Food Coma - In a Good Way.\nYes, I know it's a bit after the fact....but I feasted on wild-game several times this winter at Henry's End and only now that it is out of season am I able to write about it.\n\nThe Food:  My last meal of the season was the Mixed Grill comprised of Kangaroo Kabobs (4+*), Wild Boar Belly (4*) and the Elk Chop (5+*).  I normally limit myself to the sublime perfectly cooked elk with the wonderful sauce reduction - but it was the end of the season so i splurged.  The Kangaroo skewers ( 2 of them) had bell pepper and what I think was pineapple pieces (apologies to the chef if i got it wrong - all of my senses were focused on my taste buds so my sight and memory are clouded).  I am not a big fan of pork belly, but i like boar - so I am going to leap over this.  Not as fatty as regular pork belly and perfectly cooked.  Nice portion too - maybe the size of a baseball diameter and about 0.75 inches thick.  The elk - well, i covered that above, but...while I am not much of a red meat fan, if you are gonna have elk, it's gotta be rare.  This nice-sized chop was perfectly cooked (rare - but warm all the way through) and presented in its own sauce and there may have been a bit of a puree plated to keep everything in place.  Nice job!!\n\nThe Wine:  Not a huge wine drinker (but I hear there is a marvelous selection from a buddy of mine who eats at Henry's as much for the wine as the food - T.S. - you know I am referring to you). I think the \"by-the-glass\" selection is just fine.  In the off chance that you order and don't like it, free substitutions are readily offered.\n\nWhy 4 stars and not 5 then...?  Guys, please, please, please....fix your side dishes.  Never ever ever have i been pleased with their presentation.  The colors, the family style, the whole thing...doesnt much matter because there is ample food (and wonderful bread)...but a little help here would be greatly appreciated.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "This restaurant is amazing. The food is delicious and the staff is friendly and accommodating. I got the southern fried chicken and it was some of the best fried chicken I've ever had!", "author": "Cole H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "I was trying to decide between a few restaurants in the area when I saw the menu at Henry's End and it really grabbed me.\n\nI appreciate that they have a good selection of beers, as I'm kind of a beer snob.  A Ballast Point IPA hit the spot.  \n\nThe butternut squash bisque was pretty good but didn't blow me away.  The pear, walnuts, \u0026 blue cheese chicken, on the other hand, rocked my world.  And the mud pie... outstanding.\n\nThis is my new favorite restaurant in New York.  It's too bad I live in California!", "author": "Ryan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "We frequently eat in Brooklyn because both our children and their families live in Clinton Hills. Because we were staying at the new 1 Hotel Brooklyn Bridge as part of an Anniversary celebration we looked for a quiet venue within walking distance. We rarely get to Brooklyn Heights but noticed the block of restaurants on Henry Avenue and selected Henry's End. We loved the ambience as soon as we entered. We had not made a reservation however they made a place for us in a secluded corner. The service was relaxed and efficient. Because of the menu's stress on game we shared the terrine, a salad and the duck. Everything was delicious and we paired the food with a quaffable wine suggested by the server. We finished with the Dark and White Chocolate Mousse. It was a totally wonderful experience and the walk back with the view looking over toward lower Manhattan completed the day.", "author": "Martin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "A wonderful neighborhood gem. The space is tight but the noise level is manageable and service is good. When in season, my husband and I always get the soft shell crabs with garlic basil butter entree with the wild mushroom salad starter.", "author": "Mimi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "The food is delicious, which we were expecting. The wine list was a spectacular surprise. Wow! The owner happened to be in when we were there and he was kind enough to tell us about anything on the wine list we wanted to know about. Henry's End is terrific!", "author": "Terra W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "You may have to wait for a table and there isn't quite enough room around the bar, but they will serve you drinks and allow you to stand there, as long as you are conscious of the need to get out of the waiter's way. When you finally sit, the food is pretty good to very good. I had a really tasty pasta dish, although they were out of my first choice. I tasted and also really liked the special of pappardelle with lamb. The garlic bread was good, as were the shisito peppers. Cash only! :(", "author": "Pamela S."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}