{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "I had heard wonderful things about this place so am truly sorry to say I was disappointed.\n\nPROS:\nBonnie the waitress\nCozy and friendly ambiance\nLobster with penne\nSalmon\nBread basket\nShrimp with andouille sausage\nReasonably-priced wine bottles\n\nCONS:\nDuck--wasn't fresh and skin was not crisp or tasty.  Huge disappointment.  Did they make the duck days ago and stick it in the fridge until someone ordered it?\nSouthern fried chicken--more like burnt and dry\nPersian lime pie -- blah!  Put in a ramekin and really boring.\nApple cobbler.\nClothes ended up smelling like food because of the open kitchen.", "author": "Katharine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "I've been living in Brooklyn my entire life (all 30 glorious years). How have I never heard of this place? How good was it? Let's just say that I scolded my husband in the restaurant for knowing of this place and never bring me here. The family dining next to us have been long time patrons, and appreciated this sentiment. \n\nThis restaurant is known for its wild game menu (the reason why my husband didn't think I would like the place). However, they have so many other options on the menu. Everything coming out smelled great. I had the spiced walnut crusted chicken with autumn fruit compote. I wasn't sure if they could pull this off. It was sensational. It was so flavorful. The texture was great. The sweet fruit with the savory nutty chicken made such a great team. I was extremely happy. I also ordered the side of mashed parsnips. Holy crap!! They were outstanding. This has been missing from my life for too long. I need to make this. My husband ordered the buffalo hangar steak with truffle fries. The fries were just ok. Nothing special. The steak was really good. I liked the sauce. Every dish come with a side of steamed broccoli and rice. It comes out about 10 minutes after your meal has arrived, but who's complaining? When we were unsure of the type of red wine we wanted, the waiter brought us samples of 2 types. That was great. We had the mud pie for dessert. It wasn't anything special. It was sort of like the Carvel birthday cakes. That's fine (who doesn't love the crunchies?), but it wasn't different. \n\nOverall, the place gets cramped, and packed if you're not in by 6. Fortunately, the early darkness in winter threw us off, and we thought it was later when we went in. This helped us get a table right away. Within 15 minutes however, people were being turned away. There was a waitress there who is pretty batty, and all over the place. I liked her. Reminded me of the good ol days of Brooklyn, before snarky hipster waiters and waitresses covered in ironic tattoos, started serving in restaurants until their art career takes off. I prefer the career waitresses of yesteryear. This restaurants screams real Brooklyn. It has a loyal following of longtime patrons. It actually reminds me of the kind of old time, exposed brick, quaint Brooklyn eatery that many new restaurateurs attempt to recreate, but fall short. One cannot simply put kitchy gold lettering in a window, with curtains, and old street signs, and assume they have a winning restaurant. This is the real deal. Not pretentious. Not trying to be something it's not. It's the O.G. of small Brooklyn eateries. We will be loyal patrons long after the Brooklyn trend has disappeared.", "author": "R A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Lot's of options of meats, delicious fish and shrimp, good wine options- love this place!", "author": "Saba F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Henry's End is the special-occasion place for my girlfriend and me. The service is friendly and accommodating; the food is excellent and interesting (not what's on offer everywhere else); and the bourbon and Scotch flights are a perfect end to dinner.", "author": "Mary O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-28", "description": "Regular menu good but I had high hopes for the wild game menu and I was a little bit disappointed.\n\nFor starters, the goat cheese salad was delicious. Mostly because I love goat cheese and the crispy pistachio crust was to die for. The Ozark short ribs were mouth watering delicious!\n\nHere is where it fell short - the wild boar ragout was not what I expected. It to be topped over a truffle polenta. The truffle polenta was the size a small ice cream scoop and it tasted like plain and bland polenta (where is the truffle flavor)? The ragout itself was ok. Not mind blowing. Soupier than I expected. The Wild game sampler also fell short. The Elk was overpowered by the mustard. \n\nI've been here only once, and the regular menu items were great (salad and ribs) but the wild game menu was a sore disappointment. I'd come back here, but probably wouldn't order anything from the wild game menu.", "author": "Olivia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "My favourite restaurant in the whole world for 15 years. Not a bad point in the space. Mark Lamm has created something absolutely incredible, and keeping his staff so long (Bonnie!, Albert! Ed(!!) ) is proof positive of a great environment. The salads, the soups, the Game Festival (Alligator, Ostrich, Shark, etc!). Throw a dart at the menu and start drooling.\n\n*update* my favorite restaurant in the whole world for 20 years.", "author": "BC G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-25", "description": "SOOO disappointed!!!  I have a Gluten intolerance but can still find something on a menu - especially with a little help from the waitstaff and/or the chef.  I asked about the preparation of a dish which turned out would not be good for me and the waiter had NO interest in making another suggestion or asking the chef (other restaurants have been amazing). I know my gluten issue is not the waiters problem but if the waiter at least makes an effort to help me find something to eat, I will tip bigger, refer them to others and write a nice review.  NOT the case here.  I settled for  grilled chicken ceasar (without croutons) because I felt like I was inconveniencing the waiter by even asking. \n\nIt sucks to have a food issue (this is new for me) but it sucks more to have wait staff that have no interest in making their customers dining experience a nice experience.\n\nWith all of the people who have different food allergies and issues; resaturanteurs, wait staff and chefs should educate themselves and be able to make everyone's dining experience a pleasant one.", "author": "Laura A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "I truly enjoy dining at this \"feel at home\" intimate restaurant with soft lighting and quiet reserved table conversations.  The service is wonderful and the food is fantastic.  I tried the fried chicken with mashed potatoes.  Amazing!  My brother frequents this restaurant (for about 10 years now), and he loves the Lobster Ravioli, Lamb, Soft Shell Crabs.  They have an excellent wine list, and this is a great place for a first date or just to catch up on time missed with old friends.  Make sure to try the dessert with the icecream block and caramel (can't remember the name) and some coffee!  You are treated very well by the hosts/hostesses/servers here.", "author": "Crystal P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "OK.. first let's start on the service. it was mediocre and hence her full $4 tip. I appreciated the person who bust my table, he got $6.. now the food.. it was good.. my mom ordered the duck, which was soo fatty.. which was weird.. she didn't love it. I got the lamb which was great.. the shrimp n guac was amazing though. Amazing. my dessert. OMG. O.M.G. the 21 layer crepe is to die for. it has to be the best thing on the earth. so food overall is a 4.6ishh.. that service def dropped it to a solid 3, but that dessert brought it up to a 4..", "author": "Toya H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-02", "description": "I am really confused.  Rarely do I feel like Yelp totally led me astray as much as I do in this case.\n\nI went here with a group of 5 last night, excited by the solid 4 star average among 100+ reviewers who generally expressed that this place was a gem.  But... this place was far from a gem.\n\nThe decor is simple and casual -- but I expected that, so I'm not deducting any points.  What fell short, or flat, was the food.  It really wasn't very good *at all*.\n\nAmong the table we got the penne with butternut squash and anchovies (good, not great, too peppery and kind of greasy), the tuna tartare (verdict was \"fine\"), the Ozark ribs (good but nothing mind-blowing), and the pistachio crusted goat cheese salad (good, but standard fare almost anywhere... fine.)\n\nFor entrees, I got the duckling with wild mushroom lingonberry sauce -- a dish which the waitress told me was her personal favorite and, she thought, the best thing on the menu.  Verdict:  this was soooo uninteresting. It was all savory and rich with no nuance, no subtlety, no real flavor... It was sad.  and the portion was HUGE, a whole side of duck, an almost unappetizingly large portion -- they deliver you a whole plate just saturated in brown gravy. It was not appealing looking, or tasting.\n\nAround the table, people had: sole citron, salmon morrocan, the honey/ginger duckling and the steak diane.  The salmon was picked at and basically left on the plate, the sole was politely described as fine and my husband said the steak was something he thought he could make himself (except if he'd made it, the steak wouldn't be as tough.)\n\nBesides flavors, there is absolutely zero presentation when it comes to the food.  All the dishes come with the same sides: rice pilaf and vegetable of the day (in our case green beans) which were served on a smaller side plate.  The main dishes are served on large plates, heaping with sauce, with no attention to plating or attractiveness.  Anything with a sauce was basically drenched in it to the point that the food was no longer recognizable (this was true for 3 of the 5 dishes on our table).  \n\nThe most damning note, as we walked out the door my husband whispered in my ear: \"Let's not go back there.\"\n\nAnd, sadly, I don't think we will.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-18", "description": "To be brief. Had high expectations. None of these met.  Food was gloppy, overcooked and way over sauced. Of 5, only one thought food was good. Also, we were near the open kitchen and it was unacceptably hot, like sweat-inducing hot. Not pleasant. From chicken, to crabs, to steak, the food got a big meh.  Would not return.", "author": "Nor R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "Wow! Crab corn cakes and Bar-b-que shrimp appetizers, off the charts duck and lingonberry sauce, shrimp and grits and amazing chocolate desserts. Yes, I know that that's not a complete sentence. Whatever you grammatical snob, this place is a gem.", "author": "joshua k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "This place is a little pricy, but perfect for a special occasion or date night. I had the $30 pre fix menu, but my appetizer and entree choices cost more. The crab cakes were pretty good, but the swordfish was some of the best fish I've ever tasted. It came in a flavorful, tangy sauce that was great to dip your bread in. For dessert I had the mud pie, which was great but my husband got the Mrs. Mud Pie which was even better. I'd definitely come back to this", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-16", "description": "Excellent ! Have been visiting for years Mark a perfectionist overlooks every detail . Service makes you feel at home. Pear walnut and blue cheese chicken ,soft shell crabs garlic basil sauce and if you like  sothern fried chicken try it here . Henry's is a favorite try it you'll like it. Tell Mark Charles The Realtor sent you.", "author": "Charles D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "Good food good service good drinks. That's it\n\nA bit of an older crowd though", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "Wow, I just feel stupid for having not eaten here before.\n\nWe went for Christmas Eve dinner and had one of the most delicious meals we've had during our 7 years in NYC. I had a shaved brussels sprouts salad that sounded tame but was fantastic- light and flavorful and a nice big portion of veggies. The sole in lobster cream sauce was absolutely fantastic- perfectly done fish and lobster and well-seasoned. The lamb was buttery-tender and had a super-flavorful rub that managed not to overwhelm. \n\nAlso worthy of note was our kind and funny waitress (whose name started with a B), excellent service from someone with a personality is always a plus.", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-03", "description": "Went to Henry's End for their infamous Wild Game Festival.  It did not disappoint.  There was enough variety and interest, the meat was all cooked well.\n\nFunny thing is all my friends liked my dish the best and I had the most \"normal\" dish one could get.  The Buffalo Hangar Steak...but it was DELICIOUS!\n\nThe staff was helpful and pretty attentive.  The place is small and gets packed, especially for the Wild Game Festival.  We had originally made reservations for more people but the host was accommodating.\n\nAll in all, a good experience!", "author": "L Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Fantastic food- the fried chicken is nuts!!!!!!! Tables are a little close together but makes it cozy.  Great for the winter as they have very hearty food.  But great variety on menu for entire year.  Make a reservation they are packed every weekend.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "Yelped this place last Monday after walking across the Brooklyn Bridge from Manhattan to Brooklyn side. It's really random picking but turned out to be a very fun night! \n\nStarter: my friend got a bean soup and both of us got a mushroom salad. very tasty and freshly good!\n\nI had a lobster pasta which is so creamy and irresistible! I generally don't eat creamy stuff but this time, i almost finish them all coz I just couldn't stop eating!\n\nWill def go back and try some other stuff!", "author": "Grace G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-22", "description": "I went to Henry's End on a Saturday night with my boyfriend and his parents who were visiting from Mass. \n\nThe food was (mostly) great. I had the salmon Moroccan, and it was fabulous. like the best meal I've had in a lonng time. His parents both had the salmon with herb crust, arugula and roasted beets, and they seemed very pleased. My boyfriend didn't love the veal lemonese - he said the veal was great but the sauce was terrible. So 3 for 4. Also, his mom complimented the owner on the way out on the excellent coffee - so there's that too.\n\nTwo things to note: it's really loud and really hot in the restaurant. The place is a long narrow dining room, with the kitchen along one of the long sides. This makes the heat from the kitchen engulf the dining area.  His parents didn't seem to mind the loudness too too much, although they did mention it. My parents probably wouldn't have appreciated it.\n\nAll in all, a good time. We also were late for our reservation, and when we called to warn them they were very understanding.", "author": "Jody W."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}