{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-03", "description": "I think I went in with some high expectations but unfortunately my evening at this restaurant did not meet those expectations.\n\n My date and I opted for the pre fixe menu. We started with the linguini and the crab cakes. The first was way too salty and the second was just ok. Entrees were not much better. The sliced pear was the best part of the chicken dish and the Duck while crisped well was only  saved by the sauce. They came with no sides so we needed to purchase them separately.\n\nFor dessert :The Apple cobbler lacked sweetness to balance the tartness of the apples and the crumble topping. \n\nThe highlights of the evening were the bread and the bread pudding. Service was good and attentive.  I think even if I had not gone in with expectations, I would have been underwhelmed. I tried it but I will not be returning.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Excellent restaurant!  Try the walnut crusted chicken with pear its exceptional. Helpful and knowledgeable staff!  Save room for dessert you must try the 21 layer crepe cake!\nWhat a great find in Brooklyn Heights!", "author": "Linda P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "Not a bad choice for a $$$ dinner in the BK Heights hood. Super friendly service, and the space is very welcoming. Food was nothing outstanding, but the overall experience was enjoyable. \n\nWe ordered the special - soft shell crabs - which were small, but had flavor. The side of green beans and rice wasn't necessary, as it tasted like canned beans and Rice-A-Roni.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Definitely one of my favorite places in Brooklyn. I fell in love with the place on my first visit. Their fantastic steak was very reasonably priced, and the service was outstanding.", "author": "Jung Ik Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Henry's End is basically a Heights institution - continually in business for 40 years, which is basically an eternity in this competitive market.  It's the antithesis of the trendy newcomer with reclaimed wood walls and gleaming subway tile lined open kitchen.  Expect to walk in and see locals, populating the worn but cozy dining room, decorated with the random bric a brac and the odd blaring neon sign on the wall.  \n\nBF and I stopped in last night, specifically to  take advantage of their in-season  soft shell crab offerings.  When we saw that they offered a $35 prix-fixe menu WITH soft shell crab, we decided to take advantage of that too.  I'm ashamed to say, that last night was our very first visit there.  Totally ashamed, since I've been a Heights resident for about 5 years now. \n\nFirst of all, do not order from the prix-fixe, if you're just moderately hungry.  I mean, if you've had a late afternoon snack, or a heavy lunch, you just won't be able to do it justice.  You'll need to have a roaring appetite to fully take advantage.  \n\nThe food -  \nSoft shell crab linguine with spring onion app.  This was soooo delicious. It probably had at least a half stick of butter in it, but I was very satisfied.  The portion was very generous, about 75 percent of a normal dinner portion.  I think I might just go back for this and order as a dinner.\nCrab cake app - There are two nicely sized cakes with very thick but crunchy breading accompanied with tartar  sauce.    Very meaty, though I don't think it was premium crab meat.  I tend to like my crab cakes less bready, but they were still tasty.\nDuck - To say my breast was huge, would be an understatement.  Ha, the duck, not mine.  But seriously, I don't think I've ever encountered that portion at a restaurant before.  Prepared with a nice and crispy skin, and sauced generously with a ginger jus. A touch too sweet for my taste, but still good.  I managed to finish half, and ended up doggy bagging the other half.\nSalmon - Very nice size, served with a beet salad and a horseradish creme fraiche.  Tasty, though I think maybe a touch overdone for me.  \nSides of rice and snow peas, What, more food?  \nDesserts totally put us into heartburn territory, but the mud pie and lime pie were very good, albeit decadent. \n\nThe drinks - they offer a great selection of wine and beer.  All are reasonably priced. I was happy with my fume blanc.\n\nThere is an upcharge on some the items - Salmon and duck were $5 extra, and the linguine was $2 more.  But so worth it. \n\nI'm totally going back next week for some more soft shell crab linguine.  Mmmmmm.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "I come here whenever I come to Brooklyn. I want to try everything on the menu and I have never been let down! Everyone who works there is fantastic and really knowledgable. Can't recommend this enough!", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Had concert tickets at the Barclay's and saw the Henry's End was just a short cab ride from there. The Yelp reviews are spot on. This place was great! Service was quick and super friendly. Love the open kitchen. There is something different on their menu for everyone to try. The duck, lamb and walnut crusted chicken were among the favorites in our group. The pre fixe menu has a large variety of choices and is really reasonable in price. Definitely recommend.", "author": "Shayne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Very tasty food, if a little on the pricey side, and great service: we had to wait 5 minutes for our table to be ready, so they gave us all a free drink! One of my favorite places in the neighborhood.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Bottom Line: Superb dinning with exotic meats cooked to perfection\n\nI love this place. I've been here several times and the restaurant is on my top 10 places to take a date. First off, you're in the heart of Brooklyn Heights - where you get the Brooklyn Promenade and a quaint little community.\n\nThe food here is not good but GREAT. As a fan of wild game, I think the food here is cooked perfectly. Do you want your Buffalo steak, duck, or lamb chop cooked medium rare? Well then come to Henry's End because they know how to cook it. Also, for all you non-Meatatarians, they have a pretty good list of fish dishes to check out as well such as Sole with Lobster :).\n\nNot only is the food good but they also have a great wine list that's worth checking out. My friends and I have found several new bottles that we buy on the regular now.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "One of my favorite restaurants, period.  Luckily I live very close so I get to experience it on a regular basis.  Henry's End is the type of place that a New York Times critic would come to every week but would never write about because they want it to be a secret.  This restaurant doesn't need any extra notoriety though as they've been open for 33 years. Between the food and the extensive wine list, this place is top notch with no frills.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "A wonderful dinner for the four of us this evening:\n\nStarters:\n+ Maryland corn \u0026 crab cakes\n+ Lobster penne\n+ Goat cheese, greens, and beet salad\n\nMains:\n+ Crispy duck in strawberry sauce\n+ Pistachio-encrusted chicken breast with pears\n+ Veal with Brussels sprouts \u0026 pancetta\n+ Pumpkin seed-encrusted chicken with avocado/mango salsa\n\n+ A nice bottle of Chenin Blanc\n\n+ And a delicious Kahlua, chocolate, and coffee \"mud pie\" to share", "author": "Phil F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "I had an amazing dinner here! They have a fantastic prix fixe menu that hit the spot just right!", "author": "Heather C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Awesome neighborhood institution.\n\nThey really focus on the food here (go figure!) It's not rushed, it's not trendy it's just really thoughtful, delicious food. Great variety from pasta to steak to fish to shellfish to pasta and more. Really creative takes on the food, but not in a pretentious way at all -- which was refreshing. \n\nSpace is very cozy and feels as local as it is.\n\nThe service didn't deliver on the quality of the food or neighborhood feel -- but the food was so well done we were able to overlook it.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "By far the best dining experience in Brooklyn. Not too expwnsive, and definitely worth it.  Whether it's date night or a small group gathering, it's fantastic...and you get a discount car for your birthday!", "author": "Michael O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-24", "description": "This review should be taken w a grain of salt because we came on Christmas Eve and they had a set menu, so options were more limited. We had pretzel rolled shrimp and turtle soup as appetizers, and duck w sour cherry sauce and venison stew for entrees. \nWe also both had key lime pie for dessert. \nI came with high hopes; I hadn't been for many years and remembered it being a kind of mystical place. \nI also thought of it as possibly a destination restaurant. \nI'm sad to report that none of any of our dishes were remarkable in any way. The duck was a bit dry and I've had many duck dishes that were better, my venison stew was way too salty. The turtle soup tasted like chili, there was nothing particularly interesting about it. The shrimp were good but, again, we did not have a \"wow\" response to any of the dishes, including the dessert. \nThe service was generally good but the server initially was pretty brusque. It looked like she had left another table hanging for too long and wanted to hurry with us so she could get to them. Although after that first exchange she was fine. \n\nAnyway, despite the Luke warm review I feel like I need to go back on a non-Xmas-eve night to see if I just caught them on an off night. If you're thinking about going don't let this dissuade you. \n\nJust think twice about Christmas Eve.", "author": "Launch S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "Been here a few times over the years most recently a month ago and always love the food and the wine.  The last time I came with my family and every one of us loved our meal.  I had duck which was great.  brother had steak - also great.  don't remember the rest of the order but all good and a nice wine recommendation from our server who was just the right balance of attentive and friendly without being too in our faces.  The room is small and can get loud when they are crowded but otherwise it's a lovely place.", "author": "Jen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "The Best restaurant in Brooklyn Heights!!!!\nMy family and I have neem going there for over 10years!!\nEvery time it gets better and better.We love Bonnie.\nMark as always very a great Host ,everything perfect  and I cannot say enough about the food !Always excellent ! as are the wines and desserts.\n\nMake sure to be ontime for your reservations as thet fill up quickly.", "author": "Bella B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "I love this place ..small and cozy with great service.the jalapeño margarita is fantastic.. I would definitely recommend Henry's end", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Peter is the man. He really knows his beer and takes bar-tending very seriously. \n\nTiny beers during the summer changed me into the person I am today. Can't emphasize the tiny beers enough. \n\nTry the nachos. Good for after a walk across the bridge.\n\nClassic NYC bar in a great neighborhood.", "author": "B C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Lovely spot, warm, welcoming, conveniently near subway \u0026 DUMBO. \n\nThey had noted our request for a quiet table \u0026 accommodated, friendly--and efficient--service (those don't always go together). Everyone enjoyed their food, vegetarians meatitarians (?) \u0026 undecideds. Steak, duck, gnocchi, salmon and a remarkable, if slightly sexist, Mrs. Mud Pie.  Menu offered an almost confusingly wide selection of options, but amazing meals came out of that small kitchen. \n\nAnd the capper of the evening was one guest walked out with doggie bag and gifts from friends \u0026 left purse behind. A frantic call 20 minutes later gave the reassuring news that it was there \u0026 would be waiting. Whew!", "author": "Harley M."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}