{"aggregateRating": {"reviewCount": 338, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "Let me start off by saying that to read through all these reviews you kind of get the sense that you were about to walk into a wild animal cowboy house with deer heads on the wall. Not at all the case. They just happen to have an amazing food selection in the winter that is called the wild game festival. It's classy and intimate.\n\nThat said, I lived in Brooklyn Heights for 7 years (oh Brooklyn, how I miss you!) and spend most of my expendable income on food and wine. I believe that some of the most incredible restaurants in the world reside in NY and this is my favorite restaurant in all of NYC. \n\nThe owner, Marc, is an incredible and kind host. Bonnie is a wonderful friend and waitress who thrilled my boyfriend by calling him 'Darling' and giving us both kisses when we walked in.\n\nMy very favorite things on the menu by far are the Turtle Soup and, and I know this sounds so boring, the Chicken Lemonase, but I've never had another entree at any other restaurant that with every single bite I close my eyes and am in heaven.... Still happens after having this dish at least 20 times.  As a graphic designer i even asked Marc once if I could do the logo for his new wine bar down the street (also really great) and only be asked to be paid in Chicken Lemonase. No joke.  \n\nI've moved to NJ but we still head to Henry's End for every special meal, anniversary, bday, etc.", "author": "abby s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "My husband and I have been looking forward to trying this place for a really long time, but we were a bit underwhelmed by both the food and the service.  We had to wait a long time for the waitress to come around and take our drink and food order, even though we were there when it was still fairly early and empty.  We also ate with our toddler and it's always a pet peeve of mine when the kid's food comes last.  It shouldn't take longer to cook pasta than it does to make a sole with lobster and mushroom sauce.  Overall though, the food was pretty good, but many of the dishes are drowned in sauce.  Personally, I enjoy a lot of sauce but it can be a turn off for some.  I would give this place another try during their \"wild game festival\".", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "I love Henry's \nThe food is consistently great. The staff recognize me, or at least do a great job pretending to, even though I only go there 2-3 times per year. It is elegant and classy but reasonably priced, especially for the quality. \nThey always have a great and changing wine selection. \nPlaces like 600 R\u0026D cost twice as much and are not half as good.", "author": "l w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "We moved away from Brooklyn Heights 30+ years ago and despite frequent visits, have not been to Henry's End since then.  Back then our principal gripe was glacially slow service.  We gave it a try last night and were pleasantly surprised to find the service much improved.  The food was excellent.  I tried the gnocchi with wild boar ragout while my wife had walnut crusted chicken.  Both were fine.  There was a good number of reasonably-priced wines by the glass, too. Happy to be able to recommend the place.", "author": "George M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Love this little place! Great atmosphere, space is a little tight but hey that's NY, everything in NY is vertical. My wife and I came here with another couple and we were all raving about our meals for the next couple days. I lived in BKLYN Heights for ten years and never ate here, moved away and came back for a visit and now I wished I had tried it out while living here. Highly recommend to others and will be visiting again the next time I'm in BKLYN Heights.", "author": "Mark R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "My boyfriend found out this place had a wild game festival starting up in the fall and we were patiently biding our time to check it out. I happened to be home now for a few days so we decided to drop in on friday, they did not have the elusive Kangaroo on the menu but we figured there would be other exotic enough things on the menu for us to order.\n\nIt is a pretty small space, we got there at around 7ish and it was a bit crowded with an early dinner crowd, luckily there was no wait. There were different wine specials around the restaurant on dry erase boards...the half carafe apparently gives you about 3.5 glasses but for the pricing its worth it to get a whole bottle if you are going to not bother just getting a glass at a time.\n\nSo on to the food, of course we had to get the turtle soup since there were so many rave reviews about it, we also decided to try to the game charcuterie plate. The turtle soup was perfect to me without having to add the splash of sherry and it had a bit of a kick to it, I enjoyed it and would recommend getting it. The charcuterie plate was so so, it included a spicy buffalo sausage which was not to bad, a pheasant sausage which was excellent (although I was trying to get away from the pheasant since I am in South Dakota right now which is apparently the pheasant hunting capital of the world) and a country game pate which I have no idea what was in it but it was cold and had bits of carrot in it...not that great. There was a spicy mustard and some sort of jam that went good with the sausages.\n\nOn to the main courses, my boyfriend got the mixed game grill which this time around included the elk chop, venison sausage and wild boar belly and I got a half portion of the penne with rabbit sausage. We did not get a heads up about how the meat was going to be prepared so the elk was served up quite rare...so rare that there was a little river of blood flowing into the gravy, it did not detract from the taste which was excellent but it would have been nice to have a bit of a heads up about it. The elk chop also had some kind of a mustard coating on it which was very good it was the highlight of the plate, the venison sausage was fine and the boar belly was very good it had a pistachio and cranberry dusting with an essence of bacon to it, I also enjoyed that. The pasta was pretty good as well it had some sort of spice to it and the rabbit sausage was good, the pheasant sausage definitely was the winner of the sausages for the night. \nI also agree that the veggies and rice were quite uninspired and looked out of place, it seemed to have been thrown in just to give a \"side\" -- the meal would have been fine without it. We did not sample dessert as we were quite stuffed.\n\nI am not sure that we would go back again since it is out of the way for us but it was good to go once and the meal was not disappointing pretty reasonable in price for what we got.\n\nFYI on wild game from my experiences - Reindeer aka caribou is not as tender as venison.  Antelope and venison are pretty much the same, antelope are a bit smaller so they might be more tender. Pheasant is similar to duck in that is is kind of a darker game bird. Rattlesnake is a paler meat and kind of tough and does not really taste like chicken. Buffalo is very similar to beef but you should get it as rare as you can take it.", "author": "Angela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "Atmosphere wise, Henry's End has a dim casual bistro setting - it was a little on the loud and crowded side.  As for the service, I believe we had Bonnie, who was, um, interesting - it's a very casual serving style that I could see bothering people who are a little, um, stodgier than my wife and I.  This is not a pretentious place.\n\nMy venison dish was the highlight of the experience - absolutely succulent, not at all dry.  Unfortunately, my wife's sole citron was not as memorable, so if we head back we will probably stick to the game.  As for the wine, they had an excellent Columbia valley red by the half liter.\n\nJust a solid neighborhood bistro - I will have to try the game again, as this place might warrant five stars.", "author": "Ed W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "Great food. I love the wild game festival menu! The staff is also knowledgeable and friendly, especially about wines and whiskey. The food is decently priced and well worth the money. If you sign up for the birthday club you get a gift certificate that takes about $25 off of your bill. Highly recommend it!", "author": "tanichea b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "Do you sometimes get an intense, primitive craving for something, and you absolutely can't rest until you get it?  \n\nIs that something kangaroo?  \n\nIf the answer to the above questions were \"yes\" and \"yes\",  Henry's End is your place.  They have one of the most extensive game selections I've seen, and have a whole menu section devoted to duckling!  \n\nTheir non-gamey menu, which I stuck to last night, is pretty impressive too.  The blood orange and goat cheese salad was light and fresh, nicely counterbalanced by the West Indian BBQ shrimp I had for my main, which was smothered in possibly the best BBQ sauce I've had.  Seriously!  After the shrimp were gone I think I ate like 4 large pieces of bread just trying to sop it all up and get it into my belly.  Also tried my friends' penne w/ lobster sauce (DIVINE) and fried chicken (WHOA).\n\nI'm so excited Henry's End is so close to my apartment--it's the kind of place you want to go back to over and over again and try everything on the menu.  Next time I'll definitely have to get my game on.  Wow.  Worst joke ever???", "author": "Becca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-13", "description": "Bonnie our waitress made us feel like we were family!  The soft shell crab was incredible, the pecan crusted shrimp  the spicy ribs were great too! We got veal, steak, and chicken all of which were incredible suggestions from Bonnie.  Definitely recommend this hidden gem!!!", "author": "Jesse C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "The eastern end Henry Street, cleaved between the established brownstones of Brooklyn Heights and the industrial but refurbished BUMBO neighborhood, can claim some of the best, seldom discussed restaurants in Brooklyn.  Running parallel to Smith Street on a map, it runs nowhere near it on the radar.\n\nIt's just a quick walk for me whereas Smith Street means a trip on the subway or bus, or some pedestrian ambition.  Having cycled through each restaurant between Middagh and Clark, I finally wandered in to Henry's End whose façade and name connoted a dive bar.  The \"wild game festival\" menu hanging in the window from October until March persuaded me to make a reservation.\n\nEstablished in 1973 as a local hangout and burger bar, Henry's End inherited that frowzy atmosphere, but chef Mark Lahm worked his way up the restaurant brigade, starting as a busboy and moving through the front of the house.  Eventually, Lahm attended the CIA and took over Henry's end in 1986.  Somewhere along the line he developed a taste for game.  Venison, quail and buffalo are found in many restaurants, but elk, rattlesnake and turtle are a bit harder to come by.\n\nThe exposed brick and slate tabletops give Henry's End the kind of masculine feel that stuffed heads and other taxidermist bric-a-brac can muster in places like Freeman's and Trophy Bar.  The wine list is as steroidal and bold.  New World wines from California, and South Africa feature as prominently as  whites from Oregon and Washington state.  A 2005 Napa Cabernet Sauvignon (Panacea) was painfully bold, but a Stag's Leap of the same appellation was velvety enough to enrobe a meal of mushrooms, game and chocolate.\n\nA meal can easily become a feast.  Ordering a couple of salads to whet our appetites, my beautiful fiancé and I were surprised a large plate piled high with large cubes of beets, whole pistachios and enough chevre to fill out a healthy cheese board.  The dish overwhelmed and even threatened the sanctity of an evening out; meanwhile, a mushroom salad tossed with walnuts and perfunctory greens deceived the stomach but warmed the palate with the image of the hunt.\n\nNot that any great hunting is taking place at Henry's End.  Ostrich comes to Brooklyn by bridge and tunnel.  Quails come us from Georgia, perhaps with the Braves when the play the Mets.  Stuffed with chard and pomegranate, the tender foul is juicy but the greens added a bitterness that fought against, rather than accentuated, the sweetness of the dish.  \n\nThe wait staff is well trained and polished.  The rolled up sleeves of their denim shirts reminded me of trips to Lake Tahoe and the sporty waiters who looked like LL Bean catalogue models, yet at every point in the meal I was attended to and never bothered.  As I began to enjoy an herb-crusted elk chop, I noted how fine the cutlery was.  Much leaner than beef and pork, the sturdy knife was helpful.  The herbs, largely parsley, some lemon zest, peppercorns and breadcrumbs were fine, but I detected a bit of complacency in it.\n\nAcross from me, I noticed a fine fillet of salmon in a \"three mustards\" sauce being pulled apart by a fork.  A side of garlic mash potatoes was, as the waiter promised, worth the price of the dish.  The mustard sauce was deficient though.  It was simply lathered across the flesh, it seemed, rather than part of it.  While nicely composed, it failed to register anything but satisfaction, if somewhat limited.\n\nThe finest dish was an antelope au poivre.  I expected little more than venison, but antelope in this fashion had the gaminess of wild boar, the texture of beef and the sweetness of the best pork.  Lean but succulent, the green peppercorns leached a little more juice from the bone-in steak.  \n\nWhile everything was well handled and the kitchen operated with timeliness and care, the desserts were disappointing.  A Fonseca Vintage Port capped a nice meal but the Mud Pie that was recommended was served on an icy plate but topped with hot fudge.  As anticipated the fudge become little more than troublesome tar.  \n\n10pm feels late at Henry's End.  The crowd thins out dramatically and we were left with espressos and the chattering accompaniment of four expatriated Italians.  Stuffed and exhausted we left to views of the Brooklyn and Manhattan Bridges.  It's not an every night place, or even a monthly spot but once a season it is well worth it.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-30", "description": "We went to this restaurant with friends. The food was above average in New York standards. Crab cakes were delicious but can't say the same thing for the main course. It is decent food but for the price I pay for it, I know way better places. (But then again, I am from Paris, I might have high expectations). I guess the ambiance and the attitude does not help. The place looks dirty and, avoid the tables in front of the restroom, because, boy it stinks. I guess they make enough money to renovate. Also, both waiters were plain rude. I won't return to place where I don't feel welcome.", "author": "Daisy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-15", "description": "Service = okay. Atmosphere = quaint \u0026 romantic. Price = Overly expensive. Food = minimal \u0026 typical. Boy, was I disappointed with this place. My major complaint was with quantity of food served. I ordered their short ribs, which was certainly a mistake-- the entrée consisted of 3 small, half-dollar sized pieces of beef served over a half cup of mashed potatoes and 3 pieces of broccoli. Did they think they were serving food to a toddler? For $22.95, I expected ALOT more. As for the meat itself, it was tender, but the gravy tasted like packaged instant gravy. The mashed potatoes were typical but served mixed with wasabi or horseradish, which really added nothing special to the mix (in other words, they were bland)... plus, they weren't even creamy. We did order the crab cakes appetizer with our meal, and it was flavorful, but, again, they were quite small. Note that if you order them, they are deep fried and not pan fried or baked, so they aren't really flaky like you find in most restaurants. Nonetheless, they tasted fine. Vinny ordered a strip steak smothered in a mustard sauce. The portion size for this was a little better than the other items we ordered, and he said the steak tasted fine.  All in all, our experience was mixed, with Vinny liking the restaurant more than me. But, oh how I wanted to fall in love with this place b/c it's close to our house... but I was mostly disappointed.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-14", "description": "This is a 2.5 star rating.\n\nIf you do go, make sure to bring a shoehorn with you.  You'll barely be able to slip a sheet of paper between you and the table next to you.  The waitstaff will be knocking into your back as they squeeze by.  This could be cozy and charming, or annoying, depending on your mood.\n\nThey also need to invest in a better ventilation system. The was a cloud of smoke hanging over the restaurant from the open kitchen when we entered .\n\nOK, now that I got my kvetching out of the way, some good stuff:\n\nThe entrees are very meat based, and good.  The duck is well prepared, moist, crisp skin, not fatty, and they have a nice chicken dish with nuts, pears and blue cheese that's very tasty. They also cook exotic meats like kangaroo, elk, gazelle, and boar, if you like game.\n\nOk, now back to the kvetching:  You get a plate of meat, and you're supposed to get rice pilaf and snap peas.  Those showed up a few minutes later sharing the teenist plate. I could practically count the number of rice grains provided--also, it didn't seem to be pilaf, just rice.  I usually love snap greens, but these were overcooked and way too oily.\n\nThe by-the-glass wines are lacking.  I read about \"Kung Fu Girl\" Riesling in some food magazine, and saw it on the wine list by the glass, decided to try it and was very disappointed.  Though they do have Wiemer on the menu by the bottle, which does show the owner knows his rieslings, which makes it even more of a puzzle why he allows Kung Fu Girl?\n\nThe 21 layer crepe cake is tasty, good coffee, and the service was friendly.\n\nIf you like wild game, this place might be your bag, but since it's not mine, I likely won't be back.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-23", "description": "By far one of my favorite restaurants in Brooklyn! The specialty here is wild game which I've never had, but my two favorites are mouth watering! The mustard sesame crusted seared tuna and chicken with goat cheese and pears, OMG! They also have quite an impressive wine selection where you can order by the class, 1/2 carafe, full carafe and bottle. If you go into the bathrooms, there are a ton of write ups on the wall about the place and the head chef/owner who is now always up front greeting the customers! Everyone is extremely friend and knowledabe.. \n\nThe place is small, but that's what makes it so cozy and intimate. I love the atmosphere, food, wine, service... everything.", "author": "Helena G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-20", "description": "Just went here for a dinner on a Thursday night.  My lady and I had: \n- horseradish crusted shrimp (3 tasty shrimp for 10 bucks) - a little pricey, but good.  \n- A half order of Penne w/ venison sausage (the sausage was very good, though I would not order pasta here -that is just the Italian in me.)\n- The 5 spice blackened Shell steak w/ apple compote (which is served cold, I think it should have been hot)- Good stuff though\n\nand the big winner of the night was the \n\n- DUCK.  we got the berry and mushroom sauce.  This was up there with the best duck I have ever had.  Cooked perfectly, lots of meat, crispy skin.  The meat pulled away in shreds and was not overly fatty.  By far the best dish we had.  \n\nThe service here is very good and the wine list is good too.  Okay, this was not the most clever review - but you got to hear what we had and now you know to get the duck.... enjoy!", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "We have been coming here almost weekly for 26 years, and the food is always excellent. Marc, the owner, works most nights, and greets his customers like they really matter. He has a happy crew working for him, some since the restaurant opened. You can not get a meal that is not wonderful here.", "author": "Fern F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-07", "description": "Mediocre, particularly at these prices. We had 5 dishes and none... really, not one, was interesting. We started with a salad and moved on two chicken dishes which were just bland. The dessert (perhaps called the Mrs Mud - second down from the top of the dessert menu) was honestly TERRIBLE. It was a rock hard block of Heath bar ice cream and absolutely not worth it. I never return food, but I should have returned it in all is icey, flavorless splendor.  I want to like Henry's End. I've always hears great things about it but for this price,they need to do better (like a lot better).", "author": "Sara G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-19", "description": "So I went back, and wasn't too impressed. My final impression is that this place provides more \"homey\" food with uncomplicated tastes and above average preparation, but it's nothing that gets me excited (other than the fried chicken).\n\nDropped from 3 stars to 2 stars, and I won't be going back.\n\n------------------------------------------------------------------------------------\n\nEdit:\n\nOk, so I think I was a tad bit harsh on my removal of a star. I won't be recommending it all that highly, and I won't go back myself, but if I ended up there for a party I could find something to make me happy. They need to stop with those shitty vegetable and rice sides, though. Some simple changes would make some dramatic differences.", "author": "Adam D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-07", "description": "Gone downhill. Was there a change in ownership? Our two entrees were thickly breaded, over sauced, glorified diner food.... Friendly staff.", "author": "Shep S."}], "servesCuisine": "American (New)", "priceRange": "$31-60", "name": "Henry’s End", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "44 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gYN0_4TwvFrdait3-gqYqw/ls.jpg", "@type": "Restaurant", "telephone": "+17188341776"}