{"aggregateRating": {"reviewCount": 21, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "24 hours. Quality sandwich making. Excellent selection of snacks, drinks, and beer. Nice guys. \n\nThis is just about all I can ask from a local deli.  \n\nWhen it hasn't been my day, my week, my month, or even my year, I know Smith Gourmet is going to be there for me.\n\nThey'll be there when I need a chicken cutlet sandwich at 2 am. \nThey'll be there when I need a bacon egg and cheese at 11 am.\nThey'll be there when I need some Tate's cookies and milk.\nThey'll be there with wraps and smoothies if I'm feeling \"healthy.\"\nThey'll be there when nobody else has Guinness draught cans, because the bottles just aren't the same. \n\nThey'll be there for me when the rain starts to pour. Like they've been there before.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "Amazing!! Everything you expect in a NY deli. Portion sizes are generous, coffee is good and selection is excellent!", "author": "Christine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "The owners and staff are so kind. When they ran low on stock of oat milk which is the only milk my son drinks, they brought more from their Williamsburg store and called me to tell me they had done so. I am so appreciative of them.", "author": "Tatiana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "Don't be deterred by the lack of reviews ! This is one of the best delis I have been to in New York ! The people who work here are all very nice and the quality of the food - both packaged and fresh - is higher quality than average. \n\nThe deli is located on Smith street, only a short walk from downtown Brooklyn. Nearby are a bunch of coffee shops and sit down restaurants so the area is perfect. \n\nThe wraps here are huge ! They definitely do not skimp on anything ! I've been ordering chicken wraps and always get a large portion of chicken. I am excited to try a breakfast wrap/sandwich next time I go !", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Great place! Has a lot of fresh options. \n\nYou can order a sandwich or build a plate. They have lots of snacks and drinks to choose from as well. \n\nNot a lot of seating but this place is one of the best delis in the area.", "author": "Shayna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Easily my favorite deli in Brooklyn, if not all of New York. The sandwiches are always made with a lot  of meat and are all reasonably priced. My go-to is the At The Beach on a whole wheat hero.\nPast the deli (which is the main reason I frequent this spot), they have an awesome selection of beer that is not as easy to come by in the area as one might expect. I'm from upstate so I'm used to Wegmans where everything from everywhere is at your fingertips. \nTo top everything off, the guys running this spot are genuinely great people and recognize their regulars. They will customize your orders to a reasonable degree without charging you extra and they are always on their game--working double-time to get every order done in record time. I cannot speak highly enough if this deli. I would give 6 stars if I could.", "author": "Mitchell B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Yum! Big sandwiches, quality ingredients and good prices.  This is the type of deli that you go in to order a sandwich or salad, but there is no place to \"dine-in\".  Give yourself a  little time during rush hours as they take the time to make phenomenal sandwiches.   I was super impressed and will be back!", "author": "K W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Good \"red\" juice - fast, no frills - the green apple element adds bank a nice tartness.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Only deli in the neighborhood that is open 24 hours as far as I know since Ziad's closed and maybe even the only one serving food after 8. Having lived in Bushwick for years, I got very used to being able to get a Sausalito on a roll or whatever at midnight, but that seems hard to find in this area. This time, I got salami on whole wheat toast with raw onions and mustard (one of my husband's favorites I found myself craving). The meat was piled on almost too thick, but it was perfect. Thought it was a little pricey until I realized it came with chips (which I doubt I'll ever eat). Will have to ask for just the sandwich next time.", "author": "Sean R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Best deli in the area. The sandwiches and wraps are large and come with either a banana or bag of chips.", "author": "Tim A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "Delicious sandwiches, great selection of beer, and healthy snacks,\nStaff is super friendly and patient. If you're in this area of Brooklyn go get a sammy from these guys! This is a NY sandwich deli!", "author": "Dan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Love this place I and mostly all my coworkers eat here they have every thing u need to make the best salad and its so much u can eat twice the sandwiches are to die for its always clean and bright the guy washes his hands with out u asking love it. The workers are super nice I love when the owners baby boy comes to visit he is so helpfull and he always has a story to tell me when I come in. Lol the prices are on point for the neighborhood its in you would expect it to be twice as expensive but  its really a steal. One more thing if you don't have enough change your short 25 cent or more or less lol there is a change cup to take it from. I've only seen this in VIRGINIA GIVE A PENNY TAKE A PENNY THEY CALL IT. there chips and candy are fresh never out dated ok that was last thing lol", "author": "Sinsin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "\"At the beach\" sandwich has become my favorite sub from Smith Gourmet Deli. I literally come here every other day to get this sandwich, it's very convenient especially since I live in the neighborhood. The cooks are awesome, my favorite goes by the name of Omar. If you ever come in for a sub, ask for Omar! He is the man! Everything is made to perfection. The salads are fresh (spinach is my personal favorite) they have a wide variety of drinks to choose from and snacks. I really enjoy this place, which is why I'm giving it a 5 Star rating. BEST OF LUCK SMITHS GOURMET DELI!!! From your new #1 customer!", "author": "Nagi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "One of the best Deli I've been too in a long time. And Omar makes the best sandwiches. If I could give 6 stars I would", "author": "Moumar Gueye N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "My favorite Deli in Brooklyn , best wraps in town Omar and Mario are on another level when it comes to wraps , and sandwiches thanks for the good food .", "author": "Dominic P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Outstanding deli. Huge variety of drinks and snacks and great breakfast sandwiches and smoothies. These guys are polite and fast. I got two eggs with swiss and pastrami on toast two days in a row and it was great. Also got the green tropical something smoothie, also great, not too sweet. Highly recommend !!", "author": "Brian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Great deli. They make the best sausage or bacon egg \u0026 cheese in the area. Sandwiches are great too.", "author": "M P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "We Got into town late on Christmas Day and me and the family were hungry so we looked around and found this place was open.  My sandwich tasted awesome and was a good value for the price.  Everything on the menu sounded good and the deli counter items looked good too. Not much room to eat inside but they had 4 chairs and some counter space.  It was enough for us. The grocery area had all kinds of great items.  I got some milk and a smoothie for breakfast and a beer for back at the hotel.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "This is hands down the best place to get lunch in the area . They don't rip you off with the portions and the food taste good for a reasonable price . It's not that close to my job but the long walk , even in this cold weather , is definitely worth it for their turkey blt.", "author": "Cris V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "I work around this area, this is my go to Deli every other day. Place is clean and has fresh food. Wraps and Sandwiches are huge and filling. Omar and Mario do a great job making the food!", "author": "Krunal P."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Smith Gourmet Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/EnLLwjhLzBunpZkD6tDylA/ls.jpg", "@type": "Restaurant", "telephone": "+19292502270"}