{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-15", "description": "The food was mostly outstanding. I'll start with what went wrong. Sat down and had meat plate - yikes. 4 measly strips of very thin bacon fat, some duck pate with super cold rendered duck fat mixed in that tasted like sand paper paste. Three one once chunks of so-so cheese. I could have picked up the same stuff at my corner grocer's. Ok. That's it. That was so bad I had to mention it. Now...what went right. Chicken Liver app. Outstanding. Their squash side dish...next time I go, I'll order it for an app. Their country pork chop. Delicious. The Hake dish. Outstanding. The ravoli was to die for...and could quite possibly kill me considering the amount of butter slathered all over it. I didn't miss a drop. The two desserts were very good, but nothing off the charts. The wine list was full of lovely wines and some that were even bargains. A very nice selection. So, wondering why three stars. Well, it's the kind of place you walk into and expect everyone to be, at the very least civil. This, however is either not part of their \"style\" or somebody missed the memo. Being snotty to your patrons does not endear them to continue spending large sums of money. We were 4 people. Two of us started the evening off by ordering liberally from the bar, then had apps, sides, entrees, dessert, coffee...over 400 dollars without tip. We decided to leave and spend another similar amount nearby to celebrate a happy occasion. We would have loved to stay at the bar, but the staff was so \"sterile\". I know Dumbo is a \"cool\" place, but people are enjoying the retro aspect of being nice these days. VHH, please read the memo.", "author": "Debbie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-13", "description": "Love, love, LOVE this place!!!! This place is off the beaten track, in the middle of a residential street which only adds to the charm. Inside is the cosiest little restaurant which has about 8 tables and serves the most delicious food. They change their menu up but the ribs are good and you have to order the guinness chocolate cake for dessert as it's the nicest cake you'll ever eat. I love it so much that I almost want to start my dinner in reverse. One of my favorite places in Brooklyn. LOVE IT!!!!", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "Their Red Wattle Chop is B-E-Y-O-N-D!!! with sides of brussel and mash, incredible!!! Also loved the fennel and radish salad to start. Simply delicious.", "author": "SUNHEE G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "If this food and this vibe could be had for less time waiting, quicker service (is it possible with that tight kitchen?) and a certain protocol of service, we'd drive there more frequently. We returned today for lunch after having sworn it off 6 months ago when dinner was too loud, we got bumped into too much, and felt too old for the place (was this us, in our 30's, complaining about noise level and young people bumping into us while we ate?). Today we were told 10 min, a couple came in after us (were they there before us?), and they got seated - until they gave up the table to us (never a good sign) and we were once again sandwiched between two crazy conversations. The protocol - I just wish it could be understood that if you sat first, you get served first, but I digress.\nEggs and tomato - sizzling hot out of that oven ALWAYS delicious. I usually have to order one other thing or I leave hungry - grapefruit is always good (although the level of ginger syrup varies, today there was barely any) and toast can be delicious with fresh butter and preserves. Husband got steak and eggs, which he loved. I recommend getting there at brunch or dinner when they open to avoid waiting and holding out for a seat against the window lest you're exposed to a menage a trois morning after convo (unless, of course, that's your thing).", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "They've certainly received their fair share of attention on the Where to Eat in 2010 circuit, so I am bit apprehensive about further elevating VHH's stature in the \"reasonably\" priced good food category, but after today's visit I couldn't resist. Always leave with a smile on my face.\n\nAnd a great excuse to check out Quarters A (http://en.wikipedia.org/wiki/Quarters_A).", "author": "Drew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-14", "description": "what the fuck have i been missing out on?  this place blew my mind.  pork shank, cast iron chicken, ridiculous apps and amazing desserts!  the experience was perfectly capped by the fire in the lower level (which is where we sat).  service was good and they were very accommodating of our party of 6.  sat down in like 45 mins on a saturday night without a reservation, which i was more than happy with.\n\nsure it's a little out of the way, but this place is worth the trip!", "author": "mike m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "this place is kind of hidden, and unexpected. not just in its awesome atmosphere with a native/hipster vibe, but its amazing menu. everything was delicious. maple smoked bacon is awesome, and their red snapper bloody mary (with gin) is great...may substitute it for all my future bloody marys!", "author": "Laura O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-29", "description": "We live in the area...over the past two weeks had dinner there with friends.  Either they changed the chef or quality of the product they buy. YUK!", "author": "Jack N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "Cozy, romantic dinner hangout, with the best pork chop in the business (from the red wattle breed) and out-of-this-world brussels sprouts. Also a wine list worth a second look. Downstairs, a wood-burning fireplace keeps things warm in winter. It gets a bit loud and crowded on the weekends, but worth the trek from Manhattan.", "author": "Doug S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-16", "description": "The atmosphere was wonderful and I enjoyed my cocktail and dessert.  The problem was portion size.  After appetizers and dinner anyone who ordered a pasta dish in our party was still very hungry.  We actually asked for bread and butter AFTER we ate our entrees.  Also, the Red Wattle Country Chop is overpriced for what it was.  It was good, but definitely not $25 good.  I'd go back for appetizers or dessert and cocktails - not dinner.", "author": "Katy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-05", "description": "awesome. awesome. awesome. \nvibe, location, ambiance, service.... all awesome. \n\nThank you for being the only place worth eating at in Dumbo.", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "First, I must state the obvious.  I walked past no fewer than 3 housing projects to get here and there was something very alarming about walking into a bustling, well-lit room, filled with flushed white people spending their disposable income on incredibly expensive food and beverages.  It's one thing to plop down a hundred or two dining in the West Village or even Williamsburg or Fort Greene, but there's a very different feeling here--not that there necessarily should be, but there is.  \n\nWe waited an hour on a Monday night, sipping mediocre cocktails.  I had the Presbyterian Secret and my dining partner had the Bourbon Smash.  They tasted very, very similar, though the former with cubed ice and the latter with crushed.  We drank these in the back garden, which is heavenly.  Even though it was a chilly night, it was a treat to shiver in that gorgeous space.  (And yes, wine would have been a better outdoor-on-a-chilly-night choice, but we didn't do that.)\n\nWe had the Torta Rustica appetizer and it was so-so, but the Ramps were delicious.  The English Pea Ravioli was to die for.  Some incomprehensibly good combination of lightness and ravioli!\n\nFor entrees, one of us went with the famous chicken and the other with the slightly less famous chops and we shared.  Both were excellent, but we actually enjoyed the chop more.  If we had to pick one, both of us would pick that.  I also recommend the Carmenere as a companion wine.\n\nAnd, though we were STUFFED at this point (there are complaints below about portions so we ordered a lot, but we thought they were actually quite ample and we could have easily done with less), we did get a slice of the Guinness Cake, which was--as promised--amazing.  I wished I had had more room, so I could have finished every scrumptious bite.\n\nThe service was fine, but aloof.  I don't really care that much, but I can definitely see how it would be off-putting to some.  We had the unfortunate situation of sitting next to a table with an egregious complainer.  I think he complained about everything they put in front of him (and his three companions).  I shudder to think how much of his meal was comped, given what an asshole he seemed to be.  On the other hand, my dining partner was good-guy enough to point out that our cocktails had not been added to our bill.  I basically expected those to be on the house since it was their mistake, but our server simply fixed it and came back.  That was a disappointment.\n\nI recommend this place, but only if you are making a night of it.  This is not at all a place to pop in before another event, as we arrived at 8:45ish and were there until just after midnight.  (Maybe if you just do entrees, but then you'd really be missing out.)  I will certainly come back, most likely for brunch next time.", "author": "E L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-26", "description": "Love, love, love this place. Great food, charming atmosphere and good service. \n\nGreat Bloody Marys. Amazing Sourdough Pancakes with some kind of caramel syrup and bananas on top. I nearly ordered a second plate of them.\n\nI would go back in a heartbeat and definitely recommend to my friends.", "author": "C L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-25", "description": "Unable to make reservations and greeted at the door by a robotic, programmed \"hi\" in an atmosphere of unhappy, impersonal staff, tight space constantly being tossed and knocked about. The menu is small and forget about dining there if you are a vegetarian. The price did not match the level of service and the food, tiny portions that are all pre-made. To sum it all up, their tomato soup to accompany your tuna melt was a can of Cambells but they were not even able to tell me if they added milk or water to the pre-made batch. Disappointment is an understatement.", "author": "Jocelyn P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Amazing, totally worth a trip to Brooklyn! And Frank Bruni is right, the pork chops are out of this world... even my husband, who doesn't like pork, loved it! That's how good it was. I also recommend the heirloom tomato tart as an appetizer and the Guinness chocolate cake (you can't really taste the Guinness) with cream cheese topping (to die for). The short ribs are very good, but the pork chop is superior... not a big fan of the corn salad.", "author": "Flavia V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-17", "description": "Why didn't I know about this place sooner? It is seriously the most perfect place for brunch. The food is perfection and so interesting. Everything is so yummy and unique. The service was great, out waiter so quirky and perfect for the ambiance. The space reminds me of an old haunted house which I loved. Its kinda in the middle of nowhere, like around the corner are projects then you end up here and it looks like a old haunted little street in some other world. We had reservations but there were people waiting for the doors to open at 11 so be prepared to wait but I promise its worth it.", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-21", "description": "They recently opened for brunch this summer and I went this morning, fabulous! Very reasonable prices  and everything was delicious. I had their special juice of the day, cucumber mint something, not sure but it was green and tasty and very refreshing. My main course was the sourdough pancake with ricotta cheese and caramelized banana. BEST PANCAKE OF MY LIFE. Everyone at the table who didn't get the pancake ended up ordering it for dessert, that's how good it was. it was kind of crispy on the outside and pancake-y in the middle and exactly the right portion. I will definitely return!\n\nSo besides having the best pancakes ever they also had some pretty delicious bacon. I didn't try anything else but everyone else seemed pretty pleased with their meals as well. The ambience was nice, I'm sure others have described it so I'll leave that to them. All in all, very highly recommended!", "author": "Samantha J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-27", "description": "There's no arguing that the space is really cozy and cool with an intimate, vintage decor that's amplified by its location on a quiet, out-of-the-way block past DUMBO.  Great for a date or to impress Manhattanites who fear the boroughs.  (We went on a rainy night around the holiday so sat without problems, although I've heard the wait can be painful.)\n\nThe food was solid, especially for the price, with a few exceptions.  People at my table loved the chicken liver appetizer, the chicken entree (served extremely simply) and the pumpkin ravioli.  I had the Pollack, which was good but not great (although I definitly dug the pistachios).  Stay away from the pickeled vegetable appetizer -- totally boring and unrefined.  The Guinness chocolate cake with creamcheese frosting was also dissapointingly dry and bland. \n\nAs for service, everyone (hostess, bartender, waiter) seemed to know what they were talking about, but couldn't care much less about it (or us).  I guess they were just too cool for school.  Oh, and don't expect to taste a wine before ordering -- the waiter looked at us like we were crazy when we asked.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-29", "description": "Abutting the Brooklyn Navy Yard and DUMBO, Vinegar Hill is an eight block long enclave of row houses and cobblestone streets.  The area feels like a deserted village where the only sound to be heard is the quiet humming of a Con Ed substation that spans several blocks.  I'd never seen another person on my walks through Vinegar Hill but I did encounter many cats roaming the tree-lined streets.   When I heard that there's a restaurant in Vinegar Hill (and a good one at that), I was intrigued and eager for an excuse to make another visit to this anachronism of a neighborhood whose haunting obscurity has always captivated me.  \n\nOne rainy Friday night, my friend and I eagerly set out on the 20 minute walk from our stomping ground in Brooklyn Heights to Vinegar Hill House.  The restaurant is tucked inside of a cozy, 19th century wood-frame house on Hudson Street which was swarming with plaid shirts, skinny jeans and Emo haircuts.  We drank at the bar for about an hour before getting a table.\n\nEverything we ordered from the seasonal menu was outstanding.  My starter, the chicken liver mousse had the consistency of butter and practically melted in my mouth.  This wasn't just any old liver; it came in a cute little mason jar topped with pistachios and was accompanied by frisee brushed with horseradish as well as sweetened onions.  I was given just enough crusty bread upon which to spread the liver and its accompaniments which was a relief; otherwise, I'd have felt compelled to lick the sides of the jar.  My friend's heirloom tomato and cheese tart appetizer which was made in the wood-fired oven did not disappoint either.  My entree, some kind of pumpkin seed encrusted fish with cucumbers and dilly beans, was delicious.  My friend loved his main course of chicken cooked and served in a piping hot cast iron skillet.  Dessert consisted of a shared slice of Guinness chocolate cake with a thick layer of cream cheese frosting.  This was the perfect dessert; the cake was rich but not sickeningly sweet. \n\nOther reviews have complained about the small portions but neither of us felt deprived in any way.  After finishing up at the restaurant, my friend and I took a walk around the corner to catch a glimpse of the Commandant's House, a 19th century Federal style mansion which used to be the home of the commander of the Navy Yard.  We stood at the gates surrounding the mansion which, like Vinegar Hill itself, is wonderfully out of place and agreed that our meal at Vinegar Hill House was the best we'd had in quite some time.", "author": "Jeanne E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-13", "description": "I went here last night with a large group of people. The place isn't really set up for such a large group, but they made accommodations for us. The ambiance is really great at this restaurant. I was sort of expecting to be on the water since it's down in Dumbo, but you quickly forget because it was so cute. The plates of food I saw while waiting to sit down looked delicious, and I couldn't wait to order. The things I tried were the beets with horseradish, the cheese plate, a special they had of roasted peppers with an egg sauce, the tart, and the sweet corn ravioli with bacon and sage. I really, really enjoyed everything I tried. I will be definitely going back very soon to enjoy more of this place.", "author": "Nikki H."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}