{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "I had dinner here last night with friends. The cornbread was so good we ordered it at the start and end of our meal. But that's not why I'm writing this review. I'm writing about the gnocchi.\n\nWe asked our waitress what the difference was between the appetizer and entree gnocchi dish. Apart from saying one was bigger than the other (duh) she couldn't tell us. I think if you work in a restaurant you should know everything about your product. You should completely know the menu, because how the heck should I, the customer, know? I've never been here before.\n\nSo we ordered a appetizer gnocchi and a entree gnocchi and I can report the following:\n\nappetizer gnocchi = 13 gnocchi's at a cost of $18 = $1.38 per gnocchi\nentree gnocchi = 18 gnocchi at a cost of $25 = $1.39 per gnocchi  \n\nThis sort of information would have been invaluable for our dining party prior to ordering.\n\nAgainst my better judgement and at the corralling of my friends I sought to outline our discovery regarding the gnocchi to our diligent waitress. As I proceeded to breakdown the gnocchi calculations my so-called-good friends buried themselves in their cell phones. I think they could sense that after a long shift, and fielding multiple questions from newbies and having to cancel one order and make it vegetarian (completely our table's fault) the waitress was starting to crack. She did not seem too enamored with my calculations, retorting with a stiff \"Well, that's good to know\" and swiftly spinning away on her heels. I was only trying to help.\n\nStill, that cornbread...", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "A hidden gem. I procrastinated checking this place out becuase it's so far out of the way and really not near a thing but it was totally worth the trek.\n\nI went for brunch and got the amazing peach pancake. Soooooo good. It came in a skillet with crispy edges and a moist center. Perfection. The ambiance is very cute with a lot of energy. Great for a date!\n\nDefinitely check it out.", "author": "Maria A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-13", "description": "My friend and I had to wait 1.5 hours for our entree. At the table next to us, a couple finished their meal and left, then another couple was seated, ordered, served, ate, then finished their meal and left, all before my friend and I got our entrees. The waiter gave us attitude when we asked what was taking so long, and did not offer an explanation. He literally held up his palm to us and barked, \"Hold on a second.\" We had already been waiting thousands of seconds. They did comp a couple drinks and gave us cornbread, but the waiter's attitude was unacceptable. My entree was overpriced at $31 for a few measly strips of fried fish. Doubt I'll go back. I purposely undertipped, but I just checked my bank account and the waiter took it upon himself to increase his tip. Unbelievable.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "I've only visited this restaurant during brunch hours. They have a nice twist on the pancakes. It's prepared and served in a cast iron pan, with a random fruit mixed in weekly. So far I had pear, peach, strawberry, and blueberry. If you have any fruit allergy, I would suggest to call ahead to see what fruit will be used that day, their online menu isn't updated timely. The pancakes are very tasty!\n\nI've also had their roasted potatoes, and maple bacon (their cuts of bacon has a lot of fat, if you are into that). Food is very yummy. I haven't tried any of the other food so far. I read some of the low yelp reviews,  sounds like im not missing much.", "author": "Na P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "I've been here twice and was so close to 5 stars but for the prices, nothing really sang too me. Other than the delicious cocktails! Maybe I will go back again and change my mind to 5 stars, but for now, 3 it is. \n\nThe giant steak for 2 was really well done, which always impresses me at a non steak house.", "author": "B C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "I really wish I could be leaving this review under better circumstances... but I've just nearly recovered from 3 days of extreme stomach pains brought on by a \"brined\" pork chop dish served to me at this restaurant. Ordered a few minutes before the kitchen closed, I was served this \"medium rare\" pork chop that was much more RAW then rare. I only ate about %30 of I had a few cocktails in me at that point and I'm a very trusting guy so I guess I assumed it couldn't hurt me.. boy was I wrong. \n\nOn the positive I haven't eaten anything solid for 72 hours so i'm probably losing weight!", "author": "Yoav E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "Bad service.. our food came 2 hours later after sitting, the waitress was awkward and unfriendly.. made an error on our order and refused to take the food back, even though it was untouched. Will never come here again.", "author": "Asli A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-15", "description": "Lots of attitude and ambience, but everything was downhill after the simple salad. Cast iron chicken missed the mark and pork chop was very ordinary. Not a place for good food or drink but cozy and charming.", "author": "Dano W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "It's a damn travesty that this place isn't rated higher. \n\nSo you spoiled wannabe critics have to walk through a quiet and seemingly \"gritty\" area - which by the way is only 2 blocks. Two whole blocks!! Ask the residents of next door Dumbo in their multi-million dollar apartments how \"dangerous\" it is. \n\nSo you cheapskate wannabe critics want lower prices. How come 3 Star Michelin restaurants can charge an arm and a leg and be located in small remote town in France or Spain but this lovely gem can't have fair pricing in this location?  It has to be cheap because it's not in the UES?\n\nAnd for the pampered wannabe critics who must have their every whim catered to with white glove service. Seriously. What? No complaints about the mismatched rustic furniture or decor? What else do you not like? The waitstaff don't wear uniforms? \n\nWe've been coming here for years. And we just finished a fantastic brunch - my first brunch here. Everything was superb. The food was just wonderful. The pork and grits- great. The pear sourdough pancake - sublime and possibly the best pancake in Brooklyn.  The lamb shoulder special - so good. \n\nWe had a lovely stroll through the neighborhood. We were able to take our time to talk and catch up over a meal like real friends. And got to do it all in a non-pretentious restaurant that was great for a small group to just enjoy each other's company on a Saturday afternoon. Almost felt like my own Brooklyn version of a Woody Allen movie (a good one). \n\nThere's no such thing as perfection. But this place is definitely 5 Star worthy.", "author": "Ming O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "The food here was out of this world. The beets starter was heavenly. The fish was also incredible. I would definitely come back and recommend it to others. I would have given this 5 stars but the service was not great. Our server was completely indifferent to the menu and was not helpful when asking for suggestions. Very frustrating! \n\nCornbread is also a must get!", "author": "Amy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Great place for either the summer or winter. Has great vibes. For the winter they have such a cozy, almost cabin like vibe with a fire place downstairs. During the summer, they have a beautiful backyard. Food is also very solid. Have only been for dinner and it's always reasonably priced and the food is always good. Solid all around, have and will return.", "author": "King K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "Very good great pancakes\nShort Walk from DUMBO", "author": "Stan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "It's worth it to make a special journey out to Vinegar Hill House in this hidden away neighborhood of Brooklyn. Their entrees are perfectly cooked and the drinks are delicious.\n\nYou might encounter a wait, but if you do, take some time to go toward the waterfront and watch the sun set against the bridge backdrop. It's beautiful.\n\nOnce you return, have a cocktail here. They're all fabulously made and well-balanced.\n\nThey have a wood-fire oven, an amenity lacking in most restaurants nowadays. \n\nThe Red Wattle Chop (pork chop) is their signature dish. It's carefully sourced meat served medium rare to rare. I never thought I would like pork served any less than well-done but they pull it off.\n\nI've also had the chicken which is juicy, butter-basted goodness. The sauce is made from a red sherry jus that's part butter, part chicken. The only bad part is that the entree can be quite small (two small legs) for someone with a ravenous appetite. There are also no sides besides two halves of a shallot.", "author": "Lawrence H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "Amazing brunch experience in DUMBO! Came here after a weekend staycation. A bit off the beaten path from the F train but well worth it! We ordered the pork and grits, the large pear sourdough pancake, and the poached eggs and lamb hash special. Everything was delicious! Will definitely be coming back", "author": "Ally G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "This restaurant seems like it has everything going for it. It's has a very charming decor, the only problem is the food is BAD. I went for brunch and everything was almost inedible.  If this restaurant gets a new chef, it could be truly great.", "author": "Matt S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "Had a really lovely dinner last night in the back garden. Arrived around 9:45 or 10 o clock I believe.. Considering it was the first thing I ate all day, this was an even more incredible meal than perhaps it really was.. But, delicious none the less.. \n \nI.TOMATO AND CUCUMBER SALAD: We started with the heirloom tomatoes, cucumbers, peanut and maple ponzu  buttermilk dressing. It definitely reminded me of something Asian. Actually more so Chinese.. The maple ponzu, came across almost like Chinese Vinegar with the cucumbers and peanuts.. But, either way, it was good.. The basil added a really nice freshness as well.  We decided we would not have been upset if there was cilantro to.  \n \nii.CORN AND EGGPLANT RISOTTO WITH EPAZOTE: The corn and eggplant risotto was our favorite thing of the night.  This was spectacular. I am very picky when it comes to my eggplant. It has to be exceptional for me to like it. This was exceptional.  The risotto was perfectly cooked, in addition to butter, they added creme fraiche at the end.. The \"sourness\" of the creme fraiche played well with the epazote in the dish.. Very happy there was no indication that parm was added.  It was sweet and creamy and just delicious.. To me, it tasted like they added marscapone cheese and epazote. But, they said it was creme fraiche.. Anyway, the dish is freaking beautiful.  \n \n iii.BROCCOLI THREE WAY. there was a lot going on here.. I didn't really know what all the flavors were but, i \"liked it a lot\"  There was some creaminess going on, texture from waterchestnuts perhaps and the peanuts.. Whatever it was, i want more of it. \n \n IV.RED WATTLE PORK CHOP Another really lovely dish.  I am very proud of them for serving this pork chop, rare essentially.  There were parts by the rib that were black and blue essentially.. But the outside still had a crispiness that reminds one of breakfast sausage or something really savory.. Just little hints of a crispy outside.   Served with a delicous potato salad and pickled blue berries..  \n \nOf high quality pork, roasted in there beautiful oven.  It was really nice. Something i use to take for granted when I would cook at home but, now a rare treat to get meat cooked this well and of this high quality.  The portion size was big enough for two.. In fact there was leftover food if you can believe it. \n \nWe ordered a really nice bottle of wine and sat by ourselves in this gorgeous garden.. Almost reminded me of an English Country garden.. We were secluded and just in a really beautiful space.. Waitstaff was awesome..", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "Was there last night. Split the country  chop, tagliatelle with pork ragu, corn bread and asparagus. \n\nThe cornbread was amazing and they have a nice wine selection for being a smaller place. The outside was great in the evening and they even had some bug spray. \n\nThe rest of our meal was good but didn't knock my socks off.", "author": "Trevor G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-13", "description": "Now you've done it, Vinegar Hill. I've come here for brunch at least twice a month for the past two years since it's one of the only restaurants within walking distance. Due to location it's overpriced af, but again and again my indolence prevailed over my common sense. Today's brunch was the last straw - my \"seasonal\" pancake (seasonal-my-tuches, it hasn't changed in over a year!) was drowned in cheap sugary maple syrup, and the trout egg benedict was fishy and mediocre. \n\nCan someone finally open a decent restaurant in the area, or nah?", "author": "Olga F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "I love this place, not sure why it only has 3 stars but I think it's great. The food is simple but very well prepared so the natural flavors of your meal can shine through. They have a gorgeous backyard garden that's great for date night and I saw Jonah hill and Alia Shawkat when I was there last time! \n\nFood:\n- cornbread: a must get, it's sweet and moist with a pat of butter on top that's just the right amount of salty. The jalapeño adds a great tang\n- burrata: SO creamy! I wanted a second order. The onions with it were very well cooked as well\n- tequila cured fluke: not a very large portion but deeeelicious. The fluke was tender, not too fishy and zesty from the tequila lime. The yucca chips were very crunchy, which was a good texture mix up and cucumbers were nice and refreshing, great to eat with a small piece of jalapeño \n- tagliatelle: my boyfriend ordered and I had a bite. The ricotta was unreal. The ragu was with pork and I don't eat it so I can't attest to that but he said it was pretty good", "author": "Sofia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-07", "description": "Vinegar hill house, is home of the $10 pancake (yes, that is singular). \n\nI was very interested in their menu but it is definitely more of a small plates spot and I left there starving. Had I known I would have ordered more. I love that they serve young coconut that you drink straight from the fruit, for $3 this far surpasses packaged coconut water. \n\nI had a special, shrimp and grits which were delicious but also small. They have a beautiful backyard which is good to know about. I wouldn't go out of my way to go back but it is pretty neat how it is tucked away in this tiny corner of Brooklyn.", "author": "Marisa L."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}