{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Delicious brunch food in a fantastic setting located in an idyllic corner of Brooklyn. I've tried the eggs benedict, biscuit sandwich, the maple cured slab bacon and the roasted potatoes, sour cream and pickled jalapenos.  Warm, friendly service complements the food.", "author": "Som B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-20", "description": "Food did not live up to the description and fell very short.  The kitchen staff  was extremely slow and loud to the point where people commented about maybe they had \"anger issues\"/\n\nWe waited for almost 40 minutes before someone stuck some bread and water in front of us because their kitchen was so slow in getting us food. At 45 minutes it came. The sourdough blueberry pancake was burnt. The fried oysters were very good but there was absolutely nothing creole about them as described on the menu.\n\nOur waitress was absolutely lovely and outstanding at trying to recover us as customers.\n\nHowever, what tipped me to finally figure I will never go there again was when I was taking a picture of the restaurant the manager comes up to the table and tells me pictures on not allowed of their premises. ??? When you wait 45 minutes for food and there is nothing posted about picture taking and you have a camera, people are going to take pictures. And there is nothing special about the space. Only reason I wanted a picture was for Yelp and my food blog.\n\n Maybe if they paid more attention to the service and less to the contrived decor this place would do well. When your restaurant is out of the way and tucked in the midst of power grids and an industrial area you need to be better then average. \n\nThis place was less than average. The chef and owner should rethink their kitchen staff and the manager.", "author": "Tom E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Went yesterday and really liked the place.  It's the second time my wife and I left Manhattan for dinner in 11 years, but our friend urged us.  Food was mostly good - really liked the heirloom tomatoes and the brisket.  Two people had the Arctic char and that was over salted.  Waitress was top notch - knew the intricacies if all the dishes and was articulate enough to describe them.  Despite the place being full when we got there, we never waited for anything.  Would definitely recommend and try again, but one star off due to over salting.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-17", "description": "I had such large expectations of this place, and was completely dissappointed. The trek up there was not worth the food, which was okay but not spectacular. Sevice was awful: when telling the waiter that 20 minutes had passed and we had not been served yet, not even the salad/appetizers,  the manager approached the table and told us \"it had not been more than 15 minutes\".\nThe music is too loud, staff over confident of the quality of its kitchen that they disregard good service.\nDefinitely never coming back.", "author": "D. A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-19", "description": "I wanted to have a fabulous experience here. I brought my boyfriend in for his 30th birthday dinner. \n\n5 stars for the restaurant appearance. The ambiance was great, albeit a tad pretentious (which is acceptable if the food is good enough to make me forget how blasé the staff is). It had all the makings of a neighborhood gem.\n\n0 stars for service. Staff was not at all interested in contributing our dining experience. When asked to describe items on the menu, our waiter seemed distracted and gave very vague answers. When I'm paying relatively high prices (as was the case at this restaurant), I'd like the server to have at least a little knowledge about the dishes and their ingredients. \n\nWhen we finally ordered, my boyfriend order the Chop, which he was very much looking forward to it. Though it was not crowded in the restaurant (i.e. not any background noise), the waiter somehow confused his order and he ended up with the trout. My boyfriend politely said that he had ordered the chop and not the trout. The waiter's eyes glazed over and he responded that it would take a long time for the chop if my boyfriend still wanted it, and that everyone else at the table would be done eating (AKA I'm too lazy to ask the kitchen to make your chop). No apology, nothing. Having worked at a James Beard award winning restaurant as a server, I know the appropriate protocol for when this sort of thing happens: you ask the kitchen (and risk pissing them off) to make a chop on the fly. \n\nMy boyfriend ended up eating the trout, which was fine, but it was not what he had wanted. We opted not to order dessert because we were a bit miffed at this point and were even more miffed when the waiter brought the bill (without any apology) with the trout on the bill. He didn't comp us a dessert, he didn't take the trout off the menu, and he didn't apologize. \n\nWhile I enjoyed my food, there are too many good restaurants in this city for me to ever return here. \n\nMoral of the review: Speak very loudly when ordering, and if you end up with the wrong order, don't expect an apology, a comp, or the RIGHT dish.", "author": "Caitlin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-10", "description": "This restaurant so starkly epitomizes the Brooklyn cozy/cool restaurant aesthetic that it almost hurts.  Almost.\n\nI've been twice now, and I wish I could stop ordering the heinously delicious pork chop and try something else.  It's got to be the best pork chop there is.\n\nAlmost makes you want to move to Vinegar Hill.  Almost.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "This place gets 4 stars for the ambience alone! It is super cute and homey. If you like restaurants with a great vibe, definitely check this place out! \n\nMy main course of spare ribs was a bit rich for my taste, but I probably should have expected that from the description. \n\nThe papardelle appetizer was ultimately my favorite dish. It was pure doughy, meaty goodness! You'd think they had an old italian grandmother back there making the stuff. \n\nDesserts was also amazing. I suspect you can't go wrong in that category!", "author": "Nicole W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Upscale, high quality food in an unpretentious atmosphere. Brunch and dinner are delicious. Portions are fancy-restaurant small for the most part, but well worth the splurge.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "Best sourdough pancake (as long a you don't mind it a bit charred on the underside). Have not tried the vaunted Clinton St Bakery pancake yet but it would be hard pressed to be better than this.", "author": "Lynette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-27", "description": "The interior of Vinegar Hill House looks something akin to your great-aunt's \"finished\" basement and less like the whole Brooklyn old-fashioned, antique inspired, wood-interior aesthetic common in places like Williamsburg/Greenpoint. That being said, it's still dark and cozy, utilizing filament bulbs to give the space a nice warm glow. An ample backyard provides dinner guests with a space to sip well-crafted cocktails amidst the trees in warmer weather while waiting for a table and avoiding the three-deep crowd around the bar.\n\nIt was difficult to get the bartenders attention due to the great amount of patrons packed in hoping for a drink in which to imbibe, but once I did, I was handed one of the largest wine lists I have seen in Brooklyn. Turns out, the carriage house behind the garden is well-stocked with a fine selection of wines. The cocktail list wasn't as ample, however, seemed well crafted.\n\nAs for the food, this is where Vinegar Hill House definitely stood out amongst all the other high-quality new-american selections out there. It did take a while to get my meal but it was well worth the wait, and the staff apologized and offered either another drink or a free side. Everything was incredible. The roasted baby beets with avocado puree and hazelnuts were amazing; a perfect blend of flavors and textures. My sister ordered the house-made garganelli, which she said was fantastic, as well as the side of the spicy corn. The hake was amazingly light and flaky, with a nice crisp on the outside. For dessert, we had to go with the salted caramel custard with house-made whipped cream and shortbread cookies, which rivals most of the desserts I have had as of late. \n\nOverall, you can expect a generous wait time over a leisurely meal, but the wait, as well as the trek to the space itself, is well-worth it.", "author": "Erica J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "This restaurant was phenomenal! Very thoughtful and delicious meal. Not to mention the atmosphere was magical.", "author": "Jimmy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "Quaint stripped back vintage setting with great brunch menu. Sourdough pear pancake was incredible and we also did omelette and the grits. Would definitely come back", "author": "Adam D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "This was my second time at Vinegar Hill House.  Like most other public radio loving, flea market shopping 30 something folks, I was charmed by the allure of wainscoting and exposed filament bulbs...reclaimed wood and a copper bar.  The restaurant is gorgeous inside.  A nice romantic date spot.  But the food is just very average.  I first ate here in 2010, and it was completely average.  Now, last night, after reading the yelp reviews, I decided to try it again, and it is still completely average.  I had the chicken.  It looked beautiful and I couldn't wait to dive in...but the flavor just wasn't good.  The jus was weird and too winey tasting, and the chicken itself was not moist - however the brussel sprouts were awesome.  My better half got the steak and again, it was just exceptionally average.  Normally, I wouldn't write a review since I was not overwhelmed either way - but I want to say that this place is extremely overpriced.  I think the decor and neighborhood keep us 30 somethings coming back.  But give me James or Prospect or No7 any day.  Better prices and MUCH better food.", "author": "Katy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-09", "description": "Did someone up and transplant San Francisco into this place?\n\nUpon walking in the whole placed looked like an Anthropologie catalogue and was infested with hipsters. I met a friend there and we ordered the pancake and duck egg. The pancake was alright for nicely portioned for a brunch serving but the duck egg came out like a bibimbap (essentially a bunch of ingredients thrown into a bowl) - urgh - waste of $12.\n\nThe place also had a fly problem. Gross. I suppose it's worth giving another shot just because of the ambiance. But it's nothing that I would go and rave about to others.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-17", "description": "This restaurant gives the lie to the idea that Brooklyn restaurants, in general, can be seriously competitive with the offerings in Manhattan.  Were it not in an out-of-the-way neighborhood, this place would not have waits for its tables, or the level of notice it has received.  While the presentation - your standard Brooklyn bistro mix of real and faux-antiques - of the restaurant passes muster, and the wine list is diverse, well priced and stocked with delicious offerings, the food simply does not.  A \"squash salad\" is in fact romaine lettuce with a few lonely pieces of squash, coupled with a truly awful, tongue-numbingly bitter feta puree that makes absolutely no sense.  None of my party are still sure whether the \"veal belly\" was actually veal, but whatever it was, it was excessively salty, chewy and generally unappealing.  \n\nIf I lived in the neighborhood, I might be back, but as it stands, the 7-minute drive from Williamsburg is farther than I'm willing to travel for this.", "author": "Jonas B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "We walked in on a Monday night and wee seated immediately. The atmosphere is charming and it's works for family, friends or dates. \n\nWe shared the lamb ragu and chicken done two ways - both were excellently prepared. I also liked the side broccolini. My main qualm is that there was nothing vegetarian friendly on the menu - PETA would not have been pleased!", "author": "Heather F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-06", "description": "We were charmed by our first meal, having eaten at the bar. Reminded us of the C\u0026O in Charlottesville, VA--wonderful, subdued atmosphere and tasty, straightforward fare. Much to our chagrin, our return visit left us unimpressed. A resolutely arrogant hostess, coupled with a kind, albeit rather ditzy, waitress made for a less-than-convivial meal. \n\nI'm afraid it is now plain that Vinegar Hill is merely Freeman's Alley's Brooklyn outpost.", "author": "The Undercover Glutton N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-11", "description": "Enchanting place in every way.  Set in a little nook of Brooklyn that feels stopped in time and worlds away from the rest of NYC. The back garden has to be one of the most romantic places you could ever dine out.\n\nThe food is incredible: simple and stunning, fervently local and seasonal.  It's always a thrill to see what's on the menu and to hear the specials.\n\nRecent highlight was actually dessert... lemon tart with PARSLEY ICE CREAM... it's the stuff dreams are actually made of. Amazing.", "author": "AvaGlows O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "Totally oversold. Average food, in a rustic but loud as hell ambiance. Very pricey, waiter did not know anything about wine, asked for a non earthy wine and ended up with the total opposite. The true Hipster nightmare...", "author": "Sylvestre G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "Amazing as always. Wondeful food, atmosphere and service.", "author": "Tristan V."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}