{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-21", "description": "Had brunch here today around noon. Estimated 10-15 minute wait, was more like 15-20 but that's ok on a gorgeous Saturday like today. Screen door entrance, which perfectly describes the look and feel - cozy, woodsy and comfortable. Hipster to a T, but the practical, modern version, not crunchy granola.  \n\nUpon arrival, host gave us our menus immediately and we received water and our order was taken relatively quickly by our server.  Our first course, fried oysters, arrived quickly, with my coffee.  Pretty sizable oysters, breaded and served with a wedge of lemon and whole grain mustard sauce. Very tender and fresh with the lingering flavor of seawater.  My broiled grapefruit was one of the most unique dishes I've had - half grapefruit, sectioned and covered with sweet and savory rice crispies flavored with shrimp paste.  Tasty, but unusual for sure and still not sure how I feel about it.  Unagi omelet is out of this world - but very very rich and full of flavor.  Could have definitely used some toast or carb to relieve me, but the frisee and mandarin salad was refreshing (and perhaps could have used a bit more of it).\n\nCoffee refills without having to ask, and the busboy remembered it was decaf which was nice. But overall it was difficult to get the attention of a server, and it took a LONG time to get the rest of our food after the oysters (at least 20 minutes?).  However, I will say that whenever we got the attention of a server, they were very attentive and competent. Would definitely come back and try some more yummies the next time I'm in this gorgeous neck of the woods.", "author": "Sasha H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-04", "description": "I went there last night with a party of 5 and was the first to arrive. I was 5 minutes early and walked in. They informed me they open at 6 and briskly escorted me out into the frigid weather. They locked the door behind me and as my party gathered, they let us stand outside until they opened the door and grumbled we only called for 4, which we had added to. They gave us a cramped table, though no one else was in the restaurant.  The food was decent, but the pretentious, self important staff was unbearable.  They were more eager to please themselves than their clientele.  I asked for one of their signature drinks, minus one ingredient and was informed the bartender didn't think it was wise, what else would I like.  I asked for it the way I wanted it and got it grudgingly. There are plenty of places to eat in Brooklyn where they actually smile and are nice to you. I will stick to those.", "author": "Renee B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "I liked it. I have been hearing about this place seems like forever.  I finally stopped in for brunch last week, I was all alone :-(  .   Don't feel sorry for me though I had a good breakfast served by a handsome attentive bartender.  It was an easy Sunday morning.", "author": "Wanda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "This smallish restaurant located on the outskirts of Dumbo was worth the trek on a rainy night from Manhattan.  Service was great and the restaurant was lively and cozy.  We tried all of the appetizers and non disappointed.  I had the special Soft Shell sandwich which I've been craving since it has become the season for eating them.  This sandwich was perfection.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-18", "description": "Clam appetizer: The sauce is different from most but not for everyone, it leans on the sour side. The accompanying bread is tasty.  \n\nCast Iron Chicken: This was just ok. It wasn't particularly flavorful or tender. The skin was crispy but tasteless. \n\nCountry Pork Chop: This was the best dish I had out of everything. It was tender, flavorful, and savory.\n\nThe staff wasn't welcoming.  \n\nNo photography allowed.\n\nWorth the trip from Manhattan? No", "author": "Mona W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "The pear pancake seems to be used with a doughnut dough and makes it so yummy you just want to keep eating.  The potato enchilada was fantastic and the verde sauce used on it makes the dish perfect - balancing the tangy of the sauce with the savory aspects of the potato and cheese.  \n\nOh, and definitely get a side order of potatoes!!!!  Those things are amazing just on their own!", "author": "Matt J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Must order: THE CHOP! The best chop in the world! Oh \u0026 the chicken is moist, tender, and delicious, as well. Pray they have they honey jalapeno cornbread special and the rum cake for dessert. The bartender makes a good old fashioned, as well.", "author": "Veronica A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "had a really nice evening here last night - great winter setting and ambiance - cozy and warm and friendly.  but i was mildly disappointed across the board by food, drinks, and service - all just felt 20% worse than I had expected.  I love campari but found my campari-based cocktail too dominantly bitter.  the papardelle was a bit too salty.  the fluke was proficient but uninspired.  the server faked his way through the wine menu and when he found out they were out of my selection he tried to upsell me.\n\nnone of this was killer, and there were a couple of big winners: the squash tart, the pork chop, the brisket, the date tart.  if I'd had lower expectations, this would be 4 stars easy.  want to love it.", "author": "James R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-27", "description": "A very serious food friend recommended Vinegar Hill and off we went on a lovely summer Saturday evening. No reservations they said on the phone; at 8 PM, we did get a table right away on the peculiar outdoor patio boxed between the restaurant building and a back house that was used for restaurant storage. Several scraggly trees reached for the sky. Funky. The outside chairs are seriously uncomfortable slats.\n\nThe food was excellent with a blend of fascinating flavors, such as watermelon paired with a small slab of brisket, and a delightful delicately cooked blend of unusual mushrooms.\n\nWould I return? No, because the staff did less than nothing to be warm and gracious and the portions were overall very tiny. The dishes are certainly overpriced; you will leave hungry. Literally three thumb-nail slivers of duck and at most 14 inches of pappardelle for a main dish. The chef can be mean, I guess.\n\nIf you are not concerned about the value, it is an interesting and tasty experience. Finding the location is a bit of a challenge, but doable.", "author": "John A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "Did your parents ever tell you a story about going on a road trip upstate, breaking down on a country road in the middle of nowhere and walking into an odd-looking country shack--where they then had the best meal of their lives?  If I was a location scout charged with recreating that evening, this is where I'd go.\n\nAt first glance, the decoration looks a bit \"thrift store\" scattered.  Even before the first bite, the attention to detail comes through in vintage incandescent lights and the equally warm and cozy woodwork throughout.\n\nWe went on a Sunday evening around 8, and were quickly seated in a half empty room of two four tops and another couple.\n\nOn a lark, I ordered the Chicken Pot Pie as an appetizer.  It was an incredibly delicious, gentle, flaky and amazingly savory treat.   Same to be said for the Butter Clams, in a broth that was light yet incredibly rich with flavor.\n\nGet the flatbread, even if it doesn't come with what you order.  You'll be amazed.\n\nFor entrees, we shared the Maltagliati and the Lamb special.  Both were incredibly delicious.  I wish I could begin to take apart the flavor profiles of both, but both dishes left me completely stumped yet wanting more.  The lamb was about as close to butter in texture as I've ever experienced with meat, and the octopus was shockingly tender yet firm.\n\nThe Guiness Chocolate Cake was also quite good, but not nearly as mindblowingly so as the appetizers and entrees.\n\nA friend mentioned that the place embodies the German word \"Gemütlichkeit.\"  The VHH is indeed a warm, friendly and exquisitely delicious dining experience that is well worth the wait, the trek and dare I say a better value than many of its price-point peers.", "author": "Nick F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "This place is insane! Best pork chop I've ever had, and I don't even like pork. A favorite!!", "author": "Finchy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-21", "description": "Crap. The adjective and the verb best describe my return after a year or so. I have to shower now to get rid of the stink and emotional trauma of dining here tonight.", "author": "makis s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-23", "description": "OK... I'm giving my favorite restaurant a one-star. \n\nI want to make something very clear. I still think Vinegar Hill House is 5 stars.... but I am giving a 1 star to Janine... the worst server I have ever experienced... I mean it was so bad it was almost comical.\n\nFirst of all, when we sat down we were hungry, so we selected our food. When she came to ask us for drinks, we told her that we not interested, but we do want to order food. She stammered a bit and said that she can't do that now and walked away.\n\nThen, when we ordered, we wanted to share a linguini dish to start with. She insisted that we should have it as a \"mid course\". At which time I replied that we are not having a first course, so how does that work? So, then she tried to upsell us on a bunch of starters. Finally convinced her to just bring it out before the entree... mid course, first course... whatever.\n\nNext, my sister ended up ordering a glass of wine, which arrived about 15 minutes later.\n\nThe entrees arrive before the linguini.\n\nOn dessert she sold us something that wasn't on the menu. When we asked what was on the dessert menu she was going back to the kitchen to check... fortunately her boss was there to tell us the dessert menu.\n\nThe classic cherry on top was when she brought the check, she acted like she was doing us a favor by telling us that she \"went ahead and took the [incorrect] dessert dish off the check.\"\n\nAMAZING!\n\nIt's a bummer that my favorite restaurant in the city... the one I evangelize to all my friends, and the one I brought my family to tonight... now is slightly less cool in my eyes.", "author": "Kyle W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-16", "description": "Ratings should be based on the quality of the food AND service combined if you're going to be dining in. Thats why this spot is only getting two stars from me! With a combination of 5 stars for their foods and drinks \u0026 a -1 star for their horrific service, it would amount to 2 stars.\n \nTheir Red Waddle Country Chops and mixed drinks most certainly met my expectations. It was just the \"lady\" (for lack of a better term) that made the whole experience.... a HUGE disappointment. I got in about 7pm on a fairly busy night and she told me that the wait will be around 20 minutes. After about 2 drinks, a pickle, and 80 minutes later, the lady insisted that the wait will now only be about 10 minutes. Mind you that I did ask her about 3 other times within that 80 minutes as to how long its going to take to get seated. So long story short, I was not seated until i gave her my nastiest attitude. Her name could be Janine as some other commentators had mentioned earlier. But shes this tall white \"lady\" who wore jeans that went up to her sternum (failed attempt to cover her BELLY!) \n\nIf you don't want to wait for a table, you could always eat at the congested bar with strangers rubbing on you. And again, the food was alright. It was just the service...", "author": "Richard K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Celebrated my birthday here! Excellent meal, start to finish.\n\nThe cocktail menu was classic but creative. I had the Carousel, which was a take on a negroni but with Aperol instead of Campari and some champagne vinegar (first time I've had vinegar in a cocktail!) and a sprig of time. Really well-balanced, herbal, delicious drink.\n\nWe ordered a couple of app specials -- bass croquettes, house bacon with pickled rhubard and macadamia nuts -- and the chicken liver mouse. All were really delicious. The house bacon with particularly nice and I love that they used rhubarb as it is in season and was a surprising combination with the bacon.\n\nThe main courses were similarly great. We ordered three entrees and two pastas and the range of flavors, techniques and cooking influences was really impressive. The cast iron chicken was everything you want chicken to be -- crispy skin, delicious oniony pan sauce. The arctic char was a standout -- perfectly pan-seared and finished with what I can only describe as a Scandinavian flavor profile and presentation (dill, some sort of berry, and some sort of tangy creme). The brisket was tender and tasty. The pastas were interesting and yummy. We particularly liked the lamb free-form pasta. It had a really interesting combination of flavors... tarragon and orange zest (I think).\n\nThe wine list was diverse and well priced and our server was quite knowledgable. The majority of bottles were in the $40-60 range. We had an excellent Sicilian wine for $48 that was earthy, rustic, kind of funky and paired very well with the food (our server informed us the wine was heavily affected by its terroir, growing in the volcanic soil of Mt. Etna).\n\nThis place is a real treat!", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-24", "description": "\"Local Tourist\" Trap \n\nVHH use to be one of my favorite restaurants as well and one of the most highly rated places by all the food guides. Unfortunately it has succumbed to the success curse - the chef has changed, prices went up, portions became less, and, most importantly, the food much worse. \nWe had a 3 people dinner and every dish was lackluster. Except mine- a small plate of spaghetti with lobster sauce, which was nothing short of a disaster. In the last 3 years that I have been frequenting the restaurant, I have never had a bad pasta - immaculately sauced and expertly homemade, pasta was the unsung star of Vinegar Hill. This time, my $16 spaghetti was out of the box with a sour bland sauce that appeared to be out of a can. \nThe new chicken dish which replaced a spectacular chicken in it's own jus that has been on the menu for the last 3 years was a ridiculous version of the classic - 2 small, barely warm chicken thighs on a bed of butter lettuce, a presentation suited for Chinese take-away.\nMistakes in execution can be forgiven, but serving store bought pasta and passing it off as gourmet? That's just insulting and usually found only in tourist traps. Seems like the fame and the glory of VHH made it rest on its laurels. While that still gives it a lot of clientelle, much like a tourist, I never plan to go back.", "author": "Dina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Great food! Wattle with the grits are a must have. The ambiance is warm and inviting.  The staff was also super friendly. We were there late so we were able to chat and hangout and not pressured to leave.  They even let me charge my phone!  I recommend this spot for anyone visiting the city.  The outdoor space is top notch.", "author": "Thor N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-27", "description": "I wanted so badly to love this place, but unfortunately, that was not the case. I loved the atmosphere, I loved our waitress and I loved our wine, the food however, I did not love. \n\nUpon first glance at the menu, I was more than excited to try a bit of everything - an app, a pasta, a main and a side. My excitement only grew as each dish was brought to our table - such beautiful presentations all around! However, as the meal progressed, my excitement continuously faded as we moved through each course. \n\nThe salad we decided to split consisted of a goat cheese smear and dressing - basic, yes, but left me feeling excited  for the meal ahead. Next course was the Pappardelle. Way too salty and tasted a bit fishy (unclear as to whether there was a fish base, regardless...no thank you). We did not finish the pasta, and when pasta is in front of me, an unfinished plate is a rarity. Next was the main - I opted for the Cast Iron Chicken with an au jus sauce, while my date went with the pork chop which came with a side of farro. I would have to say the chop was better but only due to the farro - the farro was pretty amazing (relatively speaking, of course). As for a side, we shared the wild mushrooms, which were coated in seasoning, leaving no mushroom flavor to taste. Next. After feeling a bit unsatisfied from our meal, we decided to share a cheese plate as a pseudo dessert. While the cheese was not terrible, it was not good either, and I am NEVER picky with cheese. One cheese we ordered seemed to taste like a barn. Not for me. I was most impressed with the Spring Lettuce salad.\n\nUndecided if I will eat there again, but I would definitely go back to enjoy a few drinks, or a salad.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "I've been coming to Vinegar Hill House for the past several years. Each time it doesn't fail to impress. A bit of trek to get to from Manhattan, but it's worth it. \n\nService is great - just plan on getting their early and grabbing drinks at the bar or out back until your table is ready. \n\nFood was excellent - their pork chop is the best in the city. The cast iron chicken and duck liver mousse are some of my other favorites. I", "author": "Aaron B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "I cannot say enough about this totally cozy Brooklyn restaurant. The Chicken Liver Mousse is the best I've ever had. The chop and the short ribs were delicious. It's totally pleasant, relaxing and perfect.", "author": "Bee C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}