{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "Vibe: It's small and cozy. Go there on a fri/sat night and you're bound to have problems getting a table.  I went one night at around 9pm and we got seated pretty much right away.\n\nFood: Portions are small, although I think they're quite ample. This is the type of place where you order an appetizer. If you don't, then you might want to order extra sides.\n\nDrink: Wine options are great. Glasses are a bit small but I'm so used to overpriced in the city that this doesn't faze me much. If you want a drink bargain, go to 68 Jay Bar.\n\nService: The service I had was pretty good. Sometimes they're a bit bumbling, but it's a small place. All the servers I've had were completely nice and helpful. One night we shut the place down and they never rushed us out. They just talked to us and we laughed as they put on their coats to politely usher us out.\n\nI recommend: Chicken Liver Mousse, Bitter Salad, Pork Chop, Chicken, Pumpkin Ravioli, Guiness Cake.", "author": "s h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "went here for a birthday dinner. had a unique risotto. definitely great for date night. would go again for a special occasion", "author": "Diana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-16", "description": "wow! for a dish which has been hyped to no end, the pork chop with jalapeno grits is definitely worth eating again, and again, and again... also split the cote de buef w/ bone marrow which was quite good, but is a notch below minetta tavern's... this is definitely going to the top of the neighborhood rotation!", "author": "Ken L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "The octopus salad is a truly singular and beautiful thing. It has kind of become a part of me, I think about it every now and again, I feel as though it expanded my horizons slightly, like a good artwork.  It's an inspired piece, and I highly recommend it.", "author": "R W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "The food was outstanding here! The garden was lovely, and the inside had great ambience as well. The pork belly appetizer was unbelievably good, and the cast iron chicken was one of the most delicious things I've eaten in a while. Prices were definitely fair. The only reason I wouldn't give them 5 stars is the service -- it was (weirdly) simultaneously attentive and unfriendly. The staff kept trying to take our meals and drinks away before we were even done, and there were no smiles, thank-yous, or good-byes as we passed several staff members on the way out. If they can lighten up and smile a little this place will be unbeatable.", "author": "lucy l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-12", "description": "OK, More like giving 3.5 stars. Why so low?\n\nWell I arrived at 6:30 and was told 1 hr and a half to 1 hr 45 min wait for table but if I wanted I could try to snag a table at the bar since they are first come first served.\n\nAfter about 15 mins I managed to sneak in when somebody left. After about 10-15 mins the bartender finally came over to me to take my order. Definitely a very disorganized system, even though they are very busy.\n\nI settled on the Lamb cannelloni to start, then the Red Wattle Country chop and I got sides of jalapeno grits and brussel sprouts.\n\nThe cannelloni came out within 10 mins of me ordering so right away I was thinking we are off to a good start. The lamb cannelloni was great, piping hot and full of succulent and tender pulled lamb meat topped with a delicious fonduta cream sauce. It was perfectly browned on the outside and I was given two large cannelloni but took 1 to go. \n\nBut then is when the meal started taking a bad turn. I waited nearly 40 minutes before I got my entree. The bartender finally came over to me and said its been awhile let me check on your food. Problem is when you dine solo and sit at a bar I think you kind of get neglected but w/e. \n\nI requested my pork chop \"extra rare\", even knowing and being reminded by the peson who took my order that they tend to cook it on the medium rare side for pork. But I wanted it even more rare than usual. Alas, when the chop came it was cooked somewhat pink but nowhere near as rare as I had wanted. By this time I was starving and just ate it. The chop was good don't get me wrong but certainly nothing spectacular. I was expecting something really special given all the rave reviews and Frank Bruni calling it one of the best things he ever ate. It was just lacking something- I thought it would taste more like a dry aged steak but it didn't. Still, it was tasty and tender and good just not great. And I have to admit the portion size wasn't all that big as others say. Regrettably, I even had to ask for more sauce to add some flavor to the pork chop. But they do get an A for presentation because I love the wooden board they serve it with. The sauerkraut was just a garnish and an afterthought. I had a few forkfuls but it was a waste of stomach spance IMO.\n\nThe sides were awesome! Jalapeno grits and brussel sprouts with walnuts and maple syrup. Definitely great additions.\n\nI give Vinegar Hill House 3.5 stars because of the long wait, so so service, cramped atmosphere, and a kinda disappointing pork chop. I will try to come back again since the chicken and wild boar shank look terrific.", "author": "G C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "Refreshingly simple, seasonal, fresh, delicious food. Reading bad reviews of places I happen to love always makes me suspect there's so much more to a reviewer's story than they are willing to reveal. This is again the case with Vinegar Hill House (VHH). While it gets a fair amount of well-deserved praise, I just don't get the negative reactions to this place. Anyway, VHH served me and my friends a great meal. The staff was handsome, welcoming, and casual yet there when we needed them. We were steered toward excellent wine selections as well as spot-on appetizers. What we had: chicken liver mousse (highly recommend if you're into it - not sure it's for everybody), head-on prawn cocktail, heirloom tomato baked tart. No complaints - wouldn't change a thing. Entrees - boneless short ribs, pork chop, corn, bacon, and jalapeño ravioli, and a side of roasted beets. Everything was shared among us and not a misfire among the lot, but the favorite entree was the pork chop - it was spectacular (and apparently a staff favorite). For dessert we had strawberry shortcake, Guinness chocolate cake, and a cherry tart. Winner that round went to Guinness chocolate cake, but again, all the desserts were very good. What put the cake at the top was its dense moist texture and bittersweetness. Our group favored that slightly under-sweet quality; it may not be everybody's favorite. \n\nWe sat in the charming garden out back on a cool night. I wouldn't say the seating out there was the most comfortable, but the atmosphere was good enough to distract. Now, be warned, the neighbors have a little construction project currently underway, so toward the end we were serenaded by power saws. It was annoying, but by then we didn't care (other patrons were not so amused). I recommend the interior dining room if you want a sure-thing romantic atmosphere. As with Freemans, this place has the time-warp pre-1900's look down to an art - minus the stuffed animals. I know many reviewers are jumping on the \"seen that, bored with it\" bandwagon, but I never get tired of the look. How can you complain about a screen door for an entrance? Loved every detail.", "author": "KENT A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Always great but sometimes a little too meaty. It's good for special occasion eating but not good for the body for everyday. I love the decor and the Americana/ found object/ installation art (the cool gem stone mosaic window) decor. Always a favorite.", "author": "Naomi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "One of the best new restaurants I've been to in a while!  We had a great experience here.  The atmosphere is great - nice choice of music, perfect lighting, comfortable seating.  All of the food completely delivered:  \n\nChicken Liver Mousse was delicious with thick hunks of bread and sweetly cooked onions to accompany.  \n\nA Cheese and Leek tart was also an unexpectedly large appetizer (making both of them worth it!) and so, surprisingly, great for splitting.  \n\nFor an entree, we got the Leg of Lamb special (delicious) and an artichoke side that was cooked to perfect tenderness with a tangy sauce.  \n\nBoth desserts were the perfect end to a delectable meal:  Butterscotch custard was just the right consistency, and the Stout Cake had chocolate frosting that I wanted to lick off the plate.\n\nThe best part?  The prices are totally reasonable.  The menu is small and seasonal, so I'm already excited about returning and trying new things.  And I could bring anyone here - friends, parents, boyfriend - and feel totally comfortable.  I look forward to becoming a regular!", "author": "Elisa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-13", "description": "I've read through and think most of these reviews are dead on.  I went there last night for \"date night\" with my boyfriend.  We arrived admittedly at prime dining hour (8 pm) and sat at the bar to wait for our table.  Drinks are on the expensive side.  Better to go with a bottle of wine (they have five under $30).  The staff was fine; you could tell that all of them were weeded and had no time for personal service but they weren't rude or offensive.  They were just busy (I also got the impression that a lot of guests there last night were the \"complaining makes for an enjoyable meal!\" sort).  \n\nAs for the food, again, a lot of the comments are spot on.  The chicken liver pate was sooooooooooooooooooooo good.  SO good!  Served in a cute little mason jar and topped with pistaccios, it came along side sweet onions, frissee with a hint of mustard sauce and three DELICIOUS slices of thick, toasted bread.  Let me say it one more time: SO good!  \n\nAS for the entrees... eh.  As others have commented, the pasta was salty to the point of almost being inedible (and I am a woman who will lick the salt off the pretzels and then throw them away).  It tasted like they over salted the water.  Again, it was late, so I'm sure the water wasn't fresh, but still...  it was disappointing.  My boyfriend got the chicken which was good but again, it was nothing spectacular.  We also shared the beets.  Again, they were good but not GREAT.  \n\nA lot of comments have been made about the portions.  I thought they were more than adequate and in face both my boyfriend and I left very full.  My one biggest complaint was that it was extremely loud in there.  We ended the meal like mutes because trying to yell to each other over the din of the other diners was frustrating and futile.  \n\nAll in all it was a good experience but not GREAT.  If you are in search of local, seasonal fare that's truly something to remember try Marlow and Son for the same price.", "author": "Aeriel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-08", "description": "Vinegar Hill House is a trip in every sense.  It takes walking through no mans land to get there, and once you're there you have to wait so come prepared with something to do with your time.  It's super homey and has a very Marlowe \u0026 Sons esque feeling- tons of watiresses in plaid, a bunch of bearded men in the kitchen, and a rustic well priced menu.  I had the octopus to start and it was amazing.  At other restaurants octopus is sometimes doused with butter and is too rich, at VHH it was light and tender.  We shared mains of wild boar over polenta and the pork chop.  I think the pork chop stands out more, it has great flavor without being heavily sauced.  The brussel sprout side dish was good, but the lemon overpowered the mint.  We passed on dessert because we were full and the passover diet doesn't allow for such indulgences unfortuneately.  I'll definitely come back to VHH, it was one of the better meals i've had in 2010.", "author": "Allison H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "What can I say that hasn't already been said for a restaurant that you need to search for in an out of the way location that is always crowded. Atmosphere is terrific. Great place to go with someone special for a delicious meal in a casual and wonderful setting. Everything we had was delicious.", "author": "H L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "Had an excellent experience overall.  The food was sensational, drinks were great and our waitress was lovely and highly knowledgeable.  Would definitely returna gain.  we didn't have to wait long for a table (about 20 mins at the bar) for a party of two on a Tuesday night.  We arrived early though which I would recommend (around 6 or so).  Only complaints: the bar service was not very friendly and the guiness cake (which I had highly anticipated) was a little dry.  That being said, our meals, were sensational and I would absolutely recommend it!", "author": "Allie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "I absolutely love Vinegar Hill House, enough to trek all the way from Upper Manhattan. Yelpers here have already identified the best dishes -- the fabulous Red Wattle Pork Chop served atop a seasonal side (I've had potato salad, grits, and others), which is best shared with a lighter entree. Always try their appetizer specials -- they change with the seasons and always taste incredibly fresh and delicious. And if you have room for dessert, the Guinness chocolate cake is the way to go -- rich and delicious, but not overly sweet. I wish there weren't always an hour-long wait, but I guess it's quite deserved. Yum.", "author": "Pian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-21", "description": "really great ambiance and decor, food was just delicious. we had just gotten back from a trip where we had fresh coconuts so we were really craving them and vinegar hill house surprisingly had them.", "author": "vina t."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-14", "description": "I would have given this restaurant 5 stars if it wasn't for the hag hostess. The food was fresh and bright, the ambiance rustic and warm, the waitress lovely......but that hostess with her sideways evil glance ruined the entire vibe. With her vivid red lipstick I swore she was sneering. If she ever pushed aside her hipster bangs, she was either rolling her eyes or glaring. At one point she violently pushed my boyfriend aside to readjust some make believe authority she had over the \"townspeople\". Don't know who died and made her sheriff but the restaurant is 4x4 and people are trekking through rigid winter chill to get to this place for a 20-30 minute wait because they don't take reservations. I think they do this to look over-crowded thus NY exclusive. There is no place to wait except for the bar, which is essentially the kitchen? It's that small! If we're enjoying for our prepaid expensive beers at the bar, don't push us. We're only putting money into your pockets. Fire that vampire sheriff pronto.", "author": "AJ B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "warm, welcoming, fantastic food. there aren't many restaurants in new york that do cozy this well. 4 plates at the bar. bartender was awesome. great french wine. loved it all.", "author": "J G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-25", "description": "The food is consistently delicious.  The wait can be insane. We have learned to go really early or really late. The staff seems to have lost their attitude and now are a bunch of nice hipsters. We dream about the wattle.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-13", "description": "Spectacular! Now why is it so difficult to find a restaurant that really knows their stuff?! This place is the bomb. It's crowded and popular for a reason. If you have to wait, it's worth it. Everything we ordered was wonderful. Interesting inventive dishes. A lovely wine list as well. And the service couldn't have been better, especially considering how swamped they are.", "author": "ada b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-07", "description": "Ugh, I've never written an online review before but I'm still so upset about our experience at Vinegar Hill House on Tuesday, that I feel compelled to...My husband and I were out for our anniversary and were so excited to be eating here after reading such great reviews and seeing the gorgeous photos in the New Brooklyn Cookbook. The ambiance and decor of the restaurant definitely lived up to our expectations as did the pork belly appetizer we ordered. However, once the entrees were brought out, my husband was shocked to discover his cast iron skillet chicken was extremely undercooked. The waitress came over and took the dish away without an apology or offer to bring a different dish, which is what he actually would have preferred. Then a few minutes later another person set the exact same piece of chicken back in front of him and walked away. Not wanting to cause a scene and assuming the error would be made up for on our check, my husband begrudgingly finished the now completely unappetizing chicken (I'm also 39 weeks pregnant and he didn't want me to not finish my dish, haha). However, we received the check shortly thereafter and there was NO DISCOUNT whatsoever--not even free drinks (we only had a beer and a diet coke)! We were furious and appalled that there was no apology or any acknowledgement of such a terrible mistake on the part of the chef. No one at this restaurant seemed to care that they could have made a customer seriously ill nor did they care about making sure their customers come back again. Needless to say, we'll NEVER be dining here again and we will be sure to discourage our friends from eating here. If anyone is looking for a similar chicken dish, I highly recommend The Good Fork in Red Hook. The owners take great care in the dining experiences of all of their customers and the food is perfect EVERY TIME.", "author": "S P."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}