{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "I've been here twice for brunch, and both times were amazing. The place felt very homey, but a little small because depending on where you sit, you could be pretty close to your neighbor.  Both times we got the sourdough pancake and pork and grits. Sourdough pancake here could arguably be the best pancake I've ever had. Pulled pork in pork and grits was tender, juicy, and flavorful, and perfectly complimented by the grits and tomato sauce. Both times those dishes were sooo good that I don't think I'd want to try other dished from them.  \n\nOne note tho, the first time we came, it was a male server and he was VERY slow on everything, I had to wave him down multiple times to get coffee and water refilled, and order our stuff. The second time we were seated on the other side of the restaurant and a lovely lady was our waitress, and she was on point, quick, and very nice. The inconsistency in service is the reason I trimmed on star off them. Maybe train the male server a bit more?", "author": "Lu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "At first I wasn't sold on the snooty attitudes and (I'm a very picky eater) lack of menu options. However, our server was really sweet and I ordered the sourdough apple pancake and WOW!!!!! Let me just tell you, that's one of the best breakfast items I've ever had! It was one of my favorite places I went to in New York and highly recommend going. It's very charming.", "author": "Luna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "Over all 3.7 stars. Take F train to york ave stop. Cozy rustic spot to gather small group of friends for dinner. The menu is limited but all pretty good. Our group of 5 probably shared half the menu. \n\nI can't say anything was sooo awesome that would entice me to order again but most items were done well and satisfying. The prices are higher than expected and the location feels remote and easy to miss.\n\nThe skillet corn bread topped with butter is large enough to share (I would not get this if I was sharing with just 1 person).\n\nThe roasted chicken was tender and the onions were good. \n\nThe pork loin was super tender and served medium well with large slices and side of beans.  \n\nThe chicken liver mousse was pretty good with caramelized onions on toasted bread. \n\nThe manicotti was personally my least liked. Everyone else loved it. It wasn't bad at all but I'm just not a huge pasta fan. \n\nThe tomato salad was refreshing and light. \n\nThe octopus was good but forgettable...i think it had corn and chickpeas that lightened the dish. \n\nWe tired the Guinness chocolate cake with was rather very good. The other panacotta with smoked strawberry had actually more savory notes.\n\nI didn't care for the cocktail menu so I opted for wine..i got a voigner but I didn't like it. \n\nThe staff was attentive and friendly. Certainly pleasantly  surprising experience given the location.", "author": "Shambavi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "Very cute little place. Small but managed to get in without a wait at noon on Sunday. We were a little surprised at the limited menu (had we done a little more research we would have known this ahead of time), we ordered the sourdough pancake and the beet omelette with a side of bacon and potatoes. It was plenty to satisfy our hunger. Would definitely recommend!", "author": "Amelia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-11", "description": "I give Vinegar Hill three stars for food and one star for management and service. While the dishes served to half my party were excellent, everyone else's dishes were just ok. Overall, the vibe and atmosphere are what is most appealing about this place. The service and management however, leave much to be desired -- with an emphasis on the restaurant's management. We waited 10 minutes for a table that was sitting empty yet designated ours. Our server was good but we waited a bit too long for food to be served. And even though we ordered several of the pricier bottles of wine on the menu, we kept having to refill our glasses ourselves.  At the end of our meal while we were lingering and chatting and finishing our wine, servers and bus boys were fluttering around us, clearing the table and obviously trying to rush us out so they could turn the table. They even scooped up a friend's glass of wine that still had wine in it! This was quite insulting to my party and really put a damper on our dining experience. This is not the type of restaurant you expect to be treated as if you were at a coffee shop or Greek dinner! how we were treated at the end of our meal was rude, insulting and inappropriate. Can't say I've experienced this before in a restaurant that charges these prices. And clearly at fault is the manager. She obviously doesn't know how to run a higher end restaurant establishment. Despite good food and atmosphere, given the experience and the caliber of management I don't plan to revisit or recommend Vinegar Hill to anyone.", "author": "Chrysanthe G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Great food. Apple pancakes were SO DELICIOUS! My family had to catch a flight and we were pressed  for time and they were so attentive to the time sensitivity.\n\nPLUS FOOD WAS ABSOLUTELY DELICIOUS!!!", "author": "Maria L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "Bad service! Was there for my birthday with 18 friends and it was awful.  Overpriced, charged me 75$ a person family style and there was not enough food. Few to no vegetarian options, broken chairs. They had us in the garden sitting at makeshift tables and made some of the guests sit on the edge of a planter with low bad rickety tables. One guest who is tall couldn't even get his legs under the table because he was sitting on edge of high planter. A truly awful experience!", "author": "Roger W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-24", "description": "Sadly, very disappointing. Found the atmosphere cool and unwelcoming. Though the restaurant was almost empty, my friend wasn't allowed to wait at a table though I was only 5 minutes away. The food: I ordered the Spicy Green Salad - which was not spicy at all and the greens tasted like bagged greens from a supermarket, tasteless and tough. The portion was ridiculously small for $13 - and the wait staff neglected to bring salad plates though my friend and I were sharing. I was excited to order  the shrimp and grits. I don't even know how you make grits with cheddar cheese so tasteless. It was very bland. Had it been tasty, I would have been disappointed by the size of the portion, also. Salad and my main course came at the same time, while we waited for my friend's entree. Her omelette underwhelmed, as well. Still hungry, we hoped for dessert - but they don't serve dessert for brunch...", "author": "Maggie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "The only thing that was good here was the cornbread. Now that they took it off the menu, this place isn't really worth the trip. \n\nEverything is extremely overpriced. The chicken tastes good, but is not worth $30. We also tried their market fish- it was nicely seasoned but the price to portion ratio will leave you wondering why you ordered the fish.\n\nIn conclusion, if you have dinner here, you'll be leaving this place broke and hungry.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-15", "description": "High Manhattan prices in a remote Brooklyn location. Extremely overpriced. Chicken is $29 and you have to order a side to get a decent meal.", "author": "roland l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "We came here with reservations it took ten minutes to seat us. We got seated with a couple who just walked in. Then the waitress takes their order ignores us for ten minutes mean while the couple next to us got their food finished and paid for their meal before a single plate touched our table. This is in a 1 hour timeline from the moment we were seated. The only consolation was that the food was great. My wife was so excited to finally try this place but I have to say we were thoroughly disappointed. I would have given 0 stars but the food gave some redemption.", "author": "James Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "Wandered in to this charming little restaurant on a rainy Sunday evening. The atmosphere was warm and the service was excellent. We only had appetizers and drinks but it was well worth the walk. The Spicy Greens were really tasty and the Chicken Liver Mousse was out of this world. We will be back again soon.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "Food was good, but a bartender named Mike was incredibly condescending and rude. Definitely left a bad taste in our mouth before we left.", "author": "Jonathan O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "DELICIOUS! Make sure to make reservations! This place is so good. You can tell the menu and plates are so thoughtfully planned. I love little places like this with a small menu because you know the food will be great.\n\nThe scallops were cooked perfectly and was so visually appealing! The bright colors just made this dish!\n\nThe atmosphere is very cute and great for a date night or a girls dinner! We came here before a show and the server's even asked when we were seated if we were trying to make the show which I appreciated greatly.", "author": "Eugenia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Great aromas and quaint setting easily make this a great spot for date night. We tried the Asparagus, Beets, Cast Iron Chicken, and the Pork Chop. Wash it all down with a Ginger Beer and relax in this chill trendy unassuming spot. Highly recommended.", "author": "Erik T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-01", "description": "I'll start by saying that the service and backyard were excellent. I've read so many good reviews about this place, but not worth the hype. The sourdough pancake was good, but the eggs Benedict and burger were way overpriced, small, and underwhelming. Disappointing.", "author": "Kyle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-14", "description": "These 3 stars are for the chicken liver mousse and ambiance which I crave all winter long.  I've been coming to here since 2012 and have never had a negative experience until last week.  But alas, it was truly disappointing, especially since it's always a special trip from the city to be there. The hostess was unfriendly, our server was unknowledgeable and the food was subpar.  I honestly couldn't believe it.  We kept ordering more dishes thinking that the last was a fluke!  I've never written a yelp review but I was so disheartened and bothered by everything that I felt it was warranted.  Hope you get it back together VHH- I still love your mousse!", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "Trek past the dense tourist crowds loitering at the foot of DUMBO, past cobblestone streets into a sleepy little street and you shall stumble across a quaintly rustic hideaway. One pancake swallowing the diameter of the plate upon which it is served, flat and dense in texture, crispy edges softened by caramelized bananas embedded within, this is the homely pancake that you could cook...if only you could bother turning on that stove at home. Aye, why bother when someone else can do it for you?", "author": "Dessert Correspondents O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Magic. I had dinner with two friends here last night and we were over the moon by the time we taste the first few plates we ordered. \nWe decided to share lots of small plates because we weren't sure what to eat, and I think we won, because we were able to taste more than an usual dinner. Every single choice was incredibly tasty between the acid vinegar salad, the grilled smoky octopus, the delicate asparagus with ricotta, fresh prosciutto and sweet warm cornbread. \nWe all got glasses of different roses and they were all good as well. To end, we shared a slice of chocolate Guinness cake with a top layer of cream cheese frosting, which was surprisingly really light! Not sweet at all, just cacao. Amazing. Can't wait to come back!", "author": "Martina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Came here for my boyfriends birthday with his family. Service and food were excellent! It's sort of in the middle of no where, but I will definitely make the trip back!!", "author": "Vivian H."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}