{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "Is the food good? Yes, it's unique, basic and tasty. However, they could use some points in the comfort level department. The outside setting, is adorable, however I felt like I was sliding off the chair, or I felt like I was going to break the flimsy compilation of wood that formed a \"chair\". \n\nThe menu was severely lacking in vegetarian options, except for the salads, which were spectacular. \n\nThe food was tasty, simple and portioned to be too small for a plate that was in general over $25.00.\n\nThe desserts were too ridiculous, tasty, but ill conceived, and for 12,00 TOO EXPENSIVE. \n\nI wish there was more interaction and a hint of intuition on our waiter's behalf. We kept asking for napkins so the silverware wouldn't touch the tables. No extra napkins were provided. \n\nWhen asked for a piece of bread, such a demand was unable to be met by our waiter, Come on! \n\nGlad I came, but anyone who glorifies this place, needs to step out of the neighborhood, and the hipsterdom that has invaded. \n\nIt was tasty, simplified food, with a too hefty price tag.", "author": "Queen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Came here for Saturday breakfast - such a cute place! Got here about 1030am - not many people around, which is perfect - such a nice change from the hustle and bustle of so many cafés with ridiculous wait times. Come here, grab yourself a coffee and read the paper.... And eat the food!! Got the salmon with eggs dish - so beautiful to look at and beautiful tasting! Service was attentive. Tea came in these large, divine teapots. Would come back here to feast on their speciality - pork!", "author": "Emily T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "I don't often have a Sunday off from work so when I found out I'd have the time to visit during brunch, I made a reservation immediately because I'd heard so many great things. They are all true! \n\nThis cozy, unassuming spot is in Vinegar Hill, which can be tricky to get to. Some say its desolate -- I say its uniquely quiet, charming, neighborhoody, and I would NOT be worried about getting mugged there. I keep reading that in other reviews. No one is going to mug in you in Vinegar hill (they are going to mug you outside the projects on Navy St. at 4am, duh). I would move to this neighborhood in a heartbeat. Street parking available, and there is an art gallery across the street as well that was having an event when we visited at 1pm. \n\nI got the Pear Sourdough pancake and it was amazing. They served it with a hefty helping of butter, which I recommend you remove quickly or your pancake will taste VERY buttery very fast, not that I really minded but you might. We also indulged in a side of bacon to split. This is real bacon, not that store bought crap. This is the stuff my dad used to have hanging in the garage all winter, which totally grossed me out during my 7 year stint as a vegetarian. \n\nGreat service, very organized,  and we didn't wait terribly long for our food. The only thing I can say disappointed me was the fact that they only had drip coffee and I love my americano in the morning. But hey, everything else was great and I know how much time it saves them not fussing with an espresso machine, so in the end I'm cool with it. Cannot wait to come back for dinner and cocktails!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Aaron was such a super attentive server!  Our Time in this tucked away spot in Brooklyn was amazing....my only problem?  I have to come back again and again!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "A lovely little gem located in a quiet part of Brooklyn near Dumbo. The decor is very cozy and the staff is very friendly too.\nThe sourdough pancake was really delicious. The crispy edge and fluffy dough makes this one the best pancakes I've ever eaten. Topped with a tablespoon of butter and some maple syrup this was very simple yet extremely pleasant - and not pricey either.", "author": "Oskar W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-24", "description": "The Good.\n\n-Sitting at the bar. It's just better. Especially here, because of...\n-The bartender. He knows his menu, his winelist, and his cocktails.\n-The way the fish entree tasted. I loved the \"cracklin' duck skin,\" and the combination of olives and other goodness it was served over.\n-The torta rustica. It was kind of like a small, hearty quiche.\n-My date. She is the world's most interesting and beautiful woman, and no, of course I'm not just saying this because she is displeased with me at the moment. \n\nThe Bad.\n\n-My enormous ass. Because of it, I was completely uncomfortable on the...\n-Triangular bar seats. It's like eating dinner on a bike seat.*\n-The salad. Overdressed, and the bacon was hopelessly undercooked.**\n-The tiny portion of fish. It tasted great, but it was a laughable amount.\n-The tiny portion of pasta. I didn't earn that ass from eating meals this size.\n\nThe Ugly.\n\n-Me. Look. I know I'm an uncouth American with an outsized appetite. But for an $80 dinner for two...if I'm not going to be impressed, at least I'd like to be full. And I was neither.\n_________\n\n*But when people leave you can steal their full-assed seats, and all will be well.\n**Yes, I still ate it. But she was repulsed, and not just by me.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Wife's friend suggested. I looked at menu on Yelp. Great reviews, wasn't really interested in the menu online. Must admit I was wrong. Great place. Hidden gem in Brooklyn! Great atmosphere, simple. Great flavor, cocktails were great! Absolutely love place! Definitely one of my favorites!", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "We only stopped in for quick drink but are super excited to return to try the delicious looking food! Our cocktails were perfect! I had a matcha infused cocktail, which was right up my alley despite it being the 'in' drink of the moment. It wasn't kitschy. I loved sitting at the bar and being able to see into the kitchen. The ambience is very nice with great lighting and good music. Very excited to try the food, which appears to be mostly served in skillets.... Until we meet again!", "author": "Taylor C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-13", "description": "I would like to start off with the fact that the food is pretty good here. Only problem is you get very little of it and it's extremely overpriced for the portions. Be prepared to leave hungry!\n\nI went here with my boyfriend and a group of friends last night and ordered the carrots, the heirloom tomato salad and the pasta with goat cheese, sans the lamb as I don't heat meat. Everything was TINY. 5 carrots, literally. Even coming out on the ceramic plate with all the garnish, it looked pathetically small. The portion of the pasta was laughably small. It would have been sufficient for a 2 year old. I am not exaggerating. Not to mention that when we received our bill, they charged us full price for the pasta even though it was not smothered in lamb! I think that is highway robbery and plainly unfair. When my boyfriend asked the waiter about that, he stated, in a not particularly nice way that they don't lower the price. Was not gracious or even slightly accomodating.\n\nI will not be going back.", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-15", "description": "Absolutely charming ambiance. Warm. Friendly. Great bar vibe. SO wanted to love it. But the acorn squash was poorly prepared with raw skin and an acrid olive tapenade. And the skirt steak was served rear in 1/2 inch cubes rather than thinly sliced. The side of creamed veggies was served as a slop - running all over the plate - and hideously salty. Just simple stuff - with short cuts and the \"we're cool and  don't need to take care like we used to\". A shame. $141 for one app, one entree and cornbread (with a huge dollop of butter drenching it) plus a decent bottle of Greek red wine. Will NOT be back.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-24", "description": "Gives a vibe of farm to table, supposedly sustainable, but there's nothing sustainable about having only one (mediocre) vegan option on the menu. The server was kind of enough to put in a \"vegan plate\" for me which I was really excited about. What did I get? Inedible vegetables here and there drenched in oil. Yeah, a place that only knows how to cook/use meat/dairy for flavor is totally sustainable as opposed to just eating the grains you feed the animals.", "author": "Guadalupe T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-09", "description": "Intimate atmosphere and location.  Very cute.  Horrible food and pretentious service.  Typical hipster restaurant where the emphasis is on maintaining a cool environment.  None of the food items we ordered were good.  It's clear the chef or person behind the kitchen is an amateur...would never come here again or recommend.  This neighborhood is desert for restaurants, that's the only reason this place is still in business...", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "This place is now topped as my favorite restaurant in NY.\n\nEverytime I go to Brooklyn to eat... I realize that as far as food for foodies Brooklyn wins out in comparison to Manhatten.\n\nVenue: (3.5/5) Its in DUMBO Brooklyn so hipster cool comes to mind.  But this venue is really something else.  It's a mix of trendy manhatten visitors, hipsters, dates... casual setting that has a great mix of people.  The restaurant has a cute patio area in the back if it is nice outside.  \n\nFood: (5/5) Go for the RED WATTLE or anything Pork here.  I think about this dish all the time and recommend it to anyone.  I ended up sharing to my table of 5 too much of my red wattle, and everyone after the meal had food envy.  Every dessert was made from scratch... so good!  \n\nService:  .... Too many drinks lots of laughs, really don't remember the service was bad or good\n\nA MUST TRY THE FOOD IS AMAZING", "author": "Lana T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-15", "description": "Came here last night with a vegetarian friend of mine--I guess I can thank Vinegar Hill for reminding me of the valuable lesson to always check the menu before going to a new place (they offer virtually no vegetarian options). Aside from that, not much to speak of here. Snobby, pretentious crowd despite a warm and intimate ambiance. The only thing waitstaff seems to care less about than your dining experience is their manners. \n\nI have to admit though, the asparagus with what tasted like basil and pine nuts was yummy--as well as the pistachio ice cream, which had a syrupy aftertaste and a velvety, homemade texture. Wine selection is great. \n\nI've had much better and way worse, but overall if you're looking for a date/dinner spot, go to Superfine a few blocks away or take a 15 min walk to Brooklyn Heights and explore the eateries in that area. This is one of those places that gives you a meal at a price tag much higher than what your dining experience was actually worth.", "author": "Niomi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "My partner and I recently returned to Vinegar Hill House for our anniversary dinner, two years after our \"first date\" dinner there. We're very sentimental about VHH for obvious reasons, so we were hopeful that we have as lovely a time as we did on the first visit.\n\nThankfully, the restaurant is still as charming as we remembered. It has a rustic farmhouse feel to it, with a fully stocked bar on one side and a backyard garden in the back. We enjoyed our dinner outside and were attentively served by a friendly waitress who checked on us at periodic intervals throughout the evening. Mozzies and awkward wooden picnic chairs aside, it was a peaceful environment to enjoy our food.\n\nWe opted to start with the chicken liver mousse, which was served on a wooden board with a mason jar of the mousse, accompanied with caramelized onions, frisee, and thickly cut rustic bread grilled with olive oil. Our waitress was kind enough to request additional toast on our behalf, knowing we were sharing the app.\n\nAs for entrees, my partner had the country pork chop with tender fingerling potatoes, which was heaven. My arctic char was perfectly cooked and flaky, and I loved the fennel yogurt that was drizzled on the side. Both mains were excellent and I appreciated the presentation put into each dish.\n\nAll in all, with the two drinks we had with our meal, we escaped without putting too much damage on the wallet. I might be slightly biased, but for romantic dates, VHH can't be beat. Trust me on this one :)", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "I've been here a handful of times for dinner, and only that bar (so do that with that what you will):  The food is excellent, ambiance great, bartenders awesome and cocktail list substantial.  It IS expensive.\n\nGreat for a 1st date or if you have loved ones in town.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-21", "description": "We saw pretty much nothing in the surrounding area, and did not really have high hopes for this place. However, the ambiance and the crowdedness definitely surprised us - rustic decor, decent crowd.\n\nIt was pretty annoying when they made us wait at the bar for 10 min, especially when the place was 2/3 full. Probably trying to push drinks on us, but drinks on a Sunday night don't go well with a Monday 8 am meeting!\n\nCame with two others, and we split the food family style. By the time we were ready to order, the waitress informed us they were they were out of a few things - among which were two we wanted to get: sea scallop appetizer and spicy greens. The waitress recommended the duck liver mousse with onions, which I found so-so. Also had the lamb ragu pasta, which I found rather tasteless, and the lamb neck, which was decently prepared. I preferred the octopus risotto out of the dishes we got. The risotto was kind of mushy, but the octopus was good.\n\nThe food was decent, but the portions were definitely on the smaller side, so we ordered three desserts. The lemon tart was hands down the best. The yogurt cheesecake was ho-hum, and we could barely taste the bitters. The Mexican chocolate bar definitely surprised to the upside with a nice spicy kick\n\nIf you're in the area, worth it to check out, but it's hard to justify the trip out of Manhattan.", "author": "Eva W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "WDD - We did damage at Vinegar Hill House last night.  \n\nCame here with 3 other guys and some big appetites.  For a Thursday night, it wasn't crowded at 9pm and we were able to sit right away.  We ordered some drinks which took a half hour to come after multiple apologies from the wait staff.  This was my only major complaint about the meal and they comp'd the dessert to make up for it.  No harm, no foul there.\n\nWe ordered 4 different appetizers with the standouts being the House Bacon and the Chicken Liver Mousse.  We couldn't get enough of these and wish we ordered two orders of the bacon.  It's thick cut like in the steakhouses and not overdone like it can be there.  It was cooked perfectly and served over some sort of pickled celery root.  I could have eaten a whole serving myself so if you come with MEN, order two.  The chicken liver mousse was just as good, if not better.  Just like most trendy restaurants do these days, it was served in a jar with some toast and caramelized onions on the side.  The sweet onions paired wonderfully with the light, meaty liver and set a great tone for the meal.  \n\nAll but one of us ordered the chop with the lone man ordering the chicken.  We were all very satisfied with our meals as evidenced by the silence that fell over the table when the entrees came out and the clean plates that was the aftermath.  The 3 chops were all cooked to a different temperature which was disappointing to see but it didn't stop us from going to town on them.  There was so much meat, almost too much, but I didn't hear anyone complaining about that.  \n\nFor sides, we ordered the cornbread and mushrooms.  The mushrooms were good but the cornbread was OUT OF THIS WORLD.  By far, the best cornbread I've ever had and that's saying a lot.  It was served in a skillet and came out with a tablespoon of melting butter on top.  The kicker was the jalapeno honey.  It added another layer of sweetness to the already sweet cornbread.  Every one at the table couldn't get enough of it.  A great complement to the protein heavy dishes we ordered.\n\nOverall a great experience at VHH.  I can't believe it's taken me this long to get here but I certainly wont let it go that long again.  I will be back sooner than later.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "THE CHOP!!!!!\n\nGo with 3 or 4 people.  Order a few things all to share. Then make sure you all get a bite of the CHOP.. \n\nThe wine list is good, and the old fashions are better!\n\nMy last time there I was lucky enough to have the jalapeño maple butter biscuits !!! Wow!\n\nMenu is full of delights .", "author": "Dave F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "This place is a hidden gem, off on a quiet cobblestone street in Brooklyn but worth the hike if you don't live in the area. The atmosphere is very quaint and the crowd unpretentious and sprinkled with many ages and even different nationalities. \n\nI ate here with my sister and friend for dinner last night. They had several goat dishes which we all found very interesting since none of us had ever eaten goat. We started with the goat crostini which was served on a wooden board with a mustard and a jam. \n\nMy sister had beer since there were no vodka cocktails and I had the bourbon cocktail which was delicious. They even made a mocktail for my friend who is expecting. \n\nFor our mains we were slightly boring and all got the cast iron chicken. I NEVER order chicken in a restaurant but this was delightful. We also got a side of the cornbread which had a lovely honey flavor and was served just like my mom makes it, in a cast iron skillet. \n\nFor dessert we had a brownie with mint ice cream so it had a bit of a mint chocolate chip vibe. Overall the place was a hit and we will definitely go back! \n\nOnly reason not to get 5 stars was that our server was a young guy and was a bit of a jerk even to 3 nice young ladies.", "author": "Lauren P."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}