{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-26", "description": "Went here a couple of years ago and loved it so much that we were so excited to enjoy another uniquely exquisite brunch this Sunday.  We did check out some newer reviews that were critical of the service...but as long as the food quality was the same then we could endure a somewhat-justified attitude.  \n\nAlas, it had not been.  They are completely resting upon their once-earned laurels and the awards posted by the front door.  Nothing was beyond mediocre:  shakshukah,  pancakes, omelette - even the toast was average and not worth the travel time or price.\n\nLike a once good wine...it's turned to vinegar (and yes - that just came to me).", "author": "Chaim L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "Staff was friendly great warm environment.\nThe food was alright for price would recommend!", "author": "Carolyn G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "We came for a dinner on Saturday night. The place is small and extremely loud. We ordered the octopus as an appetizer and it proved to be good. I ordered the pork chops and it turned out to be severely undercooked. The chef had obviously no clue about hygiene standards when it comes to cooking pork. I asked them to cook that well done, as it was pork, and not beef. They returned the dish to me slightly better cooked, but still undercooked. Finally, the prices did not correspond to what we got, as it was clearly overpriced. We will not come back.", "author": "Yiannis C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "Confused. Everywhere I look, the hours are listed as opening at 10:00am for weekend brunch though when I walked in today at exactly 10:00am was told that they open at 10:30am...\n\nThe place looked cute, the food that they were preparing smelled delicious, though was not hanging out for another 30 minutes as I had been walking around already for a couple of hours that morning. \n\nPlease figure out when you open.", "author": "Marie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "This restaurant made me feel very beautiful to sit in. \n\nMy girlfriend and arrived when all of New York decided to eat at 7pm on a Wednesday (the nerve of all of them, right?). One of the servers was so sweet and did this priestly (like man of the cloth and not man of 90210) thing where he clasped his hands when he had tentative news like \"your table's not ready yet.\" But, he always had a \"but\" (like man who uses conjunctions and not man who uses his rear) and was ready to accommodate with an option that would make us feel comfortable. We had wine, Crispy Brussels Sprouts, Cannellini Bean Panzanella, and Roasted Beets. I recommend all of them. When Father Waiter came and asked if we had allergies I told him but also added that I'm allergic to horses. It's true and he laughed which he didn't need to but it helped me digest. Later my girlfriend told me that horses and camels aren't species-related so I could probably take a camel ride in my future. There was that to look forward to when we got the bill and moved out of the restaurant and back into the camel-trotting world.", "author": "Hector H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "All we could say is Holy Crap!!! Fabulous!!!!\nJoshua our bartender was the bomb, thanks Josh for making our night one to remember. You made the ending of our great day fulfilled... The food here was off the chains... Had the Smoked Bluefish, Octopus and Chicken.. Everything was better than we could have dreamed... CHECK THIS \"GEM\" OUT!!!!", "author": "Sam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Incredible experience tonight. I heard the old chef is back. Shockingly good melon salad, charred octopus, fish w/ calamari ragout, zucchini and incredible cheese plate. Super attentive staff. Great room, great night.", "author": "Bridget D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Drinks and food are good. Cute place with a cozy ambiance, the staff are friendly too. Hope to visit again!", "author": "Gina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Top notch, pancakes for breakfast are some of the best in the city! Dinner is good too (nice tight menu). Staff is friendly and attentive. Overall one of my favorite places to go in the neighborhood!", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-11", "description": "Poor service, bland \u0026 undercooked food, unfriendly staff.\n\nSynopsis:\n\nSat at a table for two in a nook that was designed to host two separate groups of four.\n\nSandwiched in btw a party of four and two.\n\nDrunkard was shouting at his date.\n\nAsked to move because of his rudeness.\n\nMoved us to the bar, but plenty of tables were available in the front and in the basement!\n\nComplained. No response.\n\nOrdered from the bar.  \n\nGot raw chicken and bland gnocchi.\n\nOur concerns fell on deaf ears.\n\nOverpriced, bland, and waitstaff cares little.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "Rude service from the get go. Met with lady coworkers for brunch and not 5 mins after our drink order we were very awkwardly asked to place our orders because they had a really tight schedule. Umm whoa ok, haven't even had a chance to chill and decide what we wanted and it's brunch we wanted a drink first. The food ok. Get over yourself you are not that good. Will not go back", "author": "Caitlyn S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "I am incredibly disappointed with where this establishment has gone. The food used to be delicate, creative and delicious. Upon our last visit the quality of the food and atmosphere has gone downhill. We were super disappointed to see that our favorite dish had been changed. This used to be a staple in our weekly dinner or brunch outings and this last experience left us unimpressed and sad to see that chef Nicole was no longer with them. Hoping to find where she will be cooking next, we will no longer be frequenting this restaurant. I'd advise anyone looking for their incredible  homemade pasta to not waste their time and spend your money elsewhere.", "author": "Zoe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Walking in, you understand the cozy vibe right away. It is an intimate space and has a great ambiance.\n\nWe started with cocktails at the bar, and they were all delicious!\n\nWe started with the chicken liver mousse, which was amazing. We scraped the plate clean. The cast iron chicken was also amazing. The skin was extra crispy and the chicken itself was so tender and juicy.\n\nI can't wait to come back and check out their outdoor patio area!", "author": "Jenna F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Really,really amazing time.  The location is one of my favorites in Brooklyn.  I can't say enough about the ambiance and \"feel\" of the place. The outdoor eating space is so charming and made for a lovely setting for a delicious meal. The cast iron chicken was presented in the cast iron pan, which I loved, and I would highly recommend!  \n\nMagical night and delicious food ( and drink)! Will definitely return... maybe tomorrow for coffee in that outdoor space.", "author": "Brittany G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "It was great. But somehow my quiet friend was a disturbance to a low key Saturday night crew. I apologize for spending an absurd amount of money, next time I'll grill at McCarren Park.", "author": "Kelsey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "Beautiful space and delicious food. I had the pork ragu and what had to be the best cornbread I've ever had -- sweet, caramelized top layer with buttery, fluffy goodness below. \n\nThe ragu and side of greens I sampled were also quite tasty. I also had a refreshing cocktail out back while waiting for my table. This won't be somewhere I frequent though -- my friends and I racked up quite the bill. Great place for special occasions.", "author": "Kim M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Got locked out of a party accidentally one night and hid in Vinegar Hill House until someone let me back in. Drinks were great, restaurant was cozy and the food smelled amazing - surprisingly a very pleasant memory for an accidental lock out.", "author": "Shea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Charming little antique place for breakfats. My husban said: \"these are the best pancakes I have had in all my life\", and I surely agree! The scrambled eggs were also excelent! Escelent service. I will definitle come back.", "author": "Vanessa V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "What happened to this place?! Service was cold. Zombie cold. Rude. Food was fine, not as good as usual. I used to love the ambience here. Something was off in a big way. I would call myself a regular here for the past 4 years. I don't think I'll be back. Another one bites the dust. Really sad. Maybe new owners??", "author": "Helen E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "I am hesitant to post a review, the restaurant is small and I suspect they have a faithful following. I love the location, walk around if you have time and the food/ service is top notch. We where 6 guests and wanted to share the offerings, the advice about portions and making it a delicious sampling was right on. Perfect dining and must have a reservation I suspect.....", "author": "Helene R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}