{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "At this romantic restaurant, chef Brian Leth cooks rustic dishes, from braised lamb to butternut squash tarts, all on a wood-burning stove.", "author": "Country Living M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "brunch was fantastic, food unique and tasty, and our waiter was sweet and attentive as heck....", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-08", "description": "My girlfriend took me here for my birthday, and she had wanted to go here for a while so I was excited she'd enjoy it as well as I.  We arrived at 7pm on a Tuesday and happily didn't have to wait... we were seated near the front window.  The hostess had a somewhat hesitant look and sound when directing us asking twice if the table was ok...  \n\nShortly after I sat down the smell of cat urine wafted over me.  After sniffing around a bit and giving suspicious glances at the surrounding tables, the smell seemed to disipate so I decided to not mention anything as I thought it may have been coming from outside.  A short while after our food arrived (and it did arrive quickly), an even stronger smell of cat urine came back and I noticed the couple next to us making \"pee-yoo\" gestures.  The smell went away again, at this point, I was too discusted to enjoy my meal, but didn't want to ruin my g/f's meal as she hadn't seemed to notice.  Apart from the quick entree delivery, the service was slow from there (took 20 min to just get a dessert order in). The squash side was, however, surpassingly delicious.  Food price was on the mark for what you get, wine mark-up above average.\n\nAfter leaving the restaurant, my g/f mentioned she smelled something \"funny\" in the restaurant, obviously trying to prompt me to see if I'd smelled the same.  I was still hesitating saying anything not to hurt her feelings, but finally broke down and said \"yeah, it smelled like cat p3ss\".  Wouldn't go back.", "author": "Jeb S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-11", "description": "Came to VHH on a recommendation of a chef I met the previous week. Agree that its a great date spot, but he persuaded me to try it out solo at the bar. So I came here by myself Tuesday night 8 pm, to find this small restaurant packed and alive on a quiet lonely street and instantly fell in love. \n\nFound a seat at the bar, where a young Colin Ferell bartender poured my $8 white wine to the brim-- although it was a very small, small glass. As I finished ordering, 2 guys who were also eating solo sat next to me, and we ended up basically chatting and sharing all of our food. \n\nThis is how we rate the food #1 being the best:\n1. The Pork-- juicest, best pork Ive ever had. Just lightly salted and peppered-- but that is some wonderful meat! If I didnt order #1 or #2, this place would probably just be a 3-4 star place. \n2. Chicken-Liver Mousse with pistachios, picked onions, salad with mustard dressing---This actually would be #1, but since I ordered it and LOVED it...I didnt share it...hahaha...so...yeah. :)\n3. Pea Raviolli-- A simple dish, but made me feel so warm and fuzzy\n4. Grilled Octopus-- Actually the guys would probably rate this as #3, but warm and fuzzy wins over well grilled octopus\n5. Trout-- whole trout, good meat\n6. Guiness Chocolate Cake with Cream Cheese Icing-- had this with a min charteusse shot, and it was a wonderful and drunken combination. Great way to end the meal. \n6. Scallop Tart-- This is the only dish I'd skip-- Frankly a scallop should be plump and fat-- but they gave me one scallop, sliced it in 3's and served it on a tart. I was slightly offended. \n\nAnyways so this meal was full of surprises and great company. For the experience and ordering the right food off the menu (#1 and #2) VHH totally deserves 5 stars.", "author": "Yvonne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-12", "description": "My friends took me here after raving about it. We got lucky and were seated with no wait (sunday early dinner). The waitstaff is knowledgeable and helpful. For apps, we ordered the grilled octopus salad with a citrus hint which was delicious. And a artichoke/olive dish which was also good. One friend and I both ordered the crispy chicken w/pearl onions. It was predictably well-prepared and crispy from being baked in a brick oven in a cast iron skillet. Our other friend ordered the steak with sea beans. The steak was very small in size, but it had a very interesting taste that reminded up of fruity pebbles. no joke. It was the strangest experience chewing on steak that had the essence of fruity pebbles. weird. \n\nThat being said, the ambiance is great and was very happy with my experience here.", "author": "Helen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-08", "description": "We live in Brooklyn Heights and decided to go to Vinegar Hill House for Brunch over the 4th of July weekend. Knowing that there was a 'buzz' around this place, we made sure we arrived there just as they were opening at 11am on Sunday. After a beautiful stroll to this somewhat remote inconspicuous spot, we were seated in their charming, rustic, sunlit garden. Our experience couldn't have been more enjoyable. An attentive waiter...great coffee...delicious, adventurous food...and they took credit cards. We never go out for brunch, but I must say that this was one of the best brunches I've experienced, both in terms of ambience and food.  I am anxious to go back for dinner. As for the hipster vibe? This is New York. Live with it.", "author": "Erik P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "Our friend has been raving about this place for more than a year and we finally made it for dinner.  Loved the food and the service.  Will definitely recommend it and we will be back.", "author": "Vivian V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-01", "description": "This is the ultimate first day spot.  In a little neighborhood most folks don't know even exist, with no other restaurants and shops around . . . it's like taking a trip.  chicken-liver mouse with vinegar, almond and pistachios; day-boat monkfish fricassee, heritage spare ribs with beer  braised cabbage, apple, caraway, and mustard.  Need I say more. I do actually, nothing on the menu was above $14 (last I went.)", "author": "Ana J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "Go for the pork!  It's ridiculous!  It's also a cool vibe.  My full review and pics, at this link: http://photo-hungry.com/post/25437088142", "author": "J W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "even if you don't have a car, its not a bad walk from the york street stop ... \n\ngo on a weeknight , get there before 8 if you dont want to wait ... \n\nthe cheese plate is great, however, pretty expensive ($19?)\n\nwine selection is fantastic .. \n\npumpkin ravioli was delicious .. \n\nit is a little expensive, so expect to throw down at least $100 if you want to have a full on date meal  ( cheese,wine,2 entrees) .   but it's worth it .  good energy , nice decor .. the fact that its in such a desolate area makes it pretty interesting as well ..  you could also walk over to dumbo and grab dessert at Jaques Torres .. seriously ... its a pretty normal walk .", "author": "Ken K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-02", "description": "This place may be the ideal boutique-style restaurant. It's small, intimate, cozy, patronized by locals and gastro tourists in the know. The quirky scavenged antiques give it real personality, as does the carefully crafted food, which you can see the chef making in a huge wood burning oven in a tiny kitchen. Even the wait for a table at the bar is pleasant - try the Basque cider. One of my favorite restaurants in the city.", "author": "Gastro C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "I sat at the bar here with my girlfriend last week.\nThe food was great and the host was amazing.\nThe bartender was not up to par. He didn't switch glasses when my girlfriend ordered a new glass of wine.\nHowever, it's a great atmosphere and the bar is a great place to sit.", "author": "Seth L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-11", "description": "Overall, decent food, though the food and service was lacking some polish I expected based on the glowing reviews I had read. \n\n-In terms of the food, each dish I had left a little something to be desired.  The corn/cabbage salad was nice, but the corn was raw, which in my opinion has much less flavor than cooked corn.  The cast-iron chicken was amazing, as numerous reviews have reported, but the dish was just calling out for some tiny roasted potatoes for some variety along with that huge portion of chicken (which I think could be scaled back).  Lastly, the cherry tart was so-so and could have been easily elevated with a dollop of creme fraiche or whipped cream.  Along the same lines, bread service would have been nice.\n\n-It seemed like the restaurant ran out of wine glasses.  Our wine was served in tiny little cups (not normal size stemless glasses, but really tiny cups; the wine came all the way up to the brim), while everyone else we saw had normal wine glasses.  Not a huge deal, but it was a little weird to drink out of such small containers.\n\n-The service was fairly friendly, though not as attentive as it could have been.  For example, when we shared a salad they did not bring us a spoon to serve with, so we were awkwardly using our forks and knives to dish up a corn/cabbage salad.\n\nOn the good side, we showed up on a Sunday night around 8:30 and my party of 3 was seated immediately.  The restaurant interior has a farmstead-chic aesthetic and is warm and inviting.\n\nThe food was decent, but, especially given the out-of-the-way location, this is not a spot that is worth returning to in my book.", "author": "Koren M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-22", "description": "I had dinner there recently, the food was lovely but the service questionable and unfriendly, down to the owner. \n\nTwo days later I walked by with a pregnant friend and sat on the bench outside only to be told a couple of minutes later that if we weren't dining we couldn't sit there!!! What!? Who tells a pregnant lady not to sit on there bench on a hot day. Even worse the woman who told us to go was the owner!\n\nIf you come to brooklyn, loose your snooty attitude. You are a small restaurant in an out of the way location a block and a half from the projects.... Look around, become part of the neighborhood or go back to Manhattan! Brooklyn has different rules, LEARN THEM!!!", "author": "patricia a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "Super noisy. Packed with identical looking hipster types. Skinny white boys in checkered shirts, their future wives in homemade dresses, BMW baby carriages. It's Brooklyn! I had a very fine meal there. In fact, one of best tasting steaks I've had in many a moon. I'm a reluctant fan.", "author": "Paunchy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-23", "description": "Best. Dinner. Ever. \n\nMy boyfriend surprised me and took me to dinner here and it was amazing.\n\nI never order the chicken, but was feeling indecisive, so I gave it a try. I've been craving it ever since. \n\nThe decor is cute and our waiter was helpful. We had to wait to be seated and went to the bar to get a drink. That was the one problem. It took me 30 minutes to get a drink. It's one bartender and she's very busy. But the food was soooo good, it made up for it.", "author": "B H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-18", "description": "Didn't try the food but had a birthday/going-away party in the back garden. Be sure to let them know beforehand though. Because we didn't and it was a bit of a nuisance I guess. The back garden is lovely even when there's a chill in the air. It looks like a very popular place for the neighborhood. I loved that they had Cava on the drink menu.", "author": "Elizabeth O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "I liked Vinegar Hill House. Although I was with a large group, we were served quickly and attentively and all of our wine glasses were kept filled.\n\nThe appetizers (goat cheese tarts, cheese boards, endive salad) and desserts (panna cotta, chocolate cake, pound cake) were all outstanding but it seemed like the salt quotient on the entrees was hit or miss. My chicken was delicious, but the broth was oversalted where dining partners complained their pasta needed salt.\n\nI should note -- the crowd is hilarious here. It's a bizarre combination of people who look like they drove in their minivan from suburban Connecticut, über-moustachioed hipsters, and powdered goths. No joke. The waitstaff is of the moustachioed type, and almost entirely humorless.  Don't bother trying to make conversation with them!", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "Great atmosphere and off-the-beaten path location. Food was good, but WAY TOO SALTY. I had the pork chop with sauerkraut as main course with duck liver mousse as starter. My wife had caesar salad and chicken two ways. All made me wonder if the chef has a muted salt palate. While the dishes were well cooked, the salt seasoning was off the chart. For dessert, we ordered the highly recommended salty caramel custard and could not take more than one bite. Luckily the bottle of Spanish wine did its job. You would hope that the repeated comments regarding overuse of salt would resonate with the chef, but I doubt it. Not sure if a return visit is happening...", "author": "Danyak D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-25", "description": "Returned to VHill after a years absence. The food is still great-the problem-no reservations on weekends-so you have to go at 5:30 to get in and once you are in there is a line standing in the resaurant waiting for the tables-some guys back pack kept hitting me as he stood next to me and turned to talk to friends-very annoying and easily fixed with some management-service is also very slow as they jhave to waitresses-a greeter and whatr appaers to be about 15 cooks-needs some change", "author": "Thomas A."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}