{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-07", "description": "Believe me when I say, I LOVE salt.  I should have NACL stamped on my forehead.  but everything here was SO SALTY...from the mixed green salad to my pasta.  overwhelming....perhaps the chef had the flu...but boy oh boy...", "author": "laura K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "One of my favorite places in the city, and I say that having only been here twice (both on wintry evenings). If only I lived in the neighborhood -- this place would be such a comfort. \n\nBefore I get to the food, let's talk about the warm, cozy, inviting ambiance. There's nothing I love more than being tucked away in a corner, seemingly miles away from your troubles and enjoying the company and conversation of a good friend. \n\nNow, on to the food and drink. Phenomenal on both counts. The cocktails are so well made -- you really have to be careful. The sprouts and butternut squash risotto are amazing, and someone in your party must get the cast iron chicken. \n\nI really didn't notice whether the staff was slow or unfriendly as other reviewers have noticed, as I was too wrapped up in conversation. As for the wait on weekends, it's to be expected, so I recommend going for an early dinner on a weeknight.", "author": "Maleeha K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "So totally hyped...and hyped and hyped.  its made it into the tour guide books as the couple next to us from Espana had their spanish zagat survey, their spanish frommers and their spanish TONY in tow...anyhoo...\n\n I refuse to wait for a table these days (and you'll wait...and wait if you dont go off hours) so the BF and I went Monday night at 9 or so and had a delightful time.  the restaurant has a great vibe and decor and great hipster waiters and fashions...nice art on the wall round it out to be totally in style and worth the trip (as long as you dont wait) \n\nI wasn't dissapointed by the food, just that they stopped making the bone marrow ravioli...boo hiss...they replaced it with plain butternut squash or something...\n\nstarted with the clams...excellent and fresh, with amazing FRESH flatbread...again...if anyone asks i dont eat carbs...wish they sent over a basket of those babies...hot as fire (temperature) and delicious.  \n\nthey DID have an interesting cow brain ravioli on the special list that night, which ended up being nice for our next course...quite buttery and if you didn't know it was brain you'd think it was just really creamy cheese...get some bread to sop up the sauce served with it...caper/butter...it was pretty traditional French sauce...\n\ndissapointing was the rag torn pasta with octopus and pork which seemed like i was eating 3 different things...they just didn't work well together...not that it tasted bad...it just didn't work...but i love octopus anyway so that plate got licked...\n\nour final course was the porkchop presented VERY aesthetically cut for us and presented on a cuttingboard with a small bit of saurkraut...again...wish i had a cauldran of that...it was really nice.  i'm not a huge fan of pork chops since they usually come from the kitchen in this HUGE unmanagable portion with that damn bone sticking out of it...but VHH did it nicely...got a side of b. sprouts which were pretty typical, but nice. \n\ndessert was least impressive with the salted caramel and shortbreads (cookies...lol)...too salty...chef needs to get the balance a little better there...\n\nlike i said...i'm glad we didn't wait in line to eat here...its good, it's well priced but i'd have been just hangry if i waited for 1 hr to eat...after 2 glass of white and 2 glass of red, and all the above, tax, tip we spent 150.  not terrible considering if it were manhattan it would have been 200+ and not nearly as nice...", "author": "Tim W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "How very lovely that this place exists! Nestled into a pretty unusual part of Brooklyn, right between DUMBO and the Navy Yard, Vinegar Hill House definitely is a destination. \n\nThe inside is just adorable - my friends and I sat in the downstairs wine cellar and they even lit a fire for us. Apps were incredible - the whipped chicken liver was to die for.  I got fish as an entree and my friends got lamb and chicken - all of us were really happy with what we ordered. We indulged in a twice-baked potato (\"for dessert\") and it was quite decadent. \n\nThis place should be on the list of any NYC foodie. I look forward to returning soon!", "author": "Carolyn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Went for our anniversary. Fantastic drinks, delicious appetizers and the cast iron chicken is one of the best chicken dishes we have ever had. Absolutely get the corn bread too.", "author": "Darrin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-15", "description": "This place deserves a 3.5, but I was feeling generous so I gave them a 4.  Who knew that Vinegar Hill is an actual neighborhood in Brooklyn.  I always called it, \"that area after DUMBO ends\".  The area is sort of run down and reminds me a bit of a western movie.  I kept waiting to see huge dust balls rolling down the street.  The decor of Vinegar Hill felt very similar.  It was run down and rusty and grungy and instead of lamps they have weirdly shaped wiring surrounding the light bulbs.  There were all sort of weird and seemingly random objects around the room, including a shelf of cactuses? cacti? and sad little plants.  The chairs were wobbly and the ceiling was chipping, but somehow it all made sense after driving through the hood.  We called ahead and the hostess told u to just come on by and we will be seated right away.  Once we got there, she told us it was a 20 minute wait, which later turned to 40.  I was hungry and annoyed.  Luckily we sat at the bar, enjoyed a beer and observed the open kitchen.  Once we were seated and the food arrived, it was delicious and my only complaint was that they have the audacity to charge $8 for a \"salad'.  Why the quotes you ask?  It was lettuce.  Yes, just lettuce.  Lettuce and salad dressing does not a salad make.  We were there for brunch and my husband had the hot dog, which was delicious and I had poached eggs with spinach, also delicious.  Everything did taste great and I will surely return to try their dinner.  Tip: try their \"chef's drink\".  It's what the chef actually drinks while cooking.  It's a very bizarre combo of beer, cumato and hot sauce.  You will either love it or hate it, but it's served in a giant plastic container which makes you love it just a little even if you hate it.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-28", "description": "TWO \u0026 A HALF HOUR WAIT! We were told there would be an hour wait, which I found acceptable for a party of 5. We watched multiple parties of 2 and parties of 4 (who came in after us) being seated before us because this restaurant has NO MANAGEMENT SKILLS. They couldn't use the common sense to hold a table of two for 10 minutes while the table of four next to it finished and left, put the two tables together and seat us. NOOOOOO, they made us wait 2.5 hours until the entire restaurant died down and there were various empty tables. We arrived at 8:30pm and were seated at 11pm. \nAt this point we were exhausted from standing and waiting around, and I at least expected a round of drinks on the house from these people. NOTHING! Not even a \"sorry for the wait\"... just nothing. \nThe food was good, but nothing mind-blowing... nothing worth a 2.5 hour wait. I would never return solely because of the way they mismanaged seating us. Based on the food alone, I would definitely return, but clearly they have a few things to learn before that ever happens.", "author": "Diana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-27", "description": "Went there twice in a week! Amazing Dinner and Brunch.\n\nI don't want Oven Roasted Chicken from anywhere else, neither do I want Pork Chops from any fancy restaurant. Wood oven is the way to go. \n\nI kissed IHOP and any other restaurant's pancake goodbye. I see your buttermilk pancakes and bet you an amazing Fresh Ricotta Pancake, and I go all in with their Brulee Banana on top! Sexy! Sweet! Addictive!\n\nFor pictures and more details, pls visit my blog.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "This place is somewhere one of my best friends rally likes. He had been urging me and my spouse to give it a try. We wound up going together the three of us, spur-of-the-moment style, ~7ish on a Friday in early June. \n\nThe neighborhood is tiny but cute/quaint/cool. The restaurant looks cool on the inside, but we were only there for a moment before being whisked out to the back garden. The ambiance out there was real chill - trees overhanging, staff going back to their 2nd house(!) - which together with the main restaurant brackets the back yard and which seems to be used as storage/wine space - a couple other tables taken, but not crowded at all. \n\nI had risotto with peas and mint. The color was vey pleasant, and the texture was excellent. As regards the flavor, I could have wished the mint was more assertive alongside the peas (and I had feared the opposite - all mint) but it was pretty good. \n\nMy friend had the bass, which was paired with chickpea fritters and something else suspiciously falafel-y. But who can complain, given that the bass was perfectly tender, appropriately moist and flaky but with a fantastically crispy crust on the cooked side. \n\nThe wine was affordable and decent, though the waitress, despite her efforts, was no sommelier. \n\noverall a very nice experience.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "One of my current top 10 restuarants in the city. Went there again for the 4th time in as many months and once again they delivered. From the Black Pepper Pappardelle to the Steak and Eggs and the Salted Carmel for desert, Vinegar Hill House delivered every time.  \n\nThe place is warm, comfortable and not pretentious. The service is good (although sometimes a little uncoordinated). The bartenders are personable, attentive and mix some great cocktails, so if your alone you'll enjoy your time at the bar as well.", "author": "Tim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "Indeed, a Brooklyn gem. I love Vinegar Hill neighborhood and it's few block away from Fort Green. Vinegar Hill House is a cosy place with a nice atmosphere.  Service is warm and punctual. I had the Lamb Neck with white beans and feta - and it was simply delicious. Crispy outside, tender like butter inside. Desserts were also spectacular: goat cheese panna cotta and parsley sorbet. I will be back for sure.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "Across the board the food was fantastic. Great starters, fantastic entrees. The menu is unpretentious but obviously well thought out. \n\nThe only drawback was the service. It was painfully slow for our table of four. This could in part be attributed to the large crowd of diners. (We went on a Thursday night, and dined in the garden. It was mobbed.) Furthermore, one of the servers spilled a glass of wine at our table, hitting a member of our party with wine. Fortunately, it was a rose, so staining was minimal. It might have been nice to have the drink replaced, or a dessert comped, or something. A quibble, perhaps, but something that kept this really good restaurant from being truly great in my mind.\n\nStill, the food was great and I'll go back again, for sure.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "By far one of my favorite places to eat in BK...or in NYC for that matter.\n\nEverything about this place is mega cute. It is a perfect date spot.\n\nThe food is amazing and has a great farm to table vibe. the menu is ever-changing and here is what we recommend...\n\nThe cast iron chicken is perfectly roasted and so juicy. It came out as simple as ever on the cast iron pan straight from the oven. I order this often, but as simple as it is i NEVER get tired of eating it. extremely crave-worthy.\n\nThe portions are perfect and the sides are nice to share. \nWe had the corn salad which was so fresh and tasty.\n\ncan't wait for the next time to go back\n\n- Salty Pepa", "author": "Salt-N-Pepa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-25", "description": "I have dined at Vinegar Hill House on at least 10 occasions given I live in the neighborhood.  It has always been a pleasant and delicious experience.  On a recent Monday evening at 6 pm (the restaurant was completely empty) I brought my 19 month old daughter in addition to some family members from Manhattan who had not yet enjoyed the experience.  To accompany our generous order I asked if it was possible to get a side of scrambled egg. Egg was featured prominently on the menu so this was not a question of great inconvenience or even unavailability. The chef \"respectfully declined\", as if we had special ordered fish sticks and a side of Mac and cheese. As we were frequent patrons, we did not expect a child's menu and rarely have to resort to special requests.  We also did not expect such a pretentious  response.  We will not return and will cease recommending this establishment.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-23", "description": "Can we talk about Hillside here?  Why not.  My wife and I have eaten here three times in the last two weeks and I can safely say that the waitress (singular) is why we will never come back.  What a lackluster employee.  Lazy as hell.  Rude.  Slow.  Didn't deserve my 20%+ tips the first two times and the third time was no different so fuck it.  I live around the corner and was hopeful that this was the place we could be regulars?? NO WAY IN HELL.", "author": "R P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "I celebrated Memorial Day Weekend by starting on the slippery slope of day drinking. We kicked off the day at Spin, the ping pong club owned by Susan Sarandon (yes, you heard correctly), and continued in true New York City style by drinking on multiple rooftops.\n\nSo to say that I was slightly buzzed by the time I got off the F train for dinner in Vinegar Hill, Brooklyn would be a dangerous understatement. The setting sun, and quick stop at my apartment, had done nothing to curb my stupor, and it was 9:15 by the time I stumbled into Vinegar Hill House, meeting up with a far more sober crowd for what I hoped would be a fantastic American meal.\n\nOur group of 7 presented us with the opportunity to try the whole menu (except for the very last steak for 2 for $100, which we passed on), so I not-so-subtly tried to steer people into ordering different things. This turned out to be quite easy, since everyone was already willing to try everything, and it's hard to be subtle when you're drunk.\n\nFirst up, a pickle plate of sweet bread and butter pickles and garlicky half-sours. I'm a devout pickle snob, so I was surprised when the half-sours reminded me of my great-grandfather's pickle recipe that I now call my own. Fortunately, while the flavor was strong, the intense backbone of lingering heat that distinguishes my homemade pickles was completely absent, leaving me secretly relieved.\n\nFilled with green pea-ness, the English Pea ravioli was cooked perfectly al dente, with a cream sauce and an intense pea flavor that did not overwhelm. Great dish.\n\nOther appetizers arrived in waves. A glass jar of chicken liver mousse was topped with pistachios for an earthy combination. While this was a nice touch (I love pistachios), for some reason, I've been underwhelmed with all the chicken liver mousse I've tried lately. It must be a personal failing on my part (and I think I like chopped liver better anyway).\n\nSpinach salad was elevated by the combination of sweet strawberries and pine nuts against the smokey bacon and piquant buttermilk dressing. Maybe slightly overdressed, but still an excellent salad starter.\n\nThe weakest appetizer was the octopus, which was refreshingly tender, but the octopus itself ended up tasting like canned tuna. Pass.\n\nOur mains were uniformly outstanding. I ordered the fluke with a duck crackling crust, celery, walnuts and cherries. The fluke was cooked perfectly, with the duck fat in the crust adding a crunchy richness to the rest of the dish. The mixture of celery, walnuts and cherries, while good, felt like it should be served in October rather than at the beginning of Summer. A minor complaint, but that's what I'm here for.\n\nLamb shoulder with pearl barley and onions was fantastic. The lamb was meltingly tender and not at all dry. I usually find barley to be soupy and overcooked, but here it was pleasingly al dente, soaking up the flavors of the lamb.\n\nI was too drunk at this point to remember the specifics of the cast iron chicken, but I'm fairly certain it was delicious-- with the rich pan-juice gravy standing out.\n\nLamb heart and liver papardelle was very good, the pasta again cooked perfectly, with just the right ratio of sauce to pasta. The squeeze of lemon and parsley managed to mellow out the stronger flavors of the lamb and liver.\n\nThe pork chop with cheese grits was really fantastic and made me wish I'd ordered one for myself. The chop had a serious char, and was cooked medium rare. It had a strong porkiness, with a slightly aged flavor (maybe this was from the char). The cheese grits were fine, and the strong cheddar cut through the meaty char, mixing with the pan sauce. I managed to snag the two bone pieces, which I picked clean while we finished our mains.\n\nDesserts were not as consistent.\n\nThe chocolate cake was pretty boring, tasting like a less cloying Hostess cupcake. No discernible Guinness taste. Most of the flavor came from the cream cheese icing on top.\n\nThe salty caramel custard was on the verge of being too salty, but the butter cookies and whipped cream helped balance the flavor slightly, although not enough to harmonize the dessert. I think I would have pronounced it saltier if I weren't already drunk.\n\nSurprisingly, the ginger upside-down cake, which on paper interested me the least, turned out to be the best of all. The sweet bite of the ginger cooked into the extremely moist cake paired well with the buttermilk ice cream. Definitely choose this dessert.\n\nHere is where I would conclude with the obligatory description of new Brooklyn cuisine and contrast it with the supposedly \"typical\" Manhattan restaurants such as Pulino's and The Breslin. I'll pass on that conversation.\n\nInstead, I'll say that Vinegar Hill House serves up an unpretentious New (classic?) American meal in a relaxed setting at a reasonable price. Can the same not be found in Manhattan? I'll disagree, but Vinegar Hill House is a great restaurant that would be welcome anywhere.\n\nwww.lawandfood.blogspot.com", "author": "Chief H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-16", "description": "This place is Freemans in Brooklyn. \n\nAmerican decor- very vintage , old-fashioned, warm. Perfect cobblestone block in outer DUMBO (aka Vinegar Hill). Romantic ambiance for sure..  A friend insisted that he take me here \n\nWe walked in at 8:30PM on Thursday night and were not seated until 9:40PM. The wait was painful since the restaurant wasn't packed and every table wasn't occupied. The owner offered us a drink on the house to make up for it.  The hostess was nice but did a poor job of assuring us we'd be seated soon. \n\nThe food, in my opinion, was OK. IT wasn't memorable for me. My friend loved everything he ate. \n\n--Oven Roasted Octopus - slightly bland, average taste\n\n--Butternut Squash Tart  - sooo good. tart was on point (highly recommend)\n\n--Cast Iron Chicken -lacked flavor, no sort of seasoning but cooked to perfect temp. my friend thought it was amazing :shurgs:\n\n--Chops - very tasty if you are into pork. I'd feel really guilty ordering this sort of dish..but very good based on my sample from my friend's plate.\n\n--Brussel Sprouts - A-M-A-Z-I-N-G\n\n--Apple Bread (?) - This was the chef''s suggestion and it was ok. Very dry and tasted a tad stale.\n\nI'd go back - but the wait makes it highly unlikely if I'm starving. The highlight was my Jameson \u0026 Ginger cocktail from the bartender and the squash.", "author": "Jul B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-18", "description": "It was really difficult for me to choose a rating for this place. I'll have to round down to three stars, although due to the food, it's probably closer to 3.5.\n\nFoodwise, everything was fantastic. The iron-skillet chicken came out with perfectlly crispy skin and tender meat, and the country chop was juicy and salty and wonderful. However, I was perhaps expecting a slightly larger cut of meat, and felt slightly cheated as a result. The roasted potato side dish was piping hot and full of savory goodness (probably from the duck fat it was cooked in).\n\nHowever, service was disinterested and difficult to come by. On a busy Thursday night, you would have expected them to want to turn over a table more quickly! Instead, we were left waiting for our bill for about 15 minutes after we requested it twice. \n\nPrices are also just a tad over what was comfortable to me. If they were just $3-5 lower, I would endeavor to visit this place regularly, good service or not. But as it stands, this will stay on the 'visit once a year' list.", "author": "B Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-02", "description": "although dinners are great. not so good for brunch.... eggs benedict was the saddest portion and presentation I have ever seen. Staff seems to be overwhelmed and clueless. when we asked for some greens of some sort on the side it turned into an ordeal.", "author": "Sabine E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-05", "description": "I took the Old Man for dinner here on his first night in NYC. He is a very fussy eater,  so it's a pain in the arse to try to find something he likes. Anyway, for the rest of his time in NYC he did not shut up about how good it was. As annoying as it was to hear the same story about the chicken 12 times, he was quite correct. Tip: Good for groups but need to book.", "author": "Nick K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}