{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "5 Stars for Excellent food. Wood fired tart has a wonderful texture, just the right salty-sweet balance and an amazing flavor combination with marjoram, an herb I had never heard of. Watermelon salad is spectacular. Black Pepper Tagliatelle is very good. My boyfriend and I ate every bite and drank every drop of what was served. \n\n5 Stars for Excellent drinks: Wine list is extensive. Beers include three of my favorites: Hitachino Nest White Beer, which I have never seen on a menu and have trouble finding in stores, Kronenbourg and Pacifico.\n\n3 Stars for Inattentive Service. Our waiter got everything right, but we waited too long between getting a dessert menu and actually ordering dessert, while we watched him serve the tables on either side of us multiple times. As a server myself, this was a deal-breaker.\n\nIf the weather is nice, wait for a table in the back patio. It will be quieter out there.", "author": "Joanna E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-15", "description": "Extraordinarily QUAINT!\nWe were seated downstairs, in small cabin-esque room with a stack of firewood and a cheerful fire. It felt like being in a fantastic rural B\u0026B, all candle-lit and homey.\n\nThe food was fantastic. The apps are superb---incredible chicken liver mousse, and the roasted shrimp brought tears to my eyes. We split their famous chicken and it was AMAZING. We could not get enough of the vinegar reduction in the pan.\n\nThe dessert (guiness cake) was good, but not transcendental....but the whole experience was a lovely \"escape from new york\" (it sort of felt like being in Maine or something...)\n\nVery romantic and good for dates/annivesaries/birthdays.", "author": "Lyra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Adventure Monday continues! Luckily, the three of us got seats right away but there was only one table left on a Monday night around 8PM (they only take reservations for parties of more than 4). I've wanted to try the Cast-Iron Chicken and Guiness Cake at Vinegar Hill House for the longest time but haven't been able to due to its isolated location. We started with an appetizer special of the day: Pork Belly, which was good (Pita bread, greek yogurt, baby arugula, red-skin potatoes, pork belly). The chicken was tasty too (a la carte with onions) but the best dish of the night was the Red Wattle Country Chop (with cheese grits). They were delicious! Best pork chops we've ever had. The Striped Bass was good as well but nothing special there. The Guiness cake for dessert was perfect. Definitely want to take my bf back to try the chops. Side note: The portions are perfect for one so if you have a ravenous appetite, order more appetizers/sides/desserts (which was why we were able to go to another dessert spot afterward, which worked out for us). Also noticed many lingering over dessert and coffee so the vibe here is every laid back and intimate.", "author": "Brietta Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "Perfect Brunch Spot!\n\nIt's a gorgeous neighborhood and worth wandering around.  Cobble stones feel like old-world/west-village when you look down.  Balconies and sunlight feel like a beach town when you look up.\n\nThe waiter recommended the Reuben Sanchez (photo) - a take on the classic corn-beef sandwich.  It's got juicy beef, melted cheddar and a bit of pickle.  Sitting on a cabbage/onion slaw, it's more like Cubano than a Reuben.  The crunch is perfect and the portion size is not overwhelming.\n\nRoasted potatoes are an excellent side.  Egg and Tomato (photo) was also simple and farm fresh.  Grapefruit with ginger syrup was a bright and refreshing combination (photo).\n\nWith strong coffee and a nice backyard, this place is perfect for brunch inside or out.  The service is not perfect - they checked back for one order and still confused my side.  But nice folks and a great atmosphere.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "One of my favorite places in new york. Mainly for the atmosphere, staff, wine, and location, but the food is really good too. Not great for vegetarians or picky eaters though. I'm not an adventurous eater and think the menu lacks choices.", "author": "vicki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "I had the pleasure to go to a private engagement party for my friends Collin and Stacey here at Vinegar Hill House, before it opened. What a treat, and a fantastic party!\n\nFirst of all, the space is a quaint converted neighborhood retail storefront that used to be a butcher shop. It's been dressed appropriately with period looking decor and nice finishing touches. It creates a warm and inviting atmosphere. There's also a very cute back garden that I'm sure will be used when the weather changes. \n\nThe owners and staff were abundantly on hand to take care of the guests. They were all extremely gracious and cheerful. It's obvioius that there is some history between them (must be from the Freeman's days.)\n\nThe chef, Jean Adamson, did not have the menu yet. He promised that it would be more vegetarian friendly than Freeman's. We had some lovely appetizers though - Baked Oysters, Walnut Crostini, Squash soup, a fantastic spread of cheese and salami (I could have sworn that one of them was my favorite Wild Boar), and a mushroom cap with sausage. They were all great.\n\nOne of the really nice touches was a self serve Vodka Collins dispenser at the bar.\n\nOverall, if the party was any indication of how great the service and food will be when they officially open, then we're blessed with a new Gem in Brooklyn, and a great reason to walk from Dumbo to Vinegar Hill.", "author": "Eric J. R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-10", "description": "I could only begrudginly give Vinegar Hill House two stars because the service was so poor. Specifically, the hostess really messed up, with no acknowledgement.  I've worked in restaurants and know how it works, for the most part. We arrived at 8:10pm and were told that it'd be a 45 minute wait for a party of two. We got cocktails and went out into the crowded garden to hang out... and wait. We checked in with the hostess at 9:30pm-- and granted, it was a busy Saturday night-- who told us that people who had arrived at 6pm were still sitting at their table and they did not have a policy of asking people to finish up when there was a long wait list.  I mentioned the empty 2-top in the backyard, \"just to make sure you know it's there\" and the excuse was that the backyard server was swamped. So we sat in the back, watching the tables empty out (now there were 6 seats open back there), observing when one of the two bartenders finished his shift... COME ON!!! An incompetent server combined with an incompetent hostess? Give me a break; you can do better, Vinegar Hill House. You will all make more money and satisfy more hungry bellies, at that. \n\nWe finally sat down at 10:15, over two hours after arriving. Lesson to the hostess: realistic estimates of wait times keep people happy, and that's your job. Maybe you're new.\n\nThe food was great, and we held out for that aspect of the experience. The watermelon soup was a little brothy, which was not my preference, but the crab was a great contrast.  The avocado puree and hazelnuts with the beets provided delicious flavor and texture variety. Yum! I'm inspired to use hazelnuts more often.  The Red Waddle Country Chop was one of our highlights; satisfyingly seared with a deep saucy-gravy, on top of spicy (to me) cheddar polenta.  It was the rarest pork chop we'd ever had; a perfect balance of tenderness inside and crispy outside.  The Cast Iron Chicken was juicy and more subtly flavored (than the pork), perhaps with white wine. The coriander dressing on the fruit/tomato salad was disappointing, but the glory of the heirloom tomato made up for it. Yay for seasonal tomatoes!  We went for the Salted Caramel Custard for dessert and it was intensely salty and sweet, maybe even some booze in there. We were able to finish it though! \n\nI will return to Vinegar Hill House, during the week, when I'm not totally hungry and can wait if need be.  Definitely would've been happier if they'd offered us something for our excessively long wait; guess I'll have to learn to address that with the management in the moment.", "author": "HanaKyle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "I live in the neighborhood \u0026 this is easily my favorite place. They change their menu up a bit here \u0026 there so you can enjoy some of your longtime favorites or go for something different. Brunch here is wonderful, especially when the weather is permitting \u0026 you can sit outside in their back patio area - you do not feel like you are in New York anymore (not that being in NY is bad of course). I have eaten a number of special occasion dinners here - all great. Service, food and also wine selection. Dinner is probably not good for vegetarians but the brunch menu has a number of options. The dining room is small \u0026 there is a small bar area if you want to come in just for a drink.", "author": "Tamara Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-06", "description": "Went here for a birthday brunch. Everything but one dish was great: steak and eggs, Benedict, pancake -yumm. What totally ruined the experience was the waitress - nancy. She was rude, unfriendly, entirely unhelpful. After we'd waited an hour for our food, I was still hungry and asked her how long it would be to get another pancake. She unapologetically proceeded to tell us the kitchen was closed. The rest of the wait staff seemed to have a better attitude. After having to deal w her, I have no interest in going back - unfortunately considering the food was great for the most part.", "author": "Dana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "Originally my friend rich was going to walk across the brooklyn bridge with us and head to vinegar hill house. but apparently, brooklyn holds no cachet with him so he opted to not go and leave us to our own devices. It ended up being a beautiful walk and a memorable experience at this dining establishment. First off, i decided to get there when it first opened as they don't take reservations and there is nowhere to hang out and wait for a table to open up. As we walked up the street towards the place,it looked like a concert was about to start as there were about 50 people huddles around the doorway of VHH. and it hadn't even opened yet! apparently we weren't the only ones trying to miss the crowds. Shit.\nwe finally got in and sat at the bar and watched the craziness ensue. We got seated about 45 minutes later, i got their famous for a good reason skillet chicken and jovanie got their pork chop. Both were awesome. They had some kind of caramel sea salt pudding thing which was also out of this world. Our waitress was nice, the space itself was very charming. I would definitely recommend it. And it was a 20 minutes wall from wall street to this place. \nIt was great to experience a fantastic restaurant that was off the beaten path.The only negative was the no reservation thing.", "author": "Jim M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "I love this place.\n\nIts hidden in a corner of vinegar hill that no one really goes to (much like vinegar hill itself), but hence the old world, untouched feel of the location.\n\nThe room is warm, nicely decorated in the au courant rustic hipster style prevaling across brooklyn, but maybe because the location is offbeat, the atmosphere feels more authentic.\n\nNow the food:\n\nmust get:\n- the calamari\n- the liver mousse\n- the pasta with whichever meatish sauce is on offer (although the portions on pasta are skimpy)\n- the pork chop \n\n\nthe only things that have been so so are occasionally some of the fish dishes, but even they aren't bad. \n\nfor the quality of food, the prices are reasonable.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-13", "description": "Ehhhhhhhhhhhhhhhhh. Good ideas, amateur execution. Small portions served starkly. Linguini seafood special tasted like 25 cent creamy chicken ramen. Finished it in 3 bites. Chicken was ok, but it's really hard to fuck up chicken. Won't even discuss the appetizer, but let's just say that after I tasted it I thought to myself, \"oh, man I wish we hadn't ordered entrees too. now we have to sit through a whole meal.\"  \n\nI'm hard on places that have a lot of hype.  Would knock off a star if there had been any sort of wait, but we got there 15 minutes before opening.\n\nService was fine, but yeah, totally not worth it. Oh, and I am still hungry but in too bad a mood to eat more.", "author": "mae g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "Love. And if you read my other reviews you will see I have standards that are quite high. I loved the garden, the wine recommendation (that was not on the list) and my meal.  Get the carmel cup for dessert.... heavenly. This place is adorable.", "author": "Meowella S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-11", "description": "Unfortunately, all I can say is it's average.  We keep going back, hoping to have a great experience but after 6 visits I just need to admit it's good, but not great.\n\nThey do have a great wine and beer list, and the location is very cool (I love the fact that they're off the beaten track - and close to Dumbo where we live).\n\nWe'll certainly go back again and hope it gets better.", "author": "John B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-05", "description": "I only joined yelp to review this restaurant -- TERRIBLE.  NOT WORTH THE $$$$$$$$ and COMPLETELY OVER PRICED AND OVER-HYPED.\n\nI made the rare trek into Brooklyn last night to try this much celebrated new restaurant with 4 friends.  Upon arrival at 9 PM, we were told that there would be a one hour wait.  Understandable on a busy Saturday night, however 2 HOURS later at 11:15 PM we were finally seated and then rushed to order because the restaurant was closing soon.  \n\nThe decor is certainly the best thing going for this place.  The watermelon salad was runny and watery -- not enough body in the fruit to stand up to the pig's head crackling they add to it.  Baked octopus was good, and the chicken liver mousse was most certainly the best dish of the night, agreed upon by all.  \n\nThe Wattle Chop was THE definition of mediocre.  For $25 (!!) they give you a huge portion of chewy, cheap tasting pork served over delicious jalapeno cheese grits.  Should have noticed that no one in the restaurant was finishing the meat, only the grits.  Paying $10 for this dish I wouldn't be so disappointed.  But $25?  COMPLETE rip-off.  The meat was devoid of seasoning, and it reminded me of something from a Cracker Barrel, where quantity, not quality, reigns superior.  This is New York.  For $25, I'm expecting something impressive and delicious, not a big cheap pile of meat to feed a family.\n\nWe also had the short ribs.  Also very mediocre.\n\nBest entree we ordered was the Pappardelle.  Well executed, but nothing extraordinary.\n\nI feel like I wasted all the money we spent, as well as the cab fare to get there.  If I was going again, which I assuredly won't, I would sit at the bar, enjoy the fantastic decor, and have some of their expertly made cocktails (and perhaps the chicken liver mousse) before moving on to another restaurant for dinner.  The Manhattans were delicious.\n\nFor the money, you can get MUCH better food elsewhere.  If it was cheaper, I would not be so disparaging, but this is priced like fine dining.  A BIG disappointment.  Waaaaaayyyyyyyyyyy overpriced.", "author": "Julie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-05", "description": "Opens at 6pm for dinner and get there by 6:15 unless you want to wait ... no reservations for less than 6 people.\n\nApps: Watermelon Salad was delicious and refreshing for a warm summer evening.  Grilled sardine on crouton was also tremendous.\n\nMain: Panned chicken was just too good for words ... the sherry and butter sauce might have been one of the best things I've eaten in years.   Short ribs were very very good in a summertime variation over heirloom tomatoes and blue cheese.  Great!\n\nSides: Sweet corn was good but a little over-powered by parmisan.  Grilled eggplant was nice and smoky from the wood grill.\n\nDesert: italian plum tart with whipped cream was off the charts!\n\nWine: a \"rose\" from Rioja.  really more of a light red (orange color).  enough depth to pair with anything on the menu.  it held up superbly with the short ribs.  bought two bottles on the internet when i got home .. 1998 Lopez de Heredia \"Vina Tondonia\" Gran Reserva Rosado Rioja\n\nService: good not great ... tight space and the dining room gets packed so this is not a place for a quiet, \"intimate\" meal.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "Had brunch there last weekend. What can I say? The food was amazing (try the Pear Pancake and the Eggs Benedict...wow), service was great, and drinks were delicious. Bloody Bull was a great call. I honestly can't recommend this place highly enough, especially for the price.", "author": "John G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-25", "description": "Poor service and mediocre food.  We went on a Friday night but early enough so that it was not busy.  The service was pretty bad.  We waited a verrry long time for a simple appetizer and then again a verrrry long time for the main course.  During the meal the waitress (blond ponytail) never once came to our table to see if everything was okay. We would have ordered more wine but could not get her attention.  We would have ordered dessert...same thing.  She kept drifting around as if hungover and made no attempt to be personable or friendly although we tried. The food?  The pasta (only vegetarian option) was so fussy and overly-complicated it didn't work at all.  How hard is it to make good pasta?  The coup-de-gace came when my companion found a hair in his food and called over another waiter (busboy?  server?  not sure) who just shrugged and said \"sorry about that\".  Needless to say the spacey waitress never came by to address this.  On a positive note the backyard is comfortable and homey but I wouldn't return", "author": "Susan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-12", "description": "Still love this place but in some ways wish they weren't so successful. You can tell it's become a destination and it can get crowded. Everything I've tasted here has been great and it's fun to sit at the bar and be amazed with what can be produced from such a small kitchen where the oven fills half the space.", "author": "Noel R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-04", "description": "Everyone in the neighborhood is wondering what is going on here. This was our favorite local spot for years, suddenly the food is a disaster.  On our last visit the waiter mentioned changes in the kitchen and it shows on the plate.  What happened to in-house made pasta and the beautiful chicken in a skillet?  Our only dish that was acceptable was a salad. So disappointing..", "author": "rob l."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}