{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "Brooklyn best kept secret. Check out space down stairs if you have a chance. Food (came for brunch) we ordered steak and eggs and fish sandwich was just delicious. place gets busy but it doesn't influence their service in any way. \nGreat place to take your parents to or go on a quiet date.", "author": "Tatyana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-05", "description": "Food was good, especially the fish. However, the hostess was annoying and unprofessional, refusing to seat us at an appropriate table until we almost threatened to leave. Her rudeness lent a sour tone to the whole meal from the beginning.\n\nTo top it off, one of the members of our four-person party was vegetarian and we had called in advance to make sure they could accommodate her. They had said they accommodated vegetarians, so she got a pasta dish without the meat. She ended up getting a TINY plate of pasta. It was almost nothing. It was also overcooked and costed $20. She ended up leaving hungry. If you are vegetarian, avoid this place, no matter what the restaurant personnel tells you.", "author": "Elvan Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-21", "description": "Happened upon this spot with my husband and mother in law last weekend for brunch. Zagat rated it highly and Michelin recommends it, so we thought it would be a safe bet. I'll echo the other comments about the service being patchy at best. The seemed pretty disengaged and disinterested, and the overall service experience seemed to be a product of disorganization and general apathy. We were sat at a booth along the front window. I'm all about rustic charm, but this place is bordering on dirty. The food was definitely below average. My husband ordered the pulled pork sandwich ($16), which was cold and under-seasoned on a dry bun with a bag of potato chips (Lays?) plopped on the plate next to it. I ordered the braised red wattle pork and grits with a poached egg ($17). The pork was identical to the cold heap of pork on my husband's sandwich, so no differentiation there from what I could tell. It was also terribly bland and lukewarm.\n\nYou win some, you lose some-- it happens all the time. But I would never go here again or recommend it to anyone.", "author": "Megan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "One of my new favorite restaurants. My girlfriend and I went here for her birthday. we've been a fan of Freeman's alley so we wanted to try this new place. We came on a cold Wednesday, which was probably a good idea because we were seated immediately.\n\nShe had the chicken liver mousse which was really creamy. I'm a fan of nuts on top of the mousse, adds a nice texture. I tried their aged olive oil which was very good.\n\nFor the entrees she had the Wittle pork chops and I had the wild boar. The wittle was probably the best pork chop that I've had at a restaurant. We've been to quite a few of the new American restaurants popping up and the pork chops usually disappoint. These just might be better than mom use to make. The wild boar was super tender. They only give you a fork and butter knife and I didn't even need that. Most of the meal I only used my fork, it came off the bone so easily. \n\nWe had the brussel sprouts as a side which was great, sweeter than I'm use to but really good. \n\nThe only reason I wouldn't rate it 5 stars is that it is a bit pricey and a bit of a walk from any train station. \n\nOverall the place is small but nice. It was great that we got seated early and didn't have to wait in the cold, I would suggest going on a week night. The host was courteous and our waters were always filled. I think I'll be returning to try this chicken that everyone's talking about. If it's better than my mom's chicken maybe she can retire finally.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-14", "description": "Terrific food with a rustic touch.\nService was friendly but incredibly slow.\nAs a number of people mentioned, the portions are small and expensive.\nBest bet are the desserts which are inventive.", "author": "Marc W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-16", "description": "On my birthday I chose Vinegar Hill House for dinner with my family because I'd heard such good things about the food. We weren't able to make a reservation because we were a party of 3--their website says that they are primarily a walk-in restaurant and only take reservations for parties of 4 or more. We arrived shortly before they opened and were eaten alive by the mosquitoes outside, waited quite awhile to be acknowledged by the host after they were open, and were eventually told that they could not seat us for at least 30 minutes because they were full with reservations. The restaurant was empty save for maybe 3 tables.\n\nThe host was incredibly rude when we pointed out that we tried to make a reservation but couldn't because of their policy. We also pointed out that as a party of 3 we would require a table for four anyway. We asked to speak to the manager only to get the same attitude. No matter how good the food allegedly is I don't see myself choosing to go again. We ended up going to Fort Defiance in Red Hook instead which is quite wonderful with much friendlier staff. \n\nI've never attempted to go to a more incompetently run restaurant. Another irony is that their other establishment next door opens at the same time. If it opened a mere half an hour earlier they would have had several customers for drinks prior to being seated for dinner and we may have been more willing to wait to be seated. Several lost opportunities here.", "author": "Angie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "Noisy. Tiny portions. Lousy service. No return for me. The only good thing about the restaurant is that it is in Dumbo.", "author": "Martin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "Met a couple of friends for brunch - arrived a bit early and they happily sat us at the bar to enjoy some tea and the paper.  Girl behind the bar took our order and never spoke to us again - we found this odd.  Other than that our server was good and just the right amount of attentive.  We all enjoyed our meal and the overall ambiance.  Do note that is nothing else around this place, but it's only a short walk to DUMBO area.  Very cute place, I would return if I found myself in Brooklyn again.", "author": "Yvette F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "The wait is insane.  We're there on a freezing Monday MLK day evening at 7pm and it was still a solid 1 hour wait for a party of 2.  Is it worth the wait?  Well, I guess only if it's for not more than 1 hour.  \n\n\nIn addition to the ground level dining area, there's another small dining room with a working fireplace that's hidden in the basement.  I think the main dining area on the ground floor has a better atmosphere.\n\nThe food was generally delicious.  That said, do note that your meal does not come with a complimentary bread basket.  In fact, on their 'special' for the night is bread with a 'special' olive oil that they charge for I want to say $8?   Which I think is a bit of a rip off.  \n\nWe shared the pasta with octopus as an appetizer and the sauce it came with had a stickiness that only comes from rich, well-made jus.  For our entrees, we tried the 2 dishes most yelpers seem to rave about - the red wattle country (pork) chop and the cast iron chicken.  Both were outstanding in flavor and simplicity.\n\nDessert was a let-down.  We went with the date tart and mascarpone ice cream.  It reminded me too much of a fig newton and just didn't hit the spot for us.\n\nOverall, I would come back here again for the entrees we've tried and the very cozy and welcoming space but the wait does make me a little hesitant.", "author": "Princess M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-14", "description": "There were three of us and we had a reservation.  I was visiting from Vancouver, BC my friends, staying with one in Brooklyn along with another from Philly who had driven up.\n\nAnd awkward though it is, that sentence is correct english.  I'm pretty sure, anyway.\n\nAnyway, we got here and we were seated right away.  We each ordered something different and we each were presented with something amazing.  Chicken thighs cooked to perfection.  A rare steak that was actually properly rare and not blue or medium rare. A plate of pate that was perhaps to die for.\n\nThe place is small.  Quaint.  Going for a rustic feeling.  I'm not sure how I feel about that to be honest, and to be sure my experience here is one I look back on with rose coloured glasses because I had a great night with great friends in a great city but you know what?  This place is amazing.  You should try it.  And judging by the other reviews of it, you should probably do what we did and make a reservation.", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "The food here is top notch.  My friend and I ordered the pork dish and chicken dish and both were really great.  I'm only giving the restaurant 3 stars however, due to our dining experience.  First, the restaurant is super LOUD.  The ambiance is listed as romantic on Yelp, which has to be a joke.  My friend and I had to yell over the background noise to have a conversation.  Second, the bartender was a real d*ck.  While waiting for our table, my friend ordered a drink at the bar.  He took the order, spent some time serving other customers and then kinda stood around for awhile.  My friend thought he might have forgotten her order so she reminded him in a friendly way.  He gave her this death glare and said, \"Yeah, I know\" and then finally served her the drink she ordered.  My friend and I were like, \"WTF?!\"\n\nIf this place offered take out, I would be back here getting food to go in a heartbeat.  But since they don't, I don't think I'll be back.", "author": "Eva P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-02", "description": "Came here for dinner late on a wk day night. There was a mild wait, so we wandered over next door for a glass of wine \u0026 some bone marrow. Tasty, but wished I didn't need to down my wine and could bring over next door. \n\nI came here over a month ago and the seasonal menu has changed since then, so can't recall exactly what I ordered. The food was good, service was great.. but otherwise pretty unremarkable. \n\nTwo food related things that I do remember: 1. the cheese plate (which I almost never order) was really good and had lots of variety and 2. the carrot cake, yes. do it. \n\nlastly, this has nothing to do w the restaurant.. but i loved the cobblestone street. added to the ambiance.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-26", "description": "I've been wanting to try this place out for a verrry looong time, and after a lovely Etsy craft event, my friend and I decided to treat ourselves and pig out gracefully. \n\nMy friend had the short ribs and I ordered the cast iron chicken. This chicken has been blogged and gotten raves from many reviewers so I thought \"Why not get it and see how amaze-balls it is!!\"\n\nOh boy, was it juicy... and RAW! Majority of chicken was still bright pink, and I was able to see the bright red veins within the uncooked meat. The steak knife I was given couldn't even cut through the white cartilage of the meat because it was extremely undercooked. \n\nI had told our server, Max,  that it was under cooked, and showed him the meat in question. He proceeded to dismiss my claim, unapologetically stating \"This is how the chef prefers to serve this dish.\" Thanks Max but really, 1) raw chicken isn't as much of a delicacy as steak tartare in this part of the world and 2) there's a little bug called Salmonella that many people avoid if you cook chicken thoroughly! I mean c'mon, it's cast iron chicken-- I think the name denotes it's supposed to be cooked. \n\nThe haughtiness of the waiter's reaction and attitude has made me really rethink revisiting this establishment. It's a shame as I'd really love to give it another chance!", "author": "Vivian B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "The hostess this morning was incredibly rude. She made us feel unwelcome and uncomfortable. The food was unremarkable. Though last time we were there the food and service was better. The ambiance and restaurant itself is nicely decorated, but the staff's attitude needs to be improved.", "author": "L W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "Went here for brunch.  Now I know going for Sunday brunch at a tiny restaurant in a brunch-obsessed, stroller-ridden place like Brooklyn is asking for punishment, but it was near the Navy Yard which is where I had to be later that day.  \n\nWe got there, and hostess told us it would be a 25-30 min wait.  Cut to 40 min later, and we're still waiting.  In the meantime, I looked inside, and saw empty tables.  I know the restaurant has to manage its flow, and make sure the kitchen and waitstaff aren't overwhelmed, but the hostess should have given us a better explanation of what was going on.  We asked, and she didn't really have a good one.\n\nSadly, the food was not worth the wait.  Pretty standard brunch fare and cramped seating.  Also, the wait staff basically ignored us for about 10 min after we sat after our 40 min wait outside.\n\nVinegar Hill House is good, but the terrible front of the house and wait staff service put us in a crappy mood.  Had the food been better, our mood would have been better.\n\nIf you're in the neighborhood, sure go ahead and try it.  But the place is not worth trekking out to or waiting for more than 20 min.", "author": "Terence C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "I came here awhile back, and have been meaning to come back again to confirm how great it is. I remember getting a ragu sauced pasta as an appetizer and their famous chicken as the entree. I'm not normally a chicken person. I would get pork chops or steak over chicken any day, but boy am I glad that I ordered chicken. The atmosphere was very \"Brooklyn.\" With its most wood interior, vintage - non matching furniture, desserts served in mason jars, meals served in cast iron skillets, hipsters everywhere...you know the deal.\n\nDownside: no reservations for brunch, not good for groups, far from everything including transit", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-16", "description": "It has an intimate back patio that seems like you escaped the city and found refuge in Brooklyn, but that's about it.\n\nWe were here on a Sunday brunch, and it was a long line which led to a meh brunch on a rocky tables.\n\nIt wins for charming, but the limited menu was nothing spectacular on my end.\n\nAll in all, cute, but I'll take a pass the next time I'm in the area.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-21", "description": "There are too many other great restaurants in BK, do not come here--especially if you are hungry!!!\n\nThere is a lot of hype about this place and I was curious to check it out for brunch.\n\nThere was a 45 minute wait to be seated despite empty tables in the dining area.\n\nI was ravenous and after a long wait, I ordered a much needed bloody mary, which took 20 minutes to be served.\n\nI ordered a duck egg with confit and homemade crutons, which took an hour to be served.  When the entree finally arrived I received a bowl of crutons!!!!  There was a duck egg and 5 strands of duck confit.  I was furious!  The guy next to me was served a sizeable portion of confit, enough to share with the person he was dining with.  I had enough for a baby's fork.\n\nAfter complaining to the waitress, the host bring me a side of confit.  He apologized and said, \"I'm sorry you didn't think there was enough confit.\"  Are you fucking kidding me?!  I wasn't expecting super-sized confit McDonald's style.  I was expecting a couple of bites, not meager strands of it.\n\nThe table next to ours complained their meal took 45 minutes also.\n\nWhen we were on our way out the waitress told another table they ran out of eggs benedict!  This restaurant serves new American cuisine at brunch.  This isn't a Japanese restaurant, how do you not have eggs benedict at brunch?!\n\nWhile I understand quality food times time to prepare, this place has received too much attention and doesn't have to care about providing service in a timely acceptable manner.\n\nGO ELSEWHERE!", "author": "Kim D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-25", "description": "I was going to give it four stars, but I'm giving it 5 for staying open, accommodating, and not rushing us although it was much past closing time.\n\nThe only bad part was the shady walk from the A train through and very desolate neighborhood. We walked by a projects complete with officers patrolling the corners...not a very safe feeling.\n\nOn to the food, we did not do appetizers, but we had the pig and lamb dishes for dinner. The lamb was awesome. If I wasn't aware it as lamb, I would have thought I was eating a beef dish. I didn't eat much of the pig, but I loved the cheddar grits. After much deliberation, we chose the chocolate cake with cream cheese frosting for dessert. It was very good, highly recommended.\n\nThe meal was a but more expensive than I wouldve liked. Two dinners, one dessert, beer and wine cost around $80, but t was worth it.", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "Great brunch spot, a bit hard to find but totally worth it.  Surprisingly walked right in around noon, no reservations, sat right down near the window!  Sweet.\n\nInside: reminded me of Dumbo nouveau riche/yuppy crowd blended with shabby chic decor meets Williamsburg-ish servers  if that makes sense? \n\nOur waitress might have been new to the job because she clearly made a few mistakes.  After taking our orders, service went downhill...she served the people sitting next to us our meals then embarrassed quickly brought them to us and then proceeded to mix up who ordered what.  Then, she did this really weird thing were she was about to fill up my friend's glass of water but then stopped and ran back to the kitchen and never came back.  Kind of like a fake pour.  Strange but we laughed it off.\n\nAnyway, food was delicious and I thought the portions were pretty good for brunch.  I had the crab special served with eggs hollandaise.  It was so good.  I am definitely going back.", "author": "Kimberly L."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}