{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-07", "description": "We went to check out the restaurant last month and fell in love with the laid-back atmosphere and great food. The staff were warm and the food was great. The winter salad was lovely as was the ravioli.\n\nI can't wait to go back again soon.", "author": "Claudia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "Vinegar Hill House is a destination worth the trip.  The restaurant, which makes full use of its limited space, does not throw you onto someone's table or push you up against the bar as soon as you enter.  Instead a single aisle divides the front of the space which is the main dining area.  Turns out, this place is aptly named, as it feels much more like a house than your run of the mill Brooklyn restaurant.  Seating at the tables might be tight, but you are not lost in a massive crowd so much as one part of the team that is your corner of the restaurant.  I dig camaraderie and it seems you can find it here. There's something about destination restaurants that bring out the best in people.  Once you get there you're already in with the in crowd.  It's a good feeling.\n\nThe menu is filled with seasonal options that fall into an expected price range.  Dinner and drinks for two might be around a hundred bucks.  They also have cocktails and, I must point out, are one of only two places I know that serve applejack in Brooklyn.  Applejack is a liquor made from apples.  It's great to drink in spring and the main ingredient in a Jack Rose, a cocktail very similar to one listed on their menu.\n\nWith my date I ordered about six things and all were fresh and well conceived.  I wasn't into the preparation of the scallops but the dish did have ramps, which are my favorite seasonal anything.  I wanted more ramps, but... I always want more ramps.\n\nI will go back here again for the atmosphere, the abundance of quality ingredients, and staff's desire to let me sit back and enjoy a dinner in their house.", "author": "Jack S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Ohhhh baby...totally worth the hour wait.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "Wait time + Service: On a Saturday night, we waited 25 minutes for a table for 2. There was a bit of waiting for the server to take our order and then a bit more waiting to get a glass of wine, but it was a busy night at VHH as usual and we weren't in such a huge hurry.\n\nFood: For starters, we got the Chicken Liver Mousse with vinegar onions and pistachios. In addition, there was a small handful of fresh greens drizzled with horseradish sauce, and there were three 1-inch thick chunks of toast. The crust of the toast was on the slightly burnt and inedible side. The flavor of the liver was complemented well by the onions. The layer of pistachios on top made it texturally more interesting but might've put the flavor off balance. It left me yearning for a slice of red onion or bosc pear even.\n\nFor our main entrees, we ordered the Whole German Brown Trout with carrots and cumin, and the Red Wattle Country Chop with fingerling potatoes, crème fraîche and dill. \n\nMaybe the menu writer hadn't thought of this at the time (just as I hadn't until my husband laughingly pointed this out) but the term \"brown trout\" is slang for something pretty unsavory, something more likely found in toilet bowls than on dinner plates. Nevertheless, we ordered it and savored it! The fish was de-boned, the flesh was firm, the taste was mostly buttery, and we detected a little mint in there as well.\n\nThe chop was very juicy and flavorful, surprising to me given that the meat comes from a heritage breed of pig that used to be passed over for other breeds that had higher fat/lard content. Of the dishes we ordered, the red wattle chop is definitely a meal to come back for next time.", "author": "June W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-16", "description": "Tried a yellowtail neck they cooked for a food event in Brooklyn yesterday.  It was barely edible.  Tasted like canned tuna fish mixed with arugula.  And on top of that they were the only chefs that didn't say anything when they handed you the plate of food making it seem like you were hassling them.  Keep in mind, this was an event that everyone had to pay to get in for.  Easily the most disappointing dish out of all.", "author": "Mr. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "Walking to vinegar hill house feels like exploring a new city  - hidden on a quiet street that makes you forget your in New York.\n\nWe had the octopus salad, lamb and a side of beets - all outstanding.\nThe salad had a nice tangy flavor, the lamb was tender and delicious and the beets creative.\n\nWe finished with the grapefruit tart - so good that we were almost in tears!\n\nFriendly service and they made good recommendations.", "author": "N T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Terrific food with a rustic touch. The portions are not small like most of the ppl mentioned. I highly recommend this place !!", "author": "Eli K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-11", "description": "Absolutely fantastic.  Em and I were seated basically right away, which I suspect had to do with it being before 7pm on a Wednesday, because by the time we left it was packed to the gills (it's not big). But the place is adorable, and the servers were very attentive and accommodating, despite getting swamped pretty quickly after we got there.\n\nAnd the food, my god the food... we shared an oven roasted octopus appetizer that was SO tender as well as the soup du jour, a chestnut and honey puree that was in the running for the best soups I've ever had (and you know I like some soup). Then I had the the roasted wild boar shank over polenta and Em had a fresh organic salmon, and we shared a side of brussels sprouts. All were outstanding, the boar was so tender and roasted in an amazing almost-asian-spiced glaze, and the salmon was crazy fresh, served rare with a horseradish cream; the brussels sprouts were well-roasted, sweet and citrusy with a little red pepper kick. And lastly, we shared a grapefruit tarte that was more like a un-brûlée'd crème brûlée.  We ate every single bite of everything we ordered.\n\nI could see the place getting crowded and maybe less pleasant -  I saw some later arrivals having a hard time getting seated and being dealt with a little more matter of fact-ly, but considering this was just days after a (second) NYT write-up on a comparatively warm early March evening, I was blown away. And hell, that soup (and that boar) would be worth a wait!! Five stars.", "author": "Gordon D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "Located in the middle of nowhere, in the neighborhood immediately east of DUMBO, is a gem of a restaurant. The space is reminiscent of a cabin in the country. Food is also top notch. Duck liver mousse is a great starter. In terms of entrees, the chicken is easily one of the best around. It's a must order (and i never order chicken at a restaurant). The pork chop is also awesome. Huge portion. They're definitely not shy in terms of cooking it closer to medium rare. I wish more places would do that. If you like salty desserts get the salted caramel custard. Awesome. Wait times can stretch to an hour during peak times so grab a drink at the bar. It'll be worth it.", "author": "Joon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "quite lovely-- homey bistro-ish food (creative, mixed influences), not wayyyy expensive (about $30-40 a person w/ glass of wine, dessert).  You feel like you're in a different world, maybe Paris, with the rustic-renovated decor and big window on a quiet cobblestoned side street.  Though it fills up FAST-- we got there right as it opened at 6 (pre-St. Ann's Warehouse show) and there was quite a wait by the time we left.\n\nMy friend had the roast chicken and it was seriously out of this world. Sweet pea ravioli was small and simple but good on my side.  If you're feeling nutty they have (or at least when I was there) an $80 home-aged steak, definitely enough for 3 if not 4 people.  Someone near us had it and it looked like a nice special occasion kind of thing.\n\nDessert (caramel custard) was probably more than I needed, but still delish.\n\nService was a little odd-- waify nervous lady with unintelligible voice-- but probably just an off-moment.", "author": "Bess W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-14", "description": "I went last night with a new-ish friend.  I liked the food, she didn't (more on that below).  We arrived around 10:30 and so we got seated right away (the bar area was fairly crowded).  The service was friendly.\n\nAtmosphere:  homey, a bit rundown (I wish they would fix the decor/paint just a little as it comes across as a bit \"dirty\"; thankfully, the bathroom is the nicest place in here).   \n\nScene:  We played a game of \"guess how many people in here are wearing black-rimmed hipster glasses\".  It was about 1/3 of the people in the room.  While we were playing, a foursome came in, 2 wearing black-rimmed glasses.  Funny.  ;-)   \n\nWe had been joking with the waiter about how I got the \"little girl glass\" for wine (it was just a teeny-tiny bowl with no stem - like what you would put a tee light into).  I asked him for a regular wine glass (which I spied on another table and he forgot and brought me another \"tee light wine glass\".  I said, kiddingly, \"You said you would bring me an adult wine glass.\"  The guy to my right at the next table, froze in mid-water pour to stare at me.  The female across from him looked at me in disgust.  I laughed.  The waiter thought it was funny.  However, I was now the \"hated, non-hipster wench\". Yes, people, you may be jugded and looked down upon here so watch what you wear and what you say lest you be thought of as \"the man\". \n\nService:  Our waiter was friendly.  We joked with him (see above) and he was cool with that.  The busboy (who was wearing black-rimmed hipster glasses) whom my friend asked if he could change the (thrash) music, went over to change it immediately to something more dinner- and conversation-friendly.\n\nFood:  We split the Shaved Market Salad ($9) which I really liked and so did my friend.  We both thought the dressing (and the salad) was really light and fresh.  I got the Cast-Iron Chicken ($15).  I liked it but thought the sauce was a little too tart/lemon-y.  I also thought it was a little overpriced as it comes a la carte (you have to order sides, separately).  I ordered the squash ($8) as a side.  My friend ordered the octupus and was unimpressed.\n\nOverall:   Though I thought it was overpriced and the food could be a bit better, I would go again.  My friend wouldn't.  The staff is friendly; (the attitude comes from the patrons).  The streets were deserted when we came and deserted when we left (after midnight).  I would be careful walking back to the F train.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "Very, very good food.  A surprisingly sneaky good wine list.  Unfortunately, the service is horrendous.  Way too many people working in a small space and 60% of them really not even doing anything.  And the waitstaff is sloppy. Their keys hang on their belt loops at roughly glass level endangering the terrific cocktails made by their bartender. That said, definitely don't let the poor service ruin the experience.  The food is top notch as is the experience of going to this isolated neighborhood to enjoy a fine meal.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "Well, this place has been reviewed a lot, so there's probably very little I can add.\n\nIt's a great place.  A very special menu, the likes of which you're not going to find elsewhere.  And no misses.  I've been several times, and have sampled most everything.\n\nI'm not sure why the pork chop gets such attention.  I mean, it's nice.  Very nice.  It's a big, juicy, tasty pork chop.  But there are so many more complex things on the menu, it's not my top choice.\n\nThe atmosphere is nice.  A little homey, a little bohemian.  Buzzing but not loud.  It seems to adapt to suit my mood and the nature of the occasion--a date, meeting friends, business even.", "author": "Keith D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-28", "description": "I kind of want to give this place 4 stars just because it's so good that it makes me feel like I'm making an obvious point by saying so.\n\nBut it really is so good.  I've only been here once, for brunch, but my friends and I had been curious about it for months.  The first time we passed by it our interest was instantly piqued, and we had eyed it and wondered about it ever since.\n\nI never go out to brunch because it makes me feel like I have let myself go, in the worst way possible.  If you are a brunch addict, I am judging you, but only just a little bit.  I know deep down that only you can answer for your own actions.  \n\nBut anyway, this one particularly beautiful day, one of the last days of summer, three of my closest friends and I had had a sleepover and we knew that today was the day we'd check out Vinegar Hill House. \n\nEverything was amazing, quite possibly the best food I have ever had at a restaurant and paid for.  Not only was everything perfectly, deliciously prepared, but the combination of ingredients in all of our dishes perfectly, deliciously satisfied us.\n\nThe service fine, but I wished we had been seated in another section - I noticed there was a server who was being way more friendly and gracious with his section than ours was.  Again, it's not like our server wasn't decent, but she was kinda stiff the whole time despite how easy and nice we all are.  \n\nOh well, the food was so good that it almost made me want to have brunch again.  I'll be back to try dinner.", "author": "Lee J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-14", "description": "I think this place is very charming, and I am glad that it gave me a chance to visit the much talked about Vinegar Hill neighborhood.  However, I didn't love my food.  I had some delicious chicken liver mousse to start, and my friend really enjoyed her ravioli, but the rest was sort of over rated, over seasoned. \n\nThe cast iron chicken was alright but the sauce it was served with was really overpowering and quite acidic.  The whole place kept smelling of burn vinegar as well.  It might of been all mental, but does every bite have to include an acidic bite of vinegar to justify the name/neighborhood??\n\nAlso I wish the wait staff would drop the holier than that vibe from Freeman's.  You're not fooling anyone, we know you were the host at Freeman for years!", "author": "ashley h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "Went here on a whim, since I happened to be in the area when late afternoon rolled around. Upsides, and some downsides...\n\nDownside: First impressions are key... I was kinda annoyed they made me wait until 5:30 to enter the place (I arrived at 5pm) -- I mean, I could have sat at the bar and at least would have been inside. Instead, I sat outside and waited. Then they didn't even let me (or anyone else) know when it was OKAY to come in. Thumbs down. That was kinda the trend as far as service goes, which other folks have mentioned on here. It's blase, and keeps in line with the \"we're so cool, we just don't even care\" / hipster thing. \n\nUpside: All else aside, the food was really solid. Started with something very new for me, a special seafood app - anchovy (!?) on top of toast w/ olive oil, fresh cherry tomatoes, basil. Really a knockout, and adventurous for me. Glad I went with the waiter's recommendation on that one.\n\nThen onto the braised short rib which was so tender and delicious. Also had the fresh tomatoes and I couldn't get enough of them. A tiny bit of blue cheese added just a hint of something else that made this dish something I'd come back for -- except with such an interesting menu that changes frequently, I would probably try something else next time. \n\nBut, the downside: Hitachino White Ale was $9 for a less than 12 oz. bottle. Seriously? I suppose a total meal of $50 was more or less reasonable for a beer, appetizer and main dish.\n\nThen again, an upside: The outdoor patio in the back looks so picturesque, it just might break your camera lens. \n\nOverall impression: This is a restaurant for the \"too cool\" class of hipster, but then again this type of Broklynites love its farm fresh produce... the use of only the freshest vegetables is going to set this place apart. I also have a feeling your food will be better if you eat earlier in the evening, since you'd be more likely to get fresher ingredients. The decor is great for a place like this... very old and homey, and I'm sure warm/cozy in the wintertime -- it all works... the food, the atmosphere, the decor, the neighborhood. \n\nAnd the soundtrack: David Byrne \u0026 Elliot Smith? Eh... gotta love the hipsters. BYOB = bring your own bicycle.", "author": "Marshall H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-16", "description": "Cozy and charming faux farmhouse setting with exceptional food and attention to detail.  We sat in the small wooden dining room downstairs next to a roaring fire.  For appetizers, the salads were fantastic - complex and interesting.  We also really enjoyed the pork chop and the black pepper linguine.  Our waiter was quite helpful and described our options with great enthusiasm and knowledge.\n\nThe only blemish to the evening was the bartender who - despite some pretty cool tattoos - can best be described as \"not a people person\".  Eye contact and friendliness might work in your favor, buddy.", "author": "Tudor P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-05", "description": "I was excited to try Vinegar Hill House as I like Freeman's food but I don't love the attitude. I thought a Brooklyn version would be an improvement, but sadly I was wrong.\n\nWe ordered a bottle of wine at the bar and were brought a different bottle. When we said it wasn't correct, the bartender questioned us before determining that it was in fact not the bottle we ordered.\n\nOnce we were seated at a table the waiter greeted us with a \"sup?\" and then asked what kind of water we wanted--but didn't bring us water until our meals arrived 30 minutes later, even though we requested it three times. \n\nThe food was good (excellent charcuterie plate), though the chicken was not entirely cooked. When the waiter saw I was examining the uncooked chicken, he walked away. He never checked back to see how our meal was. \n\nThe restaurant is located on a really pretty street in Brooklyn and the atmosphere is nice, but the service was terrible. I think you can find similar food in Brooklyn without having to put up with the terrible service and attitude. When is the too cool for school vibe going to die?", "author": "karen b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-12", "description": "Avoid!  Stingy portions, over-salted,  uninspiring, loud music requiring shouting across the small uncomfortably close placed tables to your dinner partner,  chaotic and poor service.   Cannot fathom why or who gives good ratings to this place.  Looks charming at arrival, but downhill from there.  At least 6 or 7 different people involved in serving and clearing.  At least 5 requests for bread before it arrived.   Severs reach directly over your plate, while you are eating, to  remove items, without so much as saying excuse me.  At one point,  the hostess' hair was directly over my plate...ugh- luckily I had finished the minute portion of pasta, which had me drinking water for the remainder of the evening.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-01", "description": "i trekked all the way to dumbo [brooklyn] through the sketchy streets and alleys to get to vinegar hill house. at first, you wonder wonder who would make this journey and if it will be even close to worth it... yes. it IS worth going into another world. it is nestled among houses and a cobblestone street; you can easily pass vinegar hill house.\n\nthe first to arrive (i hate waiting in lines, i'd rather be early if you can't tell already) we waited outside for the doors to open. its beautiful and very homey. i loved it. [except the walk back to the subway....]\n\nordered a delicious fig dish, the red wattle pork chop, cast iron chicken, charred beets, \u0026 corn. besides the unaesthetic presentation of the charred beets [would have preferred it to be cut and easier to eat?], it was an amazing meal. the pork chops were perfectly seasoned and cooked, with the cheddar grits underneath.... it was phenomenal. obviously sides like corn and beets are just solid choices that complement any entree.\n\ngoing back each season in hopes to discover new flavors and dishes. not TOO often as it still is really far.", "author": "Diana Y."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}