{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "Visited this place while traveling for work in NYC and this place was recommended to me by a native from Brooklyn. So one night I hopped on the F train for my first visit into Brooklyn. Had the chicken liver pate for starters which was excellent. Then had the pork chop for the main course which was also very good. Topped it off with some chocolate cake, gods but not blown away. I liked the atmosphere, kind of like hipsters hanging out at grandma's house. Sat at the bar and the service was good.", "author": "Jesse F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "A lonely outpost in a sea of cobblestones and eerie hodgepodge of industrial and residential buildings, this quaint eatery has a cozy and inviting atmosphere. It is a cute and unique find, though expect there to be a wait, as there are a number of others who've already found it and have decided it to be worth the trek. I normally do not order chicken when eating out as many restaurants, even very famous ones, tend to overcook chicken. However, their cast iron chicken was perfectly tender, and the sauce had just the right hint of vinegar and shallot. The endive salad was good (also had a vinegar/mustard themed dressing), but the chicken was the highlight. My one regret was not having noticed the skillet cornbread on the menu, which looked awesome, and I'll have to return to try.", "author": "B R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "Super cute brunch spot! We both ordered the special of the day: biscuits with poached eggs covered in a white bacon gravy. Simple and delicious! The biscuits were so flaky and buttery. I'd definitely come back more often if I lived in the area. Also, apparently listed in the book Where Chefs Eat for their dinner so I'm sure that's amazing too!", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "The hostess looked unfriendly, house wine Pino was sour, decor is not the issue, the food was good (nothing special) \nHave no idea about 4-5 stars reviews:-(  We were disappointment", "author": "Margo Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-06", "description": "I went to vinegar hill house to celebrate my birthday with my two daughters in spite of the negative reviews I had read on Yelp    I was hoping some of the reviews were exaggerated but unfortunately they were spot on.  From the terrible service to the burnt yet soggy cornbread to the grossly undercooked wattle chop   I will never distrust Yelp again.   I also would add the rude attitude of the host and hostess .  And when they say salvaged decor they mean from someone's garbage    On a positive note the drinks were good even if we had to wait a long time for them   My daughter actually had to ask the bus boy THREE times to please get our waitress.   Save you money for someplace that actually appreciated your business", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "I've been here for brunch and drinks a bunch of times. For brunch I ordered the special of the day: biscuits with poached eggs covered in a white bacon gravy. The biscuits were so moist, flaky and buttery. Pancakes are delicious too. \n\nThis summer I road my citi bike to Dumbo and decided to have a few glasses of wine and some dinner. We ordered wonderful potatoes and amazing octopus that we washed down with some guilt free white wine. \n\nThe patrons do not seem to mind that there is a wait for a table. I do not mind waiting to be seated outdoors either. This is one restaurant in BK that people come early for dinner. The chef has talent and writing this review makes me want to book dinner again.\n\nwell done!", "author": "Greg O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-24", "description": "This one's a toughie. Good food, not spectacular but solid. Great drinks (kudos to you, Bartender, for creative and well crafted cocktails and an excellent wine and dessert drink menu). However it's the service where Vinegar Hill House falls short. \n\nI went with a group of 4 people ready to spend some money on a great Brooklyn meal. And indeed the food was everything you've come to expect from new American Brooklyn dining: the cheese and meat plate was perfect, offering 3 delicious cheeses from Vermont, some fine meats and roulades and it didn't hurt that we supplemented it with the chicken liver mousse (also delicious). My lamb neck was savory and filling.and no one had complaints about their orders. \n\nIt was our server who left us with a bad taste though. We had to repeat every order for every course. We had to flag her down multiple times not to complain but to order more. It simply wasn't very enjoyable. \n\nSo if I could give 3.5 stars I would. But I can't. And I\"m not feeling generous. I'm feeling cranky. Sorry Vinegar Hill House, while you make excellent food, you're quite far and not as warm as advertised. I'll be back but not on my own accord.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-01", "description": "This was a bit of a disappointment for us. We made the pleasant trek/walk  from Brooklyn Heights, however I think the walk was the best part of our evening.  The place is not \"twin peaks\" but just has a simple farmhouse cottage look. \nThe decor is not the issue, the food is, and frankly it was not very memorable especially for the price.  I had the Risotto which was fairly bland.  My husband had the pork chop dish which was good, but nothing he would want to return for. \nMy biggest gripe is this place is small ad LOUD; we were hoping for a more serene atmosphere, but were surprised by all the chatter and left not understanding why this place was popular.. EXCEPT for the fact that DUMBO seriously lacks in Dining establishments.  Service was decent but nothing to write home about.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "Cutie Patroller patrolling report \n\nMini trip to Brooklyn.....only $13 cab ride from Cutie Patroller LES office!!! Pictures are brunch I had. Dinner menu I will recommend you to order their famous Red Wattle Country Chop!!! MUST!!!!!!\n\nOverall - 4 hearts\nFood - 4 hearts\nAtmosphere - 4 hearts\nPrice - $$$1/2\n\n\nCutie Patroller is always on the prowl in downtown NYC for cute places and great food.", "author": "Cutie Patroller .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "I was pleasantly surprised how good the food was from beginning to the very end.  My only complaint was the poor ventilation, we went home with our clothes smelling like a bad Korean BBQ joint--- and yes I am Korean!  \n\nFor those not familiar with the area, and I don't blame you.  The trek is a liitle harrowing from the dark deserted streets of Downtown Brooklyn.  Finding a taxi could be challenging as well as a nearby subway station which is only a few blocks away.  That said, if you do find this \"hidden\" gem you will be happy that you came.  In the farm-to-table style reminsicent of the great Blue Hill Farms, we found the entrees and desserts to be wonderfully satisfying.  Only open for weekend brunch and dinners, find it in your brave heart to make a trek to this little very un-prentitious restaurant.", "author": "Jj L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-11", "description": "First of all, I called for a reservation and the clerk told me they were booked all evening but I might have a chance as a walk in.  We walked in at 7:15 and only three other tables were taken...  Place was  basically empty.\nSecond, the overly friendly / rude waiter found it tedious to explain the ingredients and preparation of a cod roe spaghetti.   Lastly, both sets of silver wear on out table were dirty.  We cancelled our order and left.   I live in the neighborhood and want  Vinegar  Hill to grow and succeed.    Vinegar Hill House needs to change its attitude!", "author": "Dan A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-21", "description": "As my friend and I walked in, the first thing he said was, \"This is so Brooklyn.\" Immediately, I got defensive and replied with, \"Is that bad?! What do you mean it's so Brooklyn?\" He sensed the fire in my eyes and backed down replying with, \"It's not bad. It just looks like we're in Brooklyn.\" Uh huh. Sure.\n\nI've been here for brunch with a few friends and we ended up ordering 3/4 of the menu because 1) we're all fatties 2) fatties are always hungry 3) like the fatties we are, we ordered with our stomachs and not heads.\n\nI remember the food being better the first time around. Alas, we ordered the infamous pancake* with caramelized apples and orange butter, eggs and tomato and maple bacon as a side. I perused the menu to find that the skirt steak I ordered last time was gone. \n\nThe pancake, simply put, is heaven. It doesn't need an in depth description. You just need to try it. The eggs and tomato were a bit on the salty side. I would've liked the crushed tomatoes to be a bit more tart. The side of maple bacon complimented the pancake.\n\nThe bloody mary is also quite tasty and the coffee is bottomless and strong.\n\nThe service is a bit slow paced but I appreciate that you can have a conversation without being interrupted every few minutes asking if everything is okay.\n\nI think the pricing is on point. We didn't have to make a reservation probably because it was just us. We also arrived towards the end of brunch, 3 PM.\n\n--------------------------\n\n*They should really give more than one pancake. Don't get me wrong, the one pancake is totally worth $10 but now I have to come back to order another one. Smart marketing me thinks.", "author": "Jen R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-28", "description": "This is not my first time here. The first time, we had a great meal. Second time, something changed. Undeniably, the big draw is the ambiance. The restaurant is located in the small little area known as Vinegar Hill and restaurant reflects a country-like, homey atmosphere. Take away that element and you are left with overpriced food, small portions and inattentive waiters.  If food is not going to take home any awards, then you need to execute it with service. The waiters here take themselves way too serious and it creates unease. Hipsters run amok and I am over that phase of Brooklyn dining. \n\nFood:\n\n1. Rabbit was overcooked, dry and oversalted\n2. Meat Plate was meh! Tessa was flavorless - if you want great charcuterie go to Marlow \u0026 Daughters - Cheese on the other-hand was delicious and from Saxelby Cheesemongers \n3. Pasta dish - no salt \n4. Dessert was the highlight - I feel like the invested well in the pastry chef.  \n\nNot worth returning!", "author": "Adam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "Love the french press coffee \u0026 the La Colombe cold brew coffee!\nTheir menu changes, depends on the season and what's available locally.\nIf you can get it, the fried oysters were so delicious and tasted pretty fresh! no gritty texture here!\nThe breakfast tacos that comes in three hard shells were super yummy! The shell don't break into crumbs as you bite! Every bites is just full of meat, cheese and lettuce! love it. \nHubby likes their pancake which is a plate-size blueberry pancake with maple syrup. Its pretty sweet from the maple syrup and the pancake is fluffy. Very filling. Something to try when you are really craving for pancakes.\nLove how this is away from all the DUMBO craziness but you can go walk over to the park after since you are full of good food! Great location when you worry about parking because there's always street parking!\nOutdoor seating is nice when it's not a hot, humid day.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "Magical place, wonderful, wonderful food. Just about perfect. If I was being fussy, perhaps the dishes appeared a little too quickly. But I will be back again and again. Marvellous. The food is superb without being chichi or gimmicky.", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "The art and the waterfront walk will wet your appetite for this perfect fall restaurant.  Vinegar Hill House is on a romantic cobblestone street in the northern part of DUMBO. It boasts a first rate kitchen and a first class bar...cant go wrong with any of the drinks! During the fall and winter, this is the perfect place to come in from the cold.\n\nI would recommend the lamb ragu, it was delicious! This would be a nice place for a second date, its cozy and the ambiance is nice. Including tips, dinner and drinks, it cost around $100.", "author": "Neigel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "As soon as I walked through the doors of this little Brooklyn gem, I knew the food was gonna be good. I literally felt like I entered an old school traditional cottage, wooden tables, handmade decor, a fire pit oven - charming and different than your typical NYC space. This place was packed to the brim on a Sunday, but that's the typical BK brunch scene for you.\n\nWe started off with the poutine tater tots appetizer (which was a special for that day) and omg... I could have licked the plate clean but I didn't want to embarrass my friend. LOL!  For our entrees, I ordered the Dorado Tacos which were spicy, filling and fresh and my friend ordered the eggs benedict which was absolutely delicious. Perfect hollandaise sauce- very impressive! He was originally raving about the shrimp and grits but by the time he attempted to order it, they were all sold out for day. He looked absolutely miserable when they told him the sad news so they must be amazing - he highly, highly recommends this dish for anyone that's in to it or even a little curious.\n\nI had a round of two tiny mixed cocktails that packed a serious punch- I can't remember the name but they left me seriously tipsy. Very well made and refreshing.\n\nIt was the perfect Brooklyn brunch spot- great food, charming and knowledgeable servers, and the ambiance was unmatched. LOVED IT!", "author": "Marina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Everything about my brunch was divine! The restaurant was not that crowded for Sunday at 3pm (I expected it to be packed), and the location of Vinegar Hill House is on a charming street that has clearly started to catch people's attention, as there was a sign up on the street that the show The Americans will be filming there this week. \n\nThe restaurant itself isn't huge, but has that typical Brooklyn flare and decor that we have all grown to love. We ordered the Eggs Benedict, Cheddar Grits and Poached Pear Sourdough Pancakes. Everything was so delicious, and we devoured our meal along with two bloody marys. Of everything we ordered, the bloody marys were prolly the only item that was average, nothing spectacular. I will definitely be back for the food though!", "author": "Preethy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-11", "description": "Our group of 5 had to wait over an hour for a table on a Sunday night. Fortunately, food did not disappoint. \n\nGotta get the Guinness chocolate cake!", "author": "Jen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "YUMMY but could be more expansive menu, its quite slim pickings.", "author": "Alexandria M."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}