{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-12", "description": "Not super impressed with this place. We had the chicken liver mousse and and the octopus appetizers. The mousse had no flavor at all. The most flavorful thing about the dish was the onion chutney. The octopus had a very distinct flavor that was not palatable to me but my partner liked it even though he said it was very chewy like it was overlooked. The atmosphere was ok, I could see going to have a few drinks at the bar but not a dinner. We were served wine in tumblers when other tables had actual stemmed wine glasses. Overall I would say it does not live up to any hype you may have heard.", "author": "Courtney S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "Not sure what happened to this place. We used to come here all the time for the atmosphere, the food and the bacon! The last time we were here was a complete disappointment. We figured it was off day so we gave it another chance. $120 brunch for an overcooked burger, charred bacon and rude service. Couldn't have been more of a disappointment.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "Went to celebrate our wedding anniversary. We noted on the reservation that it was our anniversary, yet no one mentioned it to us the whole night. Our waitress was very cold, never smiled, and due to the noise in the restaurant (no music- just overcrowding), we could barely hear her.  We were seated at a two top between two other tables with less than a foot between each table and could hear every detail of the others' conversation. NOT very romantic.  The visual ambiance of the restaurant is cozy and warm, but the way they pack people in ruins the atmosphere. Food was just okay. Pork chop was tiny. Pasta was large but nothing special. Cornbread very good. Overall, we enjoyed ourselves because we were together, but will not return or recommend to anyone.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "A very cute low key restaurant in dumbo. They have a backyard with seatings so it's a perfect place to eat when the weather is nice. \nWe (two girls) ordered the cheese board, chicken liver mousse, tequila cured fluke, cavatelli and cast iron chicken. It was a bit too much food tbh lol \nMy favorites were the chicken liver, fluke and the chicken. \nFluke was spicy and the dressing was very refreshing, prob highlight of the meal. I didn't really enjoy their selection of cheese. Very stinky but my girl liked it. \nThe server coursed our meal so the whole meal came out in a slow pace which we had no problem with since we were chatting it up. But if you're in a rush, you should def let the server know. It started sprinkling so we asked to be moved inside and they were very nice about it.\nOh Jonah hill was leaving the restaurant when we moved into the dining area.", "author": "Kristina P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-12", "description": "I came to this place with such high expectations and maybe that was my first mistake.  \n\nFirst of all, like some of the other reviewers state, this place is really in the middle of nowhere.  I don't often feel unsafe in NYC, but walking to this place, there are no other people are and it's totally desolate.  I kept thinking to myself, I could get mugged out here and no one would know...anyway once I got that out of my mind, we found the place and it is cozy and cute.\n\nIt's highly rated on foursquare (and maybe that was a red flag too...) so we went in and were excited that we could get a seat at the bar without a wait.  The bartender seemed overwhelmed even though the bar wasn't that busy, and it took her a while to make our drinks and take our orders.  We weren't in a hurry and this only bothered me a little, but what came next is what I can't overlook.\n\nWe ordered the corn bread, a salad, a pasta and the cast iron chicken.  It took FOREVER.  Almost 30 minutes from when we ordered for our salad to come out.  It was over dressed and soggy.  SO disappointing.  The flavors made sense together, but whatever dressing was on it was so over powering.  We didn't say anything though, since we were STARVING.  Another 15 minutes later, the  corn bread came out and it was completely BURNT.  So burnt that we couldn't even get them out of the pan.  So burnt that the bottom was hard and difficult to bite through.  We had to send it back because it was inedible.  Wanna know the response we got?  \n\nThey couldn't guarantee that it wouldn't come out burnt again.  Um...ok?  What am I supposed to do with that information?  Are you telling me that we shouldn't have ordered it?  We were totally confused.\n\nWe waited very PATIENTLY for them to come out again and the second time around, they were able to get it right.  The corn bread was good.  Not great, but good.\n\nThe pasta dish was the ravioli and the flavors were a little strange and the portion was small.  The chicken?  Forget it.  It was so basic and came with basically nothing else except for a couple of oven cooked onions.  It was nothing special and frankly, despite all the sauce in the pan, it was kind of dry.  AND it was expensive!  $26 for two little pieces of undressed chicken in a cast iron pan...\n\nSo, all in all, this place is out of the way, overpriced, the service leaves a lot of be desired and the food is nothing new.  I won't be back.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "Very cute spot in a non descript corner of dumbo, almost didn't see it as I walked by. Very good vibe with a relaxed and happy staff . The shrimp and grits were great. There also a patio in the back with shaded areas so nice on a summer day. It's a little ways away from the prime crowded areas but that's a good thing .", "author": "Sital V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "As soon as I posted this review I was immediately reached out to by the general manager to make it right. It was made completely clear to me that this is not the experience they accept as normal at Vinegar Hill House. They were extremely apologetic and asked for details, offering me their cell phone number to call, and asked for my mailing address. It was sincere, especially after today when I received a hand-written note from them in the mail encouraging me to come back. Which totally worked, because now I'm excited to give it a try again, because even though it's all I remember from the dining experience, I cannot wait to get back to that corn bread. And thank goodness too because I felt like a real d*ck for posting my (first) one star review.", "author": "Phena L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "totally a fan of this place. went here on a thursday and got prime seating at da bar. i know these new-wave-american-fare places are a dime a dozen, but this place really nails it. started w the blue fish spread, then had the market fish of the day and some kinda pasta (also had wine so that's why my memory is a bit spotty). really wanted to lean in and get dessert but i'm not blessed w a bomb metabolism, so i passed. expect to go here and drop some serious coin. all that coinage gives ya a rad experience, so it's well worth it.", "author": "Shannon W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Best hidden gem in Brooklyn. The food is delicious and the cocktails are excellent. The chicken is great, as a standard, but the best dishes are really the seasonal items. And definitely get dessert!", "author": "Louis S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "I debated about leaving a review for fear that this little gem of a restaurant will be to difficult to get a resi for in the future.\nLet me just say if you haven't gone to Vinegar Hill House, GO, go now.\n\nI'll roll right to the food and how delicious it was! I had thee, and I mean thee best Pork Chop I've had in my entire half century on this planet. When it's described as \"off the chain\", it is off the chain and then some! I didn't order it, my friend did but was kind enough to give me two generous helpings of this crazy delicious \"Red Wattle Chop\", a term I'd never heard of before, just order this dish you won't be sorry, trust.\n\nAt the risk of sounding like I had order envy, I did, until I tasted my dish, the Tagliatelle Pork Ragu!!!!! Stop the presses, it was as good a pasta dish I've ever had as a native New Yorker anywhere in the five boroughs.\nOrder this and you'll be more than happy hat you did. Just the right amount of deliciousness so you don't go into a food coma.\n\nWhich brings me to dessert. I had the Chocolate Guinness cake with cream cheese frosting.....if you like chocolate cake. This was as good as it gets. Was it the best I've ever tasted? No, but damn close. The cream cheese frosting really sets it apart from plain chocolate frosting. Really good!\n\nOnly improvement would be the server. Hey I was a hip NY city kid once and thought I was the coolest while hanging out at 54, mudd club, cbgb's etc(humble brag, sorry).......our server was/is suffering from extreme hipsterism, but I can look past all that because the ambience food and cocktails were just that good!!!", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Amazing. Had the cavatelli and blue fish appetizers and tilefish and pork chop entrees. Truly outstanding.", "author": "Erwin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "If Vinegar Hill House was in Manhattan I'm afraid it would be impossible to get a table.  Even in this unique, off the beaten path neighborhood of Brooklyn, it gets fairly crowded by 11 AM on a weekend.  There is substance to the popularity. This place serves one of the best brunches in New York City.  Their eggs Benedict is so delicious, with a perfectly cooked organic poached egg on a muffin with a delicious taste and texture.  I also tried their pear sourdough pancakes with maple syrup.  Yum!  Just the right balance of syrup, butter, and wonderful sourdough pancake.  And to top it off they serve great coffee in a delightful vintage atmosphere.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-07", "description": "I was very excited to try Vinegar Hill House after hearing really great things from friends. I live and work in Brooklyn and have been to tons of restaurants as I love exploring the neighborhoods.  Unfortunately, this is the worst dining experience I've had in Brooklyn, and possibly New York City.  Inside, the decorations and ambiance are very nice.  My party of 3 sat in the backyard, which was a lovely setting.  The menu is quite short, but we figured, there are so few items the chef must prepare each of them well!  We were wrong. We ordered wine (served in tumblers although other tables had stemmed glasses) and a martini (very small), and 3 appetizers to start - the cornbread ($10), shishito peppers, and prosciutto/melon.  The cornbread was completely tasteless - I've had better from a box mix or any BBQ restaurant - we sent it back and they did comp us that appetizer which was appreciated.  The peppers were OK, and the prosciutto/melon was a very odd presentation mixed in a bowl and not very good.  We asked for bread and got 4 teeny tiny pieces of bread - no butter or olive oil on the side.  For the main course, 2 of us got the manicotti with pork ragu which was absolutely tasteless.  I left 3/4 of it because it had no taste at all and just was not appetizing.  The pork was OK but also bland.  We let the waitress know that we were pretty disappointed with all of our meals, after hearing such good things.  10 minutes later, the manager came out and put 2 desserts on the table and said she sent our message to the chef.  The desserts were AWFUL!!  I appreciate the gesture, but after complaining about the taste of the food, why would we want MORE food from the kitchen?  We left them both on the table barely touched and were really disappointed that the manager did not try to learn more about our experience or make it right.  This was an expensive meal and we did not feel the staff cared about us as patrons at all. I hardly ever give 1-star reviews, but this was one of the most disappointing experiences I've had at a restaurant and I sincerely hope they take feedback into consideration, as I've heard it used to be a great spot, and seems to have gone downhill.", "author": "Diana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "if you like a farm to table type experience this place has it all! the location is charming and so are its employees. wine choices are as unpretentious as drink prices. go there in the summer for bonus rear garden experience.", "author": "sonicsoul s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "It's been several years since I ate there but it was one of the great dining experiences I've had.  I had the soft shell crab as an appetizer and the pork for dinner.  Awesome.   Going to go back soon.", "author": "Edward W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-24", "description": "So what happened? Made reservation based on the reviews. I must have read every yelp review for every Dumbo restaurant at least twice before picking Vinegar Hill House. It is a cozy inviting place. The service is decent. We enjoyed the liver appetizer and my husband enjoyed his pork chops. And that is the only reason for 3 stars. \nMy pasta dish with eggplant was pretty small and below average. The pasta was chewy not in a good way. The 3 eggplant cubes tasted almost raw.  The kids ordered the cast iron chicken. The same chicken that everyone raved about. It came out looking pale and sick in that jus that tasted like a bunch of squeezed lemons. My wine was served in a \"rustic\" short stemless glass. If we are paying $12 for a small dish of Brussels sprouts, I want at least a decent wine glass. \nHey listen, every chef can have an off day. It was a day after Thanksgiving and the kitchen crew could have been recovering from their own \"home cooking\". Will I come back? Not likely. There are tons of other \"modern american\" restaurants to chose from. Unfortunately, this one did not stand out for me.", "author": "Gaina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "The current rating does not reflect my experience. We arrived, a party of 5 with one dragging. We explained the situation and offered to order for our 'late arriver' and were told they have a policy not to seat with all parties present. We understood but the restaurant was practically empty. We waited, a couple heavy hitter celebrities arrived, but place was still pretty open. We plead our case again and were seated. Our server was superb. Just the right amount of hovering but not intrusive. No one made a move to said celebs which I personally appreciAted. Our perry ordered the chicken, the pork, the two pasta dishes, and the trout. We also had the apple salad and the fennel. And you cannot miss the cornbread which taste like a perfectly turned out light dessert. And of course we shared!! Oh and the butternut squash was exquisite. Charred to perfection and sitting on a bed of delish hummus.\n\nThere was nothing other that pure delight with every bite. The food was presented and prepared to perfection. And we are some pretty well traveled and well fed folks.\n\nThe setting intimate. I was sorry the garden was closed for the season and I have enjoyed that ambiance as well.\n\nThis was Halloween night and the servers were appropriately attired so it was laid back festive, with a warm and inviting ambiance.\n\nI also loved that dirty dishes do not sit. Clearance was exactly right. Not grabbing plates prematurely - but just right.\n\nI think it may be one of my favorite places throughout the US.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "This is a wonderful restaurant. It's pricey but worth it. We ordered the Chicken Liver Mousse as an appetizer and Steak as our main dish. We were super impressed with the taste and thought that it was the perfect amount of food. Our meal followed with the Famous Chocolate Cake which too was to die for. Will be back!!", "author": "Rennie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Had pumpkin soup with lime marinated shrimp for an appetizer - the flavors were unexpectedly delightful together!  \n\nDinner was chicken in a skillet. Although nicely cooked, it lacked flavor by only having scallions roasted on the sides. Brussel sprouts were cooked perfectly though and had a delicious balsamic peanut glaze.", "author": "Karina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-07", "description": "Like so many other reviewers, my experience at Vinegar Hill House was that the food isn't good enough to make up for the horrible service. You can get much better food and much better service lots of other places - there's no need to be treated like an inconvenience at this one.", "author": "Caroline B."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}