{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Cast iron chicken is simple but great and so is the guineas choc cake with cream frosting is perfection. The maitre de was lovely but our waitress definitely wished she was somewhere else", "author": "NYC D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "I've been there twice for brunch, n it's extremely yummy. The mood is lax n meant for that type of loitering people always seem to do in Brooklyn. Don't go here if ur starving: you'll b waiting for a table, and they will seat u slowly, and eventually they will serve u slowly. But they won't rush u either.\n\n I look fwd to eventually returning for a festive dinner meal there since the dinner menu looks amazing n my friends who have gone there have raved about the experience.", "author": "Karen V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-17", "description": "Don't get me wrong, I understand how miserable it is to work in food service, but this was outrageous - and I try to be an easygoing customer! I can't remember the last time that I've gone to a restaurant and felt so uncomfortable because of the staff.\n\nWhen our party (of two) arrived at the restaurant, the house was bumpin' - shit was LOUD. Fine. We were looking for a good time! The host told us that it would be a 30-45 minute, but we could sit at the bar in the mean time. Okay. Whatever! \n\nWe stood awkwardly behind some people sitting at the bar, and already I felt uneasy - in the way and out of place. After a few minutes we were able to sit at the bar and very quickly I knew my instincts were right. The bartender seemed unable to restrain snarky comments every time another employee came near him. He even made several remarks insulting some poor patrons' drink selections (again - I get that working as a server sucks, but can't they be saccharine and accommodating until they're out of earshot of customers? It'll make things more pleasant for everyone!). It's kind of a buzz kill to have to listen to the waitstaff making fun of guests while trying to enjoy the restaurant experience.\n\nAnyway, that wasn't the worst part. We sat down and our waiter informed us of the day's specials. The English pea ravioli sounded pretty good, so we asked him how much it cost. He went on theatrically about how it was $13 and he couldn't believe how cheap it was, and it was such a good deal and blah blah blah. So we both got the ravioli, stupidly assuming it was an entree.\n\nNo. Our food arrived in what we at first thought were giant, white, empty bowls. Upon closer inspection we saw that each serving consisted of about 5 medium-small raviolis. To be fair - they were very tasty! But I'm not sure they were $13 worth of tastiness. Oh, how stupid we were!\n\nOur waiter seemed to ignore us in a weird, passive-aggressive way after we said we weren't interested in dessert. Even though he kept coming to talk to the table beside us, he seemed to purposely walk away without even looking at us. Finally when he came by with the check, we were dumbfounded. After the whole spiel about the amazingly cheap $13 raviolis, HE CHARGED US $15 FOR EACH.\n\nNot wanting to squabble over $4 and wanting to GTFO, we just paid and made a bee line for the exit. I left the restaurant feeling humiliated and generally uncomfortable. If that was the vibe I was seeking from my dining experience, I would have gone to Chuck E. Cheese alone - it would be cheaper and I'd at least get my money's worth.", "author": "Molly R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-19", "description": "I just don't get it folks. The service was terrible. The food was not good. And it was not cheap.\n\nI took my husband here for a special occasion. He likes simple food, well prepared, so I thought this would be a good fit. We were also trying to make a movie at BAM, so hoped to be able to get through dinner in about an hour and a half. Ha! \n\nWhen we arrived the restaurant was not busy and we were seated immediately. The server was nice, but everything took FOREVER. We don't drink, so I always feel a little bad for our server who can't work up a big bill, but they could have gotten us out of there fast and turned the table if they had a clue, which apparently they do not. We were there for an hour before I'd even gotten through my salad. Then we sat staring at our empty table waiting and waiting for our food to arrive. At each step it took them ages just to clear our dishes and get on with it.\n\nMy husband is not a big fan of strongly flavored cheese and creamy dairy products. This is not generally a hinderance to having a nice meal. So it was rather annoying to discover that almost every single dish contained some kind of strongly flavored cheese (blue, parm, fontina). Even the freaking mashed potatoes, which are usually safe, contained feta. But hey, if you're crazy about cheese, this is  a selling point. It's just that there are few cheese and dairy-free options.\n\nI also had the fennel salad with grapefruit, walnuts and maytag. I love all of these ingredients, but the combo was lackluster. The big clumps of fennel were really unappealing. My husband and I both ordered the chicken two ways, which was godawful salty, and came on a bed of bitter greens and freaking yogurt! Yogurt! I like yogurt, and I found it a very odd pairing. Icky. Even the chocolate tart was blah. How do you make blah chocolate?\n\nThe place filled up while we were there that the restaurant filled with standing, waiting people--and it got LOUD. The only thing that could have made this experience more disappointing is if I had had to wait for a table. Thank god we got there early.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-20", "description": "M decided that it would be a good idea to take us for dinner here after work... of course someone had no idea that she would have to walk in heels over cobbled stones for a whiles before getting here. \nBut I digress... M and I are both vegetarians which means that Vinegar Hill House should not even be on our radar for foods-to-eat. There is literally 3 things to eat for vegetarians. BUT the three things that we could eat... were fabulous. I am dreaming of the butternut squash sprinkled with toasted sunflower seeds on a daily basis. No, really I am. The four stars is only because there wasn't a lot of options but five stars for the amazing food they did have!", "author": "Sasha N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "Amazing...  They make the best damn dessert I've ever had.  Salted Caramel custard.  I'm speechless..............\n\nThe chicken two ways is awesome.  I prefer the roasted chicken, great seasoning, and J-U-I-C-Y!  Fried chicken was good, seasoning was great here too.\n\nTheir known for their Red Wattle chop and I understand why.  Tons of flavor, juicy, and  nice portion over sauerkraut.  BUT it doesn't hold a candle to the chicken.  I can't get over the Salted Caramel Custard, I'm serious I'd wait an hour just for this.", "author": "Byron W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "I've dined here before as I live in the neib- it's been great. Except this evening. We sat at the bar -- the bartender had such a bad vibe. Took way too long to serve simple drinks and had such a negative energy. If I want to deal with sour ppl- I'd go back to work. We left after a drink and dined elsewhere. We will never be back.", "author": "andrea c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "Oh, Vinegar Hill House.\n\nOh how you woo my heart with your thick but tender sourdough pancake, richly saturated with a sweet, sexy sauce and topped with beautifully bruleed bananas and fresh ricotta.  This is a love affair to remember.\n\nAnd then when I returned for your courting with the cast iron chicken...I will admit, it reminded me of a mini human body, but I was okay being a cannibal to dive into the ridiculously crispy skin, fragrant with rosemary.  The chicken was ever-so succulent, sitting atop a reduced vinegary sauce and accompanied by gorgeous roasted pearl onions.  Oh, you are too good to me.  Thanks for the giant knife that helped me make quick work of that lovely bird.\n\nThe restaurant is typical Brooklyn - worn woods, charming plants, rustic paint and just all kinds of comfortable cool.", "author": "Han C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-18", "description": "super charming and DUMBO is great. BUT, we were a party for 11 with a six pm reservation. it was 35 degrees out and drizzling. we arrived, ALL ELEVEN of us, at 545. they made us wait outside, in the rain until 6:05. really???\nstarters: liver, green salad, and brussel sprouts were excellent. main courses were SO - SO. brick chicken soggy. Pork, a \"restaurant standard\" inedible -- undercooked and super salty. it was sent back. our waiter was very charming and friendly, the rest of the staff that pretentious brooklyn attitude -- \"we are cooler than you.\" and if we felt it (all working in fashion), imagine what others feel.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-04", "description": "The atmosphere here is great, and it starts from down the street.  I drove over from Jersey City just as it was getting back...rolled down that narrow two way cobble stone street and found parking right outside.\n\nThe place was glowing inside and you could smell all the goodness as soon as you opened the car door.  We grabbed two seats right at the end of the bar and settled in for some work.\n\nTo start, a Kale Pesto pasta with a heavy citrus flavor. In a word AMAZING.\n\nWent with the Braised Short Rib as the main....they didn't even need to bring a knife for it.  The flavors were fantastic.\n\nWhen asked about the dessert menu, we said no no....just put in another order of pasta...the braised lamb ragu this time.  What a way to finish it off.\n\nThis is my new favorite restaurant.", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-07", "description": "Vinegar Hill House has it all: almost obnoxiously quaint decor, a cozy dining room, an open kitchen, and a menu so chock full of delicious-sounding dishes your heart twists trying to choose one over another.\n\nSo you order, and you sit there and stare at your bare wooden table.\n\nA tiny bowl of braised squid arrives doused in paprika, \"black truffle\" shavings on an unapproachable heap of frisee evaporate flavorlessly in your mouth. Poorly-prepared pasta sits limp at the bottom of a giant bowl, and after a brief period of noodle eye contact you look up and the dining room has transformed into a large operating room. \n\nA bright fluorescent blue-white light shines overhead, and ice-metal robots (wearing plaid) pivot towards your back pocket, expand their ice-metal fingers and remove your money.\n\nYou stand up and head for the door, the robots' eyeballs flash brighter and say \"thank you, good night,\" and as you step out in the street, the cold air hits you, and for the first time in a few hours, you feel warmth.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "A restaurant in the middle of a cute cobble stone residential street.  Pleasantly warm atmosphere and inviting, I can see myself coming back time and time again for a nice meal.   I l loved the stuffed squid and the country chops tender, juicy and satisfying.  Chicken cooked 2 ways was interesting a few pieces of fried chicken and some roasted pieces good but not mind blowingly good.  I read that they have chicken cooked in cast iron but did not see that on the menu? I'd like to try that next! \n\nA few things that I don't like is that  the menu is quite small so I can't come as often as I'd like.  Most importantly minus 1 star because the waiters seemed  disinterested and bored,  as a customer you go out to eat to have a good time away from home, it would be nice to know that the person serving in \"their home\"  wants you to enjoy your time with them.  I suggest smiling more because...well........ its free and you 'd probably get a better tip.  :)", "author": "Jan Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-27", "description": "Located on a delightful little street that I am a quasi-resident of, VHH is a cute little spot decorated with a mish-mash of vintagey stoop-saley stuff.  The barstools are precarious at best.  \n\nMy lemon mint bourbon drink was sublime, but only one can be imbibed on a school (so we moved onto the bottle of Gavi.  Note to my readers: I always get a bottle so I can't complain about stingy pours).  \n\nFarm/Fresh/Seasonal/Local is sooooo 00's.  I'm not knocking the meme, but you can't just serve some local shit on a plate and not \"do\" anything to it.  My chicken was fabulous (a butter/sherry sauce simply can't suck) but I didn't think is was special other than it was buttery sherry goodness.  The beets and avocado was just wierd--the 2 tastes don't go together (but separately are HEAVEN).\n\nSo it was good, but I was not impressed.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-02", "description": "Yes... I've heard great things. My friends all eat there. The food looked and smelled great.... but...\n\nMy friends and I tried to go last Saturday evening around 7ish. We were told there was about 45 minute to an hour wait for a table of 3. Since it was a freakishly warm NY winter day and the back garden was open (outside with no heat lamps) for waiting, we clawed our way to the bar for a bottle of wine and a few glasses, found a bench outside and caught up. An hour goes by, nothing. \n\nWe finished off the bottle started freezing and came inside. Waited and waited and waited. When you wait for over an hour, you start to figure that you must be next. NOPE. Not here. \n\nAfter OVER 2 1/2 hours I convinced my crew to get the heck out of there and go somewhere that they at least have a clue how to run. Be frank with people when they come in. It's better to tell someone it could be 2 hours than to have them walk out pissed at close to 3.", "author": "Tammy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "Went there for brunch this past Sunday. Food and menu was good, but the service was just not good at all. This isn't the first time I've been here that the service wasn't great, but this was at the end of brunch so not busy and the place is small so no excuse. The waiter (a male) was just non existent. Every time I needed something I'd have to find him. Oh and if the menu calls for bottomless cups of coffee, shouldn't they come by to ask for a refill? Of course I had to ask for it. He never came by to ask how are things or if I need anything else. I\"m just sick of getting shady service, maybe I'm spoiled, but I shouldn't have to remind him on my drink order when the place is empty. Once he would bring it, he would just disappear into the back so not sure what his deal was, just not very good at all. To look around to hope make eye contact with a waiter to get their attention is annoying. I try to like this place, but the overall feel and experience of the place is just plain blah. If there is a next time, I'll sit at the bar.", "author": "Paul P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-23", "description": "I've been only once for brunch with a friend. I tried the sourdough blueberry pancake, which was kinda awful-- the flavors just didn't work very well for me, and it was even kinda burnt... eeeek. The maple glazed bacon was good, but not good enough to have saved this place (especially since bacon is delicious 99.9% of the time anyway).\n\nHowever, the interior is soooooo incredibly adorable and charming. They did a great job with the rustic decor, so much so that I kinda sorta want to actually live there. So no, I probably won't be back for those pancakes; but, I might be back for a cocktail, just to soak up the cute woodsy space.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-19", "description": "Bad Management Alert:\n\nTaking a friend out to dinner I called and asked if they were open - yes, I was told; \"We're open, feel free to come by\". Taking this warmth to heart, on a Monday night the week before Christmas, we went \n\n- only to be told there was a two hour wait. \n\nFlunk.\n\nWhen you operate far from anyone or anything you accept a special responsibility to care for the customer that is different and unusual - this includes informing a call-in that if they indeed intend to arrive at your doorstep that there is a two hour wait.\n\nBeing new isn't an excuse - being young isn't an excuse. If we the customer can't trust the venue to answer the phone with care and integrity then the 'idea' of the restaurant hollows out and the venue can be seen as opportunistic.", "author": "robert e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "It's funny, I had heard from my colleague about this place and a few days later, my lady friend requested I meet her there for Sunday brunch. So I did.  Now I don't know how other people get there, but if you're not taking the F to York, it's a hike!  Bottom line, if you have wheels, use them (it took me 15/20 to walk from the G stop).\n\nOk, so now that the commute is out of the way, let's get to business. Oh, were they were right.  The food is spot on.  We started by splitting the fried oysters.  The perfect balance of crispy, gooey, melty.  It was like joy blew up in my mouth. Boys, don't go off makin' that dirty, this was a beautiful experience.  We both were itchin' for some eggy goodness, so we both ordered the asparagus omelet.  I never expect too much from such a staple, and I'm glad. Low expectations means they were able to over deliver.  I don't know of they mixed the brie in the eggs before it hit the pan, but they were fluffy and cheesy all at the same time.  Service: super, ambiance: adorable, and price: perfect. \n\nVinegar Hill House, move closer to me and give me a bigger coffee cup (those small ones are cute, but it's like a shot glass) and you'll be sittin' pretty with 5 stars.", "author": "Marie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "This place wasn't what it was hyped up to be.\n\nI found the service (hostess, server) to be a bit unconcerned with my experience. I was fine with the wait, it was the no making eye contact no keeping me updated when we were the last ones waiting and there were empty tables. Our server was not quite helpful in answering our questions, and lacked that special something that puts you at ease...\n\nThe 1$ pickle is awesome. Not insanely awesome like I was expecting, but I would have paid $2 ;)\n\nWe began with the Octopus appetizer which was so full of flavor and fillings- this was my favorite.\n\nWe also got the radish garden salad, really citrus- a great light beginner.\n\nThe Entrees were a bit disappointing? Creative, but well, I did clean the plate : )\n\nMy friend's Pea Ravioli made me want to trade her- the portion is small, but the flavoring is so Large !\n\nMy Lamb Shoulder with a yogurt sauce was shredded and moist, I only wish their had been more sauce...\n\nDessert was a Cheese Platter and their Blueberry Custard- Both were wonderful.\n\nAs far as needing to try this place, I could see that- but I wouldn't go out of my way (like I did this time) to return.", "author": "Raven M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "Went here with two former-New-Yorker, now-out-of-towner friends for Saturday brunch today. It was kind of tricky to get to, as is everything in the always wonderful but enigmatic DUMBO district. \n\nThe restaurant was really rustic and cute, with old timey wooden tables and chairs and tucked away on a cozy corner of Hudson in Brooklyn Heights. The food was really good, though I'm not sure it wowed me enough for the money. I had the shrimp with cheese grits special. It came with an over-easy egg layered underneath the shrimp, which was a magical surprise. \n\nI will say, I purposely ordered the shrimp dish because I knew it would feel like it was worth $14. As far as portion size goes for the other entrees, though, I'm not sure I would have been able to justify it. (And to those of you who are scoffing at a mere $14 for Saturday brunch in New York, remember, I'm a grad student... that could pay for at least three beers at the diviest dive I know.)", "author": "Nicole G."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}