{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "Saturday morning and i'm driving in my Zippy car headed towards the Brooklyn bridge through Dumbo... \nstomach grumbles. look over at passenger.\n\"are you hungry?\"\n\"yeah\"\n\"wanna eat in BK or Manhattan?\"\n\"wherever... where in BK\"\n\"hmm i dono, Vinegar Hill?\"\n\"there's usually a long line... wait, it's early! yeah let's do it!\"\n\"mmk\"\nmake a turn here, go down there... parking right in front! wonderful.\nwalked in and followed waitress to the garden. \nquaint, hidden, rumble in my tummy...\n\nBoy was I glad we did that! We shared the pancakes. Light and fluffy! perfect with the caramelized banana and syrup. mmmm!\nI had the breakfast sandwhich special- egg and ham with chipotle aioli on homemade biscuit and a side of salad. mmMmMmMm!\nBrunch is such a treat, and this particular Saturday it was a very special treat indeed!", "author": "Dee D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-27", "description": "We came here from brunch and the food was terrific, worth the taxi ride to get there.  We had the shrimp with grits and pouched egg, tacos, sourdough pancakes with pears and the fish filet, all were equally great.  The service was very attentive and the meals are reasonably priced.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-14", "description": "Um, where do I start?\n\nThe night starts off by me calling to ask if we could get a cab back to Manhattan if we come. The women at the other end said \"sure, we do it all the time. We can have one here in 5 minutes.\" I thought, great, so we go.\n\nWe walk in... the lights are up pretty bright. I'm in a good mood and I ignore my instinct to ask them to turn them down. Maybe there is some strange reason for them being up. We sit down and we order 2 cocktails. I ordered mine \"up\", (even made the \"up\" gesture with my thumb) which means served in a martini style glass. I don't think the very sweet bartender knew what that meant so I got mine in a collins glass with ice. Fine. I noticed the beers were really boring.. like Anchor Steam. I haven't even seen Anchor Steam in a cool restaurant in like 15 years! Perhaps they have never heard of Delirium Tremens, Duvel, Stone, etc. OK, so we order 2 more drinks. One, a glass of wine was served in a glass just slightly bigger than a shot glass. I am not kidding. You have to see this glass to believe it. My glass of Rye was an extremely short pour. too. I'm still in a great mood and I go with it.\n\nWe sit. Our waitress comes up. She had bleached hair or highlights or something. My partner has an allergy we told her about. Seemed like she had a problem with it but she researched and told him what he could order, which was 3 things from the menu. Fine. I noticed the skillet chicken arrive at the next table, looking rather boiled and translucent. I ask if mine could be crispy. She said yes so I ordered this. We also ordered the brussels sprouts with peanuts and mint. The salads arrived. They were very small but ok. All the while, the waitress never smiles and it seems like she never has. The pork arrived. It was small but my partner liked it. My chicken arrived and it looked as it did at the table next to us. Rather than be crispy and yummy and skillet-ed, it was boiled tasting and underseasoned. The mint on the brussels was overpowering and wrong. I mean, you can use mint on brussels, but, really, should you? Flavors were just off-putting. I kind of got the feeling either the chef wasn't there this night or maybe got the feeling the chef just learned how to cook at another restaurant rather than being properly trained. Just a feeling.\n\nRather than order dessert, we just kind of wanted out of there. We asked the waitress if she could call us a cab and she said we should call one ourselves because it is raining and it would be hard for her to reach one. At that moment, the next table asked the host if he could call them a cab and he said \"sure\", I asked if he could get 2. No problem. We never saw our waitress again.\n\nBright lights, small portions, off flavors, bitchy waitress. What's there to like? I couldn't help thinking the people who were there were victims of some sort, convincing themselves that it was good or cool or whatever. I wonder if they honestly really like it.", "author": "Ari R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "This restaurant has been on our \"must try\" list for years and we finally go to go last night. All I can say is that I'm disappointed we waited so long.. This was start to finish one of the top meals I have ever had. Ever. Chicken liver mousse, all day long. Beef brisket was super tender and flavorful. I don't even typically like beets and the beets side was super delicious. The pasta tagatelle was fresh and wonderful. Dreaming of when we'll return..", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-03", "description": "I must admit I was a bit disappointed:\n-lackluster service\n-wanted us to sit by the entrance on a FREEZING night\n-small portions (both on the dinner servings and the wine pours)\n\n I could go on and on, but I'll just leave it at this -- we were still hungry after leaving that we drove to Grimaldi's and chowed on Pizza to satiate the hunger.", "author": "Edward F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "I went here awhile back.  It was incredibly crowded and small we waited a bit.  But it was worth the wait.  I dont remember too much because we had such a great time, but I did really like the food.  The pork chop was ginormous and very good.  It gets very packed for brunch as well, come early.", "author": "I'olana u."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "BRUNCH\nI always get the eggs and tomato. And I've tasted 90% of the menu off of other people's plate, and still go back to the eggs and tomato. After u eat that, share the pancakes...even if you don't like pancakes. And bacon. I don't eat bacon much but I will eat this one.", "author": "Elaine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "We went here last weekend and it was mostly great! It definitely has that Freemans vibe but less hipster and more neighborhood. It's homey and quirky inside, kind of like being in someones charming little house in old England. \n\nThe wait was about 45 minutes on a Saturday night which was fine however it was quite early (around 6:45) and it started getting packed around 7pm. There was some room at the bar so we were able to have a cocktail while waiting (so no complaints there!).\n\nThe Food\nThe pork chop with cheese grits was totally delicious, although the middle was severely undercooked - the grits were fantastic and totally decadent. I had heard about the pork chop from a show on Foodnetwork ( Frank Bruni raved about it)  so we were really looking forward to this. It was unfortunate that it wasn't properly cooked. Because we were with 2 other people we decided to let it slide since everyone else's meals were spot on. I ordered the chicken (served in a quaint iron cast dish) and it was perfectly crispy on the outside and moist inside. Simple, homey and perfect.\n\nThe ravioli with oxtail was amazing. Small portion (it was an app) but just enough to want more - I would suggest getting a larger portion as a main.\n\nThe apple and cheddar salad was wonderful, balanced, crispy, light and fresh. Just what a starter salad should be.\n\nThe total winner was the baked squash - I know, I know - squash? It sounds plain and boring. And when it arrived at the table it looked like a halved butternut squash simply baked in the oven. But no, once I took a scoop it was so flavorful I couldn't believe it. The squash is pureed with butter, cream, cayenne and maple syrup, then distributed back into the squash shell and broiled for a few minutes to get a nice brown coat on the top. Order this.\n\nOverall, this place is a winner. We need to go back and try the pork chop again since it was our fault for not mentioning the undercooked-ness. I would suggest getting there on the early side and grabbing a drink and waiting it out - good things are always worth waiting for!", "author": "Vanessa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-17", "description": "I think the brunch here is ok.  This is my girl's favorite place, but I think it is more because of the ambiance than the food.  I like to rate food, because, that's what restaurants are for.  \n\nWe ordered quite the meals, pancake, the scramble and the breakfast sandwich.  They were all ok.  I wouldn't say the dishes are large by any means, but, maybe that's good for your waistline.  We even ordered dessert, some coffee mousse thing, which was good.\n\nI can say I'll be back, but that's because my girlfriend loves this place.  If it were up to me though...I'd go somewhere closer.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "\"Meeting of the Parents\"\n\nIf you like deliciously amazing, you will like Vinegar Hill House. Chicken liver mousse with pistachio chunks on amber toast with micro-greens and onions. Succulent Waddle pork chop with home made sauerkraut. Oxtail and octopus cooked in a spicy coating of juicy sauce strewn all over a bowl of pasta al ceppo. Cheesy riszzzzotto. 2 sinfull bottles of Nero D'Avola. Refeshing greek yogurt with dill bathing with shaved fennel. Young brussel sprouts sprouting complex notes of syrup and aged vinegar goodness. GUINNESS CAKE!?!... simply the best. \n\nNeedless to say... this was the perfect meal to take her parents to meet my mother for the first time.... the first of many great meals together. \n\nGo there and enjoy.", "author": "Barnett Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-20", "description": "I just moved to DUMBO last weekend, and Vinegar Hill House was the first place I went to for dinner in my new neighborhood, and let me tell you, I was more than pleasantly surprised.  \n\nThey do not take reservations on the weekends, and the hostess told me that there would be a 45 minute wait, during which I got a drink at the bar and headed to the very charming little patio in the back.  In actuality we only waited about 20 to 30 minutes.  \n\nEverything on the menu looked amazing, we ordered the Chicken Liver Mousse and Charred Port Belly as appetizers.  Both were absolutely amazing, I am a big fan of chicken liver and this mousse was just perfectly complemented with pistachios and vinegar onions.  But the charred pork belly was TO DIE FOR!!  I think that this is an item that you must order there, it was charred, smokey, salty perfection.  For an entree we split the Twice Cooked Veal breast, which tasted very similar to the pork belly, we were tempted to ask if they brought us the right entree, but decided against it since it was so amazing.\n\nPerfect ambiance and great service, I cant wait to come pack for the pork belly and try other items on the menu.", "author": "Helen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-18", "description": "Ok I'm starting my review from the moment i opened the door; the ambiance is very Americana,warm and romantic.\nHad to wait more than one hour to get a table, the portions were very small and kinda overpriced,food was good but nothing special, I had tagliatelle and Guinness cake.\nBut hey, people(including me) are waiting more than 90mins to get a seat, actually the owner can put the prices up any moment now!", "author": "jessy j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-16", "description": "1. The food is incredible.  \n2. You will have to wait, and the lone bartender will take forever shaking fashionable drinks, so you'll get to wait for a drink and a table.  And the bar will be full, so you'll be second row, dodging waiters.  The room feels small, it's really loud, the crowd generally should all be shot, and the tables for two are cramped.  But the food is so good you'll probably go back.", "author": "Alfons H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "My favorite in Vinegar Hill. Charming. Home-cooking done right. Red Wattle Country Chop is mouth-watering good!!!", "author": "Rob F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "This was my second time eating here, although this time was for brunch. My b/f was introducing me to one of his good friends from work, so we wanted to go to a place where we could linger and have cocktails. Our original plan was to go to Jack The Horse, but we didn't realize that they only do Sunday brunch, not weekend brunch. Anyways...\n\nWe got there around 1:30 and it was about 1/2 full, which is in stark contrast to dinner when you often have to wait. Made for a nice and leisurely meal. I had the sourdough pancake with ricotta and maple pecan glaze and a side of bacon. It was *really* good, much better than the version that I had tried at Bubby's a few months ago. \n\nMy b/f got the crab omelette and his friend got the baked eggs dish. We also split a couple orders of sausage links, curious if they would be as good as the patties at Jack The Horse. They were really tasty, but they were different instead of being better.\n\nAs far as drinks, they have an excellent bar and know how to make proper cocktails. My b/f and I both had several rounds of Dark and Stormy. And their use of fresh lime juice was quite evident in the drink. \n\nI would go back here, but probably only for dinner, I still prefer JTH for the yummy brunch foods.", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "We looked for a place within walking distance for a casual Monday night dinner for two, and the restaurant's ambience upped it up a notch to a casual but romantic outing. You'd never guess that the house-turned-business along an otherwise quiet and understated street would give way to such a cozy dining experience. While we were seated inside for dinner, we had a chance to wait in their outdoor courtyard area (15 minutes), which is absolutely lovely--think vines intertwined with lights hanging overhead, and wooden, candle-lit tables set up on the cobbled courtyard (only minus is that you're susceptible to become dinner for insects if you go on a sweltering summer night like this one).\n\nWhat we ordered: lamb bolognese (starter pasta), cast iron chicken (entree 1), pork chop with cheesy grits (entree 2), roasted beets and hazelnuts on avocado puree (shared side). The food exceeded our expectations, although it also meant slightly exceeding our budget. Though the bolognese isn't really a starter, we really wanted to give it a try, and the portion was just right to split between 2 as an app. The cast iron chicken comes in a delicious, generous gravy, so be sure to ask for bread to sop it up. The pork was marinated perfectly, and the cheesy grits were the best I've had. Before heading out, I was hesitant about the service after reading other yelp reviews, but we had no such complaints tonight. Our server was attentive, courteous, and thankfully expedient when it came to ordering and delivering our food. \n\nWe were too full for dessert, and one of us is to pregnant to drink, so I can't rate them on either of those counts. However, I did glance longingly at the wine list for a moment, which was pretty extensive, especially when compared to their restrained but excellently executed dinner menu. They also have a full bar, it seems. \n\nWould love to go back to try their Sunday brunch and eat outdoors. Definitely recommend for dinner.", "author": "Louren enid C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "If you want some very well executed seasonal dishes in a rustic, hipster-but-not-too-hipster, comfortable atmosphere, and if the thought of being someplace that doesn't feel like anyplace else in the city appeals to you, then this is your place.\n\nCast iron chicken you've read about is terrific - the sauce is so flavorful and bright.  Pan roasted fluke is moist and meaty.  Chicken liver mousse is a must-order for me, though I long for more than three pieces of the crunchy toasted bread.  Solid wine list, a handful of very good cocktails, a nice little outdoor space, and not nearly as far away as you might think - first stop in BK and maybe a 6 minute walk from the train.\n\nGo.", "author": "Victor C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-01", "description": "Yum! Went here with a group of 8 for Saturday brunch. I think we pretty much had everything off the menu, I'll try to remember for ya'll --\n\"friend\" toast\nsausage, bacon\npancakes\ncrab omelette \ntomato and toast\nquiche\nsome sort of pasta (I don't remember) \nbreakfast sandwich\n\nAnyways, everything was really delicious! We came with some out of towners and they were really impressed by the place. There wasn't a complaint out of anyone, just compliments all around! I highly recommend.\np.s. It is very hipster.", "author": "Teresa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "My boyfriend and i went there last night for his birthday.  Be warned, they do no take reservations and I knew that, even though we were on time limit we still went.  I believe we got there around 8:15 and did not get sat for an hour. \n\nWe did have the opportunity to enjoy drinks in their backyard which was nice!  The decor was interesting, a little rustic, loved the white ceiling.  We did have to eat our meal in a hurry, I ordered the Fluke, which was fantastic!  Cooked perfectly, flaked easily.  My bf had the Pork Chop, it's super fatty, but had fantastic flavor.  We had the eggplant and side of beans.  I  loved the beans,\nOur server was fantastic!  \n\nIt's a great  restaurant and I would love to go there again when not in a rush.  Ambiance is pleasant, I'll be back!", "author": "Martine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "This is one of my favorite restaurants in NYC.  I have been here for brunch and dinner and the food never disappoints.  The menu changes seasonally and it's always fun to eat at the bar and watch the chefs in action. The ambiance and decor are equally great.  This is such a neighborhood gem.", "author": "Jade Z."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}