{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "This place is known for its sourdough pancakes and yes they do live up to the hype. The pancake is thick with a slightly gooey center, which I'm a big fan of, but the best part is that it's completely soaked in maple syrup. And if you think that's not decadent enough, they also add two knobs of chilled butter at the top which slowly melts as you eat the pancake. \n\nService was friendly and attentive. Decor is rustic barnyard chic (so hot right now). They have a decent drinks selection at brunch, including a delicious aperol spritz.", "author": "Honghui Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "This funky historic house in the Vinegar Hill  eborgood offers old time charm, eclectic and interesting decor, and amazing food. Unique offerings arrive with perfect portion sizes and deliciousness! Got the pear pancake, the jalapeño cheddar grits, and the goat cheese beet omelette. All were hot and perfectly cooked and Delicious! We split all three and were perfectly satisfied! \n   The small sour dough pancake is about 6\" in diameter and delicious! Probably could have managed the large pancake, but that might have been a little too much! The coffee was good, the servers nice and knowledgeable, and the service great. It was a mellow Saturday morning, and while they were nearly filled to capacity, it didn't feel at all rushed. \n     Good background music, clean silverware and linen napkins. Go there!", "author": "Brang C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-01", "description": "Brunch review: A pioneer in a very remote \u0026 interesting  area next to Dumbo. The restaurant is charming and I've been here twice for brunch with different experiences. Their brunch menu is very very limited and first time was less than impressed. This trip was long overdue and enjoyed their food at 55 Water St especially the roast chicken.\nAte:\nShrimp and grits\n\"the pancake\"\nGreens\nThe shrimp and grits are tiny sized yet tasty. No bread or greens unless you pay $13 for some salad greens so value- eh. Now on to the PANCAKE - a superstar made from a sourdough starter and cooked in a cast iron skillet. It arrives bubbling with butter and syrup and baked with tart apples. I got the small size which is perfect for one or two.This is pancake pleasure at its finest and a top pancake, which redeems alot of misses.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "Delicious food! \nI ordered the asparagus, beets and Brussels sprouts for the table and had the Pan roasted chicken as my main entree. Everything was perfectly seasoned and very flavorful. The chicken was tender and moist with a wonderful thin crispy skin. The caramelized onions and sprig of thyme were the perfect touch..Served right in the pan! I tried the homemade sodas and they were absolutely refreshing! For dessert I had a cup of coffee and the olive oil cake which was the perfect finish to a well rounded meal. Good service,Fresh food and a cozy ambience. Parking was very easy to find so it's def worth giving this place a try if you're in the Dumbo area of Brooklyn!", "author": "Esther S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "This place is so yummy, the food the drinks and the atmosphere are all perfect. Such a fun neighborhood with cobblestone streets", "author": "Linda N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-12", "description": "A hidden gem that chefs up a pretty solid brunch. No clue this place existed as I don't really frequent that block and didn't know there were any restaurants there. Yelp! to the rescue when I was looking for a brunch spot. This place is a bit eclectic ... it's a house with sitting on the main floor, basement and out back. Really chill vibe and thus draws a brunch crowd. I would definitely suggest give it a shot. The burger was legit and the service was friendly.", "author": "Barney C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Came here for a drink with friends on a Friday around 5pm. Was able to get a seat at the bar but I think it was because it had only recently opened (it got busy fast). I had a delicious craft IPA that I cannot remember the name of and the polenta corn bread with honey butter. This is not your average cornbread! Delicious and savory, almost like a pastry. \n\nThe real draw of this place is the location and historic charm of the interior. The location is in a somewhat desolate area in the tiny neighborhood of Vinegar Hall on a quiet, pretty block. Finding it, you feel like you are in on a well kept secret. I couldn't help but imagine myself a worn and weary soldier of the Revolution stumbling upon this place...  the warm glow of the Vinegar Hill House feels like a beacon of light, especially on a cold night. Inside, make sure to check out the backyard, and basement tables- I was quite surprised to find extra seating down there! Bathrooms are on both floors.", "author": "Aly M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-06", "description": "I went for breakfast and sat at the counter. I don't know why the couple with their baby sitting next to me were at the counter and not occupying one of the open tables, but they were palpably upset because they had been waiting over 45 minutes for their food. The bartender serving the counter seemed agitated over their situation. He definitely was distracted. But, you know, he remembered to smile when it was time to pay.\nMy pancake arrived quickly, but was cold. The coffee was also not so fresh.", "author": "Kana K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-16", "description": "Good vibes and service, but as a vegetarian the only option for entree was an overpriced and under seasoned pasta dish, with watery sauce and some arugula mixed in it. Other people who ordered protein however seemed to enjoy the food. Please come up with a better vegetarian option or don't charge $25 for a tasteless bowl of pasta.", "author": "Zoey J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "4 stars for great food: squid ink pasta, kale panzanella salad and the beet dish were all very delicious, fresh and light!\n\n5 stars for superb atmosphere. The backyard is so lovely, shady, and enjoyable. Absolutely worth the trip to Vinegar Hill to score a table in this yard.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "I came here for dinner tonight with a couple of friends hoping to enjoy a \"farm-to-table\" type experience. Upon our arrival, we were asked to wait 10 minutes to be seated at a table that had already been open, set, AND reserved for us. Once we were finally seated, our waitress poured us a half-empty glass of water and proceeded to tell us which items on the menu were no longer available this evening, which just so happened to be all of the ones my friends and I were interested in trying. The waitress took off and didn't return for another 30 minutes to take our order from the remaining half of the menu. Of course, by the time she had arrived, yet another one of my selections was no longer available. I wonder why...\n\nAlas, I was left to order the  \"cheeseboard,\" Field Greens Salad, and cornbread for the table to share, and the Market Fish as an entree. The food was brought to the table another 30 minutes later, exactly at the point when all of us were starving. The \"cheeseboard\" was nothing to write home about and the cornbread was halfway decent--a bit too bitter for my taste. However, three bites into the field greens salad was when I realized that the main ingredient (the ham) was nowhere to be found. I brought this to the waitress' attention who then called the manager over and apologized to us for the waitress' inability to communicate that they had yet again run out of another item on the menu. At this point, I was left to wonder--how does one have enough salad, but not enough ham? Hmmm?\n\nOur entrees arrived 15-20 minutes after our appetizers. At last, we've made good time! I took a few bites of my fish which came with a calamari ragout and my mouth was parched from how salty it was. It tasted as though the fish was captured in the Dead Sea and then broiled in the tears of a chef who had just failed out of culinary school. \n\nFinally, the bill came and the manager was courteous enough not to include the half-assed salad we had ordered as our starter. Overall, this may have been one of the worst dining experiences of the hundreds I've had in New York. I came for \"farm to table\" and instead, I got a bull in a china shop.", "author": "Eva Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-21", "description": "Quaint, Cute, Rustic in what I imagine is an up-and-coming-redevelopment-area.\n\nWe arrived about 15 minutes before the door opened so we decided to take a stroll around the neighborhood. It was quiet with a feel of \"please come and take me over and make be beautiful\" vibe to it.  I don't know... it's just a feeling.\n\nAnyways... when we walked back to the restaurant right when they opened, there were 6 other people standing in line out front.  Darn... guess we should have just waited, we would have been the first ones in.  Ha!  \n\nWe were seated immediately upon walking in, so no worries. The building was a home, so that when you walk in ... what I imagine was the parlor is now home to several 2-tops and 4-tops that can be arranged depending on your party size.  We opted for the garden seating out back since the weather was so nice. The tables and chairs are what you might find in... surprise, surprise... a garden.  The ground is a little uneven.. cuz you are in a back yard setting ... so the table and chairs may wobble a bit.  Use your core and stabilize your chair. It's not that hard.\n\nService was cordial, but a couple times we had to flag someone down to get more water.  \n\nThe food was ok.... my BIL and I had the eggs benedict which were a little lackluster in presentation IMO.  No small slices of fruit or a couple little berries or greenery to jazz up the plate... just the eggs benedict.  I should have taken a picture but I was super hungry and just dug in as soon as it arrived.  The eggs and prosciutto were fantastic tho!  It was served on an English muffin so ... not anything out of the ordinary. Hubby had the shrimp and grits which I got a small bite of and it was super creamy.  The BIL's GF had a green salad and a side of bacon.   The salad was nothing special but the bacon was tasty since she shared a piece with me. Portions were average.  So, if you are starving and are thinking that Brunch here is going to be your only meal of the day... I'd say order a couple dishes.  On the flip side, they don't give you huge portions so that you overstuff yourselves to a glutinous mass. Which in reality, we really should be more mindful of our portion sizes.  Anyways... \n\nThis place is cute and a great place to come that is OUT of the hustle and bustle of the city, so if you are looking for a place that is quiet... this is the place.  If you are looking to get your BRUNCH ON with hearty portions and a lively atmosphere, you may want to try somewhere else.", "author": "Alia G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-28", "description": "Back when my wife and I could still pretend that we were cool, we lived in Downtown Brooklyn in an area near Vinegar Hill, and could walk to this restaurant from our apartment. We did so once for brunch and again for dinner. \n\nThe short review is that my wife thinks the place is great and cozy. I think the place charges too much given the size of its portions, and the quality (while perfectly good) is not sufficient to make up the difference. \n\nWhen we visited for brunch, my wife ordered some kind of fruit pancake and I ordered sausages and an omelette. When the food arrived, however, it felt like it was one portion too small. I encourage you to look at the pictures other folks have provided. The little kitschy dishes and plates featured in the pictures are actually not as large as you think they are; they simply photograph well and the real size is apparent when you compare the pictures to something that can't be easily miniaturized, like a fork or a bag of potato chips.  The same thing happened when we visited for dinner.  All of this could be forgiven if the taste of both meals was something particularly unique or amazing, but I think you can get equally good food at a number of other places (without having to walk to Vinegar Hill). \n\nThe really distinguishing feature of the restaurant is its atmosphere. It feels tucked away (because it is), and happening upon Vinegar Hill (the neighborhood) while wandering around Brooklyn feels like you traipsed through the looking glass into something special and untouched. This restaurant distills that feeling into a meal by presenting you with food while nestling you in rustic scenery in a small space in the middle of that neighborhood.\n\nPut simply, I think this is a place where you bring a date or an acquaintance (assuming your partner is willing to make the trek).  It is not a place to go eat. \n\nBut, again, I was not a cool person back then. And I am not one now. I just wanted food.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Vinegar Hill House was named as having some of the best pancakes in NYC by Eater NYC, although only ranking 10 out of the top 15. Their sourdough starter is allegedly 60 years old. I'm on a bit of a quest to find the best pancakes in NYC and found these rather disappointing. The sourdough had a nice tang to offset the sweetness of the maple syrup and there was a very healthy dollop of butter on top for good measure, but presentation was decidedly lacking and the pancake was immediately made soggy by the syrup bath. It seemed like pretty average diner pancake fare.\n\nAside from the disappointing pancakes, the place had a nice vibe to it, reminiscent of something out of the historic part of Boston. It's got a certain rustic charm. There's no signage visible from the street so it's easy to miss, my taxi driver actually couldn't find it at first, and perhaps that's why I really hadn't needed to make that reservation. Either that or 11am on a Saturday is before the brunch rush, although that's certainly not been my experience at other places in my pancake quest.", "author": "William J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Made a reservation for dinner Monday night for a quiet meal in a new area. Restaurant is tucked away in what looks like a normal home, including a quaint outdoor area optimal for summer nights.\n\nAfter spraying ourselves down with insect repellent (free of charge), ordered the Roasted Shishito Peppers ($12) and a couple glasses of red ($12 each) to start. Peppers are marinated and covered in a tangy spice; easy to eat and more than enough to get the appetite going for two people. Wine is strong, as we tried not to finish the glass while waiting for the food (about 25 minutes). For the main course, decided on the Cast Iron Chicken ($29) - a large half chicken marinating in a supremely lemony broth and a few heirloom potatoes. The chicken is tender, with crispy skin to give a nice balance. I found the lemon taste to be a tad overwhelming halfway into the meal, but didn't want to mess the dish up with hot sauce.\n\nTo finish off, had some Alpage Sbrinz cheese ($7) and a coffee ($3.50). Cheese is very similar to parmesan, a fine pairing with the jam and select crackers. La Colombe coffee is always amazing.\n\nConsidering the amount of food ingested, the price wasn't as bad I thought it would be. Service takes its time, but came often to check on us and the food was definitely well-prepared (not thrown in an oven). Would like to sit indoors next time if not too crowded.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "This place is perfect for date night. The food was exceptional -- everything we had was on point. We ordered: charred octopus, roasted beets, market fish (Bronzino), and the squid ink tajarin. They have an outdoor space as well so perfect\nfor summer. Enjoy!!", "author": "Yuli M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-01", "description": "Was taken here fir dinner by friends. Cozy place nice people. Appetizers best part of menu. Try the chicken liver pate . Main courses rather ordinary. Prices were bit high $35 for a pork chop. And the one dish they were really stingy on was the pasta! Really small amount. The one dish that's the cheapest to make. Drinks were fine. Doubt if I'd go back not much intrigued to the menu...", "author": "Erelichada S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-29", "description": "This was arguably the least enjoyable dining experience I've ever had. I was getting dinner with my family and wanted a nice place for my party of 5. This quaint and cozy atmosphere in Brooklyn was nothing but a facade. We were seated at a nice table but the lights were so dim we could barely read the menu. The waitress approached us and was utterly bland and unhelpful. Her attitude was frankly rude in the spare moments she did decide to attend to our table. We were given no bread before the meal and the options for food were few. We waited forty five minutes for 30 dollar pasta and butter and chicken that was worth half the price at best. After finishing our meal the waitress brought the check without even asking how the food was. As we left, not one of the 5 employees we passed said goodbye or thanked us for choosing their restaurant. \n\nOne of the great things about hospitality is that you have the power to change someone's day for the better. It is sometimes as simple as the waiter giving a smile or the manager checking in on the table. This restaurant neglected every aspect of hospitality and left us all with a sour taste in our mouths. I would recommend practically any other restaurant.", "author": "Zach P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Brilliant execution.\n\nI've been for brunch, and had the pear sourdough pancake, omelette, and potatoes. The cook on everything was impressive, and flavors scrumptious. While not the most accessible location, this is somewhere I'd trek it to every once in a while to treat myself to a reliably great meal.", "author": "Krystal P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "Vinegar Hill house is in a pretty remote location unless you live in Dumbo. It's been on my list of places to try, but always fell off at decision making time for its small menu. What's crazy though is that in my recent travels on two separate occasions, someone has recommended that I go as soon as I mentioned I lived in Brooklyn- so back to the top of my list it went.\nI arrived at 10:45 on a Sunday (they open at 10:30) so there were still plenty of 2 tops available and no wait. I beat the person I was meeting, so I sat that the bar for a drink, and read through the NYTimes style section that they had sitting out to flip through. \nWhen we sat, the waiter suggested that the top ordered item was their pancake so we ordered that, eggs Benedict and a side of potatoes since the eggs came solo. The pancake was for sure delicious, smothered in a big scoop of butter with apples baked in. Eggs were yummy but nothing to rave about at their $17 price tag. We enjoyed our meal, but I wouldn't be running back unless I found myself in the area at brunch time.", "author": "Sam K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}