{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Bring a special date, make it a special night and get here on the early side.  Special care is taken to highlight some great seasonal flavors and the food is worth paying a little extra.  I will forever be dreaming of their CORNBREAD with honeybutter .... so good!  Cozy atmosphere, they know what their doing; home made classy menu and classy dining.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "Feels like a magical place inside. Super cute and charming, lots of wood, plants, candles.\n\nBrunch: they serve la colombe coffee, excellent\nblueberry sourdough pancake was out of this world\nwe also had their interpretation of huevos rancheros but it was way too rich for me. it was fried chips in a bath of cheese and salsa. each component was really good and it does sound really good, but the whole thing combined was a bit too rich and heavy for me that morning.\n\nWe've also been there for drinks and apps which were excellent. We had their baked potato and baked oysters -- both highly recommend. Will definitely be going back there for dinner.", "author": "Hyun L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-16", "description": "Went for Sunday brunch.  Food was phenomenal, but the service couldn't be any more indifferent.  3 Stars for food + 1 star for service yields a 2.5, rounded down due overall impressions.  Will update if and when we return for dinner.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "If Money Ain't a Thang,...I'd make Vinegar Hill House my permanent kitchen. Just consistent beautiful and simple dishes. For Brunch: Best Omelette in the city. For Dinner: Cast Iron Chicken is an example of perfectly cooked chicken.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "Lovely restaurant in one of the more charming little neighborhoods in the city.\nWe had a brilliant dinner here the other night. Started with the pastry dish with the scallops (yum) and the grilled octopus. The grilled octopus was perfect - it is served with white beans, pickled onions, and olives. Brilliant pairing. For the mains we had the skirt steak they had on special - it was rubbed with (I think) green peppercorns and reminded me of the crispy, briny character of pastrami - and a tortelloni that was also on special. The tortelloni  was stuffed with lamb was beautiful except for the fact that while technically it wasn't an appetizer, it was tiny. Four tortelloni. In their defense the waiter did say it was a small portion and the price was fair.\nWe finished with the Guiness cake. Very nice.\n\nGreat wine list, although we ordered by the glass. They serve the BTG wine in very cute and small glasses and I'd be interested to measure how much they hold as your initial reaction is that it is a very small pour.\n\nOh, and decor. Warm. Inviting. Charming. Very vinegar-hill-y. If that is such a thing.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-11", "description": "To sum it up in a word: meh. I went on a date here (the date went amazingly -- great ambiance!) but the food was not too memorable. I got the trout and he got the chicken. Both were things I felt like I could have had at a friends house. They had a decent wine selection--much more reds than whites. But overall I'd probably skip this place. Service was good and friendly though!", "author": "Alyssa E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "If you are looking for a great brunch in Brooklyn, this is your place. If you are prepared to wait. (Everyone else in Brooklyn agrees with my opinion)\n\nThe menu is small, but expertly fine tuned. There were also three additional specials the day I went. I had the sourdough pancake with pears which was mind-bogglingly good. It was just one large pancake, which meant I still had to be rolled home, but wasn't in pain. The french press coffee was extraordinary. \n\nThe prices seemed pretty average, except for charging three dollars for two slices of regular toast, which I thought was ridiculous.", "author": "Natalie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-30", "description": "First off. I love this location. out of the way. HIdden and unassuming. A plus for that.\nFood was good. I started off with a delicious Butternut squash, Grapefruit, Chicory and Cumin vinaigrette. Loved this. My friend had the chicken LIver Mouse, we liked the salad best but the ckn liver mouse was a very good try. I crave my main course - short ribs. I want it again. Now, ha. We also tried the cast iron chicken which was nice but nothing special. We had to run to the theatre and couldn't stay for dessert but the chocolat cake looked worth going back for.", "author": "Gandy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "Awesome food. Rushed, unfriendly service. \n\nIf you like really simple, awesome food (like effing awesome food) this place is for you. It's one of the best places I've been to in Brooklyn...up there with Dressler, Five Leaves and James as far as cuisine and atmosphere. However, if you like a more complete dining experience with waiters that treat you like human beings, not being rushed and feeling like you're not just a turnover this place makes good food hard to swallow. \n\nI am so sad the service sucked because I have been dying to go here. On top of that I brought my boyfriend's mom here for her birthday. I'm embarrassed and probably will never be married because of this restaurant. Single ladies run the other way...but eat the salty caramel dessert first.", "author": "Tricia O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "One of my favorite restaurants in Brooklyn. Still. I have eaten there multiple times: with friends, with my husband, with parents, even with kids. Not very kid friendly (no high chairs), but excellent for all other purposes, meals and diners.The pork chop is phenomenal, the guinness chocolate cake is excellent. Nice wine list. Great cocktails. Octopus appetizer changed my opinion of octopus salad. Go early or be ready to wait.  If you haven't been, go.", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "4 and a half really. We had some good friends recommend this place. Awesome. Cool staff. I love that's its in this little nowhere neighborhood. \n\nI often expect \"fair at best\" service, even at nicer spots, in Brooklyn, but this place was great. I had a super smooth rye cocktail that was delicious. Wine list is extensive and delicious. \n\nI had a perfectly cooked delicious bass with roasted veggies, my wife had pasta with clams that was a bit small, but very flavorful. \n\nThis is a great date spot with a chill atmosphere. We'll be back for sure.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-13", "description": "Vinegar Hill House has a wonderful inviting visual appeal. Old fashioned and cozy, especially the lower level with the beamed ceiling and fireplace. That's where it ends.\nSuper slow service. Although the food was tasty..for the price, the portions were incredibly small. And they came with nothing...so side, no vegetable...nothing. Everything must be ordered separately, which is not immediately obvious.\nBut I think the weirdest and most unsettling issue was that fact that two of us ordered Endive Salad. When our salads were served to us, we were shocked to see it was not endive at all...but radicchio. Obvious red and white leaves of radicchio!!!\nWe pointed it out to our server, who assured us it was endive (but it wasn't endive at all!!!!).\nThen when our waitress arrived, we again pointed out that it was radicchio and not endive....and she demanded that it was endive (but it wasn't endive at all!!!!).\nAnd the waitress was not very friendly to begin with and completely lacked personality!\nWe all would have been fine if the kitchen had run out of endive and switched it out with radicchio and if we had been alerted ahead of time....but for two of the staff to say without question that what we were served was actually radicchio and not endive was insane and insulting.\nIf I had had a few more of the expensive beers, perhaps I would have insisted I speak with the chef.\nTried it once, food tasted fine, but the bad taste the experience left in my mouth was more than enough for me.", "author": "Burgess M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "What an adorable place! It's a bit of a trek to an inaccessible neighborhood, but an entirely charming experience.\n\nWe were seated immediately in the charming back garden, which was perfect on the first really nice night of the year. We both ordered the chicken two ways, which was good enough to make me not regret ordering the same thing as my dinner companion. For dessert we shared a salted caramel custard - a big highlight of the meal. For someone who generally passes on dessert, this was a perfect salty sweet end to a meal.\n\nMy only complaint was that sitting in the back garden meant sitting near the smoking area in a closed off space without a whole lot of wind to blow the smoke away.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-30", "description": "Unfortunately, I only made my way down here for an interview, so I can't comment on the food. However, I can comment on the individuals whom I assume to be the owners, Jade and Jean Adamson. They were super rude and dismissive, as if I inconvenienced them in some way. I would actually have considered coming here, because of the location and great neighborhood but definitely wouldn't after this. As soon as I got there, I received a very cold reception and they just weren't friendly. I don't know about anyone else but I wouldn't want to work or eat in an establishment that is rude to their staff or potential staff. Even if the food is good, I will never patronize or recommend this business.", "author": "Lyn J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "This restaurant is lovely and the food was great.  BUT, the clientele is a bit too...\"hey, I'm a FOODIE and I dress in flannel and I nonchalantly happen to be in the middle of nowhere in Brooklyn!\"  I couldn't put my finger on it, but after my first beer I didn't seem to mind so much.\n\nWe shared the blood sausage appetizer.  Best thing I ate all week, hands down (and yes this is the same week I went to Colicchio \u0026 Sons and Marea--ok, so maybe I, too, am one of those \"people\" I just described above...).\n\nWe also go the bone marrow ravioli and the pork chop.  The pork chop was so good.  The ravioli was good but I didn't care for the beans.\n\nNo dessert.  We were stuffed.  We came here primetime on a Friday night, so it was packed.  I think I'd enjoy it more if I didn't feel like a sardine in there.", "author": "Jordan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-22", "description": "Okay, this place is no joke. My cousin came to visit me and had a list of 40 places that he heard about via food network (mostly \"Best Thing I Ever Ate\" or \"Man vs Food\") to try out.\n\nVinegar Hill was on the list so we got a reservation. I suggest you get one, BTW. Anyway, the shows said that this was the best place to get a pork chop.\nWe ordered:\nPork chop\nOven Roasted Chicken\nAsparagus\nSmashed Potatoes\nPapaya Salad\nCharred Pork Stomach\nPork Ragu\n\nHoly hell, the pork chop was good. My cousin was literally shaking his head after every bite. he said \"This is the best....(chew chew) best pork chop I've ever had! (add groans and head shakes with closed eyes anywhere you see fit)\n\nThe asparagus was great, the pork ragu was phenomenal, chicken was applauded at our table, smashed potatoes were yummy, and the pork stomach was divine. The papaya salad was fine. \n\nPS the cheese grits that come with the pork chop have a kick to them and are some delicious grits. PSS, I usually hate grits!", "author": "Stina I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "I really enjoyed this place! It has great decor and delicious food.", "author": "Audrea Rachelle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "Lost on an out-of-the-way street in far flung Vinegar Hill you feel like you've really wandered off the grid. Very cute and cozy little restaurant with good food and wine, but best part is walking down the cobble stone streets and feeling like you're in a tiny village stuck in the 1900's. Call to reserve, even on a Sunday", "author": "Jessie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Terrific neighborhood restaurant with a constantly changing menu. I've been multiple times for both brunch and dinner and have been constantly impressed with the innovative choice of ingredients and high quality preparation. The cocktails are great, and the bar staffed by experts who are happy to go off-menu. \n\nDinner deserts are particularly good: we've had everything from Birch flavored sorbet to grilled ivy leaves- and never been disappointed with the outcome. \n\nThere's currently a sausage cheddar bagel dish on the brunch menu: it's terrible. A bizarre aberration to an otherwise uniformly excellent restaurant.", "author": "J W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "Beautiful space on a quaint street, but greeted by a sad-sap hostess who was airing her personal problems in front of us as we arrived. Barely a smile was formed on her face the whole time we were there, which wasn't long enough since our food was rushed out to our table without breathing room.\n\nWe ordered the garden lettuces, seared pork belly and cast-iron chicken and asparagus. Food was perfect, pacing was not, as the salad and pork belly came out at once, and chicken came out before we had finished the others. \n\nDessert was perfect, the guiness chocolate cake with cream cheese frosting. Great mix of  people eating, young families on the early side, constant stream of interesting hipsters later on. Enjoyed walking back to the train after, stopping for a view of the city en route.", "author": "Michelle T."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}