{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-25", "description": "Almost unbelievable how delicious this food is and how they elevate each ingredient to create their dishes. We highly recommend ordering the Napa cabbage salad and the chicken liver. It's like Runner \u0026 Stone's duck pastrami or grappa-cured striped bass, starters you will crave. We ordered the specials as far as entrees, and topped it all off with the chocolate lava cake. Not only met, but exceeded our expectations for a special holiday meal.", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-22", "description": "The cook behind the short ribs and pork chops at Vinegar Hill better watch his or her back. I could see someone kidnapping this person and forcing them to cook short ribs and pork chops in some small underground kitchen, so beyond outstanding were they that to eat ribs and chops anywhere else would be a painful reminder of the dream deferred.\n\nDid I order the short ribs or the pork chop? No. I ordered the chicken, which was the most tender bird I've ever experienced but lacked the comparative sophistication in flavors, even with its savory rub and crisped veins of rosemary. \n\nEqually frustrating were the lack of side dishes or background to these lovingly tendered main dishes. A bouquet of local, seasonal vegetables would have greatly helped balance these dishes. \n\nThankfully, the wait is not long, the staff is relaxed, personable, and non-stuffy, and while the lack of any background on the plate is frustrating, the outdoor dining area provides plenty of beautiful background to cultivate an anxious expectation of what's to come with a few glasses of wine (or perhaps several bottles) .", "author": "Sheebs W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-14", "description": "Wow this place is really cool, and really delicious.\n\nWe sat at the bar and had the chicken, spicy greens salad, and spaghetti with lobster sauce. All impeccable. Super delicious.\n\nAlso loved the vibe in the little place. It was really cozy and well-designed.", "author": "Sara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-08", "description": "It was my first time visiting NY and one of my friends is actually one of the cooks at this very intimate and surprising restaurant in Brooklyn.  Here is a list of things that we ordered for a party of 3:\n\nSeckel Pear Salad\nOven Roasted Octopus\nStriped Bass\nBoneless Braised Short Ribs\nBlack Pepper Tagliatelle\n\nWe may have had more than this, but I just cannot remember what exactly we ordered.  With all honesty, there was not a single course that I did not like, you really can't go wrong with any of these dishes I listed above. The Black Pepper Tagliatelle was my favorite.  Although prices may be a little pricey,  I think the whole atmosphere, service, as well as the quality of food and how it's presented is all worth it.  \n\nWhat is also great about this place is that, it was in the middle of a quiet neighborhood with some scenic views in the area - this would be a great place to bring a special someone especially if you want to take a nice walk around the neighborhood.  \n\nBRAVO!!!", "author": "Chris L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-24", "description": "I was hoping for better.\n\nThe decor: A kind of comfort/Americana/crummy \"chic\".  But I don't think they pull it off--it's contrived.  I got tired of looking at the paint drip marks on the wood bench across from me.  Reminded me of my public elementary school days when the City was almost bankrupt. \n\nThe food:  The menu is short, and I didn't see any entree that appealed to me, so I ended up with two appetizers.  The tart was ok--whatever cheese they are using is very good. The mussels were just ok. My girlfriend had the cod, which was good, but the portion was half of what it should be.\n\nThe Potatoes Gratin with Celery Root side dish was disappointing and watery.\n\nThe dessert was uninspired.  We tried the pound cake with fresh grapefruit and creme fraise.  And that's exactly what it was. Just some plain pound cake with a few slices of grapefruit sitting on a dollop of creme fraise. Meh.\n\nThe Service: Very casual, which is ok with me--our server must have said \"cool\" at least 20 times.  \n\nHowever, during dessert, they brought out a little French Press of coffee, then when the server pushed the plunger down, spilled 1/3 of it on our table and onto the dessert!  No apology!  The server just looked at the French Press like it was defective, took it away and someone else came to wipe off the table.  There were coffee grounds on the dessert and no attempt to provide another. Oddly, the coffee grounds made the plain pound cake taste better. Eureka!\n\nI won't be back.  With so many really good true \"artisanal\" \"New American\" \"homey\" places in Brooklyn, there's much better choices.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-08", "description": "Delicious!   I came here on a Saturday evening around 7:30 with a group of 3 friends.  The wait was about 40 minutes but they have a really cute back garden area, which makes the wait actually quite pleasant.  \n\nAs for the food, everything we ordered was solid and we had no complaints whatsoever.  We started with the spinach salad.  It came with a bacalao dressing, which added a really interesting salty flavor.  We also had the pea ravioli (super fresh) and the grilled octopus.  For the entree, I had the squad special, which came with a side of blueberries and corn.  Again, they did a great job matching sweet and savory flavors.  \n\nThis restaurant can feel somewhat out of the way if you're coming from Manhattan but if you have some time and are looking to try something more quaint and different, its definitely worth the trek!", "author": "Annie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-29", "description": "On a snowy, wintry night, boyfriend and I were going to check out a show at St. Ann's warehouse in DUMBO. I had raved about Freeman's before to him so when we heard that Vinegar Hill House had opened up in an old stable house, we were psyched to make a night of it.\n\nFirstly, the neighborhood itself is gorgeous- there are a lot of neat nooks and crannies as we stumbled upon the Commander's house and this AWESOME abandoned store/restaurant front. Vinegar Hill House sits in a quiet street, a warm and inviting spot in what was a desolate nighttime \n\nWe made a terrible mistake of buying twist-off top wine at the local grocery store..it was like Maneschewitz bad. Since they were lacking their liquor license, we went without wine for the meal. \n\nWe ordered the beet salad (which was good, but a strange choice since we are not super keen on beets), I had the lamb-filled 'popehats' pasta and boyfriend had the roast chicken with a sherry reduction with fingerling potatoes.\n\nThe appetizer was really a portion for 1- which kinda sucks since they suggested us to share an appetizer. The entrees were on the smaller side-- but my boyfriend's roast chicken did not have the fingerling potatoes listed on the menu. Instead the kitchen had substituted with shallots, without telling us and the server said they had run out of potatoes (which puzzled us since...they had a fingerling tart on the menu?) The chicken reeked of sherry vinegar, which made it nearly impossible for boyfriend to eat and enjoy. The popehats pasta was pretty good, though the lamb filling really did not seem to work. \n\nOur server was attentive at first, but post-entree it was pretty hard to get a hold of him since the place had filled up. We decided to forgo dessert and grab a slice elsewhere since we were still starving afterwards and I was actually more satisfied with the slice than my meal (probably coz I was ravenous). \n\nI was pretty sad about this experience since I really dig Freeman's and I loved the atmosphere of Vinegar Hill House. Maybe after they've been around for a little while, I might give them another go, but with so many other places...", "author": "Romanie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-09", "description": "Extremely over priced. Very small portions. The quality/quantity of food is not worth the price. $9 dollars for six crappy grilled asparagus. NO THANKS! Will not go back.", "author": "Dom C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-27", "description": "I had a terrific experience here. My friend and I walked down from gold st and were impressed with the decor immediately. The staff was friendly, the food was well made, reasonably priced and the drinks were great. \n\nI loved the dismantled organ on the wall, the low lights, and the leaded glass. I wish I could eat here all the time, alas I am from stinky old seattle. :)", "author": "Lanny K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "Two words: Short ribs. My God! I know everyone raves about the chop, but my wife and I had them side by side and the chop paled by comparison. \n\nAs a whole, everything was excellent. I had the octopus app and wifey had the watermelon salad. Both solid. Then the mains came, and we know who won that battle (see above).  But the okra \u0026 zuchini side we got was also pretty killer. \n\nAnd for dessert, the Guinness Chocolate cake with cream cheese frosting wasn't too shabby either. In fact, even our cocktails were quite good. The only nits would be it's location, which is pretty sketchy, it's decor is just eh, and the hostess has a bit of a tude. \n\nSo, in summary, if I could give half stars, I'd give it 4.5. But since I can't, I have to go with 4. It's fantastic and totally worth the wait, as they don't take reservations, but it ain't 5 stars perfect. At least not yet.", "author": "Ari H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-27", "description": "Overly hype...\n1- Pork chop was cold.....so not delicious at all...How can a place that is name one of the best pork chop serve a cold dish???\n2- foie gras was ok...actually is pate...so wasn't great at all\n3- salad was tiny....$11 I would expect a plate full of veg....but it was a tiny hand full of veg..4 bite you can finish it...\n4- Chicken was hot...(thank god)...that sauce was good...meat was tender... but i expect more from a place that is so highly rated....\n5- Service...people just walk by you...\nbased on my experience....I wouldn't go back...sorry....", "author": "Kenny H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "Went here for a birthday party and had a nice time. We had to wait at least 45 minutes after our party arrived though we had a reservation, so minus 1 star for that.\n\nWe shared a few entrees and sides. Stand outs included the rabbit pappardelle ragu, which was phenomenal only a little skimpy on the portion size. We also tried the bone marrow ravioli, which was interesting but (surprisingly) a little unimaginative. The marrow-stuffed ravioli were simply served with a beef broth reduction and a few cannelini beans. A little boring. The chop was lovely yet a little fatty. I've had better at Freeman's. \n\nAmong the sides we had the winter salad, which was okay but had an overpowering curry taste. The squash tart was nice but nothing to write home about. The chicken liver mousse was absolutely phenomenal--smooth and served with perfect little toasts, pickled onions and topped with pistachios. \n\nFor dessert we had the chocolate cake, which was a bit dry for my taste. The real winner that will keep me coming back is the salted caramel custard. We practically licked the little pot it came in, it was so incredible! \n\nAs for service, our waitress was nice but not overbearing, and perfectly attentive. It'd be nice if they fixed the wait time problem, but I won't hold my breath.", "author": "Karen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-16", "description": "Delicious, ambient, relaxed but upbeat, and makes you feel very in-the-know to be here (even if you just live down the street!)\n\nMonday nights are the time to go -- you're less likely than at other times to wait for a table.\n\nEverything I've had from the cocktails to the apps to the entrees is top-tier, whether at brunch or dinner -- perfectly cooked, nicely seasoned, inspired but simple.\n\nAnd the Guinness chocolate cake with cream cheese frosting is THE BOMB.", "author": "amy s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-05", "description": "This was quite the recommendation by my friend. It has a quaint little \"hole in the wall\" type feel.\n\nWhen you get to the block of the restaurant, you start to think maybe you got the wrong directions. It looks like a residential neighborhood with no stores or restaurants in sight. Don't give up though. It's there! There are no signs for the restaurant but as you walk by it'll definitely catch your eye. The place is always packed! If you go with one friend, it should be fine. Group dinner is definitely not recommended due the size of the place. It definitely is a good environment. The place is very dimly lit (candles on each table) so it has a nice intimate type feel but then again the next table is literally inches away. So much for privacy! Just wish there was a little more space between the tables for easier movement and that way the next table won't try to cut into your conversation. I was interrupted a couple times by the next table when they wanted to tell us how great the food was without us asking. Maybe they were just crazy people. *shrugz*\n\nOnto the food! First the appetizers, we had ordered the chicken liver mousse with vinegar onions and pistachios. It's basically a spread. You put it on the bread that it comes with and take a bite. So delicious! The mousse was so creamy with great flavors. It has a fatty texture to it. I wish I could have this on toast every day! Plus I love pistachios! After finishing the bread, I just scooped the mousse by itself to try. It can definitely be eaten with just a spoon (like peanut butter) but it tastes so much better with bread. The little salad that comes with it is really fresh and crunchy. The second appetizer is the charred pork belly with masa flatbread, watercress, sour cream and pumpkin seeds. Get a little of everything from this dish and insert into mouth. That's what heaven taste like! The pork belly was amazing! It melts in your mouth like M\u0026Ms. Everything just goes together so well. I don't even know how to explain it. Just go try it and you'll see what I mean! The one thing I regret ordering were the Brussels sprouts. I'm anti-vegetable but I thought I'd give it a shot since it was recommended by some yelpers. Boy do I regret listening to them. Ugh! Not to mention they are slightly burnt (I think it was meant to be that way). It left this nasty taste in my mouth. Luckily there was still some pork belly and mousse left to help me get rid of the bad taste. I would just stick with the belly and mousse. Who needs vegetables when the most popular dish here is...\n\nTHE RED WATTLE COUNTRY CHOPS WITH CHEDDAR GRITS! These pork chops are divine! They were juicy and flavorful. Plus, there was just the right about of fat on them. They were cooked to perfection! The meat basically comes right off. I thought it was a small dish but it is quite the opposite. It is a good sized portion. The cheddar grits were so good too. The grits go very well with the pork chops and the taste of the grits was not overpowering. I ate too many appetizers and couldn't finish my pork chops. Very upset with myself. Thankfully, I was able to take it home and enjoy. They still tasted good the next day!\n\nThe price is not bad for the quality of the food. For two people, a couple of appetizers and one entrée each will definitely be over $100. I would definitely go back again for more pork belly and pork chops! Anyone want to join me?\n\nBoom...THAT IS ALL!", "author": "Derrick L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "Vinegar Hill is awesome and worth the walk from York or High Street on the F or the A,C,E. The drinks are delicious and the food was like... Woah. I'm eating a pork chop?! This is amazing!\n\nI've never been a person to order veal or pork at a restaurant. I don't know why. I'm just more into just about anything else on the menu. For some reason on my trip to Vinegar Hill it was just too much to resist. My friend got the pork chop based on Frank Bruni's glowing recommendation and I got the Veal.\n\nIt was perfect.\n\nThe outside was perfect the inside was beautiful.\n\nI almost cried.\n\nWell, not really. \n\nAll in all we had three rounds of drinks, appetizers, main course, and one of each dessert on the menu for 5 people and we got out of there for a little less than $400. It was reasonable and worth it. The wait staff was friendly and didn't even bother us when we were still there after they closed. All in all a good Vinegar Hill House experience.", "author": "Carlie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-02", "description": "I had the privilege of visiting this cute little restaurant on the outskirts of DUMBO and I am so glad my friends introduced me to this place!\n\nWe strolled in on a Friday night around 11 and the place was packed.  But no matter -- the very nice manager of the restaurant spotted us right away and asked us what we wanted.  We were a party of 4 and he said we could sit at the bar rather than waiting for the table, because there was a wait for a table and the kitchen would probably close before we were seated.\n\nSo we sat at the bar and had excellent service from the bartender throughout our whole meal.  The menu, when you look at it, is not that large and I wonder if they change it frequently.  What is on the menu, however, is all delish and VERY inexpensive for the quality of food they serve.  Starters and entrees are in the $10-$14 range mostly, and the servings are generous.  \n\nWe showed up starving, so we asked the bartender for a cheese plate right away.  I could not remember the names of the cheeses, but they were all SO good.  One of them was a very soft, brie-like cheese that had a mellow flavor, another was a soft blue cheese, and the third was sharp and interesting.  The cheeses came with a little salad that had quail egg in it, some salami and some tasty homemade crackers.\n\nNext we moved on to the shrimp appetizer, which is basically 3 pieces of fully intact shrimp (head, tail and all) roasted and charred just right.  The shrimp was tender and the sauce was smoky and deliciously rich,  and the head and tail were perfectly crisp.  I haven't ever had shrimp that I thought tasted \"rich\" before, but that's how I would describe this shrimp.  The richness of it was nicely balanced with some kind of white root vegetable that they had shredded to look almost like thin pasta noodles.  So the contrast of rich/smoky and cool/crisp was perfect!\n\nFor my entree I got the pea ravioli, which was just as amazing.  Pureed peas were wrapped in the tenderest of ravioli shells, with a few random loose peas scattered here and there and a light sprinkling of parmesan.  But the cool thing about this dish was that it had a minty flavor that gave the dish a really fresh, springtime taste, and I couldn't figure out what it was!  The bartender overheard me talking about it and he told me what it was but I forgot.  It was such a nice surprise to taste that subtle mint flavor along with the peas -- it made the dish unique instead of boring, and I found myself intrigued the whole time I ate it.  There was no indication of any mint sauce on the ravioli so I can only assume they used some kind of mint oil or ground up mint leaves with the pureed peas.\n\nMy friend sitting to my immediate right ordered a very rich, generous portion of roast chicken that came with shallots and was served in the cast iron pan they cooked it in.  They gave so much chicken in that dish, it would have been impossible for one person to finish but it looked perfect for sharing.  Everyone at the table thought it was amazing.\n\nFor dessert, the friend who introduced us to the place insisted we had to get the Guinness chocolate cake.  We took her advice without question and out came two perfectly fresh, homemade-looking slices of chocolate cake topped with a thick layer of smooth, creamy white cake frosting.  We dug in, and the cake was just right.  The frosting had a very nice thick consistency and was not overly sweet in the least.  The cake was rich without being \"oh this is too much!\" rich and also had a very subtle, sweet flavor.  Just perfect.\n\nWhen it was time to sort out the bill, I gawked.  After ordering a cheese plate, 4 starters, 2 entrees, 2 desserts and a bottle of wine, we ended up paying $40 each . . . WITH tip.  It was amazing to me that we had had so much quality food plus a bottle of wine for that low price.  I felt like I had been treated to an expensive meal without it actually being expensive.\n\nSo the food and prices are obviously the major selling points at Vinegar Hill House, but the place has more to offer.  Even though it has a modest, casual dining room that's a little on the small side, the overall experience of being there was pleasant and unexpected.  Every staff member in the restaurant works to make sure you have a good experience there, and you feel really welcome.  Everyone from the manager who first greeted us, to the bartender who waited on us, and everyone else that worked there was so friendly and helpful and offered up plenty of information about the food.  And the kicker?  They played Cure records the whole time we were there.  It was that perfect Brooklyn dining experience that you can't find in Manhattan, and worth the trip out to DUMBO.  I will return!", "author": "elise h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-26", "description": "3 of us shared:\n\nchicken liver mousse\nbraised squid\n\"kid\" pasta\n--\nbraised short rib w/ marrow\ncast iron chicken\nday boat hake w/ cranberry beans\n--\napple crisp\nsalted caramel custard\n--\nxynesteri, mavro\n\nloved all the starters.  the entrees were also all delicious, but on arrival the short rib appeared to be the winner (pang of jealousy).  my hake was perfectly textured and accompanied by my favorite beans.  beware: the cast iron chicken is juicy delicious but arrives sans sides!  so order one beforehand if you want veggies/grits with the chix.  4 days later i am still thinking about the custard dessert... and how to recreate it.\n\nthe ambiance is \"brooklyn nice\" stylish - no dress code but people generally look pulled together, reclaimed/antique finishes to decor, etc.  exceptional service, the staff remained cool headed on a hectic/busy night.  the bar man knows his stuff.  had a great view of kitchen prep from the perch at the bar, no back strain (yay bikram yoga), alllllll gooooood.", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-22", "description": "I ate at Vinegar Hill House on the recommendation of my cousin, who is a Brooklyn local, while on a short trip to NYC this December. I followed the subway directions listed on their website (F line to the York St. stop). At first, it looks like we were in a rough area, but then we noticed that every car parked on the road was a luxury car of some sort. It ends up being a little out of the way in what appears to be an old neighborhood with brick paved streets, and has lots of character.\n\nMy friend and I arrived at about 5:30 pm for diner (we had a concert to attend at 8, so we wanted to make sure we had plenty of time). Although the restaurant wasn't open yet, the directed us next door to their bar where we enjoyed some excellent espresso until they opened. We were the first ones in and were seated right away. They had a limited menu, but everything sounded really good. I ordered the wild boar shank and a North Coast Scrimshaw Pilsner and my friend ordered the Whole Trout with the Ballast Point IPA. My friend enjoyed his trout and my boar shank was incredible. It came on a bed of grits and roasted pumpkin seeds that were average, but as a southerner, I probably have high standards for grits. \n\nA word of warning, this placed filled up quickly. By 6:30 there were no empty tables! So if you want to go, go early or be prepared to wait. I highly recommend Vinegar Hill House.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-08", "description": "Late brunch again with thimble size portions\n\nUpon entering our host gave us a friendly warning that we had 10 minutes to order brunch.  Cool :-D  Our waiter gave us the low down on the specials... I really appreciated that because most places would just skip that and hurried us for our order.\n\nOur Founding Fathers would have approved of the decor. Complete with flag, needlepoint dating back 1700's something, Philadelphian  style furniture and a fire cove.  I was impressed how many cooks where working harmoniously behind the station.  And, couldn't wait to eat as a migraine was nearing. Been meaning to come here for dinner but each time I called it was an hour wait.  \n\nAs the food came out onto the table, my first reaction was --WoW, how miniscule!   Two small poached eggs that must have come from the smallest chickens in the world. And, the trout wasn't any larger?! The overall taste was good/fresh and composed well but I just wished for just a little more (by 2\" more) even the toast was lame.  I wouldn't bring this up but compared to the staff meal, they had HUGE/mouth watering stacks of food. It just made us feel un-loved :(\n\nI would forgo VHH brunch and stick to Freemans.  Dinner?  Perhaps but knowing the plating size and average wait time... ah only time will tell.\n\nPS the special fresh pressed juice was amazing (cantaloupe) it really made insides jump!  And also enjoyed the Bloody Mary -nicely made.", "author": "phong-lan h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "This is a cute little place on a cute street that is fun to trek to.\n\nOur food was good.  Our cocktails were amazing.\n\nTo start - we had an heirloom tomato tart that was delicious and a watermelon and bean salad that was good (but we got it w/o the pig's head that it came with so perhaps that is why it was a bit less than stellar). I'd definitely go back for that tart!\n\nFor our entrees - I had the vegetarian pasta and my friend had the chicken.  I loved my pasta.  She loved her chicken.\n\nFor dessert - we split a lime poundcake with strawberries.  This was the only disappointing part of the meal. It was fine - but the poundcake was dry, they skimped on strawberries, and it was overloaded with whipped cream.  Granted, I'm an experienced baker and have a tendency to pick these things apart, but my dining partner wasn't super impressed either.\n\nThe drinks - we had some amazing cocktails.  The cocktail menu was a bit obscure for my drinking knowledge, but we ordered based on what we could understand and were quite impressed with our drinks.  Mmm - I want to go back for a cocktail and that darn tomato tart.  \n\nOverall - I like the ambience of the place, thought the service was great, and would definitely return to have drinks and dinner (no dessert).", "author": "Kirsten K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}