{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "anytime i have brunched here i have had wonderful experiences. \n\nthis restaurant is tucked away on a forgotten street (yes forgotten still exsits in real estate crazed brooklyn) and is ten minute walk from the York Street subway stop or from anything you may be doing in that general DUMBO area - shopping at west elm or walking along BB park. \n\nthe restaurant is on the smaller side so waits can be normal on a busy day. you can make reservations which may help if you plan ahead. all of the food is great. some favorites of mine are the sourdough pear pancake, eggs benedict with smoked trout and the cheddar grits with shrimp. sides that go great with these are the potatoes and sour cream, the grits and duh, the maple cured bacon.\n\nthere are standard cocktails to go with your brunch (bloody marys/mimosas) or you can opt for other options like a basil soda which was the perfect amount of dry and tasty.", "author": "Maia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "THE BEST FOOD AND ATMOSPHERE EVER!! Intimate, candlelight, anazinggggg cuisine!!!!!!! Longish wait BUT TOTALLY WORTH IT!!! we went around the corner for drinks while waiting and came back to eat! It was amazingggg!!!", "author": "Adriana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "This is one my favorite restaurants in New York.  It's not just cozy eclectic vibe or the location on a quiet street by the Navy Yard that some how seems like the last street in Brooklyn . . . its the extraordinary and inventive food.  I have really never been disappointed.\n\nThe menu is small but frequently changing, but a few staples I would highly recommend are the chicken lover mousse and the skillet cornbread.", "author": "David D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "I haven't yelped in awhile but I had the most amazing pasta special with a lamb offal sauce. The drinks are delicious (especially the gin with pear).\n\nWhiny yelp reviewers that complain about the price - maybe you should look ahead at the menu to see the prices at restaurants. If you can't afford it...maybe it's just not for you.", "author": "Ty R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "This was a cute restaurant, furnished with old/antique not fancy furniture, but very nicely done. Dim lighting, moody-but a very pleasant vibe. Staff were lovely. But - the food was terrible. We had 6 course between the 3 of us (and 2 were simple spaghetti and cheese plates for my young son). Of the 4 other courses, 3 were bad and 1 ok. Two courses - a chicken dish and a salad were so drenched in vinegar it was impossible to taste the food (I guess the name should have given this away). The chicken was ever so marginally under-cooked. The pasta dish turned up too cold. The mussel toast dish (the best of the four) was a bit burned, chewy and hard to cut. When we mentioned the vinegar infused salad to the staff we felt a little as if were treading on eggshells. It didn't seem like they understood the point-maybe the vinegar taste was what the chef was looking for....We're real foodies and eat in new places whenever we can. The place was not cheap, but if the food was very good it was appropriately priced. Given the awful quality of the food, it's not one I would return to.", "author": "andrew B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Found this gem on an unofficial Dumbo/Vinegar Hill tour. Came in for dinner, ordered a glass of rose and the spinach + ricotta manicotti. I liked this dish, however my friend ordered the gnocchi and I LOVED that dish. Was very fresh and flavorful. Excellent. But the best thing about my experience here was the Guinness cake. OMFG is it good. Although at $10 a slice, slightly steep! Next time I will try the cornbread as I've heard excellent things about it. And I will definitely be back.", "author": "Stacy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "All of the food and drinks were great but the CORNBREAD will change your life! You owe it to yourself to experience it! \n\nGreat little place in a quiet area. Will definitely be going back.", "author": "Eric B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-25", "description": "My wife and I were super excited to try this place out after seeing at show at St. Ann's Warehouse. \n\nAnd gosh, is the interior charming. But boy, is the food mediocre. We spent $100 for two of us with an appetizer and salad and two entrees, no booze. Not that this would be so terrible or even remarkable at a great NYC restaurant.\n\nBut this is simply not one of them. The flavor profile of the pork was simply \"salt\" and that of the chicken was \"salt water.\" The salmon croquettes were *okay* and the cabbage salad was forgettable. \n\nThe service was pleasant and quick -- no complaints there. But as for the food: not good and perhaps even more damning: wildly overpriced.", "author": "Thomas W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "Used to be one of my favorite restaurants in Brooklyn. Not anymore. The food isn't what it used to be and the service is terrible. The staff treats you as if you're an inconvenience. Unfortunately, I won't be coming back here, and you shouldn't either.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Loved this place! Fantastic ambiance, and the food is delicious! Highly recommend the Fennel Ceasar Salad!", "author": "Edward E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Not as good as it used to be, but very very good anyway.\nPlease don't leave DUMBO, and bring back the banana pancake!!", "author": "Baby Elephant P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-24", "description": "I like to be left alone in restaurants, which is why I always sit in the far-corner seat of the far-corner table, so I can be left in peace with my foods and drinks. But, last night, that didn't stop our waitress from rudely reaching all the way over my friends' plates to shake my glasses and tip my plates. After the 14th (of course I counted! )time of her doing this, I asked her to please stop, because I find it invasive and disturbing, and also unsanitary. She was literally extending her entire head \u0026 neck \u0026 torso (hair, nose, mouth, armpits, elbows, hands, abdomen!) over our entire four-top table, picking up all of our glasses and shaking them to see if they were empty! She was, again, literally, tipping our plates on their sides to see if there was still any food left on them! How horrendous! How intrusive, how invasive, and how annoying is that! She had no concerns for our boundaries or space or privacy or conversations. Although I was initially the only one to complain, my friends all admitted to feeling a bit violated. It was my Birthday, and although I didn't expect it to be perfect, this was just unacceptable. In her defense, she said \"I'm sorry, I just can't see anything\" but that's really no excuse, because if SHE can't see anything, why should WE customers be made ill at ease?\n\nAdditionally, our Pappardelle appetizer was slimy and disgusting. And the Cornbread side dish had a big piece of plastic in it. And the Arctic Char was overcooked. And the Steak Tartar was flavorless. And the Wild Mushrooms were bland. And the Brownie was really dry. So why 2 stars rather than 1? Because the cocktails were great (though expensive). Because the Red Wattle Chop (beautifully brined like ham-steak, beautifully medium-rare like I asked, beautifully charred, beautifully rendered fat) was absolutely incredible, as were the accompanying Adzuki Bean Puree \u0026 Shredded Sautéed Leeks. And because the Brussels Sprouts \u0026 Baby Carrots were some of the best vegetable side dishes I've had in a very long time. It's a very cute restaurant, tiny and intimate, located on a sublime side street, but there are LOTS of problems to fix.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Get there early. Hands down the best pancake ever. Pork grits were awesome. Very cool location in  Brooklyn and a walk after lunch puts you on the River in minutes! Very tight space and very small Bloody Mary's but this place is a winner.", "author": "Craig H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "Got here for an early dinner. Interesting location and a charming room. Had a drink at the bar, bartender was nice, beer not too expensive.  We were seated and had the octopus, mouse, and gravlax apps. All were great, gravlax was the least  liked. Portion Size? Seemed ok to me considering nyc.\nHad fish and pork chop entrees. Fish was fine but not very interesting, I didn't really care for the rice with it.  Pork chops seemed to go over well. Sides: Brussels sprouts were a tad undercooked and not that good, parsnips were over cooked.\nHad wine. Service was fine, no complaints.\nDesert was very good.  Food wise I would not seek this place out, but in general it's a nice place. I'd rather give more stars than less considering just one visit.", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "I always love this place. I can't believe I haven't left a review yet. The food is so fresh and flavorful. We had the gnocchi and legume dish.  The cocktails were superb and the place is just pretty darn cute as well. The staff seems to work well with each other. The only reason I didn't give it 5 stars is because the female bartender that worked there was fairly rude and disinterested in us even when we engaged in conversation.  Unfortunate.", "author": "Shannon K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Do you like huge prices for very small amounts of food? Then you'll love it here.\n\nThe food is fine. It's really nothing special. But please be warned: you will spend a very large amount of money for a very small amount of standard Brooklyn-type food.", "author": "Fileel V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "Instructions to enjoy brunch at Vinegar Hill House:\n1) Go.\n2) Have mind blown.\n\nMix/match the wattle pork grits and Dutch Baby for #epicwin. Can't go wrong with the hefeweizen they have on menu, either (though I wish they had draft, not bottles).\n\nAlso: That backyard.", "author": "Jeremiah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "My wife and I had a great experience at this restaurant. The food was awesome; especially anything that comes in a cast iron skillet. The steak and cornbread were delicious.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "I came across Vinegar Hill House after escaping from the overcrowded NY Festival of Lights in DUMBO. It's about a 15 min walk from the waterfront.  \n\nSince this review is a long one here are the key points:\n- great food and cocktails (get the napa cabbage, corn bread, and brussel sprouts)\n- good service \n- rustic decor, perfect for the winter\n- cozy atmosphere (upstairs louder, downstairs quieter)\n\nUpon arriving, I was disappointed to learn that the wait was 45 mins. The place is small - some table and bar seating upstairs and a few more tables in the cellar.\n\nWhile waiting to be seated, my friend and I had cocktails at the bar.  I had the pins and needles and he had the headless horseman.  I would get the pins and needles again - bourbon, pineapple juice and rosemary is a good concoction.  I'd like to try some others as well.\n\nAfter about 30 mins, we were seated downstairs.  Yay!!  Patience is not my virtue. The environment downstairs is quieter and more intimate than upstairs.  Decor all around is rustic - lots of wood.  I love it for the winter!\n\nHaving looked at the menu while waiting at the bar, we were all set to order.  We split the napa cabbage and brussel sprouts for appetizers, the country chop and artic char for entrees, and a bottle of wine to drink.  \n\nEverything was delicious. Most notable was the napa cabbage appetizer cooked in a creamy black tea yogurt sauce with cashews.  The dish doesn't sound like much on paper, but I highly recommend it.  The brussel sprouts with peanuts and maple ponzu were also really tasty.  The entrees were very good but nothing extraordinary - simple, honest, homey food.  We didn't order any, but as an FYI the pasta dishes didn't look like anything special so I'd recommended avoiding them here.\n\nThe kitchen had forgotten our entrees.  We didn't complain since we were not in a rush, but to make amends they gave us a complimentary cornbread with honey butter. Amazing! If you come here, you must get it!  I want some now!\n\nAnyway, I left happily stuffed.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Red Wattle Pork was insane.  My companion said the Pork Ragu was the best he'd ever had and then tasted my Red Wattle Pork and sed it was the best he'd ever had.  Best pasta and best pig?  What more do you want.", "author": "Treb R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}