{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Generally great. I've had a few duds, very few though. The pork chop is always a favorite, but the real sell for me is the vibe here. It's warm, inviting, unpretentious, and overall a good hang. I wouldn't travel hours to eat here, but a 15 minute walk is worth it if you live nearby.", "author": "Chris Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-22", "description": "I was first taken to Vinegar Hill House about two and a half years ago, and was struck by its warmth, pleasant service, and very good food. I went back once or twice. Last night, I took two friends there: a big disappointment. Out of three appetizers, one was  good: a single scallop, very fresh and tasty. The waiter offered a special of the day, not on the menu: snails with mushrooms. I ordered it. The mushrooms were real: oyster mushrooms, two of them, small but authentic. The snails? A disaster! Snails were few, minuscule, and tasteless. The entrees were not an improvement, certainly not up to my memory of 2 1/2 years ago. I chose hake from the menu, pollock was substituted, looked good on the plate, disappeared on the palate. Neither of my friends was willing to talk about their main dishes.\n\nTwo desserts were not bad. Coffee had to be asked for repeatedly. The check was barely paid, and we were being shown the door.\n\nVinegar Hill House was a great idea...once upon a time.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-05", "description": "I drank the kool-aid again.  I bought the hype and went to Vinegar Hill House on a Friday night (not the best decision on my part, but still).  We waited over an hour for a table of four, but we were sat before John Leguizamo, which we appreciated.  \n\nOnce we sat, the appetizers came quickly and were delicious.  The highlight was the chicken liver mousse and the oxtail/octopus pasta.  Our entrees were a very different story...we waited almost an hour for those, and they were very disappointing.  The highly praised red waddle chop was fatty and unappetizing, the chicken was boring, and my husband's fish was average.  I appreciate understated food but this was bland and completely unexciting.  The brussel sprouts were absolutely delicious and I have recreated them at home, so no need to go back to VHH!  \n\nThe service between apps and entrees was painfully slow.  John walked out about 45 minutes before us, so apparently they gave us the table but gave him the food!", "author": "Jill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "After waiting a few months to go to Vinegar Hill House (due to our busy schedules), my wife and friends finally got a chance to taste this quaint restaurant near nowhere, though the area is slowly building up.  We went on a Friday evening and was completely packed.  Though we waited nearly an hour before we had a table, it was not terrible.  The front bar, as well as an open section in the back, was available for drinks and snacks, great for catching up or just shooting the breeze.\n\nThe menu was compact, with a only a few items, and specials which the staff vividly explained, making my mouth water.  We had the liver mousse and grilled octopus to start.  Though I'm not a huge fan of pate, due to rough texture and after-taste, the similar mousse was different.  The mousse was whipped perfectly, smooth and silky and very delicious.   The octopus was delicious too, but nothing too special.\n\nThe main course included the chicken, bass, ribs and pappardelle.  The bass and rib portions was on the small side and seasoned decently.  The pappardelle was delicious as well, but the must have was the chicken.  Coming on a small cast iron skillet, the chicken was tender and succulent and definitely hot.  We might come back for the chicken at some point but not so much for everything else.", "author": "Donald E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "This is one of my new crave-worthy restaurants. \n\nI hear this place gets packed so we decided to venture in on a Wednesday night...and was seated right away! The decor is rustic and warm, the way i like, but no where as over the top hip as Freeman's Alley\n\nI ordered the chicken liver mousse with pistachios, it was super creamy and the pistachio gave it a nice secondary texture. my bf had the aged olive oil which he enjoyed very much.\n\ni HAD to get the Wattle pork chops based on other yelp reviews...and I must say, it is THE BEST pork chop dish I have ever had!! I am not a fan of dry pork chops, so i was hesitant...but the pork was juicy and flavorful...it was not too fatty, it felt like the fat was marbled into the meat. My bf's wild boar was so tender that they only give you a fork and butter knife because it came right off the bone. We also ordered the brussel sprouts and it was amazing.\n\nwriting this review is making me take a mental note to return asap....", "author": "Flo T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-19", "description": "I went on a Friday night, and had to wait 40 minutes, but it was worth it (and the hostess was very gracious).\n\nThe pork chop was unlike any pork we'd ever tasted; the cast-iron chicken was fantastic too.  The side of pureed squash with roasted pumpkin seeds was great also.  The dishes were \"chef-salted,\" but otherwise perfectly seasoned.  We didn't order appetizers, wisely, as it turns out, since the portions are quite large.\n\nThe desserts WERE amazing - I ordered the best chocolate cake I've had in years.  It was real cake, floury, dense, and burnt on the bottom.\n\nThe service was professional, despite the crowd and the small space.  Easily the best restaurant in DUMBO, and a destination spot for everyone.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-22", "description": "Food was very good, agree with what a lot of others said about it - it's quite good, but not super cheap other for what you're getting.   We enjoyed the cauliflower risotto much more than the lauded chicken, which was just fine.  The desserts were good too, salted caramel and Guiness chocolate cake. Ambiance is cool, though imagine even cooler when the patio is open during the summer.\n\nHowever, as many others have said, the downfall of this place is the wait.  We arrived and were told we'd have a wait of 40-45 minutes for a table of 4. Long story short, we didn't sit down until 2 hours later after many false alerts.  If we had known even early on in the process that it would have taken so long, we would have left.  After we realized we were lied to, however, we were stuck as it was getting late, we were starving and there are no other restaurants really even close by.  The worst part was that the hostess was frigid and totally unapologetic.  The waitress apologized eventually and gave us a free dessert but it left us all with a very bad taste in our mouths after a delicious meal, which is quite a shame. Nothing wrong with having a long wait, just be honest about it.", "author": "Ron F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "Hate to do this because the place is so damn cute and the service is on point, but the food at Vinegar Hill is a C- at best. My pork chop was cold, underdone, and not flavorful. My date's fish was meh~. The desserts tasted like cardboard. I want this place to have top notch food ... it *should have top notch food, but alas, it's far from.", "author": "C B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "- Fresh sardine, roasted, on toast with tomatoes and basil -- delicious.  \n\n- Country chop with cheese grits?  MORE, please!  The generous portion of chop was flavorful, tender, pretty close to perfect.  And the southern girl in me wants a tub of the cheese grits to go too.  \n\nBut the absolutely standout of the night: tilefile with duck crackling crust, served with fava and potatoes.  Yummy in the tummy, AND stays on the brain.  Get it.  \n\nThe only con?  Expect a 1hr+ wait, even if you get there after 10pm.", "author": "Evon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "Stopped in for the first time recently and had one of the better meals we have had in a while. Past up our reservation for a spot at the bar (preferred seating for us) and had good time chatting with the bartender. Can't wait to go back and sample the rest of the menu.", "author": "Steve P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "I don't think I've ever said this before--but this was actually worth the hour plus wait in the freezing cold. \n\nI wish they took reservations, but I guess I'm one of those suckers who is willing to sit outside for what seems like an endless amount of time just to get a shot at eating their ridiculously tasty food. \n\nParty of 3 last night (celebration dinner for a friend), and we devoured:\n  -fall salad \n -squash tart\n -red wattle country chop\n -pasta (the mezzemaniche)\n -short rib\n -brussels sprouts\n -salted caramel pudding\n -apple bread pudding\n\nOverall, I was incredibly impressed. I had several bites of the chop, and ate most of the pasta myself. The pasta was cooked perfectly, and I was a huge huge fan of the spicy lamb ragu on top (with ricotta to blend in at  your discretion). The red wattle chop was also delectable, and although I didn't try the short rib I heard very good things about both the meat and the spreadable marrow.  The fall salad was great with a very cumin-y tasting dressing, and the butternut squash tart was rich and tasty. \n\nI think the food was an A+ overall, although the dessert was just a B. Tasty but nothing super special. The salted caramel was better than the nice-tasting-but-overall-eh bread pudding, but so rich it was almost too much to eat. The bartender was fantastic--she clearly knew her stuff, and as we ate at the bar she also acted as a more than competent server. \n\nWe'll be back...although we might try to pick a weird time. That hour plus wait was bad \u0026 cold!!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "I love the food here. The breakfast food is to die for. They will make you an egg sandwich that will knock your socks off. The grits, bacon, yogurt, pancakes and mimosas are all very tasty. The dinner food is great also. So far my girlfriend and I have had the cheese platter, chicken, pasta, and steak. It was all delicious.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Fantastic food. I am a single women and eat at the bar often;the staff is super nice and very friendly. It's my secret hidden restaurant.", "author": "Roberta H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-14", "description": "**3.5 stars**\n\nYes, it's understandable to be stuck in one's Manhattan bubble from time to time, but even the unadventurous should escape to Brooklyn for Jean Adamson's comfort food.\n \nThis cozy, out-of-the-way spot is famous for serving roast chicken in cast iron pans and mashed potatoes with horseradish. Her chicken, in particular, has been so well received that its recipe was added to The New Brooklyn Cookbook, a compendium of the borough's finest dishes. Plus, the menu changes based on the season, and they source the best ingredients suppliers are carrying each week. I don't think anyone can get bored eating here!\n \nAdamson stirred up a culinary storm at Freemans, and she doesn't fail to amaze taste buds at Vinegar Hill House either. With a line of women wielding knives behind her, she and her team consistently please both the locals and those who travel 'cross boroughs and rivers for her flavorful meals. The restaurant has won over foodies and critics with its honest and homey seasonal cuisine. Like them, I'd travel far for a dose of her comfort-chic cooking.", "author": "Kimberly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "Vegetarian Review:\n\nYUM! Just a quick note: I like to eat at nicer restaurants, and they sometimes neglect to include a vegetarian entree (Why?), so I am flexible. While we waited for our table, we went to Hillside, I got a glass of Coquelet red wine and my wine-nerd date got a glass of Moussamousettes. So delish. I saw some people enjoying beautiful oysters (never ate one but appreciate their beauty).  \n\nOur table was ready and I saw several vegetarian options, none of which were entrees: Beets with silken tofu, Brussel sprouts with peanuts, lettuce with 1000 dressing, and kabocha squash soup. The waiter informed me of the veg pasta special: pasta with duck egg. I ate all of these, except the soup. The lettuce was my favorite, followed by the pasta. \n\nI really liked the parsnip cake with yogurt ice cream and the chocolate sorbet dessert.", "author": "Liz V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Get ready for a long wait, but worth it! For appetizers, we had chicken liver mousse, oven roasted octopus (perfection!), and corn salad. For main: pork chops, braised short ribs, and cast iron roasted chicken. Dessert: Guinness chocolate cake, and salty caramel. A bottle of 2008 Chinon. All were delicious, and the consistency of each dish were perfect. Nothing was over/under done. Great value, too on top of that. Definitely a repeat.", "author": "Annie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "So amazing!  Very warm ambiance.\n\nStart with a cocktail off the menu.  Garret makes a mean vodka gimlet.\n\nThere was a special pork belly app that knocked my socks off.  When in doubt, order pork belly.  Always a thing to remember.\n\nThe pork chop dish was so delicious.  The meat was tender, the flavor was savory and the grits it layed on were downright sinful.\n\nChocolate cake everyone was raving about was ok.  The frosting is what made it.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-22", "description": "Yea...the food is good, but wasn't blown away by any means. As a point of reference...had dinner the other night at L'artusi in the W Vill, and with relatively similar style'd menus, i thought the meal at L'artusi was far superior (better pastas, better seafood dishes). One problem we experienced for our 4-top was the slowwwww service. But the app's were tasty , specifically the chkn liver mousse, the pastas were on-point and creative (oxtail and octopus). The entrees however were average. My buddy's chicken didn't compare to the likes of the exquisite chicken found at Commerce, Forgione, or Laconda Verde. The pork dish was eh. My monk fish was good, but nothing to write home about.  The brussel sprout side was delicious. \n\nAll in all i don't believe VHH lived up to all the superlatives. My suggestion would be to get there on the early side for dinner to avoid the uncomfortable and inevitable wait.", "author": "D s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-26", "description": "The cutest little restaurant in the middle of nowhere. \n\nSituated in the middle of vinegar hill, next to dumbo, where there are no other restaurants or shops is this little restaurant that everyone seems to know about and love.  On any given night the wait is at least 45 minutes since they do not take reservations or even your name until all people in your party have arrived. So once everyone figures out where the hell this restaurant is, you can then begin to wait an hour or so.  The wait can be tolerable if you snag a seat at the bar or wait in the cute backyard if the weather is nice. \n\nAfter all the waiting and you get to the food you realize why you and everyone waited so long for a table here. The food is well prepared, fuflling and delicious. Pork belly appetizer is tasty and not too heavy, the pasta pork ragu is wholesome and comforting, the favored pork chop is massive and flavorful and the roasted chicken is a classic.  Dessert is worth ordering.\n\nOverall, a delicious meal in a adorable rustic cozy setting. Very much worth the trek and maybe the wait.  But then again, I'm never a fan of waiting for food...", "author": "Kitty B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "We came right before the late dinner crowd without a reservation and was seated right away. For appetizer we ordered their Mezze Maniche, and for dinner I had their Roasted Chicken Breast. Appetizer was delish, and so was the roasted chicken breast. The chicken was so tender and flavorful you leave craving more of it! Service was attentive but got slow at the end. It took almost 15 minutes just to get our bill. Not a big problem, but for such a small place on a not so busy evening you'd think they'd be a little faster. The atmosphere of the restaurant it was just very chill. It has that rustic western feel to it, where everything is wood with dimmed lighting making dinner seem special and romantic. If you're in the DUMBO area and want a good meal I would recommend coming to Vinegar Hill House.", "author": "Ryan D."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}