{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "We went there for dinner on a Sunday. I was impressed with the cooking. \n\nTogether we had ordered 3 appetizers, 3 main courses and 1 dessert. I truly enjoyed the Chicken Liver Mousse, Mushroom with eggs, Pappardelle and Pork Ribs. I am not a pork person, because I don't like the \"pork meat smell/taste\" However, theirs was really good. \n\nSuggestions I have are 1) use appropriate wine glasses.  2) Train the waitstaff to be less disturbing and more professional. Our waiter literally decided to pour us water when we had a bottle on our table each 15 minutes after we were done with our meal and were finishing our drinks and chatting. We were his last table, so there was not a point in rushing us, really. \n\nOtherwise, I loved the cooking and would recommend this restaurant.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "the food here used to be -5 star- amazing and we would come here almost weekly. not sure, if there was a recipe change (or 'how' it was prepared) in our favorite chicken dish that made it tangy vs rich and buttery...coupled with what seems like lower quality chicken 3 times in a row... we won't be coming back.\n\nit is a shame because there are a few places to go in this area...", "author": "Jules O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "I had an amazing brunch this past Saturday here and lucked out scoring a table outside in their cozy back patio space. I ordered the poached eggs with spinach and buttered toast with a side of roasted potatoes - everything was perfectly cooked, well-seasoned, and delicious. To drink I ordered the cold brew coffee (they serve La Colombe here, extra points for good coffee!!) and also the chef's beer (two buds mixed with clamato juice and tabasco). My waiter was really friendly and sweet and made sure to come by and check on us often. The food was slow to arrive but I wasn't in a rush so I didn't mind. Would definitely recommend for the outdoor space and also for the stellar food. I was bummed they didn't have any young coconuts left to serve... must go back when they get their next shipment!\n\nread more about it and see photos here: http://www.maisondesreveries.com/2012/09/mornings-at-vinegar-hill-house.html", "author": "maisondesreveries g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-09", "description": "I love the Vinegar Hill House of about 5 years ago. Right now it is always spotty. They have definitely upped their Instagram game and show awesome specials - but rarely do we see those on the menu or does a server let us know. Last time we visited we sat at the bar with , sadly, really poor service on a Sunday night where the restaurant was maybe 20% full. Bar tender spoke to someone at bar entire time and we almost begged to get check and head out. Would love to see more inventive and seasonal dishes vs the staples that seem to have creeped back on - As a neighborhood place, sometimes you want a coffee and light breakfast, but they have pretty heavy meals and we always end up ordering just the sides. Always rooting for VHH as the space is just so inviting, but the food needs to change it up a bit more often and surprise their locals.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Great food, but don't come hungry as portions are small.\nDrinks were very good and unique", "author": "Kelsea Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-21", "description": "Vinegar Hill House is a charming carriage house on a block of Brooklyn that feels like a set from a period movie. Having recently moved to Dumbo, and never been that far north I was positively delighted and astounded. The food was flawless: The heritage pork chop one of the most delicious pieces of meat I've ever had, resting on a bed of creamy and spicy grits that were the perfect complement. The grilled octopus, just the way I like it (similar to the preparation at another fave joint, Speedy Romeo in Bed-Stuy. The spicy greens starter was generously portioned and delicious. The desserts: goat cheese panna cotta, home made mint ice cream, and sweet corn tart were equally amazing.\n\nNow, about the staff: for starters, on this night it was 96 degrees and humid outside and my date got to the restaurant before me (at 5:59 for a 6PM reservation). As he opened the door a young staffer rushed over and gestured to him to get out because \"we open at 6PM\"). Overall the servers were the polar opposite of welcoming. Perhaps this is their \"schtick\" ... as we're not the first people to point this out about Vinegar Hill House. Next time I'm bring my foodiest friend from LA who will give them a hard time.\n\nI mean, come on: I can be a food snob, too. But at least I'm nice about it. 5 stars for the food and timing of the service. 2 stars for the feeling I had while I was there. So that's an average of a \"3.5\"", "author": "Noelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Yes, as an earlier review stated, this place is amazing. Chicken liver appetizer was creamy and delicious; all our entrees - chicken, pork chop and manicotti - were well prepared and presented beautifully. We split the panna cotta and Guinness cake three ways and we're glad we didn't do an 'either or' choice. Excellent cocktails too. Gonna make an excuse to go to Brooklyn again soon just to return.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Ok, to start--reviews that give 1 and 2 star reviews for mess-ups in their reservations, service that isn't actually the worst ever or high prices (when the prices have been clearly publicized beforehand) are remarkably unhelpful. This was why I was approaching this restaurant with very very moderate expectations.\n\nMy date was able to get a 9pm reservation on Saturday night for my birthday, though they were able to seat us at 8:30pm and didn't give us a huge hassle. The kitchen seemed a bit overwhelmed, but most issues seemed to disappear soon after we were seated. In the meantime, we started with cocktails at their bar (and the tab was easily transferred to our table). My date had a rye-based cocktail, while I had one of the bourbon cocktails. Both were delicious and a great way to whet our appetites. \n\nThe dinner menu is fairly simple (and probably all delicious), so my date and I settled on the charred beets for an appetizer with saffron yogurt. Oh my goodness, these beets were amazing--incredibly flavorful and tender, yet with a decent char formed on the outside (possibly from boiling then grilling in their wood oven?). The saffron yogurt sauce was delighfully tangy and mixed well with the sweetness of the beets and the other pesto-type sauce drizzled in.\n\nFor the main course, I ordered the skillet chicken with shallots and my boyfriend ordered the pork chop with farro. Since the chicken was a la carte, we also ordered a side of the brussels sprouts with maple and pickled chilis (which narrowly beat out the parsnip choice). The chicken was incredibly flavorful, buttery and tender, with crisped skin, and the roasted shallots paired very well. The pork chop...oh my God, my mouth is watering just thinking about it! The pork cop was perfectly tender and juicy and was full of flavor. Seriously, I couldn't stop stealing pieces from my boyfriend's plate (it was my birthday!). The Brussels sprouts were also amazing...a really nice balance of savory from the roasted Brussels, sweetness from the maple syrup and spicy from the pickled chilis. \n\nI'm not sure what other people are referring to about the portions...my boyfriend and I could not make room for dessert and left very sated. All in all, a great dining experience and great for a romantic, intimate date night!\n\n\n\n\nThe service was fine...our water glasses remained full, our entrees came out in a timely manner and we were offered a second round of cocktails.", "author": "Rachel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "great spot to have chill \u0026 quiet dinner. great food. great service. great decor.", "author": "Marissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "Clandestine in its style, but this restaurant is know to most. And well deserved so. The backyard is lovely in spring and fall and a nice cool space in the summer, if only they could keep it open in the winter too!\n\nMake a reservation unless you live in the area.\n\nThe food is good but the servings were small, I go for drinks here.", "author": "Kajsa W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-28", "description": "We were a party of six last night. We so wanted to love VHH.\n\nIn the end, it was not worth it. \n\nThe good:\n* Quirky interior - reminded me of Twin Peaks.\n\n* Great bartender - fabulous mixologist. \n\nWow, well that's it for the \"good stuff\"!\n\nThe bad:\n* I ordered a bottle of red from Aquitaine - a place I know the wine quite well. The bottle tasted OFF. I passed the glass to my dining companion and said, \"Maybe it's corked?\" The waiter chimed in with: \"It's not corked!\" though he didn't try it and he proceeded to pour. Well, the vote was unanimous. The wine was just wrong. It tasted bad. $47 for a bad French red? Nope. We sent it back.\n\n* Four of our entrees came out....and then the two of us that ordered the \"chop\" waited close to 10 minutes for our dinners. No explanation. No apologies. Our dining companions finished their meals well ahead of us.\n\n* Our side of bacon never showed up during our meal. I asked my companion if he still wanted it and he said, \"Sure why not?\" So it came after we had ALL finished our meals, and again, our waiter did not apologize for forgetting. And it wasn't comped either.  \n\n* Our waiter said that they would not make any substitutions on the menu ... even when ordering an entree. Really? My chop comes with grits but I'm on a low carb diet per my doctor and so I have to spend an extra $9 on asparagus? Really? I could see if there wasn't anything you COULD substitute with, but this was inexcusable. If there are no substitutions, it should be on the menu (and I do not recall having seen any such notation on the menu).\n\n* OK, but that $9 for was 8 or 9 very meager spears of asparagus. Very unsatisfying.\n\n* The chop was incredibly FATTY - not the best cut of meat. :( I choked mine down. My dining companion called for a doggy bag and said his Italian Greyhound could eat it instead. (Now that's saying something folks).\n\n* As we were a party of six, our neglectful waiter still got a full tip (20%?). Very unfortunate for us that he treated us so badly yet he got paid.\n\n$450 for the six of us including tip, and not including our drinks at the bar.\n\nI am so not impressed and neither were my dining companions.\n\nI am stunned by all the 5 stars here. You folks have NO CLUE what good service is like. I'll bet you're more fascinated with the fact that the Olson twins and Marisa Tomei have dined here than the quality of the food or service.\n\n*shakes head*\n\n-------------------\n\nPS, our waiter:\n\nMale, dark hair, side burns, glasses, working the front of the restaurant (and then Gloria took over at the end). Lucky for you we didn't get your name as I would plaster it here so your manager can have a frank discussion with you.", "author": "Linda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "If this were a brunch review, I'd give them 5 stars. But for dinner lately, I am getting over VHH. \n\nI am begging the chefs to start putting more accessible items on the menu. You are alienating your core customers. I don't want lamb neck. Or a whole fish WITH bones to eat around. And then you leave me with only two other options. One of them always being the pork chop- which I never want as its like having a mouth full of fat. \n\nThe dinner menu has become way too specialized. Or at the very least, you need to find a way to be commercial and also make amazing food. \n\nI used to go to VHH two times a month. Their menu choices have me going once every six months at this point. I only hope they read these things.", "author": "Shane B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "AMAZING.\nTo start, quaint and authentic space.\nAmazing cocktails, we tried most of them, all were wonderful.\nThe food is to die for. We had a good variety of starters, the truffled risotto special was OUT OF THIS WORLD.\nThe wine list has some real gems, I was excited to find some nice Medoc and CDP offerings and at a reasonable price point as well. \nI cannot wait to go back this place is truly spectacular.", "author": "Anthony I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Why is this place not getting more love?! The red wattle pork chop was the single best piece of pork I've ever had in my life. I'm writing this review over a year later, and I still remember it being one of the best things I ate all year in the city (I eat out a lot too). Incredible, and can't wait to go back!", "author": "K K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Absolutely charming. Great vibe, food is delicious, small and friendly. Not so many tourists since you have to know this places exists - usually by word of mouth.", "author": "Zoe W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-11", "description": "Went there for my birthday. The restaurant was mostly empty yet they decided to sit the 4 of us in the basement/cellar. Guess they didn't want brown faces on the main level scaring away all the customers... cough cough racist.", "author": "AJ S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "Beautiful spot nestled in the charming Vinegar Hill district in Brooklyn. \nThis place feels a little out of time. \nWe had great and tasty food, and a lovely bouteille de Brouilly, best Bourgogne wine on earth to me.", "author": "Grégoire B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-29", "description": "Quaint and charming. Even on a rainy day I ventured out to Brooklyn to meet a friend. Without Google maps, I would have been so lost.  I ordered a sourdough pear pancake, which was literally 1 huge pancake haha and my friend ordered the Sweet potato hash which came with green tomatillo sauce and had an interesting cumin flavor. It was cute and the service at the counter was quick. If I am in the area again, I would come back but I don't think it was worth the 1 hour+ commute.", "author": "Linna F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-24", "description": "Tucked away on a street I'd never have visited,  in a neighbourhood I had never heard of, the restaurant was full on a Sunday at 3 when I stopped in for a late brunch, Despite the desolate surroundings, I guess many others had read the same rave Infatuation review I had seen that week.  Full marks for the cheese grits with pork (I am no grit expert but these were so much tastier than other grits I have had). The biscuit was spot on too.  Cocktails were pretty decent, and the service was fine despite the general exhaustion of the staff bought on by an unexpectedly busy day.  If they'd have had real coffee (espresso) I'd give them 4 stars.  But they don't. So come on guys, spend $300 on a coffee machine and turn a good brunch into a great one.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "Jul B. likened this place to Freeman's Alley, and I could totally see the resemblance. Arriving to this place past Dumbo is  like a small journey in itself. The house is situated on a beautiful cobblestone of a dead end street. We were super apprehensive about getting actually getting in (walked in on a sunday night 10 pm). I give them an extra star just for accomodating us, without a fuss, 30mn before closing hours. \n\n Very nice and warm ambiance. Loooove the rustic decor. They had some nice antique pieces on the walls .\n\nOn to food. No apps or drinks. Only entrees \u0026 dessert. While the details on the dishes seemed appealing, the number of items to chose were limited. Our waiters was helpful though in pointing what was good. I settled for the twice cooked veal breast while my fiance had the lamb dish. My veal came in huge portions. Enough to have a good lunch the next day. Yet, it lacked flavor to call it an excellent dish. My companion raved about the lamb, which i barely remember now. \n\nFor dessert, had the Guyiness chocolate cake. Very good. Perfect end to our meal. \n\nIf i'd have to come back it would be for lunch.", "author": "Annie T."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}