{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "We got there in time for brunch.  We ordered the blueberry pancake and the asparagus omelette plus drinks and everything was great. The pancake was so sweet that you could probably get an instant cavity--ha!  The omlette was super light.  All in all-we will try this place for dinner next time.", "author": "Rai S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-28", "description": "Service is everything in the restaurant business, and unfortunately this place has terrible service. We arrived around 1:30 ish on a Sunday and waited almost an hour for seating. When we finally sat down, and ordered, we waited another 40 minutes for; tacos, poached eggs, fried oysters, and a hot dog. We also had 4 alcoholic beverages. The food was OK. And for a bill of 120 dollars for simple food, that could have been bested by anyone who can make a PB \u0026 J, the joke was on us. This was our first and last time here at the hill. I gave this place one star because the place had a nice vibe, and that was it. I don't mind paying big money for exceptional food, but this was just terrible. If  this was my business, I would focus more on the customers for repeat business, and serve food that is on par with the price.", "author": "Joanne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "My girlfriend and I went this past Monday night. And based on the past reviewers who had long waits and unattentive waiters, I'd recommend going on a Monday night because it might make a world of difference.\n\nWe arrived around 7:40 and there were several 2-tops and one 4-top available. We sat right away. As everyone has already said, the decor is fantastic, very homey and rustic.\n\nWe split the \"special\" bone marrow ravioli as our app, which was very good, and a great starter to whet the appetite. She got the chicken two-ways and I got the Red Wattle. As a jew who doesn't really eat a lot of pork, the red wattle chop was utterly delicious. It was so moist and well-seasoned. The chicken two ways was really good, but yeh, she took half of my chop. It's a good thing I am a generous guy. We got the two sides, cheese potatoes which were creamy and delicious and the brussel sprouts, equally good.\n\nIt's not an inexpensive meal, but if you have some disposable income and want to go out for a really good meal, maybe celebrate something, VHH is where its at. And yeh, monday night seemed like a good night to go. Especially when you eat a table away from Steve Buscemi.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "What a quaint and charming little cafe. Came here for drinks and apps on a Saturday night with a friend after riding the ferry from Greenpoint to Dumbo. It has a very northern California feel to it. Super intimate and would highly recommend this place for a date night or to bring your folks to when they're in town visiting. I can't really comment on the entrees but I can say that the drinks and the tomato and cantaloupe salad that we shared were exquisite. We sat at the bar and were greeted by the awesome bartender Garrett who was really friendly, knowledgeable, and well spoken. My friend got an old fashioned while I got a dark and stormy. Garrett explained that they did not have ginger beer on hand to make my dark and stormy but instead he used freshly pressed ginger along with simple syrup to make what had to be the best tasting dark and stormy I've ever had! The fresh ginger gave it a spicy kick that has since set a very high bar for future dark and stormies. Next time I return to Dumbo I will definitely be returning to the Vinegar Hill House.", "author": "Alexis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "my cousins a chef here! It was good! Pancakes are yummy! Went here for brunch. Place is cute and classy. It's cozy! I love the decor.", "author": "Diane S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-28", "description": "An overall mixed experience. The food (brunch, never got there for dinner) is good quality but definitely on the pricey side. But what really surprised me is to see that the tip I left was adjusted by more than 5% on my credit card statement. You want 20% tip? Provide a service worth 20% tip and don't go adjust behind my back...", "author": "Julien W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "Yay, I'm a fan, but DAMN this is out of the way.  I kept expecting for a junkyard dog to try to mug us or something among the industrial loft-y type area.  \n\nSunday night, not much of a wait.  It was super toasty and humid because of the oven in there, but rustic.  very friendly staff.  small ever-changing scrumptious menu.  we B.O.O.B.'ed (Brought Our Own Booze) and that was sweet.  sitting at the bar, we struck up a convo with a couple of the staff, very nice.  They spoke of a private dining area downstairs with a fireplace that may become some kind of wine bar or holding area where you can drink while you wait for a table, etc.  that will be once the license comes thru.  \n\nMy advice: go here while you can still BYO. and expect a mad wait on Fri and Sat.  2 hrs is not a myth.  but once you're all the way out there, they pretty much have you.  as if you're going anywhere else.  ...", "author": "Joanna G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "My brother treated me to a birthday dinner here so I can't speak of the prices, but I've certainly no complaints about the food. As per usual with me and my food-envy I probably enjoyed everyone else's order more than my own (fresh linguine special; good but definitely last among the five entrees). The tilefish was real nice, but the cast iron chicken and the Red Wattle Country Chop were probably tied for Most Delicious; the former because it was really fucking good--super juicy, not to mention a hell of a serving--and the latter because it's so much goddamn fun to say even though I have no idea what it means. (It turns out to be pork chops on top of jalapeno cheese grits--not too spicy at all, just a mild kick. Super tasty combo.) I can kiiiiinda see the complaints about serving sizes here--kinda--but if you come here and make that criticism, I'm just saying, it's likely that you could stand to lose some weight. I know I felt overly full by the end, though awesome desserts (bay leaf custard and Guinness chocolate cake) of course helped. \n\nMy other brother noted, and I agree, that Vinegar Hill House would probably provide a more enjoyable winter meal than a summer one, not least because it could've definitely stood to be far, far more air conditioned, unless you were seated in just the right spot(s), where it was practically arctic. (Unfortunately, I was just a foot off from one of these sweet spots, and didn't realize it until after the meal was over.) It's also got a very homey, rustic thing going on that seems like it would be quite comforting on a blustery day. Then again, trekking here through snow and such must not be very much fun either, because yeah, this place is pretty out of the way, although clearly if you're coming here you know to expect that. Still, it is pretty far, and I am super lazy, so delicious as it is, I probably won't come by here very often. I could be the girl in I Spit on Your Grave, and if my assailants ran all the way here to hide, I'd probably say fuck it and just go cheer myself up with some waffles or something.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-20", "description": "Not great experience.  Had to send my pork back to be cooked more (as did many customers sitting near us) but once it was cooked more thoroughly it acutally tasted better.  I also found our waitress to be not that great  - said the pork was great because it was 'fatty'.  I grew up on a family farm where we had high quality pork and know that high quality pork is not naturally that fatty - (we went here two years ago on mother's day and never came back based on our experience).", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "Great find for DUMBO area. Awesome cocktails, wholesome food, great decor. Wonderful brunch spot. The wait could be tedious but it's worth the wait.", "author": "Mona K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-19", "description": "Love the location and the place. The food was good although my bf's pork chop was fantastic and my chicken was just fine. Staff ok, woman bartender had an attitude and it was undeserved. Overall, a good place and would go back to try a few other dishes.", "author": "Jill N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "4.5 stars for VHH if I was allowed.  Great experience.  Went here with a friend and started off with the duck liver mousse and an oyster special.  The mousse was spectacular, definitely get it.  However, the oysters were hit a little heavy-handed with what seemed to be chipotle.  I love heat, but it was a bit too overwhelming for the oysters.  They were still very good though.  For entrees we got the red waddle country chop (pork) and the pork bolognese pasta. The pork entree must be one of the best things I've eaten and I'm never blown away by pork dishes.  The pasta special was good but not up to par with some of the other things we had.  For dessert you have to get the carmel custard.  I got the creamsicle cheesecake which was good, but the carmel was just ridiculously amazing.\n\nDon't miss stopping by here if you haven't already.  Definitely one of the best places I've been to since I moved to the city a few years ago.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-25", "description": "What a disappointment!!! After frequenting this place for the last 3 years and considering it to be one of the best Brooklyn-style restaurants, my last visit to this place was a complete disaster. First, I ordered what used to be my favorite chicken liver mouse. Right away I could see just by the color and the texture that it was different, and the portion was smaller. And sure enough, it also tasted blend. For the main course I order their new variation on baked chicken. What they brought me looked like a take out order from Chinese restaurant. Two small barely warm pieces of chicken with a piece of lettuce and 3 small potatoes for $23. Those of you who remember their original skillet oven baked half-chicken would be horrified at that dish. It didn't look appetizing and tasted just like Pudgie's Famous Chicken. My wife had a lobster pasta that was just plain insulting. The pasta was store-bought (yes, we even asked them and they told us as a matter of fact that pasta is not home-made). So, store-bought pasta with what tasted like out-of-the-can souse for $16? I can understand mistakes in cooking, but these just show complete disregard for the customers and the food itself. And looking at the number of negative reviews, there is only one conclusion to be made - this place is going down the drain. Too bad, it used to be a real gem in that neighborhood.", "author": "Alex K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "I rarely give 5 stars because I rarely ever find anything worthy of the honorary 5 stars, but this place definitely deserves every corner of each star.  Everything about VHH is fresh and amazing.  Nestled in some boonie area of Brooklyn, this restaurant is definitely a hidden gem.  My first visit to Brooklyn will not be my last thanks to This place was recommended by Angela L.", "author": "Kelly L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-24", "description": "Vinegar Hill House was a huge disappointment.  For months I'd heard rave reviews, and gotten turned away due to the crowds and long waits.  I arrived with high expectations, and left pissed off.\n\nThe food *was* delicious - tagliatelle bolognese.  Unfortunately it's served in a portion that's at best half the size of what most adults would consider satisfying for an entree, and without even a little bread on the side.  Even the $11 glass of pinot noir was served in a surprisingly tiny cocktail glass.\n\nBut the real disappointment was the consistently unwelcome feeling.  Staff were tepid and indifferent.  The hostess asked me to sit at the bar, in spite of at least four unoccupied tables for two (which went unused through the duration of my visit).  Ten minutes after being given a food menu by the bartender, I had to ask her to take my order, which she did with obvious annoyance, as it interrupted her ongoing chat with her off-duty co-worker who was seated directly next to me at the bar.\n\nBy the time I finished my food and got my check I couldn't wait to leave.  I then hustled across dumbo on foot, directly to front street pizza, where I ordered a plain cheese slice - served on a paper plate, by real people without distorted perceptions of their own culinary (or social) importance.  It tasted damn good, and I left, finally satisfied.", "author": "Totem P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "Great place for dinning.  The place is great for dinner on any night.  The chicken entree and the bone marrow ravioli were delicious.  Also had the duck liver mousse as the appetizer and that was great as well.  \nApple pie was barely warm though so that can use improvement.", "author": "Rita S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "The food was impeccable, a nice variety of high quality ingredients prepared well. Our wait for five was about two hours, due to other patrons rude lolly-gaging. The hostess was kind enough to wave our uncorking (BYO) fee because of the wait. The chicken liver mousse had the consistency of melting butter, the pork with jalapeño grits were the highlight of the evening.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-20", "description": "Not to disagree but just to maybe state personal experience, I didn't think this place was expensive for what you got. The drinks at the bar (their strength IMHO) were $9 when you would have paid $12 - $14 in Manhattan. On top of that, the wine selection is notably inexpensive. I think the priciest bottle I saw was $54 and the one I got for $29 was perfectly good for that range.\n\nTake some time out of your day to get the pork chop here. I would say its the best pork chop I've eaten in the greater NYC area. I would put the one at Little Owl as a close second but still, this was the best. You could argue its a bit different because its in a light (and fantastic) sauce whereas the one at LO is really just all about the natural flavor of the pork but either way, its piggy heaven over here. \n\nAlso want to second all the positive comments around the chicken mousse. I was kind of thinking, since it was chicken liver, that I was going to sate some of the old Jewish roots but it really didn't do that. Its just a completely different thing - the bread served with it is outstanding and the sweet onions are off the charts.\n\nOne downside - the service isn't fantastic. Specifically the bartender had this whole 'cool' thing going wherein it seemed like he could hear anything and then just give you that slight head nod of confidence like \"I gotcha, no worries\" when in reality it seemed to mean, \"I don't care all that much - you may or may not get your drink\". Not the end of the world but could have been better. Table service was a bit better but just don't go there with your whole 'Manhattan impatience' thing (which I have a serious dose of). Relax and enjoy the evening. They're not in a hurry and nothing you do is going to change that.\n\nBack patio also a plus. I will return... 4.5 stars really.", "author": "Sean K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "So, of course, I'm in NY for a couple of days and decide that Manhattan cant be the only place I can find YUMMY food...so I hit up my good friend who is a dumbo resident and he tells me Vinegar Hill House is one of the best....and foodies agree...of course I go to the website, see some things that look great....know in advance that the wait is about 45 min on a friday night which is really not that bad, as the bar is very hospitable and the turn over on tables is very efficient. We sit down, in a corner, and get to ordering. I have to say the menu was full of things I can easily order one of each, and definitely full of surprises. This is a RUSTIC CLASSIC AMERICAN restaurant, as advertised. No frills, no gimmicks, REALLY great flavored, well put together, and really all methodically thought out. Had my friend ordered the Red Wattle and cheddar grits, I might have passed out, but we did go with a couple of heavier items. Both sides, Brussell spouts with Black beer, and Sour cream smashed potatoes could have been my entree. It was unbelievably tasty and I wanted to drink my potatoes. \nFor the 1st course we shared a clam pie, which, by the way is exactly that, a cute small pie, with clams and potato in a creamy gravy, you must have that if you go. everyone around us agreed and got it too, and you could see smiley faces everywhere!\nOur main entrees were, Bucatini with ramps and breadcrumbs, and Beef Cheek\nBoth were the perfect portion, and both were cooked to perfection. The pasta, al dente, fresh and homemade, and the beef cheek like a melt in your mouth short rib without the bone. I will get it again and again and again.\nFinally for our last course, Salted Caramel Creme with Coconut cookies. SWEET, SALTY and DELICIOUS. I don't have to say anymore, Just get it. and you will know.\nThe wine selection, complimented alot of their food choices, and this place really got me in a Brooklyn food exploration mood. I want to go back, and I want to find more amazing places in BKLYN! \nVinegar Hill, strange name, amazing food, really really cute restaurant. A joy to have had their culinary creations!", "author": "Risa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "I've lived around the corner from Vinegar Hill for about 8 months now, but haven't gone until today since the wait is always 1.5 hours.  I'm not sure that has any significant meaning to communicate to the owners in terms of potential consumers lost, since they always have a line out the door (literally), but it is something worth communicating to potential eaters: there is ALWAYS a line.  Take note.\nB and I thought of going early tonight to beat the crowd.  They open at 6 and we were there by 6:20... and they already had an hour and a half wait. How is that even possible?\nGood thing we have a \"bar\" (aka our apartment) around the corner to wait at... because there is literally NOTHING else in the neighborhood.\nWe sat down for dinner at about 8.  Based on the recommendations here, we ordered the octopus salad, cast iron chicken and pork chop. We also got the apple and cheddar salad and a side of brussel sprouts (since the $17 chicken gets you chicken... and nothing else).  \nVerdict: the octopus salad was good, the seasoning was lovely.... but the octopus was slightly overcooked and a bit chewy.  Not too chewy, and it was good... but not perfect.  The apple and cheddar salad was delicious... the grainy mustard dressing was a perfect complement and it was a perfect fall salad.  The chicken, despite its rave reviews here, was fine, but FAR from special.  It's chicken people.  Just chicken.  Nothing else.  That's it.  In fact, mine was under cooked (raw in the middle).  I sliced it and put it against the super hot cast iron skillet to sear it a bit... but really? You served me $17 chicken and it was raw?\nAll was forgiven, though, for the pork chop.  Sweet Jesus, it was divine.  Frank Bruni said this was the best pork chop he'd ever had and I'd have to agree.  It was really, really special. Served with cheddar jalapeno grits, it was just really stupendous.  Forget the chicken and get this.\nMy regret: I should have gotten the short rib instead of the chicken.  Take note, people.\nOh, and the guinness chocolate cake IS all it's cracked up to be.  Leave room.\nFinal recommendation: go on a weekday instead of the weekend.  An hour and a half wait for two at 6:20 (when we left at 8pm it was closer to an hour forty five) is too long a wait for any restaurant.  As the couple who left when they heard the new said, \"An hour and a half isn't a wait... It's a sign to leave.\"", "author": "Katie Z."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}