{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "If you can't decide what to eat for brunch, gather a group of friends and order everything like a fatboy.  That's what we did. No regrets at all.  *burp*\n\nArrived here around 12:30 and waited for half hour.  Once seated we were attended to by this lovely server. She was friendly and spunky. Best of all, she did not judge us by how much food we ordered. Bless her heart.\n\nI ordered the smoked trout sandwich.  It was sweet, smoky and at the same time had a bit of tartness from the apple.  It was tasty and thankfully not too heavy which allowed me to try everyone elses food *evil laugh*.  \n\nI also got to stuff my face with the following:\nReuben Sanchez  - amazingly tender beef\nGrilled steak special - topped with atchara (tagalog for pickled vegs) and poached eggs. pickled veg addition was genius.\nEggs \u0026 Tomatoes - so simple and sublime \nPancake with ricotta and caramelized banana - one word, DIVINE.\nPlus side dishes of sausage, maple glazed bacon and grapefruit\n\nThis is one of the best brunch meals I've had in awhile. Nothing was left. We devoured it all. \n\nNow I want to come back for dinner. Very soon.", "author": "Cassy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "don't you love weekending in the quaint covered-bridge towns of Vermont, or plankfloored bed and breakfasts in Amish country and countless otherworldly escapes that include dining at restaurants with wood burning stoves and cobblestone streets? yet we all know that stuff can get old fast once you start getting antsy and miss the buzz and electricty of the city...well what if you could immerse yourself in colonial architecture and cast iron service, surrounded by folk art, while keeping the farm-to-table fare and colonial treasures and never step outside Brooklyn, NY?  you can...at Vinegar Hill House.\n\nas you've read here before, farm house rustic decor abounds in this precious well-loved spot tucked away on a side street on the far north edge of DUMBO, otherwise known as Vinegar Hill. the only \"bad\" reviews i've noticed for this place refers to the long wait, and i can't speak to this point as my beautiful dining companion and i arrived 15 minutes prior to doors opening on an early sunday eve. we sat on the bench out front taking in the view and, much to our surprise, watched as a line started slowly forming behind us...at 5:15pm, on a Sunday.  that's when i set the bar pretty high as a place that draws this kind of attention had better deliver on its promise...and it sure did.\n\nstaff was extremely attentive, guiding us to a great wine selection and translating some of the unfamiliar ingredients listed in the menu descriptions.  we settled on the special starter- roasted oysters with pine nuts and chipotle drizzle, as well as a house brewed iced tea and a glass of sparkling rose.  for our entrees, we chose the duck with parsnips and cracklins, and the waddle pork chops with garlic rice. we ordered a side dish of brocollini with parmesan, and sat back to take in the distant crackling fire and quickly filling tables that began to buzz around us as we got lost in romantically-induced conversation while our food being prepared.\n\nas candles flickered and bubbles fizzed in my rosee. the oysters, too, did not disappoint.  warm and crunchy, the roasted pine nuts added texture to the chilled smooth oysters, and the chipotle drizzle felt like summer seashore meeting wild west...(note to self, recreate this at home!)\n\nboth duck and pork chops were remarkably UN-fatty (a feat for duck!) and densely rich with flavor, while extremely tender with each bite.  the garlic rice was simple, delicate, and oh so garlicky without being overpowering...A++!  the broccolini was a tad on the crispy side which i really loved, and the parmesan was a BIT too generous as its saltiness threatened to overpower, but the choice is up to you how much you want to add to each forkful.\n\none star off for notable absence of diversity in the cocktail menu, and lack of flair in porkchop presentation (both minor infractions, compared the experience as a whole).  the quality of the meat, produce and grains shone brightly in flavor, but looked decidedly boring on the plate.  however, our taste buds were so excited it didn't mean much but perhaps a sprig of green herbs or a drizzle of something orange (sweet potato? carrot?) with the chops would have been more pleasing to the eye...nonetheless, it was divine to eat, and here i sit salivating at the memory of it all.\n\ndessert was an oat-infused green tea, served in individual pots (best to order only 1 for two people as it easily pours 3-4 cups), and a shared slice of Guinness chocolate cake with cream cheese frosting.  LIGHT, FLUFFY, RICH...but not \"too.\"  I am generally not a fan of chocolate-flavored cake, but this was a delightful game-changer.\n\nTip: in colder months, i'd ask for a seat in the downstairs dining room.  it's very intimate, with a cozy fireplace and near enough to the kitchen that both culinary and wood burning aromas mingle seductively...it'd be a nice corner  to celebrate any romantic endeavor or dare i say, even propose marriage.  perfect for evenings when their colonial windows frost up around the corners, and the panes steam from all the pleasure being had from within its confines.\n\nAs you can see, i really am in love with this place. moreover, I look forward to returning to see what they offer up on their brunch palette.  Oh, the joys of life in Brooklyn!", "author": "Leslie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "I had Napa cabbage and salmon croquet (tad on a greasy side), and my husband had Boston lettuce and chicken, and we shared corn bread.  They tasted really good, but both of us got diarrhea!  I'm thinking maybe their oil was old oil?", "author": "Su S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "I can't say we actually ate here but it looks like a great dining spot in a rather barren neighborhood. We intended to dine here late night after watching a cool \"Night Flight\" demo (2,000 pigeons with LED's launched from the Brooklyn Navy Yard), but when we arrived the place was packed- 45 min wait. Interesting menu and nice vibes from this neighborhood eatery. Will try again. Suggest you try it too.", "author": "Joe G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Luckily, on this random and freezing Wednesday night, we were able to immediately grab a table and avoid frostbite. The entire place has the feel of a cozy cabin far away from the city. We were seated downstairs, right in front of the crackling fireplace, and it was perfect.\n\nThe most amazing and memorable dishes were the brussel sprouts, seared trout w/a deliciously crispy skin, and the chicken - tender, moist and full of flavor.\n\nAlso amazing was the dark chocolate torte. Comes w/ ginger ice cream. Decadent and incredible. \n\nAll in front of the aforementioned crackling fireplace. Perfection.", "author": "Lans S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-12", "description": "Went here on a Thursday night in December. It's exactly what you want to walk into on a chilly night. Lots of wood, warmth and an expert hand at the bar. I don't remember the name of the cocktail I ordered but it was good and my friend was smiling through his whiskey sour. \n\nWe ordered the lamb ragu papardelle...kapow! good. \nWe ordered the famous pork chop. It was perfectly cooked. Juicy, tender, a little crisp. \nWe had the roasted chicken breast. Again, perfectly juicy and tasty. \nLastly, we ordered risotto with black cuttlefish. I'm no risotto expert so I can't attest to the texture of it. It tasted overall good but I wasn't blown away like I was by the lamb ragu, my favorite dish of the bunch. I would have ranked the pork chop at the top but I have an attachment to the way my aunt cooked pork chops which was more adobo based and my tastebuds can't stray. \n\nI'll definitely be returning.", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-24", "description": "The food is fresh, seasonal and tasty- and the desserts are made from scratch.\n\nIt is however, overpriced for someplace so out of the way on a deserted street in Dumbo that does not seem so safe to walk in alone at night time.  \n\nI say this because even the food was very good, some of the dishes are a bit to 'simple' - like a salad that merely consisted of some raw shaved corn and bits of cheese and sea salt.  Perhaps I'm wrong but the whole point of going to a nice restaurant is to have food that required more skill and time than what you would otherwise make at home, not a dish that takes 5 minutes to prep.\n\nThis shouldn't deter you from visiting though, the food here is almost Craftbar caliber, and the restaurant offers car service upon request so you can get home safely.", "author": "Lara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Very nice, sheik and friendly atmosphere! The food is tasty but the cornbread is to die for. My friend and I definitely enjoyed dinning at Vinegar Hill. The customer service was warm and welcoming. We look forward to sitting out at Vinegar Hill again soon.", "author": "Theresa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Why are you off the beaten path? Oh I see, so that it isn't overcrowded and I can enjoy a good meal without waiting or needing to strain to hear conversation.\n\nt's on an adorable cobblestoned street on the \"far end\" of Vinegar Hill. The place is small, but very cozy and the staff is friendly. We ordered from their specials of the day - I got the \"Neptune Eggs Benedict\" which was lump crab on an eggs benedict, and my friend got an English breakfast of toast, beans and egg. \n\nCoffee is french press, and it seems like everyone was ordering it!\n\nAt the end, there was no dessert menu, but they did have a coffee mousse which was awesome! It totally ended a great meal perfectly.\n\nFor brunch, about $20pp with entree/coffee/dessert.", "author": "Joanna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-17", "description": "As expected from the Freeman's pedigree, the decor is colonial shabby with all the idiosyncrasy of the Sporting Club and veiled with a refined ladies touch http://www.yelp.com/biz_photos/BglFB3mkuo_PVtxdok4v3A?select=81TtUlliBRupeimBnQKCaA  But from the beginning, many elements of the night were working against us, let this be a lesson in the futility of the \"I know someone\" mentality, because even though we got hugs and kisses from the all right people, we couldn't get a timely table... but the birthday party in the basement, the surprise health inspector, and the diners who obstinately refused to move to the bar long after finishing their desserts even after the hostess offer them a free round of drinks didn't help either... so we waited well over an hour in the charming but cold courtyard while the hostess offered us the boorish table's free round(s).\n\nWe began with a round of salads; I was quite fond of my Bartlett Pear Salad ($10) with an oily slab of roasted fennel adorning a crown of baby arugula festooned in salty white nuggets of pecorino http://www.yelp.com/biz_photos/BglFB3mkuo_PVtxdok4v3A?select=TIPdVsBADeZGR8_tc3padw Personally I would have liked more pear less fennel but my friend felt the opposite so we traded some portions to adjust the salads to our preferences. I also thought my BF's crunchy mound of julienne young vegetables in the Shaved Market Salad ($9) was sapid and resourceful despite the fact that sharpness of caraway dressing overworked the plate just a touch http://www.yelp.com/biz_photos/BglFB3mkuo_PVtxdok4v3A?select=wKJCBygdqqw49TsuN771JA \n\nMy Cauliflower Ravioli ($13) http://www.yelp.com/biz_photos/BglFB3mkuo_PVtxdok4v3A?select=ajMl8jz8TKkeH4vrPBmqOA held the promise of delicious wonderment, but delivered the blandest puree of such an otherwise promising vegetable. The serving of this benign \"vegetarian option\" is an insult to the prefect sweet earthiness that develops with simple roasting of cauliflower; compiled with the wood burning stove there was no excuse for the lackluster of this dish. The chopped apples tossed with the pasta held all of the puckering tartness of a Granny Smith but none of the caramelized sweetness of mingling in a pan of brown butter that one would expect. The faint sprinkle of cheese teased the tongue into begging for salt but there was none to be had.\n\nMy friend/birthday girl involuntarily spurted out \"Are you kidding me!\" when presented her with a scant Black Pepper Tagliatelle with Pork Ragu ($15) http://www.yelp.com/biz_photos/BglFB3mkuo_PVtxdok4v3A?select=F6Kl9UuwKXMQZpt9bddAzw . We could see far too much of the ceramic dish around the flat pasta ribbons littered with grounds of pork, and it appeared especially meager sitting next to the butcher block of rubenesque Red Wattle Country Chop with fist-like jerusalem artichokes. http://www.yelp.com/biz_photos/BglFB3mkuo_PVtxdok4v3A?select=2pFvYfbF6IJ4kmqSnGxpGQ  Even so, the gentlemen claimed the shapely mound of chop was not as plentifully as it appeared as he separated the inedible fat from the meat and threw it aside like a wonderbra.\n\nThe pallid response to every pasta dish emphasizes that Chef Adamson has not finely honed her skills on this delicately and I hope she considers expanding the \"primi\" portion of the menu to include other culinary area where she is more adept. \n \nThe Mashed Potatoes ($8) http://www.yelp.com/biz_photos/BglFB3mkuo_PVtxdok4v3A?select=dsl0TfZHhPLMK6kbfU_xZg err on the side homespun; it has none of the decadent overt buttery fattiness that no one would dare add to potatoes in such flagrant amounts of at home. Instead it arrives with the texture of tiny potato chunks suspended in a dry low fat starchy mound that screams Idaho and tastes like the kitchen ran out of cream.\n\nBut for all of these disappointments, I must give the Roasted Delicata Squash ($8) my dearest accolades! The creamy richness of the squash puree coats the palette in savory sweetness and the toasty seeds sprinkled on top are a delightful counterpart of flavor and texture http://www.yelp.com/biz_photos/BglFB3mkuo_PVtxdok4v3A?select=fPvkHOzNa6_N-4pXAkYl2g If I ever return, you will know me when I sit down and order 5 serving of the squash and nothing else... nothing else....", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "Just dropped in here for brunch. The friend I was meeting tried to be nice to me by picking somewhere in Brooklyn, but this actually wasn't anywhere near where I live.\n\nOn the upside, I think it was worth the trip over though just for the pear pancake! More on that later...\n\nWe started with the fried oysters. I was a little confused by the oysters (I think of oysters as being very small) whereas these were more like fried sets of oysters a little bigger than you'd thing of a mussel shell being. I liked the sauce that came with them, he didn't.\n\nThen, we split the pear pancake (!) and the poached eggs. The pancake is about twice as thick as you'd expect and has a wonderful texture. It also has actual full pieces of pear in it. I'm not usually a huge syrup person, but it did go well with that pancake! The poached eggs were like you'd expect, and I really liked the spinach they were served over. Actually, I liked the particular bread they made toast out of, too.\n\nMy only real complaint was that the server kept asking me if I wanted more coffee (even though the coffee cups are small). I'm accustomed to people just giving me more coffee without interrupting and asking continuously. I can't complain too much about that- I'm sure he was just trying to be polite.\n\nAnyway- I don't know how often I'll be back (it was far away) but if you're going, don't miss the pancake!", "author": "Ellen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-31", "description": "Not a terrible place but not great and def not worth the hike to get there. Service is terrible. For a small restaurant, a lot of people work here but very few are actually doing anything. Trying to get the attention of someone for another drink is a task so I would recommend getting a bottle of wine. Cocktails and food were good but nothing special. People who think the pork chop is the best they have ever had need to get out more. Chicken was simple and well prepared- as was all the food. But you can get the same many places in Brooklyn for cheaper and better service. Desert was very good- lemon tart- best part of the meal.", "author": "Miranda W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-18", "description": "I really want to love this spot - it has ridiculously awesome ambiance, on an adorable street, with great cocktails. Unfortunately, the food is subpar and the staff is generally less than friendly. We have gone several times hoping it will be better. The last time we went was on my birthday, and it was a horrible experience - a rude waitress and food that got my boyfriend sick. The prices are too high to have a negative experience. Won't be going back.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "This menu is of the sort you scan and know that every last item will be delicious. Everyone around us was getting the potted chicken, but the two specials of the evening sounded too good for me to pass up: duck liver pate for an app., and lamb with various gradations of nutty pulses alongside it for a main. My friend and I started with bass croquettes and she got the pastrami plate for a main. Just as I had foreseen, each bite was full of distinct, rich flavors. The croquettes' aioli sauce was particularly phenomenal; the duck liver pate was oh-la-la good. And I have never tasted such tender, succulent lamb.\nThe waitress was superlative: she anticipated our needing more toasted bread for the pate, and brought it even as we were starting to wish for it. She also recommended, on my request for a \"spicy cocktail,\" the Vinegar Hill, which hit the spot so well that I ended up ordering three of them.\nThe ambience is perfect here: no loud music, constant influx and outflux of patrons so that it's never either empty or packed to the gills, and always interesting people dynamics going on around one.\nThe desserts are very light and refreshing, as befits the end of June. I had the goat cheese panna cotta (which had nice touches of basil, tomato, and gelatin cubes that somehow all went well together), and my friend had the pistachio ice cream. Yum!", "author": "Kathleen H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-28", "description": "I refused to be influenced by the few negative reviews before going to VHH because the online photos of the food and interior look divine. In retrospect, maybe I should have heeded the warnings. \n\nUndercooked pork and $8 for corn with a pound of parmesan sprinkled on top? That's cray.\n\nAnd damn you, cold-blooded butch waitress..", "author": "Katherine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-23", "description": "My new favorite restaurant! I have already been here at least 4 times in the past month and a half, and undoubtedly will visit it again soon. You honestly can't go wrong with any of their menu offerings - bourbon pancakes, egg and tomato, french press coffee for brunch (and a swan song to get the party started). If you find yourself here for dinner, do yourself a favor and order the charcuterie board (OMFG), and order the roasted chicken and a side of potatoes. This is undoubtedly Brooklyn's pride and joy.", "author": "Lindsey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "I really liked this place, great food, drinks menu and service - a cool location. We got a few dishes to share. I only discovered it via locals, but will definitely go back when I'm next here.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "I have eaten their twice and emerged happily well fed.  Their parsnip side order was especially wonderful and their ocean trout special was dreamy.   \n\nThey do some odd adventurous stuff with their special appetizers and deserts which may not always work out.   If you think \"I like rye bread so maybe I will like rye cake.\"  the answer for me was no.    They certainly get my vote for imagination.  \n\nResist having more than one cocktail or you will not be able to manage the cobblestone sidewalks.", "author": "Andrea K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-19", "description": "It might be that I'm getting old and less and less enamored with everything \"Brooklyn.\" I went to Vinegar Hill House recently, and I basically turned into a cranky old person from the get-go. \n\nI mean, it was a Tuesday night and fairly early (7pm) and the back was almost empty. They wanted to cram us at a two-top, about four inches from the table next to us (at which people were seated) - there were some four-tops on the opposite side of the yard, but they refused to let us sit there. We opted for inside. \n\nSo we're seated. I think the too-cool-for-school attitude of the servers is obnoxious. I get that this is Brooklyn and formality is just not done - it doesn't mean that you can't be friendly or bother to crack a smile. (Also, from a style perspective, I think the jeans/loakers/flannel is absolutely ridiculous. But whatever.) So our server comes over, asks what we want to drink, my friend answers, and when I pause to scan the wine list quickly, the server walks away and returns maybe 10 minutes later with my friend's drink and to take my drink order. What? (As an aside: my $12 glass of wine came, and it had totally turned. Like red-wine-vinegar turned. Gross. When I mentioned it to the server, her response was, \"Oh, that's ok!\")\n\nI get that Brooklyn is casual - even at places that are charging $20+ for entrees. But damn - if a party of two is dropping up to $200 on dinner, service cannot be as casual as it was that night. You can do comfy and casual without service sucking - there have got to be standards. The service here felt like we were at some coffee shop - it's disrespectful not just to the customers, but to the quality of food Vinegar Hill House is known for.\n\nSo, re: the food. It was great. I had bass, and it was thoughtfully executed and prepared (loved the yogurt-based accompaniment). My watermelon/crab soup was also great, and dessert was awesome. Again, the service did not live up to the food and prices, and I'm convinced that it should. That was a bummer.", "author": "Dena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-29", "description": "I was telling a guy friend about a third date I went on...we were going to walk to a casual restaurant in Union Square when my date decided to jump in the car and drive to a surprise location. \n\n\"So where did he take you?\"\n\n\"He wanted steak so I thought we were heading to Peter Luger, but we arrived at Vinegar Hill House- I'd never even heard of it. It was so charming and the food was amazing\"\n\n\"Ha, Vinegar Hill House, I love that place- romantic. That's his move, he pulled out his big move...\"", "author": "Suzie C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}