{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-16", "description": "This place is just ok, I don't see the big hype which made me more disappointed after eating here. This place gets packed quick and there's always a long wait for a table.  Am used to portion size meals but this place is really cheap about giving you a decent portion size meal, especially for the prices they are asking for. On top of that the food was just ok was not wowed by any of the meals I had. I had the lobster pasta, a type of cod fish that they had( that was pretty good but I have had better) and some corn. Do not plan on returning here.", "author": "Andreina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "Perfect place for brunch in DUMBO. Charming atmosphere, reasonably priced and awesome service. Little hidden gem in a great neighborhood. Really cool place to impress out of towners!\n\nThe toast with jam and butter was perfect and the lobster omelet was also great. Everyone seemed happy with their orders... Good food and a bottle of wine make any Saturday afternoon the best!\n\nAfter eating so well and if the weather so permits, don't miss the stroll around the Brooklyn Bridge Park!", "author": "Marcos E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-30", "description": "Came here for brunch, the ambiance and décor is very quaint and loved the backyard dining (with the exception of my seat which was directly in the path of hot air spewing from the back of an AC unit).  Had the chorizo stuffed sourdough pancakes with pineapple salsa and the Reuben Sanchez sandwich with braised corned beef, sharp cheddar, tomatillo-jalapeno jam. VHH had been on my wish list forever even though I am a big borough snob and rarely leave Manhattan... but to be honest, think maybe just was overhyped as I thought it was good but not amazing or worth the trek out there.  Our server kept forgetting what we had ordered or whethger he had taken our order so that didn't help... but I know service can be a crapshoot.  I would try again for dinner, but only if I happen to be in area... I wouldn't make it my destination per se.", "author": "Jen J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "My boyfriend and I went for dinner a  few nights ago and really loved it. We wanted to get a drink in the area before but there is literally nothing in that area besides the restaurant. It worked out though because we ended up getting there early and they had a table outside in their courtyard for us to sit.\n\nWe ordered the house bacon which was very yummy. Beware that if you don't love fatty bacon then this probably isn't the dish for you. \n\nFor dinner he had the pork chop and I had the pappardelle and then we also had the cornbread with jalapeno butter. The best dish was by far the corn bread it was UNREAL!!! If you go you HAVE TO GET IT!\n\nOverall we had a blast- great service, cute outdoor area and the food was very good. I would absolutely go back.", "author": "Claire W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-25", "description": "To the owners of Vinegar Hill House:\n\nAs a Vinegar Hill neighborhood resident and an occasional customer of your restaurant, I feel compelled to write you about the terrible experience I had recently as a dinner guest at your restaurant this past Sunday night.\n\nDuring the course of our drinks at the bar and while eating dinner we were treated with outright disrespect and disdain by your bartender and the waiter serving us.  At one point during our meal, your waiter and bartender engaged in what apparently was a private joke between themselves about my wife and me, with the bartender leering from the edge of the bar while the waiter literally laughed in our faces. \n\nMy wife and I were shocked, embarrassed and incredibly taken aback at such arrogant behavior.  Unfortunately, this did not come as a complete surprise, as we'd experienced similar disrespect and actual contempt in a prior visit.\n\nI probably should have spoken immediately with the manager, but honestly, I think that may have gone nowhere but further frustration, particularly given the track record we've had with your restaurant.\n\nI'm writing this email a few days after the incident, in part to ensure that I'm not over-reacting and have had a chance to cool-off, but I'm still as angry as Sunday night.\n\nAs a member of the Vinegar Hill Neighborhood Association (VHNA), I've heard and read complaints about how the staff and customers of your restaurant treat your neighbors.  Frankly, I was surprised by how much resistance you faced during the expansion of the Hillside Cafe.  But after my recent experience, I have complete sympathy with those neighbors who are offended by the behavior of your staff.\n\nI can assure you that I will never again visit your restaurant as a customer, and I'll do my utmost to ensure that my friends, neighbors and colleagues understand how your staff treats customers and neighbors.  And as a member of the VHNA, I will be sure to be a vocal and critical voice of any future plans your restaurant has that might affect our neighborhood.", "author": "A C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-12", "description": "So disappointed. Came here with high expectations and left with an empty tummy (small portions) and a puckered mouth (far too salty). \nWalked into a relatively empty restaurant around 6.30 on Friday night to be sat downstairs without a soul. When I asked if all the tables upstairs were reserved, the host replied with \"kind of.\" I've no idea what that means, but when we left all those tables were still empty. And I think being downstairs was partly why we were somewhat ignored. \nI came here with a vegetarian guest, who had read on their website that despite the limited vegetarian choices, the chef would adapt dishes to suit. When we asked the server this, she replied with a grimace and said she'd strongly discourage that on a Friday night as he wouldn't be happy with said adaptation. Why you would go out of your way to add this to your website if this isn't the case I don't know. \nSo we order off the menu, 2 entrees and 1 side. We've already told our server that we have a show to be at and so are tight on time. 45 mins later we're still waiting for our food. When we ask, and state again that we have a show, she goes away and comes back 5 mins later to tell us it's being plated. 5 mins after that we finally get our food and the check. At this point we should already leaving for the show so we have have to rush, meaning I don't get to finish what's already a small portion. We get an apology and a drink knocked off the bill, but for $65 I was hoping to leave at least full - and not gasping for water from the over-salty chicken. \nAnd like I say, walking past those still empty tables on the way out was somewhat frustrating. This place is not in a convenient location, so you do have to go out of your way to eat here. And it's pricey. I wouldn't waste your time. \nAdditional point to make, it has a B grade, if you follow that kind of stuff.", "author": "Jackie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "The watermelon crab salad was to die for and everything was so rich and uniquely flavorful. Small plates work well because there are too many decadent choices in the menu to choose from. Great wine list and very warm decor. I'll be back!", "author": "J D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-18", "description": "Horrible. We saw some positive reviews so we gave it a try. My lady and I are self-described restaurant afficianados, trying new places in Ny \u0026 NJ fairly regularly.\nWe were first told to wait at another location, 2-store-fronts down the block until a table became available. 1st disappointment: The coffee was AWFUL; watery, tasteless.\nNext, the brunch: In a word, \"YUCK\"!!\nMy lady showed me her dirty fork with dried-up ketchup in it...she then showed it to the \"waiter\" who promptly explained, \"oh..that's just Tarnish (in ketchup Red???) because it's silver...\".\nUh...yeah.\nNext comes the ordering: \"I see you have omelets, cheese, bacon, etc. on the menu; can I please have a bacon cheese omelete?\" \"No. they wont do that\".\nhmmm...ok.\nSo we each order the same \"Apple Pancake\" with sausage on the side (which wasnt sausage..it Was a mini-hamburger, salty and over-cooked).\n45 minutes later our 1 Pancake each arrived...BURNED! BOTH OF OUR DISHES!!\nThe waiter stunk, the food stunk, the coffee sucked, and then the bill: $38.00 for SUCK.\nNever going there again.\nIn a word, it sucked.", "author": "Dean B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "Basically best brunch in Brooklyn. Pancakes will fuck you up for life.  A simple egg sandwich will blow your mind.  Beautiful interior.  Date spot.", "author": "Lipton L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Amazing food great atmosphere and you polenta ox tail is a magical food moment, if you love food this is the place to go!!!!", "author": "lilia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-29", "description": "My new favorite restaurant.  Tucked into a cute little residential street, you'd never know it was even there.  Went with a group of 4, and made reservations (they only take a few reservations every day, and leave most of the space for walk-ins).  The small place was packed (even at 9pm on a Sunday night), but we didn't have to wait long to be seated, and while we were waiting we just enjoyed the lovely little back patio.  The place felt very homey and welcoming- fantastic decor-, and given many of the reviews, I was skeptical that the service would be good, but our waiter was attentive, friendly, and on top of things.\n\nWhile all the food was incredibly good, some highlights from the menu on the night we were there include:\n-Braised squid\n-Cast iron chicken\n-Country chop\n-Mezze meniche\n-Salted caramel custard\n\nWe ordered several other items, and shared amongst the four of us, and, after all that, plus 2 bottles of wine, our bill was $200- I was expecting it to be much higher- definitely worth every penny.  Can't wait to get back there!", "author": "Amy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "Elegant American-Rustic Menu with some Brooklyn shmeared all over it.  There's usually a wait to dine here but generally worth it.  I don't know where the clientele come from -- it's seriously out of the way from everything, nestled a block away from a massive Con Edison plant and located in a place my friend calls \"The Land that Time Forgot\" due to the cobblestone streets\n\nI've tried just about everything on the menu and reccomend:\nthe Red Wattle Pork.  Tastes like the best pork chop you've ever had cooked in Bacon Fat.  Some Saurkraut there also but whatever\n\nShort Rib Pot-au-feu.  Mine was a tad dry but all I needed was a fork for the meal.  The meat was braised and slowcooked and came apart real easy.  Served with a strong brown mustard and sea salt and marrow.\n\nGrilled Octopus.  Fantastic\n\nButternut Squash Tart.  Unique, creamy, not too filling when split with someone else, good appetizer portion size\n\nI'm not a dessert guy.  But anyone who doesnt save room for the Salted Caramel Custard is a fool.  I almost ordered a second portion.", "author": "Roger K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "I have eaten here many times and have never been disappointed with a single bite! All of the dishes are delicious and so full of flavor. The pancakes at brunch are Thea best I have ever had! The staff is very knowledgable and full of life. Sometime their is a bit of a wait but it's completely worth it of such great food!", "author": "Allie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Perfection. Truly perfection. The beats were beyond amazing. I am not a fan of pork chops or loins or whatnot but I tried the apple glazed pork. Words cannot describe the sensation of joy felt inside my mouth. It melted the way great fish melts in your mouth. The apple cobbler fritter dessert was quite nice. \n\nOn a down note: it is tiny and the wait is quite long but grab a drink at the bar - best Manhattan in BK.", "author": "Leah K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-09", "description": "Super cool spot. Used to be a huge fan. But just recently I went with a friend for a late night drink (1 each), a cheese and meat board, one other small starter and one dessert. The bill was $95 pre-tip. Not cool at all. They must have raised the prices (unfortunately the menu is so small and the lighting so low we didn't add things up as we went, plus we dont usually have to!) To make matters worse, the food was just OK.\nSo, sorry to say prices went way up and food quality went way down. We're used to paying more for good food but this place left a bad taste in the mouth. Off the list!", "author": "Daisy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-12", "description": "I can't deny that pork chop. It was really, super, amazingingly, awesomely, wonderfully juicy and delicious. The bone marrow ravioli was so good I briefly considered licking my plate when I had finished.\nThe cocktails and wine list were also top notch. Good service from both the bartender and floor staff.\n\nThe other food was kind of meh, however. The wild boar shank was very bland. The fois gras terrine appetizer, though trying its best, was \"not interesting\".\n\nBottom line, I think this place is nice but overrated. Unless you live in the neighborhood, it's going to be a difficult trek for a long wait for just OK food. Unless you get the pork chop, so maybe it's worth a visit for pork fans.", "author": "Diana R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-29", "description": "This is my idea of hipster restaurant hell. A small, cramped, poorly ventilated space with dumpster-diving decor,  Upper East Side prices, overthought menu and underwhelming food.\n\nTime between seating and 1st course: 1 hour and 5 minutes. For roasted beets? Really? Time between 1st course and 2nd course? I don't remember. Still waiting for the bread I asked for 45 minutes ago.\n\nA star for the pleasant hostess and another for nice cocktails . The kitchen starts in the weeds, and stays there all night long.", "author": "Stephen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "I came here on a date and had a great time. I ordered a lamb dish and dessert after and I was not disappointed at all. I loved the ambiance.", "author": "Kan. J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-23", "description": "I'd eaten dinner here a while back and remember enjoying my meal as well as the rustic ambience, so I had high hopes for a return meal last night, when I came by with 4 friends. \n\nWe arrived around 10 pm and waited for an hour before being sat. Everything was going fine until my friend asked if she could order a side of grits (they came with the pork dish we had ordered and since she's a vegetarian, she was looking for other options). The waiter basically blew us off, explaining that they only serve girts with the pork and they don't order enough grits to serve as sides. It was 11:30 pm at this point -- and we were just about the last people who'd been sat -- and it just seemed so, well, petty not to say, \"Sure, we'll serve you a side of grits.\" It's not like we were asking for them for free; we wanted to pay for them. And the chances of them having a run on pork \u0026 grits at that late hour were slim to none.\n\nThen the manager (Mario) came over and was such a giant d***. I mean, he couldn't have been less gracious or interested in working something out. His attitude was revolting. Utterly revolting.\n\nClearly, customers mean very little to Mario and his unhelpful staff. SKIP IT!!!", "author": "Victoria G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "I had heard amazing things about this place, and when a friend booked a table for us, we were all quite excited! Whilst the place was definitely cute, the employees very friendly, amenable and patient given our very large party, the food failed to impress. A few had ordered the pork chop, while impressive in size, wasn't the tastiest of dishes. The rest of us ordered seafood and it was all okay, but just not as great as we had expected. Overall a good night as the restaurant had a wonderful warm atmosphere.", "author": "Em C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}