{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "Red Wattle Country Chop is AWESOME! and such a unique rustic + quaint spot.", "author": "Anna U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-23", "description": "I was really excited about trying brunch here... and really disappointed that I did. My sister, brother in law and myself strolled over about 1130 on a Sunday morning, a half an hour after they opened. About the only good thing I can say about this place is that they sat us rather quickly. However, we waited over 10 minutes just for menus to be delivered to our table. Tables that were seated after us received their menus from the same waitress who had obviously forgotten about us and then fed us some bullshit about a menu shortage. \nAfter ordering our food, we were further disappointed with unfortunately small portions. I ordered the caramelized banana pancakes, which aside from a very scant portion of banana and caramel, were rather dry. My bro in law ordered the special, which he said had decent taste, but seriously, appetizer sized. Even the juice, which was actually really good yellow watermelon juice, was literally a 4 oz portion. \nOverall, very disappointing! Overpriced for portion size, and lack luster service, at best. Oh, and really stupid stroller placement. They should have moved people's strollers out of the way, instead of leaving them in the middle of the already crowded aisles. Or at least folded them up. I mean, there wasn't anyone using them at the moment... \nI will not return or recommend.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-03", "description": "This is one of my favorite restaurants in NYC...HOWEVER, I'm just back from having dinner and feeling a bit cheated.  We had a big-ish dinner (4 apps, 3 entrees, 2 desserts, 2 bottles wine plus aperitifs--for 3 ppl) and the staff was VERY pushy to get us out...to the extent of trying to take away dessert that was half eaten when we still had a half bottle of wine left--and it was a Monday night without a big wait.  I work in restaurants and have for 10 years in NYC.  I know all about turning tables to make money, but this was excessive.  We were there to spend money...not sitting around drinking water without any food on the table.  I'll definitely go back, but the staff needs a lesson on when to push and when not to.  This was a prime example of when not to.", "author": "L B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "Went for dinner last night.  Terrific evening.  Food was fabulous.  Can't speak highly enough about the chicken liver mousse, oven-roasted octopus, and that dessert that's like a gourmet \"cinnabun\".  Really liked the deliciously tart key lime pie too.  Can't wait to go back for brunch.  Loved the relaxing, semi-rustic setting.  We were a party of 6 (with a reservation) and were seated right away.  Right up there with the quality of the food for me was the top-rate service we received.  The staff was exceptionally accommodating, courteous and friendly.  One of the best meals I've had in a while!", "author": "Sharon W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "I took my parents, who are somewhat picky eaters, for dinner here and they loved everything.  We ordered the cast iron chicken, the english pea ravioli, a pasta with rabbit special, a lamb special, a couple of vegetable sides, the leek and mozarella tart, and the salami and cheese plate, as well as wine.  Every dish was well executed, the meats were tender, the sauces were light but tasty.  We were also very pleased by the prices- dinner for five, including two bottles of wine, was well under 200 before tip.  The restaurant itself was charming and had a nice atmosphere.  They lose one star because the staff was a little unprofessional- the waiter especially seemed like he had just woken up from a nap and made a few little mistakes but nothing too big.  Overall we had a great time and I will definitely be coming back with my boyfriend- this place is a welcome addition to the neighborhood.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-14", "description": "Vinegar Hill has already been my favorite neighborhood in Brooklyn. And I went yesterday for my birthday and we showed up very hungry! That said, the stage was set for high expectation and Vinegar Hill House did not disappoint.  We arrived at 8 and were seated instantly.  The staff was knowledgeable and helpful. My guy and I shared pickled shrimp and an onion tart to start and then also shared the country pork chop and a rabbit pasta dish.  It was all great - but the chop was the standout, so perfect it was just ridiculous.  With all of that plus a piece of chocolate cake, one coffee and two beers, we came in at around $100 with tip included.  I think that is quite reasonable for such a lovely dining experience in a great spot.    I will definitely return.", "author": "Karen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-05", "description": "Lovely meal. This restaurant is incredibly charming, with a fantastic wine list and a menu that seems to be refreshed on a regular basis. The artichokes were delicious, as were the shrimp. Chicken was okay. All in all, a wonderful location and ambiance, worth seeking out and definitely will be going back.", "author": "Jon E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-23", "description": "This place has a great atmosphere. It can get very crowded but is worth the wait. The food is delicious, especially the fish. When not too packed, it feels like a European cafe. The portions could be bigger which is why I only gave it 4 stars.", "author": "Eva G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-13", "description": "I moved to DUMBO about a month ago and immediately started asking around about the best places to eat.  Several people raved about VHH so my boyfriend and I gave it a shot one night.  It was a friday night and we were seated in the garden with no wait.  The waiter was knowledgeable and attentive and the food was to die for.  I had the sole and my boyfriend had the pork chop.  The pork chop was insanely good.  We also had a farmer's market salad and octopus to start and we were in a trance while we were eating them because the flavors were so amazing and fresh.  We even stayed for pie and coffee (not something we would ordinarily do) because we enjoying ourselves so much.  I did get bit up by mosquitoes so I would suggest putting some Off on your bare skin or covering your skin if you plan to sit outside.  My boyfriend and I have been back for brunch which was really delicious as well.  I have a feeling I'll be dining at VHH a lot in the future.", "author": "katie b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "would be so nice if this was in my neighborhood. cute place, great back garden, solid food, very quiet street.  menu looks like it's straight from the farmer's market so will probably change frequently. we got the shaved market salad, i think with pea shoots, sugar peas, radish, feta.  the veggies were nice but the dressing was a little to sour. there was even a chunk of lemon meat in it.  thot it woulda been grapefruit so was a bit of a shock to eat actual lemon. puree pea-filled ravioli was very good.  interesting flavor, would never really think of eating a veggie pasta like that. both entrees were hits, cast iron chicken and red wattle country chop.  i had no idea what red wattle was but any chop should be good.  tasted like fatty-ish pork but was served medium, on cheddar grits.  red wattle is in fact pork and if i knew it was pork, i may not have ordered it because i have been disappointed in western prepared pork for the past 15yrs or so (unless it's pork belly).  so it was nice to have tasty western-style pork again.  the chicken was magazine photo perfect, including the taste you would imagine.  dessert butterscotch pudding with neiman marcus cookies was so-so.  pudding is good in small doses and i was kinda in the mood for cake.  would love to try brunch here.  we arrived fri around 8:30p and were told it'd be a 2hr wait. decided to hang around and snagged seats at the bar probably around 30min later. it's a small place and there isn't anything else close. reservations only for 6+ so have some back-up plans in case.", "author": "C L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "i live 1.5 blocks from this place so i have to review it. my husband i have eaten here 4 or 5 times in the short time that it has been open and we are never disappointed. it is a BYO at this point and that is just fine for our bill. the food is consistently de-lish and the atmosphere is comfortable. there is nothing stuffy or uptight about this place. i would not suggest going if you are a party of more than people. there is a chef's table that seats 6, but i would go in 2's or 4's at most. we love it! go early to sit quickly... good news has travelled fast...", "author": "Jocelyn S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-13", "description": "I went Fri, Dec 12. We got there at 7:30 and were promptly sat, but there had to be 40 people waiting within the hour...fire hazard indeed. The space is amazing, but the four of us were quite disappointed with our food and service. The waiter had a difficult time explaining the specials and how they were served, but that didn't matter. The cheese plate was tasty but at $20 I wouldn't get it again. The mussels were hit-or-miss. There has been quite a bit of praise for the chicken here, and three out of the four diners ordered it. Two had to send it back because it was raw near the bone, nothing like that taste of undercooked chicken! I got the pork shank, which was mediocre. The one thing that we noticed is the same we noticed when Jean was at Freeman's - the food is terribly underseasoned. The chicken and the brussels sprouts had not a trace of sea salt. The white beans with the pork were completely bland. Also, everyone keeps talking about what a great deal $15 chicken is...well it doesn't come with any sides - those are $7, and we found the overall prices to be a bit much for what we got. Our waiter relayed to Johnny about the undercooked chickens and we weren't offered any apologies or even a coffee on the house. The service was very slow...we waited half an hour in between dinner and being offered desert. I hope they get things worked out b/c it could be a great addition to the area, but for now money and time is better spent at a lot of other option in Brooklyn.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-06", "description": "crusty crusty waspy white j.crew money money. was a little taken aback by the scene.  bring your khakis and collared shirt.  Food was phenomenal but overpriced.", "author": "amy w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "very much enjoyed every aspect of my experience here. casual service, reasonable price point, familiar faces, eclectic clientele, very well concieved and executed menu. delicious. i find it amusing that a good number of these reviews tend toward the pathologically defensive, middle-of-the-road, nyc dwelling suburbanite. paradoxically, the throngs of said revellers are arriving in droves at such downtown spots as freemans or schillers or peasant, only to speak derisively toward the concept of cool that are hoping to one day be accepted by. i enjoy dining out for the experience as a whole; disarming the overwhelmed maitre d's with an ounce of kindness and patience, relieving the waitstaff by being prepared, polite, and succinct, and taking into account the established dynamic. it's a shame that in a city like new york, a place to be enjoyed in all it's dramatic splendor and idiosyncratic charm, there remains an air of  entitlement and an imposing sense of homogenic expectations. being a  journalist, and not a food critic, i can't speak with gastronomic authority. and being a middle aged new yorker, not a downtown twentysomething, i cant distinguish the progenitors or 'cool'. i can, however, being a person who loves my city for all that it is and isn't, say that i wish those who only love it in thier own image should make their image elsewhere. that way i wont have to wait 74 minutes for a table next time. i'd prefer to enjoy my martini(s) at the table or seated at the bar. they were sublime...", "author": "charlie S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}