{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "Pork chop. Everything is delicious and you will want to order two salads and a side in addition to the pork chop, but be warned that the pork chop, at a hefty $32, can feed three people. So if you are on a date, I suggest one salad and the pork chop and if you are really hungry, a side; Unless you want be rolled home. The fennel salad is all fennel so if you love that vegetable, then you should definitely order it. I enjoyed the special pea salad more because of the variety of peas (snap, english, and some other pea) and because creme fraiche and I think tahini was involved. MMM, fancy sour cream. Brussel sprouts were ok and again, tahini made an appearance. VHH is an adorable restaurant and a perfect way to end a day if one walked the Brooklyn Bridge and toodled around DUMBO. That was my original plan but Mother Nature decided otherwise and decided to shower NY with rain.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-15", "description": "I had high hopes for this place as we chose to try it for the first time for our Valentines Day dinner.  The service was great and the atmosphere was unique, cozy, and romantic. However I was very chilly on the lower level despite being in a room with a fireplace.  The food was honestly just ok. Nothing wowed me in the least.  The apple salad was just a plate full of sliced apples with a yogurt dressing.  The Cocoa fettuccine featured a delicious short rib ragu but I could barely enjoy it because the pasta was stuck together in a huge ball. And unfortunate, the tri-tip steak was chewy and a little cold. We had the prix fix Valentines Day menu so maybe the regular menu is better. It was a truly disappointing meal,", "author": "Lavon E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "One of my favorite meals so far in the city. From top to bottom this place is perfection. Do not leave without getting the chicken liver mousse, the country chop, and the corn bread. I'm still dreaming about this meal!", "author": "Kelsey J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "Good good great. Love this spot, on the edge of the navy yard, dumbo, and the Con Ed plant. The whole area has an industrial country vibe. \n\nI just ate this crazy brisket in corn bread with an egg on top. Wow. My tastebuds are exploding from the flavors.\n\nBrunch is great here. Staff is pleasant.\n\nYum!", "author": "Joe B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-14", "description": "This was possibly the most disappointing restaurant experience I have had in a long long time. Maybe ever!   I will start with saying that the reservation was kept and we were greeted properly and seated right away. That was the best part of the experience.  My wife and I had heard and read so many great things about this restaurant we were very excited to eat there. So next,  the very rude waitress  laughed at my hearing impairment when my wife asked about the kind of water we were going to order and I thought she was asking about the wine.\n  We were seated at a table so small there was hardly room for the food. A candle was knocked over to the floor when the bread basket was put down. Then, I had ordered the scallops for an entree. They  were without a doubt the tiniest scallops I had ever seen. Really, I am not exaggerating this just to make point and, they were cold. The hostess who I will say was very astute and recognized that we were having a problem,  quickly took my dish back to the kitchen to heat it. Well, nice try. The only thing that was hot when it came back was the plate!  By the way this was a very skimpy dish that cost $31!!!  This was at best an appetizer portion. After so much anticipation it was amateur hour and could not in good conscience recommend this restaurant to anyone!", "author": "Paul L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-01", "description": "That was a bummer.  \nA double whami, just tonight:\n\nWe had ordered an $85 \"special\" lamb for two:  lamb neck or shank.\nAnd \nWe got the strong eye-browed hipster waiter, again.  \n\nI thought to ask that we not be put at his tables, again.  But thought surely the place is quiet tonight, we won't end up on his side of the room...sure enough, we did end up there.\n\nSo we got the waiter that does not serve, and sure enough, he didn't ask, but brought us out the neck.   For $85.  Which was slightly dry and so I asked for more jus and yogurt sauce.  \n\nHe finally, asked how we were and I commented that he did not ask shank or neck, but just brought what the kitchen had.  And that it was dry.  For $85.  \n\nHe gave us $10 worth of dessert \"on the house.\"\n\nIt was far, far from $85 worth of braised lamb.  \n\nSad to see the love leave a beloved spot. ;(", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "I don't even know what neighborhood Vinegar Hill is - it doesn't really feel like Dumbo (though maybe parts of Brooklyn Heights), it's close to Fort Green but is definitely not Fort Greene. If anything, the walk to Vinegar Hill House reminded me of walking around Red Hook - it has that off the beaten path, tiny fishing village feel. That ambience carries over into the dining experience - it's a fairly small, tavern-type restaurant with a beautiful backyard replete with twinkling lights, ivy-covered walls, the works. Neither of us were starving so we split an order of the corn bread and then I went with burrata panzanella salad and my friend got a small order of the gnocchi. It was the perfect amount of food and everything was delicious, in particular the corn bread, which is served warm with honey butter. We also got the chocolate Guinness cake for dessert which was delicious, though could have used more frosting (but I eat cake for the frosting, so keep that in mind. Vinegar Hill House is a little out of the way but I already want to go back for brunch in the garden and for the famous pork chop, which I'm a little fomo about not eating.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-15", "description": "The service at this place is an absolute abomination. Run by apathetic hipsters who begrudgingly offer service pretty much only when asked, the wait staff hangs out by the bar socializing rather than tending to their tables. \n\nWe came here on a Saturday morning for brunch and it was fairly busy but you couldn't tell by watching the waitstaff. The hostess was actually more helpful than our male server for some reason. Our food came after the people who arrived after us and as noted by other reviewers, the  portions were small. But that part was fine. The menu was uninspired, the food over-salted and over-priced. My boyfriend ordered Eggs Benedict and the egg whites weren't even fully cooked. Our decaf coffee took a long time to arrive and when it did, it had grounds floating in it.\n\nThe place is hip, earthy, and has an old thyme aesthetic and the bathroom has a fun old feel to it. Were it not for the horrible service and mediocre food, I would have enjoyed the space.\n\nIn closing, this was the worst service I've received in NYC. I work in retail so I know how easy it is to act nice to customers - after all, it's a primary part of the job description. Here they are failing that part miserably; My experience would have been more acceptable if the waitstaff at least flaked off with a smile, but the attitude was downright unfriendly and entitled. I'll never go back.", "author": "K M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "This place is awesome.  I took my girlfriend there the other weekend and we thoroughly enjoyed it.  The cornbread is to die for and the entrees were very very tasty.  The restaurant is in a historic section of Vinegar Hill and the decor most definitely reflects this.  It seems as though somethings haven't changed much in the house for the past 100 years.  I actually found this place online by typing an address I had found on my great-grandparent's marriage certificate and the Vinegar Hill House came up.  So I had to check out this restaurant in this house where my great-grandfather had lived in 1915, when many Lithuanians still lived in Vinegar Hill.  I may be partial for this reason but I recommend it very highly and look forward to coming back soon.", "author": "John B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "No major complaints, but I have no need to eat here again unless others wanted to go. Three stars for the decent quality of the food, the cozy ambience, a great playlist, and the personable servers. The missing stars represent the sparseness of the menu, at least on a Sunday brunch day, some small portions, and inflated prices. Don't charge me $4.00 for a \"bottomless\" cup of coffee. Just give me a full cup of coffee in a normal-sized cup, rather than filling it up two-thirds of the way and putting it in a little cup. Charge me $2.00 for it, and we're good to go. An omelet with a few vegetables and ricotta, served with dressed greens on the side, should not cost $16. Although I enjoyed them, fried potatoes with sour cream and pickled hot peppers should come with those ingredients mixed together, not sitting on the side like condiments. Maybe these are nits, but bottom line, I left feeling underwhelmed.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "Quaint and intimate seating might lead you to believe this eatery is more rustic that it appears. However, this little restaurant packs a big punch!\n\nI had dinner this evening accompanied by a great wine from a truly creative and reasonably priced wine list. These thoughtful wines give a broad sampling of international flavors that match range of worldly influence appearing on the food menu.\n\nService was consistently attentive and knowledgeable about the menu, having zero hiccups all evening.\n\nEach dish is deliberately executed with innovative flavors and techniques. The house specialty, a fatty Pork Chop cut with green garbanzo, pickled blueberry and rustic potato salad sounds like it could be overly complicated, yet was surprisingly well balanced. The tagliatelle with ragu was a textural dream with rich flavors that satisfy any pasta craving.\n\nOur evening ended with a play on smores with a chocolate mousse topped with brûlée marshmallow.\n\nIt's worth the money for a special evening. Attentive and delicious.", "author": "Carrie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "Bwahahahahahaaaaa... 5 stars to counter the complaints about service. It's a solid 4 star place based on my night there- maybe I got lucky service wise.\n\nSo many reviews about the pork chop and bitching about fat...\n\nLet me clue you into something...Pork IS about FAT.\n\nNow, here's the story... I had dialed it up to 900 watts and rode 50 miles the day I went to Vinegar Hill House.\n\nI had gotten home from my ride, relaxed a bit, hydrated, etcetera, etcetera...\n\nThat's when the FAMISH set in. A light-bulb fizzle-flashed in my brain and the overwhelming URGE to eat a SLAB OF MEAT burned through my cerebrum.\n\nPork. Pork Chop...to be exact.\n\nSo, I went feverishly reading about to find a pork chop in Brooklyn, 'cause I was dropping off my daughter in the area for a party, and up popped Vinegar Hill House.\n\nI drive to the joint with the lady in tow after dropping off my girly, we were immediately taken in by the décor...soft, warm, cozy, nice ambiance. Beautiful copper top bar. We were seated right away by a pleasantly charming and easy on the eyes hostess. Not much later our laid back, yet attentive, waiter showed up and went through the basics- water, vino selection.\n\nWe started with a Georgian bottle of red called \"Pheasant's Tears,\" which proved to be the ideal match throughout the meal. Tannic, juicy, fruity, and funky with earth. lmao. I never had a Georgian wine so it was kind of a must do.\n\nFor appetizers we started with the Arugula salad and the Roasted Octopus. Great salad, dressed to perfection, nothing overwhelmed anything, a lovely parmesan, some nuts whose pedigree I do not recall, etc..\n\nThe octopus was excellent, perfectly roasted, nice and crusted on the edges and not a bit of game, perfectly tender. Octopus is a bit of an obsession for me, when it's done right it's incredible, otherwise I frikkin' hate it...nothing worse than when it's chewy and fishy like so many places do it. It's the violin of cephalopods. Anyhow, killah 'pus...My only complaint... NOT ENOUGH OF IT!!! Three wee bits of tentacle. Throw 8 on the plate...OCTO...not a TRIPLEPUS...\n\nAnyhow... for the main courses I already knew what I wanted, the SO went for the Bone Marrow and Saffron Risotto...Off the hook good, you can't go wrong with sautéed marrow, saffron is just rocking, and they must of snuck a killer smoked gouda or some Cypress Grove Midnight Moon cheese in there...it had this great nutty-sweet crunchy quality and it was dusted with parmesan on top as well. The rice...Perfect. Not a split grain, I make a mean risotto and I know restaurants have to take shortcuts and split grains is the usual result...it completely screws up the mouth feel. I'd like to know their method for curiosity's sake; well done.\n\nNow....The Pork Chop. The \"Red Wattle Country Chop.\"\n\nThat pig was sublime... it told me a story with every chew, \"I ate these nuts \u0026 fruits, I rolled in this grass, took a loverly mud-bath then CRACK!!!! I'm on your plate...\"\n\nThe pork was sweet, juicy, full of depth, a perfectly micro-thin crust on the outside, I loved the grits- just enough cheesiness without overwhelming the pork and a wee bit o'kick from the jalapeno. Nicely sliced and presented thusly; I wish they had plated it with the entire bone, I like to gnaw on them at the end, sates the carnivore I am.\n\nWe finished off with a cheese, fruit, and homemade cracker selection. The cheese was a French triple cream of forgotten origin.\n\nAnyhow, in short, I found the service to be welcoming and attentive, and the food was well executed. The octopus appetizer could have been a little larger, especially when you consider the price but, other than that....a thoroughly enjoyed meal.\n\nI'll be back.", "author": "Martin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Rustic American fare with a Southern twist, this is basically comfort food raised to restaurant level. And the food is really tasty. Come for brunch and try the sourdough pancake. Prices are not all that cheap but this charming little place always delivers. DUMBO needs more places like this!", "author": "Simon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "SO FREAKING GOOD!! A gem in Vinegar Hill, short walk from Dumbo. Food is excellent (try the Gnocchi), perfect lighting, chill, good jams, great staff, yummy cocktails!", "author": "Ben G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "I've eaten here multiple times over the last few months for brunch and dinner. Consistently good, fun waitstaff and cute interior. It's worth the Uber trip to get out here.\n\nIf you go for brunch you need to try the sourdough apple pancakes - the sourdough starter is years and years old!\n\nGet on their mailing list for exclusive whole-animal and special events. We went to a Red Wattle Farms whole pig event - a meal to remember!", "author": "Victoria M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-23", "description": "1. There were no reservations available before 9:30pm, yet the restaurant was half empty the whole time I was there from 7:15-8:45pm. This was frustrating, because I would have liked to reschedule\n\n2. The hostess would not seat my husband ON HIS BIRTHDAY because I was running 10 minutes late.  This is *with* about 10 empty tables\n\n3. The portions are ridiculously tiny, and I'm a lean woman who is used to eating at haute cuisine restaurants.  I filled up on grapes once I got home, even after a cocktail, splitting an app, eating an entree, splitting a side dish, and splitting a dessert.\n\n4. Our waiter was inattentive to us, and when he should clear our dishes or take our order, I saw him like four feet away DRINKING WINE and chatting with the other staff behind the bar.\n\n5. That said, beyond those distractions, the food was good.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "I don't understand all of the buzz surrounding this place. I found most of the food we ordered to be average -- with the exception of the pork chop, which was very good. The drinks were *carefully* measured out and, at $13 a pop, over priced. The ambiance seemed to be more of an attempt to hide the chipped paint and age-worn walls than a mood setting technique. \n\nI would recommend you try the place if your in the neighborhood and you've tried everything else. It certainly was not worth a cab ride from south of DUMBO.", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Came here for Valentine's Day brunch. Really enjoyed, we sat downstairs in the basement with the fireplace. Obsessed with the Green Thumb cocktail and the pear pancake.  Can't wait to come back when the weather is warm to sit outside :-)", "author": "Linda Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Great food but small space. We had to wait 1 hour for a table of 5 but understand it was weekend brunch", "author": "columbia s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "Amazing food, atmosphere and great staff. Highly recommend it,\nGet the corn bread. Also love the chicken.", "author": "Ariston N."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}