{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "For every bad review I write, I must also write a good review. (Unfortunately there are a lot more bad restaurants out there than there are good one).  Nonetheless, Vinegar Hill House is certainly deserving of all five Yelp stars... and then some.  Just about everything with my experience there was spot on.  The ambiance, the food, the service... all fantastic.  Yes, the entrees cost $20 - $30, but you get what you pay for.  Good stuff!  My only slight complaint (and as a musician, I am without a doubt overly sensitive), was the music selection.  Enough with Pavement.  At least it was quiet. Though I might have preferred some Ellington or....  Whatever, I loved it there.  Thank you, Vinegar Hill House.", "author": "Marcus S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "One of the best joints in all the boroughs. I love the the pork slab. Ive been 5 times and it's almost always good.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-31", "description": "First things first, Yelp there are two identical entries for Vinegar Hill House Restaurant, please consolidate.\n\nI realize that heading out to a recently NYTimes reviewed restaurant on a Friday night that does not take reservations is going to be a gamble, but we waited nearly two hours for a two-person table.\n\nWhile I may be mistaken, the complimentary glasses of wine we were offered in exchange for the wait appeared to be house red served in tumblers instead of the wine we selected.\n \nThe food was far below the breathless reviews I've read online and I would expect an honest attempt to seat us within 90 minutes.\n\nThat being said, the restaurant has a nice look and expansive backyard that should allow you a better opportunity to get seated when it's dry out. That or a twenty dollar bill...", "author": "JD H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "I have to say this is my favorite neighborhood restaurant. The best pork chop I have ever eaten. The only way it could be better would be if no one knew about VHH so it would be easier to get a table.", "author": "Michael E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "after many rave reviews from friends, i finally ventured out there for a bday dinner. the spot truly is in the middle of nowhere, so battle for a spot at the bustling bar, bc you're in for a wait! \n\nupstairs, the ambiance is warm and welcoming.. downstairs, where my party was eventually seated, is less polished and cramped. at least there's another bathroom on that level to avoid trips up and down that knee-breaking staircase. \n\nfood highlights:\n- bone marrow ravioli: delicious unctuous filling encased in slippery pasta\n- pork chop: yes, it's pink and less cooked than i'm accustomed for pork, but the deep flavor and tender chew was fantastic. \n- pommes aligot: mashed potatoes with cheese curds folded into it.. creamy, gooey and super addictive.\n\nonly ok: \n- charred octopus: brian leth's dish at le grand fooding was my absolute favorite, but at the restaurant, the same ingredients just didn't live up to my memory. cooked nicely and very meaty, but the flavors weren't popping at all. \n- special foie gras terrine: had a weird flavor from the lentils... earthy gone very wrong\n- brussel sprouts: WAY too much fish sauce! \n\nso, i really wanted to LOVE this place, but i can only say i like it and will come back... maybe in the spring to enjoy the cute courtyard garden.", "author": "Jacquelyn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-09", "description": "This is honestly one of my favorite places in the city.  The environment is quaint and intimate, I didn't even feel like I was in the city! Its the perfect place for a date or a night out where you actually would like to hold a conversation with someone.  My boyfriend had the risotto dish and I had the lamb, both were AMAZING. Wine is great, food is fab, everyone who works there is professional and personable, I HIGHLY recommend this place to anyone, especially fellow Brooklynites.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Always great! The lamb neck, though it sounds odd, was delectable!  Great spot for two. I would avoid for large parties, as it's a small, cozy spot. My favorite in Dumbo, by far.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-12", "description": "Came back for brunch on a Saturday (yea the hours are wrong on Yelp) after an AMAZING dinner experience. \n\nWith the Wattle Chop fresh in my mind and my mouth primed for the taste of the Cast Iron Chicken, I was slightly disappointed. Not really as much by the food but rather by the service. \n\nAt 1pm on a Saturday, the restaurant had a more upbeat air to it as the sun was out in full effect. Unfortunately, the staff didn't share this sentiment. While not brash and unresponsive, they were more aloof and condescending, waiting for you to make the next move while flashing a disingenuous smile. Now, the food came out quickly and they were quick to the punch when we did manage to grab their attention, but they ambled about as if they were hung over (I don't blame them if they actually were :P) and the brunch staff just didn't brighten the experience of eating here like the staff did the last time I visited. \n\nAs for the food, when I took my first bite, it tasted more like a Reuben than the smoked fish (sable?) sandwich that I ordered. That's because it was a Reuben...which my gf had ordered and they gave to me instead (my sandwich took another couple of minutes to be served and I only took a bite after a couple minutes of waiting and insistence on my friends' part. See what I mean by lackluster service?). But the Reuben was thin and manageable... oily and flavorful and overall very delicious. My smoked fish sandwich was a nice play on sweet and smoky, and the apple (?) added a nice crunch to the texture. My other friend's Sourdough Pancakes with Ricotta and Carmelized Bananas was INCREDIBLE. Although not very big (maybe 10-inched across and single stack), it made up for it with BIG flavor. Definitely something everybody should try if you ever visit for brunch. We also shared a side of sausage (which comes in the shape of a flattened meatball) which was pretty good, and also toast (which was more an assortment of different breads) and quince preserve (which was incredible).\n\n4 stars for great food with \"meh\" service\n\nRevisit? For dinner", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "There's not much to say that hasn't been covered but as a guest in NYC and at Vinegar Hill here's my two cents. We also saw this on the Food Network and were inspired by the review of the Red Wattle Chop so when in the city in mid December decided to make the trek to Brooklyn to try the restaurant. We knew there would likely be a wait because they don't take reservations and, hello, it was recently reviewed on TV. We took the subway to York St. station and walked 4 or 5 blocks to get  there, an easy walk even in the cold. We had to stand at the bar with a cocktail for 40 minutes or so but it was a Friday night around 7pm - primetime for dining so we were prepared to wait. This gave us the chance to take in the ambiance and it is charming; rustic yet warm, crowded but homey, almost cozy. The food was as advertised; all delicious with substantial portions. I can't imagine how anyone could still be hungry after a meal here. We shared an order of the chicken liver mousse and felt compelled to ask if they sell jars of it to take away. Sadly, they don't which is too bad - this is killer mousse. Next we had the pork chop which was fantastic and cooked to perfection. Moist on the inside, crisp exterior and dripping with juices. The jalapeno grits were very yummy, too. We also had the brisket with marrow and it, too, was delish: moist and falling apart.  We'd made a special trip to eat here so of course we forced ourselves to try dessert; salted caramel custard and the apple bread pudding. Both were very good but the stars of the meal were the liver mousse and the wattle chop. The service was quite efficient as we were attended to by several different staffers over the course of the meal. \nThe price, $126 tax in for two with cocktails and wine seems completely reasonable for city dining and the quality and quantity of the food. $25 for a pork chop does seem slightly high until you see the size of the chop and plate. Then you taste it and realize it's a bargain.\nBottom line, it was well worth the effort to get there from the lower East side where we were staying. From other reviews we may have been lucky to wait less then an hour but our experience was about perfect.", "author": "Karen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "We  went here for the first time today - and it will NOT be the last!  We came in at 2 on a Saturday for brunch - we were told it would be about a 15 minute wait for a table (very reasonable) or we could eat at the bar.  We opted for the bar - the bartender was lovely - he made me a DELICIOUS bloody mary and my bf had one of their signature cocktails.  Both drinks were superb.  For the meal I had the tacos, and he had the hot dog.  Both were AMAZING!  the hot dog was homemade and covered in bacon, mayo and lettuce and the tacos were awesome, delicious tortillas, ground beef, cheese, lettuce and sour cream!  We also split a side of the roasted potatoes with sour cream and tater tot poutin.  It was all excellent!  I see that there are some mixed reviews below and I don't understand why.  Our meal was lovely and we cant wait to go back for dinner!  The staff, especially the bartender were very friendly and could not have been nicer to us.  I would give this place 10 stars if I could!", "author": "Valerie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-11", "description": "Great brunch.  Super cozy fireplace room in the basement.  Amazing wine list.  This is my new favorite restaurant.", "author": "Sloan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-18", "description": "I've heard recommendations to this place from friends, and decided to stop by for brunch last weekend with my hubby.\n\nThis would probably, and very surprisingly, be one of the worst brunches we have ever had.\n\nThe place is very cute, and we loved the decor. Great service too! We looked at the menu and excitedly made our selections as we were starving. \n\nMy husband ordered the Sunny Duck Eggs.. Granted, this might have been the wrong thing to order as he has not tried duck eggs before. The dish was inedible...  not only because the egg was overly runny and very gamey, but it was on top of dry, oversalty friend bread that did not seem right for human consumption. \n\nI was battling between the Asparagus Omelette and the Tuna Melt.. Decided to go for the tuna as I always get omelettes for brunch. Ah, the disappointment! \nI believe when a restaurant makes classic, homey dishes, they should try to go above the cut and create something special.. In this instance I received a bread slice topped with oversalty, mushy, mayo laden tuna salad that was still cold and tasted like the fridge, topped with, what seemed, processed cheese product. A small bowl of, again, over salty tomato soup.. and to crown it all, a super salty, mushy pickle, which is probably the worst type of pickle you can buy at a grocery.. There was no care, and no artistry.. and the dish was so over salted that I could not have more than a few bites. And I like salt!\nAs we were trying to eat our dishes, I saw the omelet arrive to our neighbors table.. and granted I did not try it, it looked like the worst omelette I had ever seen.. Pale, soggy, and without substance. \n\nGranted, we both may have chosen the wrong dishes.. or it may have been an off-day at the kitchen.. But it was horrid! To the point that there was absolutely nothing positive to say about the food. We loved the vibe, and would love to have found a treasure in Dumbo... wondering if this was just a one-off, or the dinner may be better?", "author": "Reka N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-14", "description": "definitely as good as it gets. we had a 30 minute wait for brunch which usually annoys me a bit, but as soon as we sat down everything fell into place. the interior is adorable!! old and quaint with nice details everywhere. the service was nice, but not in your face and the food was AMAZING!! i am a really tough customer and i was expecting a lot and i was very pleased with everything. i had the poached eggs with cucumber and olives, ginger grapefruit and my date had the ricotta pancakes and sausage. everything we ordered was spot on. i can see where the smallness of the place can become a problem since it's so popular, but make a reservation for dinner or come at 11 when they open for brunch and you're golden.", "author": "Linney K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-10", "description": "awesome hipster chill earthy place with incredibly fresh and tasty food! came with 2 other girls for brunch, sat outside at their cute patio on a perfect spring day and enjoyed...\n\nsmoked fish sandwich - perfect light and flavorful with chopped eggs and granny smith apples\nsteak and poached egg special - juuuicy medium rare\nangela's sourdough ricotta pancake with bruleed bananas, shyea read that twice and try not to drool\n\neverything was simply cooked, not too fancy pancy, just right with friendly service, good prices, get there before noon to avoid the brunch wait. Can't wait to go back to try dinner", "author": "Angela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Brunch review- quaint, out of the way find (at least for manhattanites) with delicious food! Small space with authentic and rustic charm, sourdough pancakes baked over open fire were the most unique I've ever tasted- do not miss this! Roasted potatoes come individually made in a mini cast iron frying pan- perfectly seasoned. Worth a trip out for the brunch, spend the rest of the day wandering dumbo or by the river! Can wait to try dinner!", "author": "Ash C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-03", "description": "Delicious and scrumptious brunch! We ordered the maple bacon. I had the special fried egg, ham, cheese and aioli breakfast sandwhich.  Hubbie ordered the pankcake. Everything was sooo good. Can't wait to come back and try dinner!", "author": "Katie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-05", "description": "Ate dinner here last night and enjoyed it immensely.  \n\nWe were a party of three and ordered three apps, three entrees and the two deserts.  Our apps were duck rilletes, a kale tart and a beet salad.  The entrees were a braised pork hock, braised lamb ravioli and roasted striped bass.  The deserts were a poached pear and some type of cake (carrot?).  Presentation was beautiful, fitting the decor and serving size modest but satisfying.  Everything was, or appeared to be, cooked in their wood fired oven - made the experience only that much more homey and charming.  \n\nOnly one complaint - an almost complete lack of salt used throughout every preparation.  The rilletes invariably need to be well seasoned due to the copious amounts of duck fat involved (the dish was saved by the inclusion of some nice mustard), the kale tart lacked any salt in the pastry and kale is notorious for sucking up allot of salt.  The beet salad was good but could have bee spectacular with a sprinkling of crunch fleur de sel on top.  The entrees likewise needed that finishing or correction of salt to push them over the top.  The deserts not needing salt were Delicious.\n\nBring a salt shaker and your own wine and go.  This place is great and will only get better.", "author": "Jason A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-02", "description": "I love this place -- out of the way but always bustling. The service is not always perfect but it's usually pleasant and they try. The food is delicious. I think brunch stands out above all. It sounds simple, but the salad greens are often the freshest and most delicious you'll find in any restaurant. If you arrive for brunch right at 11 there's no wait!", "author": "Dominique T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-24", "description": "Went here last night with the family. Apps were delicious, Highly recommend the tomato tart and the octopus. For dinner we had the cast iron chicken, 2 porkchops and the pasta. Pasta had way too much butter sauce. Pork chop was delicious but tons of fat, chicken was okay, had much better at Hill Country. Caramel custard was very different and good. Service was pretty terrible though. Never heard the specials or was given bread until I asked and our server spoke so low...very strange. Also, she grabbed the menu and check with my credit card out of my hand which was extremely rude. Not sure this is a place i'd give a second chance.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "The nice little walk to the restaurant sets the mood, on the same precious cobblestone block you see other small artsy storefronts. This area reminded me of a Savannah, Georgia for some reason, maybe it was the abundance of trees. \n\nWhen you walk into the restaurant  you are surprised of how cozy and nicely decorated the restaurant is. We sat at the bar,  and observed the people, they all seemed so comfortable in the space; I thought the place was full of regulars. \n\nThe bartender, was friendly and gave his honest opinion on dishes and the specials of the day. The menu options were very creative, a combination of some rarities and staples. Wine and beer selection complimented the overall style of the dishes, although adding a nice draft option would be appreciated. \n\nI had overheard some customers say that the fish that night \"was on point\". I decided I needed to try. \nIt was unbelievable, really delicious, nicely crisped skin, an incredibly indulgent meaty fish. We ordered the asparagus side dish, that was a little too salty.  We also had ordered the house salad to balance, that was very tasty as well.  We did end with the Guinness chocolate cake, completely unnecessary, I guess if Guinness were a cake this is what it would look and taste like; not impressed what-so-ever, super dense, hard, and dry. \n\nI will definitely return and experiment with more options. Meanwhile, I thought that it provided a great ambiance to talk and spend time in eating great food, without feel pressure to leave.", "author": "Nina M."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}