{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-12", "description": "Food was very meh, we ordered the following:\nSpicy Green\n- Best dish due to the fried lemons - enjoyed it very much.\n\nBraised Octopus\n- Meh, the broth has some sweet thai taste, but there's no spice or anything else to back it up. Just tasted very fruity.\n\nDuck Liver mousse\n- Meh, had better liver at Blue Ribbon Izakaya, nothing wrong with it, it's just not very creamy and most people probably have had better.\n\nBraised Lamb neck\n- Underseasoned, needs salt.\n\nRed Wattle Country chop\n- Underseasoned and a bit undercooked, needs salt\n\nChamomile Ice Cream\n- Decent, thought the grapes were unnecessary, didn't really go well with the Ice Cream.\n\nThe service was mediocre at best, the usual skinny jeans service -we are better than thou... Very disappointed with the food --especially the meat treatment. Would not go back.", "author": "Leo S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-08", "description": "I've never written a Yelp restaurant review, though I eat out at least twice a week. In turn, I usually do not rely on reviews in case they are too subjective or based on factors that have nothing to do with the meal (e.g., the weather, the company, your day at work etc). \n\nThat being said, I feel the need to comment on our meal at the Vinegar Hill House. This restaurant has a positive, long standing reputation throughout the city and not just Brooklyn. I question whether it's deserved. \n\nThe food was just fine and the staff was nice. But only just fine. And NOT worth the price given the size of the portions. \n\nI do appreciate the farm to table aesthetic that has swept the dining out scene. But go to Redwood Luncheonette in Chelsea instead (I know no one there and have no personal interest in that restaurants success). They do it better and they don't rip you off.", "author": "Craig N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "I have been here a handful of times. It has been great every time. IF you get there and need to wait for a table, just grab a drink and sit in the back garden. If you want to go for brunch, get there early or you might be waiting for a long time.", "author": "May G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "On a rare occasion that we have a car, we sometimes like to venture to less than subway friendly restaurants.\n\nThe wait on a Sat. night seemed to go much more quickly than the 1.5 hour when we checked in around 7:20.  Lucky for US!  There were others waiting much longer.  Best bet go as a party of 2.  Resos are only taken for larger parties, I think.    \n\nWe got the appetizer special called the presse.  This was a delicious concoction terrine type of thing with mitake mushrooms, pork knuckle, foie gras and lentils.  Also, we tried the grilled octopus and this was also amazing.  Then for the mains we did the skillet chicken and the wattle chop.  Okay, I now understand all the raving lunatics that want to come to this place.  The sauce on the chicken was so amazing, making it one of my favorite chicken dishes ever ordered in a restaurant.  Both dishes were so awesome, it really does make you want to slap your momma!  Then everything finished off with the guiness chocolate cake.  The moist dense cake was topped with this amazing cream cheese icing that just had this amazing addictive quality. \n\nLooking forward to another return for Brunch and may find a reason to stay out there just to come back for dinner...", "author": "Caesar R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "Really, it's not easy to take simple \"comfort food\" dishes and elevate them to something delicious, unique and fantastic while keeping the comfort intact.  Many places have headed in this direction the past two years and few get it right.  Vinegar Hill House gets it fantastically right.  The food is phenomenal: fresh, organic and local as much as possible, high quality, made with love and integrity with a dash of creativity.  Their cast iron roast chicken is a return-repeat dish for any season.  Menu does change every season or even every couple of months.   Red Wattle pork chop is also a solid year-round hit.  Brook Trout in late summer was fantastic - crispy skin, moist and flaky flesh, lovely herbs and veggies.  Brunch is also terrific.  You can go sweet, savory or a combination and everything is made with attention to optimum flavor.  \n\nIt's cute, small, but honestly quaint and real.  100% Brooklyn.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "Wonderful food and very confused staff. 20 minutes for the wrong drink, 35 minutes for the food. They comped almost the entire check, but we spent 2 hours theres. Sort of un-acceptable. Better luck next time!", "author": "Max Savage K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-15", "description": "Absolutely god damned scrumptuos and hands down impressive. I know a place is good when I kept going \"God wasn't that place delicious\" three days later. \n\nChicken liver Mouse topped with pistachios, Spare ribs topped with blue cheese, and Califlower raviolis with chives and walnuts and a brown butter sauce. I was floored. The raviolis, which I ordered, were my favorite. They were so tiny, yet one bit sent me off to palate la la land -- you know that place where you forget that its your mouth that's experiencing the pleasure and you wonder if it's really possible to get laid without knowing it in the middle of a restaurant. \n\nMy only complaint would be the drink list. The wine was a bit over priced. It was good, but not fantaaaastic. \n\nThe ambience was easy going and warm. This place is small and cute, and its location on a couple stoned Hudson Street makes it even quaint. I would return here in a heart beat and wish to god they had something like it in San Francisco. It truly was a big fat party of mouthwatering pleasure, and I could pay a lot more to have something half as good here. Lord I wish that wasn't the case.", "author": "Alexandra M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "Very cozy/rustic atmosphere. Wonderful selection of food and drink. The brunch menu for instance is very unique and dodges the typical items you're so accustom to seeing. Superb \u0026 knowledgeable staff. \n\nCompletely worth the trip from neighboring boroughs.", "author": "john M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-18", "description": "Absolutely precious.\nWith 84 reviews before me, its hard to say anything original.  Went for a late brunch during the absolute torrential downpour last weekend.  The cozy ambiance, friendly service and DELICIOUS food certainly made my day a little more sunny.\n\nWe ordered four meals and two sides (bacon \u0026 sausage) between the three of us because we couldn't decide on anything.... so just chose everything.  I felt like a proper heffer when we ordered, but after everything was served it seemed perfectly portioned. So, as mentioned in previous reviews the portions are not so large.\n\nAll of our dishes were delicious.  My friend who hates bacon (I know, right?) couldn't keep his paws off my side order it was so yummy. Our pancake with ricotta \u0026 banana was sinfully good. Felt more like a decadent dessert than a brunch option.  Was a little strange to see a singular pancake though....am more accustomed to a short stack!\n\nOur waiter was spot on with his recommendations, present but not hovering - and overall just a lovely gent.\n\nCan't wait to go back for dinner.", "author": "Kelly W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "The iron cast chicken is crispy outside and juicy inside, the sauce is amazing for the price of under 20, remember to try the mash potatoes and succulent red wattle country chop as well. \nThe portion size was decent, ambiance was great. I recommend this place to everyone.", "author": "Sophie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "A friend recommended Vinegar Hill House, located in the DUMBO (an acronym first used by Seinfeld in a late-night show) section of Brooklyn.\n\nIt's a great find. The food is superb, although from the outside it is a downtrodden storefront. Inside, it's quaint, cuddly and offbeat.\n\nTo more important things - the food: it's imaginative, it's inspired, it's well-executed. Of particular interest are the appetizers. I had Manila clams, simmered in a curry flavored butter sauce and served with fried Middle Eastern bread. My hosts had a chicken liver mousse and aragula salad with very thinly sliced kumquats segments. Truly wonderful.\n\nThe main courses are also accomplished. Their signature dish is a tender, very finely prepared pork chop, served sliced with a bracing sauerkraut. My lady friend enjoyed a rabbit ragu served with papardella. I had the cast iron chicken. It was uniformly cooked with a crspy skin, supported by a vinegary sauce - nothing extraordinary, though. As an observation, there should be a choice vegetables either as part of the entrees or as side dishes. The restaurant is not exactly \"green\" friendly.\n\nWe shared the dessert - a spiced date cake with a scoop of sherbet. The Spanish wine, Priorat, was drinkable. Our waiter, Gabriel, was both helpful and cheerful. They don't take reservations. Go early; otherwise you will wait. \n\nI say \"Eureka.\"", "author": "solopiano s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "For better and for worse: VHH is all about the WTF moment.\n\nAs in --\n\nWhere the f*** are we?  \nWhere the f*** is our table water/appetizer/drinks?  \nWhat the f*** (walking all the way up Evans Street) is that mansion?\nWhat the f*** is in this cast iron chicken?\nWhy the f*** can't I replicate it at home?\nWhat the f***. Let's get the Guiness Chocolate Cake after all.\n\nMoral:  if you like the word f***, or simply crave a good WTF moment, come here. Especially at 6 when they open.  After that, you're risking service as out of view as the Navy Yard.", "author": "Natty G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "Had a great time at vinegar hill house.  Great ambience and I love there theme with the wood tables, servers dressed however that way, and everything very close.  Has a very comfortable, homey, rustic feel to it.  \n\nThe food is awesome.  My friends and I ordered different things and tried a little bit of each.  The chicken liver mousse was amazing and I'm not ever a chicken liver fan, but not as good as the chicken pot pie.  I had the bone marrow ravioli which was not bad but nothing to rave about.  \n\nAs entrees with did the cast iron chicken which was moist and full of flavor, monkfish with buttered clams, awesome, and...ok I forget what the third dish was, i wanna say boar shank, but I remember it was really really good.  \n\nFor dessert we had the salted caramel pudding which is always a favorite of mine and didn't disappoint.  \n\nOur bartender was great.  \n\nCan't wait to go back again!!", "author": "Kicy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-22", "description": "Everyone knows the story of the Emperor's New Clothes, but how many of you have heard the story of the Emperor's New English Pea Ravioli?  Listen closely, children:\n\nOnce upon a time, there was a beautiful neuroscientist princess living in a magical kingdom called DUMBO.  The princess liked DUMBO very much, but DUMBO's culinary offerings were limited, bland, and somewhat tourist-angled, and it made her sad because she loved nothing more in the whole world than going out to eat.  Especially if she didn't have to take the subway.  \n\nThen one day, it seemed the princess's prayers had been answered--a restaurant opened up within walking distance of her castle that promised to be just what she'd been hoping for--Vinegar Hill House.  Headed by a chef from a popular restaurant in a nearby kingdom, VHH offered a seasonal menu, classic cocktails, and a carefully curated mid-19th century decor.  People came from far and wide to dine at VHH, and they were creaming themselves.  \n\nThe princess was eager to try VHH, and repeatedly asked her handsome prince to go with her, but wary of the hype, this wise prince resisted her pleas time and again.  One rainy Sunday, however, the prince admitted that after having spent the weekend watching the entire first season of Dexter On Demand, the two of them could use a little air and a hot meal.  \n\nAnd so the incredibly good-looking couple strolled hand-in-hand over to VHH, where they were suddenly surrounded by plaid shirts and pork-pie hats.  They ordered cocktails and the scallop-bacon-leek tart, the latter arriving before the former, as the bartender was deeply involved in conversation with the patrons at the bar.  The prince and princess were not pleased, as they prefer to enjoy a few sips of an aperitif before eating.  \n\nFor entrees, the princess thought about ordering the Cast Iron Chicken, but changed her mind when she learned that it was literally just  $15 chicken, with no vegetables or starch of any kind (for this, one was required to order an $8 side).  She opted instead for the English Pea Ravioli, and there the evening went even more sour.  She was brought a plate with six ravioli that could not have been more than 1.5\" square and filled with what was almost certainly baby food.  There was no sauce--no butter, no olive oil, no moisture at all--just a few scattered peas and a sprinkling of parmesan.  \"Is this a joke?\" the prince wondered aloud.  Sadly, it was not.  His papardelle with rabbit ragu was somewhat tastier, but also came in an appetizer-sized portion at an entree-sized price ($15).  \n\nThe prince and princess left feeling duped but also amused.  Another hyped-up restaurant that the masses seem to be gushing about for no other reason than to appear in agreement with the hype.  As they began the walk back to their castle with half-full bellies, conversation turned to topping selection on the pizza that was about to be ordered, and they lived happily ever after, never to return to VHH again.\n\nThe End.", "author": "Becca S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "An exceptional meal. Leave room for cake. \n\nI though I'd had my fill of New Brooklyn Cuisine after the General Greene, which I think is way overrated. Vinegar Hill House is very much in the same mold, but the execution was much better. We had the sweet corn ravioli and braised short ribs for our main courses. Both were delicious and together were more than enough food for two. The highlight, however, was the Guinness chocolate cake with cream cheese icing. One of the most decadent things I've put in my mouth for a long time. Amazing. \n\nThe only disappointment was the chicken liver mousse which tasted just like it was straight out of a Trader Joe's package. Not bad, but I could buy it myself and eat it at home for cheaper.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-20", "description": "Oh Vinegar Hill House, it is a pleasure to know you. You are everything I want in a restaurant: gorgeous decor I would steal if not for my spaghetti arms, delicious food that I think about days after its been digested and walking distance from my apartment.", "author": "Lulu B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-15", "description": "Vinegar Hill House takes its name from the quaint cobblestone neighborhood that flourished alongside the East River in the 19th century and has since battled industrialization and development. The first notable restaurant to open shop in this small, sleepy district, is tucked behind the unpainted door of a retired storefront and bookended by windows that fog up like the den of a Dickensian tenement. \n\nChef Jean Adamson, formerly of Freemans, has managed to recreate the atmosphere of her former employer: an intrepid journey to a little known speakeasy hiding on a forgotten New York City street.  (A speakeasy it is not; however, currently, Vinegar Hill House is BYOB as they await a liquor license.)  Diners enter through an unmarked and see a J-shaped bar--first--and, then further, an open kitchen on the left and smallish tables that hug the front walls and the remaining space.  A larger dining table (comprised of 2 or 3 tables) is the furthest any patron could be seated from the door, and it is where my fiancé, a friend and I enjoyed our meal.\n\nThe whole space is shrouded in yellowed walls and the backbar contains a deconstructed pipe organ that belies the winnowed pathos of unassuming, hipster chic.  A large, stainless steel woodburning (?) oven in the kitchen undercuts that attempt, but details such as a vintage American flag, antique bottles and stainless steel skillets leave their impression.  The space appears, intentionally, to have been resurrected from cruel and thoughtless abandonment, and the menu reads with the clarity of the New England Primer.\n\nThe New England Primer was an A to Z reader, however.  The brief menu at Vinegar Hill House is just an abbreviation of New American cuisine.  Mussels, winter slaw, crispy chicken with a pan sauce and sides such as sweet potatoes and Brussel sprouts.  Three of us, eating there once were able to circumnavigate the entire menu on our maiden voyage.  A narrow menu is, in my opinion, preferable to those longer tomes that shield diners from their friends, but it also should be an ironclad guarantee of goodness and it ought to unite the staff in singular clarity.  This was not so.\n\nWhile we waited at the bar, the bartender (who opened and poured our wine into charming, tempered glass cups procured from the French school system) explained to us the specials and the cheese and charcuterie boards.  When we were seated, our waiter explained a winter slaw in remarkably different terms than his colleague (and closer to the actual item) but seemed reluctant or uniformed about the meats and cheeses.  \n\nAs for the food, many dishes were spot on.  A pork chop and rib came on a butcher block and was cooked to temperature perfectly.  The rib meat came of the bone easily and the chopped was splayed out with decorum.  But an appetizer of mussels was stringy and unappealing; the accompanying toast was scorched and insipid (rather than burnt and bitter) and seemed a poor--cheap even--substitute for the fries that make a moules frites so rewarding.  I wished I had settled, instead, for the winter slaw whose proportions of fennel, rutabaga and white cheddar matched the restaurants décor and mood instead of challenging it. \n\nThe chicken, the much talked about chicken, I should say, was as good as a chicken breast can be, but still chicken and the pan sauce was not easily applied sitting, as it was, beneath the bird on a platter that did not allow for easy dipping.  \n\nEverything was quite good, but the most glaring inconsistency was found in the sides and an obligatory pasta dish (aimed, probably, for vegetarians).  A plate of butternut squash ravioli was tasty, but served as an entrée (and listed as one) it seemed remarkably outdone by the similarly priced pork or chicken dishes.  My fiancé, who is not given to such complaints, was keen to remark on the paucity of the serving.  Meanwhile two earthenware ramekins arrived is discordant fashion.  The first was teeming with buttery Brussel sprouts daring each other to spill over.  The second was filled, rather unfilled, with three sad fingerlings of sweet potato, which hid behind the gunwales of the ramekin like timid deckhands in a storm.\n\nIt is a bit louche to dispute portions when discussing dining, but with the chef working the line these missteps.  As good and affordable as Vinegar Hill House is, it cannot afford such discrepancies.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-10", "description": "The fact that this place is not easy to find makes me like it even better. It feels like a secret hideaway with beautiful decor and amazing food served right to my personal wooden table, a secret hideaway that everyone seems to know about. There's no doubt that others feel the same way because the wait tends to be around an hour or more on the weekends. But if you come on a weekday you can get a cozy table or a spot at the copper plated bar and actually feel like this place is all your own. \n\nThe food is completely worth the wait, with a menu that changes frequently based on the local and fresh produce, you can always know your going to be eating something that  was well thought out, from farmer to chef. My favorites include the octopus starter, with charred lemon, olives and yogurt sauce and the butternut squash risotto, a light dish with big chunks of squash. For the quality of the food it is very decently priced with entrees under $25. The pork chop has been featured in magazines, television and blogs all over and is a comfort to eat, cooked medium rare and served on a rustic cutting board to match the decor. \n\nThe wine list is also a reason I love to come to this place, it's relatively small but incredibly well planned. You can get a great bottle for under $25, which is unheard of at any Manhattan restaurant of this quality. Their mixed drinks, though a little more pricey are both innovative and strong, something you feel you could have ordered from a speakeasy in the 20's. My favorite thing is to sit at the bar to eat a meal and have the bartender recommend a wine or cocktail for the course. They are always nice and willing to suggest new and interesting drinks, and share a story or two while they work. \n\nOverall, I love Vinegar Hill House. Especially on a Monday night when you can take your time and enjoy a meal without the crowd. Also it's nice to actually see the staff as people and talk with them, something that's harder to do on the nights where the wait can be up to 2 hours. I would suggest Vinegar Hill to anyone who wants to get away from the bustle of Manhattan and share a delicious secret.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-26", "description": "This place is pretentious and incredibly noisy, two of my least favorite things.  That said, the pork chop was amazing, as other reviewers have mentioned.  A little on the expensive side, not not wildly.  All in all, though, I won't go back -- my dinner companion and I had to yell in order to be able to hear one another, and that is not a relaxing evening for me.", "author": "Rose W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-05", "description": "Quite a trek.\n\nDinner (for 2):  Aviation #1, Sloe Gin Fix, Chicken Liver Mousse (excellent), Arugula Salad (excellent, love the kumquat), Braised Boar Shank, Clams, Sprouts (too complicated), Salted Custard (different and good).", "author": "Stephan H."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}