{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-04", "description": "Went here with friends when I happened to be in the neighborhood.  In the same vein as Marlow \u0026 Sons, this is a great place for cozy, wintry comfort food.  The downtown-rustic vibe is getting a little overdone these days but I won't hold that against them.  It also is significantly less expensive than this neighborhood and variety of restaurant could get away with charging.\n\nThe special of the night was a two-person steak dish, so my group of seven ordered four of them, and they were great.  The wine selection is limited but high-quality and inexpensive; the drink menu in the winter consists mostly of hot cider-ish offerings.  Desserts are excellent.  Overall it's an interesting, out-of-the-way sort of place -- so out of the way, in fact, that the staff openly offers to call a car service for patrons who aren't sure if they'll be able to catch cabs.\n\nOnly gripe: Service is slow.", "author": "Caroline M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-23", "description": "I'd give this place three and a half stars if I could.\n\nI was there on 12/17 around 8:30.  The wait was about 45 minutes for a table, but my date and I snuck in a bit quicker by sitting at the bar for dinner.  Which was fine by me, because a) the bar was decorated tastefully for Christmas, b) I got a great view of the tight, well-organized kitchen, and c) I could actually hear my date as I was sitting next to him, which would have been a bit difficult with a table between us.  This place is charming, intimate, and a bit romantic without being cloying, but it is certainly not quiet.\n\nThe place is BYOB, for now I guess.I wish I had taken better note of the menu, but I can say the food was very good but not great.  We had a free-form tart with vegetables and cow's milk cheese to start.  As other Yelpers have mentioned, it was very under-seasoned.  I actually second-guessed my opinion while I was eating it and assumed I got a few subpar bites-- but now that I read the reviews I see it is a common complaint.  \n\nFor the entree, I had a beautiful fillet of white fish (trout?) with smoked bacon and aioli.  It was delicious; no under-seasoning here, thanks largely to the thick smoky slab of bacon.  My only complaint was that the bacon was so charred it was difficult to cut through in parts, but otherwise a very simple and satisfying dish.  My friend had braised short ribs, I believe-- three gigantic specimens piled on a plate.   He devoured every morsel before I even finished my fish, so I think those must get two thumbs up.\n\nI can see this place having a great deal of potential.  I would certainly like to try it again in a few months.  Bring a good bottle of wine and a little patience to the door (and perhaps a salt shaker), and you should have a pleasant experience.", "author": "Romy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "Love the ambiance, food, and drinks.  I went on Saturday night with a group of 9, no reservations.  We were told there would be an hour and a half wait but we could wait at the bar or in the back garden.  Our whole group had not arrived yet and we were told by the hostess to inform her when our whole group got there.  The bar was so crowded so we decided to look at the back garden.   Also packed.  Our third option was waiting in front.   The rest of our group arrived and we were sat promptly. \nSome in the group ordered appetizers, and everyone loved them.  Main courses were ordered and past around the table so everyone could try.  I ordered the Swordfish which was perfect.  My boyfriend ordered the cast iron chicken and a side of beets which were both amazing.  Everyone was pleasantly satisfied.  Desserts were ordered- guiness chocolate cake and the caramel dessert.  Both were amazing.\nService was great as well.  Our waitress was very attentive and pleasant.  I may come back in the future if a group is coming, but I don't see it as a place that I would frequent often, mostly because of the location.  I do think that everyone should try it out though because the food is really amazing.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "Three of us enjoyed our first visit. We got there early - about 6 pm - to avoid the lines and crowds and were immediately seated in the garden area. It was a pleasant spot, although the bugs were biting.\n\nWe all liked our meals. The presentation is very good and portion sizes are Manhattan sized as opposed to Tom's Diner sized. We didn't feel the prices were too high.\n\nThe sardine is terrific. The pork chop dish was excellent. The shrimp cocktail was perfect for a summer night. The roasted peppers - can't remember the name - were delicious. The cheese plate with home made crackers was great. By the time we left, the place was packed and very noisy. I'm glad we got there early.\n\nI wish the web site would show a current menu. That would be very helpful when trying to decide where to go, as their menu changes depending upon what's fresh, local and available.", "author": "Shawn R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "Vinegar Hill was really cool.  I liked the atmosphere, the waiters and bartender were really polite and nice, and it was in an interesting part of Brooklyn.  \n\nI had the cast iron chicken with the asparagus.  I could have been more daring, but I think that if a place can do something simple really well, then it's a good place.  These dishes were very good - but not great.  Both were very simple preparations, which is fine, and both had very flavorful sauces.  The chicken was a bit dry and the asparagus was a bit ordinary.  I could have made the meal myself, but that's not a totally bad thing.  Overall, I was satisfied, especially because you get a bit of a discount for trekking all the way out in the middle of nowhere Brooklyn this place is.\n\nI'd like to come back here and order some more interesting things because I like the vibe.  But if I was served this food in a place that I didn't like as much, I'd think twice.", "author": "Jason J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-11", "description": "When we arrived at 6 on a saturday night, there was a line to get in while the restaurant was about to open.\nThe service was great, food was fresh \u0026 seasonal. \nThe best part were the desserts..very fresh, seasonal - dont miss it.", "author": "Pratush G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-16", "description": "We went to Vinegar Hill House last Friday night. We waited, and this is not an exaggeration, 2 hours and 10 minutes for a table (shame on us, really-- but the host/owner kept telling us that it would only be another 1/2 hour, and after an hour of waiting already, we felt like we couldn't leave!)\n\nOnce we were finally seated, we were ignored for another 20 minutes. Among the many items we ordered off the menu, the mussels were raw, and the chicken (which NY mag RAVED about) was totally dry- and served by itself with a single roasted shallot. \n\nOur food came to $94. And we were not comped anything from the bill, nor did the waitstaff apologize or even say goodbye when we were leaving.\n\nThis was literally the only time in my adult life that I've left a less than 20% tip. I've never written a bad review about a restaurant online- but I feel compelled to warn other people about it.", "author": "Lillie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Despite it being located in the middle of nowhere and a walk through a neighborhood that is one part decay and one part gleaming luxury condos, twas all worth it for these four following plates: \n\n1) Pumpkin ravioli (split as an appetizer - I do not recommend as a main plate if you're at all teeny bit hungry). It was so tasty that my friend and I nearly re-ordered it later as dessert. \n\n2) Cast iron chicken: You can't go wrong with this plate that everyone recommends. This statement might sound incredibly foul to all vegans and vegetarians, but the skin was so perfectly crispy! Mmm! \n\n3) Red Wattle Country Chop on a bed of homemade sauerkraut. Slightly on the salty side, but it was still delicious. \n\n4) Guiness chocolate cake: The cream-cheese icing and moist chocolate was a perfect combination.\n\nService was friendly if not unextraordinary. I sat at the bar while waiting for my friend and while I'm sure making a drink (which was very well made) takes concentration, a friendly nod and smile would be appreciated especially when each drink is in the 12 dollar range. I got there at 7:30 and there were plenty of open seats, but by the time we left around 9, it was definitely a busy crowd.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "A little after 6pm on a Friday night, we were seated right away. We started with the watermelon soup \u0026 pork belly. Corn risotto followed, which was tasty \u0026 well prepared. For entrees - the chop \u0026 cast iron chicken - so flavorful \u0026 juicy. We also had a side of grilled beets, which was very unique. The best part was dessert - guiness chocolate cake \u0026 salted caramel custard - the latter was one of the best desserts we ever had! Worth the trip!", "author": "Yukie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "Get there right when they open and your experience will be divine!  An overall amazing experience with fantastic cuisine.", "author": "Sara J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-17", "description": "Since they don't take reservations, we (two couples) walked in on Saturday around 8 p.m., hoping to get a table after a reasonable wait at the bar. We were pretty optimistic since the place seemed full, but not totally packed. However, when we asked the waitress how long the wait would be, she barely looked at us and spit out \"two-and-a-half hours\" - in a very rude way and with this \"how-do-you-even-dare-to-ask\" attitude! \n\nThe restaurant may have great food, but the service seems to be horrible (confirming what other reviewers said). It's taken off our list - luckily, there are lots of other great restaurants in the city where they appreciate your business and you are treated nicely.", "author": "Ingo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-16", "description": "A jewel.  Absolutely worth the trip.  For apps, loved the Tart and devoured the cheese board.  For entrees, the short rib was nice and the ravioli was lovely.\n\nThe charming and warm staff makes the experience all the better.  You will truly feel at home at the Vinegar Hill House.", "author": "Meryl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "I set myself up for disaster with this place.  I really did.  I went on Yelp and bypassed the 200-something excellent reviews and only focused on the really bad ones.  I dunno why I did that, but I wouldn't recommend it because I showed up for dinner at Vinegar Hill House early on a Friday night prepared for battle.  As most of the negative reviews here focus on small portions, a rude waitstaff and a terrifyingly smug and indifferent hostess, I wanted to be ready for any or all of the above.\n\nThat said, my date and I arrived around 6:45 on a Friday evening.  The hostess, who does indeed wear scarily unnecessary painted-on jeans up to her midsection and who does indeed carry an air of I-don't-give-two-shits-what-you-think-of-my-poor-fashion-choices-nor-do-I-care-about-anything-at-all-for-that-matter, greeted us at the door, took our names and said a table would be ready in about 10 minutes (despite the fact that there were a few 4-tops open and another 4-top that could have been broken down into two 2-tops, but I digress).  This was all fine as there were two available seats at the rather small bar and I felt like having a cocktail before dinner anyway.  We sat and the super nice bartender served us up some super tasty drinks in a super friendly manner.  So, for all those negative reviewers out there, they must have gotten rid of the asshole bartender.  Anyway, about 15 minutes later, that 4-top that could become 2 2-tops I'd noticed earlier was broken down and we were seated.  So far, so good.\n\nOur waiter was perfectly sane and didn't slack at doing his job in the slightest.  He was also perfectly nice, too.  None of the appetizers on the menu that night sounded very appealing, so my date and I decided to forgo any apps and first-course pastas and opted to order a couple of entrées and a couple of sides to go with our bottle of wine.  I ordered the Red Wattle Country Chop and holy hell.  Just, holy hell.  It comes sliced and most of the pieces were cooked to absolute perfection.  The sauce with the chop was nothing short of amazing but the pièce de résistance was undoubtedly the cheddar grits that comes with the chop.  The grits are to die for.  TO.DIE.FOR.  A couple of the pieces of pork were simply too rare for my liking, but I suppose that's all relative.  On the whole the chop is a win-win and I was satisfied with the portion size.  Full disclaimer, though: The waiter did tell me up front it'd be about 25 minutes for the pork, to which we said, no problem, but could we have some bread in the interim, to which he said, of course.\n\nMy date ordered the striped bass, which was, admittedly, quite small.  In fact, the table next to us was going to split the striped bass entrée, but when they saw how big my chop was compared to how big the bass was, they snagged the waiter and changed orders.  The bass is more like an appetizer portion, to be honest.   I didn't taste the bass, but my date said that it was decently cooked, although the lime dressing it was drizzled with was slightly off-putting.  \n\nWe shared the side of mashed potatoes and roasted brussels sprouts.  Do yourself a favor and get those damn potatoes.  They were nearly on par with the cheddar grits that accompanied the chop and reminded me of a warm and creamy potato salad.  I could have eaten 2 more beakers of those taters.  The brussels sprouts were an interesting choice as they didn't really go with either of our meals.  They kind of tasted like sprouts with Chinese five spice or caraway or something.  They just didn't fit, but we ate them anyway because that's how we roll.\n\nI was wondering throughout the duration of our meal at Vinegar Hill House when the bloodshed would come and when I would be met with all the truths of the negative reviewers' comments.  I was so prepared to be met with severe disappointment, but it never came.  Vinegar Hill House gets my vote for now.  But here's a tip: don't read only the few-and-far-between bad reviews before you go somewhere, especially Vinegar Hill House.  They didn't get over 200 positive reviews for nothing.", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-28", "description": "My experience at Vinegar Hill House was easily one of the worst experiences I have ever had at a restaurant. \n\nMy family and I had plans to try out Vinegar Hill House on a Friday night at 6pm when they open. We tried to make a reservation but were told they don't take reservations, so we figured if we showed up right when they opened, it would be fine. So we got there a little early figuring we could grab a drink at their bar or somewhere in the neighborhood. Not the case. We had to wait outside while they and their sister restaurant on the corner got everything ready for service. (If I were running the only two restaurants in this remote area of brooklyn, I think I would want to be making money off of people waiting for dinner and open one of the places at 5:30, but whatever.) While we waited for them to let us in, I literally got 10 mosquito bites in 15 minutes...the place is INFESTED. When they finally opened up, there was one party ahead of us, maybe 5 or 6 people who got sat right away. When we went up and said we were a party of 3, we were told that they could offer outdoor seating, but they were full of reservations for indoor tables. The place was completely empty and the (extremely elitist, pretentious) host had a list with 5 reservations marked down. We told him that we were told that they do not take reservations, but apparently they take reservations for parties of 4 or more. So being a party of 3, we are basically screwed because we can only fit at a 4-top but they refused to grant us a reservation for one. We spoke to the manager to try to show him how silly this logic is and he was just as unaccommodating, so we left. \n\nI don't care how cute their decor or good their food! There is no excuse for treating potential customers who were about to spend a good couple hundred bucks at your establishment in such a disrespectful manner. Frankly, I don't know how these people are still in business. There are too many good restaurants in this city to bother wasting your time somewhere where they have zero regard for their clientele. I will never go back to Vinegar Hill House ever, ever again and you can bet that I will tell everyone that I know and work with what my experience of them was.", "author": "Katie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-24", "description": "I feel very torn about this place.  My boyfriend and I arrived at around 10pm on a Saturday night.  It was still very busy, but the hostess promptly took our name, we got a drink at the bar, and we were seated in no time.  The decor is fun to look at, and I like that the restaurant is in a random little neighborhood.  Our waiter was very nice, and very helpful.  We got a cheese and pate plate that was very tasty.  So far, five stars.  For entrees my boyfriend got their famous cast iron chicken, and I got the pork chop.  The chicken definitely lived up to it's hype--the juiciest I have ever, ever had.  So fantastic.  We also got some brussels sprouts with hazelnuts (I think) which were addictive.  However, my porkchop was pretty much inedible.  The flavoring was great but the chop itself was so fatty.  It was just...gross.  There was barely any part of it that I could sort through to enjoy.  I guess I could have sent it back, but I kept feeling hopeful that the next part of it would be fine since the flavor was so good.  \n\nThere are definitely some good things happening here.  I think the chef used to work at Freeman's and Vinegar Hill House is definitely less annoying and the food is way better.  I'm just not sure whether a trip back is worth the risk.", "author": "Meghan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "I can't remember a meal in recent memory when I've been so full and drunk upon my exit.  Have to say, pretty outstanding meal.  I opted for the rabbit pasta (which clearly had a much fancier name that I've since forgotten).  It was nicely seasoned and rich.  The portions, which seemed kind of small when served, complemented the richness of the sauces.  Way to go.\n\nThen again, I might have just already been full from the nine thousand appetizers we ordered, including goat-cheese and squash torte with sage, chicken liver pate with pistachios (I'm not usually a fan of organ-related food, but this was smooth and delicious), cheese plate with crostini and arugula salads.\n\nThe wines, both red and white, were fantastic - the list seemed somewhat extensive, albeit pricey.  Finally, the desserts - especially the vanilla bean flan, were stellar.  The only thing I might have passed on was a grapefruit spongecake.  \n\nI'm also pretty sure I saw the guy from Hellraiser sitting at a table nearby - alongside a soccer mom and some douche with a turtleneck.  Moral of that story is - could have passed on the crowd, but the restaurant makes up for it with tealights on the toilet tank.\n\nDisgustingly cute.", "author": "Danny O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-27", "description": "What just happened!? \nWe live in DUMBO and have loved VHH over the years. Suddenly the food is horrible. The server mentioned a new pastry chef, but there has to be a new chef as well because there is no skill in evidence on the plates. Chewy pasta in a tepid bowl of pasta water; how did that make it out to the table? Even their old signature dishes now disappoint. The chicken liver mousse, once so rich is now bland and chalky. The dessert list from the new chef overplays every bad dessert cliche of the past few years-- wasabi pumpkin seeds on your cake anyone?\nThis horrific meal inspired me to write my first review. So sad my neighborhood joint is over.", "author": "R R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "Amazing Brunch! Amazing Dinner! Just perfect. The first time I went here, I was bombed..because I want to happy hour prior and we got a little to tips!Really sad, because I didn't remember the amazing meal we had, all I remember was that the pate was YUM! So I told myself I have to GO BACK! I did with my friends who live in Dumbo for brunch and it was devine! I had the smoked salmon which was really fresh! \nLove it it's def a great addition to DUMBO!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-05", "description": "Owned by the former cook from Freeman's and her husband. This place is so charming and warm. It is located on a small cobble street in Dumbo. \n\nStaff is super friendly and informative. Food is on the fancier side and very delicious.", "author": "Laura C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-18", "description": "I wanted to like this place.  Chef friends raved about it, they said it was great. They said the food was so innovative. Meh - my rabbit ragu was mediocre, and the porkchop was the one good thing on the menu.  I know I am probably being picky, but if I want to pay Manhattan prices for a cocktail - I would not have traveled to DUMBO.  \n\nHaving said that - the restaurant itself is kind of contrived distress chic, peeling paint is a little overdone - backyard is nice though.", "author": "Quite C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}