{"aggregateRating": {"reviewCount": 636, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "I would give this review more stars if the bartender was more pleasant to order from. It's funny, you'd think Manhattan would have the snobby bartenders--go to DUMBO. That's where the snobby restaurant staff resides.\n\nAnyways, we ordered a pasta dish and roast chicken. It was ok, but I definitely do not understand the hype of this place.\n\nWill not be going back.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "Reasons one might visit Vinegar Hill House:\n1.  You took a series of wrong turns after getting off the F train at York and you stumbled into VHH because you thought you were going to get mugged by a hipster.\n2.  You love tiny beautiful pancakes made with apples and sourdough.\n3.  You want to know what it was like to have brunch back in the 1900s.\n4.  You are seeking the world's most perfectly poached egg.\n5.  You want to walk away from a meal feeling pleasantly satisfied.\n\nNice folks, good food, make a reservation.  The End.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-04", "description": "Contempt for customers seeps from every pore of the staffs' bodies.\n\nAs our beloved president would tweet, \"Terrible.\"", "author": "PJ S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-10", "description": "Was looking forward to trying this restaurant after seeing all the positive reviews on yelp.  It is a little out of the way if traveling by train.  If traveling by car, parking was not too hard to find.  Located on a quiet, isolated part of DUMBO.\n\nWe did not have reservations so we opted to eat at the bar.  Small restaurant with a rustic decor.  Bartender was friendly and helpful.  We had their flank steak, red wattle country chop, and blue corn cornbread.  The flank steak was a little tough but flavorful.  The country chops was flavorful but a little on the salty side.  The cornbread had some butter and honey on top which made it a little too sweet. Probably would have been better if the honey and butter were in the side.\n\nOverall, the service was friendly and food came out fast.  A little disappointed in the food.  On the pricey side for the quality of food you are receiving.", "author": "Jason L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Menu is seemingly simple, which makes you wonder about how good it's going to be. But it's good. The stars are the basic ingredients. Fresh and full of flavor. Also, the bacon is top notch. It's well done dishes.", "author": "Carmen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Have been looking for a good restaurant with outdoor space, and Vinegar Hill House is perfect for a summer evening. It's on a quiet street by Dumbo, with a lovely, protected backyard. Delicious food and fantastic service.", "author": "Alexandru A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-11", "description": "This was truly one of the most disappointing - in all ways - restaurant meals I've ever had; both my husband and I were actually a bit dumbfounded about the whole experience.  Came here for New Year's Eve because we had fond memories of eating here several times a few years ago and were looking forward to being back.  Other than silently delivering some water for the table, the first thing the rather bored looking waitress said to us was \"OK, you ready?\"  Seriously?  Not Hi....welcome....any questions...how are you....Happy New Year?   I mean the \"my name is____ and I'll be your waitress tonight...\" stuff can be overdone but there is another extreme.  And then the food itself was truly stunningly bad - almost flavorless: a plain piece of steamed fish - wasn't sure it even had salt and pepper on it.  My husband ordered the \"prime rib\", medium rare, which turned out to be an unrecognizable thin, overcooked piece of some kind of flavorless beef.  Bland avocado panna cotta for dessert.  We ate quickly and left - no one seemed to care.", "author": "Janice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "This place was pretty good! Food was excellent! Perfect in a winter setting. Felt like neighborhood on the edge of gentrification. A feel of old brooklyn. Only negative is that it is small and when it's packed service suffered a bit. But I would totally go back.", "author": "Errol W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "If you're walking around starving in this neighborhood, you'll likely pass Vinegar Hill with its unrecognizable speak-easy'esque storefront. Upon entry to the quaint and cozy restaurant, the copper topped bar is turning out both classic manhattans and signature cocktails. The Pink Moon is a Vinegar Hill stand out as a spicy twist on a margarita with cucumber and hints of chili pepper.\n\nI tasted the Tagliatelle with a pork ragu. Hints of creme, fresh pasta, and a beautifully done pulled pork seal the deal on this dish although the saltiness is a bit overpowering. The fennel salad is absolutely flawless and the shaved pears will make grown men weep with tears of joy.\n\nAfter asking about how the steak was prepared and requesting the au jus on the side, I was a bit disappointed in the presentation of the steak. This was not because it wasn't cooked and presented nicely, but because it wasn't as described and the portion size of 5-6oz's simply doesn't do much to satisfy a grown mans appetite.\n\nI will surely visit Vinegar Hill house again, but will stick to the cast iron chicken next time as this really was the best of the bunch of entree's we had on the table.\n\nIf you're looking to escape the beard bar restaurants of Williamsburg and want to take a walk on the river front of DUMBO, make Vinegar Hill the final stop on your night on the town.", "author": "Nick D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "Dishes ordered were mostly on the savory side.\nHearty Steak. \nPan roast chicken avec shallot jus had a classic taste.\nBrussel sprout, cheese grit, beet salad sides all good quality.\nGood martini served.\n\nInteresting curated vintage atmosphere.\nStaffed by snarky millenials mostly. \nSafe bet nothing to write to mum about.", "author": "Sumiko 6."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "Food here was fantastic. I had the pancakes. I can understand why they were written up as one of the top places for pancakes in NYC. Service here was alright. It was as if they are all told they are in charge of taking care of tables but no one is given a clear roll. For over 20 minutes I watched as customers, including myself, sat with empty coffee cups. When someone finally came around, the whole restaurant was asking for coffee. From what I could tell, there was 1 host, 3or 4 servers, 2 bussers/food runners, a bartender and a manager. Maybe they had an emergency meeting and no one was on the floor? Anyway, everything turned out alright. Go for the food, remember that brunch is the hardest shift in the restaurant industry, and eat the pancakes. \n\nOh one last thing... They abrieveate the menu. ie. LTO(lettuce, tomato, onion) We did not know that the pork and grits had roasted peppers. Either it wasn't listed or it was not mentioned. Would have asked for it without the peppers, but instead had to pick them out one by one.", "author": "Rylie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-11", "description": "Yikes!  I generally only write stellar reviews, but I was a bit disappointed after the experience I had last night.  I debated writing about it, but then I came to read some recent reviews and I realized that others were having some not so good experiences, so I figured, why not?\n\nMy friend and I had a 6pm reservation for dinner.  It's possible that I was unaware that the restaurant did not open until 6pm, but I always arrive early, so we got there at 5:50pm.  We went to the front door (no Open/Closed sign) and I pushed on the door to enter but it was locked.  OK.  The staff was about 50 feet away and could see me through the glass of the door, but they completely ignored that we were standing there.  I, now, understand that you open at 6, but when you see your customers arriving for their reservations maybe just let them come in?  As we waited, we both got mauled by mosquitoes, receiving over 5 bites each. We were swatting them away and moving all around!  It came to the point where I was just so uncomfortable and had so many itchy bites, that, at 5:58pm, I began knocking on the door.  A woman came to the door, completely ignored us, took the menu sign and walked away.  Eh, maybe a few mosquito bites isn't terrible to some people but I'm insanely allergic and was desperate to escape them, so I continued to knock on the door.  She continued to ignore me.  At 6:01pm, she finally walked over and let us in.  Ashamed that I was knocking, I said \"I'm sorry, but we were just being eaten alive by mosquitoes out there!\" to which she had zero physical response, did not say a word and asked if we had reservations.  A little sympathy can go a long way.\n\nOtherwise, our server was pleasant and helpful and the food was OK.  The cheese plate was pretty small, and the manicotti is served in a cast iron pan, which seemed a little odd to me since it was pretty burnt on the bottom. My friend absolutely loved her scallops which were the market fish of the day.\n\nThe same woman that was pretty rude and wouldn't let us in, was very welcoming to a few of the customers who arrived while we were eating. I'm assuming they were friends of hers or regulars. \n\nI've worked in DUMBO for 6 years, and I've always wanted to go to the VHH.  I'm pretty disappointed by the experience, but would try it again doused in bug spray and not arriving a second before 6pm!", "author": "Suzanne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Its a very popular Brooklyn hidden gem. That means you should get a reservation. You should come on time to your reservation. The food is delicious and rich. The cocktails are tasty and interesting. The staff is quite accommodating and nice.\n\nNot a hidden gem... Just not on a main road. It's quite popular. I warn you that you will not be seated if it is packed. Sorry.", "author": "Jade H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "great food with great drinks in a lovely setting in an out of the way neighborhood.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "My last review was for VHH's brunch, which was nothing special. I enjoyed dinner here more. I highly recommend sharing plates. \n\nTheir mousse liver toast is a must-order. \n\nThe gnocchi was okay, while their octopus special was very good! \n\nTheir signature cocktail was nothing special. Quite watery, in fact. \n\nVHH's cozy atmosphere is what seems to have people coming, and you can't blame them.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "This restaurant is another hidden Brooklyn gem. From the cobblestone streets to the hidden corners of the Brooklyn navy yard this is truly a at home genuine place to eat.\n\nTry the toasted potatoes with jalapeno and cream cheese it's delicious.  Also the maple pancake is out of this world. The scrambled eggs were very tasty. My waitress Liz was very hospitable and very pleasant.\n\nThis establishment is off the beaten path you would never find it. There is no sign letting you know that this is a restaurant but it is and you must stop by.", "author": "Luke H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "This is the first time I've ever felt the need to go out of my way to write a review. My girlfriend and I came here for brunch from Long Island. We made a reservation the day before and left with plenty of time in order to find parking. We were both amazed that the restaurant was in an extremely quiet area of Brooklyn with tons of parking all over the place. The host was great about us being early and let us sit outside right away.\n\nThe patio in back was absolutely beautiful. There was lots of room in the shade and plenty of tables to choose from. There are tons of plants all over which really made us feel like we were at home. \n\nOur waitress was great and our food came out very quickly. I got the pulled pork and my girlfriend got the pancake with peaches. Both were absolutely amazing. The portions were perfect and we both left satisfied. As soon as we left, I was already thinking about the next time we'd be back. Even the prices were reasonable compared to some of the brunch places I've been to in the past.\n\nIf you're in the area, or if you're in the mood to explore like we were, try this place out. I cannot think of anything critical to say, and that doesn't happen often.", "author": "Nick C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "The food was amazing! I had the chicken liver mousse and the chops, which were recommended to me since I was a first time diner. My husband is vegan and they made him a special entree, which he was thrilled with. He had the beet salad as a starter. Decor was nice. Service was great. I'd like to go back and try other dishes from their menu!", "author": "A S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-27", "description": "Skip this place. Food is mediocre, decor is much less cuter than people make it out to be.", "author": "Karen W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "I should have a second visit here before a serious review is made.\n\nThe serving staff doesn't do well here; the bartender is a no-go. Does not recommend good drinks and is not helpful. \n\nOn the other hand the kitchen is hard working and definitely strong. I should say more but they looked like they were working very hard and produced very well.\n\nPork chops were really really good.\n\nSweet corn soup was also reviewed to be very good.\n\nOverall - good but it surely was expensive.", "author": "John D."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Vinegar Hill House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "72 Hudson Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lmPaVmw08EWOs1QPmVKyHQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185221018"}