{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "If you don't want to go for the beer selection, or the cozy corner booths, go for the fried pickles. Really.\n\nThey're better with ranch.  But they are worth the trek. I love pickles, and I've taken people there who do not.  They are always worth the trip.", "author": "rk t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-27", "description": "Great pub with solid craft and tasty brews, and the food is quite good.  The turkey brie and apple club is my favorite staple, and the pork mole burrito when on special is awesome.  Staff is always friendly and helpful.  Just a great place in the neighborhood.", "author": "Clavius L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "Great neighborhood bars with very friendly staff, a great selection of beers and whiskey, and solid food.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-24", "description": "The cider beer is excellent, and I love the food. The fried pickles are GREAT, so was the portobello burger and the fries! Service has always been good, been coming here for 2 years now. I love this place.", "author": "Dee .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "this is my corner bar. i luvs it. the bartenders are nice and very attentive, the fans on a belt are very cool and retro, and the current christmas decorations are just the right touch 'cause i hear it's dark in there otherwise.\n\nmaybe the white lights should stay up year 'round!\n\ni haven't been to the potty's there and can't give a place 5 stars until i know they are clean and have a hook for coats/purses...", "author": "Kenna T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "Finally, a bar that is just a bar. What do I mean by that? Well, the Ale House, which has been at that location for atleast (to my knowledge) about 15 years looks and feels like a neighborhood bar---burnished, a little rustic, but with no frills. A bar that emerged out of the neighborhood's need for one; rather than the hard sell \"sports palaces\" or beer palaces that one finds opening almost daily in brooklyn or manhattan neighborhoods. Its feel is very different, the vibe was very laid back. Wait service was very prompt and courteous. A nice place to hang with friend and have some light dinner.", "author": "Bob L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-25", "description": "Very cute English style pub, with tons of local beers on tap. There is not much in the way of bars on this stretch of Henry, so it's a nice out of the way alternative to Montague Street. And VERY close to the Cadman Plaza subway station.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-10", "description": "This is one of my favorite and certainly my most frequently visited Brooklyn watering hole. It's long, dark \u0026 cozy; the central decorative ornament is an old school belt driven ceiling fan. There's a long bar with about 17-20 stools, small tables for about that many again, and in the back, 3 booths and a few more tables. The staff is friendly, knowledgeable \u0026 generally awesome, and they have at least 10 beers on tap including Guiness, Old Speckled Hen, Boddington's, Magic Hat #9, Six Point Brown Ale, Fullers ESB, Stone IPA, Staropramen and a couple of others that rotate. There's also a delicious pub menu with touches of Old England and the Old South - BEST mac \u0026 cheese ever, the fried chicken is divine, Shepherd's \u0026 Chicken Pot Pies are choice, great cajun burgers, meaty wings... you'd be hard pressed to find a better pub anywhere - I'm in this place all the time (and it has other nice features, most of which I listed.)", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "nachos.\npretty good beer.\nlaid back. \n\nthese are the makings of a GREAT place. the chicken skewers over rice are pretty good too. the wait-staff and bartenders are always helpful. since i live in the neighborhood... i frequent the place and may be biased. but it's still awesome~", "author": "ivan j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "good beers, nice neighborhood bar/restaurant. monday night burger special at $7 is a good deal. bartender was friendly too.", "author": "James C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-17", "description": "i was really bummed out about my experience here.  i just moved to the neighborhood and walked by this bar and thought it looked cool.  everything seemed decent, until the bartender started giving me attitude because i was trying to get her attention to order (after waiting there as she walked up and down the bar, in her own world).  there weren't even that many people in the bar, but she was too busy talking to another patron and as i was trying to make eye contact with her, she looked at me and gave me this snotty attitude and said she would be right there.  when i finally got my food, it really wasn't that good, so i'll be in no hurry to go back.", "author": "jason r."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}