{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "After a 3 hour walk from Gowanus to Red Hook to Carroll Gardens zigzagging back to Cobble Hill, Boerum Hill, then back through Brooklyn Heights, I needed to quench my thirst. I needed to sit down and reflect on the navigations of my trajectory. \n\nAhoy Henry Street Ale House. This place was so chill, the music was on a low volume, the patrons were decidedly chatty and engaging, the bartender was a nice guy, and the food looked and then tasted pretty good. Bar food, there are rare places that really stand out, and I'm not saying that this necessarily is the best, but at least they have a complete menu and it's done with at least a little bit of care.\n\nThe beers aren't all that exotic, I agree, but it's a solid selection, and I'll never turn down a brown ale so I had a six point brownstone that did the trick. The stout was pretty good as well, sweet and not too thick.\n\nI also noticed they have a couple of good scotches beyond the usual Glen's and Macallans.\n\nIt's on a great block though; Brooklyn Heights, I always wondered, besides the little activity that exists in the gray area between that and north Carroll Gardens, what kind of bars were there. This is a place you bring a couple friends to; they have small tables and a couple booths, it's just a perfect bar for conversation. I can see one getting tired of it after a while (it's not quite as exciting, but that's the point).\n\nI'll definitely go back; there's something ripe about most of the train lines dropping off in the general vicinity (R, M, 2/3, 4/5, A/C) that's just begging for an easy way to kill a little time with a pint or two.\n\nThe bar itself is a bit cozy; a couple tables by the full window in the front, and the bar stretches with small tables along the wall until you hit a couple booths and the bathrooms in the back. Unisex bathrooms. I just wanted to type unisex.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-17", "description": "This place is a cute, local bar. They have good comfort food (I had the quesadilla, which was yummy) and lots of beers on tap, if that's your sort of thing. It's not actually my thing - my friends and I were just wandering around the neighborhood and decided to stop in for early dinner and a drink. With no idea that this was a bar only for beer experts (having recently turned 21, I'm not one.), I ordered a normal beer. From that moment the waitress decided we were idiots and proceeded to be extremely rude for the rest of our meal. She got pissed when we asked her to split the check, which I HATE. I used to be a waitress \u0026 never minded splitting the check, since it takes all of about 30 seconds.\n\nRant about the waitress aside, I'd say it's a cute place for lunch and a beer on Saturday or Sunday, or if you're looking for a really chill bar to hang out at. Get a table by the window!", "author": "A. A. R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-20", "description": "Good beer selection because they had what I like that particular day.  There are a reasonable number of beers on tap and the variety seems to rotate; which is a good thing.  Unfortunately there just aren't that many good beer halls around.  Most, like Henry Street Ale House, have a few rarities and hope that's good enough.  \nThe burger wasn't all that special, in fact it was just so-so.  Perhaps I should have had the fish \u0026 chips. \nI'll go back if I'm in the area but I'm not likely to go out of my way unless I have other business in the area.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-23", "description": "Beer.  It's what's for dinner.\n\nThey had a lot of selections I don't usually see back on the West Coast.  The bartenders were a friendly bunch - one of 'em is my friend's neighbor so she chatted us up quite a bit.  Definitely the place to go for a nice cold one and good conversation with friends.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "Fantastic beer selection and relaxed atmosphere. Bartender is a real beer guru, and was able to provide top notch recommendation and discussion about the beers they offer. Try the Wrassler's XXXX stout... delicious, like a craft brewery's take on Guinness", "author": "Nick R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-25", "description": "This is a pretty decent local bar  which certainly gets my attention for the nice waiters, the decent beers, the long, long bar and what got me are the fried pickles. Yes, fried pickles!! I had never had them before and enjoyed them a lot. This is definitely a bar to go to with friends, not so much a loner place. Also, it doesn't really get a lot of light.\n\nI parked my bike right out front to a signpost, but there seems to be a lot of scaffolding on the strip--good for locking the bike up.", "author": "Lani P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "While I am highly biased, I do highly recommend this neighborhood bar which features \"pub\" food that will surprise you with its quality (the Mexican specials being a highlight), and an excellent choice of beers, which now includes an impressive Belgian bottle selection along with the 15 brews on tap. The crowd at the Ale House is diverse, but is mostly made up of neighborhood folks, and while you can usually catch a Mets game or soccer on the TVs, sans sound, it's the absolute furthest from a \"sports bar\" (i.e. you'll be very comfortable reading a book at the bar).", "author": "Lee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "The perfect local bar. Great food, Great music (when Pete is there), great service, and an excellent beer selection.", "author": "Shaun E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "This bar is always good. Beers on tap are great and the wings/Burgers are excellent! Pete the bartender is a great guy who loves music, he may have a attitude sometimes but doesn't everyone? This is a great place and definitely recommended!", "author": "Charles V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-27", "description": "Ok drink selection. No mixology. Pretty standard bar. Food is not good but is available late which is always a trade off outside Manhattan. Main complaint is the lack of any thought put into what is on the television. Sports are never on or appropriate for the day.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-17", "description": "This is my neighborhood go-to place for food and drinks. I like it because they serve good food (the yumminess factor is consistent), have a great selection of beer, and offer friendly service. The atmosphere is casual and relaxed, which is the way I like it. They have booth-seating in the back that could comfortably seat four people and a nice looking bar that is comfortable to sit at.\n\nMy most absolute favorite thing about this bar is that they serve El Yucateco Chile Habanero XXXtra hot sauce, which I think is the best hot sauce I have ever tried. If you like it spicy, you will ask the waiter for this with your entree. Be forewarned though, only a couple of drops are necessary.", "author": "Lynn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "Nice atmosphere.. Enjoy my time with a drink and having a great conversation with my friends.. The price is reasonable.. Is a nice place to hang out!", "author": "Shing Yiing O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-13", "description": "Love it!  I come here weekly with a small group of friends from work.  The appetizers are good, but the artisan beer selection is even better!  The servers are really good about attending to our needs.  We've never had to flag anyone down, they just sense when we are ready for another round.  Great little happy hour spot in the heights.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "First what I like.\n\nFood is consistently good.\nGreat music selection.\nGreat neighborhood ambiance.\nClose to my apartment.\nFree copies of the ale street news\n\nThings I don't like.\nBeer selection gets real BORING.  Change it up, be adventurous.\nBartenders are more concerned with tending bar, than chatting up the patrons. (Pete you still rule.)\nWould love to see more local brews on tap.\n\nIn review, this is the bar I go to when I just want some good ole' bar food that I can rely on.  There are four menu items that you MUST order if you go there.\n\nWarmed Brie is divine.\nkiller wings \nkiller nachos\na great turkey club (w/ bacon, brie, granny smith apples.) \n\nMy final note, always clean tap lines! (HUGE PLUS)", "author": "Jared B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-19", "description": "HSAH serves pretty standard bar food, you get what you pay for.  Good selection of beer and a good atmosphere\n\nTable service is pretty poor.  ex: we ordered fried pickles as an appetizer 3 times throughout our meal.  it finally came, as dessert, with no apology..  otherwise it woulda been 4 stars for me", "author": "Chris J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-07", "description": "I hate to give a mediocre review to a low-key neighborhood restaurant, but i feel Henry St Ale House has declined recently, and when i say that--i'm referring solely to the service.\n\nFood is average pub food, but that's fine by me, you know that going in. Great, interesting beer selection.  Wonderful neighborhood vibe, and very low d-bag factor in terms of other patrons.\n\nHowever, the staff are increasingly rude. My experience last night was highly unpleasant and made me want to avoid this place for a while.  My friend put her coat on a chair to save a seat for a friend, and the bartender snottily said \"I can't have you saving seats at the bar. the seats are only for people who are in them.\"  Now, the not saving seats thing is perfectly fair, in fact its written on the wall, but his tone was dripping with bitchiness. communication is everything when you work in customer service--there's no reason that couldn't have been expressed more nicely. a few friends joined us a bit later, and the waitress at that point, in a totally clipped tone, told them they were not allowed to stand behind the bar stools because its \"completely blocking our servers\" and they \"have to move\". Not, \"can we get you guys a table? sorry but we really need to keep this area clear.\" So, we get ready to move to a table and the bartender tells us we have to cash out at the bar, so we did and sat down, and nobody bothered to come and see if we wanted any more drinks or food or anything. additionally the table we sat down at still had drinks and dirty napkins from the previous patrons and nobody bothered to come around and clean it. \n\nin sum, the beers are great and the atmosphere is good, but be prepared for surliness from the staff and mediocre service.  i'm not a difficult customer--all i want is for people to be nice. seems like this is tough for the folks at henry street ale house. good thing there are a million other nice bars not too far away.", "author": "Spike G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-21", "description": "If you've exhausted the standard craft/artisan/brewpub options and can appreciate a bewildering assortment of fine brews, head for the Henry Street Ale House in Brooklyn Heights. Presiding over the taps is an extraordinarily knowledgeable manager/bartender who can point you to something sure to please your particular taste. But just coming in with a few friends and sampling several different tastes is an education in itself. It'll have to be after work, though; the Ale House doesn't open till 5 pm (at least weeknights) and fills up quickly. Convenient from a whole bunch of subway lines, just one stop out of Manhattan.", "author": "Seth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "Great reliable place for drinks and food. They have done away with the kids menu but still have chicken fingers and make a mean shirley temple. I think they have the best turkey burger ever. Lately the quality and quantity of fries has gone down (they changed regular fry style) but thats not the end of the world.", "author": "Luis F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "After 8 1/2 years living in Brooklyn, this is hands down, the best bar I've been to.  Everything on the menu is amazing, I have yet to be disappointed by any item.  I know I am always guaranteed tasty meal of the finest quality.  Every other time we go, we get the nachos.  If there is a nacho special, don't even get a menu, just order it.  The black bean burger is one of my favorites as well.  Who knew a meatless burger could be so hearty and delicious?  The beer selection which is pretty consistent with an occasional surprise, is excellent.  And the whiskey selection is pretty good too.  We love all the bartenders, they have great taste in music and the atmosphere is cozy and warm.  This is always the first place on our itinerary when we have out of town visitors.  I LOVE this place.", "author": "Mari K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "Love this place! Great food for a bar! Amazing beer selection as well. Cool environment but can get loud when super crowded.", "author": "Jessica S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}