{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "I hesitated to write this review, as I love this place and don't want it to get too crowded.  The staff is amazing. I always show up expecting to have just one beer, but wind up having three.  The food is good, though the menu a little bit limited. But this might be because I've been here 500 times.  Each one of those 500 times I had to steal myself against ordering the chicken wings again. I love them so much. I don't want to get tired of them.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "Great place for a drink and a cheap meal. They have some more expensive items but by far not a expensive menu. The bartender was great the night we went. The bar wasn't very crowed which was nice. The only reason I'm not giving it 5 stars is because there is a $25 minimum card charge. I hate when bars do this and so high. Just bring some cash.", "author": "Morgan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Nice relaxed vibes and atmosphere.  A very quiet relaxing place to get a beer.  \n\nIt seems like one of those places where you would actually want to get snowed in as long as they dont run out of beer or their delicious fries.", "author": "John T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-07", "description": "After an evening of playing volleyball at Pier 6, a teammate recommended that we grab drinks at Henry St. After 20 minutes of walking, and bypassing multiple other establishments, I thought \"this place must be really great to trek all this way\" (I know it's not that far, but I was tired and ready for a quick pint). \n\nHenry St. appeared at first glance to be a pretty traditional pub, complete with a saloon-style inner door. We made our way to the back and sat in a booth. They have a pretty good selection of local craft and English pub (Fullers ESB - $7, Old Speckled Hen, etc.) beers. We settled on our drinks and ordered a couple of apps from the menu. \n\nThen we waited... and waited... and were given napkins... and waited. Eventually, we were served our drinks. The waitress apologized, stating that the bartender \"sometimes forgets\" to pour them. Two guys in my party ordered oyster stouts, which came in significantly smaller glasses than the other drinks. \n\nThen we waited... and waited... and eventually some of our food arrived (three bowls of NE clam chowder $6)... then waited some more before the last plate came out (medium well hamburger). The bar wasn't particularly crowded, and there certainly weren't many people eating, so I couldn't fathom why it would take so long to dish up some soup. After eating, we were ushered out of the area by the waitress since her shift was ending.\n\nMy friend loves this place, and I imagine he must have good reason for it. Maybe it's based solely on the craft selection. Unfortunately, I thought the experience was only sub par, and I've certainly experienced better.", "author": "Whitney R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-09", "description": "I remember the worst meal I've ever had, before I ate here. My friends and I came here by mistake, instead of Henry's End... Biggest mistake I've made in quite a while. Sure they made decent fried pickles, but I've had rednecks fry oreos and shoes that tasted better. The chicken pot pie was some Pillsbury  stiff as a board crust, if you can call it that, placed over a bowl of Alpo. Chicken pot pie is supposed to have a thick creamy white sauce, not a cold water broth. Thanks for the side of instant mashed potatoes, that tasted like bleach. Side note, great pizza place nearby, Fascati's.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-18", "description": "The food is alright. The service is pretty bad. Only place close by for a beer and some wings so I will most likely be back. Not the place to go out of your way for.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-24", "description": "Pretty nondescript place with an excellent beer selection and an awesome bartender.\n\nVery spacious and dark bar area, with a long, L-shaped bar, a few tables, and not much else, really. The pressed tin ceiling is the only decor element that is worth mentioning.\n\nHere are the beers I tried: \n-Victory Brewing HopDevil (6.7% ABV): Rich, amber color, very hoppy but very smooth as well; not too bitter. Definitely for hop/IPA lovers.\n\n-Sixpoint Sweet Action (5.2% ABV): Wonderful hazy, amber/apricot color. Malty and slightly floral taste, with mild sweetness. Very easy on the palate; very drinkable. This is one of my favorite beers ever.\n\n-Youngs Double Chocolate Stout (5.2% ABV): The star of the night! Rich and incredibly smooth, with a creamy finish. More coffee than chocolate on the palate. Silky dessert in a glass; a real beauty.\n\nThe bartender was fantastic: the kind of nonintrusive bartender that keeps an eye on you, but never bothers you unless you need a refill; that will give you an excellent suggestion if you don't know what to drink; and that will not start a conversation unless you initiate it. My kind of bartender.\n\nA good place to catch up with a friend. Or to finish off your evening after having tried the Wild Game Festival at Henry's End just a block away[1].\n----------------------------------------------\n[1] http://www.yelp.com/biz/henrys-end-brooklyn", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-23", "description": "The atmosphere is nice if you want to meet up with some friends for a few beers; the beer list is quite good, and the decor is nice (check out the ceiling fan propulsion system). They have 1 tv with no sound, so it wasn't ideal for our world cup watching experience, but was nice for socializing.\n\nThe service was pretty terrible. We waited for a very long time for a our food (fried items that can't take more than a couple minutes to cook--they didn't have much in the way of appetizing healthy items), and when the server brought out the fried pickles, they slid off of the plate on to the table and he just stood there like it was our job to put them back on the plate, and gave no apology or offer to replace or discount them. The chorizo mac and cheese was good, as were the cheese fries and fried pickles.", "author": "Harper M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "Pretty standard ambiance for an NYC bar with very friendly service. They carry an interesting selection of micro brews, and interestingly no macros. Good for them. I tried a Belgian white which was very very mild in taste, almost watery and very little alcohol. Kinda disappointing brew. Try the other beers and lemme know how they taste.", "author": "Venkata M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-01", "description": "As far as \"Ale Houses\" go, it's hard to find one more generic. But that's not necessarily the worst thing in the world, especially in this part of BK Heights.\n\nA decent tap list and friendly bartenders make this an A-Ok place to chill if you find yourself this far north on Henry Street.", "author": "Riot D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "Best bar in brooklyn heights, I came into town as a novice of beer and the manager/bartender Pete opened my eyes to the world of good craft beers! The man knows everything about beer and will enthusiastically break down each one for you until you find the one you like!", "author": "Jeremy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-13", "description": "Never coming back to this place! My friends and I were looking for a chill place to have some drinks and we thought this was the place. We were wrong! We were told we were too loud  on a Sunday night on a holiday weekend. We decided to get the check and leave. We were told they couldn't take 4 credit cards \u0026 they couldn't split the bill. We had to call the mgr to have the matter resolved. The food sucked but the beers were good, still not coming back.", "author": "TB B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-27", "description": "For starters, our waiter seemed high and did everything so slowly it was crazy. The food took time. Then the forks took time to arrive. The food was not very interesting, fish and chips burnt, wet fries, etc. It was a very disappointing experience. Never again.", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "I'm glad this ale house is near our place in Brooklyn because it's an amazing neighborhood bar that is just a few paces away from home. I have a sneaking suspicion that we'll be visiting this place frequently once we're settled in!  \n\nOn our first visit, we just ordered appetizers because we were scheduled to eat dinner later with friends. From the appetizer menu, we selected the chicken fingers and mozzarella sticks, which were both top-of-the-line for bar food and priced very reasonably ($6.95 for the chicken fingers and $5.50 for the mozzarella sticks). As for drinks, Vinny and I both ordered a Wild Turkey on the rocks, and, as I hoped, the bartender wasn't stingy with his pours! That's always a plus!!  \n\nThe atmosphere of Henry Street Ale House is pub-like--there's a long bar with wooden tables and chair spaced across from the bar... nothing fancy, but that's not what this modest, unpretentious neighborhood bar and grill is all about.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Chill old-school atmosphere, super friendly service (especially Pete, the bartender I always wish I had), and surprisingly good food for a bar--even a NYC bar.  \n\nBottom line: terrific neighborhood bar.", "author": "R M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-15", "description": "Perhaps it was a sports bar in a previous life but in its current form it's a rebel without a cause.  It's got all the elements of a good neighborhood bar minus TVs.  The guy next to us was watching baseball on his phone as the lone TV played sports highlights on ESPN.\n\nFood looked strong and the craft beer offerings was more than adequate and very refreshing.", "author": "Dan F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-12", "description": "Avoid this place at all costs. Found a huge black hair in our fries. Told the waiter who was apologetic and who then told the chef and hostess. Chef and hostess chose to do nothing. We received no apology or discount on our bill. Service was ordinary and the food was lousy.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Cool tunes. Great beer on an ever revolving list. Friendly staff and customers, from all walks of life.  Great burgers, and don't even get me started on the chicken pot pie!", "author": "Jerry Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "You kidding? This place is AWESOME....Just writing this makes me thirsty for some sweet ale from this place. Oh man man man....I cannot wait until I am back next week.", "author": "Luis L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "Came with a group of people on a weekday tonight and we were turned away because they couldn't seat a party this big. We were 10 people only wanting drinks but they didn't want the hundreds of dollars of business we would bring. No problem. We'll take our money elsewhere.", "author": "Vikas G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}