{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-07", "description": "I am beyond disappointed in what was once my favorite place in the neighborhood. After Ralph and Chris, who came from the old Waterfront Ale house left, the menu has completely changed. I am not against a healthy change, but there is nothing left for a pescatarian like myself to eat. I loved the blackened catfish, it's gone. I loved the burrito, it's gone. I loved the Mediterranean salad, it's gone. There are no fish dishes, the veggie burger is obviously a frozen patty that I refuse to spend money on, and the once delicious Caesar salad is now made with kale, and kale is terrible.\nI will be making the trip a little further to Custom House in the future. I'm sad that I will no longer be seeing the excellent bar and wait staff, and I hope to find out if they get employment elsewhere, so that I can continue to give them my money 3 times a week.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Not a huge beer selection, but what they've got is top knotch. Great friendly bartender/owner too. Kitchen closes on the early side on weeknights, but can't blame them based on the area. Just get there early! Great music too, and tons of seating (bar and tables).", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Pete is a legend in this neighborhood. Total veteran, and knows everything worth knowing about the beers and liquors they offer, but I've been given great recommendations by the other bartenders as well. Their rotating draft is extensive, and I end up trying something new every time I walk through those old school doors, due to the fact that I have heard of about 20% of the beers they serve. \n\nThey have no WiFi, and reception isn't great. So leave your phone in your pocket and pretend you live in a more simple time.", "author": "Anders H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Love love love this sweet \u0026 packed place. The food and service was flawless if crowded. It is a very special neighborhood restaurant. I really enjoyed the local color of our neighboring tables - an older, elegant couple  in one side and a couple gals out for the evening, who were having a fine time loudly using colorful language. I love to eavesdrop and had great entertainment all around.\n\nHubs had duck - the best I have ever tasted, I had a classic Caesar and a bowl of butternut squash creamed soup. One of our group had the wild game special if venison osso bucco. Though we ordered key lime cheesecake and something deeply chocolate, the house gifted us with the best house dessert - 21 layer crepe. That was the piece de resistance! It was absolutely light as air and delicious!\nA wonderful meal, a great place and a fantastic evening!", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "This place is solid. Great beer section and knowledgeable, and very friendly, staff who never stopped hustling. I could've hung out here all night.", "author": "Steve A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "I thought it was meh. We biked across the crowded Brooklyn Bridge as the sky turned dark and cold, we were hungry and literally went to the first place that had no wait. I see why there's no wait. The food was mediocre. I guess the mini burgers were cute and decent but I wasn't a huge huge fan but it wasn't bad either for quick food. Out of the chicken, ribs, and mini burgers, I definitely favored the burgers \u0026 fries :)", "author": "Vicky T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-15", "description": "Add me to the growing list of regulars, and pescatarians (who knew there were so many of us) who are saddened by the menu change. I loved that mediterranean salad. It was soooo good. Gone. My partner loved that big old burrito. Gone. He also loved the pot pie. Gone. Had guests who raved about the nachos. Gone. I don't even eat here anymore because I don't always want fish and chips and the only other meatless thing is fried pickles. Those aren't that great and they're not dinner anyway. Re-re-imagine that re-imagined menu. For the love of Pete!", "author": "no n."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-22", "description": "Beer is good, staff is friendly and the ambience is fun and causal. But if the chef reads any of these, the Mac and cheese was so salty it was seriously inedible. This place has a lot of good things but needs to up the food a little - particularly in the Mac and cheese department.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Please bring back the chicken pot pie!!! It's winter for gods sake!! The new menu is delicious but pretty please?", "author": "Leah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "Love this bar. When I lived in Brooklyn, this was a regular place for me, usually coming once every other week. Unfortunately I moved out to New Jersey which makes it a little more difficult to drop by since it's an extra subway ride, but I still do try to come here every couple months. \n\nThe ale house is super easy to get to, it's literally a block away from the High Street subway station on the A and C lines. They do a pretty good job managing the seats at the bar so you always have a place to sit when you walk in. \n\nThe beer mix is an eclectic one- but I say that in a good way. I normally consider myself fairly well educated with beers, but I often find ones here that I've never heard of. \n\nThe food here is definitely a notch above your regular bar grub. The chicken pot pie is enormous, and there's always a few daily specials worth checking out. \n\nWish the owner of this place would consider opening another location closer to where I live. The place has definitely grown on me since I wrote my original review a while back.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "They have an amazing rioja stocked, and the menu is extremely eclectic and changes all the time. When you show up, you never know what awesomeness will be on the menu. Pro tip: only one of the bathrooms has a mirror in it.", "author": "Gina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-27", "description": "Menu says 20% gratuity added on parties of 5 or more. So why did my party of 3 automatically get 20% tip applied when the waitress did nothing special at all? That is messed up. Food not worth the disservice", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Great Mac and cheese. Great service. Ask for Pete, tell him Jaime sent you :-) consider the 'Great Divide Titan' or the 'Evil Twin Soul Made'.  Been coming here for a couple of decades. It's a steady stream of 'good place to chill' and already good Mac and cheese. Hope this helps.", "author": "James O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Great local bar to eat burgers and drink beer. The service is friendly, seats are cozy and burgers are juicy.  Also they have a wide variety of small brew beers. The staff is very knowledgeable and point you in the right direction too.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "Such a cozy spot for not just great beer but also some light food. It's not huge but it's just right if you want to sit and eat or just sit at the bar. They have a great selection of beer that are on tap. Always a beer for everyone's taste! In terms of food the portions are smaller than a lot of places but it's pretty nice because you are drinking beer along with the food to it turns out to be the perfect amount of food. The mac and cheese was delicious, nice and creamy and not too much topping. The pulled pork sandwich was good, wasn't a fan of the hot peppers on it but that's easy to take them off. The fries are AMAZING!! You can definitely tell they are house made and so crispy and delicious. Definitely a good place for a quick bite to eat and some beer.", "author": "Erin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "A real bar with a real bar feel. Service is excellent, beer is cold. Great neighborhood place", "author": "Leonella M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "I really enjoy this spot! Great burgers and good selection of beers. I'm sad that they changed up their menu recently, they used to have a bigger variety of burger options. They still have the toppings for an additional fee, but sometimes you just feel like choosing a random burger off the  menu! Now they just have the two barebones burger options with different patties.\n\nWaitstaff is knowledgeable about their beers and friendly", "author": "Beth K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-30", "description": "I've been here many times and have always had my beer served right on time. The place, overall, is just fine and what you would expect from an upscale dive. However, the reason for two stars is their repeated inability to serve food in a reasonable amount of time. If you are hungry or in a hurry, do not order here. And if you're thinking -- why would you return if this has happened before? Because I drink and eat out all the time and give places a break, even when service is poor or slow more than once. If things are unreasonably slow, just let your customer know, otherwise, don't bother like you did today.", "author": "Jeri H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-24", "description": "Rude. Badly kept beers. Won't be back, don't worry. Why go to a place that doesn't even try?", "author": "Patti P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-14", "description": "Found this place by chance and it was an absolute gem! It's such a cozy space off the beaten path and the service was exceptional. The chef was very passionate which showed in each dish. Try the burgers (out of this world)! I'm a fan", "author": "Michael V."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}