{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "I really liked the adult vibe (few hipsters on display on a Thursday night), and the professional bartender, who made an excellent Martini.  The food was actually very good - we had a quesadilla and a burger.  \n\nIf you want a drink at a bar, this is the place.  If you want to watch TV or pick up girls, go elsewhere.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-01", "description": "Frustrated about this place.  I want to like it a lot and it has provided a safe haven when I've been very stressed, but the prices are starting to piss me off.\n\nOn the plus side:\n- great beer selection (Fullers ESB, Belhaven... etc.)\n- good ambiance - very relaxed, not too loud (well, voices alone can make it very loud sometimes), nobody trying to impress anybody\n- they have food and it's okay\n- as a straightforward place to drink and talk, this blows all other options in the neighborhood (BK heights, Dumbo also) out of the water (unless you want to hike to Atlantic), so far as I can tell.\n\nOn the minus side:\n- the beer is more expensive than it should be, and they don't list prices.  Probably because the neighborhood is completely full of lawyers who earn more than the beer's value in the time it takes them to say its name.  I think the prices have gone up in the last year or so, perhaps because of the higher-end restos opening on that strip.\n- given that, the cheap, rocky tables and chairs (or, warped floor?) are a bit much.  If you want to go with a frat house feeling for your furniture, don't charge country club prices.\n- service is spotty (see below)\n\nI recently observed an absolutely textbook case of bad waitering here (IMHO):\nWhile my friend was chewing his last mouthful of his burger, the waitress came up and put a hand on his plate.  \"Do you want that last fry, or is this all done?\" she asked (paraphrased).  Which makes me think:\na) He's chewing so he can't answer you.  Now he's chewing in a hurry in order to answer you, so he can't enjoy the food.\nb) Why wouldn't he want the last fry?  It's huge and looks good.\nc) Even if he weren't chewing, your hand is already on the plate, so the implication is \"quick, grab that last fry before I take away this precious plate I rented to you for twenty minutes only!\"\n\nShe forgot a minor order on top of this, which did not bother us much (and for which she apologized), but the problem with what I just described is that she doesn't know it was rude or disturbing.  Seriously, New Yorkers, could we just chill out about the risk of plates sitting empty for a second after somebody finishes his meal?  And could we not ask questions when people's mouths are full?  It's almost as bad as taking away a beer glass before it's completely empty (which happened to me once here also).\n\nBut it's not a big deal.  If you have the money and are willing to pay a high price for unpretentiousness, this is your bar!", "author": "George S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "first review.  0 star.  it was a long weekend and I had my folks in town.  strolled into this decent looking bar but was pretty much yelled by a total dbag / server for \"ordering a beer at the bar\" while sitting down at a table.  I wouldn't ever return for sure.  Walk down the street, there is a cute wine bar there.", "author": "Cheng Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-21", "description": "Great beer selection! Good good good stuff.\nThe food is tasty as well especially the  buffalo wings.  They are just spicy enough and flavored well.\nWorth the trip.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "Henry Street Ale House is a local pub in my neighborhood with some very good micros on tap. Micros make the bars go 'round! I often only come here to grab a drink while waiting for a table at Noodle Pudding down the block... but it's a nice place to grab a drink and a bite as well. The bartender/owner (at least I think he is both) is very helpful in helping you pick out a beer or drink for the mood you're in. I told him once I wanted something full of flavor but light without a strong nutty flavor... and voila, he gave me some delicious amber colored beer from Germany that I couldn't even pronounce but it was EXACTLY what I wanted. I love that kind of service. The food here is pretty decent too... definitely on par with most establishments as far as the cuisine goes. Mmm buffalo wings. Overall a place I like going back to again and again for the service and the drinks!", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "Pretty good bar food; definitly try the fried pickles. Good amount of different beers on tap too (the pumpkin ale was really good back in the autumn). Cozy place that can get pretty crowded, but that does not seem to be much of a problem since everyone seems so friendly and fun. Service is also very good.", "author": "Steve S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "Fried pickles battered like fish \u0026 chips? Served in spears instead of sliced? Calle crazy but this works.... and it works very well. If you like pickles (frankly who doesn't) then this is a must! Great beers and service.", "author": "Rich R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-02", "description": "A huge menu, but all the food is mediocre. Henry Street Ale House is a good place to grab a drink with friends, but be sure to have dinner beforehand.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "Abita Amber on tap!! Cute little place, didn't seem too busy on a Saturday night though, a bit in the middle of nowhere, even though that's not possible in Brooklyn Heights.\n\nService was on point, the waitress was quick to suggest alternatives, with a good explanation, for beers which they were out of. The beers they did have were great, Abita being one of my all time full flavored beers, which isn't too heavy.", "author": "Gabe W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "Went here with the beau before a NJPAC show.  Food was decently priced and beer selection was nice.  Service but a bit slow considering the bar area wasn't that packed.  Missed happy hour but it looked like there were some good specials.", "author": "Jacquelyn Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "Cute little pub.  Great ambiance and beer selection!", "author": "Melanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "Great beer selection, great comfort food, cozy atmosphere! \n\nThere should be more laid back places like this in New York. It has great food and beer but it's not pretentious at all and it's not a dive. Just a regular bar (in a good way!)", "author": "Stacy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "A comfortable place to go, have a drink, and maybe chat with a friendly bartender or patron.  Good beer selection and a well-stocked full bar.", "author": "Marianna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Henry St. Ale House is good, unpretentious comfort food and a nice place to hang out and have a drink on a less crazy, non-weekend night or weekend afternoon.  If you want a lot of bustle and a big crowd, hit it on a weekend night.  I absolutely love their nachos and the fries are pretty darn addictive.  Your usual pub fare, but done well.  As its name implies, it's an ale house, so beer is pretty much your only option here unless you want a nondescript wine.  I don't drink beer, but my beer-loving friends are big fans and say the selection is excellent.", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "- A dozen beers on tap, mostly microbrews, $6 each for ours.\n- Tasty fish and chips (more chips, please!) for 13 bucks.\n- One TV in the corner, muted.\n- Surprisingly good music and a mellow atmosphere.\n- Unlike the rest of the block, open and hopping at 8pm on a Monday night.\n- All in all, not a bad local bar.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "I've come here a few times after performances at school.  We chose it because of its proximity to the 2 train and to Manhattan for those of us who don't live in BK.  I was surprised at how busy it was at about 9 on a weekday night.\n\nGreat beer selection and good pub food.  Waitstaff were friendly and they were accomodating to our large group when we had about 10 people.  I think I just had a burger each time, but I love burgers so that was fine with me. theirs didn't disappoint.  I really liked the beer I had, too bad I can't remember it right now.  I'll definitely update after my next visit.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-17", "description": "Very clutch place for happy hour!!\n\nLots of great beers! Lots of good food!\n\nCheck it out on Thursday nights -- 5:30-7pm.  You'll probably see a bunch of Prosecutors and Defense attorneys :)", "author": "Liz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-24", "description": "A local treasure!  Great food, great beer (I recommend the Magic Hat No. 9), and great atmosphere.  The scene here is totally chill and relaxed...the perfect place to grab lunch on a Saturday afternoon with your friends and then stay for the game.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "Easily one of my favorite places in brooklyn, henry st. is a cornerstone in brooklyn heights. it's a great local neighborhood bar that was my go-to place for burgers when i lived in the heights. my g/f swears by their turkey burger--it's not some dried out piece of turkey patty but a moist, flavorful, herby burger. the beef burgers are grilled masterpieces, particularly when matched with grilled onions and mushrooms. the wings are tangy, piping hot, and spicy. the fried sides (fries and onion rings) are greasy comforts. the beers offered are a thoughtful list of brews local and international, and you will want to get out of your budweiser comfort zone and try something new here. \nthe only negative about this place was the service--it was always slow and spotty, but it wasn't SO bad.  the nostalgia for henry st. still runs strong.", "author": "Eric K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-15", "description": "What I like about the Henry St. Ale House, a list\n\n1. The fans, on an actual fan belt\n2. The variety of quality beers on tap\n3. Rotating featured wines by the glass\n4. Cheeseburgers\n5. The bartender's taste in music\n6. The tin ceiling\n7. The regulars\n8. Short walk to the promenade\n9. Shorter walk to the Brooklyn Ice Cream Factory\n10. I can convince Manhattan-ites to come over the bridge to come here.", "author": "Michelle S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}