{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Your typical local Irish-style bar. They have a decent beer selection and bar food favorites (wings, pulled pork, etc.) that is all pretty decent. Spacious enough for a large group.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Peter is the man. He really knows his beer and takes bar-tending very seriously. \n\nTiny beers during the summer changed me into the person I am today. Can't emphasize the tiny beers enough. \n\nTry the nachos. Good for after a walk across the bridge.\n\nClassic NYC bar in a great neighborhood.", "author": "B C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "GREAT place to visit, especially if you've just walked the Brooklyn bridge and find yourself hungry or in need of a beer! We were visiting from Reno, NV \u0026 enjoyed every aspect of this place. There were 8 of us \u0026 the server, Stephanie, was beyond accommodating to us and provided quality service! She deserves much higher than a 5. \n\nWe wanted everything on the menu and were quite pleased with our selections. We had the chimichanga (special), Mac\u0026Cheese, French Onion Soup, \u0026 Burgers. Lots of yums and happy faces.", "author": "Amethyst S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "After a walk across the bridge with my cousin, I took the opportunity to introduce her to the promenade and a bar I truly love. Peter knows his beer and its really the only bar in the neighborhood that still has a homey, non-corporate feel to it. The beer selection is impressive for its breadth and specificity, and the food ranges from ok to very tasty. I used to come here every time me and my girl would hit the cinema up the street. Now that condos have killed it -big surprise -, we hardly ever stop in anymore. Janet had the nachos, which were terrific and I had a few too many Pilsners. (Urquell) I'm just glad the place is still there.", "author": "Nick J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Great beer selection, very diverse, something for everyone. The food menu is limited, but that in my mind is not a bad thing. We had the pulled pork sandwich, and it was great, with the option to have arugula salad on the side instead of fries. Good service, too. You don't need a big menu - do a few things great rather than a lot so-so.", "author": "Sofie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "A favorite in my neighborhood. Food is delicious, the beer selection is incredible and staff always keeps it high quality. It's a low key ale house without the dive bar/sports bar/general d-bag vibes some ale houses come with. Keep up the good work.", "author": "Finchy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "I wanted to come in here a few weeks ago, but it was around happy hour time and the place was packed.  So last week after drinking around the DUMBO area, I suggested we go here for food.  The staff was really accommodating to our large and intoxicated group, but we squeezed together.  The food was all really good for a pub, slightly more fancy than what I expected but not very expensive.  Their beer list was GREAT they had TONS of good sounding beers.  It's really just a solid place to come, hang out, eat and drink.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "Had the Poppers, and Old Engin Oil Ale...perfect combo.", "author": "Bruce M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "I love this place. I used to live one block away and this was our easy choice. Always good beers, they change the selection every month so you get to try a lot of different beers, good food and the best service. Pete is amazing, just tell him what kind of beer you like and he will give you the best recommendation for you.", "author": "Lucia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "This place is a diamond in the ruff for the Dumbo area -- frequented mostly with \"event spaces\" and the like. Stepping into Henry Street is like stepping into a little sanctuary! The bar is warm, cozy and inviting. The beer list (both draft and bottle) is impressive, with a rotating tap of solid, craft beers (both domestic and imported) and amazing Belgian brews by the bottle (from memory, they had Delirium, Scaldis, Kwak, Golden Carolus, Duvel, La Chouffe (which I ordered), and Chimay). They also had another personal favorite of mine- Capt Lawrence Liquid Gold on tap! \n\nBartender was very friendly, though he kept forgetting to refill my poor friend's water, which was kind of annoying. \n\nI ended up ordering the hummus to soak up some of the alcohol and it was a generous portion of both hummus and pita. The other food looked and smelled very good - I would say they serve \"above average\" food for a bar of this type...it's that upgrade you always seem to get when \"ale house\" is affixed to the name of an establishment in NYC! \n\nTotal bill came out to around $60 for the hummus and 5 rounds of high quality beer. Very reasonable! \n\nIf I'm ever in the neighborhood again, I'll definitely stop by!", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-02", "description": "Ladies with an attitude\nFellas that were in the mood\nDon't just stand there, let's get to it\nDrink a beer there's nothing to it\nBeer, beer, beer.....\n\nIf Madonna would only return my phone calls, we could update her old hit \"Vogue\" for our generation with my new lyrics about beer.    Anybody wanting to help me with the choreography drop me a line.\n\nBack to the restaurant...Henry Street Ale House is a cool place.  There are a lot of locals who jealously guard seats at the bar so as a newcomer, I felt a little unwelcome, but my very cool waitress Joan said I could just sit at a table. She was funny, ironic, informative and a little spunky*.  I liked her so service gets 4 stars.\n\nThe beer list is well-curated, with a nice selection of bottles and drafts.  I started with La Chouffe, which is one of my favorite beers and it was served in the tulip.  Then I had the chicken wings and deferred to Joan for my next diet-busting selection.  She recommended the jalapeno poppers.   The poppers were great, served with a huge dollop of sour cream and a small bowl of buffalo sauce.  Great!  \n\nThe wings were good, meaty, with a subtle spiciness.  I subbed the blue cheese for ranch and that made me happy.  Also used leftover buffalo sauce from the poppers to add additional flavor.  Paired my meal with a Fullers ESB, very tasty.\n\nFor good service and good beer selection, I'm a fan of Henry Street Ale House.\n\n\n\n_________________________________________________________\n\n*Here's Lou Grant's take on spunk (@ 2:35): http://youtu.be/sNyj4FV56JY", "author": "Bill T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-02", "description": "Ordered: bottle of Belgian beer\n\nAmbiance: low-key, dark, wooden bar and furniture, one bartender (Sunday night before Labor Day).\n\nBeer selection: good. List of about 10-12 bottles of big Belgian and/or high-gravity beers. Duvel, Delerium Tremens and Chimay were the only recognizable brews on the menu. Also a good selection selection of off-the-cuff draughts. \n\nPrice: moderate.\n\nSummary: a fine pub with a good beer selection.", "author": "Nicholas A R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "After wandering the bare little streets of DUMBO, I was feeling hungry. The River Cafe, while beautiful, was out of my price range. I didn't feel like pizza, which felt like it was everywhere. The tiny shops were growing further and fewer between. Google Maps showed me Henry Street Ale House was open. Who doesn't like bar food? If you raised your hand: 1. I can't see it 2. You should give it a shot. I had their standard burger, which was SO good. Juices were locked in, fresh red onion giving that wonderful crunch, and a perfect slice of pickle on the side. My burger standards aren't extremely high but I know what good food tastes like. I didn't take a photo because I spared no time to dive in so I'm sorry for that. The service was attentive and friendly. Next time I'm in the area, I'll be there.", "author": "Julie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Stopped in on an extremely hot day, sat at the bar and had some beers. Bartender was very helpful and let me taste samples until I found one I liked! Was a fun place!", "author": "Mary Ann U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "Nice place with lots of draft beers to choose from.  I came here on a Saturday afternoon to just hang out with a friend and grab a glass of wine (or two). We enjoyed chatting and relaxing in the quiet atmosphere for about an hour. The bartender was friendly and attentive. \n\nI'll probably be back again.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-03", "description": "Bartender was awesome and super helpful. Our waitress was terrible. She looked and sounded so depressed when she talked. She spent most of her time on her laptop a few tables away from us. Food was just as terrible as her service. Avoid the turkey burger and the Buffalo chicken wrap. The meat is burnt, dry, and flavorless.", "author": "Ryan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Great selection of unique craft beers, and surprisingly really good food, for this small, local, pub! \n\nSpecifically, I always come back for the southern fried chicken. This is not bone-in chicken, rather, fresh, juicy, pounded boneless homemade cutlets, with great herbal flavoring....I think I taste celery salt? I skip the gravy, and sub out the mashed for their awesome hand-cut fries! All the apps are great as well! Try the cheddar jalapeño poppers with their rich buffalo sauce and sour cream, or the stuffed potato skins. Not a big fan of the burger- a bit too much if a char for my liking...\n\nWe like to sit at one if the two sidewalk front two top tables, for great people watching, if you can score one!", "author": "Meri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Lovely bar, excellent selection, top notch service. This is a real Brooklyn establishment that has never sold out. I can pop in after not having gone for years and still receive warmth, smiles, and even a buyback. I remember my friend's dad worked there as a bartender and would tell wild stories of working in the Playboy Club! Long live Henry Street Ale House!", "author": "Kiki V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Actually 4.5 stars because no wifi. Otherwise, this is a nice neighborhood bar. Nothing fancy, but comfortable and inviting. You don't have to yell to talk to someone and they play nice oldies and alternative tunes. If you want to \"Party!\" With a capital P, this is not the place but it's a nice place for a drink and bite with a friend or two.... Um, a bite of food, not a bite of your friend or anything like that.", "author": "michael r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Their Jumbo wings are very good, the chicken pot pie was decent. They also have a good selection of tap beer.  Happy Hour M-F 50 cent wings!\n\nAnd yes great service.  Why wouldn't I be back?", "author": "May M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}