{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "I like the feel of this place. Very pub like and has a good variety of craft beers/ciders on tap. The menu is very reasonably priced. I had the blackened Cajun angus burger and it was cooked perfectly and tasted great with the Cajun spices! Great area as well and seemed cheap compared to other restaurants and bars in the area", "author": "Emily H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Fish and Chips were great, wonderful wonderful beer selection.  Knowledgable and friendly staff.\n\nPlace was smallish and dark, but played good indie music.", "author": "D J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-27", "description": "Good spot. Get da  fried pickles  ya heard me !", "author": "Ratman S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-28", "description": "There are always people reading in this bar.  Not the sports page.  Not the betting form.  No.  Stuff like journal articles on late 19th century British armaments.  Or the recently anthologized collection of notes Lorca wrote to himself between the hours of 4 and 6 AM.\n\nDoes this shit actually work?  Do women actually approach men and say, \"Your ability to read that copy of Paris Review from 1971 in the dark while nursing a Staropramen and ignoring low barroom chatter has made me sodden\"?\n\nOther than its apparently being confused with the U. Chicago stacks on a fairly regular basis, there is nothing memorable about this bar.  The beer selection stays the same, the prices stay about 20% too high, it smells like the same sweet potato perfume that bathes every mildly \"classy\" bar east of the Mississippi.\n\nBut it's a neighborhood bar of sorts.  The bartender is pretty nice.  And, well, it's better than most of the likely alternatives.\n\nDidja know:  the wine bar on the corner of Cranberry and Henry used to be a fruit store run by an old hippie with a Tibetan staff?  Norman regularly drove his battered French station wagon upstate to fill it with fruit.  Norman offered fruit that ranged from \"well ripened\" to \"better not let the health inspector see this.\"  \n\nBrooklyn Heights will never ever ever ever support a great business like that again.  So make do with its neighbor.  And fear the alternatives.", "author": "John B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-13", "description": "Cleaner than most bars. The food is great. Noise level unacceptable. Lighting too bad to read the check. Need hotter water to make drinkable tea. SLOW service. Cell phone service seems to be blocked inside. Inability to do separate checks is a deal breaker.", "author": "Barbara V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-13", "description": "Good\nBeers for\nA pub whose\nThe only game\nAround. Fine for a few rounds of chilling.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-08", "description": "Pete is the best bartender in NYC, hands down.  Great environment, great music selection, great energy, and flawless service.  The burger is the best burger I've had in NY (or anywhere for that matter).  (Now granted I've only had so many, was vegan for 15 years).  The Mexican specials are surprisingly awesome... particularly the flautas.  They only come around every once in a while, but wow.", "author": "Garrett J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-14", "description": "After (stupidly) trying to get into Jack the Horse, Noodle Pudding, Henrys End, and Bread and Butter, I ended up here at 8:30 on a Saturday night.  The place was mostly empty and now I know why:\n\nMEHHHHHH\n\nBurger was just ok, sweet potato fries were soggy and disgusting, turkey club didn't even have fresh deli turkey (seriously, it tasted like Oscar Meyer)... For the price, you can get a lot better.  I should have just hoofed it to Pete's Waterfront because their food is significantly better.  Will NOT be back.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Great burgers, always new beers available.  A great local spot.\n\nI am not a huge beer aficionado, so sometimes I wish they would have more standard fare at times.  Especially for a local bar.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "This place deserves more than 3.5 for sure, excellent food across the board, good beers, friendly staff, solid specials. Only complaint I've ever had is a few times with slow service, but we just went tonight and it was very prompt, I come here on a semi-weekly basis so I've had enough experience for an informed review. Highly recommend!", "author": "Jesse O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-18", "description": "Cozy, friendly. Good beer. Diverse crowd. Laid-back.", "author": "Alexandra P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "Great local bar with a laid back feel. Their wine and cheese platter isn't too shabby either. When you walk in you its feels like a dimly lit cozy womb. \"if the womb was filled with men and women drinking beer and chatting up a storm. haha\n\nI would say this place is great for group of 6, anything more than than and you would have to shift a couple of tables together to accommodate.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "I can't speak to the food, but it is a very friendly place, and the beer selection is good. If I lived in the neighborhood I would go here often. It's comfortable and the music is good.", "author": "M E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "This place is close to my house, so it's a good standby when I want a beer and maybe some food without going out too far. \n\nFirst things first. Their beer selection rocks. I love a light beer, and I love it even more when the waitstaff can recommend one to me because they know their stuff. \n\nThe food is pretty good too.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "This bar is dark and cozy with attractive and classy interior decor - tin ceiling and belt-driven vintage ceiling fans, dark wooden booths. I live around the corner and come here a bit, the crowd is young and lively most nights without being too loud or rowdy; this is a good neighborhood pub. The prices are very reasonable for hearty pub grub in large portions. The beer selection is excellent and seasonal, with many great choices ranging from local brews to international favorites. They have 20 oz. Beamish pints, and are the only place in the US I've ever been to that offers this delightful Irish stout on tap. Options from Geary's, Dogfish Head, Sly Fox, Brooklyn Brewery, Six Point and more are also available on tap. The Mannequin Pis is worth a try. The service is generally ok, the servers are usually very nice if not the fastest. One small TV means it's definitely not a sports bar.", "author": "Joyce S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "Once again, a great burger. Only $5.95 on Mondays with a side.\nGreat beer selection and low key atmosphere. Bartenders always make you feel welcome. And no riff raff hanging around. Locals only.", "author": "Kelvin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "This is a lovely neighborhood institution that we have been going to for over five years - although we have not lived in its immediate vicinity for almost a year now. The ambiance is warm and cozy. The servers are mostly warm, courteous and welcoming. The food is much better than what you would expect in an average pub and the beer selection is extensive and quirky (and includes a good selection of Belgian bottles). Best of all is the bartender Pete who will remember you the second time you come in, personally greet you and make you feel part of the neighborhood.", "author": "Nikki S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "Good casual place in the neighborhood for a drink (just about the only actually).  Great bartenders.  Have had the fried chicken and it was delicious.", "author": "Miriam P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "Been coming here off and on for years. Haven't seen the manager for a while who used to be behind the bar and as such it's kinda lost that \"local\" feeling.\n\nFood has slipped a bit too, but is still not bad as far as bar fare goes.\n\nBut pretty good selection of beers, and it's pretty comfortable too. Prices not great and no happy hour, although buy backs are not uncommon here which is nice.", "author": "Jules D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "only got french fry and they were very good . Super nice bartender which  is nice to find in the land of crabby hipsters. Great beer choices, and the bartender knew his shit when it came to beer, and was very helpful with my girl friend to explain there selection. good all around bar. would def go back again. nothing crazy with the decor just a nice old dark beer hall. but hey what more do you need.", "author": "Theo F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}