{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "Solid old-school drinking house in Brooklyn Heights. A very nice beer list indeed, and nice and quiet on Sunday afternoon. We weren't very, so the poor waitress had to made do with our 2 rounds of drinks.\n\nThe inside is on the darker side, perfect if you want to hide away from the world for a couple of hours, but not gloomy or anything. There are some sports on the TV but not so loud that you can't tune it out. Quality neighborhood pub.", "author": "Yan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "This is my go to neighborhood pub. Fantastic beer selection. They also rotate selections which is nice. The bartender Pete is awesome, and knows the beer selections well. He can give you a recommendation based on your preferences. In addition, they have an excellent selection of whiskey. The food is a must try also. The nacho plate is great!! So is the chicken burrito. However my favourite thing on the menu is the western  chicken sandwich. It's so good. Plus they give you the option of sweet potato fries which is really nice. My only complaint is that they are not open later. That way I could visit even more. Overall a must try.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "I live near by and am a fan of this place, got to know Lee who is very cool, and the GM I think who is super nice. Loads of craft beers that seem to circulate regularly, and the bartenders seem to know a lot about them to help you pick the best one for your tastes. Also had a Mac and cheese which I totally dug, but it's hard to screw up a Mac and cheese. The crowd is a little hipstery and stuck up, but that comes with the whole craft beer territory. Strongly recommend stopping in if your over in Brooklyn heights. Will deff be coming back.", "author": "Jake S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-17", "description": "Bartender was snobbish and indignant when I bought his entire crew drinks. Beers were ok and service was good, besides the tender, but would not return given then entitlement of the tender.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "A true neighborhood bar.  Great beers on tap. ( no bud here!)  \n\nConsistently solid food \u0026 high quality specials.  You might not expect it, but this place has great Mexican food. \n\nThe staff is personable \u0026 inviting.  All of the bartenders bring their own personal touch to the place.\n\nOne of my favorite places.", "author": "Eric H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-01", "description": "After enjoying the an event nearby me and my friends really wanted to grab some good food as everbody was starving. As one of my friends had eaten before at Henry's so we all decided to check this place out. \n\nIt was a sunday evening and this place was packed though we were easily able to get  table us(we were 6 of us). This place has an amazing selection when it comes to beer. Though I didn't order any drinks but my friends loved thier drinks.\n\nSo for food I had the BBQ pulled pork sandwich and my friends ordered the turkey club, stuffed potato skins, Grilled veggie burrito and grilled buffalo chicken sandwich. My pulled pork sandwich was really flavorfull and tasty and even potato skins were nice. Everybody like the food except the turkey sandwich which was dry and bland. The service here was really nice considering they were busy. Definitely a great spot to enjoy food and drinks with friends!", "author": "Vineet S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Very inviting and hospitable spot. The setting is perfect and the food and drink are better than average. Came in based on previous reviews and was not disappointed. If I'm ever back in Brooklyn, I'll be sure to come back.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Good on ya Henry Street! I'll be bringing all my out of town friends here to see what a real New York bar looks like.", "author": "Elaine S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-21", "description": "Happy Hour Scam\nA friend and I visited yesterday during what was supposed to be happy hour. We ordered two burgers (which were good) and two draft beers. Upon ordering the beer, and seeing no signs anywhere about what was the happy hour deal, we asked the bartender whose reply was an ambiguous and vague, \"well... happy hour prices depend on the day, and [blah, blah, blah...]\" What kind of answer is that? All happy hour deals are clear anywhere else (e.g.: 1/2 price off on beer, or $4 beer and wine, etc.) Now I regret that my friend and I didn't see this red flag going up; we should've canceled the ordered immediately and gone somewhere else.\n\nUpon getting the check, we were charged $32 for four beers ($8 per glass) and the pathetic \"happy hour\" was a $5 discount on the beer ($1.25 per glass.) We complained to the bartender who told us that, apparently, the owner is the one who decides what \"happy hour\" means every day (based on... what?) and that, indeed, people have complained to him/her about this.\n\nEach restaurant owner or manager is free to make the call on what type of happy hour they want to offer, good or bad. BUT it should always be visible upon a client's arrival and clearly defined by the staff when asked about; none of this nonsense about \"well... let me call the owner and ask what the happy hour will be today for you.\"\n\nIn my opinion, and based on my regrettable experience at the Henry St. Ale House, the way in which they conduct their \"happy hour\" is a scam.\nNEVER AGAIN.", "author": "Sergio Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "I just feel so comfortable here! Maybe because it's the first place I ate at when I moved to Brooklyn Heights. But I've never been disappointed by Henry st ale house! The portions are large and the prices are fair. The food is tasty and comforting! There's a good selection of beers. And the crowd that comes here isn't so hip that you'll feel out of place. It's just a place to go for a good meal when you're wearing jeans.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Been coming here for years. Best neighborhood bar in the city. The staff is friendly, but doesn't tolerate assholes. The beer selection is great, and the food hits the spot.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-16", "description": "This is basically a laid back, run of the mill bar, aptly named an ale house. They have a decent beer selection but on a Friday night only one bartender and surprisingly close at 2am (hey! I live in NYC for a reason-that is way too early to end a night) \n\nThe bar is nearly the length of the entire place and there are seats by the window, alongside the bar and booths in the back. I think its a good spot for the area but nothing that would particularly send you back here, unless you are in the neighborhood.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "Went in to Henry Street with my co-workers and got treated as if we weren't welcome in the place. It was a monday night and the place was 15% capacity at best. I don't know how this place stays in business when you can't serve a group of people that come in looking for a cold drink. We were asked to basically hide in a corner and wait an unreasonable amount of time for service in a near empty bar. Some of us thought it was a joke but the joke was on them when we took our business elsewhere", "author": "Mike K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "Fifteen of us arrived to have a few drinks and appetizers. The waiter was clearly agitated because we were standing instead of sitting at the tables in a very uncomfortable corner of the establishment.  He said \"it's not the way things are done here\". So we found a friendly, more hospitable place that allowed a group of friends to stand around and talk amongst themselves.  We spent about $500 there and our waitress made over $100 in tips.  Who's sorry now?", "author": "D M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "Great neighborhood pub with a extensive beer list. I came in with a friend for their chicken pot pie for a cold January night. It did not disappoint. They put the phyllo dough on top of a bowl of chicken pot pie filling goodness and when you break up the phyllo and miss the two it's like heaven. Definitely would recommend Henry Street Ale House for comfort foods like burgers, pot pie and shepard's pie.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Good variety of beer . Cool place, quite on Tuesday night. Dark beer definitely a most the oat stout and the porterHenry street burger with bacon, jalapeño and include french fries!!!! Delicious spicy goodness not too spicy just the right amount.", "author": "Alexis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "Cheers for the beers. When you are in this place, please don't forget to try out their amazing beers. The beer here is special, you cant find anything like this in other places. And the barista here is quite the gentleman. I like having my beer when there's a man like tha around. Good beer place!", "author": "Vicky H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "This was the perfect place for a nice pint after a movie night with the boyfriend. The bartender was super welcoming and recommended us beers based on our preferences. Very knowledgable! I'd recommend this place for a nice neighbourhood drink.", "author": "Leah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-26", "description": "Went here for a coworker's birthday on a Thursday night after spending some time near the water. We had planned to get food and stay for a few rounds. Not even half way through our first round, the manager came over and told us we were in a shared space and needed to be quiet. We signaled for our check and left immediately. After walking out, we decided this bar should be called Henry Stale House not Henry St. Ale House.", "author": "Susan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-30", "description": "Meh. \nI've had several negative experiences with the staff: experiences that made me so upset that I couldn't enjoy the so so bar food and drinks. \nOverall this is just a basic place.\nI'd recommend trying somewhere like the Brooklyn Heights Wine Bar instead.", "author": "Elizabeth D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}