{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "Didn't try the food. Only the beer. And saw they had a nice selection of whiskey.\n\nStarted w/ the Wrassler's XXXX Stout. The foam itself is a wonder. Super thick. It can even withstand slight impact without losing shape.\n\nPete was very informative and willing to chat it up and help pick out a 2nd beer. \n\nI wish I could have stayed for a 3rd or 4th. There are about 10 or so craft beers on tap - most of which I've never seen served anywhere.\n\nDefinitely coming back.", "author": "Neal N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Saw it on yelp and was looking for a laid back place to grab a beer and some food after A LOT of walking around Brooklyn. Was excepting it to be a decent neighborhood place without the frills but what I got was SO much better. Was super impressed with how good the food was -- we shared this western grilled chicken sandwich that has ham, pepper jack cheese, chipotle mayo, bbq sauce, onions and peppers \u0026 the chili con carne. Both were AMAZING. Best grilled chicken sandwich I've ever had out. Such amazing food for such an inconspicuous place. The beer was also excellent - decent prices for some local brews and other brews I hadn't heard of. None of the crappy beer in this place. It also seemed like there were locals and neighborhood folks in the bar talking to the bartender which I always like in a bar. So great experience, don't let the semi low rating fool you - you must go!!!", "author": "Heather L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "Haven't been here in a long long time, but I used to come here quite often\nwhen I lived just due north near DUMBO/Vinegar Hill, with friends, dates,\nroommates, etc., and the food was always spot-on great, never had a \nbad meal here or drinks.  A friendly, relaxed, welcoming atmosphere and \nstaff, and it's nice and dark and kind of a chill-out vibe inside.  Only other\npub like this that's even better is O'Reilly's in midtown Manhattan, but\nHenry St. gives it a run for its money, the location is swankier, and it's just\na plain cool place to go and have a relaxed meal and a few beers or whatever.\nI have to return soon and see if it's as great a I recall it being!  It's also \na nice break from the more frenetic vibe of Montague Street which sometimes\ngets fatiguing.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-23", "description": "How does a place called an \"Ale House\" screw up serving beer?  Horrible experience.  The bartender was as disinterested as possible and showed virtually no personality throughout our stay.   He seemed annoyed when we ask questions about their draft beer selection.  Asked him about local pizza restaurants - guy had no clue. One beer, Fuller ESB, was awful.  Tasted like it was poured through a dirty rag.  It took several minutes to get the bartender to stop talking to his friends at the end of the bar so we could pay and find a decent place to have a beer.  Wouldn't even look at us.  Almost had to shoot up a flare to get his attention.  Seriously, if the owner is reading this, fire the guy who worked the afternoon on 6/21.  If you are the owner and you worked the afternoon of 6/21, sell and find another job that does not involve customer service!", "author": "Steve L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "Sometimes a place just fits, in such a way that makes it hard to describe (or review in this case).  I walked into Henry Street Ale House and felt at home.  There was no loud pumping music, no notable particular crowd besides those also out for a quiet few drinks on a Friday night, and the kind of lighting that makes everything a cozy blur.  \n\nI walked towards the back and sat in a booth with my two companions, who have been nominated for cutest couple of all time, and were quickly waited upon by attentive, non-overbearing waiters.  Throughout the night, our orders were taken for multiple rounds of drinks, water glasses remained filled, and our waitress cheerfully informed us that the kitchen would be closing soon if we wanted anything else to eat besides the onion rings we had all just devoured.  \n\nThanks for not trying too hard and for the onion rings.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "There are several reasons why my best friends and I visit this place on a weekly basis:  Pete, one of their managers, is one of the most charming, accommodating and knowledgeable bartenders around.  The man knows his alcohol, and it shows with the way he crafts cocktails and other drinks.  During their happy hour, you get discounted beers (great revolving selection of craft beer) and 50 cent buffalo wings, which are out of this world especially when dunked in their bleu cheese, which is filled with chunks of real cheese.  Pete usually plugs in his iPod, which is filled with great jazz and jive music, so you'll have a great listening experience as you stuff yourself with buffalo wings.  The fried pickles are equally delicious and their Chorizo mac and cheese is simply amazing.  Seriously one of my favorite places to be.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-01", "description": "I want to preface this review by saying that I would give this establishment -1 stars but that is not an option unfortunately.\nI went there with a party of 8 at about 4pm on a Saturday.  In the group were our friends who brought along their toddler.  As all toddlers do, they get bored and antsy, so my friend started to walk with him around the restaurant. They were quickly told by the manager that this was not allowed and to please keep the child seated.\nREALLY?  this forced our friends to leave early because we were getting the stink eye from our d-bag waiter.  \nOur pretentious d-bag waiter seemed like he could not be bothered explaining the beer choices, got huffy when asked to explain what the marinated skirt steak was marinated in, and was just a total tool from start to finish.\nI found myself pissed off because of my friends having to flee, and having to deal with this jerk-off waiter.  We were there on 6/28, so Mr. d-bag waiter you know who you are.  \nI guess since we were a party of 8 and you knew that an 18% gratuity was added, you thought you could behave that way.  You need to be bitch slapped.  \nSince I was 1/6th of the party by the time we left I wanted to insist on taking the gratuity off and leaving him $1.00 but that was shot down by the rest of the group.\nThe food was mediocre at best.  \nIf you read other reviews here that deal with the service it all seems extremely plausible to be accurate and factual.\nStay away from these jerks and do not give them a penny or your time or money!", "author": "Howard G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-15", "description": "Outstanding beer selection (love the Abita Amber and Cider) at decent prices.  I used to go here all the time during law school and wish I still lived in the area.  Not the best food I've ever had (even by average pub standards), but good enough.  However, the real draw is the beer and casual, classy Heights atmosphere.  \n\nCons:  Service can be spotty, but nice people nonetheless.", "author": "John F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-03", "description": "Just came in with friends I just met from Educational Housing Services. Ordered the Stuffed Potato Skins and they were incredible. Great flavor, lots of cheese, sour cream and bacon. Very filling and great prices for all the appetizers. Really enjoyed the potatoes and the atmosphere was pretty cool. Dim lighting, bar, tvs and great company. \n\nOnly negative part of the experience was the 25% gratuity. Im sorry but unless the service is absolutely exceptional, that is way too high.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-19", "description": "Stopped in and were immediately berated by the bartender and told we could not stand at the bar because they didn't have room. I get it, I bartend, but he kept saying we couldn't stand, we couldn't stand until we finally had to say, \"We're working on it! We're sitting!\" We sat at the bar and ordered while we waited for a table to open up. Posted behind the bar is a sign that says $25 Minimum for Credit Cards. Fun Fact: that's illegal. Merchants can charge UP TO $10 for a minimum, but not $25. So when we had to pay, several of us didn't have enough cash and had to put it on one card. Again, he kept pushing us to pay, tapping the bar in front of our drinks and telling us the price. He also ignored us for the first ten minutes we were there. He literally helped everyone else around our group at the bar before taking our orders, even the girl who sat several minutes after we did. \nWe moved over to a table and ordered food and another round and our server was short and dismissive with two member's of our group purely because they were French. They asked about what IPA's they had and he sighed and gave very short and kind of snarky responses. I know that look, I've had it. Doesn't make it right though. And they spoke perfectly good English, they just weren't that familiar with that style of beer and wanted his recommendation. \n\nStill, three stars because the food was good and they have a very good Belgian bottle list. The Scaldis was delicious and 12% alcohol (weee!) and I like any bar that serves Belgians in the proper glassware. Try the Shephard's Pie. One of the best I've had in the city and really filled me up. Too bad I left so annoyed. I probably won't go back.", "author": "Lincoln H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-11", "description": "Perhaps the most stressful part of moving from Manhattan to Brooklyn was leaving my neighborhood pub behind.  So I was immensely relieved to find Henry Street shortly after settling in the area.\n\nThe beer selection is excellent, with a variety of staple and rotating taps.  The food is solid and the specials frequently quite good.  But what sets Henry Street apart -- and makes this my new neighborhood pub -- is the friendly atmosphere.  Relaxed, knowledgeable bar tenders (the type who remember the regulars) and a responsive wait staff.\n\nThis is your anytime place.  In fact, I'm heading there now for dinner.", "author": "Ben B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "A favorite place to relax and the selection is always interesting - they keep it fresh with new things quite often. Plus the food is awesome. The mexican food on the menu is especially good, so if there's anything like tacos on the specials list, get it. Their homemade chips and salsa is spectacular and perfect for when you need something to go with your drinks. Love the brie apple turkey club. \n\nAlso, my favorite thing about the bar is the music. It's SO refreshing to go into a place with a classic vibe that also plays fantastic stuff on weeknights. Pete, the excellent bartender (seriously, he's the best) always plugs in his iPod and it's always great. Plus Pete is fantastic with making recommendations if you're like me and never know what you want to drink.", "author": "katie k."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Given the location, this place could be so much greater than it is, and some of their staff need major attitude adjustments.\n\nI came here last night with a few friends after a great dinner at Henry's End. The place was pretty packed, but we were able to grab a table and squeeze around it. \n\nWe waited about five minutes before anyone came over to take our drink order, and the first thing the waitress says was: \"You need to order now because my shift ends in five minutes.\" ...Um, hello to you, too? We quickly got our drink orders in and within thirty seconds she had dropped the check on the table. Not exactly a great tone set.\n\nThe table was sticky and clearly hadn't been wiped down, so I got up to ask the bar back for napkins, and instead of handing me some he literally POINTED to where they were stored. I thought he was joking and laughed, and he just kept pointing, so apparently he was serious and too lazy to get them himself. I don't know on what planet that passes as customer service, but everyone who worked there except the bartender seemed miserable, so we were ready to get out of there.\n\nIf it weren't for the incredibly knowledgeable and friendly bartender, this place would have received one star.", "author": "Alison G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "Still a great neighborhood bar! Last time I was here, I had their Chorizo Mac and Cheese --- DELICIOUS. There were so many flavors going on at once (cheesy, spicy deliciousness) and they didn't skimp on the chorizo, you were able to get a piece with every forkful. Highly recommended dish!", "author": "Jess P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Great pub with a solid selection of beers and great pub grub. The bartenders are always cool. It's easily one of my favorite spots in Brooklyn Heights for dinner and a beer.", "author": "Dave B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-20", "description": "With all the fabulous bars and competition in Brooklyn these days we were amazed at how bad this bar was.\n\nWe agree with the below review about beer pricing and lack of information any where to be found. Went there on a Sunday to watch football and there was no bloody mary mix! Then I asked for a beer and that tap was not connected yet, and then they discovered they were out of it. The people that run and work this place could have cared less about attention to detail and making customers happy.\n\nDo not go here, nothing going for it except a good beer selection (with no prices listed).", "author": "Tina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "Came here on the whim with some friends on a Sunday night. There were about 10 other customers in the restaurant. We were seated, and the host tells the server. She gives the biggest huff and tells us she's really tired. Okay... We think she's just kidding around... But no! she's for real. She hesitates to take our order but does so anyways. Food comes out fine but she only refilled our drinks once (most of us had water) and charged for a coke refill... Who does that anymore? If you come to this restaurant  avoid getting served by Roxanne. Otherwise the food is good.", "author": "Zaid A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-01", "description": "Henry Street Ale House is a nice place to grab a few beers. However, the cast of How I Met Your Mother would not make Henry Street Ale House their local watering hole if they all lived in Brooklyn.* It's a place that is decent, but there is nothing special about it. It is a good place to drink some beer, but doubtful to be considered your go-to venue because overall, it is just kind of lacking bar or pub character. Of course, if you live in Brooklyn Heights then you know that there are few places to relax and have some drinks so for the area, HSAH is certainly more than serviceable.\n\nTheir beer selection is solid and there is a good amount of seating inside, both at the bar and at tables. The bartender was very quick and friendly. The crowd seemed young due to the local mass dorm that is there. I would most definitely go back to HSAH and so should you if you are in the area. If you like the hipster-themed bars with bartenders with mustaches and suits, you won't be into it here. But, if you like good beer in a clean environment with room for friends, this might be your spot once in a while.\n______________________\n* Actually, Barney would because he would make any place with college-aged women in it, his local watering hole. Come to think of it, all bars are Barney's local watering hole.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Really enjoyed our meal here. Spicy Mexican Beef Stew was hearty, cooked to perfection, bursting with flavor and satisfyingly spicy! Very reasonably priced as well (for the area). Service was prompt and friendly, and there was a great selection of craft beers. Kind of dark inside, but I'm betting that in the winter months it's a delightfully cozy haven! Will happily return!", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-14", "description": "I had dinner at Henry Street Ale House last night with my husband after picking up our race numbers for the Brooklyn Half Marathon this weekend.  Disappointing!  \n\nFood was OK (we ordered burgers), but the beers were overpriced ($8/glass) and service was abysmal.  We came to the Henry Street Ale House based on prior Yelp reviews ( i.e. good beer selection , delicious food and decent prices), which is why we were so disappointed with our experience.  The beers are listed on a board over the bar; the beer prices are not listed anywhere, so needless to say we were surprised when the bill came - there is definitely better, more \"reasonably priced\" beer to be had!  (we live in Chelsea and can find it there).  \n\nThree friends walked in a few minutes after my husband and I sat down, and when we asked our waiter if we could sit together, he \"wasn't sure he could accommodate us\" (the place was about half full).  So we took it upon ourselves to push our table up against the empty table next to us, and our waiter said that was fine.  The young man who brought water to the table \"didn't think\" it was Happy Hour (he must know, he works here!) and basically sleep-walked through our entire meal.  Our waiter was equally inattentive - not knowledgeable at all about the beer selection (or not willing to share?), and service was extremely slow (I never did get that extra ketchup I asked for!).   Bottom line ---- we don't enjoy patronizing establishments where the staff is indifferent to your being there;  there are plenty of other bars where food \u0026 beer are much better and your business is appreciated.  We will not be back!", "author": "Maura Q."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}