{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "Superb pub food, lesser known beers on tap and great bar seats [if you can get them] make this place top notch. I love the fact that it isn't overrun with your typical pub clientele no matter what night of the week and there was only one television! Wish there weren't any, but for now - Hooray!", "author": "S B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-15", "description": "Very nice neighborhood bar.  We walked the Brooklyn Bridge from Manhatten and ran smack dab into this great spot.  Clearly a neighborhood fav, with good food and beer selection.  The waiter seemed a bit pre-occupied, but we were in no rush and I chose to write it off.  I'd give a second chance for sure.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-24", "description": "My favorite place in Brooklyn Heights.  Always the best beer menu, and selections will rotate based on what's good and available from distributors.  Right now the Wrassler's XXXX Stout is on tap and simply amazing.  Not sure what you'd like?  The bartender is always good to give recommendations and a taste.   Smart, friendly service, great neighborhood atmosphere.  Great food menu as well.  Meet up here with a crowd or just a few friends, or go it alone -- this place is perfect for all of the above.", "author": "K R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "Solid beer selection, (not your regular domestics) and decent food. My only gripe was the Sweet potato fries were under-done. Eh, no worries! Looking forward to many return visits!!", "author": "Erik C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "Reliable neighborhood hangout with impressive selection of draft beers and good comfort food.", "author": "Tom P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "Excellent low-key place in North Heights.  Decent food and great beers.  Should get some more wines to compete with other hood haunts.  Great to go alone and sit at the bar or with 1-2 friends at a table -- you can actually talk and hear in this bar.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-24", "description": "The Henry Street Ale House is your  typical local watering hole.  I came here with a recent friend for a second time and only recently got the nerve to review it.  If the Henry Street Ale House is shooting for the \"we have a bajillion premium hand crafted micro-brews on tap\" feel, then they have failed miserably.  I have imbibed both the tapped beer and the wine.  The house Merlot was nothing short of terrible.  They do have Magic Hat #9 as well as some others, but it is far from an exhaustive list of draught beers.  Our serving wench (and I use the term serving wench for terrible waitresses), was far from intelligent when prompted for recommendations.  I enjoyed the atmosphere, dim lighting, good jazz played at the appropriate level to maintain a conversation with my company at a volume considered less than a dull roar.  Another peeve of mine is when the \"hired help\" continuously asks if I'm done when they can still see the liquid contaminants in my drink as well as my lady friend's.  Another bummer was when they snatched our candle off of our table, despite the fact we wound up staying many more hours.  \n\nTo reiterate:  Good local watering hole, not for the beer snobs looking to try the latest and greatest micro brew on draft, bonus points for ambiance/aura/environment.\n\nI'd definitely go back if I'm in the heights again.  This is the type of place that you just \"end up\" at if you can't think of anywhere else more intriguing.", "author": "Chris J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "Had an excellent evening here. My girlfriend and I ordered the turkey burger with cheddar, bacon, and bbq sauce and the turkey club to share. The waitress had suggested it as one of her favorites. We loved the turkey burger, but we weren't too keen on the turkey club -- not because it was bad, rather we just didn't like the ale house's take on it. Our server comped the club, and we ordered a second turkey burger to split. Amazing.\n\nOur server was very helpful and accommodating. The beers on tap are local beers not national beers, which at first seemed like a turn-off, but it was a great reason to try something new that we liked. I would definitely go here again!", "author": "Thad K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-19", "description": "They do have a great beer selection here, but not many new additions over the last few years. It would be nice to try something new for a change. Other than the beer, the burgers are well above average. \n\nThis is a dark place \u0026 sometimes you need a candle to read the menu. Service is friendly, the crowd is unpretentious (mostly locals \u0026 students from nearby dormitories), and it's a great place to hang out with a group of friends. The large booths in the back are the best areas to be seated at.\n\nThere is a laid back feeling to this place \u0026 I've never had a negative experience here.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-30", "description": "The food is standard bar fare, but the choice of the beers on the tap is plentiful and the atmosphere is welcoming and unpretentious.", "author": "Anna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "Whenever my family comes to visit I love taking them to Henry's. If you decide to get food please order the turkey sandwich; bacon, lettuce, turkey and best of all a couple of slices of apple that make it incredible. They also have a pretty good selection of beerI always get the Abita Lite on draft. I hate going to places that have goofy or ass hole bartenders that are really fake. Henry's bartender is easy going and can really talk to you not  \"I work here so I have to talk to you\" but carry on a conversation.", "author": "Jillian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-24", "description": "Henry Street Ale House is always a reliable option - maybe not the fanciest gourmet food in the area, but I've never had a bad meal there.  The specials are usually worth a shot, and they have fantastic wings (baked and spicy), and I love the french onion soup.  Good service, good beer selection, and usually not so crowded that you can't get a seat.", "author": "Hanna S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-29", "description": "Was in the mood for a good bar type cheese burger and thot hmmm? Henry street ale house may have a good burger and if not, how can u possibly mess up a cheese burger? Well they managed to make the worst burger ever made! Bread was stale \u0026 the meat had bones in it! Two words... Never again !", "author": "Danny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "$7.95 for an excellent burger with fries that are better than five guys. Specials board always satisfies. But the craziest thing is the soups. I can never get over how good the soups are. There's always a soup on the board. And I never order soup, especially at a bar. But they are always delish.  Only gripe, too much chicken on the menu", "author": "M D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-23", "description": "My iPhone was stolen from this restaurant tonight. The staff were only vaguely sympathetic. They told me I could review security footage Tuesday (this is Sunday night). Unacceptable.", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-13", "description": "For that \"I live above this place\" move\n\nSorry Henry St. Ale house, you get no special treatment just because I live above you...\n\nOh ale house....this bar is abysmally average, from the food to the beers, it is just a bar with nothing extra.  The crowd ranges quite a bit since there is a college dorm up the street and you get some occasionally good looking college girls, add to that grandma/grandpa, and the upstart families in the area who have far too much money and you get Henry St. Ale house.\n\nThe food is okay, but once again it's your average bar food.  I would say this place is a misser.\n\nbut then again I could always go there and buy drinks for the young college girls and hope the line \"want to get outta here and go to my place\" works...and we would go upstairs.*\n\n*wink", "author": "Brett C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "Nice place with above-average beer selection.  The food is a little heavy, but you're in a pub, get over it.  I recommend the nachos.", "author": "Jeff L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-03", "description": "I've met at least one Brooklyn Heights local that jokingly calls this place the \"Stale House\" (\"Street\" is abbreviated on the sign), but the name just doesn't fit. The Henry Street Ale House maintains a fantastic stable of beers (the Belhaven Scottish Ale and tastes-better-than-it-sounds Manekin Pis are my personal favorites) and does brisk enough business to keep them fresh at all times. The Ale House is open very late, it's fairly priced (at least compared to some other bars in the area), and maintains a very laid-back atmosphere even when it is at its most crowded.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-23", "description": "Chicken pot pie and macaroni and cheese really did the trick. The room temperature taps across three beers, two of them American beers with little heft unless cold = less effective.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-18", "description": "This would be a 4 or 5 star bar, but a few things stand in the way of that. Let me start with the good...\n\nBEER SELECTION- this place has one of the most notable beer selections I've ever seen. In addition to a few favorites like Hoegaarden, they carry many quality beers that you are unlikely to see in a supermarket, and they always have interesting seasonal selections. Although it isn't super cheap, the most you pay for a beer is maybe $6.50, and for that  you are getting something pretty great.\n\nLocation- I was born and raised in BK Heights, and while I love its homey atmosphere, there aren't too many good local watering holes. If you're in the north Heights and want a place to get a relaxed drink, this is it.\n\nAnd now the bad...\n\nTheir most regular bartender (who I think may be the owner or manager) treated a friend of mine very poorly, and it left in awful taste in my mouth.  She went to the bar to order a drink and he asked for ID, so she showed him her passport. In response he told her that she should get a \"real ID\" instead of a passport. When she asked him why he wouldn't take a passport he said it was because he thought she was sixteen years old and continued to refuse to serve her. It should be noted that everyone else in our group had already been served at this point, and some of us even also had passports for our ID. We decided to go elsewhere, even though a few of us had not finished our drinks. While we were putting our coats on, another friend offered the girl in question a sip of the drink she was going to discard. When the bartender saw my friend taking a sip, he screamed \"Get Out!\" at the top of his lungs in a kind've inhuman fury. Luckily we were already heading to the door.  After that I did not go back for a long time. About a month ago, I broke the strike to get a drink with a local friend.  It was fine, but the bartender (a different one) was not very friendly and called for last call an hour early, which was odd.  \nOverrall, this place is only worth it if you don't want to leave the Heights", "author": "Samantha C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Henry Street Ale House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "62 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/O9vaeX9SUKHb5lUcAMF48Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185224801"}