{"aggregateRating": {"reviewCount": 33, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-22", "description": "Had the chicken avocado arepa.  Not the best arepa I had it didn't have a lot of flavor. I loved the personal phone call the cashier was on while I was ordering too!", "author": "Tania A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-11", "description": "Greasy and flavorless unless grease if your favorite flavor skip this vendor. I had the patacon madura and they were out of avocado so they subbed in lettuce:(", "author": "Kyla B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-11", "description": "First off, this is not an arepa. Which would be fine if it tasted good, but overall was lacking flavor. I was disappointed. Also, sweet plantains they sell aren't really sweet plantains. They were a cross between platanos and tostones, but not sweet at all. Their food is made to order so be prepared to wait 10 minutes for an arepa. Also, make sure they get your order right because mine was messed up. I really really wanted to like this place because I love arepas but unfortunately this place is a no go. My photo shows an \"arepa\" with beans, cheese, avocado, and \"sweet plantains\".", "author": "Steph F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "3.5 for the arepa quality and 2 for the arepa filling. I grew up eating arepas in the east village and was excited to try the arepa lady on a trip to downtown Brooklyn. However, after an oddly long wait for the arepa with beef, black beans and maduros (sweet plantains), I was very underwhelmed. The beef and beans were completely under seasoned and made tolerable by the available sauces, particularly the garlic. There was a few beans and one SOLITARY maduro, which I found at the bottom when I was about to return to ask if I had been given the wrong order. I could see why a woman after me in line ordered extra maduros for her arepa containing \"maduros.\" If you've never had Venezuelan food in your life and won't have the opportunity to, and also don't care about seasoning, then this is the place for you. Otherwise, pass.", "author": "Justine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-04", "description": "Food was Okay the arepa was a little dry but the chicken was very juicy or maybe the arepa was just burnt but  Can I please get the register girl number she is smoking hot !!!!!!", "author": "Michael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "I have been twice in Dekalb Market Hall. Both times, delicious! Service was friendly and quick. It's a favorite of mine now.", "author": "Amy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "I had never even heard of an Arepa before, but have I been missing out. So very tasty, especially for a good court.", "author": "Shellie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "This place is so good! The arepas are fully packed all the way through and they don't fall apart while you eat them. Super flavorful \u0026 filling. They also have micheladas!", "author": "Abby C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "Don't bother and visit the original location in Queens. They are serving \"fast food\" and the quality of the arepa de choclo suffers. It is not made to order and it does not taste fresh. Waste of $$, super disappointed because I love fresh arepas (huge difference). The arepa rellena was ok. But, please go to Queens.", "author": "Desiree R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-04", "description": "Things you don't expect when you order an arepa from an empty arepa counter in a food court...waiting TWENTY minutes for your food. During that time only two orders were produced so it wasn't like they were backed up. There was no apology for the delay either. This place needs a sign that says \"warning food will take 20+ minutes to be prepared\"\n\nAdditionally, the food was under seasoned and not worth the wait.", "author": "Pam P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "I'd give the arepas con chicharron five stars, but the other item I got (the bandeja paisa) was not good.  It didn't taste authentic (the only good things were the chicharron and the egg, everything else lacked flavor) and it was very small when compared to most other bandejas.", "author": "Mary G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "his shit littt. didn't expect much, had a pleasant surprise. thought it was Mexican, cuz it was corn based, but I learned it was Columbian. shit bomb. keep doin what y'all doing except the long cook time. I mean it's nice to know tht shits getting made fresh but it took a while for the food to colme out. like 15 mins would have gave you 3 star but the food was worth the wait so....y'all get 4", "author": "Jun J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "This place is amazing. Overall the whole food court is really good , but Arepa Lady is one of my favorites.", "author": "Alejandro O."}], "servesCuisine": "Colombian", "priceRange": null, "name": "Arepa Lady", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Sq W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/6ns0KY_KkR7JZEIEPojA_w/ls.jpg", "@type": "Restaurant", "telephone": ""}