{"aggregateRating": {"reviewCount": 33, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "I was craving to go to arepa lady for months. Growing up on this type of food and living in brooklyn is so hard to find. They're located inside the dekalb market , it's more order over the counter and eat as you go /foot court experience.\n\nThe food I'll give it a B , it's a little dry considering if all the arepas / patacón I've had with have a good amount of flavor with moisture , other than that it pretty good. \nI really enjoy made fresh to order ( ++) one reason it's a drop of the start is the moisture of the food.", "author": "Chastity M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-28", "description": "I'm an Arepa Guy,* and as such I've been hearing about the Arepa Lady for years. It's weird that we've never crossed paths until now, as you'd think we'd run in the same circles.\n\nIn any case, I was excited to finally try the Lady's arepas, and I went with the Arepa Rellena con Carne Desmechada (filled with shredded beef, sweet plantains, and black beans, and pronounced poorly by me). \n\nIt was solid. The beef was juicy and well-cooked. Unfortunately, the arepa was dry and not as crisp as one might hope, the plantains weren't quite ripe enough, and the overall effect was pretty bland. It was in desperate need of the green sauce that the staff forgot to throw in my bag, which is an utter shame because I live for that green sauce.\n\nI'll be back to give them another try, but I'll die before I leave without green sauce next time. \n_____________\n\n*I am also an Arepa Gentleman, so I tipped the staff very well.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-31", "description": "4.5 stars.  I love Caracas arepas, and think Caracas is probably better, but Arepas Lady is really tasty!  I had a savory arepa with beef and plantains.  The beef was salty and very tasty.  My one complaint is that there weren't enough plantains - the beef to plantain ratio was off.  I also ordered a sweet choice - avocado, cheese and black beans on plantains.  It came with lettuce, which I didn't think combined too well with the rest of the sandwich, and the cheese wasn't melted enough, but I still devoured the thing.  \n\n\nPrice: I don't mind spending a lot for good food, but I can see why someone might think $9 is a lot for the pretty small (savory) arepa.  They are pretty filling though.  \n\nThe wait: I was the only person on line when I arrived at 4:50pm, but it still took a good 10 minutes.  A bit too long, but not long enough to deter me from devouring Arepa Lady again soon! \n\nUpdating my review -- had arepas two more times since my first review and the quality was off -- the beef was totally lacking in flavor, insufficient quantity of plantains, and the ingredients weren't spread out well - I got my Arepa with a huge glob if unmelted cheese sticking out and not really in the Arepa at all.  I'd suggest to the manager/owner that you train your staff better at preparing the arepas.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-11", "description": "I've been reading about the Arepa Lady since I was a teenager/university student dreaming about moving to NY, and I delighted to finally get to try it.\n\nThis location is in the Dekalb Food Hall, which I thought was an awesome place. So many interesting foods to try! The only food hall I've been to in my hometown of Toronto is much smaller and the food is pricier, though if you convert it to USD, I suppose the costs are comparable.\n\nThe wait was long, as many other people have pointed out. In short, I think the food was good but not amazing.\n\nWe first ordered the chorizo arepa de queso. The chorizo was good but not as peppery as I expected. The arepa itself was quite dense, thick, and hard to cut. It was also very sweet, which to be honest, I wasn't a fan of. And it wasn't crispy either, which is what I was kind of hoping/expecting, seeing the brown marks on the outside. But the hot sauce and the garlic sauce were very good.\n\nThen I remembered that the arepas I originally read about were more like pockets, as opposed to wraps. I was told that those are the arepas rellenos (filled arepas), so we decided to order a mixto (with chicken, steak, and sausage). I liked this one better because it wasn't sweet and because it was crispy. However, I didn't think the three types of meat went together THAT well - we probably would have enjoyed a one-meat filled arepa more. And this one was rather small in comparison.\n\nThe other issue I have is that in both cases, the cheese was not melted at all, which was kind of disappointing. I think they'd taste better if the cheese was gooey.\n\nThis combined with how long the wait was...I was glad I finally tried it but probably wouldn't return. (But I'd come back to the food hall to try the other places!)\n\nAlso, this location is super well-located because there's a Target and an Express outlet nearby. :D", "author": "Dawn G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "I went to get an order of Chicharron which came with plantain. I didn't know it came with plantain as I don't eat them, and the cashier offered to give me extra chicharron instead of the plantain. The picture shows how much chicharron I got for $6. I will never go back here again!", "author": "Kai M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "These are sooooo good. I always get the one with chicken and avocado. And the garlic green sauce is to die for", "author": "Karelyn V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "As I have low expectations from Dekalb market, I also had low expectations for this place. The food took a long time, even though it was for just one arepa. \n\nI got a mixta arepa which is an arepa that comes with chorizo, steak, and one other meat I forgot. Topped with cheese that wasn't exactly melted, but I assume it's supposed to be that way? The arepa was good, nothing super spectacular. However, it was pretty small. For $9, the arepas are the size of a cookie. I left-- still hungry. \n\nThey have canned Colombian kola and manzana apple soda for $2 each, which I thought was kind of cool. \n\nOverall, I wouldn't come here again just because the price isn't worth it for what you get. But since the flavors aren't bad, I guess I'll come back if I'm REALLY craving an arepa and there's nothing else nearby.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "Simple but surprisingly delicious! I ordered the arepa de choclo and the corn dough was the best part. The dough was buttery and amazing, but the cheese could be melted a little bit more. The cheese felt a little cold, considering the wait time on the food was so long I thought they were making it fresh. It looked like the kitchen moved slow overall for everyone, so I'm wondering if others got cold food as well. \nThis place has great food, but slow service.", "author": "Joy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "oh patacon, how you make me crave for ya! the mamas in the back are working hard, and they're very generous w their ingredients! can't wait to go back!", "author": "Karry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "Today I tried the sweet and green plantain patacones and it was delicious. Inside this plantain sandwich comes lettuce, cheese and avocado. They also provide this green and red sauce which was a great additive. The cola champagne and Colombian beer was delightful! I really enjoyed the flavors. The chicarronb(Pork) was made perfect. It was diced up and fried to perfection, the diced chicken was also tasty and flavorful And shockingly it was filling!!! Definitely a place to try and I'll be back!!", "author": "Pamella D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-05", "description": "Honestly, food is great but the service is terrible.\n\nBy terrible I mean I ordered 3x items for pickup and only received 2. \nStil l got charged for 3 items though.\n\nGreat food, but wouldn't bother visiting since it's not worth the bad + extremely slow service. Too many other great options around that actually cares about how they're running their business.", "author": "Leo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "The Arepa Lady's set up in the food hall known as the Dekalb Market is an awesome addition.  It adds a food product that I can hardly find anywhere, and it's done especially well.\n\nExcellent arepa de queso (cheese arepa) topped with pollo asada (sliced grilled chicken), cheese, and the various dipping sauces.  I particularly enjoyed the garlic sauce.\n\nNext time, when I am not there shortly after a workout, I will grab a michelada or even a Colombiana beer to accompany my meal!", "author": "Charles B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-23", "description": "Never got my food after 20 minutes of waiting (actually standing there!) and it wasn't busy. They hadn't even started making my order. I left hungry without lunch because I had to go back to work. Poor customer service.", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "I got the chicken arepa and it was delicious! I loved the shredded chicken and the green sauce they give with it added so much more flavor. They definitely stuff their arepas with lots of chicken, avocado and cheese. It takes a little longer to make after you order since I think they make it fresh to order but it's worth it!", "author": "Spurthi A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-15", "description": "Don't waste your money. These Arepas are hard and not very tasty. I have loved Arepas for many years now and this is easily the worst I have ever had. Don't do it.", "author": "Ken M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I was so happy to see that Arepa Lady was coming to Denali market. I haven't had the chance to get out to Jackson Heights to try the OG (which I will) so I was thrilled when this location opened closer to me to hold me over until I can do that. \n\nI ordered the arepa with the beans, avocado, and cheese. There are a variety of meat based fillings as well as a few non-meat based, which I was thrilled about as a vegetarian.  There are also plantain wrapped sandwiches, a few sides, and drinks offered. \n\nMy one, meat free arepa took a surprisingly long amount of time to come out. Not sure what the deal was but I can see that's a reoccurring theme at this location. They probably just need another chef. \n\nThe arepa was delicious, albeit a little stingy with the filling. If there was a bit more filling in this arepa, I absolutely would have given it 5 stars. The flavors were on point and that garlic sauce, my god. I wish I could have a bottle of that to take with me every I go. It is UNBELIEVABLE. \n\nThe cheap, non-environmentally friendly plasticware they give you has a very hard time cutting through the corn arepa. I might suggest a more environmentally friendly and sturdy compost isle or recyclable option. \n\nThe food is good here. If they get another chef to speed up the process and are less stingy with the filling they would have a 5 star option at Deklab market on their hands.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "The arepas here are so delicious.  I like the one with shredded beef, sweet plantains and black beans.  There are so many beautiful looking restaurants in this yuppie food court, but I can never bring myself to try any other food because I am so addicted to Arepa Lady's arepas.  The meat is flavorful and filled with umami taste.  The arepa itself is crispy.  The beans and the plantains make it that much more amazing.  The cheese is good.  They stuff the arepa so full that I have to eat some of the meat out with a fork, so that I can finish it off as a sandwich.  I really get off at DeKalb and get back on the subway for another 5 stops, just to get an Arepa on the way home.  I know this review is so boring, but I just love these arepas!!!", "author": "Kari T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-18", "description": "I came here at about 6:30 on 3/18/19 and ordered an Arepa and two waters. Food was okay but definitely not worth the wait seeing as I was only one of three people in line and the service was seriously lacking. Either the dude running the register couldn't be bothered to get the waters that I paid for and asked him about. Maybe he was overwhelmed with the two new orders or maybe he simply didn't care.", "author": "Jamarius B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-27", "description": "This place is ALWAYS closed for dinner, so when we stopped by the other day and it was open, I decided to give it a try, as did my mom. My roommate decided to go see what else she wanted, and went off elsewhere. Mom and I ordered, which kind of left me with shell shock- these were by far the most expensive arepas I've had. I'm used to $3.50 or so for smaller, $5 or $6 for the larger size like they serve here. Then we began waiting for our food. About 6/7 minutes into the wait my roommate came and stood with us, starting to eat her meal. By the time we finally got our arepas, she was 85/90% finished with her meal. As other reviewers have said, they are NOT quick processing orders. We sat down with our arepas and tucked in. (I got the beans, avocado and cheese.) They were.. meh. They NEEDED at least one of the sauces or else they were very bland. Mom got the chicken avocado and commented the same thing about needing a sauce/being bland a few small bites in. Way over priced, long wait time, bland end product. I'd say take a pass on this stand.", "author": "April H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-01", "description": "Very cheap of this place to charge $.50 per mayo ketchup little bowls. They just give you one per arepa that is only half way filled. The whole bottle used to be on the counter for people to serve how much they wanted to. The shredded chicken has no flavor so it would've been nice to add whatever amount of mayo ketchup I wanted. You know, so it's not as bland. Also have tried the bandeja paisa and the beans have no flavor either. Hard pass for this place. Bland, disappointing and ridiculous. \n\nAlso, the girl you have at the cashier tonight got a few orders out wrong. Job's not hard.", "author": "Joel I."}], "servesCuisine": "Colombian", "priceRange": null, "name": "Arepa Lady", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Sq W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/6ns0KY_KkR7JZEIEPojA_w/ls.jpg", "@type": "Restaurant", "telephone": ""}