{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-18", "description": "These guys also come to the financial district (Broad \u0026 Water) .  \n\nI was craving a burger and they were parked right outside my office.  So, I gave into temptation and got an average burger with some decent fries.\n\nOverall, I don't regret it, but it's not the best 700 calorie meal I've had for $10 in the area.", "author": "polina g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-24", "description": "It's nice.\n\n\n\nSeriously, that's all I really have to say. Okay it's not, but that's the feeling I had after eating my food. The \"mesclun\" lettuce seemed Costco bought (and extremely... sad and wilted by the heat... there's a reason other lettuces are used) and the fries were nothing to write home about. The brioche bun was nice and the gruyere was well, gruyere. But my burger was charred RARE (didn't ask how I wanted it cooked), and after hearing about someone dying from E Coli the day before, was not happy with the prospect of death by raw burger (disclaimer: I like my steaks medium rare and my burgers medium).\n\nIn the end it was a fairly tasty burger, but nothing that blew me away. They did give me a \"Buy 10 Get 1 Free\" cards and a peach gummy, but I don't know... just couldn't get excited about it.\n\n2 stars for a decent burger\n\nRevisit? Not anytime soon", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "Pretty awesome burgers!! So juicy and tasty! Their fries are also beautifully fried! Yummo!", "author": "Tash R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "very good burgers\n\nvery good belgian fries\n\nlove their weekly specials!", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-24", "description": "Over priced for what it is.  Not terrible but definitely not worth the wait or the money.  Plus my burger was very rare... Hoping I don't get sick", "author": "nate d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "I like burgers. I like fries. So it's a no brainer that I would seek out Frites 'n' Meats when it came close to my workplace. The staff is friendly, and even with a big line, your food comes out reasonably fast. I liked all of the ways you could personalize your burger--from the meat choice to the cheese to all the toppings. The basics are free and the only negative thing I have to say is that the first trip I definitely got the wrong bun (go with brioche). The fries are out-of-this-world worth blowing your diet. Not for everyday, but a great treat if it's nearby and worth trying or engaging for a fun event.", "author": "Cara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "I was down in the financial district for training and saw them right off of water st.  Since I was already running out of my lunch hour and the smell of cooking meat enticed me, I  had to satisfy my carnal desire for a nice, juicy, delicious burger.  After I had returned from the ATM, the line had grown substantially so that was a promising sign.  They leave little order cards outside so people can make their selection to speed up the ordering process but you can also go right up and tell them what you want.  \n\nThey carry a small selection of drinks and everything is made to order.  On this particular day they had a special going on for \"marital bliss\" which sounded interesting.  It was a burger composed of bacon, cream cheese, and jalapenos.  Being a burger, you've gotta order fries.  There were at least 5-6 people who were in front of me waiting for their orders and from start to finish it probably took about 15 minutes and $12.50 for me to get my food.  I hurried back to the building in anticipation of  the tasty treats that awaited me.  Opening up the bag, I found my fries wrapped in a conical piece of wax paper (nice touch!).  The fries were perfectly fried, nice and crunch on the outside with a beautiful golden brown color.\n\nOn the website they say they cook it medium rare before wrapping it up and  the retained heat will continue to cook the burger as you walk back to work so when I got back, my burger was well done with some odd spots of pink.  That first bite was.......ok.  I though the cream cheese and bacon worked very well with the flavor of the meat but unfortunately my burger was dry.  Not horribly so, but I've had juicier well done burgers before.  The bacon was of high quality, thick cut, with a great smokey flavor.  The jalapenos could have been left out of the sandwich since it got completely lost in all the other ingredients.  If I get anything with jalapenos, I'm at least expecting at minimum some kick out of it but got nothing. Overall however, I was still very happy although I believe next time I will ask them to cook my burger a little less so that residual heat can cook it to that perfect medium rare consistency that I desire.\n\nIf I was in midtown working, I wouldn't mind giving this place my business.  However for a $12.50 meal coming out of a truck I've  gotta say that's pretty darn pricey.  You can go get a pretty nice burger at some sit down restaurants for that amount.  The guy working the counter was pretty friendly and kinda reminded me of a scruffy looking Mark Wahlberg.  They also give out business cards that if you get it punched 10 times you earn a free burger.  So maybe I'll end up being like Elaine from Seinfeld and eat 9 more burgers just to get that free one!", "author": "Phil L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-06", "description": "\"let's fool people by letting them wait in a 30 min line for a sample of our menu and tell them they are ONLY GOING TO GET OUR WORLD FAMOUS COLE SLAW!\". (sarcasm about the 'world famous'.) This is exactly how I felt when I waited in their line during the mexican food truck cinco de mayo shindig they just recently had at seaport. What a crock of bullllllllll. If you are going to give out samples of your food. How about you actually give out a sample of your food! And not a condiment. My impression is that if they are not confident enough that people will come back after a small sample, their food really is not worth it.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-11", "description": "my husband is in bed with food poisoning from these guys. they served him an undercooked burger, which they claim will cook as you carry it, from their website. Only, don't think it will \"rest\" when the temperature is below freezing. I'll be calling the health department tomorrow.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "great burger and even better fries (thin, large sea salt crystals, little oil). 4 stars instead of 5 because i never can find them (heard the truck caught on fire at some point - yowser!).", "author": "Dave N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "I am EXTREMELY impressed when good food comes out of a truck, although I tend to be a little bit more giving with food-truck-cooking. A delicious burger is a delicious burger no matter which way you slice it. \n\nExtra burger points goes to their phone-in/pick-up service.  It's lunch, I don't have time to walk more than 3 blocks AND wait in line for my lunch.  Are you nuts?  It's NYC afterall.  Whoever thought of this idea into their business model deserves free burgers for life.\n\nOther honorable mentions include their aioli dips and dumdums in all orders.  I love these thoughtful extras!", "author": "Emma L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "The food is great, and the menu is diverse down to the choice of beverages. The Burger of the Week always has enticing ingredients that never feel like its too much on a burger.  \nAlso the staff is packed with great personalities, and cooks.  The price range for their food is also fair for what you get. It really is my favorite food truck in NYC,a nd i've ate at Gorilla Cheese NYC, and The Frying Dutchman, and Frites 'n' Meats takes the prize everytime, and leaves me not wanting to eat for the rest of the day! I hope they stay around for a while!", "author": "Gabriel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "This is one fabulous food truck! They serve one of THE best burgers I have ever had. I highly recommend them to anyone. You won't be dissapointed.\n\nThe staff is wonderful and makes you feel great when you walk up. Great food + Great service = a great experience!", "author": "Rockie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "Others in the office loved the fries today......Some say the KOBE was LEGIT!.......All in all good value for your money.", "author": "Arvind A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-12", "description": "$10.00 for basic hamburger (unfortunately raw throughout the burger) and fries(excellent). Disappointing 2nd experience with same cooking problem.  Not trying again. Sorry.", "author": "M. R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-12", "description": "Just not that good.  I WANTED to like it.  Getting a buger from a truck is always fun.  But the burger was mealy, like a microwaved gas station burger.  Fries were OK.  The French Fry sauces were great, especially the sun-dried tomato aioli.  Too bad...", "author": "Aeg S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "The truck comes near my office on Mondays which is the perfect day to reward myself with a moist burger that I can tell myself is \"mostly good fat since it's grass fed.\"  Seriously, both the angus and the kobe are clearly a couple cuts above a conventional burger in terms of flavor and if not exactly \"healthy\" at least healthier.  Sure is good for my mental health.  The guys are a pleasant bunch. I can't tell if ithey are braniac foodie gourmets posing as regula' guys or regula' guys posing as braniac foodie gourmets but either way -  they always cheer me up with their banter even before the loaded burger really makes my day.  For me, a testament to the credibility of the \"healthier than a conventional burger\"  theory is that even when I go nuts and add the fries to the order, the comfort food moment is followed by a burst of productivity in the office, where I've had myn hsare of burgers that just make me want to take a long nap.  My philosophy pretty much whenever I dine out is \"heavily weight your selection towards getting the special\" and it has never failed me here.  And you gotta love the frequent flyer card....", "author": "Roberto M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-26", "description": "Sorry, not a fan.  I guess my expectations were too high for truck food, but basically the Frites n Meats burger tasted like a Roy Rogers cheeseburger to me.  There is way too much roll for the burger, and I found it hard to believe they came from Bathazar.  Still, it was a better option than fast food.", "author": "Debbie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-06", "description": "Wow talk about disappointing. This truck is outside my building every Wednesday and I always hear my coworkers raving about it. So I decided to give it a try when I saw they were offering a Makers Mark Burger. First off the burger is 12 dollars; yes it is Kobe beef, but still steep. The beef patty is very small. For 12$ I was expecting something a little more substantial. The onion jam they put on it was almost nonexistent, it only covered about a quarter of my burger.  Needless to say the food did not live up to the hype. I will not be returning to this truck anytime some. You are much better off at 5 guys or some other burger place.", "author": "Mariano R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-01", "description": "I guess this is a 2.5, but I'm going to round down.\n\nThis truck was parked outside my office only once, but that's all well and good because I probably wouldn't go back.  Nothing was particularly BAD about Frites 'n' Meats, but nothing was particularly good either.  The burger itself was a bit undercooked, and the small patty seemed dwarfed by the much larger bun (I don't remember exactly which one I got).  A poor meat to bread ratio makes for a poor burger.  I also felt that the mesclun greens just did not work on the burger. I would much rather have some chopped lettuce or a big sheet of iceberg for that matter.  The crunchiness and lightness of said lettuce I feel is much better suited for a burger.  The fries were also just OK.  They tasted just like Burger King fries, which isn't necessarily a bad thing, but also not what I expected.  Admittedly, I didn't get any of the dipping sauces, but I don't imagine they would have done much to improve my experience.  \n\nFactor in the relatively high prices and the insane hype for this place, and it makes for a pretty disappointing experience.", "author": "Elijah D."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}