{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "I just happened by this truck.....Thank you FOODIE GOD!...I had the burger of the week...THE OINKER!.....best pork burger...the frites were ok...the spicy chili dipping sauce for the frites.....AWESOME!.....and they have SMASH  drinks!...I can't wait to go again!", "author": "Tessa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-05", "description": "Overrated and Overpriced.\n\nThat was going to be my whole review, but I figure I leave a little more detail. This moving food truck is hard to miss where you are in Tribeca during weekday lunch hours. They primarily offer 2 burgers, an angus burger or an american kobe wagyu burger. You pick your bread, some toppings wait like 10 minutes or so and your food is ready. Depending on the toppings, it is either free or 75 cents. They give you a printed postcard menu thing to refer to and you have to fill out some order form. My first time there the guy insisted that I fill it out, so whenever you go, please make sure you do. \nThe burger is ok.... I mean I make a better tasting burger at home on my George Foreman grill. ( Bubba Burger patties are the best!) I honestly could not tell the difference between the angus and the wagyu but either way they are expensive - base price of $5.50 and $7.50 respectively. After adding the toppings you may potentially have a $9.00 burger...from a truck in the middle of TriBeca. For $9.00 I think I would not mind to have at least some fries or a soda included.\nAhhh french fries or \"Belgian Frites\" as they would like to call them. They charge $3.00 and then $.50 for the dipping sauce of your choice. ketchup is free though! They serve it to you in this cone, and inside the cone I counted exactly 11 fries. Nice! Then I also bought a soda...\n\nSo for like $13-$14, I had a completely overpriced, overrated and unmemorable burger for lunch.\n\nThe End.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-24", "description": "the thing about the off-season is that you get so excited for next season that you kind of forget all the things that sucked during the previous season.  the absence of the thing you desire blurs all memories, lessening the negatives, amplifies the positives.  you find yourself mid-february calculating the excruciating hours until opening day, scanning your twitter feed for signs of life, a hint that your hopes for the upcoming summer might be realized....\n\nof course i'm talking about food truck season.\n\ni thought i had chosen the perfect lead-off vehicle for street meat season -- a personal, long-held mecca of nyc truckdom: frites n meats. \n\nthe frites are delicious, worthy of the trip in and of themselves.  double fried? you must be kidding.  double fried in what? crack cocaine? they were so perfect that i practically ate the whole bag on the walk back to my office -- but i had to save some to enjoy with my choice of side: garlic aioli.  so amazing.  i mean, if you're into garlicky oily mayonaissey wonderfulness.  and really, who isn't?  i'm definitely raring to try all the concoctions they offer -- spicy chili aioli? yes please!\n\nsadly, just like the mets, the burger itself disappointed.  my kobe burger was chewy and not cooked evenly.  the brioche bun disintegrated in my hands.  i know it's barely opening night, but i was expecting more from them.  maybe it was all the hype.  maybe my expectations were high.  they are cooking inside a truck. as every year, i have to remind myself of these facts.  one must take into account the handicaps of said vehicle.", "author": "Mag M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-25", "description": "I was craving a burger, so I finally decided to try this food truck...bad idea.  The burger was overcooked, the bun was dry, and they didn't include two of the toppings I ordered! It reminded me of a bad version of a burger from Burger King.  I love getting food from trucks and vendors from all over the city, but this place is extremely overpriced for the quality of food they serve.  One star for the nice guy who took my order.", "author": "Christine J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "If you love gimmicks then you will love this place.  I'm guilty.  I love how you place your order on postcards by circling what you want.  I love how they give you a mini fork with your fries.  I love how they ask you for your super hero name and call you by that on the mic when your order is ready.  I love how they give you a little dumdum lollipop with your order.\n\nLast but not least, I love their food!\n\nI had their burger of the day, which was the \"Oinker\".  It consisted of a seasoned pork patty, gruyere cheese, thick cut applewood smoked bacon, some kind of sauce, which I forgot the name of it but was great.  I added raw onions, mesclun greens, ketchup and mayo on a brioche bun.  It was crazy good.  I don't even think I chewed.  Ate that thing with no shame at work, greasy fingers, sauce all over my face, the whole nine yards.  Straight up beasted it.\n\nTheir fries were aiiiite.  I think it's the sauce that makes them better than they really are.  I had the spicy aioli sauce with them. \n\nMy order came out to $12, a bit pricey for food from a truck but at least it was great tasting!", "author": "Yu-Ching L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "the burger and fries were awesome...but i was so sad today. i got a HEAP of fries for $3 and they forgot my fry dipping sauce. they're just not the same without...", "author": "Alan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-19", "description": "One of the best burgers I have ever had.  Good food truck food and very friendly service.", "author": "Donna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-19", "description": "literally just finished my angus burger. \n\nthe guys in the truck were friendly and we chatted about various burgers in the city. awesome guys, but back to the meat of the story. \n\ni got an angus burger (medium rare) with applewood smoked bacon, Gruyère cheese, and the typical toppings of onion, tomato, lettuce. when it comes down to a burger, its all about the meat. it is its time to shine. the patty in my burger was good, but not great. even though it was supposed to be medium rare, it was well done all around the outsides. it was medium near the center of the patty. because of this, i believe it be become drier than it should have been for a medium rare burger. it was a bit charred, but not too bad that it would cover the flavor of the meat. \n\nthe fries, were not salty at all. i guess someone read the yelp reviews and cut back on the salt. but as god as my witness, i could have sworn these were mcdonald fries. it had the same shape and texture. it was very similar to McDonalds. even though, they were very good. i could eat a bucket of them. i got the sun dried tomato aioli which was awesome. the garlic aioli was fantastic. if you love garlic, you will love the aioli.  \n\nall in all, it was a good burger. the only thing that would have made it a GREAT burger was if it was less well done and more medium to medium rare. \n\nthis is a great addition to the neighborhood filled with halal meat carts and hot dog vendors. i will definitely be back!", "author": "Killerasp K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-23", "description": "I walked all over the financial district to find this food truck.  It was totally worth it!  The burgers are fantastic and the fries are not to be missed.  The guys were incredibly friendly as well.  They threw in a free brownie to make up for all the time I spent looking for them.  I will definitely be going back upon my next trip to NYC.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-10", "description": "Burger was really good and the fries were great.  They are only near my office one day a week so I have not had a chance to try any of the specials burgers of the week but the one I had, \"The Cubano\" i think it was called was great! Quality ingredients all around!", "author": "Chris R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-22", "description": "Disappointing \u0026 Deceiving. Belgian Frites MY ASS - Just slightly above McDonalds - skinny half soggy pieces of potatoe. They need to go to pommes frites on 2nd avenue and take lessons.", "author": "simona b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "The burger from here was great, the fries and dipping sauce amazing, and the customer service stellar. This burger is coming from a truck! It's not Shake Shack but it's a great effort.", "author": "Chris N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-01", "description": "one of the worst burger we've ever had, and it's pricey for that quality food.our burgers and fries are cold, and they are still raw in the middle. basically we have to pick out the cooked part of the meat to eat. we are definitely the one-time customer for this food truck.", "author": "Dong V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "Frites n Meats was a first stop during my visit home to NYC in December. Wish it were around when I lived up the street. I'd have been a regular.\n\nNo need to overcomplicate this. Thoughtfully sourced ingredients, like murray's cheese and balthazar breads atop angus and wagyu beef made by guys who clearly care and understand food.\nAnd whattaya know? You wind up with a very tasty burger. \n\nMy angus burger was pink in the middle and charred on the outside and had flavor galore. Onion jam, applewood bacon and gruyere were great additions that elevated but could never overwhelm the beefy taste that is the real point here. \n\nThese guys deserve a lot of credit for raising the bar. Everything on this sandwich has taste. It's well-seasoned, well-composed and balanced and has tons of flavor.\n\nSoup was crazy good too. Not to belabor it. Nice texture. Again, flavor flavor flavor. Not your deli soup. These guys are good cooks.\n\nCookies would've been worth a stop on their own if I'd happened by a second time. Very good cookies.\n\nThe fries were merely good. They were great beside the burger, and I would definitely get them again, but I'm not saying you should line up here for fries. Admittedly I ate mine a little cold -- I really shouldn't critique the fries at all. Right out of the fryer, they might've been perfect.\n\nI really wish there were a truck up the street from me in Northern Cali that would serve me a nicely charred yet not overcooked burger with an onion compote, applewood bacon and small production gruyere on a great brioche.", "author": "brian m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "Best. Fries. Ever!  My kids pine for this truck to come to our neighborhood.  We really appreciate their super - active twitter account which keep us posted on their arrival to Tribeca.   As soon as they arrive, we hurry over and dinner is served! The food is terrific and staff is always friendly.   Frites n Meats has certainly made me a food truck convert.", "author": "Carol A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-19", "description": "I've been wanting to try this food truck for the longest time based on all the positive reviews I've read on yelp about it.  It was in FiDi today, a bit of a walk from my office but I decided eh what the hell I'll suffer the cold and take the stroll down to water and broad.  The guys who work the truck genuinely seem like nice guys and really care about their food.  However I didn't think it was anything special.  The burger was average, not the best ive had, but definitely not the worst.  The \"frites\" though were a total letdown.  If you want good frites go to Pommes Frites in the east vill.   The frites from this truck might as well have been from burger king, since they tasted identical.  No knock on burger king fries, because I like them, but i would not advertise them as \"frites.\"  I might give it another try one day, but I don't think I will go out my way for it again.", "author": "Marc S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-05", "description": "Website says they do delivery if they are in your are - so I called to confirm they were in Tribeca (yes) and I had a moment of excitement and then was told they don't deliver.  What?", "author": "Kim L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-06", "description": "OK burger.  I got the kobe beef burger with the works.  I definitely enjoyed having untraditional toppings/cheese on my burger but the meat was a little dried (even though it was medium rare).  Definitely would still eat it but I have had better burgers.", "author": "Andy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "We highly recommend Frites N Meats!  When we decided to have food trucks cater our wedding, Frites N Meats was one of the first trucks we thought of. Having tried them before, we loved their food and thought the guys on the truck were really friendly. Right from the first e-mail, we were impressed with Hiassam, one of the owners.  He consistently responded to our questions in a timely manner and worked with us to create a menu customized to meet our needs. The final weeks before your wedding (or any big event) can be such a stressful time, but Hiassam made it easy for us.  He communicated with our wedding coordinator to make sure an organized plan was in place for our guests to place and receive their orders.  Our guests raved about Frites N Meats.  They loved the gourmet burgers, fries and Mash drinks. Thank you Hiassam and the entire Frites N Meats crew!  Can't wait to come back to the truck for some good eats!", "author": "Brian G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-16", "description": "I ate at the truck twice. The first time the fries were cold (not just warm - COLD) the second time they got my burger wrong. When you're only job is to custom make a burger and fries, and you're charging me for it, then you need to get it right. This truck did NOT get it right - Twice.", "author": "Ben H."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}