{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "Stumbled upon this \"burger cart\" last week and had been craving ever since. Unfortunately, I already had a bag of Wendy's in my hand at the time, and it just didn't tast good once I saw the juicy burgers at Frites n Meats. Asked the guy when he's there and he said only on Wednesdays (6th Ave. and 47th Street location).\n\nSo, after a week of waiting, I finally had a chance to try this place today. The line to order was soooo long, but I decided to wait anyways. I was finally able to order about 30 minutes later and then had to wait another 10 minutes for the order to be ready.  The burger wasn't as small as some of the other reviews mentioned. It was pretty good. I wouldn't say it was as good as Five Guys, but it was still good. The $3 fries were ok and a little small.\n\nGiven the cheap price and location, I'll definitely try this place again. Like I said, the burgers were good, but I don't think it was worth the wait on line, so next time I'll try to go there sometimes other than lunch hour. But it would be nice if there was a Five Guys in the area.", "author": "Rashid M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-06", "description": "I was so excited when this food truck was right across the street from my work place; it sounded so good because their ingredients were from several well known restaurants.  But I was so. disappointed.  The truck had an interesting way of taking your order by making you circle what you wanted on their menus with a marker.  \n\nI ordered their wagyu beef burger and knew from the first bite, this wasn't it.  I did not enjoy the bun or the burger which wasn't cooked to order.  The only highlight was their fries.", "author": "Diana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "Lost half my lunch break hunting this place down so not only was i frustrated but my expectations were already very high. I finally found it, (check their twitter!) there was no line thankfully. I ordered the garlicky guac skirt steak burger and side of frites with garlic aioli. Holy shitballs mom.\n\nFirst, it was absolutely massive. Half of the skirt steak was the size of a larger burger anywhere else. I was already in love before tasting it. First bite and I knew this burger was top quality. The cook was medium rare, perfect sear, perfect seasoning, and the guac and onions just made it even better. I was an absolute mess eating his burger along the docks in the WFD but I didn't care, this was my food heaven. Bite after bite this burger was phenomenal.The frites were also perfect, crisp and with a great aioli too. Reminded me of the frites I had traveling throughout Europe rolled up in a newspaper. \n\nThe truck itself is great and the crew is super chill. Guy even offered me more frites on the house when I asked for another bag for the rest of my frites I couldn't finish.\n\nAmazing. Can't wait for next Thursday to try the rest of their menu.", "author": "Johnson P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-19", "description": "After waiting in line in the freezing cold today, I was left with Burger King-style fries and a below room temperature burger. So disappointing. Even the usual go-to ingredients of goat cheese, jalapenos, and ( always burnt) bacon failed to bring out any flavor of this bland experience. Halfway through my burger, i just looked at the monstrosity and shuddered in fear, but I braved on as I didn't want to waste my $12.50 spent.\n\nUPDATE 11/2; Still just as bad.", "author": "Craig K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "I always keep tabs on this truck when its around for lunch. I'm always looking for a great burger with all the delicious trimmings and Frits 'n' Meats is pretty darn close. I usually go for the standard angus, which they make charred on the outside but still pink inside. The extra toppings are great, and there's plenty of exotic cheeses you can go with. Tomatoes/onions/pickes/lettuce tasted fresh and their fries come out almost perfect.\n\nMake sure to order their chipotle mayo to go along with the fries! Always an awesome experience. Watch out for the lines however, you can be waiting for 30+ minutes during lunch for your order. Check their twitter and keep their punch card as you come back for more, and try to call ahead with your order for pickup. A most solid burger option.\n\nHighly recommended!", "author": "Quentin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "Working in the area, most places are very touristy and it bothers me. I like places that are more local and original than a bunch of franchises. Luckily, this truck is right by on Mondays from 11-3PM. But you should check out their site just in case there are any changes in their locations.\n\nSo I came here on Monday. It was so darn cold. There were a couple of people in line ahead of me. So since it was my first time getting food from this truck, I was told to circle what I want on a plastic card. The card also need you to include your superhero name, which I thought was very witty and cute. So I circled what I want and wrote \"Smiley\" as my superhero name and gave the guy the card.\n\nI stood aside waiting for my burger and fries to cook. It was very frigidly cold. It was so cold my hands turned pink, but even on this very cold day there were many people buying lunch from this truck. Which means this should be good stuff. When my order was finally ready, the guy called out \"Smiley!\" And when I approached the truck he asked if I was Smiley and I said yes with a great big smile and he chuckled. But hey that's what I am known for, my smile.\n\nI took my paper bagged lunch and hurried back to the office, so my food won't get cold or maybe so I won't freeze. I opened the paper bag and laid everything out on my desk. The burger was pretty big. It was medium rare, just the way I like it. The burger was very juicy and tender. The juice from the burger drips down with each bite. I love brie and I never had it with a burger, but it was one of the option for cheeses. The melted brie oozes each time I chomped on the burger. I also added applewood-smoked bacon to my burger, which was pretty good. However the bacon was a slight bit tough to chew. The handcut double fried Belgian frites were really crispy and delicious. \n\nLuckily, this truck is only here on Mondays or else I'll get tired of them really fast. And they throw in a lollipop to your lunch, that is really sweet of them! =)", "author": "Sandy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-12", "description": "My coworkers go to this place religiously, so I had lofty expectations for it heading in. I went fairly basic with the burger, and added bacon for good measure. The burger was really undercooked for my liking, and I didn't find out till after that you can ask them to cook it a certain way. I suppose I'm used to servers asking me how I want it cooked. Anyway, the parts that were cooked sufficiently were good, and the bacon took it to a new level. Another knock I had is that they gave me the wrong bun. Although it was still good, I'd have much preferred the one I ordered.\n\nFor those unsure of spending the extra $3 and change on the fries, channel your inner Nike and just do it. They are fantastic, and they give you enough for an entire meal by themselves.\n\nFor what it's worth, I would probably have given them 4 stars if the burger was cooked more and the bun was correct. Otherwise, I felt like it was just another burger. Would go back though, so there's that too. Add this to the heaping pile of wishy-washy 3-star Yelp reviews.", "author": "Mike F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "Awesome burgers. I wait every Wednesday for their truck to park close to work. Their fries are great too. \n\nAll their burgers are made perfectly.", "author": "Sid M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "Delicious burger and fries with a lollipop.\n\nFood 4.25 Stars\nI'll just come right out and say it. I ADORE THE BURGERS!!!!\nNow that I have said that let me go into a little more detail. The burgers are typically cooked around medium (sometimes more towards the medium-rare side) which is what I prefer since the flavor of the meat comes out more. \nMy normal burger is:\nAmerican Kobe \nSesame seed bun\nGruyere Cheese (sometimes cheddar)\nSavory Onion Jam (aka heavenly onion jam)\nYou can mix and match any different style. Many of the add-ons are free, but bacon and avocado will cost a little extra.\nThe burgers are pretty large so make sure you have a big appetite when ordering from here.\nThe double-fried Belgian style fries are delicious as well, but it is the side sauces that truly make them top notch. I usually go with the wasabi mayo and the garlic aoli, but if you enjoy a good kick the spicy chili is the way to go. Also, with every fries you get a nice lollipop as a treat. =)\nI would avoid the skirt steak sandwich, not because it isn't good, but because it is a hassle to eat. The portion is huge in comparison to the price you pay, but it is very tough. I would recommend taking it out of the sandwich and cutting it with a good knife (a plastic knife will not do anything to cut it, let alone put a dent into the meat).\n\nService: 4 Stars\nEven with long lines the burgers come out pretty quickly even though they are cooked to order. The cashier - chef are all professional and know what they are doing and tend to remind the regulars to use their punch cards to get a free burger*\n***You get a free burger after getting 10 punches in your card***\n\nOverall: 4.25 Stars\nI just adore the burgers here. I just wish there was one near me at my new office. If you are looking for a delicious burger and fries for lunch this is the place to go. If you know there is one near you just go outside and follow your nose. The smell emanating from the cooking burgers of this truck is what originally lured me to its location.", "author": "Philippe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-19", "description": "First and foremost, Frites 'n' Meats' choice of mascot begs the following questions:\n\n1) Why the decision to assign a Gaston-from-Beauty-and-the-Beast-look-alike cartoon bull in a Superman suit to advertise burgers sold out the back of a food truck?\n2) Is this bull aware of the implication being made here? Does he realize standing proudly on a giant burger in tights and a cape is not unlike me dancing on a funeral pyre of my fallen brothers' char-grilled corpses?\n3) Am I really spending this much time and effort analyzing a cartoon bull and comparing it to cannibalism, Disney villains, and/or possibly inter-species genocide?\n\nI can only answer \"yes\" on that last one, but, in my defense, I waited a good forty-five minutes for burgers and fries here, so I had a lot of time to stare and think about this one.\n\nI ordered the Burger of the Week because I'm a sucker for a special. Affectionately named \"The Italian Job\", this burger consisted of a seasoned grass-fed Angus patty, mozzarella, parmesan, and gorgonzola spread, applewood-smoked thick-cut bacon, salsa verde and your choice of bun (I went with the potato-onion). But as is the case with most things that sound as amazing as this combo did, the idea of it all proved too good to be true. Don't get me wrong - this is a good burger. In fact, it's easily the best I've had from a truck. But I've had much, much better sitting down at a restaurant. There was just too much goin' on here, leaving me unable to properly pick apart and analyze the patty vs. the bun vs. the toppings because they were all at war with one another for the starring role. I don't want power-struggle burgers. I want peaceful, harmonious burgers.\n\nThe frites were tasty, and apparently, according to their menu, \"hand-cut\", \"double-fried\", and \"Belgian\". I don't how much of all of that I got from these guys. To me, they tasted just like fries and that was good enough in my book. I didn't get to try the garlic aioli sauce I ordered, because, well, it wasn't in my bag. I've lost more than fifty cents before, so this isn't that big of a deal. Unless the garlic aioli sauce is amazing because then, you're damn right, it's a big deal.\n\nStill, it's awesome that they offer a phone number to pre-order, knowing full well the large crowd they typically attract. It's not that awesome that they weren't taking any more orders about a half-hour into their shift when I tried calling. But once you see the line, I mean, you certainly understand. There's a reason Frites 'n' Meats is this popular and I want to believe that reason isn't simply their attractive marketing campaign. I want to believe waiting for forty-five minutes outside of a food truck was worth it. \n\nFrites 'n' Meats is like a big, shiny billboard with some hot supermodel plastered all over it. Or maybe a big-budget summer blockbuster even. They look all slick and sexy on the surface, but neither truly exist because they are either air-brushed or chock full of special effects. Kind of like the world's most famous robot, Beyonce. And in the same respect, this truck does a hell of a job promoting what turns out to be nothing more than something standard (in this case, standard lunch fare), with their cool menu cards that ask for your superhero name, faux-newspaper frites bags, complimentary Dum-Dum lollipops, and yes, even a mascot. It may be petty and even misleading to a point, but these little things can go a long way, because, truthfully, it's just a food truck. And standard lunch fare is really all I ever expect from a food truck in the first place.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "This, by far, is the best hamburger you'll experience that comes out of a food truck.  And it definitely can hold it's own against any of the premium burger places you can think of.\n\nThe truck was happily parked in front of my office building, so I got in line, filled out their laminated menu card and patiently awaited my burger.  I ordered the burger of the week -- a Southwest Fusion Burger -- with the Belgian Frites.\n\nThe Southwest Fusion Burger included \"spicy\" guacamole (not terribly spicy), jack cheese, sweet chili sauce and bacon.   All of the ingredients were spot on and of what seems to be the highest quality.  \n\nI couldn't get enough of this burger and if common sense didn't kick in, I would have gone back for seconds.  Really!  I still have the scent of this burger all over my hands as I type this . . . yum!\n\nThe Belgian frites were very good . . . I ordered it with the garlic aioli (I love garlic).  It was good, but it was basically mayo with garlic mixed in.  I'd rather try one of their other sauces next time . . . something with more kick to it -- but this fact does NOT lessen the all around quality of this lunchtime wagon.", "author": "Jeffrey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "On of my favorite food trucks in NYC. Particularly always enjoy the Burger of the Week. Look forward to their stop in Hudson Square on Wednesdays. P.S. Don't miss the dum dum lollipop at the bottom of the bag.", "author": "Gabriel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-15", "description": "When my coworkers walked in with burgers \u0026 fries from this place, I coudnt help but stop everything I was doing and check out what was smelling so good!\n\nOn Mondays, you can find this truck on the corner of 52nd St and 6th Ave.  Even though it was 20 degrees outside, there were about 8 people waiting in line when I got there...\n\nI decided to \"splurge\" on the $7.5 wagyu \"AMERICAN KOBE\" burger on a brioche bun with the free toppings (cheese and additional cool toppings are $.75 each!) and the $3 fries.  I liked that they had music playing for you, and that you are able to place your order by circling each item on the laminated menu since they do provide at least 3 choices of bun, cheese, etc\n\nUnfortunately, my burger wasnt as good as it smelled...the \"kobe\" patty was a little dry and bland even though it was still pinkish...it tasted as frozen meat not thoroughly cooked.  Everything else was fine, fries were good...\n\nJust not worth a $10+ meal...", "author": "Silvia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "Ok I swore and lied to you all - this week..\nI stated below that I'd return and I would NOT buy 2 orders of Frites...\n\nWell.... that went to sh*t today...\n\nI gave in.\n\nI'm weak.\n\nI have a carb addiction.\n\nI had 2 sets of Frites today.. with cheese sauce/chipotle ketchup *YUMMM!/and the spicy aioli... again... hmmmmmm...\n\nDidn't even want the darn burger..\nEven dragged a poor coworker down with me.. and the poor soul has an addiction now too...\n\nLook at what you've done ....Frites 'n' Meats...\nI used to have soups/salads...and healthy crap for lunch.\n\nNow I'm having yummy....lightly greasy bags of frites...\nEh! you only live once...\n\nOh - and the sexy Marvin Gaye tunes you guys were pumping today?..\nReally? I have a 10 month old.. stop trying to get me in a sexual mood during the work day.. I got enough on my mind...lol....\n\nWill let you know when I get to that burger...\n\nCarry on..", "author": "Alysha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "Free burger alert!\n\nWant a gourmet burger but short on cash?\nThe FnM truck can help you out if you don't wanna drop the cash at a expensive sit down joint or don't wanna spend the extra 2.25 on subway fare (each way) if you are lucky enough to run into it.\n\nNow what if you are you a cheapskate or just flat broke?  I fall into this category so I just rode my bicycle down here and used my tenka deal for a free burger: http://www.tenka.com/web/creative/redeemer-37424/441447.htm  Gotta hurry though because they do disappear (the truck and the free burger deals).\n\nPure genius for marketing on their part. Parking next to Whole Foods where a foodie crowd may recognize the quality. \n\nIt was 6 bucks normally, and I must say it's a damn tasty organic burger.  Now go get your eat on!", "author": "Richard D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "This truck is awesome.\n\nOne of the best burgers in the city.  Solid meat.  Great variety of cheeses.  Good bread.\n\nFantastic frites.  Delicious dipping sauces.\n\nGet a burger and split the massive portion of perfectly crisped belgian fries with a friend and lunch is still under 10 bucks.\n\nIt puts Shake Shack to shame.  Then again, Shake Shack is the \"safe\" choice for the lemmings who line up for it.", "author": "That ronald T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "NY is not great in terms of food truck culture. You'd expect it to be better, but of course parking is an issue. Still, Frites \u0026 Meats is one of the better options here. Recently, they're most often near the Satchi  \u0026 Satchi offices at Hudson and Houston, which happens to be along a route I often cycle.\n\nFrites: These are double-cooked, I suspect per the Bourdain recipe. A single order is enormous, likely large enough to share between two. You get a bunch of Heinz ketchup packets, by default, with your order, but better to spend a little to get the aioli or chipotle ketchup.\n\nI'd like the option of Dutch/Indonesian peanut satay dressing, but these are still pretty tasty.\n\nAbout the only other thing they offer is a burger, either \"angus\" or \"wagu,\" the latter a bit more expensive.  For no additional charge, mesclun, tomato, pickle, and onion, and you should ask for all. Cheese is an additional charge, but the the blue cheese is high quality.\n\nIn general: Amazing frites; pretty good burgers; good value for the money. But not a sublime food truck experience.", "author": "Greg C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "This is definitely a savior for the Columbia U students and staff who are limited to the usual barrage of  Halal trucks and standard counter delis.  Frites 'n' Meats comes to town once a week for lunch and we at CU are glad to have them.\n\nThe burgers are great quality and are made to order (as long as you provide your superhero name) and the frites are the best within the one mile radius.  Be sure to try their burgers of the week and grab some garlic aioli for the frites.  \n\nThis truck is going to be a solid competitor for the new 5-Guys slated to open a mere five blocks away. Be sure to bring your hole punched card when you go back so you can earn yourself a free burger!", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "Great burger and fries.  One of the best NYC food trucks.  My go to is beef, cheddar, jalapeno, l.t.o., on a brioche bun.  With fries and the chipotle ketchup to dip in.  For $11 bucks.\n\nThere is always a line and a bit of a wait.  But its definitely worth it.", "author": "Ira M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Just had an angus burger on brioche with just the free toppings for lunch. Whoever said that the burger isn't greasy is false. That meat definitely has a high fat level and the grease gets soaked up into the bread. Shake Shack is probably a better option in terms of lighter burger fare for lunch.\n\nOverall, the burger tasted great. The brioche is a bit tough so if you don't like that, go with a softer bread.\nI like that you order on a card, but somehow that didn't stop them from adding bacon on my burger instead of lettuce.\n\nOn another note, the fries were reeeally good! The burger and the fries were a large serving so I think the price does reflect on how much food you get.", "author": "Anjela D."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}