{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-11", "description": "My wife and I happened on this truck after a long walk around downtown. We each had an angus burger with bacon....a flesh feast fantasy....seriously good, juicy and more than filling. We also consumed mass quantities of fries...or frites...or whatever...they're addicting.  I thought the truck dudes were cool and into what they were doing...clearly having fun....which is nice because some trucks have no personality.  The side of this eye catching (yellow) truck has a superhero cow on it....life imitating art imitating life....or something...anyway, it was damn good food.", "author": "Cary S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-09", "description": "I should have checked Yelp before eating here. I was in Tribeca and saw all the fabulous Foodie Buzzwords like \"grass-fed\" etc. I was so excited to find this that I ordered a burger and thought I will try to find a place indoors since it's so cold that will allow me to buy a drink and eat an outside burger.  I wondered why my burger was ready so quickly. The answer: because they must be pre-made and they give this a casual reheat on the grill. So my gourmet treat was a hard, barely warm hockey puck of a burger. How disappointing! I called the truck guy and reminded him that I was the person he told about a particular coffee house in the neighborhood.He then claims the burgers are cooked to order. Right! No way.. this isn't the first burger I ever had. I told him I felt he should offer me a new one when i visit the neighborhood.    Here's when you see how the other Yelpers negative  reviews are probably so correct: He tells me he isn't going to do this and he remembers me, \"You are probably  a complainer\" and recounts that  I commented on the fact that the customer before me was coughing all over, not covering his mouth, coughed all over his hand and then handed the truck guy his money with the same hand. The truck guy, who is prob the owner tells me he sees nothing wrong with this!!   I point out that having a food handling business and not caring about people's hygiene habits is usually a recipe for disaster.  Fortunately for him most people will probably do what i did and not check Yelp first since it seems like such a great find... but I hope they go out of business soon! Good riddance with that bad attitude!  He probably cuts all types of corners.", "author": "Felice c."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}