{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-31", "description": "I love that they serve grass-fed beef.  I love that they're really nice.  I love that they were playing the Beatles while I ordered and waited.  But I came here with three others, and none of us loved our burger.  Between us we had the grass-fed angus and the wagyu, and all three types of buns--all of us thought the beef wasn't juicy, and the bun was too thick and a bit charred.  So it was disappointing, but they get plus points for convenience, grass-fed goodness, and pleasantness.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-01", "description": "I can see the smoke clouding my view a mile away as i walk to work and smell the grilling of burgers.  Ah, it must be Wednesdays for me as Frites 'n' Meats food truck is parked near my work.\n\nThe first thing I notice on their truck, \"Saving the world One burger at a time.\"  This must be an expensive world because their burgers don't come cheap! But then again, we are in New York....\n\nQuickly filling out what I want on a erasable menu (which is cool), I circle the type of burger that I want, along with the condiments.  I soon realize that things add up the more toppings I add. My  $5- 7 dollar burger starts becoming $8-9 for some stuff that I think should be standard, such as cheese.\n\nI tried their wagyu \"american\" kobe.   I've been to Kobe and had Kobe beef so obviously, I'm already biased before I tasted a bite. But, I love how they added a not-so subtle disclaimer but calling it \"American\" kobe, which basically is warning you that this is NOT traditional Kobe beef. And you should know, at $7.50, there's no way this is real kobe.\n\nThe burger was good though; juicy and tender.  But, most burgers are juicy and tender.  I still couldn't have distinguished where the \"kobe\" part came in.  As a stand-alone burger, this was good and probably better than some diners I've been to.  But as a \"Kobe\" burger, something is missing. Maybe all that pondering is well worth the extra few dollars? I don't think so. I might just stick to their grass fed angus burger and save myself 2 bucks.  With those 2 bucks, I will rather use it for an extra side of oven roasted tomato, apple wood smoked bacon, and Gruyere cheese. \n\nNow I want Kobe beef. But I will skip the \"American\" part of it, thank you very much.", "author": "Wing L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "One of the best burgers in town.  I really dig the Brioche bun, but it's the flavorings in the Angus burger that make me say that.  I'm not too easily impressed by a burger, but when this truck comes round, my mouth definitely starts to water.\n\nI really wish they'd come closer to my new office at 59 and Lex, though.  The Frites n Meats truck and Korilla are 2 of the things I really miss about the Financial District :(", "author": "Tim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-24", "description": "First off, I wish this was an actual resturant that was always in my neighborhood. That said, as it is a truck I did appriciate the ability to check its location on it's blog (http://fritesnmeats.blogspot.com/). It made making plans easier. \n\nOk, about the food. I got the special, \"The Southwest Fusion\". It was absolutely amazing. There was nothing I didn't enjoy about that burger. It was like being at a private concert headlined by John Lennon, Kurt Cobain and Chris Farley... But in burger form. I'm usually a little leary of burgers that have a ton of toppings on it, but everything really worked well together on the burger. The sweet chili sauce was the first thing to greet you upon taking a bite and then really complimented the hearty meat flavors of the burger and bacon.  The guac then stood in a really pleasant contrast to all of the sharp flavors of the rest of the burger.  Well done.\n\nMy wife got an angus burger on a brioche bun with goat cheese, lettuce and tomoato. She is a huge fan of goat cheese and they didn't skimp. There was plenty to go around. The bun was soft and chewy. She loved it.\n\nThe fries were amazing, almost my favorite part of the meal! My wife lived in France and knows how good fries should taste. She said they were some of the best she had had. We got two aiolis, the garlic and the sun-dried tomato ones. They were both fantastic. The garlic one was very stong while the sun-dried tomato was more subtle. \n\nOne word of warning: The burgers were very rare. Like still mooing. We were all about that, but not everyone may be.\n\nWe are most definitly going to make a return trip to this truck. It is now our favorite food truck in the city.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "Holy hell, the frites are delicious. Dipped in the garlic aioli is pure heaven, or the cheese sauce. Those frites are the stuff of dreams.\n\nThe burger wasn't my favorite, but I'll certainly give them another shot (if only because I crave those fries to insane levels) -- the ingredients were very quality: good meat, great cheese, good bun, tasty guac, etc. The burger just didn't blow me away, but it really satisfied me and kept me full all day, which I guess is what a good lunch is all about. I'll be back when it's convenient, for sure. \n\nThe ordering is convenient: you're filling out a card, which is something more food trucks that allow you to design your meal should start doing. The highlight of the truck: you can pay by credit card! awesome! A slight gripe: I can buy a can of coke for less, or a 20oz of diet coke for more? I just wanted a simple can of diet coke. \n\nThe price seems to be a bit on the high side, and while I'm generally a person who can look past the idea of eating from a truck (because this one has really high quality ingredients) I certainly spend more at frites n meats than I do grabbing lunch somewhere brick and mortar near my office in midtown.", "author": "Catherine F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "I've been a devout follower of Frites'nMeats from day one and I have to say that of all the food truck experiences I've had in the past 2 years, this is one that will continuously have me coming back.  Their burgers are very addictive.  The process for ordering is basic, but very appropriate. the food is presented in an appealing manner and their fries...  Yeah...   Whenever I have time and a craving for burgers, I go to these guys!  Burger Love now and forever!", "author": "Dante P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "How have I not reviewed this place?!?!\nFirst of all, I am devastated that they are out of commission for a bit but I hope they all get back on their feet soon!\nThe first time i tried this truck, it had just started so they were still working out the kinks. The burger I took home that day was incomplete and not fully cooked. I then stopped coming to the area.... fast forward a year when i stumble upon Tenka.com\nTenka was having a promotion on food trucks, FnM was one of them. Free burger. How could i pass it up. I came by after work one day and thanks to the ways and wonders of twitter, i found their exact location. \nI ordered the angus on a brioche with cheddar, applewood smoked bacon and mixed greens with a garlic aioli sauce and onion jam.... (i dream big)\nThe burger did not take long at all. \nit smelled like a good ol charcoal burger from a backyard barbecue. \nThe burger was cooked perfectly. The bacon, smoky and delicious. The onion jam was so sweet and a great contrast with the charcoal burger. What a difference compared to my first experience. \nAs soon as they are back on their feet im there.", "author": "Monique R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-21", "description": "Discovering this truck was the highlight of my week... I was just walking along when I smelled deliciousness wafting towards me on Greenwich.... I had the burger with gruyere and avocado mayo and it was awesome. Also, $3 fries can't be beat.... They had tons of sauces listed which I fully plan on going back to try. \nGiving this food truck 5 stars bc of taste, price, and the super friendly guy who works the truck!", "author": "Estelí P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-30", "description": "I don't know what amazes me more. Is it the simple notion of burgers and fries from a truck, being given the opportunity to gleefully check off the items from a postcard menu to customize your burger, the colorful yellow truck with their bull mascot plastered on the side, or the strong Twitter following. Combine all four and you have Frites n Meats which serves a tasty burger. I handed in my postcard menu, ordering the Grass fed Angus Burger ($5.50) to keep things simple and to appreciate the meat as it is. I asked for the complimentary toppings, onions, tomato, mesclun greens, and mayo. In a few minutes, to my surprise, my name was shouted and burger ready in a white bag with a sticker of their mascot. The burger, standard-sized, was pretty delicious. The angus beef was cooked perfectly, slightly pink in the middle providing some nice tenderness to the meat although with a nice firm cooked outside. I attribute that to their grill which added a very nice strong charbroiled flavor to the burger. Yum!!! Alone, the burger was good, but complimented with the fresh raw onions, slices of tomato, mesclun greens and thin layer of mayo made one outstanding burger. Even the sesame bun was soft signifying its freshness. After I was done with my burger, I was surprised to see a little treat in my bag, a Dum-Dums lollipop, strawberry shortcake flavored. It took me back to my childhood days.\n\nI have to say with such a tasty burger with only the simple toppings and lollipop to top it off, I was amazed and already am considering revisiting to try the more worthwhile toppings, garlic guacamole, applewood smoked bacon, mmmm...", "author": "Jason P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Had the Kobe Burger, it was very juicy and delicious. Will go back again. Nice Job!!!!!!!!", "author": "Food N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "Frites n Meats is pretty much the only good thing about my Monday work routine.  And well, that makes Mondays awesome in Midtown West.  I love the fries -- better than McDonalds (yes that's a compliment).  The bread is from Balthazar.  The cheese is from Murray's.  The skirt steak is a great sandwich, although a bit tough to eat sometimes.  And the regular burger is great too.  The line never really is a huge fuss, but budget door to door, depending on where you work, about 20-30 minutes for Frites n Meats.  It's well worth it!", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "I had a burger and fries from the truck today! They were delicious! It even comes with a Dum Dum! I highly recommend this for lunch when it's near you!", "author": "Evan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "I am actually not a big burger fan, but I love a good french fry, and Frites n Meats' frites are to die for.  They are simply awesome, and the sauces add a nice touch too.\nNormally I go with a skirt steak sandwich.  Great meat, great cheeses great toppings.  There is nothing not to like.\nBut the most amazing thing here is the Makers Mark burger.  It's not a regular menu item.  Definitely worth following them on twitter to find out the schedule.  I'm not sure it's fair to call it a burger, it's just so much better.", "author": "Jan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "This place is consistently phenomenal! I've come here once a week for over a year and have never had a bad experience. The fries are a must and go well with the garlic dipping sauce. My only complaint is that the lines are long, but the food is well worth the wait.", "author": "Olivia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-09", "description": "This was the best burger ever!  I had the kobi beef with goat cheese, yum!\nThe fries are also to DIE FOR.  Definately give them a try, you will not be disappointed!", "author": "Flosse M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "Love that a grass fed burger is on the menu!  I don't eat meat, so I can only review the fries, which I liked a lot.  At first I wished they were steak cut fries, but now I am ok that they're shoestring fires because they are crispy.  Portion size is good and the garlic mayo is also good.  I think it is made with raw garlic, not roasted garlic.  I would like more sauce options.... And a veggie burger option!", "author": "Bloss C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "This is a great food truck. It's fast and the little forms they give you make it easy to order. I had an angus burger with cheddar, savory onion jam, pickles and ketchup on a brioche bun. Everything was tasty and the ingredients were high quality. I prefer this burger to five guys or shake shack any day. It just tasted fresher and I loved the ability to customize down to the type of meat, bun and cheese. I also snagged one of their walnut chocolate chip cookies and it was pretty great. It felt a little undercooked which is just the way I like it.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "Not just the best burger in the city, but also the nicest group of people cooking and serving the food. Gourmet quality burgers made to order like you want it, amazing sauces and some of the best frites I've ever had. Track them down, you won't regret it!", "author": "Raffi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "This is the BEST food truck out there!!!! The variety and quality of these burgers are beyond compare.  Since their appearance at the LIC Food Truck lot this summer I have been singing their praises.  So much so, that I started dragging my coworkers out there every single Thursday for their weekly visit.  And after only 1 try, I was not doing any dragging... It  has become our office's ONLY Thursday lunch option!!!\n\nI am a certified burger of the week addict, since it allows me a chance to experience all the different personas of this burger without having to think too hard about my toppings!  But if you are not the adventurous type, they have many classic toppings to make it your very own.  \n\nAnd not only are their burgers INSANELY good, their fries (or Frites) are simply potatoes escalated to pure perfection... This may seem like an exaggeration, but once you try them you will see what I mean!!!!.  The are crispy, flavorful and you are given plenty to satisfy your Frites craving!  To make it even more insanely good they have aioli sauces that will suit any taste. \n\nHands down a great burger, amazing fries and fabulous selections...  You will be amazed and so worth your while to find this amazing food truck!!!!", "author": "Jeanlice F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "The smell of grilled meat floated down the street as my stomach gave a growl in response. The big yellow/orange truck painted with a supercow promised to save me from my hunger. \n\nI walked up and quickly picked my burger and toppings using their order card. I stood nearby and checked in on foursquare as I waited 15 mins for them to make my burger. Finally, they called my name and handed me my grass-fed Angus burger. \n\nThe burger was big. My plan was to eat half and save the second half for dinner. Once I took my first bite, I knew that wasn't going to happen. Within 10 minutes, I had inhaled the entire thing. It was juicy, tender, and just delicious. I couldn't stop eating. \n\nYou can call ahead at 917.292.9226 to place your order. Their menu is also online if you need reference.", "author": "Lucy W."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}