{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-26", "description": "Great burger and fries!\nYay foodtrucks!\n\nThe Frites n Meats truck was close to my office last week  and I missed them. Saw them yesterday, and happened to be in the mood for a burger.\n\nI had the wagyu burger, mid rare on brioche bun. DELISH!\nAlso - the double fried french fries were hot, crispy, starchy perfection!\n\nGood selection of cheeses and toppings and special sauces, as well as a burger of the week. Definitely a good value for the quantity and quality of food received - and they take plastic - so my company was happy to spend $11.50 on my lunch in Manhattan!", "author": "Arana W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-27", "description": "Delicious!!! Garlicky guacamole is a must...\nThe first time I ordered the burger, the patty was cooked a perfect medium but the second time, it was well done... too dry for me... and on top of that my garlicky guac was all out of the burger and over the wrapping paper...\n\nCom'on, if I pay for something I want it inside my burger, not on the wrapping so I have to lick it or wipe m\n\nI had to take out a star for inconsistency and messing my lunch.", "author": "Ferina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-21", "description": "All-around solid burger. The burger I tried (don't remember the name) had onion relish, gruyere, and some kind of slaw. The flavors didn't come together quite as well as I hoped, so I would probably try a different burger next time. My biggest complaint was the bread, which for me makes a big difference in a burger. Overall, though, good lunch option when you have a slow afternoon at work and can afford the major food coma that follows eating one of these massive burgers.", "author": "Meredith S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-19", "description": "I have 2 very serious questions: \n1. WHY isn't Frites 'n' Meats voted 5 stars?? \n2. WHY isn't there a Frites 'n' Meats truck on EVERY corner of the city? \n\nWorking in  FiDi, your food choices are slim. I usually walk around aimlessly looking for food inspiration. One day when I was panning the mean streets of the Financial District, I ran into this bright yellow truck...it was calling my name. I would like to thank the food Gods for introducing me to THE best food truck I have ever had the opportunity to indulge in. It's hard to believe that a truck can make such fresh, delicious, and savory food. The frites will literally have you dancing in your pants. The steak sandwich had me crying tears of joy! I've sampled quite a bit of food trucks throughout the city and I will let you know that Frites 'n' Meats has perfected their craft!   If you want AWESOME food, AMAZING service, and QUALITY products-- FRITES n' MEATS!!!!! To sum it all up, they are the bomb.com!", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-05", "description": "i got the brioche kobe burger.   it was nice and juicy.  i didn't like the brioche bun though.  it kept falling apart and was so greasy.\n\ni also got some belgium fries and they were a huge disappointment.  they tasted like regular fries and nothing like what i was expecting.  if you want some good belgium fries, go to pomme frites in st marks.   \n\ni forgot to mention that i got my burger free courtesy of tenka.  i paid for the fries.  i don't know if i'd pay for a burger at this truck again.   i much prefer my burgers from 5 guys or something.", "author": "Angeline C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-07", "description": "10 years ago, I would have given this food truck 3 stars. But now there are so many great burger places in NY, I get stingy with the stars.\n\nEvery time I see a Wagyu burger on the menu, I am very skeptical. How do I know it's the real deal? Wagyu is known for its intense marbling (fat content), so grinding Wagyu down defeats the purpose of using Wagyu. This burger was incredibly lean in a bad way. I suspect less than 80/20. So it lacked that flavor I get when I eat a Wagyu steak. \n\nThe burger was charred, which I usually like. But this made the burger taste bitter. The onion jam might have balanced that out.  \n\nMy burger was cooked MR to M. I prefer my burger on the bloodier side, but it still managed to be somewhat juicy and tender.\n\nI prefer the flavor of a Shake Shake burger (about the same price). The SS burger just has more going on flavor-wise without resorting to using Wagyu beef. So at this point, I am convinced that Wagyu burgers are indeed a marketing scam. \n\nThe fries are tasty. So order those with aioli and skip the burger.", "author": "William B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "HATERS, PLEASE.\n\nThis is a great burger experience, though if you wait too long to eat it or if you are among the unlucky few who end up with a disproportionate \"bread to bun\" ratio, then sucks for you - overall, this is an AMAZING-tasting meat, and I don't even like burgers, probably because they so rarely taste as good as Frites'.", "author": "larisa k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-29", "description": "Burgers are a serious thing in NY. With competition left and right to create the best ones and the variety of choices, a new competitor has a lot to face. So I applaud Frites'N'Meats (btw, I LOVE the name) and their endeavor to \"save the world one burger at a time\".  \n\nFirst, because they're new to the scene, the line/wait is about 30 to 45 plus the time to order and grill. It's a long wait but for something so fresh to the scene, I thought it was worth the wait. The service was impeccable, the smell of the grilling burgers were very nice, and honestly, you're also supporting a small business. Which I approve greatly!  And although the fryer was out of order (no Belgian fries and sassy sauces!!!), what should have mattered was that this place really does what it offers...burgers.\n\nI ordered the grass-fed angus ($5.50) on brioche with some blue cheese, tomato, musclum greens, savory onion jam, and applewood smoked bacon.  Plus a Mash mango/blood orange soda.  The basic toppings are free but each \"special\" topping were an additional charge of $0.50 or $0.75.  But I've learned...that's what usually makes the difference between a fine and a good burger.\n\nSo, would I try this place again? Perhaps.  But if the line was shorter. And if the fryer worked.", "author": "Yosh H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "Same as Jim K.  3.5 stars\n\nI had their special weekly burger, the \"Marital Bliss\"\nWhich consisted of the following:\nAngus Patty\nCream Cheese\nJalapeno Peppers\nApple wood-smoked Double Thick Bacon\nOn a Brioche bun\n\nThis was a great combo and the meat was cooked so there was still a bit pink middle.  But it was okay.  Fries were okay too.  Dipping sauce, yech.  Too creamy, mayo is not a dipping sauce for me.\n\nThe order system is done by filling out a card, then waiting for your food.  Whilst standing on the street and listing to their music, they call out your name.  This ordering method works, if you can hear your name being called.  My sister missed out on her order and some other guy walked off with it.\n\nI paid $11.50 for my order of fries \u0026 special burger.  I'm not sure it was quite worth it.  I'm undecided if I would get it again.", "author": "Sandy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-18", "description": "I swung by here in between classes, hoping to get a delicious dinner instead I got a below average meal...\n\nI ordered the American Kobe done medium with cheddar on a Brioche Bun with ketchup, tomatoes, and mesculan. A water and an order of fries. = $13.50, dangggg\n\nThe burger was cooked perfectly on the inside, but I tasted a lot of char too and that sort of ruined the burger for me. \n\nThe fries were great though I haven't found a sauce I completely love yet. I've tried the sundried tomato which waas really greasy and the wasabi mayo which didn't have much wasabi in it... it made me feel sick after a while because then you feel like you're just eating mayo.\n\nI don't think I'll be returning to this truck anytime soon... well, maybe for some fries.", "author": "Charlynne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "WOW I can NOT believe the negative reviews. Really, my jaw dropped a few times while reading those with two stars. \nI've been a regular customer to Frites 'n' Meats since... umm... I really don't remember... Must be pretty much ever since they started their yummy business on the streets of NYC. Depending on my schedule I pay them a visit from once a month to once or twice A WEEK. Yes, that's how good their food is. And I mean EVERYTHING that's on their menu.\nLet's start with the fries: thin, crispy, salty... Ahhh, I'm making myself salivate as I'm writing this... And a whole bunch of sauces to dip the fries in - my personal favorite: garlic aioli and horseradish... Can't go wrong, I promise.\nThe burgers... Hmm... Where do I start... Most of the time on the menu there's a burger of the week (BOTW) which is a burger prepared with special toppings, sauces and cheeses. (My very favorite is the Italian Job [the patty, mozarella+Gorgonzola+Parmesan spread, applewood-smoked thick cut bacon and salsa verde] - which I can't imagine someone could not like. It's simply heavenly and I only wish it was coming on the menu more often). If someone isn't quite ready for the BOTW, they can always order a burger to their liking - choosing the bun, patty, cheese, toppings and sauce.\nAnd let's not forget the Skirt Steak Sandwich !!! How delicious is that one ! The meat, the cheese, the SIZE of it !!! It all makes it... simply perfect. Really.\nOh, yes. One more thing. The service. Can't ask for anything better. The boys are available on the phone to get pre-orders and at the truck the customers are always greeted with a warm smile. \nWhoever lasted through this lengthy review - I hope to see you one day by Frites 'n' Meats. I'm there very often :-)", "author": "JUSTYNA K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-28", "description": "There is nothing like seeing a big yellow burger food truck. The smells that came from this truck were enough to make me salivate profusely, and the line outside made the appeal to see what all the fuss was about more popular within my mind. It is a good thing I had just gotten my paycheck, because those burgers are expensive!! $$ I mean after the burger and fries I spent close to 20 bucks! While the food was good, I would have spent at most 14 bucks for the package. It wasn't worth that much money, good, but not $20 good.", "author": "Maxwell B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "The Best food truck for burgers and fries. I had the weekly special which had Parmesan, bacon , and some other stuff. It was excellent. The fries were excellent and they give you enough for at least 2 people. The garlic aioli to go with the fries was excellent as well.", "author": "Scott S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "The burgers here are great. The meat is perfectly cooked, and the toppings including choice of cheese is outstanding. My personal favorite is the Kamikaze (one of their weekly specials) with provolone, bacon, and onion rings. And how can I possibly forget those wonderful brioche buns?\n\nI seem to be the anomaly when it comes to the fries though, as I just didn't care for them so much. The double frying just doesn't sit well with me, either in taste, or in my stomach later. The sauces  (sassy frites) are their big selling point, and they are very tasty....but I just wasn't a fan of the fries.\n\nI'll definitely keep coming back here for the awesome burgers though.", "author": "Ronak S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-15", "description": "Let me start off this review by stating that I consider myself a serious burger connoisseur and have always had an undying love for good food carts in the city.  Twitter for me is not a place to post my every single mundane action that no one will care about, but rather a vital essential tool to find out what food carts are near me.  I am so happy that we live in an age where food that comes from a cart is discussed with serious love in the circles of foodies.\n\nI had been looking forward to this cart for some time, and while I wasn't disappointed, I wasn't blown away either.  I had the burger of the week which was a grass fed angus beef patty topped with spicy guacamole, bacon, pepper jack cheese, and sweet chili on a brioche roll.  Of course, it was accompanied with the frites, which I happily dipped in a garlic aioli.  The burger was small and wasn't cooked to an appropriate temperature, medium rare a little bit on the rarer side.  The French would call this \"bleu.\"  The burger was cooked medium well and was a bit dry.  The guacamole wasn't fantastic and the chili was rather disappointing.\n\nThe frites, however, deserve their own novel written by Cormac McCarthy.  Okay, maybe not Cormac because it most likely would end up with a man found scalped and dead in the desert with a fry in his hand.  I digress.  The frites are delicious and worth getting if the truck is nearby.  Get the garlic aioli to dip them in.  Best part about this place?  It's cheap relative to other burgers in the city.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-01", "description": "This food truck is outside of my office building once a week, and I LOVE working there (among over things :D) for that reason! \n\nTheir burgers are decent, good meat (kobe, angus, some sort of skirt steak sandwich) with yummy cheese and on a fine roll. I could pay about the same for a sit-down restaurant burger that might be slightly better quality, but for getting this from a truck, it's pretty good! Not a fan of the mesclun greens though, would agree with a fellow yelper that it would be nice to just have simple iceberg lettuce instead, as the bitterness of the greens can take away from the juiciness of the meat! \n\nTheir fries are suuuuper yummy! I love their crispiness, and their saltiness! You get a good, decent amount for 3, and then pair that with 50 cents with one of their decadent and delicious aioli sauces, then you have a REAL treat! I would eat the fries for lunch all by themselves! :D \n\nIt simply gets 3 stars because of the ordering process is not necessarily understandable straight off the bat when you get there (they have a card you fill out, but with everyone just standing around in what would SEEM like a line, it gets a little confusing) and because of the mesclun greens. Decent meal though!", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "A staple in FiDi and must goto! My favorite food truck down in this location. Their skirt steak sandwich is clutch and add your own toppings to make it your own. It has become a popular destination for many folks in the area so try and call ahead! Their service is key and always attentive. Check them out!\n\nB", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "Its not the best burger you are ever going to eat, however, it will come pretty close. The meat is grilled to medium maybe medium-rare and is very juicy and tender with a bit of grill/char flavor which makes it all the better.\n\nAnother added advantage is that their burger is not greasy and doesn't make you feel heavy and bloated.\n\nA few of my coworkers also rave about the fries from here.. so maybe give them a try if you are indeed a fries lover/expert.", "author": "Robin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "Frites is back!!!!!!!!! Woot woot!!! Burger Love has returned :-)\n\nI won't forget the joy I experienced last week when I saw that glorious yellow and orange truck parked on Water and Broad. So the week of 8/15/11 was the grand reopening week and they came back to FiDi on 8/19. \n\nI knew this truck was popular, but I didnt know it was an-hour-wait-in-the-sun popular. FiDi Friday must have been one of their most successful days ever. I usually get the grassfed angus and cheddar, but I finally got adventurous and had the Burger of the Week. This week brought the \"Bymark\" - grassfed angus with brie cheese, mushrooms, garlic lemon aioli on brioche bun. It was DELICIOUS!!! I was skeptical about what brie tastes like on a burger, but I was sooooo happy I tried it. What a delightful lunch.\n\nI should've taken off a star for the wait today - the wait was so long I had to run back to make a meeting - but I will get a free burger on my next trip with my loyalty card.", "author": "Randi C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-23", "description": "Some people have graded this the best burger they've ever had.\n\nI'm hoping these people are either not native to NYC and just emigrated from a place where McDonalds was the only burger option, or recently converted vegetarians.  Because if this is the best burger you've ever had and you've been in NYC for awhile, brother, you've been missing out!\n\nThe concept sounded right - a burger made out of ingredients from several well known restaurants and suppliers, cooked and served with an interesting set of condiments.  It went south from there though.\n\nFor starters, burgers are not cooked to order.  You're not asked how you want it cooked, and for good reason - there's a pile of burgers awaiting the onslaught of interested parties.  Good for moving you out quickly, but what if I wanted my burger rare, instead of charred to a crisp?  One other person in my party was upset that their burger was too raw (some three bears action going on here).  You're not asked, and chances are not in your favor that you'll be happy with how it's cooked.\n\nThe bun - is from Balthazar.  Well, whoopie.  As a bun, it sucks.  Mind you - it's not hard to be a burger bun.  We're not talking about some massive culinary execution here, just a simple ole bun.  The problem is the bun makes the burger, and in this case - the bun was disappointing.  It was big, though - and it highlights the other problem.\n\nThe patty:  let's just say size isn't everything, but I didn't pay $13 for a slider and some fries, and that's what I got.  Even more insulting is the tiny burger served on such a large bun evoked a 'Where's the beef!' moment from everyone in my crew.  It wasn't cooked to order so it was burnt on the outside, somewhat raw on the inside.  Looked like a tiny, frozen burger that hit the grill for a few minutes on each side and then was tossed in a pile until my order came in for a refresh.  It didn't taste bad, but certainly wasn't very good.  The toppings were good - applewood bacon was cooked crispy, and the lettuce, tomato and cheese were good.\n\nThe frites: now here is where they lost me.  Fries are not hard to get right.  Yes, they're not the most straightforward thing, but they're also not very complicated.  The right fresh potato dried off and inserted into oil to be fried at a lower temp, followed by a flash fry in a higher temp, to ensure a crispy outside but a tender, flavorful and moist inside.  These were anything but.  These were dry, to the point where you had to soak them in condiments to make them edible.  The garlic aoli (garlicy mayo to the uninitiated) was good, but for a tiny serving they charge way too much, especially in light of the fact that it's a requirement to eat with these dry, flavorless fries.  You know, potatoes are subtly flavored, so you don't really realize they have a taste until you eat these fries, and ask yourself how they managed to cook it away.\n\nThe lollipop was a nice touch though, managed to rid myself of the dry fry taste.   The drink from Mashable was a nice touch, if also a bit expensive.\n\nAll in all, such a disappointing disposal of $13 that it prompted a lengthy review.  It's not just the cost - it's certainly no value.  But when you measure it up against *good* burgers (and there's a TON of good burger joints in NYC, stores that have higher overhead and provide a better burger for less money than these guys command), it's disappointing.  And why pay more to be disappointed?\n\nI'm a food truck kinda guy, but not going back to this one.", "author": "John N."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}