{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-29", "description": "I can tell this truck is trying to please...breads from Balthazar, quality meats (from ??) and cheese from Murrays..so what do I expect? only the best.\n\nI almost jumped for joy when I saw them parked in Korilla's usual spot - 55th and Lexington Avenue. Fortunately,  I was lucky to beat the crowd at 1.30PM (post lunch-late lunch) but as I stood waiting amongst other customers, Unfortunately, I smelt smoke and something burning....\n\nAs I walked back to my office all excited to try this bundle of deliciousness..lo and behold, my burger was burnt. It was pink inside and tender but I guess the grill was so hot it craeted a crusty burntness on my burger. arrrgghhh. $6.25. Do I eat it? Hell yes.\n\nAll in all, I still ate it, the bun was excellent Soft, fluffy and light, the greens \u0026 tomato was fresh..i had the Angus, with gruyere cheese..but because my burger was burnt, i couldnt taste the cheese.\n\nI did not order the fries as I read comments that they were normal, I was standing next to someone who ordered them and they looked like mcdonalds and not hand-cut. I think I know what hand cut means. Also, why the term belgian? They are not chubby fries, they are long and skinny.\n\nI'm going to give these guys a second chance. I can tell they aim  to please...I will go back and invest on another burger and fries this time. Will write a follow up. =)", "author": "Sarah Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "I've recently discovered a passion for french fries - for a while, I was obsessed with tacos, now its french fries... so when I discovered Frites n Meats on the corner of my work, I was super psyched to try their American Wagyu Beef Burger and their fries\n\nOMG.\n\nThe burger was Wagyu topped with gruere cheese, raw onions, tomato, greens, and onion jam, along with ketchup, mayo and mustard - yeh i love to take to the extreme... and man was it good.\n\nI mean - in comparison to the LCB Burger Truck - those burgers are better... but Frites n Meats wins with its condiments.\n\nThe fries were perfect, and they have a number of dippings.. I love the Garlic Aoili and my coworkers are obsessed with the Horseradish.\n\nYou can get a stamp for everytime you go, and I think the 10th is free.. join their email listserv, and you get a chance to win a free burger.\n\nThe line is long, but they move fast, and they call you by the SuperHero name of your choice.\n\nLove it. Eat It. Or your life will just be empty.", "author": "Diane L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-10", "description": "BIG HAT.....\n            ...NO CATTLE\n\n                      Some things just look better on paper...this is one of those things. I wish I had read my friends Chris K \u0026 Jenn L's reviews first. At least they gave a promo flyer from Paradou for 20 bucks off.\n\nOrdered: Wagyu Burger ($7.50) w/ gruyere (+$0.75), applewood bacon (+$0.75)\n\nTHOUGHT PROCESS...\n\nWaiting in line for 15min: \n        Murray's? Balthazar? Impressive, but I hope this burger fills me up.\n\nAfter paying and waiting for my food for 5min: \n        Crap, why is everyone carrying a small paper bag?\n\nCarrying my burger on the way back to the office: \n        This thing weighs at most 0.4lbs..I think I need 4 of these to get full. \n\nBefore eating it:\n        Crap, I just paid $9 for something that weighs a feather. I don't like this                 price/weight ratio.\n\nAfter eating it: \n        Ok I'm full and the patty is at least 1/3lb, but why is this Wagyu so 'sinewy' when it is pink on the inside? It's supposed to be like BUTTA!\n\nPROS:\n-Fresh ingredients (Niman Ranch, Murray's, Balthazar)\n-Efficient ordering system (mic in truck, superhero order form)\n-Gimmicky punch card, but a loyalty program (buy 10 get 1 free)\n\nCONS:\n-Wagyu looks medium and is pink but strangely 'sinewy' and tastes overcooked, bland, underseasoned\n-Pricing - oh the high side for a truck, since you have no rent to pay\n-Fries - weak, nothing special, toppings cost 50 cents extra\n-Sloppy - sauce gets smothers all over the bun by the time you unwrap your foil\n\nMENU ITEMS:\n-Killer Soup $3.50\n-Grass Fed Angus Burger $5.50\n-Wagyu Burger $7.50 (+$0.75/ea for extra toppings, cheese)\n-Belgian Fries $3 (+$0.50 for sauce)\n-Water, can soda $1\n-Mash 20oz $2\n\nlink: http://midtownlunch.com/downtown-nyc/2009/10/30/downtown-lunch-your-first-look-at-the-frites-n-meats-burger/\n\nTotal came out to $9 after everything\n\nPics are up on my FB...", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Saw it on the food channel and I can't believe they come around my way. Never disappointed and always a pleasure. Comes with all the extras and excellent concept. Couldn't ask for more. Worth every dollar.", "author": "Solio H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "Had it again yesterday, just wow. The onions and the melted blue cheese, something so good can't be wrong. I think it has maybe gotten better since last time.", "author": "FatmanStan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "Delicious quality burgers, ingredients, Belgian frites with awesome sauces, \u0026 friendly service from a truck?! I'm so there! \n\nI started to get worried when I saw the poor reviews for the Frites n Meats truck, but decided to try it out for myself anyways. I LOVED IT! Everything about it! \n\nI arrived at about 12:30 with a couple coworkers and we were pleasantly surprised that there wasn't much of a line. Thank goodness we got there when we did, because once we were done placing our orders the line was much longer. I LOVE ORGANIZATION and this truck has it. You have to place your order by filling out a card and once you get to the truck you just hand it over and pay. Once your order is ready they will call you by your \"Superhero Name\" which you had to indicate on your order card (I was Magnificant M). From beg to end, we waited 15 min. Not bad! And they have cool music playing too while you're waiting for your order (for a split sec, I thought I was at a club!). \n\nNow on to the good stuff .. I ordered the Wagyu \"American Kobe\" Burger ($7.50) on a Brioche bun (you have a choice of that, Potato-Onion, or Sesame Seed) and I got only the toppings that came free with it, Raw Onions, Tomato, Mesclun Greens, Ketchup, \u0026 Mayo. For 75 cents extra, you have your choice of Savory Onion Jam, Garlicky Guac, Applewood Smoked Bacon, or Oven Roasted Tomato. I also got a side of Handcut Double Fried Belgian Frites ($3) w/ a side of Garlic Aioli (50 cents). \n\nThey don''t ask how you want your burger. It looked Medium, which is just how I like mine. Fries w/ the sauce - very yummy! Meal total $11. All worth it for me (even with currently smelling like garlic and onion in the office)! Will I be going back? Yes!", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "I had a bacon cheeseburger from here that was very big and juicy, not bad for $7.  I didn't get the fries mainly because of the price, but they did look good.  The only thing is that a burger, fries, and and a drink are gonna run you over $10, which is a little expensive in my opinion.", "author": "John P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "I enjoy a good burger and Frites 'n Meats serves up a mighty tasty one! However, my total weakness is for French fries and these boys know how to do 'em right! Forget trying to transport them to your mealtime destination. You won't (and shouldn't) make it without diving into the addictively delicious cone of frites. I also highly recommend the garlic aioli as an indulgent condiment.\n\nAdd to the delicious food, the incredibly friendly service, philanthropic nature of the owners, being a local small business, and did I happen to mention the FRITES?!?! Well, that explains why I try to sneak away from work every Wednesday and travel an hour to buy lunch from this truck.", "author": "Lin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "Consistently one of the best burgers in the city IMO. Not super greasy or salty, super fresh ingredients. The people are always super nice. One of my favorite NYC food trucks!", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "Delicious burger!  \nI'm not sure if it's worth it to get the Kobe because the grass fed was pretty amazing ($5.50 for the grass fed..addtl for toppings).  Huge patty on a brioche bun topped off with just some greens and blue cheese.. wow.  The fries looked like freezer aisle fries but tasted like an luxed up version of BK fries.  If I had to do it again... I probably would just get the burger by itself.  This cart exceeded all my expectations.  A must try for all food truck enthusiasts!", "author": "Thompson L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "\"Frites N Meats\" stands out among the \"truck crowd\" for having exceptionally tasty food that's almost as pleasant as a sit down place.\n\nThe BYMARK burger (grassfed angus with brie, seasoned \u0026 grilled mushrooms and garlic aioli spread) was terrific; cooked just to my order specs. Fries were crisp and came with my choice of five dipping sauces. \n\nOrder came up quickly (standing in 30-degree NYC winter winds isn't easy) and the service was spot on. \n\nWell done, guys. Keep 'em coming!", "author": "Jody F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-04", "description": "Oh, trucks.  Without twitter/blogs, how else would you find them?  Maybe they should carry a gps on them, since there are times when I go searchin', and they decide to go home/don't update their page (trucks in general).\n\nI like it when they're at Trader Joe's in Union Square better, but I wanted some burgers so I made the trip on over here.  They're right in front of Whole Foods (guess they target these types of grocery stores).\n\nIt's always nice to feel included when you're ordering, so there's a stack of menus and sharpies where you can circle what you want.  You choose the bun, patty, toppings, cheese is an extra 75 cents, and other special toppings that don't include your basic ketchup and mustard are for an additional charge as well.\n\nThe simplest and cheapest burger comes out to $5.50.  Now, that's around Shake Shack pricing and though it is bigger, it's not as flavorful (is it because it's grass fed?)  Yes that's \"healthier\" but in the end, a burger's a burger....for the most part.  There's still grease, though, so yum to that.\n\nI wish they reused those cards you write on, but they don't.  Talk about not going green.  Either way, unless this truck is right in front of me and I'm starving, I'll let it roll on by.", "author": "Lili K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-15", "description": "I'm disappointed. \n\nI ordered the kobe burger on brioche bread topped with lettuce, tomato, onion and ketchup and mayo ($8.50). Portions are good such that I felt stuffed and kinda sleepy afterward. My burger tasted overcooked and dry. The taste was alright but nothing memorable for my taste buds. I like my burgers juicy and fritesnmeat failed to deliver the \"juice.\" \n\nHowever, I do believe in second chances. So I'll return again to try the fries that other yelpers have raved about. I may even try another burger so fritesnmeat can have a chance to redeem themselves.\n\nI like the stamp card they have in which you buy 10 burgers (10 stamps on the card) and you get one burger free. I think its a clever sale tactic. Even though its unlikely I'll eat 10 burgers from there,  I like the idea that I have the potential to get a free burger. Needless to say, I'm adding it to my \"food stamp card\" collection :)\n\nI had the fritesnmeats located on 52 st btw 6th and 7th ave.", "author": "Katy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-23", "description": "All I had today was the Frites aspect of the business. No, friends, don't worry. Paul has not stopped in his quests for delicious meats. I had just already eaten lunch and only asked my boss to pick up frites* for me. \n\nMy expectations for frites were raised by my first visit to Pommes Frites on Friday night. I realize an experience at one restaurant shouldn't set the tone for another, but when Frites is part of your name, I expect to be blown away a bit more. Not just say \"well, those were like slightly crispier McDonald's fries.\"\n\nI still have to try the Meats part, but I don't know when that'll be since they don't come by my part of town too often, and after these fries, I'm not as anxious to seek them out as I was before.\n\n* Yes, I could call them fries, but I won't. They're cooked Belgian style, therefore they shall be referred to as such.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-06", "description": "SETTING: First day of work\nBOSS: Do you want anything from Frites 'n' Meats?\nME: There's a place nearby called Frites 'n' Meats? *stumbles into desk* Must try ASAP.\nBOSS: Umm.. You're weird.\n\nSo.. I was clearly enamored - because it really is an awesome name. We rolled up to the truck in our... well.. shoes - because you don't really drive in NYC. I can say this - their ordering process is as brilliant as their name. Considering they're a street truck, there's no way that you can really claim that they've misheard you if there's paper evidence. There's little slips of paper so that you can circle your choice of:\nBURGER - grass fed angus, wagyu \"american kobe\"\nBUN - brioche, potato-onion, sesame seed\nCHEESE - gruyere, goat, brie, cheddar, blue\nTOPPINGS - raw onion, tomato mesclun greens, savory onion jam, garlicky guacamole, applewood smoked bacon, oven roasted tomato\nHANDCUT DOUBLE FRIED BELGIAN FRIES\nDIPS - ketchup, mayo, mustard, garlic aioli, spicy chili aioli, blue cheese, sundried tomato aioli, horseradish aioli\nDRINKS - water, 12oz sodas, Mash 20oz drinks\n\nWe got back to the office, burgers and fries in tow. Yes - I was that idiot stinking up the office with the smell of yum, but my boss and two others had done the same, so I was theoretically off the hook, right?  My hopes were a bit dashed when I bit into my burger. It was good, but not amazing. The cheese (brie this time) was probably the best part about the flavors co-mingling in my mouth. The fries were crunchy munchy, but were elevated ten-fold by the horseradish aioli dip.\n\nService was so-so. They were nice and all, but my boss ordered her burger sans bread/bun because she can't have gluten; we were very clear with the guy that it could kill her. When we got back to the office, her burger was tainted (had a bun), so she couldn't eat it!  :(\n\nI might hit them up another time, but I'm in no rush for the time being. They do deliver now, so maybe when I'm feeling lazy this winter, I'll order up a delivery.", "author": "Jenn L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "For the price, my burger was good and delicious but not AMAZING by any stretch of the imagination. It was big and juicy though, perfectly delicious considering it came out of a food truck. \n\nSometimes it can take a while to get your order done but that also means everything is preped to order which is a plus. \n\nI think its not a good value actually so I don't get burgers here anymore, however, the fries are FANTASTIC, especially with the garlic aoli. They're thin and crispy but not too oily. Absolutetly by fave. Thats all I come to the truck for!!", "author": "Izabella G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Definitely one of the best burgers I've ever had. I got the American Kobe (Waygu) burger, no special fixins, and hot diggity, as soon as I took a bite there was a party in my mouth and everyone was invited. I will say though that the burger was cooked a little rare for my liking. \n\nHot tip - if you can, call and order ahead; the truck attracts a huge crowd and at peak hours you can find yourself waiting up to 45 minutes for your food. I learned that one the hard way. \n\nThe fellas in the truck are an affable bunch too.", "author": "Owen H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-06", "description": "Frites \u0026 Meats reminds me of the '92 Olympic Dream Team, an embarrassment of riches, glory, and namedropping: Jordan, Pippen, Barkley, Bird, Magic Johnson, Ewing and so on. With such a mind blowing roster, was there any way they could lose? Don't be silly. \n\nSimilarly, F\u0026M attempts to differentiate by recruiting high end suppliers to create a veritable dream team of ingredients: \n\nBeef: Grass fed Angus ($5.50) or Wagyu ($7.50) \n\nBread: Balthazaar - brioche, potato onion or sesame \n\nCheese: Murray's - gruyere, goat, brie, cheddar, blue ($.75) \n\nToppings: Savory onion jam, garlicky guacamole, applewood bacon, oven roasted tomato ($.75) \n\nFries: Handcut double fried Belgian ($3) \n\nSauces: Ailoi (garlic, sundried tomato, horseradish, spicy chili), blue cheese ($.50) \n\nImpressed? I was. Expectations ran high and I felt confident that this could be the best burger ever purchased at a moving vehicle.  The sad realization: marketing can only take you so far. \n\nThe Burger: (Wagyu on brioche with onion, mesclun, tomato, mustard) \n- Dry. Overcooked. Overly charred. Skimpy, wimpy, and cold. \n- Oversalted. Rather than pre-seasoning the meat, F\u0026M employs this weird tactic of sprinkling visible chunks of sea salt atop the fully cooked beef. The result? Wildly inconsistent bites of salt meat, followed by even saltier bites of meat. \n- The bun was a deflated soggies party. \n- The veggies also joined the deflated soggies party. \n\nThe Fries: \n- \"Looks like McDonalds...?\" \n- 2 minutes later - \"Not even as good as McDonalds....\" \n- \"Double fried? I question whether it was even single fried. This is severely undercooked.\" \n- \"Where's the salt?\" (answer: stockpiled on the burger) \n\nYou can follow the truck on twitter.com/fritesnmeats. Sadly I won't be.", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "I've been wanting to try this truck for some time. I was in the city so I hunted them down. I ordered their angus patty on a brioch bun with gruyere cheese. Raw onion, pickle, tomato, mayo and ketchup topped it off. \nMy burger was cooked med rare. I am fine with that, but I know many people that wouldn't have eaten it. They seem to use good ingredients and it was very tasty except for a part of the patty was burnt. Not a tasty char, but a not so tasty burnt. Luckily it was just a small part of the burger.\nOverall, a good product. Worthy of another try. Judging by the steady line of customers, others must agree.", "author": "Yelper X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-23", "description": "I had the wagyu burger and fries with garlic aioli.  I have to admit, I probably wouldn't have tasted the difference between the wagyu and the angus.  With that said, thought burger was ok and fries were really good.  I tasted some of the other dipping sauces and I thought garlic was still the best.  Think of a creative superhero name before you go.", "author": "Howard L."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}