{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-11", "description": "There isn't a great number of particulars I could mention to describe this place other than a few choice of words.\n\nIt is 'Okay', for lack of a better word.\n\nThe meat in the burger certainly has its character as it stands out from each and every bite you take. But sadly, the savory trip came to a quick halt without further service.\n\n\nAfter the meat, I was under the impression that these guys were just starting out, and was still working on figuring out the little kinks to fix their not yet perfected system.\n\nThe frites, sadly, was the weakest act in their showing, especially combind with the rather heavy, stale mayo-ish tasting dipping sauce that killed it completely (I couldn't finish the fries and dip sauce).\n\nI had a few problems with their menu, but I also recognize large room for them to grow. After all, their burger meats were solid. An they seem to work with artisanal ingredients, though they don't cut the rinds off the brie on my burger. Me no likey rinds :/  \n\nI will give Frites N' Meats a benefit of the doubt for future growth and remain positive. However, their frites needed some tweaking as it was a major downer for me.\n\nI give it a low 3.5 for now , which would make it 3 stars.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-18", "description": "Convenient ordering system of filling in a paper with your order except it was windy and my paper blew away three times...  nice options and toppings.  \n\nThe wagyu burger itself was dry and charred, it had a very charcoal-y taste and over-all worse than a majority of the fast food chains.  It's appealing that there's a choice of bun (brioche, potato, and sesame);  I opted for the brioche which was mediocre despite coming from Balthazar. They were pretty stingy with the brie I picked as an additional topping. Normally I only have fruit juice during the day and this burger is certainly not worth straying from a diet for.\n\nI was much happier with the frites; they were a tad undercooked and lacking of salt but that's my preference so for me it was great. The side of garlic aioli was great as a dipping sauce- perhaps a bit too garlicky but tasty nonetheless. \n\nSummary: Savory frites. Substandard burgers.", "author": "Elena V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-29", "description": "Burger and fries truck that plans to park on Greenwich and Chambers every day, then move to the MPD at night.  Today was the 1st or 2nd day and they are still working out the kinks - line of maybe 25 people took 50 minutes, and their french fryer broke.\n\nThe Good:\n-The menu has potential:  choice of angus or wagyu beef; choice of bun; premium toppings like onion jam, oven roasted tomato, applewood bacon, goat cheese, etc.; aiolis for the frites\n-Burger was a nice pink, not overcooked\n-Good size\n\nThe Not so Good:\n-Burger was too smoky, too charred\n-Balthazar Bakery sesame seed bun was too pillow-y and dry for me\n-They need to double or triple their grill staff - line was absolutely crawling\n-Seasoning was too light\n\nSo an initial 3 stars with the potential to move up if they improve, or come down if they don't address the shortcomings.  Given how early it is, I'm banking on them improving - the menu has too much promise and there is too much need for interesting lunch options in lower Tribeca.", "author": "Victor C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "Off-the-hook brugers. I have eaten at every midtown burger joint there is.  This is at least as good as the best of the steakhouse burgers, blowing away the Parker Meridien, Shake Shack, 5 Brothers and others in this price range.  The weekly special burgers have yet to fail me. Typically a perfect combination of quality ingredients and flavors.  It's hard to heap more superlatives on this truck.  Look, they have blown the occasional order of my friends, and the meat was once undercooked (always preferable to the opposite), and its a food truck, so how much can you hope for, but given all of that, it still earns five stars. That tells you something.\n\n\n(downgraded to three stars - there's been slippage in quality. but still worth it.)", "author": "Peter S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "More food truckery! \n\nAs a fan of both frites and meats, as well as food trucks, I would seem to be the target demographic here, but this just didn't get me doing cartwheels down Park Avenue.  I called in my order and it was ready when I got there.  Pretty tasty burger, but not in my Top 5.  And wrapped in foil and a paper bag served from a truck... well, it just didn't seem special.  The frites were actually the standout here; more like skinny McDonald's fries but cooked the right way and delicious.  Not bad overall, but I am on a quest for the sublime.", "author": "Grant C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-14", "description": "So I was craving a burger but didn't want to go to McDonald's. Where could I get something \"fast\" but better quality?\n\nHow opportunistic that I should walk right by this truck and see somewhat of line. That's a good sign right? \n\nThey don't ask you how you want your burger cooked. It was medium which is a little too undercooked for me. I assumed that they would serve it medium-well/well-done. My mistake. \n\nThe saving grace was the onion jam. That was tasty. The mesclun greens you get are like 5 small leaves and end up getting soggy by the time you open up your burger. Not cool. I don't remember if the meat was seasoned, but I'm guessing not. \n\nThe potato bun was way too big. Bread should be minimal in the burger. They also gave me a filthy can of diet coke. I mean like black soot all over it. Pretty disgusting. The fries were just ok, maybe a step above McDonald's.", "author": "Katee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "The frites are excellent, and definitely worthy of mayonaise rather than ketchup if you like them the belgian way. The burgers are really juicy, and the options are rich and varied, allowing you to get really creative. All in all, a quality product, that we keep going back for.", "author": "Adrian K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-20", "description": "...The pommes frites were less a second banana and more of a co-star, bringing back waves of nostalgia--for me at least--piercing crispy-on-the-outside shoestrings of airy potato that might be the only thing that ketchup was really made for....", "author": "Kerry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "Definite fan of this truck.  Coming from Austin, TX - which in the past 5 years has gone food truck crazy, it is great to see such high quality food coming out of trucks in NYC,  the only minor disappointment is in their Jalapeños.  I like my burgers spicy and am a much bigger fan of how Zeitzeff does their's, grilling them and slicing them lengthwise.  These seemed like they were out of a jar, though I could be wrong.  I got cheddar which was very tasty and much better than Zeitzeff's as was the size of the burger.  These folks know what they are doing.  Fries were wonderful, nice and crispy and I got the Chipotle Ketchup, which is very tasty.", "author": "David Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-01", "description": "Look forward to my weekly burger at the truck.  Burgers are very good with plenty of fixins.  They're not cheap on the fries.  Usually fills the bag with the burger.  Fries are crispy and tasty.  I'm a regular and one of the better burgers I've had.  Recommend to order in advance especially in the winter and for those that want the burger well done.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-05", "description": "Pretty good burgers.  They try really hard.   The quality of ingredients belong in a gourmet restaurant (angus?  wagyu?).\n\nThe entire menu is burgers, myriad toppings for those burgers, fries and a few more baked goods, and not much else.   It's probably the best  combination of price and quality if you're in the neighborhood and craving a burger.  I'd probably rate it higher if I were a bigger fan of burgers.\n\nThe ordering system is a bit unique;  grab a card and fill out what you want.", "author": "Larry Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-26", "description": "What: Grass-fed Angus burger w bleu cheese, tomato and greens + fries.\nQuality of beef: Below average.  Lots of chewy fat pieces, which I hate. Definitely not lean ground beef.\nOverall taste: Not bad, but quality of meat detracted.\nFries: Good.  Slightly better than Jack in the Box fries, but similar taste.  Worth $3?  No way.\nService: Below average.  Not rude, but nonchalant, as if they don't need your business.  \nResult: Don't worry, you won't get my business again.  There are too many good burger joints in Manhattan to waste your money or stomach space on a below average, high-priced burger.", "author": "Samuel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "This is more of a 3.5 star review but I'll bump them up to 4 because I think they have potential if they work on a couple issues.\n\nI stopped by here a couple weeks ago to pick up a burger and fries.  A full meal was a bit of a drain on the wallet and should set most back by $10 to $12 for burger and fries only.  The burger I got was the Angus topped with gruyere cheese, onion, tomato, greens, and guacamole on a brioche bun.  The burger was cooked medium but was a bit on the lukewarm side by the time I got back to my office.  Despite the lack of warmth, the burger tasted pretty good.  For size comparison, I'd say it's a bit bigger and taller than a Whopper Jr.\n\nThe frites are where I have to take off the most points off because they were pretty unremarkable.  The fries did not appear to be \"handcut\" as advertised and resembled McDonald's fries (albeit much less greasy).  The amount of fries they give you is also a bit disappointing considering the $3 price tag on it.  The only thing that saved the fries were the dipping sauces (an extra $0.50).  I got the horseradish and garlic, which were both fantastic and packed quite a punch.  I really wish they could improve the fries to taste a bit more like actual homemade fries and given you a bit more for the steep price tag on them.\n\nI'd recommend this with some reservations.  It's probably worth it for an Angus burger, which should set you back $7 with a reasonable amount of toppings.  I will pass on the fries next time they go here until they improve them.  Frites n Meats has the potential to be a great truck but it's not quite there yet.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "Frites 'n' Meats is my Wednesday lunch ritual.  Excellent burgers with quality ingredients for a reasonable price.  They source their cheese from Murrays, meat from  Debragga and buns from Balthazar Bakery, all for $8 burger.  It doesn't get any better than this.  I generally don't eat fries, but few times that I have had fries from here, they were awesome.", "author": "Farooq C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-04", "description": "Why is it in the street .I think that's stuiped. But they shore boy have good food", "author": "Evan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "Lucky we, two of my co-workers got the last two promo burgers.  Since there are 4 girls that work together we decided to split them in half so that we can all try them.  Wow we were all very extremely pleased with it.  They were so juicy and tasty even the bun's was nice.  We are looking forward to trying their Skirt-steak soon and eat more of their burgers of cause.  This time I want the whole thing half was not nearly enough. It a must try burger.  Thanks guys come back to our area real soon please 58th \u0026 3rd ave by ING.", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-08", "description": "Just ate here, and ill give it a 2.5 rounded down to a 2.\n\nWater is a dollar. I like that. \n\nOrdered a wagyu burger on brioche bun with mesculin greens, tomato, and ketchup. \n\nThe burger was a bit overcooked, had a charred flavor, and was not juicy at all.\n\nThe bun was strong, but dry.\n\nFor convenience, its ok. Quick meal between classes.\n\nFor value, look elsewhere", "author": "Greg D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Almost 4 years and still can't get enough.  The weekly change of the Burger of the Week definitely helped that.  My favorite is the Mexicana (monterey jack, parmesan crusted, oven roasted tomatoes, chipotle ranch and bacon!)  Did i mention this is the best fries I've ever had?  Keep it up guys.", "author": "Reynald G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-17", "description": "This Burger is awesome. The best burger I've ever tried. The price is not the cheapest to be a Food Truck but that meat. My goodness, the meat juicy and tender, it just melts in your mouth creating a flavor party.  Fries are nicely fried.", "author": "FourTwenty S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "So far I've only had the frites with the Spicy Chili Aioli. And they are delicious, crisp, and salty just the way fries are supposed to be. Served in a faux newspaper cone, 2 dum-dum lollipops and a tiny fork is cute too.\nWill have to go back and try the meats for sure.", "author": "Megan F."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}