{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "Long wait, but great burgers!!! Came here the other day for some burgers and fries. After staring at the menu for a bit, I finally decided on the burger of the week, which was Angus burger, with bacon and two type of cheeses on a buttered bun. It definitely tasted as good as it sounded and  the fries were delicious as well. \n\nThe food is little on the expensive side, but for a treat meal, it really is not that bad. My only complaint besides for the long wait time was that they cooked the burger on the very rare side, which was perfect for me, but I think would definitely be a problem for others.", "author": "Jerett G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "Best fries I've ever had from a food truck, hands down.  Burgers are also very good quality (grass fed beef) \u0026 the service is top notch.  Definitely get there early, as a line can build. You can also call them to pre-order.  \n\nI'm always looking forward to Thursday's, as that's when they visit DUMBO.", "author": "Brian K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "I have officially seen the light. I snuck out of work, blinded by my PMS cravings and followed my nose like a fucking toucan. Thankfully it didn't lead me to fruit but instead directly into the grilled-beef-fat cloud that was this food truck. A relapsed vegetarian ..... again. I hang my head in shame while shoving my mouth with a crispy yet tender burger hugged gently in a sesame bun. \nThe edge of the patty was the best part, perfectly salted and tasty. I don't want to go back but I know I will in exactly a month. \n\nSee you then. *walks away defeated*", "author": "Nuna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "My co-workers and I eat here each and every Wednesday in Soho.    No fail.  The burgers are always cooked to perfection.  They are meaty, juicy and oh so good!  One of us always gets fries for the table.  They are amazing.  \n\nWe try to get to the truck by 12 noon to avoid the lines.  Fill out a postcard to place your order.  That is my one and only quibble with F\u0026M.  I wish they were more eco-friendly.", "author": "SERENE N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Just had a great Burger here. Owner was friendly and helpful and the burger was great! had fries with chipotle mayo. Very tasty", "author": "Rod W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Best burger I've ever had! And i eat a lot of burgers. And the fries are also great!\nI highly recommend you take advantage ordering before you go, waiting time can be a pain.", "author": "Deborah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "2nd time having a burger here. Both times there was a massive line outside. The food is great. Burger is really high quality (had the Kobe beef). It was cooked a little too pink for my liking, but I was so hungry I look past it. Thankfully I did, because the burger was delicious. A little cold, but I didn't mind. Fries were exceptional too-just the right amount of crispiness. \n\nI'm trying to cut down on eating beef, but Frites 'n' Meats is making it hard, especially with their punchcard. \n\nIf they added a chicken sandwich/burger, that'd be a game-changer.", "author": "Metkel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "I used to be a vegetarian.  During that time I realized that my absolute favorite food is an awesome burger. Now that I am no longer a veg I try to sample as many burgers as possible in search of the perfect one. Enter Frites \u0026 Meats, home of the $8.50 waygu burger. I got the waygu on potato onion bun with lettuce tomato onion ketchup and onion jam. It was cooked perfectly, tasted buttery and had the perfect char on the bread.  If I could I would eat one every day. Service is polite and quick. Perfect.\n\nPlus they give you a complimentary dum dum which I prefer in almost all situations.", "author": "Dina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Yum! Great burger! Got it from the food truck in midtown but assume the store will be good as well.", "author": "Romina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Best burger in NYC.  yea i said it.   \n\nconsistently fantastic.  The burger is always cooked to a perfect med-rare and the frites are always crispy. You would think when there's a line of 30 people, they'd rush and push out a overcooked burger or soggy fries, but they don't.   During the lunch rush wait times can be 15-20 minutes but you can call in your order in advanced.\n\nBeen saying for years that they should have a brick and mortar spot and they finally do. burger bar coming to williamsburg.  can't wait to check ti out", "author": "ben s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Burger of the Day - Week - Month -Year\nWe sooo look forward to Thursdays here in #DUMBO cuz (like kids) we're waiting to know what the \"taste\" of the day will be. Angus beef, carmelized onions, applewood bacon, any cheese you please, OMG can you say Deeeelishh!  Now to the \"frites\" real potato-crunchy (even when cold) add cheese and it's a wrap!  Did anyone ever figure out the lollipop?", "author": "A.J. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "Quality burgers, cooked well, gourmet toppings and great fries\nGot the Smithland special today, with brioche bun, Gouda cheese, and fried onions. Not one part of the meal disappointed me.\nThe burger was juicy and tender, and the bun held the toppings very well.\nThe fries were very crispy and seasoned well and the horseradish aioli was really good\ni would only say that i don't believe burgers should ever cost more then a whole meal that I could get at another truck.\nDon't get me wrong, I will be coming down to the truck no matter what the price is to get a burger from here, just because it tastes great, and I am a sucker for a good burger, but I don't love spending 13 bucks for a burger and fries when I am buying it at a food truck not restaurant", "author": "Leo K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "This is my Wednesday lunch every week. I try to change my burger up each time, and every time it's amazing. The selection of toppings is great, the burger is always cooked how I like it (which rarely ever happens anywhere else). The staff that run this truck are friendly and the service is quick. I wish they had a restaurant so I could bring my friends!", "author": "Thomas L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "Over time, Frites 'n' Meats has become one of my favorite food trucks in the sparse NYC food truck landscape, its clockwork-like Monday appearance near my Midtown office a deserved excuse to pig out with a juicy burger and fries.\n\nBurgers are juicy, and still red in the center.  There isn't the excessive topping novelty of, say, a Five Guys' burger, but it's not needed here.  These burgers are merely a vehicle for delivering the flavor and texture of the meat front-and-center.  I've found through trial and error that on this burger, many of the toppings can get quite superfluous.  I tend to like onions and pickles to provide a tangy counterpoint to the meat, but really, even those aren't necessary with this burger.  That this comes from a truck just makes this all the more impressive.\n\nFries are double-fried in the Belgian style.  Probably as a result of this cooking style combined with however these fries are sourced, the end result is the type of fries Burger King's fries try (and usually fail) to be.  As some other reviewers have pointed out, this is not a bad thing at all.  Fry portions, served in a paper cone with a newspaper print in reference to the Belgian origins of fries (frites?) as street food, are extremely large and intended for sharing.  For a few quarters more there is an assortment of aiolis and sauces (mostly mayonnaise-based) available, similar to those you'd get at a Belgian pub -- though the fries are great as they are, but consider trying one of these for the full experience.  You have the rest of your life to dip fries into ketchup.\n\nThe only issue is when I go here, I want both a burger and fries, which means I end up spending more money than I want to get more food than I can eat.  Granted, the fries are quite cheap given the portions as of this writing, and would be fantastic for sharing, but it's still a massive portion for one person.  If this truck offered a smaller individual size offering for fries, it would be perfect.", "author": "Aaron L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-14", "description": "This is, by far, my most favorite burger place. Whenever the truck is nearby I'm definitely there. And it can get a little pricey if you want to throw everything on it, but OMG it's good. \n\nMy fav order: angus on a brioche with goat cheese, mesclun, onion, tomato, bacon and pickles. I usually split an order of fries. The burger is cooked perfectly and goat cheese is oh-so-delicious!\n\nTip: You can order ahead so you don't totally have to wait in line.\n\nTLDR: highly recommended.", "author": "Baramee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "After dodging this truck several times because of the scary long times, I finally hit it at the right time and decided I had no reason not to give it a go... plus I was really craving a burger!  I was happy to see that regardless of lines, they seem to crank out your food pretty fast. I only waited a few minutes. \n\nIt looked to me like you can choose from pre selected burger combinations or customize your own, which seems to be what most people do here. It's part of the fun!  I stuck with the standard Grass Fed Angus Burger, on a Brioche bun and added Gruyere, savory onion jam, greens, a slice of tomato and mayo.  It was divine. Everything tasted fresh, delicious and of good quality.  They've got a lot of wonderful add-ons and flavors to really take your burger to the next level.  I held off on fries. They seemed pretty ordinary and didn't look like true Belgian Frites as advertised, but I did love the sounds of all the dipping sauces they offer. I should really try em' before knockin' em. \n\nThe best part was the dum dum lollipop they throw in the bag for after. That was a nice touch.  I'll definitely keep this truck in my lunch rotation on days when I want to indulge.", "author": "Christina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "Frites n' Meats is pretty neat. They have tasty eats for a lunch time treat. The cook your meat to the perfect heat; from a truck that must be quite a feat. \n\nTo order you must fill a sheet and spend a fairly long time waiting on your feet. But that's alright because they hands down beat any burger you'd get on the street. Take a bite and you'll be greet by a fantastic flavors you'll want to repeat. The weaker spot would be the frites, but Frites n' Meats should not retreat. \n\nTheir burgers do deserve a seat at the table amongst the elites, but a cut in prices is the one thing I entreat. But otherwise, their reputation is concrete. So the one piece of advice I'd like to repeat is that you should track down their truck from their Tweets and help yourself to something sweet.", "author": "Alsan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "Ordering process is simple and aamzing... just write down your superhero name with a sharpie on a card.  circle what you want..  pre-thought out creations.. or one of your own.... hand it do the guy with your money and wait.\n\nI went with the Skirt steak burger with Gruyere cheese.  Which was very good... but a little tough to eat as you will end up ripping the steak out of the bun and bite off more then you can chew.  The taste was good.  But i was disapointed not to find any guacamole on it.\n\nBut very happy to see skirt steak burger on the menu.  which isnt a burger but a skirt steak on a bun.. im not sure why i keep calling it a burger.\n\nCost 10 dollars.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-06", "description": "Tried to go here, but unfortunately they treat their open/close times like a suggestion and close 15-20 minutes earlier than they say they will.  Too bad -- thought it might be a decent place, but not worth the effort to figure out if they're going to be open or not, so it's a hard pass.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "I love this truck. I have been getting fries from them every Wednesday for the past few years. The fries are consistently amazing, the portions are big, and the prices are great. The guy that takes the orders will remember you if you come consistently, which is pretty impressive for a truck. He knows I only get fries and will just put in the order for me when he sees me.\n\nAlso you get a Dum Dum with your fries, which is awesome.", "author": "Sarah S."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}