{"aggregateRating": {"reviewCount": 182, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "I eat there almost every week if I can. One of the best burgers in the city. If I can't find a good special, then I simply get the kobe burger. \n\nEvery now and then I get the fries as well. If I'm gonna eat food that is not exactly good for me, I will at least make sure to enjoy it as much as I can :)\n\nDefinitely recommended.", "author": "David K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "Went on a friend's recommendation\nSaw how thick the patties were online so I wanted to try \n\nI like how you order by checking off a order sheet. Not good that I had to go thru three markers until I got one that had ink\nGot wagyu beef, brioche bun, gruyère, onion, tomato, mesclun \nCame out to $9.5 so with tax was $10.34 \n\nCame out in a few minutes. I was the first one to order before there was a line \nFirst thing I noticed was that it was cold, weird tho because the cheese was melted\nBun was a bit rough too \n\nWhen I got back to the office, the burger was indeed cold, well maybe room temp. Worse was that it was overcooked. I was looking forward to juicy tender wagyu beef burger rawr. \n\nTried their fries too. Dunno what's Belgian about it. Interesting how double fried gives it the chips crunch on the outside but got tired of it quickly. It's a thinner type.\n\nCute they give everyone a dum dum", "author": "Dorothy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "These guys are awesome. Super nice and great burgers and fries. \n\nPeople wait in the freezing cold or burning heat for their food with good reason. Can't recommend them enough -- it's worth the wait.", "author": "Kishore D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Frites n' Meats, Burgers \u0026 Fries (you say Tomato , I say Tomahto) ....however you wanna call it - just don't call me late to dinner. \n\nHad the pleasure of trying this food truck and and what a pleasurable experience it was. Had the privilege \u0026 honor to chum it up a bit with the chef/owner...great guy! Very friendly \u0026 experienced. \n\nChose my burger (grass fed, w/ Gruyere, topped w/ bacon \u0026 Jalapeños and their special sauce).  After you get your mouth around this burger skyscraper to bite down into , your taste buds are in heaven.  Great juicy, tender, large burger patty.  Absolutely delicious!!!!  The fries were on point! Especially with that garlic aioli dip. \n\nKudos to the chef!!!", "author": "Jason C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "I cant remember the last time I had burger this good - to me, a good burger is not only tender and flavorful,  but deliciously moist and juicy, and these guys nailed it!\nThe grass fed burger was perfectly cooked (pink in the middle), and they dont cheap out on dressing it out - even the pickles were crisp and delicious. \nI had the spicy/chipotle fries with the chipotle mayo with my burger, and if you like spicy, but not overbearing hot foods, definitely give these a try! \nThis was my first lunch with them, and definitely not my last!", "author": "Bob D. B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-01", "description": "Tasty, but totally full of grease. I ate here for lunch, and in the last 5 hours, have had 4 trips to the bathroom. Not a good work lunch", "author": "Graham G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "This truck is HANDS DOWN, serving the BEST BURGERS and FRIES! What else can I say that hasn't been said already. They just do it right.\n\nThe Burger:\nFirst, grab the menu and a sharpie and start filling out your choices. Whether you pick the BOTW (Burger of the Week) or create your own, I guarantee you're going to love this burger. Let's break it down:\n\nThe meat: always cooked to a perfect medium. Very flavorful and fresh meat and you can taste the seasonings, which aren't overpowering. \n\nThe bun: I always go with the brioche bun but they do offer a few selections. The brioche holds up extremely well. Has that perfect buttery flavor and just is the perfect vehicle to hold all the toppings of the burger.\n\nThe toppings: fresh selections and an abundance of choices. Don't go too crazy with the variety. The selections of cheeses is great as well. Seriously, who offers gouda anymore! THESE GUYS!\n\nThe Fries: double fried so perfectly crispy on the outside, soft on the center. PERFECT!\n\nThe owner taking your order is extremely nice and will even give you suggestions with your order. Awesome service. \n\nGreat Food truck doing it right! Keep it up!", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "I order my Burger well done,  ...and its AMAZING, perfect every time \u0026 and juicy! \nThe Fries are to die for!!!! \n\nMust have every Wednesday!!!!!", "author": "Lulu R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Ignore any review that is less than 5 stars. Seriously. I walked out of work at lunch time, prepared to go grab something quick in 20 degree temps. This truck had a massive line waiting in front if it ... in the cold! I asked someone if it was worth the wait. They smiled and said yes. So glad I waited. If the fries weren't  the best I've EVER had, they were damn close. The burger was rockin' too. Like crazy good. I shared my fried with work colleagues and we will be on the lookout for the truck next week. So good.", "author": "Jarrod H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "Rarely do I give 5 star reviews out but this one is well deserved! Excellent service, excellent food! I've been here in the past, but this is my first full service meal here (burgers and frites together). I came here for lunch around 11:50am on a weekday and there was already a small group of people waiting. I thought I had beat the lunch crowd, but I was wrong. \n\nI love the ordering system here where you grab a marker and menu card and mark off what you want. Excellent thinking and very efficient. In addition, they offer a loyalty card where if you come here more than 10 times for a burger you get 1 free! Another big plus! On my first try, I had forgotten to put my name on my card, but the guy nicely asked what my name was and wrote it in for me telling me \"No worries\".\n\nMy burger and frites were ready in 5 minutes and off I was back to my desk. Here's what I thought:\n\nBurger - I got the Angus Beef burger with cheddar cheese, raw onion, tomato, pickles, mesclun greens and ketchup. The burger was EXCELLENT! The burger was big, juicy and cooked to perfection (medium to medium rare). Nothing else I can really say other than it was a great burger!\n\nFrites - They gave a massive amount of frites in a cone. It was pouring out of the cone and there were plenty inside the bag when I took the cone out. Don't you just love when there are extra frites lying around in the bag? It's like free frites! The frites were fresh, crunchy and (this is in no way a knock) like Burger King fries. They were lightly salted and really good.\n\nBy the end of this meal I was 100% satisfied and full. Rarely do I get both feelings at once, but it was the case this time around! Look forward to coming back and getting my free burger one day (after the 10th of course)!", "author": "Chris E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "When I saw that there was a long line, I was a bit hesitant to wait for something I've never heard of... but if the line is long it should be good right? Well let me tell ya, this food truck is amazing! I am personally not one to order a burger cooked at medium. I'm more of a medium well kind of person -- but it delicious! Their french fries were crisped perfectly \u0026 if you haven't tried it yet, you're missing out!", "author": "Adrielle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Very popular truck for lunch! During prime lunch time I waited about 15-20 min to order and get my food. \n\nOrdered an angus burger with bacon, greens, ketchup, and tomato with a side of frites. Solid lunch spot in the area! Definitely a food coma-inducing meal choice but if it's a \"treat yourself\" day or it's been a long week, why not indulge on something a little less healthy in the plethora of salad options in the area?", "author": "Carissa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "I absolutely LOVE this food truck - so much that it makes Thursday (the day it's in Dumbo) my favorite day of the week! \n\nThe burgers are DELICIOUS and you can't miss the fries they are so crispy and are making my mouth water as I write this (dramatic I know but so good) \n\nMost definitely worth checking out - I consider this truck as my favorite burgers I've had in NYC and I'm a California native. I definitely recommend ordering ahead for pick up and make sure to check out the burger of the week and speciality sauces!", "author": "Ally K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Really enjoyed the hamburger of the day and the fries. I would come again. Perfect lunch spot", "author": "Jennifer c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "OMG!!!!! I LIVE FOR FRIDAY'S here in downtown Manhattan.  When I see my yellow friend  (The FRITES truck) my heart melts.", "author": "Shavita S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "When ever i need my burger/fries fix these are the guys i would turn to. Burgers are made just right and i can never get enough of those fries. Juicy burger, crispy fries and when all is done i just want more. \n\nThese guys are super friendly which makes this a big plus. \n\nWednesday is BURGER DAY!!!", "author": "Kevin N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "The good:\n1. Food quality A+\n2. You get plenty of food for the price (anyone complaining that the food is expensive should just go to McDonald's since clearly they prefer to eat trash) \n3. The owner is so nice, he even remembers your name after you've been there once or twice (seriously I walked up to the truck and he goes \"Bianca right?\") which is amazing considering the fact that he sees so many different faces every day\n4. The fries...\n5. The weekly burgers are always a perfect choice \n6. You can place your order over the phone so you don't have to stand out there and wait\n7. They give you a punch card so every 10th burger is free \n\nThe bad:\n1. They're not at my location every day\n2. The lines are always half a block long (actually technically a good because it shows how good the food is)\n\nSeriously, if you see this big yellow truck sitting on a corner consider yourself lucky and hurry to get some food \n\nSide note: I don't have any pictures because I usually eat half the burger before I can unlock my phone lol", "author": "Bianca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Solid burgers and frites!!! The burgers are always cooked perfectly and are fresh!!!! My office usually hits up their Tuesday spot once a month!! The frites are tasty as well. They have lots of options for toppings and for dunking your frites. He garlic aioli is one of our offices favorites. If you are a meat eater then you need to find these guys and check them out! You can follow them on Instagram so you know where they are each day!! #noms!!!!!!", "author": "Jami C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-19", "description": "This is a What Works/What Doesn't Work review.\n\nWHAT WORKS:\n\nHigh quality delicious large beef burger (I got Angus), fresh toppings, made to order. Really a special treat, this burger. \n\nWHAT DOESN'T WORK:\n\nGuys, don't let your cheapness ruin your brand. Packets of Hunts ketchup? A definite red flag, and you can't possibly think it passes for organic. And you up-sell your Jazzy Sauce and Savory Onion Jam; .75 each, but then you just put on a tiny smidge of each--that kind of nickel and dime-ing is uncool, and New Yorkers don't appreciate it. \n\nAlso your \"frites\" are no bueno. They're hot and crispy and you follow the Five Guys model of giving way too many, but they are not the fresh cut pure potatoes in oil I expect from an organic brand, or for something called a \"frite\". These are just some salt-infused suspiciously too-crispy probably-frozen fries.", "author": "Roberta L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "This was the first food truck I tried at the Mex Fest Food Truck Event this past weekend. My boyfriend \u0026 I were hungry and this was one of the food trucks we saw first, so decided to give it a shot.\n\nMy boyfriend ordered an: Angus skirt-steak sandwich on brioche bun with lettuce, onion, tomatoes, and pickles. The burger pretty big and a good size. I ordered an: Angus skirt-steak sandwich on brioche bun with lettuce, onion, tomatoes, pickle, and bacon. I hardly order anything with bacon only because it's not good for you. The burger was excellent! It was definitely one of the better burgers I've had. It was juicy, voluptuous, tasty, and divine! \n\nWe decided to order their \"Double fried Belgian style frites\". It was served in a cone, which was interesting and different than how I'm used to. OH MY GOD, these were literally the BEST fries I've ever had. They look like McDonald's fries, but way better because they were light yellow and perfectly salted and just so so so crispy. We didn't even need to season it with additional salt or pepper because it was up to par!  \n\nFrites 'n' Meats is a definitely must-visit for burgers and frites because it's just amazing here. I sure hope I run into them again because I keep dreaming about their deliciously amazing frites.", "author": "Jessica D."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Frites ‘n’ Meats", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": null, "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9CaC3trNtltvZnjxPN0Dow/ls.jpg", "@type": "Restaurant", "telephone": "+19172929226"}