{"aggregateRating": {"reviewCount": 4, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "Everyone has \"their deli,\" the place where the workers know your name and memorized your favorite order. At Sunny Delicatessen (more commonly as 'Harry's\"), Joe and Dante (the workers of the deli) are far more than that. Harry's is located nearby to a school which means that there are many students who stop by after school to grab a bite. Joe and Dante know every single student by name, remembered from the first time they are introduced, as well as every order and preference. Joe and Dante always make an effort to connect with their customers and develop long lasting relationships. When kids come back from college during the holidays they are always sure to visit Harry's and catch up with Joe and Dante. As a student myself, Harry's has and will always be one of the most memorable aspects of my growing up. I have rarely stopped by in the morning to pick up food before school, but the few times that I have, I have had the pleasure to interact with a third worker who is known to be just as kind as Joe and Dante.\n\nIn addition to the amazing workers and customer service, the delis collection of snacks and beverages don't disappoint. Neither will Dantes amazing bagels, sandwiches, salads, and other various foods. If you're lucky you might find a nice note from Dante written on your order.\n\nAll in all, I highly recommend Harry's if you live nearby or ever find yourself in the area and want to grab a quick meal or chat up with the two (or three) nicest people in Brooklyn.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Exactly as others have said - this is the real deal. Small, authentic neighborhood deli with candy jars lining the counter tops and a small cooktop where they sling out tasty BEC on a roll and quality coffee. It's tiny and cash-only, but that's part of the charm. And the folks that walk in there are regulars. Great spot.", "author": "Dat N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "I went there a couple of times so far since I work in the area. I love this store. It's small but Dante and Joe are very nice. The lunch sandwiches are fresh and delicious.  They have a big selection of candy which I love because I have a sweet tooth. They have everything under the sun. It's a really cute store with wonderful customer service.", "author": "Bella-Love B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "NOTE - This place is CASH ONLY. \n\nSomehow I lived a few doors down from this place for a year before realizing it was a deli. Now I go there a couple times a week for breakfast sandwiches or for lunch. They are the cheapest deli in the neighborhood for decent breakfast sandwiches, bagels, and deli sandwiches (I can't remember the exact prices, but a bagel with cream cheese and iced coffee is around $3.50, and I think an egg and cheese on a roll is about $2.25..ish). Also, the place has a cute neighborhood-y feeling because the majority of patrons know and are known by Dante, the cook. \n\nThe line can get pretty long during peak hours, which are generally 8-9am and after school around 3pm. Also, although I look every time I stop by, I have yet to see their health grade posted anywhere and I can't find it on the NYC website despite extensive searching.", "author": "Caroline C."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "Sunny Delicatessen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "153 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/uj9xQe1wbmy09EfMd99N5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17186241956"}