{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "This has been there forever! Glad it is seeming to stay open amidst the changes in the neighborhood. Eat here! Support long time businesses. Ate here the other day after not eating there for a while. I was VERY pleased. It's sad that it can be hard to find just classic New York pizza in Those parts of Brooklyn these days. It seems like everyone's trying to do something fancy.\n\nI know they also have a pretty nice yard. You can rent out the back for events I believe. I've seen kids birthdays there.", "author": "Took E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "One of the best slices in the area!! My Little Pizzeria has been around for decades and there's a reason why! The pizza is cheesy and always comes steaming hot. If you're looking for a quick, gooey slice, this is the place to go!", "author": "Carly G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-25", "description": "I have been here several times.  And know I was ripped off with my change...today I walked in with a hundred dollar bill and he tried to give me change for 10.  Theives!!  Cheap pizza=cheat people.  Thank God the lady next to me notice I gave him a hundred.  Dirty dirty people.", "author": "Patrick O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "I've been going here since I was a little kid and I'm just going to come out and say it - it's the best fresh mozzarella slice in Brooklyn, likely all of NYC!  It's a Brooklyn Heights cult favorite, which has stood the test of time, unlike many of these new, pop-up/close down restaurants.  Always quick, hot, fresh and still a killer deal!  Should not be missed and will easily become a new favorite!", "author": "Sara S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-17", "description": "Once upon a time, before Brooklyn became this gentrified and overdeveloped, My Little Pizzeria was a new kid on the block and one of the first pizzerias to move away from processed cheese and substitute it with the milk-y  white fresh mozzarella variety. And it was soooo  good!!\n\nFYI, I am a native Brooklyn-er and was a  youngin (nope, not revealing my age) when they opened. The owner who was from Italy, was usually onsite at the store and it became a go to pizzeria.\n\nThen, through the years, something happened. They expanded (that's fine) the space and the menu offering other food items such as gelato, coffee, etc. In the process, it seemed that the quality of the pizza suffered.\n\nNowadays, I'll still grab a slice or two when in the area, but I no longer brag about it. It continues to draw lunchtime crowds and has a following, but what was once a shining star has dimmed :(\n\nStill, it's more than edible (it's actually good in an average manner) because as one of my other reviews mentioned---even when pizza is bad, it's still (pretty) good (definitely doesn't apply to those awful franchise pizzerias of which I never patronize).", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "I don't know how I've never reviewed this pizza ... I've been coming here for over 20 years and have never been disappointed by  a slice. I do know that around lunch time the line can go from long to hellacious really quick but that only shows how dependable a slice from here is. I've gotten friends and family alike hooked on their pizza. While it's not the top of the top or in the \"holy grail\" of nyc pizza it is delicious , consistent slice of nyc from crust to point. The crisp thinness of the slice only adds to the goodness. Plain is my favorite (with or w/out the fresh basil) seconded by pepperoni. The fountain red and purple drink in the front used to be awesome back in the day, but now it's flavorless colored liquid)the guys at the counter are great characters under pressure or not and remember your face but not necessarily your order.", "author": "Cassandra S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-10", "description": "Good, cheap pizza. I like the little courtyard in the back and that they serve fresh basil as a topping.", "author": "Robert L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "Needed a quick cheese slice before the movie. Good service. Good pizza. $2.50 a slice, .50 for toppings. They used gloves. Plenty of seating. I would return.", "author": "Genie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "We were searching for a good slice...we found it here! Opens at 10:30am (also a major plus Bc we wanted to skip breakfast and go straight to lunch) and everything was so fresh and cheap! You can't beat a slice of pizza for $2.50. Thoroughly impressed!", "author": "Morgan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Been eating here for years. A classic for a plain slice and damn good garlic knots. Quick delivery. Better than most places in the area apart from fascati's but it also owns in the nostalgia area.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-28", "description": "No longer the best when you want your pizza delivered.   Don't order anything on a Sunday unless you like your pizza cold and soggy.", "author": "Karen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-10", "description": "You cant beat this place for good cheap hot pizza...\nIf your broke you can get filed up on 2 slices for 5..\nI like the guys who work their asses off there too..", "author": "Sonja G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-22", "description": "Slowest pizza place with terrible customer service. \nI ended up going down the block to Pronto Pizza and got serviced right away. I've also tried Piz-Zeta and it's a lot better. \n\nI've been here probably a total of 5 times. \nThere's always workers just standing around. They just don't want to take your order right away so you have to flag them down, and even then, they avoid eye contact to purposely avoid you. It takes over 5 minutes to get your order taken even if it's only one person in front of you. \nThen another 5-10 minutes to get your order.\n\nThey completely ignored the fact that I was on line today and asked the people behind me even though it was very clear I was waiting and trying to ask for something. That was the last chance I'm giving them. \nIt's cheap pizza but probably the blandest I've ever had. I only came here because my bus is right outside and it was a place to keep warm while waiting for the bus. \nAlso, it'd be nice if you took off the gloves to swipe credit cards, and change gloves between handling money.", "author": "K W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "This place serves THEEEEEE ABSOLUTE BEST pizza!!!! It never ever ever disappoints. On many occasion, I have requested my husband to bring me a slice of pizza home from this pizzeria although there are several places to get pizza in a 10 block radius. I always walk the extra 5 blocks to get pizza from here! \n\np.s. Hope all those lovely Latino workers in there are being paid a honest wage. They work very hard!!!!!! Excellent service.", "author": "DashE O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "I was away from NYC for a few years and this was the cheese slice I dreamed about when living in a barren wasteland of chain pizzerias. Now I'm back and the pizza is as great as I remembered. Good thing too, because NY pizzerias have been slipping. The quality in a lot of the places I've been to since returning is just not there. \n\nKudos to anyone who can keep the consistency of their product up for so many years.", "author": "Tomaito E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-05", "description": "I don't usually leave reviews but I have been ordering from here for many years.  This is the 2nd week in a row where I've waited over an hour for my delivery.  I used to love this place and always referred people here.   Now the pizza is not even as good as it typically was.  The crust has no strength and the pizza is soggy.  Probably not gonna be ordering from here anymore.  Disappointed.", "author": "Justine V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "Great old school pizzeria.\nLove the square sicillian \nBeen going on and off (moved around) since it opened in late 1980s", "author": "T A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-26", "description": "NYC pizza should have normal to thicker than average crust but not this place the crust is so thin the entire pizza breaks when grabbing it at the end of the crust. The taste is not what you expect of a $2.50 slice.  Not only will you be displeased with the pizza but you will also be displeased with the customer service.  God forbid you say I can't eat 6 garlic knots can I just buy half of them, they will say no you can't with a terrible attitude.  Very disappointing experience and wouldn't recommend to anyone.", "author": "James C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "I don't drop 5 stars often (if ever) but if any pizzeria in NYC deserves it, it's My Little. \n\nThe pizza is excellent (get the plain slice or a pie w/pepperoni and mushroom) and it's absurdly good value. A slice is $2.50, a big pie w/toppings is $22. \n\nAlso, the ambience. Yes, at first it feels like you walked into the 80s. But look closer - you'll notice EVERYONE from the neighbourhood is here. Cops, high school kids, locals of all sorts. Again, that's because the pizza is great. \n\nAs for the bougie newcomers complaining about the service, these guys work their ass off and are actually quite friendly. Cut them slack. This is an old school pizzeria, not brunch. \n\nBottom line, it may not look like it but My Little is a Brooklyn institution.", "author": "Jeff R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "I don't get the less-than-5-star reviews. This is consistently the best slice in New York. It's the only place I've frequented for 20 years, and I always say the same thing: God, it's so good! Seriously, it's the only place in NYC I haven't either gotten sick of thought went down in quality. And it's still only $2.50 a slice!  The plain slice is always delicious, as is the Supreme (the fresh mozzarella). And if you get mushroom, you get fresh slices on top, not the mushy jarred stuff. Added bonus: fresh basil on the counter. \n\nFor reference, I'd say this ties with Joe's (Village). Different style pizza (this is thinner, less chewy/dense), both awesome.", "author": "Tanner L."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}