{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "Immediately upon walking in you are greeted with an overwhelming aroma of garlic knots and your stomach gets ready to eat !\n\nI had 2 slices of plain and was shocked by how large they were for what they charged (like 4 and change). the pizza was delicious but just a little too luke warm bordering cold by the time i started on the 2nd slice. \n\nI will definitely be back; i really want to try their margarita slices, but next time, i will make them heat it up", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "I've only had the fresh mozzarella slice but it is fantastic. Their sauce is right up my alley: not too bland, not too sweet. For whatever reason the staff seemed a little 'distracted' both times I've been in there i.e. not rushing to attend to new customers, but maybe it was just a misunderstanding.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-29", "description": "I came here after the Atlantic Antic, on the recommendations of 116 Yelpers before me. Figured they all couldn't be wrong and that I would be graced with good, authentic pizza that would tantalize my taste buds. \n\nI must have come in on a bad day. The pizza was nothing all that great and was a TOTAL disappointment. I ordered a \"supreme\" slice with fresh mozzarella and basil. Looked carefully. Twice. Couldn't find a piece of fresh basil if my life depended on it. And it tasted like oregano, not basil. The sauce looked and tasted more like tomato paste. If you could even decipher any taste at all, because the food had barely any flavor.\n\nOne of my dining companions ordered a chicken roll and the sauce to dip it in was cold. The whole thing just did not look appetizing. I felt so bad that he had to eat it.\n\nI also tried a white slice, which was another near-atrocity. Totally unappealing and almost tasteless.\n\nThe ONE saving grace was the the crust was very thin...but it wasn't crispy, so boom, there goes that extra star I would have given this place. \n\nIt's always disappointing for me to write a negative review, because I know I tend to feel a bit miffed when someone bashes a place I love and they say the food is horrible. Especially when the establishment seems to be a fan favorite, I do try to allow for the possibility that my negative experience is unique and the place is actually very good typically. However, I can say that the three other people I was with had similar reactions to the food and thought our visit was a total and utter bust.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-14", "description": "My Little Pizzeria isn't really that little.\n\nIn fact, there are two dining areas, a patio out back, even a gelato counter. But maybe My Little Pizzeria is just its mafia name. You know, like when the lankiest lackey in the crew's affectionately referred to as Fat Tony or some shit.\n\nEither way, this is standard New York pizza. And where I say standard for the city, I mean still better than anywhere else. But My Little Pizzeria isn't home to any sort of destination slice and their offerings are pretty bare bones. Yet I can't deny liking my pizza more and more as I chomped away at it. The sauce has just a touch of sweetness to it and the thin crust is sturdy enough so that it doesn't collapse under its own weight, while at the same time, allowing for maximum foldability. When I get to this level of analysis, maybe it's time to acknowledge perhaps I've eaten too much pizza in my day.*\n\nMy Little Pizzeria is one of those joints where, if I'm in the area, I'd certainly consider. But, otherwise, I wouldn't go out of my way for it. Which is a bit of a shame because, for whatever reason, My Little Pizzeria seems like a place that would grow on you. Even in my short visit here, it proved to be a spot that only got better with each bite.\n\n*False. There is no such thing as too much pizza. Regardless of day.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "Cheap, cheesy, and crunchy may not work as the prototype for your mate, but it certainly is the prototype for good slice.  My Little Pizzeria has one of the best slice offerings in all of Brooklyn.  \n\nThree things make good authentic Brooklyn Pizza: 1) Slightly sweet sauce; 2) proper cheese ratio; 3) soft crunch crust.  MLP has all three and my taste buds have never been let down.", "author": "Brandi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "This is our go-to pizzeria, so I'm surprised I hadn't rated it yet.  Bottom line: this is an above-average New York city slice shop with one pie in particular, the Supreme (a saucy, fresh mozzarella pie) that really is pretty good.  I don't think a visitor to NYC would be disappointed with that they get here.\n\nHaving  said all that, there's nothing special going on here.  MLP is for nights when you're too tired to cook.  When the word \"pizza\" dances in front of your sleepy eyes as the baby decides that sleep isn't as interesting as slapping everything in the area happily; for nights on the sofa with a movie. The ingredients aren't especially good, and the crust could be a little better, and I like the sauce, but there's plenty of better sauce out there. It's just a fine pizza shop, and we reward it with our business more often than not.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-16", "description": "We were in a pinch to get some lunch on a Sunday. Although they opened at 10 am, they had only a cheese pizza ready when we got there at 11. They offered to put topics on the cheese pizza and put it in the oven, but even then, the toppings seemed raw. Pizza tasted okay, but I had to discard the toppings, which were pointless. They seemed quite unprepared to serve customers.", "author": "Joy A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-13", "description": "We just ordered a large pizza with 4 toppings.  \n\nTHE CRUST WAS SO STALE!  It was dense, dull and without flavor.   But WHY?  Is it hard to make fresh pizza crust?", "author": "Marci W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "I have been eating Pizza at this pizzeria since it opened. I grew up with this pie and let me tell you, it is the best pizza I have ever tasted in my whole life. I can eat 4 slices before taking a sip of water.  Warning this pie is addicting. I always order just cheese, but they have plenty of others to choose from. My pie addiction became a problem at one point, where I ordered 2 pies a week from this place. I highly recommend coming here.", "author": "L M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "My favorite pizza spot in all of Brooklyn. Why? It is always on point. Thin crispy crust, plenty of cheese and still only $2.25 a slice. You just can't beat that. Whenever I'm in the heights I always stop in for a slice or 2 with a grape soda.", "author": "Luisa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "I had there pizza via delivery. The pizza was pretty good.  The veggie pizza and the pepperoni pizza was good. I didn't order the pizza so I can't comment on the price but it seemed quick to me. The pizza is pretty decent there.", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-10", "description": "This is about as average as NYC pizza gets. \n\nBut delivery is quick, and if you've been drinking all day long, and your buddy springs for four pies for the group of you, you might eat three slices before anyone realizes what's happened.\n\nAnd although you might be slightly disgusted with yourself, you won't be able to stop eying a fourth.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "My sister might move to BH and if she does the guys at My Little Pizzeria will most likely know us by a first name basis. A great NY slice- piping hot, thin crust that still has a slight chew, lots of gooey cheese, and fresh sauce.  Fair prices and ice cream in the back. I took off a star because 5 stars is for that perfect slice that I will continue to chase and because I've only eaten here once so I cant speculate on consistency \nWhich is important to us pizza addicts", "author": "Caroline S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-05", "description": "I don't know why this place is even in business. First off they serve you a drink in a Taco Bell plastic cup, like are we serious? Second of all, the pizza had no taste, salt, any type of flavor. My mom ended up just eating the crust and I was so hungry that I just gulped it down. I seriously don't understand why this place is always full, as a lover and true native to New York I am so upset.", "author": "Bella V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "A childhood staple of mine---\n\nfast forward 20 years later. \n\n--A grown up staple of mine.\n\nLove the pizza, love the ambiance, love the memories. Great space and they even have an outdoor patio garden that didn''t used to be there. \n\n2 slices (1 cheese, 1 white) and a coke for about 5 bones. Not bad in Brooklyn heights.", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "Highly disappointed with this place. I used to come here all of the time and the pizza was decent. Ordered delivery recently and the pizza tasted stale. The pizza is very oily and hours later could still taste the oil. Pizza is mediocre with no ingredients. There are plenty of other pizza places you should go to.", "author": "Christi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "Prompt delivery when we call for lunch. I enjoy their supreme round pie. Nice oily garlicky knots. Haven't explored too much of the rest of the menu, but this is definitely one of the more solid pizzerias in the downtown Brooklyn area.", "author": "Patrick K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-28", "description": "MmMmM\n\nPie is awesome. I'm not much of a pizza person UNLESS it's from here. I was recently in NY for 3 days, and went there twice on two different days. The place is a hole in the wall but clean, customer service is.... eh.... I never expect much customer service any time I'm in NY lol Price is decent, $31 for a pie (8 large slices), 2 large salads and 4 drinks. Stopping at My Little Pizzeria is now a family tradition every time we go to Brooklyn. I can't wait for our next trip!", "author": "Rene N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "Love this pizza. This kind I grew up on Brooklyn.  Thin crispy crust, fresh basil \u0026 fast! OK not a lot fresh basil part growing up but it is yummy!", "author": "Me 2."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Delicious and cheap!\n\nFast moving lines and plenty of seating.\n\nNext time I'm in Brooklyn, I'll ditch my conference lunch (again)  to grab some of that cheesy goodness.", "author": "M. A."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}