{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-15", "description": "Ummm I can't believe nobody has reviewed the gelato here yet! On my walk to the train from seeing \"Babies\" at the Cobble Hill Theater, I was lured into My Little Pizzeria by a sidewalk sign advertising \"homemade gelato\". I went in and I was like \"Uhhhh I don't see any gelato\" and walked back out. Luckily, the boyfriend noticed that there was a different room in the back of the restaurant that had ice cream cones and stuff. Ah, here we go. Now, on the menu it says that a cup or a cone of gelato is $2.....ummmmmm okay, that will buy me like one mouthful, right? What??!!! That buys me two good-sized (for gelato, anyway) scoops of what I believe to be actually homemade delish gelato?? \n\nI got \"Italian Kiss\" (hazelnut and chocolate) and pistacchio. I was pleased to see that the pistacchio was a more normal nut-colored shade, instead of the usual neon green. And it tasted wonderful. The Italian Kiss was full of nice little crunchy bits of hazelnut, and both flavors had that wonderful, smooth, creamy, gelato texture.\n\nTWO BUCKS!!!!! It's more ice cream than you get from the damn Mr. Softy truck, and it's about a billion times better, and cheaper even!\n\nI want to make a yelp list of the top places to get gelato, and it goes like this:\n#1. My Little Pizzeria\nand the list is DONE because that's all you need to know.", "author": "Kelly R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "Best pizza in the neighborhood. Sicilian pie is fantastic! Plain round pie is great too. Open late on the weekends. Reliable delivery.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "Although, I have never ate inside the place I order delivery at least once a week.  There garlic knots are really the best ones I've tasted so far.  Never soggy, they are perfectkly crispy every time.  There regular slices are just regular, nothing special.---. But, that is why they are called regular slices right?   The only down side is there service over the phone...that is why I minused one star.  \n\nOrder away, you won't be dissapointed.", "author": "Christina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "So, I was never expecting to go to MLP or to want to write a review about a little hole in the wall pizza joint.\n\nI had been running around, trying to get a few CDs for my Dad (I will be reviewing about that as well if they arrive in time) and I was hungry, so I ordered an eggplant roll (only $4) and was very happy - the flavor was really good and the roll was the right combination of cheese and veggie. The breading was a little greasy, but I did not mind to be honest.\n\nGoing forward, I would probably not order the pre-made pizza from the case, but I would get a fresh pizza.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "i really dont like eating pizza but i like their pizza. i think they make one of the best pizza in this neighborhood. i am fun of their crispy grandma pizza. Yummy", "author": "Bilal S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "The plain and the fresh mozz with tomato sauce on top are the good slices here - quite good. \n\nThe best thing about this place is how they give away free fresh basil leaves as a topping along with the parmesan, crushed pepper, dried oregano. \n\nThe whole pies are solid but not spectacular. This is a pure slice joint, in my opinion. They do have plenty of space and a garden in the back, and they claim to offer specialty gelato, but I have not tried it.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "I love pizza. I'm from Long Island so I also tend to be a bit of a pizza snob. While I love a brick or coal oven thin crust with gormet toppings, I have a ton of respect for a pizza place that can consistently deliver a delicious plain or sicilian slice.\n\nI just moved into the hood and the quest for my go to slice began and quickly ended at My Little Pizzeria.\n\nMy brother chose a plain while I loudly admired the sicilian, but held off because we were about to get dinner and drinks (brother can eat like a bear). When they delivered his slice they gave me a free sicilian! I asked no questions besides \"for me??!?!?!?!\"\n\nThe sicilian was perfect. Doughy with a super crispy bottom. Perfect proportion of cheese and great sauce.\n\nPlain slice was very good. Cheese, sauce, and crust all excellent. Just as a plain slice should taste. The bottom could be a little crispier in my opinion, but a fresh slice is always a little floppy. Certainly wasn't a deal breaker because I came back the next day for my own plain.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-26", "description": "Good\nCrust but\nNeeds more cheese.\nTwo Twenty-five\nFor a plain slice off of Atlantic Ave.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-29", "description": "This is our regular pizza spot. My hubby ususally pick the regular pizza at least once a month.\n\nIt is really quick - wheather delivery or pick-up.\n\nOnly cash though.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "This spot has amazing pizza.  Their sauce is delicious; after eating a slice and a sicilian, I went back for another slice.  They both were really good!  There is plenty of seating in the back.", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-29", "description": "Regarding the garlic knots alone, these were a bit smaller and tougher than I would have hoped, but the flavor was good and there was plenty of garlic there for the garlic lovers. I bought a dozen for a dinner party I was having and unfortunately, they really don't keep that well. Definitely not bad if you can have one right away that is fresh! Might want to ask them how long ago they made it because I do think the batch I must have gotten could have been a bit stale to begin with.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-02", "description": "Their plain slices suck. As in not good. Not generally fresh, conglomerated cheese, etc. The bread is too soft and the sauce is too sweet. More decent slices are their fresh mozz. onces, which are edible but still don't quite hit the mark.\n\nSitting inside this place makes me feel gross. I don't know. There's an aura of depression about it, and I usually wait outside if the BF orders from here. There is, however, a saving grace -- they have a pleasant, outdoor dining area, it's quiet, with just a few tables and a painting of an ocean scene. Definitely the nicest part of the whole pizzeria.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "There really isnt a good slice place in the immediate area.  If you want a way better slice, take a 10 minute walk to the heart of Brooklyn Heights to Fascatis.  Or walk 6  blocks down Court Street to Layla Jones (which also has an awesome meatball hero).\n\nThe best slice here is the Supreme, with fresh mozzarella and tomato sauce.  It's definitely a HUGE step up from their normal slices.  I'm not a fan of their sicilian slices though.  This place is pretty inconsistent I feel too.  The slices I had today, for example, were pretty oily so I couldnt even really eat it with my hands since it would just droop -- fork and knife did the trick though.  \n\nThere's also a little flat screen that plays a video of the various specialties that My Little offers -- unfortunately, it comes with very annoying music too.  I wonder if it drives the pizza guys nuts...because it kinda annoys me everytime I go into My Little...or walk by.  The audio is actually louder outside!    The service here can be a bit slow too.\n\nOverall, this is just your typical slice place.  Good for a snack before or after the movies...or if you're stuck on jury duty I guess.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-14", "description": "Solid pizza. Really nice eggplant rolls with good tomato sauce on the side. My favorite thing about this place is the private little patio out back where you eat in the shade of fig trees. Right now, in mid-August, the figs are still green but fattening up. The fragrance and ambiance is so refreshing!", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-30", "description": "My go to place for pizza, when I lived in the area and I still go there when I visit.  The crust is soft and chewy, the sauce is well seasoned and the cheese is well blended.   Their pepperoni, white pizza and the margarita pizza are delish.  There is plenty of sauce and cheese on the pizzas, although I have found myself asking for extra fresh mozzarella on the margarita, just because I love cheese. \nThe Good:  Slices are a good size and its greasy enough. \nThe Bad:  If you are looking for dry non-greasy pizza, this is not it. \nThe Ugly:   They only take cash but there is a Bank of America half a block away.", "author": "violette c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "This is seriously some good pizza!! I can't pass this place without ordering a slice. I'm addicted. It's just delicious.", "author": "Pamela H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "They do it right!\n\nJust crunchy enough...flavorful sauce...the right amount of (tasty) cheese...served hot by friendly counter help.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-30", "description": "Best pizza in brooklyn!!!\n\nThe regular, sicilian and supreme (with fresh mozzarella) are all amazing!!\n\nGood place for a quick bite before or after the movies!\n\nAlso, quick delivery!", "author": "Heli S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-19", "description": "Free pizza when I show up to work? Automatic 3 stars!\n\nStill plenty of pizza around when I take my break so I don't have to spend some of my own money to get dinner? Still 3 stars!\n\nHonestly, my review may be a bit biased because I enjoyed two slices of regular cheese pizza free of charge. And supplied by my office no less. However, I'm not sure if it was because it had been sitting around for a while or what, but I have two major gripes about the quality of this pizza: the crust was damn near soggy (as in, no crisp or crunch at all!), and it seemed like there was more pooled up grease on this stuff than the entirety of pizza shops in the borough combined!\n\nStill though, it was free. And my employer gave it to me. For free. So I can't complain too much.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "Pretty good slice place. We were left with few options last night after seeing a show. We just ordered two slices of cheese, not expecting to be at all impressed. It turned out to be very fresh and pretty delicious. We had a cab driver once tell us that he goes out of his way to swing by My Little Pizzeria after his shift, so it was about time we tried it. Not sure if I'd go out of my way, but it's nice to have right across the street!", "author": "Sarah H."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}