{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Not gourmet. But if you're lookin' for cheap pizza that tastes pretty good, check it out! The $3.00 dozen knots  were pretty rad! Check out the cheap gelato in the back too!", "author": "Atlas C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-14", "description": "There are times when waiting over an hour for pizza isn't  practical.             \n\nThere are times when you need a really good slice.\n\nMy Little Pizzeria makes a really good slice.\n3.5 stars", "author": "James F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "This place makes decent pizza. Nothing out of this world, but its one of the best food options in the area. It stays busy so you'll get a fresh slice. Their menu is limited to pizza. The staff is cool.", "author": "Francisco T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "I love a good slice and this place really delivers.  (Oh yes, pun intended though I ate at the restaurant.)\n\nWhenever I come to the city I need to have some good pizza.  This is exactly what I wanted - nice, thin crispy crust, a sweet and salty sauce, and lunch for under $5 with a drink.\n\nBonus points for having all the seasonings at each table too - except for the fresh basil kept at the counter - also a bonus!", "author": "William H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-12", "description": "It said they were open until 11:30, I got there at 11:10 and was told they were closed. Never got to try their pizza, went home hungry.", "author": "Carly B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-05", "description": "Got a plain slice and it was decent. Very fresh. The flavor wasn't anything special.  I think there are better slices around.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "I have been coming here since as long as I can think back to my earliest memories. My family and I used to always stop by here coming back from mass on what is now closed the ST. Peter St. Paul church. This is the only pizza I am able to eat plain. I typically don't like plain pizza and always prefer pepperoni. I am picky when it comes to eating pizza. The sauce of My little pizzeria pizza contains flavor, not too over powering of seasoning but just right. I am glad it still tastes the same after so many years, and so glad it has remained open. I now bring my daughter here along with my husband whenever we are shopping around downtown. They both love it as much as I did/do !", "author": "Les R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "The perfect NY neighborhood pizza joint. The kind of place that every NY neighborhood needs. Solid slices and good pies with quick delivery.", "author": "Julie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "One of the best standard slice pizza places in Brooklyn. There's also a courtyard out back for outdoor snacking pleasure.", "author": "Benjamin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "The best pizza ever. Don't bother with garlic knots, you don't need them. Regular pie, 15 minutes. Wait inside or in the back outdoor space. Cash only.", "author": "Keely C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-06", "description": "I live in the neighborhood and have been constantly looking for a decent pizzeria. Fascati's is not good, and Grimaldi's....well...I'm not down to wait in line for an hour to get a pie. Sorry.\n\nMy Little Pizzeria was a seemingly decent option. However, after this most recent order of mine, I am completely fed up with their HORRIBLE service. After ordering from them around a dozen times, at least half of the time I would order and they would get it wrong on several different levels. One time, I've had them get my address wrong and deliver it down the street from me. One time, I've had them give me a Supreme Pie with no basil, only to call them up and have them argue with me that they gave it to me (believe me, I'd know if they handed me a bag filled with basil). Another time, the basil was old, and absolutely insufficient to cover a pie. Another time, I placed my order and the person taking the order said \"ok bye\" without reading it back to me to confirm that it's even what I'd like. I've even walked in to order, have them take my order, and then immediately go back to their phones and NOT start making my pie.\n\nNeedless to say, their pies are good. They use real tomatoes in their tomato sauce, crust is crispy and their pies are fresh. But, their service is (I repeat) HORRIBLE. Their staff members will argue with you over things that are incredibly easy to correct, and they are very unintelligent in dealing with their customers in a way that makes them want to come back for more, and believe me, I gave them the benefit of the doubt more than once in hopes that it wasn't just a blip on an otherwise good restaurant's record. \n\nThey do nothing to remedy any issue with the order.\n\nLONG STORY SHORT: DO NOT ORDER FROM THIS PLACE. They're very likely to get it wrong and then tell you that you're crazy.", "author": "Tyler H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-13", "description": "If you place an order to pick up don't expect it to be ready when you get there. I ordered a calzone about 20 minutes before I got there to pick it up and when I went they haven't even started making it! So frustrating, but this is not the first time this has happened. They were rude about it too. Like it was my fault that they don't have a better system for placed orders.  Pizza's good but they need more of a selection.\n\nUpdate: it truly is the best pizza place in the area. And ever since they been on seamless they've been super quick. I love, love their delivery guy who says, \"pizza time\" when you answer the door. How can you not smile at that?! So nice! So I decided to change it from 3 to 5 stars!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "This place is pleasant and the food is pretty good.  I wouldn't say the food here is exceptional but the place has a good family vibe, the food is cheap and filling.  Friendly \u0026 quick service.  \n\nOh, and there's extra seating in the back so walk a little before panicking.  :)\n\nThings my friend and I ordered today: \n\n- 2 slices of cheese pizza ($4.50)\n- 1 Tomato Sicilian \u0026 garlic rolls ($4) \n\nPs. The garlic rolls were pretty good!", "author": "Agnes H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "My children, husband and I go to this pizzeria every other day for years. We live around the corner. The pizza is perfect,delicious! We all love the atmosphere and the amount of room this restaurant has for you to enjoy our food; the outdoor garden is a plus! Me and my husband have one complaint...the horrible rude service by one employee and sometimes two others. If it wasn't for these three I would give the restaurant all five stars. We have been observing them for almost two years at times not being too customer service oriented. Speaking for my self one particular employee a heavy set guy who wears eyeglasses and is the only one with his collar turned up is the worst. He has been and is dismissive, waves customers off and I have sat and watched him talk to others and yell at them as if they were dirt. I am so surprised this guy gets away with it. He has been rude to me on numerous occasions. He spoke so horribly to one customer that I felt so bad for her. There are maybe two guys who I've never seen display this behavior...one seems to be slightly older. But overall none of them act as if they welcome or want your business. Also I can't count how many times the turned up collar guy has ignored my thank you , have a good day responses. Basically he has never acknowledged it in the years ive gone there. So two stars for pizza... no stars for service.", "author": "Toni N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "Great plain slices. Everything super-fresh", "author": "Ron B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-12", "description": "We've gotten delivery from here twice.  The first time was a simple pepperoni pizza.  It was fine.  Not amazing, but definitely not bad.  We decided we'd try it again.  Last night we ordered a Sicilian \"Supreme.\"  Don't be fooled...My Little PIzzeria has gone against all of the rest of pizza joints in America to have a \"supreme\" mean fresh mozzarella and tomato sauce, rather than the onions, peppers, sausage, etc it means everywhere else.  So after our 45 minute wait (longer than last time), we were extremely disappointed with a pizza with no toppings on it.  The guys at the shop were like, \"that's what we call a 'fresh' pie.\"  :-(\n\nSo, in other words...\nFRESH = Supreme\nSUPREME = mediocre mozzarella + tomato sauce.  \n\nLast night's pizza was so mediocre, and the experience so frustrating, that we're probably not going to be getting pizza from here anytime soon.  There are too many other joints in the 'hood to order from.", "author": "Leah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "Great pizza by the slice. If you are hosting a party or looking for something quick, this is a great choice. I also recommend the garlic knots. Some of the best I have had.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-22", "description": "The most frustrating experience I've ever had trying to order a pizza for delivery,  only to be told 0.8 miles is too far away.  Do yourself a favor and don't call or waste your time. Granted. I did not eat the pizza.", "author": "Jasmine N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "Want a slice and a Coke? Go here. A kickass slice (foldable, of course). It's cheap, too, $2.50 for a slice. When you think real NY pizza, this is the kind of place you think of. Walking distance to the Borough Hall station and the Transit Museum.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-26", "description": "Drove by one day while visiting my cousin in the neighboorhodd ,grabbed a pie on the go was automatically in love with their pizza. Always drop by when I visit this neighboorhodd", "author": "Maria G."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}