{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "Reliable, good pizza place.  Quality, albeit, limited food offerings - very reasonably priced.  Sometimes crowded but the line moves fast.  Nice woman in back will sell you great gelato/coffees/desserts for a couple of bucks. This place is one of the few places to frequent regularly in this neighborhood ... highly recommended", "author": "Carl E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "My favorite pizzeria in Brooklyn.  The best fresh mozzarella pizza in New York!!!!!  Wish I lived closer so I could order more frequently.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "They make one item better than most.\nGet the fresh mozzeralla slice. It's been great since they opened. The guys behind the counter treat you like they are doing you a favor serving you but the slices I mentioned above is definitely the move.", "author": "John D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-12", "description": "Not only are the people rude, but they constantly have \"B\" health inspection grades for violations for things like filth flies, cockroaches, etc.  Go a block down Court to Pronto Pizza for friendly service and clean food.", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "This place REALLY grew on me since I moved in across the street.\n\nFirst off, the 'za is just a'ight. It can be amazing depending on how hungry/drunk you are, but sober and not starving, it's average pizza.\n\nHowever, the CONVENIENCE factor here is mega-high and the people who work here are pretty effing awesome. The pizza comes to you fast and hot and they don't mess around in the kitchen, they get you in \u0026 out. \n\nSicilian slice with basil and tomato sauce with pepperoni and mushrooms is my go-to here and I'd recommend it to anyone.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "This pizzeria was my favorite place to have lunch at, for the four years I attended school nearby. \nI now make it my business to stop by every time I'm in Brooklyn.\nTheir Sicilians and pizzas are delicious. \nWhat makes the pizza so great is their unique homemade sauce!\nI would rate my little pizzeria as one of the top 5 pizza shops in NYC. \nI promise you will not be disappointed!", "author": "Liz G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-21", "description": "Four stars as far as pizzerias go, this is definitely my family's go-to for slices, pies, garlic knots, chicken rolls, etc. The sauce, crust, and cheese are all tasty and  the sauce-cheese ratio is just right! I would even go so far to say this is one of the top slice joints in NYC. My toddler son can attest to the pizza and the seating area in the back is one of the few places I can bring him for a meal where he can run around like daredevil he is.", "author": "Jen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "One of my go-to places for pizza when I am in Brooklyn Heights, I was shocked by the other bad Yelp reviews. The pizza is always delicious when I go, with a crispy crust , an excellent cheese to sauce ratio and a terrific, sweet, tart sauce. It is best when piping hot and fresh from the oven. I did notice that the pizza is not up to par after venturing here one late afternoon and getting a slice that had been sitting. This is not the slice to get at a slow time because it apparently does not reheat well. But if you walk by and see many people on line, which is usually almost always the case, go right on in and you will get an excellent slice. Its a classic NY slice, not an artisanal pizza but really tasty. There is also a metal tin containing fresh basil(and sometimes not so fresh) that you can put on your pizza.  I never noticed that it was unsanitary, which another Yelper commented on. My Little Pizzeria has a covered garden out in the back and more seating and a strange stand that sells gelato that seems out of place in the \"fake\" garden area. Seating is ample and the service, to me, has always been affable.", "author": "Helen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "Their pizza is amazing! The prices are amazing and the pizza tastes delicious. In the back of the pizzeria you have the choice to sit outside or in and they have an ice cream stand where you have a good amount of choices. But my most favorite other than the pizza is the Icy stand outside. It's a walk to window where you can purchase one on the go or you can just sit inside and enjoy your Italian icy!", "author": "Melina E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "A solid slice.  Best in the neighborhood by far.  Counter service is fast and on-point.  I've never had to wait for seating.    \n\nThe three star rating is because, somehow, when their pizza is delivered, it loses quite a lot -- very soggy, luke warm \u0026 rubbery. \n\nBut if you're out and about, it's a great, quick stop.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I LOVE THIS PLACE! You will see all sorts of customers-- high schoolers from the neighborhood, couples that are part of the most recent yuppie influx to downtown Bk, postal workers and plumbers, old timey Brooklyn residents with endangered accents, Trader Joe's crew on lunch breaks... everyone! That's because this place is simply perfection.\n\nThe cheese slice is top five in the city. Somehow they always heat it to juuuuuust the perfect temperature and seemingly instantaneously. There's a plastic container of fresh basil you'll find with the regular toppings (pepper flakes, garlic powder, grated parmesan) for you to add on top, and the guys don't give you an attitude if you need to ask them to pull the parmesan shaker out of the cooler. Line moves efficiently. Staff are courteous and fast. Booths/tables turn over pretty quickly.", "author": "E. W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-06", "description": "Just like Zack M. reported, I was treated very poorly when I asked for less than six garlic knots. I am a small person and just can not eat that many knots in addition to a slice or anything else- it's just way too much! Yet unlike Zack I was unable to bully the employee into giving me one, instead he bullied me, berating me that 6 was the least I could get. I was really upset- who needs that many garlic knots!? Also, how can you treat people so rudely? He literally started taunting me as I proceeded with my order, rolling his eyes, and saying \"ugh what else do you want\" when I was simply asking for what their drink options are (they're not displayed or listed) and requested marinara sauce on the side. I was pretty aghast at how horrible he was to me, acting as though I had literally wronged him somehow. It's really really a shame because I otherwise liked this place but now I'm actively avoiding it and even phrase it as a \"boycott\", which is really strong words for me considering I have worked in a really similar restaurant and am super polite and cut a lot of slack at places like this. But I never would have treated someone the way I was treated, there is simply no excuse.", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "Fast service, friendly crew that seem to be enjoying their jobs, awesome slices and great price. I'm now a fan and will work through the slice menu slowly over time.", "author": "James H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-02", "description": "I can't say I loved the pie here... it just was lacking. While the sauce was good, the crust wasn't my fave (lacking flavor and crunch) and the cheese was a tad rubbery and tasteless. Sad, since this was my only shot at NY pizza during my brief visit. \n\nThe counter service is efficient and they have a decent selection of pies to choose from, and these's an endless option of drinks. However, the space is a tad run-down and grimey. \n\nNot mi favorito, kids... although it's really cheap at under $5 for a drink and two slices,  and there's tons of seating room.", "author": "Hilary H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "I give this place a 10! Absolutely delicious, true New York Pizza! All of our family members love their pizza, specially my toddler.  The pizza is never soggy super tasty and fast.  There almost never is a long wait and you can always find a seat.  I'm a regular now with my son on Fridays; if i can't make it with him I'll always make sure he and his sitter can go.  We catered from this location for our son's birthday and everyone from the little kids to the adults enjoyed it very much!  The delivery was on time and the pizza was warm.  \n\nIf you're looking for a real slice of of New York pizza this is the place to go, not overdone or made to be more than what it should...just really good pizza in a real pizzeria!  Highly recommend it, specially for families!", "author": "Anna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Went here for lunch. got the sausage pie and it was really good! Don't go for the décor or service, which is typical for a pizzeria. Go for the Pizza.", "author": "Pam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Great neighborhood pizza place.  Just a good slice of classic New York pizza.  No fancy wood-burning ovens imported from Naples or anything (not that there is anything wrong with that), just a NY pizza oven and some mozz cheese.\n\nI wouldn't travel for this, but if you are walking down court street and want some really good classic NY pizza, eat here.", "author": "Maurice H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "One of the best pizzeria's around! Benny, the owner is there everyday till around 1pm and greets and smiles to everyone.  I used to go here for lunch all the time after Court.  They have awesome salads , you can add grilled chicken too.\n\nTheir dressing is homemade and doesnt taste like its from a bottle.  The regular and square slices are both awesome and they have this slice that looks like Margharita but has another name that is sooo awesome, any pizza you chose in this place you will love! I miss this place now that I live in Vegas.", "author": "Tammy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-02", "description": "The first time I went I tried the plain pizza, which was fine. The next time I went in I tried a slice of white and it was awful. It was very rubebry. I must have gone on an off day becuase everyone else seems to have great reviews. Or maybe I'm just picky with my white pizza... regardless of its proximity to my apartment, I will not be stopping by again.", "author": "Kelsey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Delicious pizza. Fresh pizza. That's all you need to know. It's sooooo yummy. Don't go during lunch time as it gets packed and there's no seating. Best if you just grab a slice and stroll down the street.", "author": "Joseph M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}