{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "My Little Pizzeria\nNY BK Downtown\n3pm Friday 19th August 2016\nFour Stars\n\nI needed something to eat and dollar pizza seems to always be the answer. It was not a dollar but $2.50 for a slice of cheese. It was quite good and there was a constant stream of people.  I got a slice straight out of the oven. The crust was thin, crispy, with a little chew. The sauce was fresh and sweet. The cheese was a bit light but melted with a slight golden color. Overall, still a good deal.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "My favorite pizza place in the area! Good pizza for the price, clean, fast service, and very friendly and attentive staff. The cheese is my favorite.", "author": "Krista G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Scout's Honor: MLP is the best. I ordered two round cheese pies ahead of time for a work party. \nOnly problem was the weather: that darn January '18 blizzard! Work was closed.\nBased on the weather forecast, I called them the day before and told them to push the delivery back to the next week. Not a problem.\nThey didn't lose my order. They didn't deliver to a closed building. They did it exactly as I requested.\nThe pies were excellent. Only problem: I should have ordered three pies. Everyone smelled the food, stampeded in and devoured every bit of it. I had to police the pies to be sure no one took more than two slices. It was that good!\nSo, their food is excellent. Their service is outstanding. And their delivery was right on time. \nThank you, MLP. (Next time I'll get the extra pie!)", "author": "Jim S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "Someone recommended this place for pizza. I no longer trust their opinions on pizza.\n\nThe main selling point of MLP is the huge courtyard, but some family was having (a probably unsanctioned) birthday party back there.\n\nI ordered a pepperoni and a \"surpreme\" slice. I don't know what dictionary these guys use, but \"surpreme\" doesn't mean \"more shitty\". I don't even know what they were trying to go for, but it tasted like it was a day old and it wasn't heated up to a good crisp. The pepperoni was fine, but boring.\n\nBut like they say, sex is like pizza. Even bad pizza is good.\n\nThat said, not coming back here.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-05", "description": "One of the worst pizzas I have ever had. Besides being 20 minutes beyond estimated delivery time the sauce had no taste and sausage had no resemblance to real Italian sauce. I expected a decent pizza in Brooklyn but was sadly disappointed. I would not recommend.", "author": "Bob F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-11", "description": "First time i came here. I fell in love with the calzone. It was really good. Now i have to be a disappointment. I ordered a pepperoni calzone at 715pm. At 740 i checked the status of it. I was told that it is almost ready. The NEXT second. One of the men just made my food. Now i am pissed because for two reasons. \n1. My food wasnt on time\n2. I was lied to. I was told 5 mins. Which is a lie. It takes 10-15 mins to make one. \n\nI will never come back because of number 2. You let me down. The food is good. When it is busy you will be lied to. So never again. Sorry i will make my own at home. Damn shame!!!!!", "author": "Giselle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "Awful customer service. The men don't even acknowledge you when you walk in. \nI called and placed an order at 12:10. He said it'll be ready by 12:30. I walked in at 12:40. Could you believe that they didn't even make my order!?!? They popped It in the oven when I got there.", "author": "Lola C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-08", "description": "Ordered a large mushroom, because that was the kids I was in charge of's favorite...it was so cheesy, most of it all slid over onto one side of the pie. Otherwise fine.", "author": "Annie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Excellent! $2.50 for a large cheese or marinara slice. Be sure to ask for it to be heated up, the sauce and cheese is best bubbly.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "This is probably one of the best pizzerias I've been to. I went on a Wednesday night and yelp says the place closes at 9pm, but it was still open at 10:30 pm. \n\nSo, we ordered a surprise pizza with mozzarella. This came with all the toppings listed on the menu (but we did not want anchovies and olives). So the pizza came with broccoli, pepperoni, sausage, and all the other good things. And instead of the regular pizza, it is the white pizza, which is all mozzarella. All of this was for $25. The pizza came out in around 10 minutes as well, which was surprisingly fast. \n\nThe pizza was very soft, easy to eat and easy to cut when necessary. It did not feel like a hassle to have chew every bite. Everything was so smooth. The toppings all came together nicely too. Nothing felt out of place. It all melded really well in one bite. And it was filling. \n\nThe service was also good. Even though we were the last customers and they were closing, they did not rush us and instead just let us finish while they continued to clean up. I find this a plus since I never like being rushed when we just got our order. \n\nOverall, I would come back again whenever I'm in the area or need a quick bite after a movie at the regals next door. I would try their other menu items as well. (:", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Whenever I decide to have a slice which is very rare, this is my favorite place to get that slice! I'm not a big fan of pizza, I lost the taste for it since I had my first daughter however I do have to say that the pizza here is delicious. A New York style slice with an iced cold lemon Snapple iced tea on a hot summer day, the best!!", "author": "Priscilla S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-23", "description": "Workman's pizza. Grabo slice and work your way to the back of the store. It's good fare. Slightly sweet, crust is light and crunchy. Just enough cheese not\nto make it too heavy. Across the street in front of TJ's you can get the $5 and change special, but the pizza quality varies. Stick with what works, if you know what I mean.", "author": "Ck M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "This place is the best I have found in downtown brooklyn / brooklyn heights. It seems most people agree as it has a steady stream of people. I've never seen this place slow. Nice thin crispy crust, good sauce, perfect amount of cheese, just greasy enough, what more could you ask for?", "author": "Steph W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "I love their pizza because it is not too thick and perfect for lunch. I will be honest, I have come here a few days in a row...and their slice is only $2.50 for a slice that is pretty much thin-crust. They are very friendly and the best part is that there is a ton of seating, including outdoor.", "author": "Tee J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "I went here yesterday and as always the pizza is delicious but the customer service was awful . The man that was taking orders was very rude and impatient . I ordered a chicken salad with a slice for my mom. The slice was ready and I asked him where was the chicken salad and he told me I didn't order the chicken salad . I was so pissed because he laughed and made smart remarks while blatantly telling me I was wrong . Anyways I got so pissed after but still enjoyed my pizza .  He needs to learn how to deal with people better .", "author": "Ayers A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Good Brooklyn slice of pizza. Same price as a subway fare. (That's how much a slice is supposed to cost, in case you're new to the area.)\n\nThey put fresh basil on the counter...that's a nice treat. The best slice in New York?--not quite, but definitely worth a stop.", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-17", "description": "Came here last night before going to see a movie at the theatre on the next block.  Chose to get the fresh mozzarella because it looked really good. Sadly, looks can be deceiving. The slice tasted like nothing, absolutely nothing besides a slight sweetness. It's at the bottom of the list as far as pizza goes. Had the same taste as eating a sheet of paper. Disappointing.", "author": "Ayesha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "Great pizza shop and what I like best is that always have Sicilian slices ready. There is a very nice seating area in the front , further in the back and outdoor garden area with trees to keep you cool in the summertime. At one time there were a few good choices for a good slice, Downtown Brooklyn.  Then they were gone and the choices were down to 99 cent slices, and one or two ok spots. To me, it's worth the hike to Court St. They lines are ling, but they move quickly. There is also a little Gelato area in the back. If you are in the area check them out, next time I am going gir Grandma slice! .", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-07", "description": "It took the workers a little while to take my order. Food was decent...establishment was pretty decent as well. I believe I saw a little gelato or coffee shop in the back, I didn't venture back there to see for sure. I ordered pizza and a grilled chicken salad which takes 10 minutes to prepare. I don't think I'll come back. Nothing stood out and made a impression on me to want it again.", "author": "Ashti D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "The pizza is excellent. Probably the best within walking distance of the Courthouse and Borough Hall. The cheese tastes fresh, and the sauce is perfectly sweet without being cloying. The service is respectful and friendly. There is plenty of seating, enough to accommodate the lunchtime rush.", "author": "Steven S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}