{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "If I had to bring only three foods with me on a desert island to consume for the rest of my life here is what I would bring:\n\n1. Pizza\n\n2. Popcorn\n\n3. Spinach (gotta have some vitamins \u0026 fiber, kids)\n\nBut until then, I've got lots of choices.\n\nAnd whenever I am walking the long way home from the subway and I'm hungry, this pizza parlor is there to sell me a hot slice.\n\nThey aren't my favorite--but they are not bad.  Pretty good, actually. \n\nAnd they still have the old-school grape drink dispensers too.  Extra points for this (see my review on Fascati's Pizza for the full experience)", "author": "M V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-17", "description": "The pizza itself is ok BUT the thing that makes it horrible is that the servers have no sense of hygiene and no knowledge of the health code. I will never eat there again after I saw several slices slide onto the floor and the dirty servers picked it up quickly and put it back on the tray. I saw and said to throw that away and he wouldn't. Not only are they the slowest servers in NY but rude and nasty as well!\n\nThey also never wash their hands throughout the day and it is filthy. With those filthy hands they love to touch peoples food. Downtown Brooklyn has much better pizzerias.", "author": "J N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Great place for a quick slice. Menu is cheap as well. Nice outdoor patio to take the kids and grab some ice cream as well after a few slices.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-22", "description": "I used to live across the street.  And I third the recommendation on the fresh slice or the fresh Sicilian square (if you are into that sort of thing).  The sauce is AMAZING!!  Absolute the best pizza for the money ($2.25/slice or square) \n\nOh, and there is a cute little patio with trees in the back!  Really a great place to grab a quick lunch!", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "Some of the best non-brick oven pizza in Brooklyn. A little greasy.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-07", "description": "Pizza joints in New York have a lot to live up to, and My Little Pizzeria is a pretty solid choice in Downtown Brooklyn.  I've only had their plain pizza and it's tasty, with a nice tangy sauce and good amount of cheese.  My only complaint is that the crust is a little wilted sometimes and I'd rather have a slice I can fold up and shove in my mouth without worrying that it's all going to spill onto my shirt.  Despite my misgivings, I keep eating their pizza because it's cheap and I live around the corner, and also because when it comes down to it, pizza is a good food.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "My third favorite pie joint in Brooklyn after Lucali's and Juliana's. I love the heavy tomato based supreme pizza topped with self-serve basils from the counter.", "author": "Takao S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-30", "description": "This is a surprising spot that actually has one of the better Sicilian squares in the area. It's no Lenny's on 5th Avenue, but it's got a great sauce and a good crunch with a soft center. The grandma slices are also solid. Voted least likely to taste good because of location alone, I have been schooled.\nGreat off the train.", "author": "carl g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "I had the most expensive pizza and the most cheapest pizza. I love pizza and am a pizza person. With out a doubt, the flavor and size of the slices and pies at my littles are wat better than the average slice. Wayyyyyyyyyyyy better. However if u are a hard crust person, than dont come. Because the slice are not crazy thick, but thick and the crust is softer than your average slice. I for one love everything about the slices to there services and ther mid century cash register:) 5 stars for the slices. Dont know about the other stuff though.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-15", "description": "I live across the street, and it's like a reliable friend.\n\nTry the pizza w/fresh mozzerela and tomato sauce.  It's a good slice.  I don't like their white pizza so much.  \n\nThey also sell some italian ices.  I've never tried them, so I can't speak to their quality.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-18", "description": "I've been living in the neighborhood for 5 years and eat pizza at least once a week. MLP is hands down the best.\n\nWhen my foreign friends come to visit, and they tell me they want to go to grimaldi's, I tell 'em \"f*** that we're going to MLP.\"\n\n5 stars and never a tourist in sight.", "author": "Scott H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "We had good plain slices and a white (\"bianca\") slice. It was a pretty hectic scene, but the line moved quickly.\n\nStrangely, their delivered pies are not so great. I've consistently had much better slices in person and then been really disappointed by what they deliver.  :(", "author": "Oliver H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-02", "description": "I ordered a white slice with mushrooms (im highly allergic to tomato sauce) he gives me a regular slice n starts putting mushrooms on it i told him no a white slice, he throws the mushrooms from tht pizza on my slice covered in sauce. I told him im highly allergic he said theres no sauce on it. I clearly picked up the mushroom n showed him. He refused to give me a new one n wouldnt give me my money back.", "author": "Mel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-27", "description": "When jonesing for a slice and wanted to stay local, I hit up My Little Pizzaria.\n\nThe plain slice was cheapest and the best.  \n\nThey have this ice cream bar in the back...never seen anyone actually get ice cream.", "author": "Diego S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-02", "description": "The pizza at My Little is reliable. I wouldn't say it's phenomenal, but definitely good. \n\nThey don't really have creative slices, but your standard sicilian, white, or margarita pizza, or even just a slice itself, is consistently crispy-crusted and tasty.", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "I would actually give this place 3.5 stars.  Why can't we give half stars?\n\nanyway, the pizza is not too bad at all.  i stop by there all the time to pick up a slice on the go.  as with most places, the pizza tastes much better when you eat it there, then when it's delivered.\n\ncons:\nthe employees.  i try not to complain too much about employees because i know these jobs can be tough, but they do not know how to run a counter at a nyc pizza place.  they're super slow with getting you change.  they're super slow with taking your order, giving you your order and telling you how much your order is.\n\nif you go in to most quick pizza joints, you give your order, scoot down, pay some dude, and wait 60 seconds for some pizza.  \n\nthey take their time like they're senior citizens in florida (no offense, but i want my pizza fast).  chop chop people.", "author": "cary s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "Nice outdoor seating. Quick. Cheap. \u0026 tasty", "author": "Shari Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "Great delivery. People were over at my place \u0026 we ordered from here. One of them said it was the best pizza she ever had, so there you are.\n\nI love them for delivery. They're fast, they get the order right, they estimate how long it's going to take and they're pretty close. One time they messed up the address, but they called \u0026 we figured it out, and they didn't have an attitude about it. You know some places would.\n\nI don't like them as much for slices. I'm not sure how that makes sense--it's the same pizza, right? Maybe it just doesn't age well under the heat lamps.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "I love this place. Sometimes I will get a traditional slice but the thicker crust Pizza is really where it's at. B cheese and tomatoes and spinach are so fresh and it is always hot when I get it delivered. We often go there to get a few slices because it is in such a convenient location and perfect to stop by on the way to the movies or the bookstore. My absolute favorite is definitely not the traditional thin New York slice but instead the thicker crust with fresh tomatoes and mozzarella.  I wish I was eating a slice now!  prices are beyond reasonable and they have a small place in the back for ice cream and coffee. I would not go there on a first date but definitely is a great place to stop after getting groceries or on the way home from work. I love their pizza!", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "Very good white slice and plain slice. The perfect example of Brooklyn pizza. A nice thin, crunchy crust with the perfect amount of cheese and sauce. Best on court street by far. Prices are as expected and there is adequate seating.", "author": "M R."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}