{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-16", "description": "Terrible treatment of the employees!!! So i have been coming here for three years now. Yesterday will be my last time ever going to My Little Pizzeria because of the terrible treatment of the employees that I witnessed. The lady that works behind the ice-cream counter towards the back of the pizzeria called one of the mexican men up to where she was. She then began belittling him in front of everyone yelling at him for not looking her in the eyes and telling him that he was going to get nowhere in life.Im not talking regular boss to employee yelling, I'm talking embarrassing and humiliating this man so bad that it was uncomfortable to be around.  I was so uncomfortable after just paying 12 dollars for the food that I didn't even want to finish my food because she was yelling at this man for a straight 15 minutes all because she knows she can. So disappointing to see someone belittling someone of lesser authority especially because I loved this place!", "author": "Olivia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "Thumbs up for their pizza, it's by far the best I've had in the neighborhood.", "author": "J. T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-10", "description": "Standard pizza.  Decent price.  They also have Diet Coke.  Worth stopping in if you are in the neighborhood, but I wouldn't take a subway journey for a slice", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-31", "description": "I can never tell if I really like this pizza or if I just like pizza so much that I scarf this down without even tasting it.   Either way, I go here pretty frequently.  Sucks that they're cash only.", "author": "Ryan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-07", "description": "Quite a play on My Little Pony ... well I will saddle up for a slice of this pizza any day. It has great average corner shop slices, extra syrupy fountain soda, and breath-deadening garlic knots. This quite spacious Pizzeria might get bumped up to a four because it's a good place to pick up a law student. If that's your plan, steer clear of the garlic knots. Trust.", "author": "Lindsay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "Great slice of pizza.  If you've had a pretty lame night at one of the bars on Atlantic Ave., Smith Street or Court Street, you could salvage it with a few slices (if you catch them before they close down for the night).", "author": "Pravin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-03", "description": "The go-to for slices in BK Heights.  And the garlic knots are bomb.", "author": "Gregory L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-01", "description": "My little is just the shit.  Best bang for your buck I've had in the entire city.  If I recall correctly 2.25 for a regular slice and 2.50 for something like the supreme (fresh mozzerella and basil)  Definitely the place to go for a quick slice in downtown Brooklyn.  Decent garlic knots too though they used to be a lot better.  The only bad thing is sometimes when you order for delivery the pizza gets not soggy, but the crust isn't as firm and crispy.", "author": "Rob K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "Good stuff, its looks deceive. Sicilian or regular, good crust, sauce, and cheese. Very busy place, but the line moves along well. I wouldnt travel for it, but its a good choice if your in the neighborhood.", "author": "Marc A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "Dang the pizza is good and they are quick. I'm Also really down with the free basil.", "author": "Grant C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-29", "description": "Keep it simple here and you'll be happy - the fresh mozzarella and tomato sauce pie is the best, in my opinion. Crust is a little thicker than I usually like, but still chewy, not doughy. Great lunch spot if you're stuck in downtown Brooklyn and prefer not to patronize the multitude of chain fast food places that crowd this neighborhood.", "author": "Christy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "I love the crispy crust and the sweet sauce. It's always a great treat to grab a slice at this place.", "author": "Greg V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "Good, solid pizza.  Perfect for a pre- or post-movie snack (or both in some cases!)", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "This is the pizza that I think about when I reminisce about living in Brooklyn.  They had amazingly quick delivery and the pizza was always hot when it arrived.  I thought maybe I was building this up a bit during my five year absence from Brooklyn.  Nope.  It's really that good.", "author": "Matthew V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "Great pizza for a great price. The dining area is pretty good size as it goes back into a back room. Cash only.", "author": "Johnny B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-26", "description": "I've been disappointed by MLP recently, their pies are still pretty delicious but their slices have been seriously undercooked recently. I hate to say it, but recently I have been preferring frozen Trader Joe pizza's to slices at MLP.", "author": "Jeffrey S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-23", "description": "The only pizza place in the area open at 11 on a Saturday. Pizza is not the best, but not bad. Definitely better than a chain.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "Best and cheapest slice in Brooklyn Heights/Cobble Hill. They also have an open roof area in the back which is nice if you're sitting in.", "author": "L G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "This really is a great pizza place. It's packed usually in the afternoon because that's when school gets out. It's great for kids and the restaurant is also great for groups. They have outdoor seating, an extension in back and tables in front. They constantly keep coming with new pies of every kind just about every 5 minutes, which is what makes My Little Pizzeria so great.", "author": "Johnnie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "I love their pizza! They deliver pretty quickly and it's always fresh, hot and super italian-thin.", "author": "Anastasia K."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}