{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-28", "description": "Delicious delivery!  I have been on somewhat of a quest to find good delivery pizza in this area.  Fascati's is always first, but they don't answer their phone lately.  \n\nMy Little Pizzeria is great New York pizza, plain and simple.", "author": "Catie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "Presently living in south Florida, I have not yet been to My Little Pizzeria (I believe opened on 8/15/85) but will rate it a 5 none-the-less for I am very familiar with the owner \u0026 his great pizza.  Benny Fontana owns My Little Pizzeria along with 2 other Original Pizza stores.  His brother Frank owns the remaining 2 Original Pizzas.  The 2 of them have been majority owners of Original Pizza since 1970 when they bought the 1st store, Original Pizza of Avenue L in Canarsie, from their brother Neo who founded the business back in 1969 but decided to relocate back to Italy a year later,  I have devoured approximately 20,000 slices of Original Pizza of Avenue L in my lifetime, the bulk between 1978-2000, \u0026 have friends who have been there as well as My Little Pizzeria the past few weeks.  My friends tell me My Little Pizzeria is great \u0026 when I am back in NYC I will have to try it \u0026 say hello to Benny.  His son Vinny runs the Avenue L store for him.  There is a great history at Original Pizza but the pizza is even better!  By the way, Anne M. says the rounds are a little better at My Little Pizzeria \u0026 the squares a notch above at Original Pizza of Avenue L but that they are all very good and would certainly return!  I will post some of the photos she took for My Little Pizzeria on 5/2/2012.  By the way, if Benny or Vinny reads this, you should renovate My Little Pizzeria a bit. It's been a long time \u0026 enough customers are mentioning it in the reviews here.  Would be worth the investment.  You got the product, now show off the place big time!", "author": "Can B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-01", "description": "Not great... but not bad.  Little too greasy for me. \n\nThis place has some special with my school... so needless to say, I eat a lot of free pizza from here.  So in that regard, can't get a better price for me.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "Reliably good. I appreciate that the pizza has a little heft at a time when it seems like so many places are getting thinner and cheaper with their pizza", "author": "Tomas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-01", "description": "Why pay for a fancy $5 slice at di fara when MLP is great? It's not in the top league of Grimaldis, Lombardis, etc. But for a local joint it's pretty damn good. $2.25 for a grandma slice with fresh mozzerella and they even have free fresh basil leaves. Soooo good. In summer outdoor garden seating!", "author": "C S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-23", "description": "Pizza was okay, nothing special or over the top about it.  I had 2 slices of plain and my gf had 1 plain and 1 white slice.  Neither were bad choices.  If you're looking for a quick, easy meal then it isn't bad.  If you truly want to satisfy your pizza craving I highly recommend grimaldis.", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-15", "description": "I came here to pick up some donated pizzas for the Say So sexual assault speak out event.  They were friendly and the pizza was delicious!  There was some butter to that cheeese which reminded me of Di Fara's pizza, but it was way better.  And the slices are huuge!  Plus, them being down to donate was a plus for me!", "author": "Lili K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "This place is probably my favorite pizza place in downtown. Especially bc Grimaldi's is just a tad to far for me just to get a slice of pizza. I was very surprised by these guys, but they rock.", "author": "Max F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-01", "description": "I had the Sicilian with fresh mozzarella. it was great. It was also lighter than most Sicilian and had a very good sauce. I think they had the regular pizza with the same sauce and cheese, but I didn't try it.\nMy wife had a plain slice and it was plain. \n\nThis place really surprised me. It looked like most NYC neighborhood pizza shops.", "author": "todd s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-04", "description": "Okay, so I can't believe it when people write this is the best pizza in Brooklyn Heights -- have they never been to Fascati's??!!!\n\nFascati's is the best.\nI haven't found a second-best.\nBut coming in third is My Little Pizzeria. \n\nNow, there are two ways to eat My Little Pizzeria: (1) by-the-slice in the restaurant, and (2) delivery. I find the by-the-slice in the restaurant just okay. It's cheap, it's quick, it's great if you're in a hurry to see a movie next door.\n\nBut delivery is a whole other -- and better -- story! The pie arrives quickly, and it's fresh and hot. It's like a whole new experience.\n\nI will say, as an Italian American, I find their sauce a bit sweet (Mama wouldn't approve). Their pizza is doughier than Fascati's or some of the thin-crust places, but I like my carbs, so that's okay. My Little Pizzeria is, to me, like junk-food pizza. Sweet, delicious, quick. Not the best ingredients like Fascati's, but really good (especially if you're drunk or hungoer)... and when Fascati's is closed in August, we order My Little Pizzeria!!\n\nNote on Layla Jones that someone mentioned in another review: we've never had a good experience with delivery from them. Though their toppings seem fresher, the pizza always arrives cold and the crust is turning cardboard-y. Maybe we live too far away to get the ideal Layla Jones experience.", "author": "Stacy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "This place is my first choice anytime I'm in the mood for pizza in the area. They have plenty of indoor and outdoor seating if you would consider it outdoor. I don't know if I'm just starving every time I come here but I always get a good pie or slice.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-22", "description": "White Pie = Bland \u0026 Oddly textured. They put the ricotta under the mozzarella, and I've just had way way way better. So it bums me out because I'm in Brooklyn. Brooklyn should have better pizza.", "author": "elizabeth a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "Best pizza in the neighborhood! Stopped by here after doing my Saturday shopping on Atlantic Ave. Very good pizza here, usually get the plain slices, those are the best. I wouldn't go so far and say best of Brooklyn, but you guys rate up there with the best!", "author": "Betty B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-24", "description": "Pretty decent cheese slice-- I do appreciate the outdoor seating in the back-- a rarity among mom and pop pizzerias! I've definitely had worse slices, but also better slices... though with its quick and friendly service, when you're already running late to the movies next door... my little pizzeria  hits the spot!", "author": "Christina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "This place has really good pizza. Their slices are hot, they have melty cheese and the pizza is CRISPY! I could eat a whole pie by myself but that would not be very lady like. This place is always packed but its worth the wait!", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "Excellent slice. Sauce a little less sweet, crust excellently thin and foldy", "author": "ezghan p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-23", "description": "this is the best pizza in the neighborhood and it's usually fresh out of the oven.  ask if they have any fresh slices.  If there is a pie in the oven they will let you know and it is worth the wait.", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "Try the fresh mozzarella pie (i.e. the \"Supreme\").  It is scrumptious.  Has a chewy crust, not too sweet, and very juicy.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "Get the Supreme pie--it's awesome. The regular slices/pies are pretty decent as well. Beats at least 80% of the pizza joints I've visited in NYC.", "author": "Todd P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "The pizza here is damn good. I would order two slices with at least 1 topping on each. My favorite topping from here has got to be the pepperoni. The workers arent stingy at all. Pretty generous. Even when I order a topping like sausage its all over the pizza. I would have to say this is the best pizza place in Brooklyn Heights. And one of the few pizza places that give New York pizza a good name.", "author": "Devon M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}