{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Delish! Walking distance from anywhere and some of the best thin crust in town! Are here with 10 people and we were all raving about it! True New York pizza! This place is a must!", "author": "April C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "Very average pizzeria. I'm sure my mistake was ordering the white pizza. The only reason I ordered the white pizza is because I was in a bit of a rush and didn't see anything else available. I'd definitely return to give another regular slice a try. \n\nThe real saving grace for this place was the coffee and ice cream/gelato in the back. I ordered an iced coffee which got my through the rest of my afternoon. The ice cream flavors looked absolutely scrumptious and worth trying.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "3.8 rating: If your lunch budget is under $10, or feel like splurging outside of your $1 pizza spot... you're in the right place! Two slices and seltzer water for the win! Original slice of pizza ... pretty awesome. Probably would have been perfect if I found the parmesean cheese. Nice balance between crust to sauce and cheese ratio. Wish I could say the same for the fresh Mozzarella slice. I'm saucy, so I'd prefer more sauce than cheese .... it's advertised as \"fresh Mozzarella\" so I guess that was on me. Either way, aim for the regular slice of pizza AND FOR GOODNESS SAKE ASK FOR THE PARM CHEESE TOPPING!", "author": "Reishma G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I now know why New York has the best pizza. Right in the heart of downtown Brooklyn I found myself tasting a little bit of heaven. \"My Little Pizzeria\" makes the best pizza. You will not be disappointed.", "author": "Christel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "First class.  Good pizza, outdoor area in the back, a dish of basil leaves to put on the pizza.  Excellent.", "author": "Carl F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-09", "description": "I have used this pizzeria for 12+ years. Ordered, in person, with my kids, etc. I have noticed a change for a while now. Very snotty delivery guys. One said \"generous\" in a sarcastic tone after a $4 tip on a $20 purchase. That was the last straw.\nSorry but it's House of Pizza at my home from now on. They are a little more money but they appreciate their customers.", "author": "Russell C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "Good pizza just the way I like it: Very thin crust, good sauce, not too cheesy. Our go to pizzeria for a quick bite in Brooklyn on Court St.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-16", "description": "A no frills pizzeria with a delicious plain slice for about two bucks?!  No wonder this place has been rockin' on Court St. since 1985.\n\nWe stumbled in after our Thursday volleyball game down the road at pier 6.  Appropriately, \"Throwback Thursday\" comes into mind when stepping in here.  They've got the old school menus and those orange drink / fruit punch machines, and the only pies on display are plain and a fresh mozzarella variant.  That's right: no BBQ chicken, no taco pizza, no ziti slice...no BS.  Only plain slices for $2.25 + .50 per topping...brilliant!\n\nCrust was soft and foldable, sauce had a touch of sweet, and that oh-so-gooey cheese was aplenty.  If you're anti-grease, you might wanna give these slices a little pat down before devouring though!\n\nThere's plenty of seating inside, but venture towards the back for additional indoor and outdoor seating, as well as an ice cream/gelato stand selling desserts.. also starting at just two bucks!\n\n#winning", "author": "Ryan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-18", "description": "They are a 3.5 but because of today's visit, I decided to round down. I have been coming here for years and I always thought their pizza and garlic knots were excellent. However, I did have a few issues, such as, the employees often engage in personal conversation and may take a but to get to you, the pizza is often scolding hot and burns your mouth. Lastly, they have a $14 minimum for cards..which I believe is a bit fight for a pizza shop. \n\nAnyhow, I came into for a slice and the line was pretty long and we were all clustered like sardines, I'm next and the guy skips me and goes to the next guy. I clearly had been waiting patiently in line, I'm a rather tall guy, point being, I'm hard not to notice. I finally get my pizza and notice they are seemingly under a cost cutting initiative. As I proceded to eat my slice, I notice it's much thinner, doesn't have much cheese and I'm left a bit confused and flustered. \n\nHopefully some loyal customers complain and things go back to the way they used to be!", "author": "Jason R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-22", "description": "The pizza was mediocre. The customer service was terrible. This one guy gave me so much attitude. He left me confused trying to figure out why he was so upset. As far as the pizza goes. It was blah... I would prefer to walk up the street to \"Caruso's\"! Not only are they always smiling but the pizza is if not THE BEST PIZZA I'VE EVER HAD!!!!", "author": "C C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "Terrible night time customer service. The night crew only get over because the boss never checks out whats happening. During the daytime the place is great. Had a recent not so good experience with their night time service. If you're eating there before closing they yell out at the customers \" were closing in 15 minutes \" when there is 2 hours left before they close. The night is gonna destroy this places reputation. Ran like a beauty in the 90's, a lot has changed.", "author": "Sean D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "My company and I have ordered pizza from My Little Pizzeria many times. However, I've never experienced excellent pizza until a recent pizza lunch we had at the office.\n\nThe good thing about My Little Pizzeria is unlike the other pizzerias in the neighborhood, this one opens at 10AM. So, if you need an order by 12PM-12:30PM, My Little Pizzeria can get it done! However, they don't have an assortment of pizzas. \n\nThe last time I ordered pizza for my company, they came right on time and pizza smelled and looked insanely good! One of the pizzas I ordered was the Supreme Pizza which is made with fresh homemade mozzarella, fresh tomato, basil, and Romano cheese. The delivery men brought two bags of fresh basil and when I opened it in up, it felt like I opened a door to absolute bliss because the basil smelled insanely good and soothing. I fell in love. I wanted to take all of the basil, but of course I couldn't. \n\nI really enjoyed the Supreme pizza because of the touch of fresh basil. It added a nice texture and freshness to it. No other pizzerias I know would give you fresh basil with your pizza. I am definitely returning to My Little Pizzeria for the Supreme Pizza. It's really one of the best slice of pizza I've had!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Stopped by around 9pm and the pizza was so cheap! 1 slice costed only $3! I ordered Mozzarella with olives and regular with broccoli, and they were so yummy! \nDefinitely a perfect place to enjoy NY pizza!", "author": "Ayumi K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "Good slices! I ordered a custom pizza with chicken, garlic, spinach and mushroom and it tasted really good. Nice service and the food was made promptly. I'd come here again for a good cheap slice!", "author": "Akhila R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-23", "description": "Lapin and I came here while waiting for our movie to start. The slices are on par to every other pizzerias. The staff is friendly and relatively quick.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "Fast service and good pizza   :)", "author": "Joey M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-20", "description": "Staff uses extremely foul language in Spanish all the time and there's lots of children around. Some of them also speak Spanish. Disgusting! And they tried twice to sell my daughter slices that were half the size for the same price. Also disgusting.", "author": "J C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-14", "description": "Checked the reviews on this location and it seemed like and Ok place to catch a bite. I ordered Three pepperoni Slices for me and my mother to share. One thing to be acknowledged it they only take cash. If you try to use and debit or credit card the limit has to be above $14. Once i received the pizza i sat down with my mother i went to take a bite of the slice and all the cheese and pepperoni fell complete off the crust.. which is fine cause i have no problems eating with a fork and knife. I would give it an average rate, the pizza was ok i've had better. the back of the store lay out is pretty nice, did really get to take much of a peak.", "author": "Amor V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-16", "description": "Affordable and convenient, but very average to sub-par pizza. If you're a lover of deep dish and just begging to fall in love NY-style pizza, this is not the place to expect such an epiphany! That said, if you're one of those local students who is looking for a convenient bite in the late hours of a Friday night (following some drinking of course), My Little Pizzeria will hit the spot. I have to note that the service here has always been solid.", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "Warm weather turns my thoughts to Brooklyn Pizza and of course Brooklyn. Finding this spot on Yelp, I was pleasantly surprised. An old school joint with the typical pizza booths- love it. \n\nThe pizza is crisp, nicely balanced a good all around slice. The great part is you can add fresh basil slices to your pizza adding a fresh basil flavor. The slice was $2.25!", "author": "Franny A."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}