{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-10", "description": "If you live in Brooklyn Heights or work in at the courts of Downtown Brooklyn and your friends come to visit and ask you where to get an authentic Brooklyn slice, I would go here. It's NOT that pretentious A.O.C s*it like Lucali's or Grimaldi's, just totally normal working man's fare, but executed perfectly.  I eat here pretty much twice a week and would eat here more often if I didn't fear becoming grotesquely obese. The \"special\" aka fresh mozzarella with basil slices are great, but my favorite thing there is a regular slice with fresh basil (they provide that as a free condiment, can you believe that??).  I could easily eat an entire pie by myself but I generally stop myself at two slices.  It's open till midnight most nights so it's great after you see a movie.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-17", "description": "amazing pizza.  some of the best ive had in nyc.  wow.  you have to try.  would travel to.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "I'm surprised to see the mixed reviews here.  Growing up in the neighborhood, I can say that this is the best pizza in the area.  The place now has a lot of seating and an outdoor space.  It's not very attractive, but I don't really care about the decor.  If you care about the decor while eating a slice of New York pizza, something is wrong with you.", "author": "Candice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "Great Pizza!  Visiting New York and stumbled across this place and the Pizza is probably the best I have ever had.  If traveling through Brooklyn it would be a great idea to stop at this place", "author": "Carl B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-02", "description": "Ahhh the combination of cheese, pizza sauce, basil and dough...Sicilian squares are the bomb here! They were so delicious, I had to have not one but two. I wasn't crazy about the garlic bread knots (I guess that's what they're called, they look like knots either way) which a lot of people seemed to order. This place looks nothing special from outside, or inside for that matter. You stay in the line to order then pick up your own order, so don't go here thinking you'll be served as if in a restaurant.", "author": "Ebru Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "Wow. I was amazed by this pizza. I had just moved into the neighborhood, and thought I'd give a few pizza places a shot. Delivery was fast, and the pizza was great. The sauce was nice and sweet, and the bread was super fresh. A little greasy for my taste, but I guess that's a given with any BK slice. Nothing a napkin can't handle. Thumbs up.", "author": "Evan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "Great pizza pies.  We often order this at work for the guys.  Pies are about $14 for a large no topping.  This is my neighborhood pizza place!", "author": "Sean G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "Awesome pizza, great service.  My only complaint is that they sometimes reheat pizza that's been sitting there for a bit.  Still, even reheated, usually very tasty pizza.", "author": "H L."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}