{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "The only neighborhood place willing to let a big group of preschoolers come in the morning for a make-your-own-pizza party. Friendly staff and management and great pizza.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "All quality slices. Sicilians are usually just thick enough, but the real stars are the slices; the white and the fresh mozzarella.\n\nNice little outdoor space/cafe in the back as well.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "When you're not in the mood for the fancy and gourmet pizza in the area (think Table 87, Brado), give this place a shot over all the others. It's worth it. It's cheap. It's unhealthy. It's greasy. It's tasty. It's New York pizza! There are several other pizzerias in the area but none of them compete to this one. Just don't order late at night before closing. You might not get the freshest slice.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "I don't know why, but this is one of my most favorite pizza places in the city (my favorite being Lombardi's of course). I live in Georgetown now and all of the pizza up there seems soggy and bland. At My Little, when you get a slice they serve it piping hot, and the crust is always crispy. The sausage is awesome (they use slices of real italian sausage), and all of their toppings are FRESH. Nothing like getting some canned mushrooms on an Upper-East-Side slice to make you long for the big slices of fresh mushrooms you get at My Little. The prices are also very cheap, and they pile the toppings high. This place is a true New York pizzeria!", "author": "Wilkie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Love this place. Great neighborhood pizza joint to get a hot, perfect NYC slice. Sometimes they even have fresh basil to put on your slice. Service is fast and no-nonsense.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "This is a great place.  To food is good and these guys are very fast.  These guys put out a lot of food fast and are good at it.  I have never been disappointed.  They have a great courtyard in the back with tables that just adds to the experience.", "author": "Tim B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "Pizza is good. Staff are terrible. Rude. Total mess in there waited 5 min to order a slice and there was 2 other people In front of me. Main guy taking orders is a jerk. I know it's NYC but c'mon be at least mildly pleasant. And they gave me a tiny slice.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "This is my neighborhood go-to pizza place.  \nThe slices are awesome, and there's gelato in the back.  \n\nI see kids and families laughing and smiling all the time and the turnover is great.  Service is wonderful, and efficient.  I really like the little touch of having fresh basil at the counter to put onto the pizza and it is pretty darn good pizza.\n\nI might prefer it over Gramaldi's and that's not even factoring in the 15 minute walk out there.  Locals love it.  I wish I knew about it sooner...\n\nIt's 5 stars because it's so consistent and you know what you're getting.", "author": "Simon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "Pizza is here good the salad on the other hand could use more work on it. A little on the dry side but pizza hit the spot. Many many choices with a big sitting area which is great", "author": "Desiree Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "We can't all stand in line for Grimaldi's hour after hour and put up with their attitude, service and prices for an incrementally better pizza. We have a family! It doesn't center around waiting for a table and sitting in restaurants! We have a life to get to!!\n\nThis is our pizza joint...the one we go to after our various sports, our practices, music recitals, before the movies, after the movies, lunches, late night snacks, meet up with other kids....you get the picture.  We love this place.  Friendly, super accommodating, fast lines, good basic pizza.  Not fancy....just yummy and tasty ---just solid!", "author": "Abc M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "This is not a bad spot just to chill before going to the movie theater.  The chicken roll ($4) isn't bad, but I wished it was a little bit cheesier.\n\nThere were a lot of kids in groups in the back area seating and I noticed their pie was nice and hot, super cheesy I wanted to swipe one!  It must also be nice in the Spring as they have a nice back garden area with additional seating.\n\nIt's also got a cute dessert area.", "author": "Albert W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "I came in here on my lunch break from jury duty. I can tell they're popular because as soon as I got my slice of pizza, and cherry coke the place got super pack. \n\nThe pizza was good though, next time I'll try the fresh mozzarella slice.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-29", "description": "Based on the reviews I expected to get a great slice of pizza and possibly poor service, instead I got some pretty bland and tasteless pizza. Worse it tasted like canned tomato paste sauce. There was no basil on the supreme slice and the white slice had no garlic. As I said, bland and tasteless. \n\nAlso, the service was pretty poor. Apparently since I ordered three different slices instead of just plain it's more work than the guys behind the counter want to do. The guy practically rolled his eyes when I gave the order. \n\nTo be fair I will add that I visited during the Atlantic Antic, and possibly everyone was burned out. If that was the case they should have known and hired more staff for the day.", "author": "Seth K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-19", "description": "Ordered pizza for delivery, the pizza was not fully cooked and the delivery man was very rude", "author": "Adriana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "Great pizza if you're looking for basic pizza. We were craving it night and this hit the spot! Basic half cheese half pepperoni. Definitely a go to place after a long day or don't feel like cooking and want some food delivered to your door. \n\nAlso, note that there is one size and it's only $20-- BONUS!", "author": "Amanda V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Delicious Pizza, my family and I order from here often. My Little Pizzeria is a popular recommendation of all the locals that have lived here for a long time.", "author": "Eric P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-16", "description": "The service sucks,long wait just for grilled chicken salad.I had to ask for dressing and the portion size dressing barely can you taste it on the salad.Never again smh", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "A classic New York slice. Best in the neighborhood and it's not even close.\n\nAnd for those who like it, they have fountain Cherry Coke. \nYes, that is important.", "author": "Michael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "You've got to love their pizza. It is superb. I can hardly begin to describe the wonder as you put it into your mouth, hot, oily, cheesy and perfect. Best pizza in Brooklyn.", "author": "Logan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Been going to My Little for almost 10 years now when I'm in Brooklyn Heights. My favorite slice is the fresh mozzarella, but you can't go wrong here. The pizza crusts are always crispy too. When the weather is nice, enjoy your slice in the outdoor garden in the back.\n\nYou definitely get more bang for the buck here.", "author": "Aneil B."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}