{"aggregateRating": {"reviewCount": 248, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "The best pizza in Brooklyn. I've been coming here since I was in high school. Love it!", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "Solid NY pizza. I can't say it's the best in NYC but far from mediocre. Good crust -- thick but not too thick and tasty. Sauce and cheese are good. Lots of options for toppings. Unpretentious. Well worth trying.", "author": "Gary D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "I really love this pizza, lately the place isn't as clean, \u0026 when I asked if someone could clean one of the booths I was directed to seating in the back.\nMost of the guys that work here are hard working \u0026 polite. A few are LOUD \u0026 need reminding that they're NOT at home", "author": "Judene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "I love their pizza!  It has the best marinara sauce on it.  I love the sweetness of the tomato in their red sauce.  The cheese is pretty awesome, too.  If you order a Sicilian($2.50), there are two options, fresh basil and marinara sauce or freshly sliced tomatoes and cheese.  There are sausage rolls and other veggie rolls in the back behind a glass window.  \n\nThey also have sodas and other beverages available. In the past, I got garlic knots which were served hot, not soggy at all, and just salty enough with fresh garlic and parsley on it.  Man was it good.  There is ample seating about 8 to 10 tables and it is pretty clean inside.  I like the fact that the line moves fast and they serve the pizza hot out of the oven.  It makes me feel happy when it's crisp and delicious--the pizza, that is.  \n\nOne thing that I would suggest is handing out receipts, because I paid one person but then got my pizza from someone else, so how do you keep track of who has already paid?  Other than that, I really like this place.  I think it ranks higher than DiFara \u0026 Grimaldi's in my book.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "We've been coming here for twenty years and love this place. The gelato is good too. The fresh mozzarella slices are my favorite. Also the grilled chicken salad which they make fresh for you. Very kid friendly. It was out go to place when or twelve year old was a toddler.", "author": "Melissa I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "I've been coming to My Little Pizzeria since I was old enough to chew. \n\nAnd this, my friends, is pretty solid New York pizza. It's cheesy, greasy, evenly saucy and crunchy in all the right places.\n\nOnly thing is, it's nearly indistinguishable from every other decent NY pizza shop. \n\nIn sum, it's exactly what you want and expect from your pizza -- no more, no less. And after a long day, there's simply nothing better than 2 slices of cheese pizza and a Diet Coke to wash it all down.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "I've been coming here since I was a pre-teen. I enjoy their no frills cheese slice. I order mine \"extra crispy\" because that's the way I like it. I noticed last night they made fresh basil available as a condiment. I thought that was a very classy touch. Either I never noticed it before, or it's a relatively new thing they're offering. Either way, ALL pizzerias should offer fresh basil. \n\nA nice cheese slice for $2.50 - you can't really go wrong.\n\nPlenty of seating, too. Just wish they offered orange soda in the can.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-03", "description": "Not worth it. \nThe menu is barely readable.\nI was on a long line for getting a slice of bland pizza with the toppings of spinach and peppers. \nAfter I ordered, they didn't tell me the price and didn't tell me that I had to wait another 10 minutes. \nThe pizza was so tasteless, plus for $3.50, I think I can buy the same slice of pizza in midtown for better taste.", "author": "Ilene E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "Great pizza. Delicous and great prices. White slice is one of the best out there. Great spot to go to after watching a movie at the Court Street UA.", "author": "Billy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-10", "description": "The sign on the door says MasterCard visa and American Express I ordered and handed the guy my debit card he said no cash I said I don't have cash so he took the pizza off the counter and I left. Terrible experience", "author": "Caitriona J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "It's a pizza joint where you can order by the slice or by the pie.  No frills and hits the spot. When I used to live in the neighborhood I'd have a slice or two as a meal probably 2 or three times a week. It's decently priced and the service is fast and good.  Sprinkle the Sicilian with a bit of crushed pepper and top it off with some fresh basil and you're good to go. \n\nThey also have a little ice cream parlor at the back that serves gelato as well.  Not my favorite, but then again I prefer the Italian ice they serve up front.", "author": "April Joy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-07", "description": "This is a pretty decent pizzeria in a neighborhood saturated with them. I came here around 9 PM last night for a slice of mozzarella and a coke. Although initially not overwhelmed, the pizza grew on me and when I was ready to leave I walked away satisfied. It's very spacious, albeit somewhat flyblown. I appreciate the fact that they have a restroom-which isn't a given-but it could have used a fully functioning toilet. Also, paying 4 bucks for an Italian ice seems a tad excessive.", "author": "Gerard P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-18", "description": "A decent place for a slice. The crust is a little thinner than I'd like and the slices are on the small aide. But they have fresh basil out along with the red pepper etc so they get a star back.", "author": "Roopa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "My favorite Pizza place in Brooklyn. The Garlic knots and calzones are always good as well. 14 dollar min. to use a card... That's not cool. But honestly their pizza is pretty consistent. I just wish they had zeppoles (DO PIZZERIA'S EVEN MAKE THESE ANYMORE??????), pizza rolls, potato croquettes, etc.", "author": "Moses G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-12", "description": "Burnt pizza pie served. Complained and had to wait another 10min for a new unapologetic pie.", "author": "Josephine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "One of the best pizza spots in Brooklyn. Delivery is usually very prompt and the pizza has the right amount of sauce and cheese. This pizza does its job and has affordable prices. \nIt has plenty of places to sit and the back patio is pleasant.\nOverall, a solid spot.", "author": "Patrick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "I love thin crust pizza!  I do not like thick \u0026 gooey pizza! I do not like over cooked pizza or crunchy pizza!  I've had pizza almost everywhere!  Frank's, Joe's, Brooklyn, Queens, Manhatten, brick oven, Patsy's, Grimaldi's, Portofino's!  MY LITTLE PIZZERIA IS THE BEST PIZZA I'VE EVER HAD!!! They're like Pringles potato chips, you just can't have 1!!!  \n\nI don't work here \u0026 I'm not a friend of the owner! I just LOVE thin crust pizza! Made with real mozzarella cheese \u0026 their sauce has a tremendous amount of flavor! Not like some pizza where they use fake cheese \u0026 plain tomato sauce!  If you doubt me stop by some time! I guarantee you'll love it!\n\nThe place is surprisingly big, inside \u0026 outside seating. They also serve ice cream in the back. The bathroom is useable! I recently tried the squares, ( Sicilian ), delicious! I'm a plain pizza no topping kind of guy!!! Private space available for special events party's etc.", "author": "Jesus M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "I haven't written a review yet ??? Wow this is my favorite pizza spot in Brooklyn . Period. I actually have traveled to many countries and this is still my favorite pizza. The crust is the right size , not too much dough, the tomatoes are fresh you can taste it isn't canned! The cheese is perfect! They season their sauce .... I'm actually just getting hungry now. Go get a slice!", "author": "Marie Annick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "That fresh mozzarella and tomato slice is bangin'!! The fresh basil offered at the counter is a nice touch.", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "OMG these reviews are hilarious.  Of course the service is rude.  Of course the cups are cheap.  There is ZERO ambiance.  It's a NYC pizzeria, not a restaurant!\n\nGet the Supreme fresh mozzarella pizza, and get it in the store.  Eat immediately. To die for.  The rest of it is perfectly fine pizza, but nothing to swoon over.  You're welcome.", "author": "CK J."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "My Little Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "114 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dGb936q2j6M0Fy08R3BhkQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186436120"}