{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-21", "description": "The place is beautiful but not functional.  The service was not hospitable.  I went there for lunch to get a meal to go.  They haven't figured out where to put the people waiting for their food mainly because they have a large showcase for various goods in the middle of the room.  I was standing by the service station because there was no where else to stand and was told to sit.  I was approached by several staff members reminding me that the tables were for customers who wanted table service.  By the third time I just got angry.  I waited way too long for a sandwich and a coffee.  They dont even have a system for the barista to know who orders what.  After I got my sandwich I had to ask for my coffee and she had no clue what my order was.  While I was standing there other, more patient, customers were waiting for their orders as well.  The food was ok but not worth the 10 minute wait.", "author": "Noam P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-26", "description": "So I went back to see if my first negative review was right..nothing has changed. Big problem overpriced...A omelet with coffee (Luke warm) came out to $16.00 and change before tip..Now I can't speak for everyone's budget but mine is limited...Bottom line the food, while looks well prepared, is not fresh enough...This is not to reflect on the waiters who are very nice people..It's not their fault.. Recommended for tourists...maybe an organic piece of cake on payday..", "author": "Jerry V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "I realy like this place. It depends on what you order as to how expensive it will be. I ordered the granola and banana and it was filling and good. So good, I bought some to bring back to GA with me. The steel-cut oatmeal is very good also. I have no complaints and will be back when in Brooklyn heights. Server with thick beard is very nice and helpful!!", "author": "Teri S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "This is the second time I have eaten here and I think it is just OK and over priced. Today we had the hummus that was ok but we had to ask for more bread to go with it. I had the six vegetable quiche and it was not worth the $13 it cost. My partner had the Lorraine quiche and said it was good but I did not think it was worth the price.", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Love this place! went here for lunch with my daughters and the food was so good...simple, organic and delicious.  Our server \" Tanania\" (not sure if I got her name right) was very nice  and attentive.   The manager, I think her name was Evelin, even came over to introduce herself and see how we were doing which was really nice.  She even suggested this yummie lemon, ginger, honey tea that I am now addicted too.  I would definitely go back there!", "author": "Evangelista G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Love this place. Everything is clean as in organic and so tasty. The problem is deciding what to eat. The bread is divine   This is an international chain from Belgium. It will make you feel like you are eating in a Brussels cafe. Worth pursuing wherever you travel.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-22", "description": "I love Pain Quotidien, but the waiting staff here is slow, loud and rude. The manager is worse though. She started various arguments with people who were asking why they had to wait for more than 45 mins (including a family with a baby and a 4 year old). I would have fired her on the spot.", "author": "Flying D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-29", "description": "Well I think I must accept that the food here is good but the service is always terrible.  I've been to the one in Central Park before this and had a simillar experience.   This time, it was low time on a Saturday afternoon.  Took 10 minutes to get a waiter.  I got my food before my coffee and before any silverware.  But the tuna tartine was fantastic.   Yes, definitely pricey but I would come back.", "author": "Kristin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "I really don't like Le Pain... there are way too many of them, and it's just not right that they're a chain. And still. I am almost always at Le Pain at least once a month... Can I help it that I work around the corner from one? And now there's one right around the corner from M's work? I really do love their Vegan Bean Tartine... and love their Baguette... so yum. Sigh. Just change your name and pretend to be local... (without writing \"organic\" in front of absolutely everything on the menu would be nice too)... but otherwise.. I think you'll do just fine!", "author": "Sasha N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "Finally something decent with an excellent and consistent food product opens in this neighborhood. It is unbelievable how long it took for a restaurant to open is this area that isn't a diner or cafe serving an aging population that is the life-line for these older establishments that have warped view of food quality and service.", "author": "E. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-29", "description": "I love it here! The staff was SUPER friendly and the atmosphere was relaxing and just casual enough.  I felt so comfortable there by myself and with my family of three.  Even with a stroller.  The pastries and food are very fresh.  If you are staying near Montague Street be sure to stop in!", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-07", "description": "I really like Le Pain Quotidien but this branch in Brooklyn Heights is atrocious.  I would say the service is bad but it goes far beyond that. After waiting 15 minutes after being seated for a coffee, I was given a little pot of coffee and milk but nothing to pour the coffee into. 5 minutes later I asked someone for a cup and poured out cold coffee.  Ten minutes later no one had taken my order. I looked around and saw that no one in this crowded place had food in front of them.  I asked a passing waiter for my check which I was given in the amount of $4.50 for the cold coffee.  I just wanted to get out of there and went to the counter to pay but was told in a very nasty way \"I won't take your money\" and that I had to pay my server  who was nowhere to be found.  I again had to get another person to take my money so I could leave.", "author": "Gia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-24", "description": "Carrot cake! Delicious. But, what's even better their service and honesty. I left a pair of Dior sunglasses on my table(outside) in the morning and completely forgot about them....when I was leaving work at 7 pm I went to grab them from my purse and of course, not there! Immediately, I had the \"Holy f**k $400 involuntary charity donation, they're goners!\" run down in my head..but I walked over, asked,  and a very kind server said \"As a matter of fact I just started my shift and walked into the office and saw them sitting on the desk, I will get them for you\" Score. Amazing carrot cake and a Dior save, can't beat that bakery experience.", "author": "Sasha P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-27", "description": "The patries and omeletes are good.  I like the fact that there's outdoor seating.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-02", "description": "Eaten here at least 3 times. While the food is ok to good, the portions are small and expensive.  Wait staff is hit or miss. Not a great place unless you don't want to be full after. Great for soccer moms, old ladies and Apple users. Not me, big man's gotta eat.", "author": "Ty W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-04", "description": "Service is severely lacking.  Arrogant and neglectful.  Not as good as their other locations.", "author": "Yahoo S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-16", "description": "We've been here seven or eight times in as many months and the quality has really gone downhill. First it was the service and now it has started to affect the food. Because the problem is almost all the servers, not one individual server, and because it all started off pretty good, I'm thinking the problem lies in the management. At first the food was the usual Le Pain Quotidien quality but recently we were served a hot chocolate with spoiled -- seriously rotten-smelling -- liquid chocolate. That suggests serious problems with their food safety and handling. How bad does it have to be for chocolate to go bad and them to miss it? On top of that, they didn't remove the hot chocolate from the  bill. On a different trip I heard a male manager (or other non-waiter) complaining loudly and unprofessionally about how \"stupid\" and \"ridiculous\" some ordering problem was. Not appropriate in the front of the house.", "author": "Amelia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-15", "description": "The bread is excellent (that's one star) but the rest of the food is average. The service is TERRIBLE. Moody waitresses, not paying attention. And on top of it, one of them stole my scarf. I alerted the management who found the person responsible but doesn't seem to care at all. They told me the employee was working only a day per week there and that my scarf would be send back to me by mail. It's been two weeks. I am still waiting. I dont see the relation between working one day a week and not sending me back my scarf as soon as possible.Can you believe it?", "author": "Domitille F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "Our food took a little long but our waiter, I believe his name was Yasser?, assured us it was coming out soon and apologized. Portions are a tad small, but otherwise good.", "author": "Elliot M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-29", "description": "Six dollars for iced coffee, a chocolate croissant, and some weird attitude from the cashier. No thanks. The coffee was fine. The croissant was not good. The attitude was expensive. No. I will not return.", "author": "C S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Le Pain Quotidien", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Eu7F8tUmJesLkaP2lH2zCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188583078"}