{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-11", "description": "This place usually serves really great food but the service is always slow, inexperienced and not welcoming. It takes forever to get menus and water. Also, one time a waiter hit my husband in the head with the plate while serving food. And soft-boiled eggs sometimes just come hard;) We still come here but we are always surprised at the service. I didn't see this kind of service at other Pain Quotidien locations.", "author": "Magda K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "Had an awful experience here this morning. First, when asking where we should sit, the response was a rude, annoyed sounding \"anywhere clean.\" Then, after ordering our food, we waited 25 minutes and didn't even get our coffee. We walked out in disgust. No one noticed.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-02", "description": "I love the food here, and today's food did not disappoint-- a Salmon Breakfast, which is a few slices of lox and a soft boiled egg, some sliced lox, slices of sourdough, and some creamy ricotta cheese, with capers and a lemon wedge. How long would this take to prepare, given that the restaurant was nearly empty? And why would the waiters all vanish while I was waiting for my check? What should have been a pleasant hiatus took on a stressful feeling because of the poor service. Not the first time I have experienced vanishing waitstaff at this location. Disappointing.", "author": "Pat C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-04", "description": "One of the worst LPQs I've ever been to... The service is simply terrible: unfriendly waiters who look dirty and disheveled. The food was subpar compared to other locations; had to send back a pasty for being stale, even though this chain has made their name on their baked goods. Plates arrived at the table dirty and nobody seemed to care about overall cleanliness. For the prices, I expect quality and service better than your cheap-ass fast food joint. If any LPQ brand people are reading these reviews, they need to spend some time overhauling this location. Simply embarrassing.", "author": "Stephan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-15", "description": "On the one hand, this place is pleasantly decorated, with a homey feel and wooden tables.  Its menu has a bunch of tasty sounding options that are all relatively healthy, which is nice.  I got the Quinoa Tabouleh salad and was pleasantly surprised at the large quantity, and the accompanying slices of avocado and cantaloupe, all served on top of a bed of well-dressed arugula.   \n\nOn the other hand, our Skrillex-haired waitress alternated between ignoring us and seeming annoyed by us.  Sorry you work here?  Is that my fault somehow?", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "I've been to bunch of LPQs (I live two blocks from the UES one) and this is definitely my favorite! I started coming here back in March because it's near my job (some staff has since changed, but they're all sweet) and I fell in love.The staff is fantastic and Lily the GM is a doll!!! The staff is a colorful (personality speaking) bunch of young people with different talents, interests, and never any lack of conversation! The food is always fresh (and organic) and the wait staff always has my large latte ready within 2-3 minutes of my arriving. They accommodate and treat every customer with the utmost respect and do so with a smile on their faces. They definitely make my morning better! I definitely recommend that this LPQ becomes apart of your life!", "author": "Taylor W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Excellent pastries. Very courteous and prompt service. The decor is very quaint and comfortable as well. I ordered an espresso drink and a chocolate croissant. The croissant was very fresh and the coffee was delicious.", "author": "Kevin-louis B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "Met a professional acquaintance in the spring sometime.\nWas sitting on the outdoor chairs and tried their ginseng drink! It was delightful. \nWill be going back again for sure!", "author": "Pallavi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "I LOVE this place. I went there for lunch today. The service was great! The food was awesome, I order the Mac and cheese.  The female manager was very helpful and friendly.  I will definitely go back again.", "author": "Karina M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-06", "description": "Service is slow like molasses . Servers run around confused. Takes 15 min to get a glass of water. And they were not busy at all. Owner should invest in some training and supervision.", "author": "S E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "Nice ambience, good food, but not the best service that you can get. \nI love their waffles btw.", "author": "Kate L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-01", "description": "I live in the neighborhood and have stopped eating in because of the consistently terrible service. Yeah, the food is overpriced. But it's decent and healthy, so I can kinda deal with that. I just can't deal with the incredibly bad service and the long wait for food, water, etc. I still stop in for a drink or a pastry, but stay away if you're looking for a pleasant dining experience.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-02", "description": "I have eaten here just about every week since it's opened so this review is long overdue.\n\nThe food is, in my opinion, worthy of their price since many of their entrees come with their delicious organic bread (with free spreads) and/or salad. Be sure to try the wild mushroom and goat cheese omelette - it is to die for.  Unfortunately their omelettes are only served till noon on weekdays and 3pm on weekends so be sure to go early.  Other notable items are the gazpacho (so so good, I often go just for a bowl of that refreshing tomato-ey goodness) and the shrimp/avocado tartine.  The pastries have never disappointed, if a tad on the pricey side.  And the lattes - excellent.  \n\nIt's not perfect (sometimes there are crumbs left on the ground or the tables are sticky, or now and then you get an I'd-rather-be-somewhere-else waitress) but given the choices on Montague it's probably the best place for families with babies or groups.  I appreciate all the changes they've made since they opened like turning that horribly positioned wall of jams and cookies by the entrance into display tables and, more importantly, creating a smooth concrete ramp for the entrance to accommodate strollers/handicapped access.  And the bathroom is huge, clean, and has a changing station!  Huge bonus.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "I must say this is the first le pain quotidien I been to where it has been extremely busy and I received beyond wonderful service ! \n\nI visited the location in Brooklyn heights on Friday which was my first time visiting I was having lunch with the kid I nanny for I must admit I was in a rush and they valued my time I was greeted by a server which was waiting my table but it was not him who stood out . My toddler was crying at the top of his lungs for food in which a woman walks over and ask me if it's ok to give him a piece of bread or a cookie so he can munch on while we waited  of coarse I said ok she comes over brings him a chocolate chip cookie some crayons and coloring book which made me and him happy . I Apologize more then 10 times I let her know I will be leaving shortly  she then tells me \"listen he Is kid and this is what they do I will scream if I'm hungry too he is no bother to anyone you do not have to apologize for anything kids are such a blessing I will never refuse you service or feel  bother by any kids \" she made not only me happy but Tyler happy she played with him and made him laugh  just to distract him She then approaches the window by the kitchen and spoke to the cook about my food in which came out quicker she really was attentive towards me and Tyler . I then thought she was just a wonderful server I  ask her can I speak to her boss she happen to be the manager I don't normally see too many managers out there that are so kind . She share this love with her employees and customers she smile greeted and told her employees great job every time  something came out the window . she was just so sincere which made me think restaurants  are not that bad after all and not all people in the restaurant industry hates their jobs . I will definitely go back  I believe her name is Lauren or Lorain if so you rock girl !  but thank you so much !!!! For the great experience \n\nPs turkey mash is to die for", "author": "Samara Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "I feel repetitive in saying this, but I quite like Le Pain, for all its chain-ness. It may not be Made-In-Brooklyn, but it serves a lovely breakfast with plenty of room to spread out the newspaper before heading off to the subway.\n\nIt's not going to appear on any award listings any time soon, but you can always expect a solid coffee, oatmeal or tartine. I think this chain gets a bad rep because they make food you could make at home, the only difference is that its consistently good, fresh and does not require you to use your own kitchen or hands.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-06", "description": "I'm so torn with this review. I like the food. The soups are very good as are the tartines but the service! It's pretty terrible. It always seems like the senior staff are rude to the younger crew. I've seen two different manager types barking orders at the rest of the crew in such a rude manner I'd quit if I'd continued to be treated like that. I do like a couple of the waiters but it's very mixed. I also don't like being seated in a far corner when I arrive with my 4 year old son. I parent him in such a way to have good manners in a restaurant. I don't need to be hidden in the corner to not disrupt the other patrons.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-14", "description": "Love that this is in the neighborhood, but they need to get waitstaff in check.  Just walked out because sat down and hadn't been acknowledged for an unreasonable amount of time.   Place was a bit of a mess in there.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Having lived In the neighborhood for many years, I find myself looking forward to delicious, fresh and healthy breakfasts and lunches.  The steel cut Oatmeal with warm milk and fresh berries was a winter staple for my husband.  I also found the meal to be a favorite breakfast.\nLately the boiled eggs (boiled any amount of time you ask) with wheat and raisin nut bread is\na perfect start to my day along with a delicious latte.  My husband loves the smoked Salmon\nand scallion Omelette is cooked perfectly and is delicious.  \nI enjoy the Latte every time I order one.\nThe staff are welcoming and hard working.  I feel comfortable and welcome.  I never feel rushed or unattended to.  I am happy that LPQ is in Brooklyn Heights.", "author": "debbie p."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "This is a real shot in the arm for Montague Street which is overrun with banks, optical stores and hairdressers.  It is a nice place to sit outside and people watch.  I had a pot of coffee with a pear and apple croissant.  Both were very good.  My son had a chocolate croissant.  The chocolate was good quality, but very little of it.  Next time I will try a frittata or a tartine.  My hesitation in giving LPQ one more star is that it is just a tad too pricey and it is really Au Bon Pain on steroids.  The \"pot\" of coffee is probably 17 ounces and it cost $3.50.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "Ate here twice during Thanksgiving week. Generally good food and service. The three lentil chilli was fine.", "author": "Philip S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Le Pain Quotidien", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Eu7F8tUmJesLkaP2lH2zCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188583078"}