{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-27", "description": "If you've been to one LPQ, you've been to them all. This particular location Is a bit bigger than the ones I've been to in NY and in neighboring states, but it's just as nice and clean. I had the toasted croissant with Paris ham and gruyere cheese, and as always, it was great. Flaky, buttery and nicely toasted with a simple salad and olive oil drizzle. \n\nThe service. Is. Atrocious. Both visits have involved very frustrating waits for the check even after requesting one several times. Our waitress went on break without transferring the table to someone else, and it took ten minutes and four employees for us to get the check. The bill was $20.91 and we paid $30. The waitress, quite absurdly, turned around and thanked us for the generous tip. Ma'am. Why would I tip you 50% of the bill when half of my time was spent waiting for the check? \n\nThis is what happens when you want something light and fresh in this area.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "Stopped going because of glacial service. Today service was great but the food was not fresh. Salmon had an odd color and an unpleasant aftertaste.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-29", "description": "The main attraction of Le Pain Quotidien on Montague Street, for me, is its outdoor seating area.  Not only is the al fresco dining option nice for the customer, but it also livens up the block, which I appreciate as a resident of the neighborhood.\n\nThe chocolate croissant at Le Pain Quotidien was good, but skimpy on the chocolate.  I expected something impressive for $4, not just \"better than average.\"  Also, I wasn't too keen on the pretentious vibe of the place.  I felt like the waiter was looking down his nose when my mom and I asked for clarification on a couple menu items.\n\nI'd like to give this place three stars because it adds a little charm to the block, but honestly, I wouldn't recommend going here.  Instead, try the local bakery/deli across the street (Lassen and Hennigs) and enjoy your coffee/pastry/salad on the promenade!", "author": "BT F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "Horrible, horrible and extremely horrible service.\nIt took the waiter 10mins before she came to us to take our order. After she took our order we had to wait a additional 25mins for our order to come. Our original waiter never came back but another waiter did bring our order. No one came to ask if we needed anything. After we were done with our food and wanted to get our check we had to wait a additional 15 mins. After 15 mins I had to go up to the front desk and ask to see a manager. After explaining to the manager what is happening all she could say is \"you are right\" and \" I am so sorry\".\nI would never go back \nAs We am walking out I see other people were also complaining about the service. \nSuch Horrible service I would never go back", "author": "Keren O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-31", "description": "Beware. This is the worst service I've had in Brooklyn Heights and the worst Le Pain Quotidien I've been to. The coffee was burnt and horrible. The takeaway staff are ok, but the table staff are bad. Avoid if you can.", "author": "Peter T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "Glad they opened Maison Kayser... Would not come back here in a million years. Dry pastries and bad bread with a combination of lazy and clueless service.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "One of my favorite places to grab a quick snack. I went to this location with a colleague. \n\nWaffle with fruit is amazing. There is sugar in the waffle so no syrup is need! Perfection. However the waffles are small so you should order something else with it depending on how hungry you are at the time.\n\nMy colleague ordered the chicken soup with a apple cider.  Amazing! Perfect for this weather and the season. I will definitely be back soon!", "author": "Elyse D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-14", "description": "Does this place have a manager? One has to wonder given how inefficient everything is here. A cappuccino, a glass of wine and a pre-made pastry took no less than 20 minutes to get to our table. Getting a check on the table, another 10 minutes. And this is all at 5pm when the place is less than half full. The food quality is just good enough, but nothing worth forgiving the lack of basic operational competency.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-30", "description": "Terrible service, not enough waiters, overpriced mini food portions, bad coffee.  Most recently we tried to get a waiter's attention for 15 minutes to order. No luck. We gave up and left.", "author": "George S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-13", "description": "First and last time I will have a coffee here. The till person was stressed and on the phone, paying no attention to my complicated order of a black drip coffee.\n\nFive minutes later, I was asked to move from my corner table, to an awkward table beside the til line-up, as I was a single person at a four person table. I said, I could separate the tables so they were 2, two person tables, and the server refused. I left. Especially annoyed as it is 2:16pm on a Monday and there are many 4 person tables open.\n\nI didn't eat anything, but the pastries looked messy and stale. Pathetic attempt to be a French boulangerie/cafe.\n\nThe only reason I am giving 2 stars instead of 1.5 is that the toilets are clean.", "author": "Charlou M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-01", "description": "So $4.60 for an iced coffee is outrageous. Come off it. I know you've got to pay for Montague rent... but that's just crazy. That's higher than Blue Bottle which provides way better quality. Also, servers are always overworked and this, regardless of how hard they work, service is slow.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "I am a fan of bread so, Le Pain already gets points for that. They have a selection of pastry items, their pain au chocolate is great and they always have a soup offered. What I enjoyed this time, which I had never had before, was their own hazelnut spread. It reminds you of nutella, but I didn't find it as sweet as nutella. order a bread basket and spread some on to taste! and you will find yourself buying a bottle to take back. \n\nThey also have a hazelnut and praline chocolate spread with is also good!", "author": "Luciana Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-08", "description": "Love the pain quotidien and I'm so glad they open one in Brooklyn. Went there today, ordered the Quiche Lorraine( it comes with a mesclun salad) to go. I seriously was in and out of the store in less than 10 minutes. Oh and I also got 2 mini lemon tarts, so delicious :). So the food was good and the service was fast. \n\nP.S: what's up with all those 1 star reviews?!?! :)", "author": "French L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "I have started coming here weekly with a group of moms and our babies (yeh, it's pretty weird seeing that in writing). The staff is always really nice and super accommodating to us and our many strollers. \n\nThis place is not cheap but everything is always really good. Drinks, food, you name it. It seems like most everything is organic too which is great. They also list the calories for everything since they are a chain, one thing I am not a fan of. It's hard to splurge for the brownie once you see how bad it is for you.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Great service. Excellent coffee. Our tomato avocado omelette was cooked well and came with delicious sourdough bread", "author": "Joe J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-08", "description": "I've been a loyal patron of LPQ for years and was beyond thrilled when one opened around the corner from my apartment. While the food is as delicious as at other locations--when it finally arrives, that is--I've literally grown to dread going in here. I simply cannot contend with the horrendous service. Yesterday, I convinced myself it was worth the horrible experience to get my hands on a kale salad however, after waiting over 35 minutes and being systematically ignored by my waiter, I finally told a manager I couldn't wait any longer. He simply said, \"ok.\" No, that's not ok. \n\nI wrote to an email address I found here on Yelp but haven't heard any response. Please, get your act together. I'd like to be able to return and I refuse to until the service has been addressed.", "author": "Michelle O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "Giving this particular branch one star because the terrible service staff create the worst ambiance.\n\nThey almost seem upset and annoyed that you dare sit down when they are always having some sort of employee meeting. Tons of them just hanging out in the dining area, sometimes talking to eachother, sometimes not, looking bored and lazy or quite oppositely manically attempting to plan an expansion or maybe reviewing their customer feedback and brainstorming ways to improve.\n\nOnce I had a server lean over my table with BOTH of his arms rested on the table in a very aggressive, dominating stance every single time he said anything to me...GROSS! I would've walked away feeling more violated if it wasn't so bizarre. Like, am I your little secretary in the 1950's and are you my boss asking what I'm doing Friday night??? Seriously fake an attitude of servitude if you are a \"server\" for gods sake. Bad, bad form!\n\nThe fact that they have the audacity to charge relatively higher prices for their food and hire people who act like that is hilariously inconsistent and kinda pathetic. I used to kinda like LPQ, and the other branches I've been to are totally fine, but this one makes me have a lot less respect for them.  \n\nThe cashiers at the counter are rude too, they act like you are taking up so much of their time when you get a coffee and pastry. \n\nI've actually eaten here quite a few times, despite everything and there's always some sort of issue or incident I witness from the other diners not necessarily having to do with the restaurant....this, of course, has nothing to do with them its just kinda funny.\n\nI have to say that there is one girl that works there that is sweet and seems like she is doing a great job, but it's such a stark contrast to everyone else there that it just makes them look worse.", "author": "Stella S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "Excellent salmon omelet ! Try it \nOnly the clean plate left ! Coffee \nA must !", "author": "Bella B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "The service was a bit slow though they compensated by giving us free refills. The curry chicken tartine was tasty. Only complaint is the chairs for outside dining are just uncomfortable.", "author": "Andrena F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "Bad service, no flavor. Husband and I came for desert and while the menu options should've given me a clue, I naively gave them a chance. A customer ahead of us asked the cashier about different flavor a and she would tell him \"I can't hear you\" when she clearly could. Then when he raised his voice to ask the same question, she plain out said she didn't know. Had never tasted it and didn't know any flavors. Okay??? Then packaged my item to go, without asking. I decided not to make a big deal and just asked her for a fork as I opened my box. She rolled her eyes at me and said \"This was to stay?\" I don't know why she was bothered. In NY, however, I've gotten used to bad attitudes. What put it way under for me was the lack of taste. I paid $7 and the cheesecake tasted like paper. I took two bites and left the rest. Don't waste your time or money in this place.", "author": "Jaziel A."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Le Pain Quotidien", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Eu7F8tUmJesLkaP2lH2zCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188583078"}