{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-21", "description": "ordered the kale salad to go. it was $14.00 and was half full. tiny salad huge price tag. and a waste of time and money. would have asked for a refund but was in a hurry.", "author": "Alex K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-10", "description": "First step in and I was in love with the space. The mushroom and spinach quiche was delicious and came with a fresh salad and amazing dressing. Perfect pairing. Was here at the beginning of the day so food service was a little slow (had to wait for quiche to be heated). I've also had their chocolate croissants and cheese danishes, which were very good. Got a large black coffee, not the best I've had so probably won't be going back for that. Service was spotty even at this hour, it's a bit awkward being the only person there waiting. Asked a few questions about the pastries that the girl behind the counter didn't know the answers to but she was friendly and tried to find out for me.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "we came here for breakfast with 20 people during our family reunion, they were very accomidating and friendly and the service was efficient.\n\nI wish I could have ordered several things off the menu because so many things sounded good. I settled for their special which was the smoked salmon breakfast. Smoked salmon served with ricotta, herbs, rye bread and soft boiled egg. My egg was more hard boiled but still tasted good and the salmon was super fresh. I also had a cappucino which was excellent! My husband got their oatmeal and he seemed to like it. Overall everyone was happy with the meal and I really wish we had one of these places in Texas!", "author": "Gabrielle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "This was one of the best waffles I've ever eaten! I would have given it five stars if the portions were just a bit bigger, my husband was still hungry.", "author": "Brianne P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-25", "description": "I've been going to this Le Pain for sometime - the food is pretty dependable like at most Le Pains - the service however not. Wow, whats going on here folks - 10 minutes waiting to even get a menu and then another 15 for a coffee and a tea - tea was cold. Lots of staff walking around and nice enough - but there seems to be a constant confusion - could be a great place with a little more focus on basic service.", "author": "Susan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "Chic French restaurant serving organic and fresh bakery and breads, salads and other gourmet food in a stylish wooden style furniture setting. Decent crowd, few people work from here in Starbucks style setting too. I come here often for lunch and leave happy.", "author": "Deep B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "It's a typical LPQ with the same type of format. They do have outdoor seating at this particular location, which is nice when the weather gets warmer. \n\nIt took them forever to make my iced mocha because the chocolate syrup was hard to squeeze out of the bottle because I assume it had been put in the fridge or something.\n\nThere's no great bakery on Montague St so I am glad that LPQ can give me my Pain Au Chocolate fix when needed!", "author": "Julia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-21", "description": "I like this chain of restaurant.  And the food and coffee are very good. The only thing I would say is that their prices are way above reasonable.  We both had a quiche which comes with a small green salad + coffee and we shared a dessert and the bill came to $52 with tip.  As much as I enjoyed the food I would think twice about going back as I think the prices were just too high.", "author": "Lynne W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-07", "description": "Used to be a nice place to go - now it's disgusting. Cracked and leaky dishes, poorly trained staff and the food is literally thrown onto the plates. The expensiveness just makes it all the worse. Tables are always filthy when you sit down. Just a disgusting pace to eat. Hope it goes away.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "I like this place but I just wish it wasn't so expensive. I went there for breakfast. Got an omelet and hot chocolate and it came up to like $25. The hot chocolate is incredibly yummy and the food was fresh and delicious. I would definitely go again.", "author": "Sophie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-13", "description": "FOOD IS AWESOME! SERVICE NOT! Went here twice in the span of 3 weeks for breakfast, and had the same disgruntled waitress with a half shaved head.  Both times the restaurant was not busy, and she acted like we were an inconvenience to her not so busy day. The other waiters did an excellent job covering for her lack of care.", "author": "Elaine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "Had smoked salmon taintene.. however you spell it. A little pricey but worth it. Filling but not overbearing. Had a great capuccinio and dark white chocolate mousse. Amazing! Manager and waitress were extremely nice as well.", "author": "Aeriel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-08", "description": "hmm...this place is pricey. i'm just going to come right out with it. that said...\n\ni went there for a delightful brunch story on a beautiful day story in the gorgeous neighborhood story just west of downtown brooklyn. it couldn't have been more perfect. we had the proscuitto, fresh chai (that's plural for cheese, not the spicy tea), assorted breads and olive oil and tapenade spread plate...which. were. delish. so much so that we had it twice.\n\nthere's outdoor dining street side that if you find the right tree, you can avoid the intense sun of a sunny summer day. i bet it's grand, grand, grand in the fall and spring. and there's plenty of room inside which may have accounted for the lack of service. or rather, too many guests, not enough servers. we had to wait. and wait. and wait. coffee refills were slow to come by and and when did request something, we had to request it twice. in the case of the proscuitto plate, that's great ~ we were willing to pay for it. in the case of a drink refill, not so much ~ we weren't quite so willing to wait for it. but we did because the view was so pleasant.\n\nso this is one of those restaurants that if your mood is off, it could go terribly wrong. but if you're in the right frame of mind, it's ideal. and the take away menu is almost as complete as the dining in menu.\n\nenjoy!", "author": "Brian Paul M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-22", "description": "Came here for a pre-dinner drink on a sunny Sunday afternoon.  I didn't eat, but I can honestly say i won't be back to do so unless I have at least 1.5 hours.  The service was nice, but so so SO slow.  That being said, the food looked good, and it's a stones throw from my place, so I'll update my review once I try out the food.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "We tried the Season Special, which was the Ham \u0026 Cheese croissant and the Parmesan \u0026 Chives scone with salmon and cottage cheese. We also shared a pot of coffee. All was organic and nutritious but also tasty. We will come back again and again.", "author": "Cathy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "Minus a star for very high prices.  Off the charts.  But LPQ does post them up front: you can walk away if you don't like them.  Good quality ingredients, and I've never had a problem with the table service.  About as good as a chain gets--I'm lookin' at you, Connecticut Muffin next door.", "author": "Unree P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-25", "description": "I checked and it looks like my original review was mysteriously removed...seems fishy...\n\nOriginally from 4/25/11:\n\nBeautiful space, bad service.\n\nRan in here to grab a quick oatmeal to go.  How long should that take - 5 minutes tops?  Nope!  After waiting for 20 minutes patiently (my stupidity), I went over and asked if it was normal to wait so long for a scoop of oatmeal.  Lady behind counter says \"ohhhh, we forgot about you....\".  No apology, no offer to make it up to me.  \n\nWill not be returning here!", "author": "M D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-14", "description": "2 stars because the food is great. The omelettes and waffles especially. My kids love the waffles which comes with a nice small bowl of fruit. The little coffee pots and large coffee bowls do not serve well to keep your coffee hot, however. I usually order a to go cup if I'm eating at a table.\nI gave 2 stars for the service though. Most of the staff are very nice but they do not have a system yet. Often I've waited for a while just to order take away and I'm the only one on line. There is one particular waiter who may or may not be French. He is gruff, often banging his hands and things on the table while you're sitting there. Does he think it's charming? He seriously needs training and someone to tell him to end the arrogant act, it makes me think twice when I walk by and see him working that day.", "author": "Cecilia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-17", "description": "$3.10 for an undrinkable small iced coffee that tastes like it came from a street vendor. You guys really need to step up your game, unless you really are just overpriced fast food hiding under the veneer of faux frenchness. Unfortunately, I fear the latter and what a shame, Montague street is sorely in need of some quality establishments.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-08", "description": "The food is still good and still organic, but customer service has gone down the drain. \nAt some point a few months ago the management changed the \"fresh egg\" hours from 3pm till all day, which was excellent news because their omelettes and egg scrambles were absolutely the best. On our latest visit we were advised at 3:10pm that the new management switched the hours back to 3pm cut off and there was nothing to be done about it. \"The old GM changed policy on her own and the new GM adheres to the corporate 3pm rule,\" I was told. \nWe have been loyal customers since the place opened. We had a child in the party who was really looking forward to his \"brunch eggs\". It was ten minutes past the reinstated cut off hour. The server (who was really nice) attempted to convince the manager to make an exception. So did I. She would not be budged. So we cancelled the rest of our (large) order and left. \nIt doesn't matter how great or organic your food is, if you do not care about your customers, there will always be another business down the block that will. Especially In NY where there is no shortage of good food. \nAs we were leaving I overheard another table, also with children, attempting to order eggs...", "author": "Anna K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Le Pain Quotidien", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Eu7F8tUmJesLkaP2lH2zCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188583078"}