{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "All their locations have the same consistent food.  Tastes good and is reliable.  The problem with this location is the service.  So slow.  Pretty much every time I go in for a coffee on the way to work there is no one at the counter to take the order.  They are either in the kitchen (hidden in the back) or just no where to be found.  Not sure about everyone else, but in the morning when you are stopping by to grab a coffee and scone you generally want to keep a swift pace.  This place is consistently slow which is a shame because the food is good.  Perhaps employees should have free coffee in the morning to energize them, but until this is fixed I can no longer come here.", "author": "MC M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "The food is decent.\nBut the service here is just repeatedly the worst service I've even encountered.\n1. There are at least 4 servers on the floors but they constantly avoid eye contact and refuse to provide service \n2. Not once do they actively come over to check if you need anything\n3. They always get my check wrong\n4. Orders are often wrong too...", "author": "Maya C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-08", "description": "Service was good. We went on NYE for lunch and they only had one server who did a great job. The apple cider was great, but the Quinoa Cake was bland and lacking salt. I've had the Quinoa cake at one of the D.C. locations twice before and they were great. I also felt the smoked salmon tartine my boyfriend ordered was missing something.", "author": "Keila B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "We decided as a group to visit this place yesterday evening for a light dinner. Upon entry, it reminded me of an upscale Panera Bread. Since it was Mother's Day, most of the pastries were not available as they were all taken in the morning. \n\nLe Pain Quotidien honestly is more of a lunch place to me. I wasn't impressed with the limited choices. However you can order the breakfast and lunch at any time of the day which I liked. If you are vegan or vegetarian you would definitely enjoy this place. As I gazed at the menu and the restaurant I felt that whatever I ordered I would be underwhelmed.\n\nAnyway, I decided to order a ham and cheese Tartine. It had a fancy name but I forgot the name of it and I couldn't find it online. It was basically a warm ham and cheese sandwich. \n\nSurprisingly I was really pleased with the sandwich, it was bigger than I expected. It has cheese on the top, and it was really tasty. It came with a side salad. \n\nOverall, I did feel good after I ate this meal. It was really fresh. \n\nI would visit this place again for lunch or pastries!", "author": "Bashard B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-09", "description": "I live only a few blocks from this Le Pain and I have had to avoid it at all costs. The service is so terrible, pretty much their whole menu and how they serve you is bad. \n\nOverpriced lattes that are not strong nor good and pastries that have been sitting behind the counter for hours is never appealing. \n\nThere are way too many other cafes in the area to waste your time sitting here for 2 hours waiting for your French garçon to bring you a croissant.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-21", "description": "Wow, very disappointed. I came for the internet and ordered a $13 avocado toast to authorize my presence at the communal table. I quickly discovered that internet was not working and they said they couldn't reset it or it would mess up \"the whole system\". Then, my expensive meal arrives.... and the avocado was not ripe! I couldn't even eat parts of it because it was so hard. Ugh!", "author": "Emily G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "Quite possible the WORST Le Pain I've ever gone to - and I was eating at this location weekly until the final straw 2 weeks back.\n\nFirst, the service is horrendous! Slow and horrendous to be exact.\nSecond, they are slow as hell clearing tables with dirty dishes (I once asked 3 times to clear my table after a party had left outside). Shows me they take no pride in their store.\nThird, and final straw for me, I ordered a simple grilled cheese toastie (not on the menu but they said they could do it). Well, it took them 30mins to bring that out. It wasn't even buttered and the cheese had barely melted. It also took them 15mins to bring me a pot of coffee.\n\nOverall, I won't be eating here anymore despite the fact it's in my neighborhood and great for a post-workout juice and meal. This location has some serious cleaning up to do.", "author": "Gee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "Food is great. The desserts are great. My taste buds are liberal, so another person might find the word \"great\" misleading (I could, probably, eat a can of dog food and describe it as great food). The service is very s l o o o o o o o o o o w. That description is something many people agree with. The manager, Sidney, is terrible. She removes plates and utensils from the customer's table, but leaves dirty dishes at unoccupied tables. I watched as she swept the floor with a broom that is so used it should be discarded. She leaves the broom and dust pan in the path of workers entering and exiting the coffee bar. She seems callous. She shouldn't be a manager. If the manager is sloppy, the staff will follow suit. We ate indoors. Oh yeah, completed food orders pile at the kitchen and no one retrieves the orders in a timely fashion. We ordered macaroons for dessert and the server forgot the one macaroon at the coffee bar. We waited fifteen minutes for our server to remember. We asked another employee and she gave us two explaining that the dessert comes with two macaroons not one. I believe McDonald's has better service. LPQ requires better quality control of their staff and then it could be a great place to eat.", "author": "D M J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-31", "description": "After trying to order at the counter to take a seat they told me that I would be helped by a waiter and I can order from them. After waiting 15 minutes and speaking to them multiple times I was never helped so I took my business elsewhere to Teresa's where I had a nice meal across the street. What a waste of time", "author": "Jimmy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "Can't really go wrong here with the omelette. The salmon and scallion is my favorite! They usually have delicious pastries like the French creme donut available (that's always worth it). Always worth a visit if you're in the neighborhood and need a quick breakfast.", "author": "Emmanuel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-07", "description": "Waited fifteen minutes to be rudely treated by an employee who wanted $11 for an egg and cheese sandwich to go.", "author": "Toby M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "Food is reasonable. \nNot spectacular.\nService is hit or miss.\nGood place to meet/wait for company.", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "This LPQ has been my go-to restaurant in the nabe for the past couple years. I know several of the waiters by name, Samantha, Justice, Kevin, Shakim, and they are exceptionally friendly, funny and welcoming every time I stop by. Some of the other reviews mentioned that the service can be slow, but that hasn't been my experience at all. Maybe once, of the several dozens of times I've been there, my order took 10-15 minutes to arrive, and the waitress apologized and explained that the kitchen was short-staffed that day.\n\nAs far as the food, it's healthy, fresh and delicious. I usually rotate between the avocado \u0026 quinoa salad, the kale chicken Caesar, the seasonal frittata, the chili, and the chicken soup. For dessert, I highly recommend the cheesecake. YUM!", "author": "Susie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "The avocado toast is delicious, but literally the worst service in the city.  No matter how empty it is, it takes an eternity for a waiter to come by and get your order, and then another eternity to actually get your food.  And then sometimes the order is wrong.  Avoid at all costs--after repeated terrible experiences over the course of several years, you couldn't pay me to go here.", "author": "Anon A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-04", "description": "I must say, I am deeply disappointed. I decided to stop by Le Pain to grab a quick lunch to go. For a $5 cup of tea (sparkling hibiscus tea), I was hoping for something tasty. Instead, I quickly learned that I just paid $5 for an over-brewed and distasteful cup of tea. I spent the next 30 minutes waiting. Waiting for a simple smoked salmon tartine. Again, I was hoping for $15, this was also going to be delicious. I stood in the corner for 30 minutes without any indication if my food was coming. I saw around 10 customers fly in and out, leading to the demise of my dwindling hope. Needless to say, when I stared down the employee who took my order, she decided to check on my order and bagged it. \n\nWhen I open my togo lunch, it actually wasn't the simply smoke salmon tartine I was so eager to eat at this point, but a mystery salad. A salad that I just didn't wait 30 minutes for or paid $15 to eat. I did try it though and it's just OKAY, you really can't mess up throwing random leafy greens in a box. \n\nNeedless to say, I will not be coming back and very disappointed in the service, food and overall experience here.", "author": "Raiana F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-31", "description": "Looks like a French bakery, feels like a French bakery, has all the makings of a French bakery, but fall far short of tasting like a French bakery.\nCoffee is watered down\nCroissants don't taste good\nBut great atmosphere, just buy your coffee somewhere else and come and sit here", "author": "Alexander M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Cute relaxed cafe. My friend and I stopped by because we had some free time to chat and hang out before our next plans. We ordered a decaf latte, organic blueberry muffin, and a slice of cheesecake to share. Everything tasted fine, nothing groundbreaking but I would eat it again. The waiter was sweet and had no problem with us making a small order. The interior is charming and cozy. Fits well with the neighborhood. I would go back!", "author": "Jake C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-26", "description": "Generally speaking I feel that Le Pain is very poor on customer service. This cafe though is the worst! \n\nI live in Brooklyn Heights and recently brought some friends from out of town here for brunch. (Saturday morning~ 10am). We sat and waited for 20 min before being approached at our table, once we ordered we waited 45 min minutes before our food arrived (we each ordered a basic breakfast comprised of eggs and a salad). During this time, we had also ordered coffees that took 20 minutes to arrive.\n\nThe table beside us had dirty dishes sitting there for our entire stay. There seemed to be 1 maybe 2 waitresses on the floor and every other customer around was frustrated by the wait time and poor customer service.", "author": "Karina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "I loved this place, the waiters are always soo friendly and the interior is great. \nThe best breakfast you can have in NYC; try the bread selection with the various jams and creams, just delicious.", "author": "Giuseppe R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "Can't go wrong for a wholesome, quick lunch. Or linger as long as you like.", "author": "Dom G."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Le Pain Quotidien", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Eu7F8tUmJesLkaP2lH2zCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188583078"}