{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-13", "description": "It's nice to know LPQ takes their customer service seriously. I was offered a complimentary meal upon my review. \n\nThe next two times I went, I ordered their donut and salmon breakfast. I went on a weekday for the donut and a Saturday for brunch. The Saturday brunch was a little crazy, but my service was pretty good. \n\nI wished it was a little more organized in separating who was a grab/go customer and who wanted a sit-down meal. I sat myself and had to check in with a server on my own. However, Carla was super sweet! \n\nMy salmon breakfast and matcha (no simple syrup at a high class coffee establishment seems odd)  were pretty decent. There's a lack of good food options on Montague so it explains the business for brunch on a weekend. I would come here for their drinks, but I find their food unmemorable. A french boulangerie quality meal leaves a great food memory, and I don't feel like that is the case here.", "author": "Michelle V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-08", "description": "Complete confusion, lack of any organization, a nice, but clueless hostess, no menus, no nothing. \n\nAfter my mom, who lives around the corner told me about this place, we decided to have lunch one afternoon \n\nIt was not rush time, brunch, lunch, or any other sort of crunch time. \n\nThere was no service, as mentioned above. Plus, all tables that weren't taken were dirty! No bussing happened while we were there. \n\nWe finally, after 15 minutes stopped the hostess for some help. No one had approached our table to clean it, offer menus, say hi, get us water, or anything. \n\nAfter mentioning this she got us coffees, great thank you. But...\n\nI ordered a frittata that was the worst I've ever had. It was like cutting into a dry sponge, with no flavor. \n\nSo I sent it back for the avocado toast, which my mom ordered.  \n\nHer's still hadn't arrived. Ends up her order went to another table. \n\nWe sat for over 40 minutes with empty coffee cups. Then randomly one avocado toast was delivered. \n\nFinally I went to the back, because I was told the manager was there, so was my avocado toast...sitting waiting in the window for god knows how long. \n\nAll I can say is that this was a complete FAIL. \n\nMaybe a really, really bad day? But I saw lots of lazy staff ignoring customers who needed help, food or coffee. \n\nWe will not be back even though the manager took care of our tab. It was the least she could do. \n\nHire more, and BETTER staff. Seriously!", "author": "B K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-21", "description": "One star.  Even though we love the food.  \n\nThe restaurant is woefully short-staffed.  I guess the owners are trying to give people an authentic experience of stereotypical \"French\" service.  \n\nWe were not even given water.  Even after I asked for water, the server still not bring us water.  Once the food finally arrived, it took another 10 minutes for her to bring the salad dressing we had ordered in the first place.  \n\nWorse, much worse, they leave dirty dishes on the table. There is no one to bus the dishes.  And so at our table, we sat there for about 20 minutes before someone finally took away the dirty dishes. \n\nI watched a couple come in and sit down and after 10 minutes when no server approached them or was even remotely available, they just got up and left. \n\nPerhaps the owners are deliberately trying to run this place into the ground. Maybe it's just a money laundering front and they don't care at all whether they provide a good customer experience.  With service this bad, one truly has to wonder.", "author": "Alexander D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-01", "description": "Love to go here with the kids for breakfast on the weekend. The wait staff is very friendly and nice. I love the warm belgian waffle. Its kind of small but very tasty.", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-19", "description": "Love the Grilled Chicken Cobb Salad and I often call in for a take out lunch. Trouble is, the chef forgets the chicken, bacon or blue cheese. Sometimes he/she forgets the dressing.\n\nThe manager told me to always check the salad before I leave but it's so difficult to do that when it's all packed up and customers are waiting.\n\nI got the salad yesterday and it was missing the bacon and had the wrong cheese and dressing. That's it for me. No more.", "author": "J. B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-22", "description": "Sucks. Period. \n\nNot a good representation of la pain.\nThe amount incompetency in this establishment is unforgivable.", "author": "Lola J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-15", "description": "I went in with co-workers during lunch. We had to wait a good 20-30mins before someone even approached us. After getting seated it took 20mins to take our order. Another 15-20mins to get the food. I ordered vegan chili soup, which was brought out super cold. When I told the server he just reheated it in the microwave for 2mins and was brought back. Food was decent, very very slow service", "author": "Kalyani R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-15", "description": "The service is awful here. For one person to order a coffee and omelette will take 2.5 hours (more if I hadn't reminded them that I existed). Which includes flagging down a person to give you a menu, flagging down a person to just take your order, flagging down a person just to remind them that you asked for a glass of water 15mins ago. Then once you get your meal, your coffee cup has been empty for the past 30mins, then your plate has been empty for the last 45mins. You're just sitting there watching them walk past you waiting to make eye contact so you can pay your bill. I'm actually sitting here right now because it's pouring outside and am writing this review because I've been sitting here for the last 12 mins without anyone giving me a menu. I plan to walk out right after I post this.", "author": "L M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-29", "description": "It was my first time here and I did not know what to order so the guy at the front was so kind and accommodating. I wound up with a simple iced soy latte which was good but also nothing but ice. I finished it within a couple of minutes. I don't think they guy who helped me make it so it's not on him and I was not watching the drink being prepared. I took it as soon as I was done and walked back to work. For $5 I would expect more coffee, less ice. This is pretty bad, even for Starbucks standards.", "author": "Ana H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "We went for lunch and truly enjoyed the service and food. I will probably come back. I purchased bread to take home and everyone loved it. I am a big fan of Le Pain Quotidien and really enjoy that their service and food is consistent in taste and presentation. If you are in the neighborhood definitely stop by and try their menu. It's a good community table restaurant!", "author": "Meline V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-04", "description": "I would love to give this place 5 stars for the decor, and feel of the restaurant alone. It's very well designed, very well lit and feels like my Mom's dining room. The food is great, cuz I'm addicted to the croissants and fresh breads.\nService is apart of this 5  rating also, and unfortunately the service was a little slow IMO\n\nIt took awhile to place my order, I don't know if the guy behind the register was new, but for some reason after every order he took, he left the register. He also didn't seem to know how to find certain orders, and kept having to ask for help. So ordering took a bit longer. \n\nI went here on a Saturday morning, and they were out of certain salads that I wanted. This was strange to me because I can understand if it was, later in the day, or before they closed, but early in the afternoon and being out of a menu item is definitely odd.\n\nThe ordering area needs to be more organized, there are ppl just standing around waiting for orders, and waiting to order, you don't know who, is who or where to stand. The line tends to block the door. \n\nOther than those things, it's not a bad place to eat. Food came quick tho", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-07", "description": "I have come twice, both times on a Sunday afternoon. On both occasions they have been sold out of multiple items we tried to order on the menu.\n\nThis past trip we decided to try to sit down since it was cold outside. The cashier instructed us thay we had to be served by a waiter if we were going to sit. We were given contradicting information about where we were allowed to sit (anywhere vs. front section only), which was weird but whatever.\n\nIt took 10 minutes for a waiter to confirm our order and another 20 minutes for it to be delivered. It was an awfully long time to wait for coffee and pastry in a mostly empty bakery with more employees than customers at the time.\n\nThe food was fine, a little too expensive for what it is, but if the service was good it wouldn't have mattered to us. \n\nI wasn't actively insulted or anything, but both of my trips here were so inconvenient I almost certainly won't return, there are plenty of other options nearby.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-22", "description": "I do like this location and spend a lot of time working at their communal table. But some of the negative reviews are correct about them seeming short-staffed. Generally I stay there a while so slow service doesn't affect me so much, but if I were in a hurry it might be a problem. And, this is a detail but a consistent problem -- why do they always serve stale bread on the bread plates? Bread is LPQ's signature item, you think they would want to represent it well...", "author": "Kat P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-09", "description": "Oh where do I start, my hubby and I love going to Le Pain we use to go the one on 5th Ave since this location closed we decided to go to the Montague street location. The first observation was that the staff is not as warm and friendly. The very first time we visited they were short staffed and they had no one to mash the avocados so we couldn't get our avocado toast and we were very disappointed. The second time we decided to go they ran out of champagne so we couldn't have any mimosa and today we were there again they ran out of berries and almond. The one thing that this location is consistent with is the fact that the staff takes forever to attend to the guests. After placing orders it takes forever to get your food and they are always running out of stuff or they are short staffed. Also the restaurant is never clean. Another inconsistency is the way the food is prepared. This location is badly in need of a very good management to whip this location into place. We love other locations but this location needs a lot of help!!!!", "author": "Verone B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "Want $5 off your next Seamless/Grubhub oder? Order from these guys. They'll inevitably screw it up and voila, you get a $5 coupon to make up for their incompetence. Works like a charm.", "author": "Ripov V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "So the waffle was super delicious! We went on a Sunday morning and it didnt seem like it was packed. The bread basket is nice and comes with a nice assortment of organic spreads which I enjoyed. The lattes were fine and the prices are all super reasonable!", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-09", "description": "I hate leaving bad reviews. But there's an upside. LPQ on Montague is being given an opportunity to step up and be a better restaurant experience. \nAnd hopefully redeem themselves. \nAnd yes, people make mistakes, have $#!++y things going on in their lives, whatever the case may be, I have simple expectations when I sit down in your restaurant. \n^Pay attention to your guests. Took a good 20 minutes for our order to be taken. \n^Offer your guests water, silverware, napkins. Don't wait until after the meal is served to provide these basic dining necessities. \n^Write the order down. I realize it's the hipster thing to (try to) remember all the details but this method gets a ginormous Fail when the meal is never put through to the kitchen, and only discovered at the hour mark of being there. That's 60 minutes since we sat down that no food was provided. \nWhile other diners came and left. \n^Ok, so you forgot about us. Be responsible and Get On It. Why on earth do we need to remind you about us and not get served for another hour?!!\nTwo hours of my precious time I will never get back. \nBut guess what?\nYou lost me at goodbye. \nNever again.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "When we got here, I tried to check in but for a reason the store has been marked as \"closed\", maybe they had some construction process or something, anyways, they are open :) \n\nIf you are looking for an alternate coffee to Starbucks at Brooklyn Heights, I would recommend Le Pain. I love their wood themed interior, it feels so warm and cosy. \n\nWe ordered two regular coffee and I wanted to try the waffle with berries. Best decision of my life :) It is a thick, fluffy yet crunchy outside topped with a scoop of cream and berries, not small, not big, just correct amount and combination of everything.\n\nCoffees come in a pot which has 2 cups full coffee in them, cream in a tiny saucer. Bowl like cups without handles are cute. \n\nMake sure to get some sour dough bread for home before you leave.", "author": "Ceren A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-23", "description": "They frequently don't have any staff working the to-go counter.  You just wait there indefinitely and nobody comes over.  Not worth the hassle.  They need to employ a dedicated staff member at the cashier/counter or will keep losing business.", "author": "Randy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-08", "description": "Went in for what I hoped would be an easy breakfast! Waited far longer than I should have, was finally served my food - but it wasn't what I ordered. I've had the same meal at a different LPQ location. It looked like the kitchen had run out so they just served me the remaining bits and bobs and finished it off with old arugula and huge chunks of kale that still had the stems. Too bad! The baked goods at the counter looked great, I will stick to that if I return.", "author": "M S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Le Pain Quotidien", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Eu7F8tUmJesLkaP2lH2zCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188583078"}