{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "I want to like this place, but it's just a dried out crusty pile of bread and reheated frittata. The only reason I give 2 stars is because the service is always super sweet. When when did French go fast food? And for God's sake get some fresh bread at \"your daily bead\" and get rid of those old crusts and dried out muffin tops.   Pitiful.", "author": "Salamander J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "I am leaving one star as I have continually been disappointed by this place. I often go in and place an order to go, wait about 20 minutes for my meal (not standard for to go dishes), and it is often the wrong meal or my order is somehow messed up. I have yet to go here and receive prompt service and the correct order on the same occasion. Today I called in and placed an order hoping it would be faster, and it was, however not only was my order wrong (again), I came back to work to find a hair in my meal. This is completely unacceptable. I feel bad for the employees as I know employees are only as good as the management that trains and supports them. Until something changes I won't be eating here again.", "author": "Katy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Where do i begin this is my furst time going there so my experience was great. I came in for soup and was offered some samples of apple tart and eclairs let me just say it was melt in your mouth goodies. Overall experience service was great food was good and atmosphere is very warm and welcoming.", "author": "Almaria B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-24", "description": "The cheesecake was bad and old. The hot chocolate was bad. The pastry was served long after the drinks. The service was overall horrible and it took 35 minutes for us to pay.", "author": "Erik M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "We chose to go to this location today as we've always had good experiences in the past. We waited for a few minutes, and a hostess asked if we needed help. We asked for a table and were told to sit anywhere. There were many empty tables toward the back and a contradictory sign saying to wait to be seated. We headed toward the back to sit, and a waitress said that the section was closed. We tried to explain that we were directed there and to ask where we should sit and she snippily said \"thank you\" and turned from us. We tried to sit toward the front and found one very wobbly table. I looked toward the hostess, who was busy on her personal phone. At this point, we realized that the location was busy and/or not interested in our business, so we left. I know lunchtime in Brooklyn Heights on a Sunday is busy, but tighten up! There's so reason for such confusion and discourtesy.", "author": "Nyc W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-06", "description": "The food at this bakery was excellent. I got a delicious latte and the waffle I ordered was rich and beautiful. However the service was not stellar. It took about ten minutes for a waitress to notice us. When she came to our table she only asked one of us what we wanted to drink, and then left. (There were two of us) It took at least 10-15 minutes for our two coffees to come out. Another long wait until she finally took our order. When bringing the food, she knocked some of our belongings off the table and didn't even apologize, actually rushed off. Finally, we were finished eating and waited another 10+ minutes until she brought our check. She never smiled and was just overall pretty rude to us.", "author": "Baylee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Compliment: Im a fan of LPQs city-wide and this one is no exception.  Chic and #1 on a street that lacks competition -- for good coffee and healthy food.  I usually come for morning coffee/tea or the Quinoia tabouli salad.\nNote: Wish the take-out coffee bar ran faster.  feels like it's understaffed, usually have to wait too long (granted time moves slowly when you havent had coffee yet).  I see people wait for a while and then leave without coffee often...", "author": "Ralphy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-18", "description": "Service is poor, food is not fresh. The last two times I came here they got my order wrong. This time, my salad had BUG EGGS on it. I noticed this after I had eaten most of the meal. Gross. \n\nThis place needs a serious revamp - the counter staff need to be trained in customer service and kitchen staff in food preparation and cleanliness, and management in food sourcing.", "author": "Laura S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "The place and food is excellent, very healthy. The waiter do a great service. Order the Avocado Toast + smoked salmon and raspberry lemonade.", "author": "Jonathan F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-27", "description": "It's a total mystery as to how service at a chain cafe can be this terrible. Expect 20 minutes for an iced coffee and 40 minutes for food and another 20 just to settle out. \n\nGiven the demographics of this neighborhood it should be full all the time. The fact that it's almost completely empty except for a few wifi squatters says everything you need to know.", "author": "Gia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "I left crying. I wasn't served until after sitting for 10 minutes. For tables came in after me and they were served with lunch. I do not want to accuse anyone of anything, but these are the facts.", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Carl was an excellent waiter and took great care of us! Food was great! So sweet! Love this place", "author": "meghan m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-03", "description": "1-10 I give this place a high 6 they mangers are unprofessional ,low staff \u0026 My food took long.  The Barista that took care of me was so helpful her name was Jocelyn want your order right Ask For HER .", "author": "Chickenchase G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "I had a great experience here. The staff was very nice and accommodating. Maura and Janelle were so helpful in assisting me. The online system was down so they gave me my order free of charge. I will definitely be visiting again!", "author": "Becca M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-29", "description": "Today service was terrible understaffed\nKitchen was dirty and eggs over cooked. For an expensive brunch. Something to think about.\nI have been there many times before. Something not right today.", "author": "Annette O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-19", "description": "Food is not great. \n\nGot skillet scramble with avocado and crispy onions. \n\nWasn't scrambled. And avocado was oxidized, like deep black. \n\nWas otherwise ok, bland, but hot. \n\nService good. \n\nAtmosphere is nice. \n\nThey ended up giving discount on the food for the avocado...which was the right thing to do. \n\nBut...  food was just meh.", "author": "J R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-02", "description": "For the last few months it has been almost impossible to order on the telephone (mailbox full and no human answers), and the web has not been accepting internet orders. How is it possible for a substantial international company to fail to maintain telephone and internet services? Too bad. It used to be a great place to pick up lunch!", "author": "Robert. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "I love this place, specifically this location. The concept could be a bit confusing, but they do a good job explaining it to you right off the bat here. I felt very welcome to stay and work, and my glass was always full! My croissant was a bit stale, but the coffee was delicious.", "author": "Kelsey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "This chain is consistent throughout all the stores I've been to. It's not a cheap place but it's high quality, no matter what you get on the menu. \n\nAt this particular store, I just stopped in for coffee and a chocolate mini muffin. Delicious. \n\nThere is plenty of seating.", "author": "James W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "Coffe flavored hot water. Nice atmosphere. \n\nI finished the coffee though.  I don't know what else to say.", "author": "Nick F."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Le Pain Quotidien", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Eu7F8tUmJesLkaP2lH2zCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188583078"}