{"aggregateRating": {"reviewCount": 161, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "This place was SO noisy! So many young children; it's definitely NOT a good place to work. Also, they were getting a delivery for over an hour, they kept door wide open and it was freezing inside.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-07", "description": "I came here for breakfast today and ordered a chai latte. As soon as I stirred it I realized it smelt horribly of rotten milk so I tasted a sip and it was awful! I could not even drink it so when he brought my food I told him it smelt like rotten milk and asked him to check if it was expired. He came back and said it wasn't but offered me something else so I got a latte with almond milk. Then I had to wait like 10 minutes after I finished eating for my check until I finally got up to pay at the register because it took the waiter so long that I wasn't sure where to pay. So I finally get the check and he charged me for the ROTTEN TASTING chai AND the latte! I will not be coming back here. HORRIBLE CUSTOMER SERVICE!", "author": "Abby C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "Terrible.  Walked in with my mom, I go to the ones in Manhattan and in Westbury,  was excited to show her the place. Walked in yesterday, totally ignored by everyone - told to sit down by some random person with a black shirt who was walking by quickly. No one brought a menu, there was a waiter paying infinite attention to a table of Italian speaking customers, he was speaking in Italian was well. Fine. I had to yell at someone flying by for a menu, my mother was very uncomfortable.  Finally someone waited on us, felt like we were bothering her. She had an attitude of sorts almost like \"why are you here?\". Fine food came and it was okay, but like my previous experiences.  The bill comes $45.00 for 2 tartine and 2 lemonades, at that point I just wanted the disaster to end. I tried to pay at the counter,  the very rude and dismissive black shirt guy from earlier grabs my card and bill and walks away saying something to the effect of my doing things all wrong and looks for the waitress. Grabs the wrong person l, when the right person has my card I had them run it and I left. The nicest thing anyone in there did was give me a plastic bag that I needed.  The floors and tables were filthy, the food was mediocre,  the service was a nightmare and my money will never see this place again.", "author": "Shasha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "This place is not perfect but it's my favorite breakfast and coffee spot in BK Heights. I usually try to support the local mom and pops cafes but Le Pain's quality is the best around. You can pay with an app that gives you rewards=free drinks and pastries. Most neighborhood cafes either don't accept cards or have a $10 min. The line at the counter can be long and service could get really slow at peak times on weekends. We've had some frustrating experiences over the years because they have high turnover and sometimes new staff is not on point.", "author": "Cc W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-07", "description": "Like so many other of the reviews on here, the service is terrible. \nOne would think such a big operation with so many stores would have a better hang of this ???\nBut NO.", "author": "Othelia J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-09", "description": "The service was excellent with Dasia our waitress Let me start by saying that the oatmeal was simply terrific.  And l don't give out oatmeal compliments so easily.   My wife's scrambled eggs were fine and so was the bacon.   Great views on always busyMontague st add to the restaurant's personality.  Go.  Enjoy   Prices are on high side but remember this is BKLYN NY.  NOTHIING IS CHEAP ANYMORE", "author": "Stan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "A nice little restaurant on Montague Street in Brooklyn Heights.  I ordered the Chicken Cobb Salad and it was delicious.  Nice and light, but filling.  Their raspberry lemonade was also great.  \n\nThe staff was friendly.  Our waitress even took our picture. *cute*\nI'll be back.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "Horrible service from manager to server. They are only nice and efficient when they pick up the bill.", "author": "Idil C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "Why oh why do I have to like the food here... I keep coming back for more when I know I'll get frustrated with the service. If you want to have pleasant service at this location you must eat inside. \nIf you enjoy eating outside, like me, expect the following:\na dirty table, being told you need to bus the previous customers garbage, then wait at the register to order while the staff ignores you while they tend to the most important giant lemonaid Tupperware that takes 2-3 staff members attention....but I'll keep coming back because I'm a sucker for tartines and scones.", "author": "Bena G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "Came in here to grab a quick sandwich before I get on the road out of state. I ordered the Belgian Hot chocolate and the Paris ham and gruyere on a crossaint. It took almost 10 minutes for my sandwich to come out. They were not packed, almost empty, maybe 10 people in total including children. Some of them looked like they had been there a while and set up shop with their laptops. When I asked about my sandwich, I was told it was coming and the kitchen is preparing food in the order it was received. Ok I get that, but if someone is to-go and you are just making a ham and cheese sandwich, it shouldn't take 10 mins. The guy who rang me up had to practically hover by the kitchen. If the service slow when it's almost empty, I can only imagine what it is like when the place is packed. When I finally got my sandwich, I was thoroughly disappointed. Too much money for an lackluster sandwich. I will never come here again. I would not recommend this place. There are too many other places in the neighborhood to get better quality food and better service.", "author": "Mel D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-11", "description": "What a horrible service! I got here Sunday morning at 8:30 and it took them 30 minutes to give me a glass of water. They didn't take empty plates and it took 15 minutes to get the check. I don't understand why people don't take their jobs serious. Definitely not coming back!!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "I was in heaven! Organic milk, organic bread, organic everything. \nI loved how I could sit at a long table, which I share with a few single people, and a couple doing our own thing... \n\nMy lunch: avocado toast was very delicious and I definitely enjoyed my cup of latte and later my cup of earl grey tea. \n\nWho could leave without buying goodies to take with? I picked up a jar of their jam and some Belgian chocolates which I devoured later on. \n\nThe staff was super friendly and accommodating as well. Overall a great experience!", "author": "Tara N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "Same as literally every other New Yorkers review. Food is simple and refreshing, great idea atmospherically and ethically. One of the worst joints in the chain. The service is a joke. Seriously.\n\nLive around the corner and been coming here hoping it will get better over the years. Better luck doing takeout and sitting in the park for what your time is worth. It's never busy and it recently took me 20 minutes without getting served to just go up to the counter, order what I wanted and go sit back down. Explained the poor service to the manager and not even an apology. What a mess.", "author": "Una H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "The most insulting dining experience I've ever had in my life! \nI arrived with my dog; the waiter absent-mindedly pointed at a table and told me to sit outside. For ages, no one came out to give me any water or offered my dog any water. Eventually they took my order and again, it took a long time. Other people had arrived with their dog and got water and water bowl for their dog. \nI sat there for 30 mins and no one came out to check on me at all. I had to go inside to get the waiter and the check. He had this sarcastic attitude: \"that was the complete breakfast food. You want the check?\"", "author": "L. M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-06", "description": "Really, the only thing that makes this place enjoyable is their outdoor seating on a nice quiet street in the Heights. And the idea is good- I like the items on the table like the spreads which make it \"homey.\" Other than that, nothing I would ever return for. The service was sooooooo slow. I literally had to go get my waitress three different times. My soup was also changed out three times- the first, it had spilled all over the plate to hold the bowl. The second, it was lukewarm. So finally, they got it right on the third try. My friend had a salad... $16 and it was maybe a handful of greens with some cranberries and nuts thrown on top. \n\nThere is so much potential here, but unfortunately everything seemed halfa**ed.", "author": "Pari K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-10", "description": "Came here. Asked for omelette. They told me they had no eggs left....\n\nShe stood over me awkwardly while I picked something else... Then I see omelettes on other plates being brought out???\n\n45 minutes later and I have no food, no bread, no refills.. \n\nEmpty tables all around me. Very confused, hungry, and dissapointed.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-02", "description": "The guy that took our order was nice. En of story. \nHORRIBLE SERVICE. SLOOOOW. Waiters walking around doing nothing with ass faces. Food sitting on the countertop getting cold. \nOur food came in 4 turns and cold. We wait for an hour! And I asked for a scone which doesn't have to be cooked!!\nOne omelette, one quiche, one egg with lox and a scone $68!!!!\nI went because my mother in law wanted to, I didn't want because I already had another bad experience.", "author": "Masama S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "Their cappuccino is the best! Prices are a bit steep though. Portions on the small side. The bread is yum. Take it to go. Very nice outside area. Big inside seating area.", "author": "A J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "This is my go to spot every morning for my caffeine fix  and breakfast. The staff is always friendly and the barista who usually makes my latte, jessany knows just how i like it and is always very friendly. It's nice to go to a place where there happy to see you and the staff is welcoming.", "author": "Claire S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-19", "description": "Guys. The service here. What is the problem? Why does everyone seem like it's their first day on the job? On any job?\n\nSeriously, I'm dying to know. Is the pay that bad? Is the set up and breakdown that unreasonable? I'm sure the clientele can be difficult, but come on. It takes 20 minutes to get a cup of soup to go. Sullen waiters mill around aimlessly without making eye contact. Employees are helpless when asked even the most basic questions about the menu.\n\nSince moving into the neighborhood, the staff here has been consistently slow, inexperienced, and incompetent. I just can't figure out why you can't hire people who at least pretend they know what they're doing or give half a crap about their jobs.", "author": "Kevin M."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Le Pain Quotidien", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "121 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Eu7F8tUmJesLkaP2lH2zCQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188583078"}