{"aggregateRating": {"reviewCount": 9, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "Here I am, back to my old neighborhood once again. Misdemeanor, ha? Interesting.\nLocated on the first floor of trendy Nu hotel, this sleek lounge fits right in with past and present of the area - or at least I think so. Clean lines of the bar table, outside patio area, and cushy corner chairs with small tables to get comfy. \nThe urban artwork lining the walls is remarkable, and it follows to the table with \"Brooklyn Love\" coasters.\nDrinks are fun - Golden Delish was indeed delish! Tapas were great. \nCharcuterie with freshest brie, prosciutto, some olives, pate and flat bread is perfect snack to share, and Mustard Seed Shrimp skewers with yogurt and diced cucumbers is light and flavorful.\nNice spot to stop by for a drink and a bite to eat on the way home from work.", "author": "Nadia Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "What kind of self respecting business mocks the suffering of others? Did they really think that \"Misdemeanor\" was a clever, ironic, hip name for an establishment located across the street from a prison and courthouse? This is the most insufferable demonstration of hipster stupidity I've seen in a long time. I boycott.", "author": "Ellen G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "\"misdemeanor\" is the most tone deaf new-to-brooklyn bullshit name for a place across the street from a prison. You can get good cocktails at a number of bars a few blocks south that may be just as insufferable, but slightly more self-aware.", "author": "Adam D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "Five Reasons I Love Misdemeanor:\n\n1. HAPPY HOUR. $3 off their small plates and discounted drinks makes it a STEAL. \n2. The Quiet Storm. A delicious cocktail named after my favorite Mobb Deep song.\n3. The name. Across from the detention center...I love that they're owning it.\n4. The tables on the street are perfect for unwinding in the sun.\n5. The surprising quality of the food, given the tiny little kitchen. The cashews are the perfect bar snack (and they give you a good amount), the pizzas are excellent bites, and the shrimp and pork belly/lamb buns are straight up delicious.\n\nIt doesn't hurt that I live right down the street.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "I had a blast here for their Cinco de Derby event (it was the Saturday after Cinco de Mayo and the day of the Kentucky Derby) how witty!! The servers were very attentive and made AMAZING margaritas.  The space is literally a hotel lobby- slash- bar with outdoor seating but really clean and not crowded.  They also have an art show going on there which is very interesting to check out, if you are a fan of modern art you will totally like the exhibits.  If you are in the neighborhood absolutely worth stopping by for a drink.  I shall be visiting again so see ya there!!!", "author": "Navi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Hey i have come to this place multiple times and continue to be amazed at why its not crowded.The front lounge ambience is different and colorful compared to most in a hote.You have great drinks that are carefully crafted with great quality liqour and mixers as the menu is crafted by employees only which is known for their drinks.Even better is the quality of their wines and price of them.This place is perfect for a chill date or conversation with friends.Honestly you will be crazy not to come here.", "author": "Lawrence C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-06", "description": "Tried going to this bar twice. The first time they said they weren't open for lunch. They said they only open at 4\n\nTried going at 5:30, after work and the bartender was running around trying to prep. She told us she would be with us in a minute. After 15 minutes, we decided it wasn't worth the wait and left.\n\nWe sat around awkwardly and talked while three other women were drinking wine. It was almost like they didn't want to serve us. I don't want to play the race card buttt...\n\nAlso, at the end of the day, it's still a hotel lobby so you have people checking in and trying to handle their luggage and it makes it kinda hard to relax.", "author": "Asmika D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-07", "description": "What Misdemeanor lacks in design it makes up for in style.\n\nA friend of mine was starting her DJ residency when we took the trip out there. The hotel refers to this space as a lounge, but it is really just the lobby of the hotel with a bar thrown in and some outdoor seating. They have tried to dress the space up with some kind of quad sectional sofa that looks more like an art piece, but a lobby is a lobby.\n\nIt's what Misdemeanor puts in the lobby that is remarkable. I've been a fan of my friends soulful house sets for years and her music works very well with the progressive Downtown Brooklyn crowd. The cocktails are quite good without being overly complicated or expensive. Their bar snacks, particularly the tempura shimp, are very satisfying. The experience and the service is so good that you'll almost forget you're just sitting in a lobby.\n\nI wouldn't make it a regular stop since I'm not in that part of Brooklyn much, but if you are you should definitely stop by.\n\nHave fun.\nG", "author": "Gamal H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "This place definitely has style. I came here for their Happy Hour special and got one of the tapas as well. The lamb pineapple bun, it was good but small. The bartender was really nice and attentive. They have no beers on tap :(. The chairs are comfortable.", "author": "Tiffany D."}], "servesCuisine": "Tapas/Small Plates", "priceRange": "$11-30", "name": "Misdemeanor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "85 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/UkvO6C4ZBRfIiZHFNwK1iA/ls.jpg", "@type": "Restaurant", "telephone": "+17188528585"}